{"mid": "ABoyAndHisDog", "IMDB_id": "tt0072730", "title": "A Boy and His Dog", "plot": "Opening: World War IV lasted five days. In the post-apocalyptic world of 2024, rover Vic (Don Johnson) hears a voice from his dog and communicates with him telepathically. The dog is called Blood (voiced by Tim McIntire), and he calls Vic \"Albert\". Blood is trying to find a female by scent for Vic, and Vic scavenges for food. Only Vic can hear the voice of Blood.As they travel, Blood recounts history and quizzes Vic on various topics in history including the four world wars, from World War I (1914-1918), World War II (1939-1945), World War III (1950-1983), which were a series of wars, also called the Cold War, between the free and unfree world (Korea, Vietnam, Indochina, Congo were among them), to World War IV, also called the Five-Day War, or the Nuclear War of 2007. The setting is what was once the ruins in and around Phoenix, Arizona. The area is a desert wasteland, populated by marauders and rovers who battle for food found in the tops of buildings that was once \"civilization\" where the desert sands have consumed most of the buildings. There are rumors that what civilization exists now is below ground for the past several years since the nuclear war. The people of these underground civilizations are called \"downunders\". Neither Vic nor Blood want to venture below to live. Blood finds women for Vic to rape, and Vic supplies Blood with food since he cannot hunt on his own.We learn Blood is a former police dog, and wants to find the \"promised land\", where farming is possible and several above-ground utopias are said to exist. Blood sniffs out a woman, but rovers have reached her first and have killed her after gang raping her. Vic begins to argue with Blood about his inability to find women. Blood wants to go \"over the hill\" to paradise. Vic promises that they'll go once Blood finds him another woman for Vic to have sex with.Some time later, Vic and Blood view a small group of scavengers, led by a brutal gang leader, a self-proclaimed \"king\" named Fellini (Ron Feinberg), who orders his group to dig up a stash of crates containing canned food. Temped by the food, Vic runs forward when Fellini and his men are all in the hole digging and steals some of the bags of canned food, shooting a few of Fellini's men who chase after him. However, Fellini orders his men to let Vic go, impressed by the young man's courage and ablity. As Vic and Blood run away, they are watched from a distance by a small group of mysterious men (unseen from the waist up), where one of whom comments that he just might do. They decide to \"put out the cheese\" to trap Vic.That evening, Vic and Blood go to an outdoor makeshift movie theater in a shantytown camp to watch some vintage stag films, and Blood smells a female. She is in attendance at the stag film, but in disguise as a male solo. Vic follows the girl to an underground building which is an abandoned YMCA, and he watches her dress. He attacks her and orders her to undress so he can rape her. While she undresses for him, she tells him her name is Quilla June Holmes (Susanne Benton). Blood interrupts them to advise of mauraders nearby. Quilla realizes Blood can talk to Vic telepathicaly. She attempts to communicate with the dog, but Blood just barks at her. Meanwhile, Vic ambushes the mauraders and Blood joins in, killing some of them. Vic imitates the \"screamers\" (radiation victims) and Blood battles another dog. Vic is about to be shot from behind, and Quilla saves him. The rest of the mauraders run off, but Blood is hurt. Then, the real screamers show up, forcing Vic and Quilla to hide and wait in a storage tank. Vic and Quilla make love repeatedly.Later when morning arrives, Blood goes off to see if the screamers have left, and Quilla tries to convince Vic to go \"down under\". Blood wants Vic to leave her, and they argue. When Vic goes back to see Quilla, she knocks him out and flees. Vic decides to track her down, but Blood thinks (rightly) that it's a trap. After following Quilla's footprints throught the desert, Vic and Blood come across a small steel obsticle standing in the middle of the desert which leads \"down under\". Using a key card that Quilla left behind, Vic uses it to open the steel door to the underground. Vic goes down under, leaving Blood alone and injured.Vic climbs down several long ladders through what appears to be an abandoned missle silo, past mysterious machinery, then opens a metal door to find an underground cemetery. He is captured and washed by a clown-faced robot dressed in farmer's garb called Michael (Hal Baylor) with several strangers looking on. After given clean farmer clothes, Vic is dragged by Michael through a local park, walking past picnicers, giggling young girls, a marching band playing Stars and Stripes, and barbershop quartets, all wearing clown face makeup. What we get a glimpse of is a surreal, bizarre re-creation of life in the rural Midwest during the early 20th century with a populace of robotic conformists. Vic stops to talk to a dog similar to Blood, but the dog does not respond. The bizzare underground community wear white clown-faces to distingish themselves from above-grounders that dare to tresspass in their community. Loudspeakers continuously blare announcements, pontificate morals for daily living, and down home recipes.In a church/town hall building, residents may attend the \"awards and punishments\" at their own discretion. It is led by Lou Craddock (Jason Robards) who reviews blueprints for buildings to be built and passes judgements on transgressors, assisted by Mez Smith (Helene Winston) and Doctor Moore (Alvy Moore), the clownish but cold-hearted rulers of this underground town. Severe judgement (death) is called \"farming out\" or \"going to 3\". We learn the underground town is called Topeka. Quilla arrives, and she asks to be put on the committee having served her purpose of luring Vic to their underground community. Lou refuses by claiming that she is too young to rule and arranges for her to get married instead. Quilla leaves and vents her anger to her boyfriend Gary (Michael Rupert) and makes plans to overthrow the ruthless committee, but in the meantime be a good girl and play it safe. At the same time, the dog is brought into the church where he is interrogated by Lou asking if he told Vic anything. But when the dog does not respond, Lou orders the dog to be sent to the farm.Vic is brought before Lou, and Doctor Moore reads his medical statistics. Lou tells the unruly Vic that he and the members of the Topeka Committee have been watching him on the surface for days now, and that Vic has been chosen to help re-populate Topeka, as its male residents are sterile and/or impotent due to their ridiculously wholesome, clean, and subterranean living. Vic laughs hysterically, thinking he'll get to sleep with dozens of women. The sinister Topeka Committee member Mez laughs back hysterically indicating to Vic that sleeping with dozens of women is not what they have in mind.In the next scene, a couple is married in a hospital room, and Vic is in attendance (strapped to a gurney) to provide semen. Quilla arrives and rescues him, subduing the doctors. She tells him he is only going to be allowed to impregnate 35 girls, then will be put to death. They rush out of the hospital with the help of Gary, and find Vic's guns, then Vic starts to leave. Quilla tries to stop him to help her overthrow the dictatorship of Topeka, but Vic wants to return to Blood. The Committee convenes at the town square and begins broadcasting the sentence on Quilla and her friends - the farm. Gary and all of his rebel friends are attacked and killed by Michael. Vic fires at Michael, but the bullets have no effect. One of Vic's gunshots disables \"Michael\", who is a robot. Vic and Quilla flee firing gunshots at Michael while the committee remains indifferent and begins planning for its next \"donor\". Lou also orders that another Michael security robot be exhumed from the storage warehouse, with his clowish smile wipped off.Vic and Quilla return to the surface where it is now night. Relieved that the Topeka citizens are not chasing after them, they look around and they find Blood nearby, who is dying. But conditions on the surface have become worse with Fellini and his gang have taken over for the most part. He hasen't eaten for days and will die soon unless Vic provides him with food. Quilla tells Vic that it's too late to save Blood and Vic should come away with her far away if he really loves her. Vic must choose... he looks at Blood, then looks back at Quilla.In the final shot, Vic and Blood are putting out a campfire near the steel dome. Having eaten, Blood feels better and he and Vic walk away from their campfire into the sunrise of dawn. Quilla is nowhere to be seen, but pieces of her wedding gown are seen strewn around the dying campfire. Vic and Blood talk about how Vic was touched by the fact that Quilla June picked him to be with instead of the dictatorship committee of Topeka. Blood remarks, \"She had marvelous judgement... if not a particularly good taste (!)\" The boy and his dog laugh at the pun and they both walk away \"over the hill\" toward paradise."}