{"mid": "AbrahamLincolnVampireHunter", "IMDB_id": "tt1611224", "title": "Abraham Lincoln: Vampire Hunter", "plot": "In 1818, Abraham Lincoln (Benjamin Walker) lives in Indiana with his parents, Nancy (Robin McLeavy) and Thomas (Joseph Mawle), who work at a plantation owned by Jack Barts (Marton Csokas). There, Lincoln rushes to the aid of his friend, a young African American boy, William Johnson (Anthony Mackie), being beaten by a slaver. Because of his son's actions, Thomas is fired. That night, Lincoln sees Barts break into his house and attack Nancy. She falls ill the following day, and dies shortly afterwards. Thomas tells Lincoln that Barts poisoned Nancy.\nNine years later in 1827, a vengeful Lincoln tries to kill Barts at the docks, but Barts, who is actually a vampire, overpowers him. However, before Barts can kill him, Lincoln is rescued by Henry Sturgess (Dominic Cooper). Sturgess explains that vampires exist, and offers to teach Lincoln to be a vampire hunter. Lincoln accepts and, after a decade of training, travels to Springfield, Illinois. During his training, Sturgess tells Lincoln that the vampires in America descend from Adam (Rufus Sewell), a vampire who owns a plantation in New Orleans with his sister, Vadoma (Erin Wasson). Sturgess also tells Lincoln of the vampires' weakness, silver, and presents him with a silver pocket watch.\nIn Springfield, Lincoln befriends shopkeeper Joshua Speed (Jimmi Simpson), and meets Mary Todd (Mary Elizabeth Winstead). Though Sturgess warned him not to form any close relationships, Lincoln develops romantic feelings for Mary.\nLincoln successfully finds and defeats Barts. Before dying, Barts reveals that Sturgess is also a vampire. Lincoln confronts Sturgess, who reveals that, several years ago, he was attacked and bitten by Adam. Because Sturgess' soul was impure, he became a vampire, and that prevented him from harming Adam or any other vampire (since \"Only the living can kill the dead\"). Sturgess has since been training vampire hunters, hoping to destroy Adam.\nDisappointed, Lincoln decides to abandon his mission. However, Adam learns of his activities and kidnaps Johnson to lure Lincoln into a trap at his plantation. Adam captures Lincoln and tries to recruit him, revealing his plans to turn the United States into a nation of the undead. Speed rescues his friends, and they escape to Ohio.\nLincoln marries Mary and begins his political career, campaigning to abolish slavery. It is at this time in the movie Lincoln symbolically puts on the top hat which he dons the rest of the movie. Sturgess warns Lincoln that the slave trade keeps vampires under control, as vampires use slaves for food, and if Lincoln interferes, the vampires will retaliate. After Lincoln's election as President of the United States of America, he moves to the White House with Mary, where they have a son, William Wallace Lincoln (Cameron M. Brown). William is later bitten by Vadoma and dies.\nConfederate President Jefferson Davis (John Rothman) convinces Adam to deploy his vampires on the front lines. Lincoln orders the confiscation of all the silverware in the area and has it melted to produce silver weapons. Speed, believing that Lincoln is tearing the nation apart, defects and informs Adam that Lincoln will transport the silver by train.\nOn the train, Adam and Vadoma, who have set fire to the upcoming trestle, attack Lincoln, Sturgess, and Johnson. During the fight, in which Speed is killed, Adam learns that the train holds only rocks. Lincoln reveals that Speed's betrayal was a ruse to lure Adam into a trap. Lincoln uses his watch to stab Adam, killing him, and the three escape the train before it explodes. Meanwhile, Mary and the ex-slaves have transported the silver to Gettysburg through the Underground Railroad.\nThe now leaderless Confederate vampires stage a final, massive assault and are met head on by the Union. Armed with their silver weapons, the Union soldiers destroy the vampires and eventually win the battle. During that battle, Mary confronts Vadoma, the vampire that killed her son, and kills her.\nNearly two years later, on April 14, 1865, Sturgess tells Lincoln that the remaining vampires have fled the country. Sturgess tries to convince Lincoln to allow him to turn Lincoln into a vampire, so that he can become immortal and continue to fight vampires, but Lincoln declines.\nIn modern times, Sturgess approaches a man at a bar in Washington, D.C. as he once approached Lincoln."}