{"mid": "ABridgeTooFar", "IMDB_id": "tt0075784", "title": "A Bridge Too Far", "plot": "Operation Market Garden envisions 35,000 men being flown 300 miles from air bases in England and dropped behind enemy lines in the Netherlands. Two divisions of U.S. paratroopers, the 82nd and 101st Airborne, are responsible for securing the road and bridges as far as Nijmegen. A British division, the 1st Airborne, under Major-General Roy Urquhart, is to land near Arnhem and hold both sides of the bridge there, backed by a brigade of Polish paratroopers under General Stanisław Sosabowski. XXX Armoured Corps are to push up the road over the bridges captured by the American paratroopers and reach Arnhem two days after the drop.\nThe British are to land using gliders near Arnhem. When General Urquhart briefs his officers, some of them are surprised they are going to attempt a landing so far from the bridge. The consensus among the British top brass is that resistance will consist entirely of \"Hitler Youth or old men on bicycles\". Although reconnaissance photos show German tanks at Arnhem, General Browning dismisses them and also ignores reports from the Dutch underground. He does not want to be the one to tell Field Marshall Montgomery of any doubts since many previous airborne operations had been cancelled. Though British officers note that the portable radios are not likely to work for the long distance from the drop zone to the Arnhem Bridge, they choose not to convey their concerns up a chain of command intent on silencing all doubt.\nSpeed is the vital factor. Arnhem’s is the crucial bridge, the last means of escape for the German forces in the Netherlands and an excellent route to Germany for Allied forces. The road to it, however, is only a single highway linking the various key bridges - trucks and tanks have to squeeze to the shoulder to pass. The road is also elevated, causing anything moving on the road to stand out.\nThe airborne drops catch the Germans by surprise and there is little resistance. Most of the men come down safely and assemble quickly, but the Son bridge is blown up by the Germans just before the 101st Airborne secures it. Then, soon after landing, troubles beset Urquhart's division. Many of the Jeeps either do not arrive by their gliders at all or are shot up in an ambush. Their radio sets are also useless.\nXXX Corps' progress to relieve them is slowed by German resistance, the narrowness of the highway and the need to construct a Bailey bridge to replace the one destroyed at Son. They are then halted at Nijmegen. There, soldiers of the 82nd Airborne Division perform a dangerous daylight river crossing in flimsy canvas-and-wood assault boats and the Nijmegen bridge is captured, but XXX Corps has to wait several hours for infantry to secure the town.\nThe Germans close in on the isolated British paratroops occupying part of Arnhem at the bridge, although armored attacks are repelled. Urquhart had been separated from his men and the supply drop zones overrun by the Germans. Finally, Sosabowski's troops, held up by fog in England, enter the battle too late and are unable to reinforce the British. After days of house-to-house fighting, pitted against crack SS infantry and panzers, the outgunned troops are captured or forced to withdraw. Arnhem itself is indiscriminately razed in the fighting.\nUrquhart escapes the battle zone with fewer than a fifth of his original ten thousand crack troops; those who were too badly injured to flee stay behind and cover the withdrawal, surrendering afterwards. On arriving at British headquarters, Urquhart confronts Browning about his personal sentiments regarding the operation: does he think it went as well as was being claimed by Montgomery? Browning's reply (and the film's last line of dialogue) contradicts his earlier optimism: \"Well, as you know, I always felt we tried to go a bridge too far.\"\nIn the film's final scene, a young Dutch woman, whose elegant and beautifully furnished home was used as an overflow hospital by the British, abandons the mostly destroyed house. Passing through the front yard, now converted to a graveyard for fallen troops, she and her children trek along the high riverbank, with her father, an elderly doctor, pushing a few salvaged possessions in a wheelbarrow."}