{"mid": "AbsolutelyAnything", "IMDB_id": "tt1727770", "title": "Absolutely Anything", "plot": "Decades after being launched into space, a space probe containing information about the human race and a map to Earth is found by four aliens that make up the \"galactic council\". They debate on whether to destroy the earth or make humanity a member of the council, instead relying on \"standard galactic protocol\" to decide. They will give one human (chosen at random) the ability to do absolutely anything he or she wants. After ten days, if the powers have been used for good, the Aliens will spare earth and make humanity a member of the council. If the powers are used for evil, Earth will be destroyed for the moral improvement for the galaxy.\nThe human is chosen and revealed to be Neil Clarke (Simon Pegg) a secondary school teacher who is both struggling at his job, due to the Headmaster, Mr. Robinson (Eddie Izzard); and with his lack of a girlfriend, although he has a crush on author agency employee, Catherine West (Kate Beckinsale), who lives underneath him in the apartment block. At first, oblivious to the powers he has, Neil accidentally causes an alien spaceship to destroy a classroom within the school, killing the entire class in the process. The galactic council scolds the alien that blew up the classroom, who responds by saying that out of the millions of species the council has evaluated, none have ever passed and all have been destroyed.\nPerplexed and anxious, Neil goes home and slowly realises he can do anything after causing his dog, Dennis's waste to clean itself up, and causing spilt whisky to flow out of the drain and back into the bottle. He asks that \"everyone who died come back to life\" and unknowingly causes everyone who has ever died ever to be resurrected, resulting in a zombie apocalypse, he reverses this and asks that the explosion never happened, sending himself back in time to the previous day. He then confirms his suspicions by causing the PE teacher Miss Pringle (Emma Pierson) to worship his friend, Ray (Sanjeev Bhaskar) whereas before, she was repulsed by him.\nOver the coming days, Neil uses his power for personal gain by giving himself a more muscular body, increasing his penis size, making Mr. Robinson be nice to him and giving Dennis the ability to speak (voice of Robin Williams). One night, the galactic power the aliens possess fails momentarily, meaning Neil cannot do anything. This happens just as Neil asks that Catherine be madly in love with him, and coincidentally a drunk Catherine knocks at his door at that moment, after being encouraged to sleep with Neil by a friend. They spend the night together as a result and are seen by Colonel Grant (Rob Riggle), an American soldier who has been stalking Catherine.\nThe next day, Catherine goes to Neil's apartment to speak to him, where Dennis shouts from the kitchen that he loves Neil and he should \"Shag the Bitch!\". Disgusted and now thinking that Neil is gay, Catherine storms out with Neil chasing after her. Ray appears and states that Miss Pringle doesn't worship him romantically, she actually thinks he is a god and has formed a religion based on him. That night, Catherine returns home to find Colonel Grant waiting in her apartment for her, and she locks him in. Neil appears and offers to cook dinner for her, which she accepts. Grant crashes the meal and Catherine storms out due to the two fighting, Neil incapacitates Grant by breaking then fixing his arm and then convinces Grant that he has powers. Grant knocks Neil unconscious and kidnaps him and Dennis, when Neil wakes up, Grant forces him to grant a list of selfish and pointless wishes, threatening to shoot Dennis if Neil refuses.\nCatherine and Ray track Neil down to the apartment Grant is renting and rescue Neil, but not before Neil makes Catherine fall madly in love with Grant. When free, Neil reverses all of the wishes he granted Grant and also stops Miss Pringle from worshipping Ray. Upon getting home, Catherine angrily tells Neil that she could never love anyone who could make her do whatever they wanted, whenever they wanted to do it. Disheartened, Neil decides to use his powers to solve the world's problems; he gives everyone in the world as much food as they want, he gives everyone in the world their own dream house, and removes any reason for anyone to go to war.\nHowever, this soon backfires when worldwide obesity rates rise, every piece of uninhabited land in the world is developed on, and several countries declare war on each other for no reason at all. Disillusioned, Neil goes to Hammersmith Bridge with the intention of committing suicide, but as he jumps into the River Thames, Dennis jumps in after him and Neil is forced to swim them both out of the river. Sitting on a bench on Hampstead Heath overlooking London, Dennis says that Neil should give the power to him, as he never thinks of anything selfish and he loves taking orders, which Neil happily does.\nMeanwhile, the aliens finish their evaluation and decide that Earth is not worthy, revealing that they view greedy and evil acts as strong and thoughtful acts as weak. They therefore decide to destroy the planet, but just before they can, Dennis asks that the source of the power be destroyed, causing a laser beam shooting towards Earth to bounce back to the alien's ship, killing them all and destroying the galactic power. Full of confidence and excitement for not having the powers any more, Neil asks Catherine out, which she agrees to."}