{"mid": "AbsolutePower", "IMDB_id": "tt0118548", "title": "Absolute Power", "plot": "During the course of a burglary, master jewel thief Luther Whitney (Clint Eastwood) is forced to hide upon the unexpected arrival of Christy Sullivan (Melora Hardin), the beautiful young wife of elderly billionaire Walter Sullivan (E. G. Marshall), during her drunken rendezvous with Alan Richmond (Gene Hackman), the President of the United States. Walter Sullivan is Richmond's friend and financial supporter and the owner of the mansion Luther has broken into.\nHiding behind a one-way mirror, Luther watches as Richmond becomes sexually violent towards Christy when he playfully slaps her across the face. When she retaliates by slapping him back, Richmond becomes angry and aggressively assaults her. When she attacks him with a letter opener in self-defense, Secret Service agents Bill Burton (Scott Glenn) and Tim Collin (Dennis Haysbert) shoot her to death. Chief of Staff Gloria Russell (Judy Davis) arrives and makes the scene appear as if a burglar killed Sullivan's wife. Luther escapes with some valuables as well as the bloody letter opener.\nThe next day, Detective Seth Frank (Ed Harris) begins his investigation of the crime. As Tim had noted Luther's license plate number during the chase, Luther quickly becomes a prime suspect in the burglary because of his reputation as a thief, but Frank does not believe it likely he murdered Christy. Just as Luther is about to flee the country, he sees President Richmond on television, publicly commiserating with Walter on his loss. Incensed by the fake sympathy, Luther decides to bring the President to justice. Meanwhile, Burton asks Frank to keep him informed about the case while a Secret Service agent wiretaps Frank's office telephone.\nLuther's estranged daughter Kate (Laura Linney), who works as a prosecutor, accompanies Detective Frank to Luther's home to search for clues. Photographs in the house indicate that Luther has secretly been watching her for years. She still suspects Luther of the crime, and therefore agrees to set him up. Frank guarantees Luther's safety, but through the wiretap Burton learns of the plan and Collin says that he will kill Luther at the cafe. Someone also tips off Walter, who hires a hitman (Richard Jenkins) to kill Luther. The two snipers, each unaware of the other, try to shoot Luther when he arrives at an outdoor cafe to meet his daughter. But they both miss, and Luther escapes through the police cordon because he came prepared, wearing the uniform of a police officer beneath his coat. Luther later explains to Kate exactly how Christy was killed, and by whom.\nLuther begins to taunt Chief of Staff Russell, first by sending her a photograph of the letter opener, then tricking her into wearing Christy's necklace in public. Correctly suspecting that Kate knows the truth, President Richmond elects to have her killed. Luther learns from Detective Frank that the Secret Service has taken over surveillance of Kate, so he races back to Washington D.C. to protect her. He arrives at her jogging path just moments after Collin has used his SUV to push her and her car off a cliff. Collin tries to kill her again at the hospital, approaching her bed with a poison-filled syringe. Luther, who lies in waiting, subdues Collin by jabbing him in the neck with a syringe of his own. Collin pleads for mercy, but Luther says he's \"fresh out,\" delivering a fatal dose.\nLuther finds out that Sullivan gave no reason publicly why Christy stayed home; on the night of her murder, Christy said to Richmond that she told Walter she was sick. He incapacitates Walter's chauffeur and replaces him, telling Walter what happened on the night of the murder. Walter is unconvinced until Luther explains how Richmond lied in a speech by citing Christy's excuse for staying home, which he could only have learned from her. He shows Walter the letter opener with Richmond's blood and fingerprints on it, and also informs him that he has since returned the items stolen the night his wife was killed.\nLuther stops the car and hands over the letter opener, dropping off Walter outside the White House. A trusted Walter is able to get through security with it and enter the Oval Office. Meanwhile, alerted by Luther that his phones have been bugged, Frank discovers that a remorseful Burton has committed suicide, and uses the evidence Burton left behind to arrest Russell. On the television news in the next morning comes the shocking news, \"confirmed\" by Walter, that the President has committed suicide by stabbing himself to death. Luther is happy to know that Walter got justice after all.\nBack at the hospital, sketching on a pad, Luther watches over Kate in her hospital bed. Detective Frank visits briefly, whereupon Luther suggests to Kate that she invite Frank to dinner sometime, and then continues to draw a new picture of his daughter."}