{"mid": "AceInTheHole", "IMDB_id": "tt0043338", "title": "Ace in the Hole", "plot": "Chuck Tatum (Kirk Douglas) is a fiercely ambitious, self-centered, wisecracking, down-on-his-luck reporter who has worked his way down the ladder. He has come west to New Mexico from New York City, along the way having been fired from eleven newspapers for libel, adultery, and heavy drinking, among other charges. Now that his car has broken down and Tatum is broke, he talks his way into a reporting job for the Albuquerque Sun-Bulletin, a paper of little consequence.\nTatum stays sober and works there uneventfully for a year. Then while unhappily on assignment to cover a rattlesnake hunt, he learns about Leo Minosa (Richard Benedict), a local man who has become trapped in a cave collapse while gathering ancient Indian artifacts.\nSensing a golden opportunity, Tatum manipulates the rescue effort, convincing an unscrupulous sheriff to pressure the construction contractor charged with the rescue into drilling from above, rather than shoring up the existing passages, so that Tatum can prolong his stay on the front pages of newspapers nationwide.\nLorraine (Jan Sterling), the victim's wife, goes along with the reporter's scheme. She is eager to leave Leo and their struggling business, a combination trading post and restaurant in the middle of nowhere. Thanks to the publicity Tatum generates, she experiences a financial windfall, particularly from thousands of tourists who come to witness the rescue.\nHerbie Cook (Robert Arthur), the newspaper's young photographer, slowly loses his idealism as he follows Tatum's lead and envisions himself selling pictures to Look or Life. The editor of the Albuquerque Sun-Bulletin tries to talk some sense into his employees, but Tatum quits on the spot, having sold the exclusive rights to his copy to a New York editor for $1000 per day and, more importantly, his old job back.\nThousands flock to the town. The rescue site literally becomes a carnival, with rides, entertainment, songs about Leo, even games of chance. Tatum begins drinking again. He takes up with Lorraine and is greeted heroically by the crowd each time he returns from visiting poor Leo in the cave.\nAfter five days of drilling, the party atmosphere ends abruptly. Upon learning that Leo is fading fast, Tatum belatedly tries to get the contractor to switch back to the quicker procedure of shoring up the walls of the cave, but the vibration from drilling has made this impossible.\nTatum has mistreated Leo's wife once too often as well, and she stabs him with a pair of scissors. Tatum gets the local priest, and takes him into the cave to administer Last Rites. Leo dies.\nTatum has neglected to send copy to the New York editor and he is fired. He calls the editor and tries to confess to killing Leo by delaying the rescue, but the editor hangs up on him. Tatum barely reaches his old office in Albuquerque. He enters calling for publisher Booth (Porter Hall). As Booth walks out of his office to deal with him, Tatum offers to work for nothing, saying that he's a 1000-dollar a day newspaperman. But before he can say any more to Booth, Tatum falls dead on to the floor."}