{"mid": "ACharlieBrownChristmas", "IMDB_id": "tt0059026", "title": "A Charlie Brown Christmas", "plot": "The special begins on a frozen pond, put to use as an ice rink by the Peanuts cast, who skate together as the song \"Christmas Time Is Here\" is heard over the opening credits.\nIt's Christmas season, and Charlie Brown is depressed. He tells Linus about his unhappiness, citing his dismay with the over-commercialization of Christmas and his inability to grasp what Christmas is all about. Linus dismisses Charlie Brown's feelings as one of Charlie Brown's common moods. Charlie Brown's depression is only exacerbated by the goings-on in the Peanuts neighborhood. After the discussion, while the Peanuts cast skate, Snoopy appears. He grabs the cast and skates with them in a line, then slides on the ice before Charlie Brown and Linus come out skating. Snoopy grabs Linus's blanket and picks up Charlie Brown. Snoopy spins the blanket around, releasing Charlie Brown in the process. Charlie Brown hits a tree and snow falls on him before \"A Charlie Brown Christmas\" appears on the screen.\nA short time later, Charlie Brown finds his mailbox empty of Christmas cards and sarcastically thanks Violet for the card she never sent him, but Violet just uses the opportunity to put Charlie Brown down again. Feeling dejected, Charlie Brown visits Lucy in her psychiatric booth. Lucy, after attempting to label him with various phobias and admitting she wants real estate as a Christmas gift, determines that Charlie Brown needs more involvement to combat his depression. She recommends that he direct a Christmas play. Charlie Brown is excited at the chance to direct, and Lucy promises to help him. On his way to the auditorium, Charlie Brown finds Snoopy decorating his doghouse for a neighborhood lights and display contest, and laments that even his dog is focusing on the commercial aspects of Christmas. Continuing onward, he runs into his sister Sally, who asks him to write her letter to Santa Claus. When she hints at having an extremely long and specific list of requests, and says she will accept money as a substitute (\"tens and twenties,\" a massive amount for a child of Sally's age in the 1960s), Charlie Brown becomes even more dismayed.\nCharlie Brown arrives at the rehearsal, but he is unable to control the situation as the uncooperative Peanuts kids are more interested in modernizing the play with dancing and lively music, mainly Schroeder's rendition of \"Linus and Lucy.\"\nLucy, angling to be the Christmas Queen, is also the Script Girl, handing out scripts. She and Snoopy would get into a fight after the latter mocked her. He slurps her and she, as was often the case when Snoopy kissed or licked her, ran off screaming that she had gotten dog germs, demanding hot water, disinfectant and iodine. She would also argue with Linus about his blanket and demands that he give it up. He uses it as a costume, which infuriates Lucy yet again.\nThinking the play requires \"the proper mood,\" Charlie Brown decides they need a Christmas tree. Lucy takes over direction of the play and dispatches Charlie Brown to get a \"big, shiny aluminum tree.\" With Linus in tow, Charlie Brown sets off on his quest, as an \"O Tannenbaum\" instrumental plays in the background. When they get to the tree market, filled with numerous trees fitting Lucy's description, Charlie Brown zeroes in on the only real tree on the lot – a tiny sapling. Linus is unsure about Charlie Brown's choice, but Charlie Brown is convinced that after decorating it, it will be just right for the play – \"and besides,\" he says, \"I think it needs me.\" They return to the auditorium with the tree, at which point the children (particularly the girls and Snoopy) ridicule Charlie Brown for selecting such a small and shabby Christmas tree. Every member of the Peanuts gang except Linus laughs at Charlie Brown. At his wit's end, Charlie Brown loudly asks if anybody really knows what Christmas is all about. Linus, standing alone on the stage, says he can tell Charlie Brown what Christmas is about, and recites the annunciation to the shepherds from the Gospel of Luke, chapter 2, verses 8 through 14, as translated by the Authorized King James Version:\n\"8And there were in the same country shepherds abiding in the field, keeping watch over their flock by night.9And, lo, the angel of the Lord came upon them, and the glory of the Lord shone round about them: and they were sore afraid.10And the angel said unto them, Fear not; for, behold, I bring you tidings of great joy, which shall be to all people.11For unto you is born this day in the city of David a Savior, which is Christ the Lord.12And this shall be a sign unto you: Ye shall find the babe wrapped in swaddling clothes, lying in a manger.13And suddenly there was with the angel a multitude of the heavenly host praising God, and saying,14Glory to God in the highest, and on earth peace and goodwill towards men.\"\n\"...That's what Christmas is all about, Charlie Brown.\"\nCharlie Brown smiles, quietly picks up the little tree, and walks out of the auditorium. After reflecting on what Linus had said, he decides to take the tree home to decorate, to show the others it will work in the play. When he arrives, he stops at Snoopy's decorated doghouse, which now sports a first prize blue ribbon for winning the display contest. He puts an ornamental ball from the doghouse on the top of his tree. The branch, with the ball still on it, promptly flops over to one side instead of remaining upright, prompting Charlie Brown to declare \"I've killed it\" and run off in disgust at his perpetual failure. Linus and the rest of the Peanuts gang (who have all become guilty for laughing at Charlie Brown) arrive outside Snoopy's doghouse. Linus gently props the drooping branch back in its upright position by wrapping his blanket around the tree. The group add the remaining decorations from Snoopy's doghouse to the tree, and Lucy admits that the tree does look nice. They start humming \"Hark! The Herald Angels Sing\". Charlie Brown returns, surprised at the humming and the redecorated tree, as his peers greet him with a joyous \"Merry Christmas, Charlie Brown!\" The entire group begins to sing the first verse of \"Hark! The Herald Angels Sing,\" and Charlie Brown joins them as the special ends."}