{"mid": "ACloseShave", "IMDB_id": "tt0112691", "title": "A Close Shave", "plot": "In the middle of the night, a small sheep escapes from a mysterious lorry (truck) and enters the house of Wallace and Gromit, who are currently running a window-cleaning business. The next morning, Wallace and Gromit fail to notice the sheep chewing at their food and furniture, as well as their new Porridge Gun, before they leave for work.\nWhile they clean the windows of a wool shop, Wallace meets and falls in love with Wendolene Ramsbottom, the shopkeeper. Wendolene mentions that she inherited the shop from her father who was also an inventor and owns a sinister dog named Preston, who runs a sheep rustling scheme to supply the shop. After returning from work, they finally discover the little lost sheep, who has wrecked their furniture and decorations.\nWallace puts the sheep into one of his inventions: the Knit-o-Matic, a machine for washing and shearing sheep and knitting the wool into jumpers. Gromit programs the machine to give a wash, but a fault causes the sheep to be sucked into the rest of the machine and sheared. When the sheep emerges, Wallace names him \"Shaun\" (a pun on the word \"shorn\") and dresses him in the jumper it knitted. Preston spies on the scene while hiding in a flood drain and after they leave, he sneaks in and steals the design blueprints for the Knit-o-Matic.\nThe next day, Wallace pays Wendolene another visit. Gromit attempts to investigate and find out what Preston is doing, but ends up getting captured by Preston and framed for the sheep rustling. Gromit is arrested and sentenced to life in prison while Wallace finds his house overrun with sheep. Wallace, Shaun and the other sheep rescue Gromit from prison and they hide out in the fields. Wendolene and Preston arrive in the lorry and round up the sheep. Wendolene turns against Preston and demands that he should put an end to the rustling, revealing that Preston intends to use the sheep to make “dog meat”. Preston locks Wendolene in the lorry with the captured sheep and drives away.\nWallace and Gromit, who have been spying on the scene, give chase on their motorcycle. The sidecar Gromit rides in separates, rushes down another road and off the edge of a 2000-foot cliff. Gromit saves himself by activating the sidecar's ability to turn into an aeroplane, and flies after Wallace's motorbike and the lorry. Their attempts to catch Preston fail, and Wallace instead gets himself trapped in the lorry. The captives are transported to Preston's factory, where Preston has used the stolen blueprints to build a giant replica of the Knit-o-Matic machine. The captives are loaded into the wash basin, with Shaun escaping, and Preston pulls out the nozzle to suck them into the shearing machine.\nAs they fight against the suction, Shaun activates some neon signs, revealing the factory's location to Gromit, who then flies in and attacks Preston with the porridge gun. Shaun then pulls the nozzle away to suck Preston into the Knit-o-Matic, which Gromit programs to give a \"Close Shave\". Wendolene reveals that Preston is a malfunctioning \"cyber dog\" built by her father, that has \"turned out evil\".\nPreston breaks out of the machine with his fake fur ripped off, revealing his robotic form. Unable to see after being dressed in a jumper knitted out of his fake fur, Preston accidentally loads himself and Gromit onto the conveyor belt of his \"Mutton-o-Matic\" mincing machine. Wallace attempts to turn the machine off but inadvertently loads everyone else on as well (except Shaun). As they all fight against the conveyor belt, Shaun swings over them on an anvil and knocks Preston into the machine.\nGromit is exonerated from all charges of the thefts, Wallace has rebuilt Preston back to the harmless pet he used to be, and Wendolene comes by to thank him. However, when Wallace invites her in to have cheese, he discovers that she dislikes cheese, which brings her out in a rash. This is greatly to his dismay (\"Not even Wensleydale?\") and Wendolene says goodbye and leaves. The film ends with Wallace finding Shaun eating his cheese."}