{"mid": "ActionJackson", "IMDB_id": "tt0094612", "title": "Action Jackson", "plot": "Vishi (Ajay Devgn) is a small-time crook who would do anything for money. He falls in love with Khushi (Sonakshi Sinha), a simple HR executive, who then begins a relationship with him. One day, Vishi, who frequently gets involved in fights, publicly beats up a street gangster, who later seeks a revenge attack with his gang. The gangster and his gang brutally beat up Vishi, and easily escape the scene. It is then revealed that the person they had beaten is actually Vishi's lookalike, Jai. The goons escape when they hear the siren, and Vishi is found alive on bike, then the same goons gets beaten brutally by Vishi. Khushi tries to explain to Vishi that she loves him, he understands and they both start falling in love. On another occasion, a police inspector arrests Jai and hands him over to a group of gangsters led by Pedro (Ketan Karande). Jai single-handedly kills them all and is revealed to be a professional assassin and previous right-hand man of underworld criminal Xavier Fonseca (Anandaraj), nicknamed AJ. After AJ single-handedly rescued Xavier's sister Marina (Manasvi Mamgai) from a bunch of kidnappers, Marina falls for Jai but he rejects her as he is been married to Anusha (Yami Gautam).\nAngered, Xavier tries to kill Anusha twice to get AJ married to Marina, which leaves her brutally injured. Jai then escaped to India and is in the process of getting her treated. When Vishi spots Jai, he reveals his identity and story to Vishi. Jai then requests Vishi to go to Bangkok disguised as AJ to fool Xavier and his sister; meanwhile AJ makes time to get his wife operated on, as she is expecting a baby. Vishi agrees to help and goes to Bangkok along with his friend Musa (Kunaal Roy Kapur). Meanwhile, Insp. Shirke finds AJ's lookalike and tries to inform Xavier but ended up murdered. The style of murder triggers suspicion to Xavier. Marina tortures Musa to know the truth. He reveals that Vishi is the one who masqueraded as AJ. Xavier hatches a plan to bring AJ to Bangkok by kidnapping his wife, baby and lookalike and threatens to kill all three of them. It is revealed up that Vishi is actually in Mumbai and AJ and himself switched their places in the airport at time after the job is done. AJ reaches the spot and kills all Xavier's henchmen, Xavier, Marina and unfortunately the baby dies in the blast while AJ and Anusha escape. Later it was revealed to be safe who was rescued by one of a man (Razzak Khan) of Xavier. The film ends with AJ and Vishi meeting at airport and Anusha requests Vishi to marry Khushi soon. It even shows that Musa's hand is broken and they are seen together as AJ with Anusha and Vishi with Khushi and Musa. While credit rolls it shows Prabhudeva and Ajay Devgan dancing together in the theme song of AJ."}