{"mid": "ADangerousMethod", "IMDB_id": "tt1571222", "title": "A Dangerous Method", "plot": "Sabina Spielrein arrives at the Burghölzli, the pre-eminent psychiatric hospital in Zurich, suffering from hysteria and begins a new course of treatment with the young Swiss doctor, Carl Jung. He uses word association and dream interpretation as part of his approach to psychoanalysis, and finds that Spielrein's condition was triggered by the humiliation and sexual arousal she felt as a child when her father spanked her naked.\nJung and chief of medicine Eugen Bleuler recognize Spielrein's intelligence and energy, and allow her to assist them in their experiments. She measures the physical reactions of subjects during word association, to provide empirical data as a scientific basis for psychoanalysis. She soon learns that much of this new science is founded on the doctors' observations of themselves, each other, and their families, not just their patients. The doctors correspond at length before they meet, and begin sharing their dreams and analysing each other, and Freud himself soon adopts Jung as his heir and agent.\nJung finds in Spielrein a kindred spirit, and their attraction deepens due to transference. Jung resists the idea of cheating on his wife, Emma, and breaking the taboo of sex with a patient, but his resolve is weakened by the wild and unrepentant confidences of his new patient: Otto Gross a brilliant, philandering, unstable psychoanalyst. Gross decries monogamy in general and suggests that resistance to transference is symptomatic of the repression of normal, healthy sexual impulses, exhorting Jung to indulge himself with abandon.\nJung finally begins an affair with Spelrein, including rudimentary bondage and spanking. Things become even more tangled as he becomes her advisor to her dissertation; he publishes not only his studies of her as a patient but eventually her treatise as well. Spelrein wants to conceive a child with Jung, but he refuses. After his attempt to confine their relationship again to doctor and patient, she appeals to Freud for his professional help, and forces Jung to tell Freud the truth about their relationship, reminding him that she could have publicly damaged him but did not want to.\nJung and Freud journey to America. However, cracks appear in their friendship as they begin to disagree more frequently on matters of psychoanalysis. Jung and Spielrein meet to work on her dissertation in Switzerland, and begin their sexual relationship once more. However, after Jung refuses to leave his wife for her, Spelrein decides to go to Vienna. She meets Freud, and says that although she sides with him, she believes he and Jung need to reconcile for psychoanalysis to continue to develop.\nFollowing Freud's collapse at an academic conference, he and Jung continue correspondence via letters. They decide to end their relationship after increasing hostilities and accusations regarding the differences in their conceptualisation of psychoanalysis. Spielrein marries a Russian doctor and, while pregnant, visits Jung and his wife. They discuss psychoanalysis and Jung's new mistress. Jung confides that his love for Spielrein made him a better person.\nThe film's footnote reveals the eventual fates of the four analysts. Gross starved to death in Berlin in 1919. Freud died of cancer in London in 1939 after being driven out of Vienna by the Nazis. Spielrein trained a number of analysts in the Soviet Union, before she, along with her two daughters, was shot by Nazis in 1942. Jung emerged from a nervous breakdown to become the world's leading psychologist before dying in 1961."}