{"mid": "AFaceInTheCrowd", "IMDB_id": "tt0050371", "title": "A Face in the Crowd", "plot": "In late 1950s America, a drunken drifter, Larry Rhodes (Andy Griffith), is plucked out of a rural Arkansas jail by Marcia Jeffries (Patricia Neal) to sing on a radio show at station KGRK. His raw voice, folksy humor and personal charm bring about a strong local following, and he lands a television show in Memphis, Tennessee under the stage name \"Lonesome\" Rhodes, given to him on a whim by Jeffries.\nWith the support of the show's staff writer Mel Miller (Walter Matthau) and Jeffries, the charismatic Rhodes ad libs his way to Memphis area popularity. When he pokes fun at his sponsor, a mattress company, they initially pull their ads—but when his adoring audience revolts, burning mattresses in the street, the sponsor discovers that Rhodes' irreverent pitches actually increased sales by 55%, and returns to the air with a new awareness of his power of persuasion. Rhodes also begins an affair with Jeffries and proposes to her.\nAn ambitious office worker at the mattress company, Joey DePalma (Anthony Franciosa), puts together a deal for Rhodes to star in his own show in New York City. The sponsor is Vitajex, an energy supplement which he ingeniously pitches as a yellow pill which will make men energetic and sexually powerful. Rhodes' fame, influence and ego balloon. Behind the scenes, a woman (Kay Medford) turns up claiming to be his legitimate wife, he berates his staff, and betrays Jeffries by eloping with a 17-year-old drum majorette (Lee Remick) whose baton-twirling act he features on his next TV program. The onetime drifter and his new bride move into a luxury penthouse. When Rhodes says he will \"give\" 10% of his share to Jeffries, she furiously reminds Rhodes that \"A Face In the Crowd\" was her idea, saying that she should have always been an equal partner, and now she demands to be one, and also demands it all be on paper. Rhodes agrees.\nUltimately, Rhodes' ascent into fame and arrogance begins to turn on him. DePalma threatens to reveal Rhodes' own secrets if the affair with the young wife is made public, claiming that he and Rhodes are now part of the same corruption. Rhodes is stuck with his business partner, but cruelly dumps his cheating wife.\nRhodes arrives at Marcia's home, on a rainy evening, telling her that he has created an organization which he wants Marcia to be a part of called \"FIGHTERS FOR FULLER.\" Rhodes tells Marcia that it was she who had made him a monster; in the middle of the night while Rhodes is sleeping, Marcia takes a taxi to the studio.\nThe final blow is delivered by the one who has loved Rhodes the most and been most injured by his selfishness: Marcia Jeffries. At the end of one of Rhodes' shows, the engineer cuts the microphone and leaves Jeffries alone in the control booth while the show's credits roll. Millions of viewers watch (in what initially is silence) their hero Rhodes smiling and seeming to chat amiably with the rest of the cast. In truth, he is mocking Fuller, then going off on a vitriolic rant about the stupidity of his TV audience. In the broadcast booth, Jeffries reactivates his microphone, sending his words and laughter over the air live. A sequence of television viewers is shown to react to Rhodes' description of them all as \"idiots, morons, and guinea pigs\".\nStill unaware that his words have gone out over the air waves (with thousands of angry calls to local stations and the network headquarters), he departs the penthouse studio in a jovial mood and prophetically tells the elevator operator that he is going \"all the way down\". As the elevator numbers go down to 0, the show's popularity is plummeting as well. DePalma is already meeting with a young entertainer who could become Rhodes' replacement.\nRhodes arrives at his penthouse, where he was to meet with the nation's business and political elite. Instead he finds an empty space, except for a group of black butlers and servants, by whom, in desperation, he demands to be loved. When they fail to respond, Rhodes dismisses all of them. Rhodes calls the studio and Jeffries listens to him rant as he threatens to jump to his death from the penthouse. Jeffries, who has been silent, suddenly screams at Rhodes, telling him to jump and to get out of her, and everybody's, life.\nMiller angrily dares her to face Rhodes and tell him the whole truth. They go to the penthouse and find Rhodes drunk and disconnected from reality. He shouts folksy platitudes and sings at the top of his lungs while his longtime flunky Beanie (Rod Brasfield) works an applause machine—Rhodes' own invention—to replace the cheers, applause, and laughter of the audience that has abandoned him. When he vows to get revenge on the TV studio's engineer, Jeffries admits it was she who betrayed him. She demands he never call her again, and Miller tells Rhodes that life as he knew it is over.\nMiller bemoans the fact that Rhodes is not really destroyed at all. Both the public's and the network's need for Rhodes, will, \"after a reasonable cooling off period\" of remorse and contrition, he predicts, return Rhodes to the public eye, but never to his previous height of power and success. Rhodes ends up screaming from the window of his penthouse for Marcia Jeffries to come back as she leaves in a taxi with Miller, who assures her that Rhodes won't kill himself, while a Coca-Cola sign continuously flashes off and on."}