{"mid": "Afflicted", "IMDB_id": "tt2309961", "title": "Afflicted", "plot": "Childhood friends Clif Prowse and Derek Lee have decided to venture all over the world to film their travel web series “Ends of the Earth”. The trip is Derek's last wish, as he has an AVM, which could cause his death at any moment.\nClif and Derek stop in Paris to meet with old friends currently on tour with their band. After their initially uneventful stay, Derek picks up a woman by the name of Audrey after telling her about his AVM. Later that night, Clif bursts into Derek's hotel room as a prank, only to discover a bleeding and scratched Derek, and no sign of Audrey. Though Derek doesn't remember anything about the attack, they assume that Audrey planned to rob him.\nUpon getting to Italy, Derek passes out and sleeps for an entire day. Clif awakens him the next afternoon for lunch. At the restaurant, Derek hungrily devours his pasta dish before suddenly projectile vomiting. Later, at a vineyard, Derek has an extreme reaction to sunlight, and is forced to flee inside, covered in burns. Back at the hotel room, Clif attempts to calm Derek down, only for Derek to explosively punch clean through the corner of a stone wall with his bare hands.\nOver the next few days, Derek displays heightened strength, speed and agility. Clif attempts to persuade Derek to stop their trip and come home, but Derek continues to insist that there is nothing wrong with him. As Derek grows sicker due to not being able to eat, he finally agrees to go to a hospital. On the way, the two are almost hit by a car. Derek fights with the angry driver and passenger, completely overpowering them both, before licking their blood off his hand.\nClif correctly deduces that Derek has contracted vampirism, but researching online proves useless. Derek first tries drinking blood obtained from a butcher, and then kills and drains a man's pet piglet, only to vomit out the blood on both occasions. Realizing that Derek needs human blood, he and Clif attempt to rob an ambulance, which proves unsuccessful, and they retreat back to the hotel. Derek enters a catatonic state, and Clif decides to slit his own wrist to give Derek some of his blood, but discovers that Derek has escaped. He attempts to find him, only to be ambushed and killed by the completely inhuman Derek. Upon regaining his senses and realizing that he has killed his friend, Derek shoots himself in the head with a shotgun. Shortly after, however, Derek's head heals with only slight scarring, and he is faced with the fact that he is unable to be killed.\nSoon after, Interpol agents attempt to take Derek into custody, forcing him to escape in daylight, carrying only Clif's camera bag. He manages to get back to France and hides in an abandoned warehouse in Paris. Reviewing the footage of his meeting with Audrey, he realizes that her cell phone might be at the hotel where she bit him. After retrieving the cell phone, Derek texts every one of the numbers on the contact list in order to try and lure someone to him. Eventually, a man shows up, and Derek tails and kidnaps him. He then sets up a live-stream event to draw Audrey in, but his hideout is stormed by the French Riot Police (CRS) and Derek is shot to near-death before entering a frenzy state. After slaughtering the police, Derek escapes once again.\nAudrey finally meets Derek in an abandoned building, where she apologizes for accidentally making him a vampire, and tells him that there is no cure for his condition. Derek lashes out at her and the two briefly fight, but Derek is easily overpowered by the more experienced Audrey. Audrey urges him to feed every five days, lest he become inhuman again and begin killing indiscriminately. Audrey instructs him to choose whom he kills, and explains that she chose Derek because he was dying, and she thought she was being kind.\nLater, Derek posts his final entry online, in which he explains that he can never contact his family again. He then kills and feeds from a child molester.\nIn a mid-credits scene, a teenage boy and two teenage girls are seen sneaking into a swimming pool, only to be attacked. The boy gets away, and with his camera running, finds the bloodied corpse of one of the girls before Clif, now also a vampire, appears and attacks him."}