{"mid": "AFieldInEngland", "IMDB_id": "tt2375574", "title": "A Field in England", "plot": "During a battle of the English Civil War, an alchemist's assistant named Whitehead flees from the strict Commander Trower. Whitehead is saved by a rough soldier named Cutler, who kills Trower before he can apprehend Whitehead. Whitehead then meets two army deserters, the alcoholic Jacob and the witless Friend. The four leave the battleground in search of a promised ale house that Cutler knows of. Cutler instead leads them to a field encircled by mushrooms, where he cooks the mushrooms and forces the others to eat, to make them more obedient; save for Whitehead. There, they haul the Irishman O'Neill seemingly out of the ground from a wooden pike buried in the ground. O'Neill is a rival alchemist for whom Cutler works; and who stole documents from Whitehead's master. He quickly asserts authority over the group and tells them of a treasure hidden somewhere in a nearby field.\nThe group finds a deserted army camp, where O'Neill tortures Whitehead into a gleeful and hypnotised human divining rod. After using Whitehead to locate the treasure, which is near the camp, O'Neill orders Jacob and Friend to dig for it while he leaves Cutler to supervise, and goes to sleep in a tent. Jacob soon succumbs to the influence of the hallucinogenic mushrooms, and after several hours of digging he attacks Friend. Cutler laughs and urinates on them, and when Jacob attempts to attack him, Cutler accidentally shoots Friend. Whitehead is unable to save him, and Friend dies, telling Jacob to deliver a message to his wife, telling that he hates her. Cutler is forced to finish digging by himself, while Jacob slips away from the camp to deliver Friend's message, and Whitehead deposits Friend's corpse in a thicket.\nCutler eventually nears reaching the treasure, attracting the attention of O'Neill, who discovers Jacob and Whitehead gone. Reaching where Friend's corpse is, O'Neill pursues Whitehead, who ingests a part of the circle of mushrooms, heightening his awareness but suffering a hallucinatory experience, wherein he conjures a violent wind to blow away the camp's tent. Cutler discovers that the \"treasure\" is just a skull, which he shoots in anger. Jacob comes back to join Whitehead in fighting O'Neill.\nCutler angrily berates O'Neill, blaming him for trusting Whitehead and lying to him about the alehouse, which was to simply entice Jacob and Friend. O'Neill promptly kills him and then pursues Whitehead and Jacob, who scavenge Cutler's weapons and return to the overturned army camp. As they are preparing for an attack, Friend appears alive and reveals their location to O'Neill. As Jacob throws Friend to the ground to stop him, O'Neill shoots Jacob in the gut, but Jacob returns fire and ruins O'Neill's leg. Jacob dies from his injuries, after he and Whitehead surmise that the treasure was the friendship they shared. Friend brandishes Cutler's pike and charges O'Neill, but O'Neill kills him with his last shot. Whitehead takes advantage of the situation to finally kill O'Neill by shooting him in the back of the head.\nWhitehead buries his friend's corpses in the hole and leaves the field. Wearing O'Neill's clothes, he gathers his master's stolen documents and returns to the hedgerow where he first met Cutler, Jacob and Friend, from which battle sounds are rising. After he wades through the hedge, he sees Friend, Jacob and himself standing together, implying he is still under the effects of the mushrooms in the field behind him."}