{"mid": "AFilmWithMeInIt", "IMDB_id": "tt1139319", "title": "A Film with Me in It", "plot": "Mark (Doherty) is an actor living in a basement flat below his writer friend Pierce (Moran). Residing with his girlfriend, Sally (Huberman), Mark struggles to find work whilst caring for his paralysed brother, David (O'Doherty). Desperate to avoid paying overdue rent, Mark continually eludes landlord Jack (Allen), meaning he is also unable to inform Jack of the flat's dilapidated state.\nDiscovering that Mark wasted money meant for the overdue rent, Sally finally decides to end her strained relationship with Mark, informs Jack of the repairs needed, and arranges to move out. The damaged state of the flat reaching its peak, Mark witnesses two consecutive freak accidents; a bookshelf falls and kills his dog, and the living room chandelier collapses and crushes David. Reeling in horror from the events, Mark looks on as Jack appears to repair a high lightbulb atop a wobbly stool, only to fall and pierce his throat with his screwdriver. Pierce then arrives and discovers the corpses, causing him to panic.\nHiding in the bathroom, Mark and Pierce plot to control the situation, only for Sally to return. Discovering David's body, Sally faints and impales herself on Mark's clarinet stand, killing her too. Realizing the absurdity of four consecutive, fatal accidents occurring in one place, Pierce concocts a plan to move Jack's body to an alternative location, as they both had a strong motive to murder him. Shooing Sally's father when he arrives, a police officer (O'Sullivan) then arrives due to an unrelated noise complaint, causing Pierce to panic and take her hostage.\nUnable to kill the officer, the duo ties her up and attempts to reason with her. Left unattended, she attempts to escape through a faulty window, only for it to close and crush her head. Now surrounded by several corpses, Pierce finally formulates a plan; placing David, Sally, Jack, and the dog in his car, they drive it to a secluded area and cause it to explode, leaving minimal forensic evidence. Additionally, since three immediate deaths of Mark's acquaintances can place suspicion on him, Mark places his jewellery and clarinet on David's corpse, faking his own death.\nFinally moving the officer to the neighbour's garden, Pierce fakes her death as caused by a falling plant pot. Cutting Mark's hair and dressing him as David, the two attempt to pass Mark as his disabled brother, and give Pierce an alibi as his carer in Mark's absence. A closing epilogue then shows Pierce has written a script based on the film's events, and is currently directing it whilst Mark continues to pass as David."}