{"mid": "AFlintstonesChristmasCarol", "IMDB_id": "tt0193164", "title": "A Flintstones Christmas Carol", "plot": "The Bedrock Community Players is mounting A Christmas Carol, and all of the town's citizens are either planning to attend or be involved in the production: Barney Rubble is playing Bob Cragit, with Betty as Mrs. Cragit and his son Bamm-Bamm as Tiny Tim; Mr. Slate is Jacob Marbley; Wilma Flintstone is serving as the stage manager, while her daughter Pebbles plays Martha Cragit; even Dino has a role, playing the Cragit's family pet. It is Fred, though, who has landed the leading role of Ebonezer Scrooge. Unfortunately, he has let his role go to his head, thinking himself a star and spending all of his time rehearsing his lines rather than focusing on his job or family. On Christmas Eve, in his rush to get to work, Fred forgets that he must take Pebbles to \"cave care\", and later to pick her up from cave care. When Fred arrives at the theater, he discovers a furious Wilma, who breaks down in tears as she tells Fred about his mistake.\nThe play finally begins with narrator Charles Brickens reading the opening lines, and after a momentary bout of stage fright, Fred enters. The play proceeds as normal. As the second act opens, Wilma and Betty discover that Garnet, the woman playing the Ghost of Christmas Past, has contracted the \"Bedrock Bug,\" a flu-like illness. As stage manager, Wilma is left to play the part herself. Throughout the act, Wilma vents some of her frustration at Fred through her lines, while Fred himself realizes the parallels between Scrooge's past and his own recent behavior. During the next scene, at Fezziwig's Christmas party, Betty informs Wilma that Maggie has come down with the Bedrock Bug as well; Wilma dons her costume and plays Belle. The rest of the play proceeds as normal: Ernie, a cheerful Bedrock citizen, plays the Ghost of Christmas Present, and Fred, witnessing Barney, Betty, Bamm-Bamm, and Pebbles playing the Cragits, continues to realize the depths of his recent self-absorption. The third act begins with the hooded figure of the Ghost of Christmas Yet to Come appearing before Scrooge; he shows the elderly man \"shadows of things that will be,\" including an abandoned gravestone marked with the words \"EBONEZER SCROOGE.\" The scene suddenly shifts to Scrooge's bedchamber—he is still alive, and he discovers that it is Christmas morning: \"the spirits have done it all in one night.\" He recruits a passing boy (played by the same child who Fred entrusted with his presents) to purchase a prize \"Turkeysaurus\" and have it sent to the Cragits for a feast. Scrooge prepares to go out and explore the city on Christmas morning; along the way, he meets Wilma, who has taken on the role of one of the members of the Piltdown Charitable Foundation, as the original actor has caught the Bedrock Bug. Fred acts as if the woman is Belle (much to narrator Brickens's frustration, as the ad-libbing is not in his script), and begs for both her and Wilma's forgiveness, admitting his recent selfishness and promising that he has changed his attitudes. Wilma reluctantly plays along.\nThe play ends with Scrooge making Cragit a full partner in his money-lending business, the rest of the actors lifting Ebonezer onto their shoulders, and the narrator informing the audience of the permanent change in the elderly man. It falls to Bamm-Bamm to deliver Tiny Tim's famous \"God bless us, everyone!,\" but he suddenly forgets his line, leaving Pebbles to make the declaration herself. When the curtain falls, the company drops Fred and scolds him \"for being such a Scrooge.\" Fred apologizes, informing Wilma that he has finally realized that his friends and family, rather than his role in the production, are what matter most. As the company begins to depart, Fred insists that the Ghost of Christmas Yet to Come take off his hood; the actor does so, revealing himself as Dino, who took the part after the regular actor Philo came down with the Bedrock Bug.\nBrickens congratulates Wilma for her roles in the play with a bouquet. A changed Fred says that when the Flintstones get home, he's going to make dinner. Unfortunately, however, after he says this, he comes down with the flu, and Wilma decides to make dinner, since the Bedrock Bug \"lasts for a day\"."}