{"mid": "Aftermath", "IMDB_id": "tt0159241", "title": "Aftermath", "plot": "Hunter (C. J. Thomason) is a young doctor that has found himself stuck in the cellar of a farmhouse while World War III and the resulting nuclear attack unfolds around him. He's accompanied by eight other people, none of whom know one another. Terrified and forced to defend themselves against other refugees looking to use the cellar as their own shelter, the group is frequently at odds with one another.\nAs the film opens, Hunter meets a young woman named Jennifer and her brother Satchel, driving down the road where they witness several mushroom clouds from afar, destroying two major cities in the process.\nSatchel goes blind after watching the explosions. They start looking for supplies at a nearby drugstore, grabbing whatever they could find: food, water, medical supplies, car batteries, etc. They pick up a young woman named Elizabeth who informs them of the devastation of every major city on the east and west coast. Hunter gets shot while trying to find shelter for the others. They find a supposedly abandoned farmhouse, where they hope will be a safe refuge. However, he turns the tables on a farmer named Brad, who threatened to kill him if he didn't leave.\nJonathan, another farmer, decides to help Hunter and the others. Before joining the others, Hunter tends to his gunshot wound, finds medicine, and arms Elizabeth with a shotgun. Everyone begins to wonder whether or not the radiation in the atmosphere is widespread. They receive more news about Europe being destroyed by nuclear bombs. Hunter builds a makeshift radio, where they hope will bring them good news. However, they find a Geiger counter, and use it to measure the fallout of the bombs, causing shock and disbelief among the survivors.\nHunter and the others try to make it to the outside, but Elizabeth and Angie, Brad's wife, become exposed to the radiation, fearing that they might have sickness. Angie realizes that her unborn child may have died because of the exposure. Wendell, Jonathan and Brad's great uncle, dies after he refused to drink and eat anything that is contaminated. Rob, another survivor, promises Jonathan that he will help bury Wendell. Jonathan and the others have an encounter with cannibalistic humans who try to kill the group for food.\nAfter heading back into the basement, Angie has a miscarriage. Without a blood transfusion, Angie could die. Brad becomes distraught and threatens to kill everyone if she is not saved. Jonathan hits Brad with a shovel, allowing Angie to die peacefully. Brad and the others hear the President's Speech, knowing that he has either died of the exposure or that he is in a secure bunker somewhere. All of them realize that there is no help coming. An hour later, Satchel dies from pneumonia. Hunter begins to notice that most of the group are slowly slipping away, because of the radiation seeping through the basement walls.\nHunter, armed with a shotgun, helps bury Satchel with Rob. Rob's fate is revealed that he was killed by the cannibals. Elizabeth proposes that they should kill themselves to put each other out of their misery. However, it is up to Brad to decide who lives and who dies. The next day, Brad and Hunter hear footsteps upstairs and know that the cannibals have returned, forcing the group to fight back. The five of them notice that the cannibals are ready for another fight. Elizabeth suffers and eventually succumbs to a broken rib and punctured lung after fighting with one of them. Hunter kills the cannibal that hurt her, but Brad dies in the process. Jonathan, having gone insane because of the experience, shoots Jennifer and then himself (It is later revealed that Jennifer survived the gunshot). The film ends with Hunter and Jennifer as the sole survivors of the group. A few weeks later, both are rapidly suffering the effects of radiation exposure and are shown to be close to death, while continuing to drink from contaminated water."}