{"mid": "AGrandDayOut", "IMDB_id": "tt0104361", "title": "A Grand Day Out", "plot": "As Wallace and Gromit relax at home, trying to decide where to spend their upcoming bank holiday, Wallace decides to fix a snack of tea with cheese and crackers. Finding no cheese in the kitchen, he decides that the pair should go to a place known for its cheese.\nAfter browsing several possible locations, a glance out the window at the night sky gives them the idea to travel to the moon, since, according to Wallace, \"everybody knows the moon's made of cheese.\" They build a rocket in the basement and pack for the trip, but after lighting the fuse, Wallace realises that he has forgotten the crackers. Hurrying to the kitchen, he grabs multiple boxes and returns to the rocket just in time for lift off.\nWhen they arrive on the moon, they discover that the entire landscape is in fact made of cheese. They set up a picnic and sample some, but are unable to match its taste to any cheese they know. Looking for a different spot, they encounter \"The Cooker\", a wheeled, mechanised, coin operated device that resembles an oven and storage cabinet.\nWallace inserts a ten pence coin, but nothing happens immediately; only after he and Gromit have left does the Cooker spring to life, popping jointed arms out of its side panels. When it finds the picnic site, it becomes agitated and gathers up the dirty dishes; finding a skiing magazine nearby, it develops a desire to travel to Earth and experience the sport. The Cooker glues a discarded spike of cheese back onto the spot from which Wallace cut it, issues a parking ticket for the rocket, and becomes annoyed by an oil leak from the craft.\nThe Cooker spots Wallace and Gromit in the distance, Wallace having cut another spike of cheese, and sneaks up with a nightstick in hand. However, before it can hit Wallace over the head, the money Wallace inserted runs out and it freezes in place. Wallace takes the nightstick as a souvenir, inserting another ten pence in exchange, and he and Gromit prepare to leave. Returning to life, the Cooker realises that the rocket can take it to Earth and excitedly chases after them. Wallace panics, thinking that the Cooker is angry over the cheese he is taking, and he and Gromit retreat into the rocket.\nUnable to climb up the rocket's ladder, the Cooker cuts its way into the fuselage with a can opener, but accidentally spills and ignites some fuel. The resulting explosion blows it backward and allows Wallace and Gromit to lift off. The Cooker is left on the moon, with nothing but two strips of metal ripped from the fuselage; initially crushed by its failure to reach Earth, it fashions the strips into a pair of skis and is soon happily skiing across the lunar landscape. It waves goodbye to Wallace and Gromit as they return home."}