{"mid": "AGuyNamedJoe", "IMDB_id": "tt0035959", "title": "A Guy Named Joe", "plot": "Pete Sandidge (Spencer Tracy) is the reckless pilot of a North American B-25 Mitchell bomber flying out of England during World War II.  He is in love with Women Airforce Service Pilot Dorinda Durston (Irene Dunne), a civilian pilot ferrying aircraft across the Atlantic.  \"Nails\" Kilpatrick (James Gleason), Pete's commanding officer, first transfers Pete and his crew to a base in Scotland and then offers him a transfer back to America to be a flying instructor. Dorinda has a feeling that Pete's \"number is up\" and begs him to accept. Pete agrees, but goes out on one last mission with his best friend Al Yackey (Ward Bond) to check out a German aircraft carrier. Wounded after an attack by an enemy fighter, Pete has his crew bail out before bombing the ship and crashing into the sea.\nPete then finds himself walking in clouds, where he first recognizes an old friend, Dick Rumney (Barry Nelson). Suddenly becoming uneasy after remembering that Dick went down with his aircraft in a fiery crash, Pete says, \"Either I'm dead or I'm crazy.\" Dick answers, \"You're not crazy.\" Dick ushers Pete to a meeting with \"The General\" (Lionel Barrymore), who gives him an assignment. He is to be sent back to Earth, where a year has elapsed, to pass on his experience and knowledge to dilettante Ted Randall (Van Johnson) at flight school, then in the South Pacific, where Ted is a Lockheed P-38 Lightning fighter pilot. Ted's commanding officer turns out to be Al Yackey.\nThe situation becomes complicated when Ted meets the still-grieving Dorinda. Al encourages Dorinda to give the young pilot a chance. The pair gradually fall in love; Ted proposes to her and she accepts, much to Pete's jealous dismay.\nWhen Dorinda finds out from Al that Ted has been given an extremely dangerous assignment to destroy the largest Japanese ammunition dump in the Pacific, she steals his aircraft. Pete guides her in completing the mission and returning to the base to Ted's embrace. Pete accepts what must be and walks away, his job done."}