{"mid": "AHardDaysNight", "IMDB_id": "tt0058182", "title": "A Hard Day's Night", "plot": "Bound for a London show from Liverpool, The Beatles escape a horde of fans (\"A Hard Day's Night\"). Once they are aboard the train and trying to relax, various interruptions test their patience: after a dalliance with a female passenger, Paul's grandfather is confined to the guard's van and the four lads join him there to keep him company. John Lennon, Paul McCartney, George Harrison, and Ringo Starr play a card game, entertaining some schoolgirls before arriving at their desired destination (\"I Should Have Known Better\").\nUpon arrival in London, the Beatles are driven to a hotel, only to feel trapped inside. They are tasked to answer numerous letters and fan mail in their hotel room but instead they sneak out to party (\"I Wanna Be Your Man\", \"All My Loving\"). After being caught by their manager Norm (Norman Rossington), they return to find out that Paul's grandfather John (Wilfrid Brambell) went to the casino. After causing minor trouble at the casino, the group is taken to the theatre where their performance is to be televised. After rehearsals (\"If I Fell\"), the boys leave through a fire escape and dance around a field but are forced to leave by the owner of the property (\"Can't Buy Me Love\"). On their way back to the theatre, they are separated when a woman named Millie (Anna Quayle) recognizes John as someone famous but cannot recall who he is. George is also mistaken for an actor auditioning for a television show featuring a trend setter hostess. The boys all return to rehearse another song (\"And I Love Her\") and after goofing around backstage, they play another song to impress the makeup artists (\"I'm Happy Just to Dance with You\").\nWhile waiting to perform, Ringo is forced to look after Paul's grandfather and decides to spend some time alone reading a book. Paul's grandfather, a \"villain, a real mixer\", convinces him to go outside to experience life rather than reading books. Ringo goes off by himself. He tries to have a quiet drink in a pub, takes pictures, walks alongside a canal, and rides a bicycle along a railway station platform. While the rest of the band frantically and unsuccessfully attempts to find Ringo, he is arrested for acting in a suspicious manner. Paul's grandfather joins him shortly after attempting to sell photographs wherein he forged the boys' signatures. Paul's grandfather eventually makes a run for it and tells the rest of the band where Ringo is. The boys all go to the station to rescue Ringo but end up running away from the police back to the theatre (\"Can't Buy Me Love\") and the concert goes ahead as planned. After the concert (\"Tell Me Why\", \"She Loves You\"), the band is taken away from the hordes of fans via helicopter."}