{"mid": "Airborne", "IMDB_id": "tt0106233", "title": "Airborne", "plot": "Despite an approaching winter storm a near-empty airliner takes off from London for New York. One-by-one the passengers begin to disappear, while one passenger who frequents the route notices the plane has turned whereas it should be flying straight. Soon it is discovered that the pilots are dead and that the plane is on auto pilot; and it is revealed that two on board are hijackers who have murdered the pilots to take control of the plane. The passengers who disappeared were killed when they witnessed parts of the hijacking.\nThe hijackers intend to steal and sell both the plane and an ancient vase being transported on board which, according to legend, acts as a prison for a death god. The passengers try to hinder the hijackers but they are unable to overpower them and instead wind up tied to the seats of the plane, the hijackers planning to use them as hostages.\nMeanwhile, air traffic control becomes alarmed; they have lost radio contact with the plane as it first veers off course and then disappears from radar. They alert the authorities, who assume the plane has been taken over by terrorists and send fighter aircraft to intercept it. As fighter planes take off and close in on the airliner the would-be hostages escape their bonds. The people on the hijacked airliner begin to go violently crazy, killing themselves and each other without apparent reason; the incorporeal death god has been released from the vase and is possessing people, trying to find a suitable host.\nThe airliner passes into South American airspace, causing the fighter jets to give up pursuit; then the air controllers watch in horror as the plane begins to descend, its trajectory sending it into the ocean. One of the passengers has disabled the autopilot and is flying the plane into the ocean to prevent the death god from being released into the world. A passenger possessed by the death god and one of the hijackers try to stop the plane from crashing, but they fail; the death god leaves the passenger's body at the last moment, giving her only enough time to scream into the radio before the plane hits the water. Back in London the air controllers are marched out of the control room by the authorities, who mean to leave no witnesses. The eyes of one of the controllers flash blue as he is possessed by the death god."}