{"mid": "AlanPartridgeAlphaPapa", "IMDB_id": "tt0469021", "title": "Alan Partridge: Alpha Papa", "plot": "Norwich radio station North Norfolk Digital is bought out by a multinational conglomerate, with staff members facing redundancies. DJ Alan Partridge is not concerned, but fellow DJ Pat Farrell convinces him to gatecrash a board meeting to persuade the new owners not to fire Pat. When Alan discovers that either he or Pat must go, he urges them to fire Pat, and writes \"JUST SACK PAT\" on the room's flip chart.\nDuring a company party, Pat enters the station with a shotgun and holds the staff hostage, demanding his job back. The police enlist Alan as a negotiator, and he builds an uneasy rapport with Pat; with Alan's co-presenter Sidekick Simon, the three host a radio show during the siege. Alan daydreams of ending the siege heroically, but cannot bring himself to grab Pat's gun. As the siege becomes national news, Alan's assistant Lynn is persuaded to ditch her frumpy style for a TV interview, Alan's ego swells because of his pivotal role, and he shares a kiss with his colleague Angela.\nAlan accidentally locks himself out of the building and loses his trousers trying to get back in through a window. The police realise he is an ineffective negotiator and send in an undercover officer disguised as a pizza delivery man. Alan interrupts and takes the pizzas in himself. When Pat discovers a taser in one of the boxes, an argument erupts between the hostages and the police burst in. Pat escapes in the station's tour bus, taking Alan and security guard Michael.\nOn the bus, Alan regains Pat's trust and they continue to host the radio show. However, Pat sees Alan's \"JUST SACK PAT\" message in a photo and deduces that Alan was behind his redundancy. Alan hides in the bus toilet compartment and escapes in the septic tank.\nOn Cromer Pier, Pat faces off with Alan and the police. Michael tries to distract Pat by throwing himself off the pier; he is never seen again. Pat tells Alan that he is depressed due to the death of his wife and prepares to shoot himself. Unable to pull the trigger, he gives his shotgun to Alan, who throws it aside. The gun goes off, shooting Alan in the leg; he is then shot again by a police sniper reacting to gunfire. Lynn arrives and thinks Alan is dead, but a paramedic assures him that he will be fine.\nAlan returns to North Norfolk Digital with Sidekick Simon and Pat calls the show from jail. Alan goes on holiday with Angela and her sons."}