{"mid": "AlexCross", "IMDB_id": "tt1712170", "title": "Alex Cross", "plot": "Dr. Alex Cross (Tyler Perry) is a psychologist and police lieutenant who lives in Detroit with his wife Maria (Carmen Ejogo) and their children. After learning Maria is pregnant, Cross considers accepting a job as an FBI profiler. Meanwhile, a man (Matthew Fox) participates in an underground fighting match and seduces businesswoman Fan Yau (Stephanie Jacobsen). The man is invited to Yau's house, where he kills her.\nAt the crime scene, Cross finds a charcoal sketch left behind by the killer in the style of the artist Picasso, leading to the murderer being nicknamed after him. While examining the sketch, Cross deduces that Picasso's next target is German businessman Erich Nunemarcher (Werner Daehn). Picasso attempts to kill Nunemarcher but is foiled by Cross, and escapes after being shot by Cross's partner Tommy Kane (Edward Burns). Cross deduces that Picasso also plans to target billionaire CEO Giles Mercier (Jean Reno).\nAs revenge for foiling his attack on Nunemarcher, Picasso attacks Cross and Kane's colleague, Monica Ashe (Rachel Nichols), torturing her to death. Picasso then tracks down Cross, who is on a date with Maria, and kills her with a sniper rifle.\nPicasso targets Nunemarcher and Mercier at a conference, killing Nunemarcher and seemingly Mercier. Cross and Kane track Picasso to the abandoned Michigan Theater. As Cross and Picasso fight, they fall through the crumbling theater ceiling. Picasso falls to his death, but Kane helps pull Cross to safety.\nCross deduces Picasso's employer was Mercier himself. Having embezzled money from his clients, Mercier asked for Yau and Nunemarcher's help to fake his death and flee to Bali, then hired Picasso to eliminate them and a double pretending to be the real Mercier. After Cross frames Mercier for drug smuggling, Mercier is arrested in Indonesia, where he will be condemned to death by firing squad. Having avenged Maria's murder, Cross decides to accept the job offer from the FBI and move to Washington with his family."}