{"mid": "AlienCovenant", "IMDB_id": "tt2316204", "title": "Alien: Covenant", "plot": "Peter Weyland speaks with his newly-activated synthetic, who chooses the name \"David\" for himself, after looking at a replica of Michelangelo's statue of the same name. Weyland tells David that one day they will search for mankind's creator together.\nMany years later, in 2104, the colonization ship Covenant is bound for a remote planet, Origae-6, with two thousand colonists and a thousand embryos onboard. The ship is monitored by Walter, a newer synthetic physically resembling the earlier David model. A sudden neutrino burst damages the ship, killing some of the colonists. Walter orders the computer to wake the crew from stasis, but the ship's captain, Branson, dies when his pod malfunctions. As the crew repairs the damage to the ship, they pick up a radio transmission from a nearby unknown planet. Against the objections of Daniels, Branson's widow, succeeding captain Oram decides to investigate, as the planet appears to be even better suited for colonization than Origae-6 and the crew is reluctant to return to their stasis pods after witnessing their captain's demise.\nAn expedition team descends to the planet's surface and tracks the transmission's signal to a crashed Engineer ship. While on the surface, security team members Ledward and Hallett are inadvertently infected with alien spores. Karine, Oram's wife, helps the rapidly sickening Ledward back to the lander, where pilot Tennessee's wife, Maggie, quarantines them both inside the med-bay. A Neomorph bursts from Ledward's back, killing him, then mauls Karine to death. Maggie tries to shoot the quickly growing creature but accidentally hits a gas tank, causing an explosion which destroys the lander and kills her. The Neomorph manages to escape to the planet's surface while another such creature bursts from Hallett's throat, killing him.\nThe two Neomorphs attack the remaining crew members and kill Ankor. The crew manages to kill one of the aliens before David, a survivor of the Prometheus mission, rescues the crew and leads them to a city full of Engineer corpses. David tells them that upon his and Dr. Elizabeth Shaw's arrival at the planet, their Engineer ship accidentally released a black liquid bioweapon which killed the native population, and that the ship crashed in the ensuing chaos, killing Shaw. As the crew members attempt to radio the Covenant for help, the surviving Neomorph infiltrates the city and decapitates Rosenthal, who was separated from the others. David attempts to communicate with the creature and is horrified when Oram kills it. At Oram's demand, David reveals that the aliens are a result of his experimenting with the black liquid to create a new species. He leads Oram to an incubation chamber and tricks him into being embraced by a facehugger, which implants Oram with an embryo. A Xenomorph soon erupts from Oram's chest, killing him.\nAs the others search for Oram and Rosenthal, Walter confronts David after realizing that David had deliberately unleashed the black liquid upon the Engineers. David explains that he believes humans are on the road to extinction and should not be allowed to colonize the galaxy. When Walter disagrees, David disables him and captures Daniels, revealing to her that he also murdered Shaw and used her corpse for his experiments. Walter reactivates himself and fights David, allowing Daniels to escape while Lope is attacked by the facehugger. Cole saves Lope before they are ambushed by the now mature Xenomorph, which kills Cole. Tennessee arrives in another lander to extract Daniels, Lope, and Walter. They kill the Xenomorph before docking with the Covenant; however, Lope had been implanted with another Xenomorph, which bursts from his chest on the ship before quickly maturing and killing crew members Ricks and Upworth. With Walter's help, Tennessee and Daniels corner the creature in the Covenant's airlock and flush it into space.\nThe Covenant resumes its trip to Origae-6, and the surviving crew re-enters stasis. As Walter puts Daniels under, she realizes that he is actually David, but is unable to escape her stasis pod before falling asleep. Alone, David regurgitates two alien embryos and places them in cold storage alongside the human embryos, before using Walter's name to record a log stating that all crew members except Daniels and Tennessee were killed by the neutrino blast at the beginning of the film."}