{"mid": "ALittlePrincess", "IMDB_id": "tt0113670", "title": "A Little Princess", "plot": "Captain Ralph Crewe, a wealthy English widower, enrolls his young daughter Sara, who had been living in India, at Miss Minchin's boarding school for girls in London, to prepare her for a life in high society. Crewe dotes on his daughter so much that he orders and pays the headmistress for special treatment and exceptional luxuries for Sara, such as a private room for her with a personal maid and a separate sitting room (see Parlour boarder), along with Sara's own private carriage and a pony. Miss Minchin openly fawns over Sara for her money, but secretly and jealously despises her for her wealth. Miss Minchin's younger sister, Amelia, is kindhearted yet her will is weak.\nDespite her privilege, Sara is neither arrogant nor snobbish, but rather kind, gracious and clever. She extends her friendship to Ermengarde, the school dunce, to Lottie, a four-year-old student given to tantrums, and to Becky, the lowly, stunted fourteen-year-old scullery maid. When Sara acquires the epithet of a princess, she embraces its favorable elements in her natural goodheartedness.\nAfter some time, Sara's birthday is celebrated at Miss Minchin's with a lavish party, attended by all her friends and classmates. Just as it ends, Miss Minchin learns of Captain Crewe's unfortunate demise. Prior to his death, the previously wealthy gentlemen had lost his entire fortune; a friend had persuaded Captain Crewe to cash in his investments and deposit the proceeds to develop a network of diamond mines. The scheme fails and Sara is left a pauper. Miss Minchin is left with a sizable unpaid bill for Sara's school fees and luxuries, including her birthday party. In a rage, Miss Minchin takes away all of Sara's possessions (except for some old frocks and one doll), makes her live in a cold and poorly furnished attic, and forces her to earn her keep by working as an errand girl.\nFor the next several years Sara is abused by Miss Minchin and the other servants, except for Becky. Amelia deplores how Sara is treated but is too weak to speak up about it. Sara is starved, worked for long hours, sent out in all weathers, poorly dressed in outgrown and worn-out clothes, and deprived of warmth or a comfortable bed in the attic. Despite her hardships, Sara is consoled by her friends and uses her imagination to cope, pretending she is a prisoner in the Bastille or a princess disguised as a servant. Sara also continues to be kind and polite to everyone, including those who treat her badly. One day she finds a coin in the street and uses it to buy buns at a bakery, but despite being very hungry, she gives most of the buns away to a beggar girl dressed in rags who is hungrier than herself. The bakery shop owner sees this and wants to reward Sara, but she has disappeared, so the shop owner instead gives the beggar girl bread and warm shelter for Sara's sake.\nMeanwhile, Mr. Carrisford and his Indian assistant Ram Dass have moved into the house next door to Miss Minchin's school. Carrisford had been Captain Crewe's friend and partner in the diamond mines. After the diamond mine venture failed, both Crewe and Carrisford became very ill, and Carrisford in his delirium abandoned his friend Crewe, who died of his 'jungle fever.' As it turned out, the diamond mines did not fail, but instead were a great success, making Carrisford extremely rich. Although Carrisford survived, he suffers from several ailments and is guilt-ridden over abandoning his friend. He is determined to find Crewe's daughter and heir, although he does not know where she is and thinks she is attending school in France or Moscow.\nRam Dass befriends Sara when his pet monkey escapes into Sara's adjoining attic. After climbing over the roof to Sara's room to get the monkey, Ram Dass tells Carrisford about Sara's poor living conditions. As a pleasant distraction, Carrisford and Ram Dass buy warm blankets, comfortable furniture, food, and other gifts, and secretly leave them in Sara's room when she is asleep or out. Sara's spirits and health improve due to the gifts she receives from her mysterious benefactor, whose identity she does not know; nor are Ram Dass and Carrisford aware that she is Crewe's lost daughter. When Carrisford anonymously sends Sara a package of new, well-made and expensive clothing in her proper size, Miss Minchin becomes alarmed, thinking Sara might have a wealthy relative secretly looking out for her, and begins to treat Sara better and allows her to attend classes rather than doing menial work.\nOne night, the monkey again runs away to Sara's room, and Sara visits Carrisford's house the next morning to return him. When Sara casually mentions that she was born in India, Carrisford and his solicitor question her and discover that she is Captain Crewe's daughter, for whom they have been searching for years. Sara also learns that Carrisford was her father's friend and her own anonymous benefactor, and that the diamond mines have produced great riches, of which she will now own her late father's share. When Miss Minchin angrily appears to collect Sara, she is informed that Sara will be living with Carrisford and her entire fortune has been restored and greatly increased. Upon finding this out, Miss Minchin unsuccessfully tries to persuade Sara into returning to her school as a star pupil, and then threatens to keep her from ever seeing her school friends again, but Carrisford and his solicitor tell Miss Minchin that Sara will see anyone she wishes to see and that her friends' parents are not likely to refuse invitations from an heiress to diamond mines. Miss Minchin goes home, where she is surprised when her sister Amelia finally stands up to her. Amelia has a nervous breakdown afterwards, but she is on the road to gaining more respect.\nSara invites Becky to live with her and be her personal maid, in much better living conditions than at Miss Minchin's. Carrisford becomes a second father to Sara and quickly regains his health. Finally, Sara - accompanied by Becky - pays a visit to the bakery where she bought the buns, making a deal with the owner to cover the bills for bread for any hungry child. They find that the beggar girl who was saved from starvation by Sara's selfless act is now the bakery owner's assistant, with good food, clothing, shelter, and steady employment."}