{"mid": "AllCheerleadersDie", "IMDB_id": "tt2527186", "title": "All Cheerleaders Die", "plot": "The film opens with Maddy Killian (Caitlin Stasey) recording footage of her childhood friend Alexis (Felisha Cooper) as she prepares for the final days of school before summer break and for cheerleading practice. She discusses how important it is to remain fit and how dangerous cheerleading can be, pointing out how easy it is for some of the more advanced cheerleader moves to end with severe or deadly injuries. This proves to be the case when Alexis is thrown into the air and her teammates fail to catch her in time, resulting in her death.\nOnce school resumes Maddy decides that she will try out for the cheerleading team and manages to impress the entire team with her acrobatic skills. After being accepted, Maddy notes that Tracy (Brooke Butler) has begun dating Terry (Tom Williamson), a star football player who had been dating Alexis prior to her death. She begins to get along with the other cheerleaders, the overly religious and prissy Martha (Reanin Johannink) and her shy sister Hanna (Amanda Grace Cooper), who serves as the cheerleading mascot. This provokes Maddy's ex-girlfriend Leena (Sianoa Smit-McPhee), who can't understand why Maddy would want to hang out with the cheerleaders. Unbeknownst to everyone else, Maddy has actually joined the cheerleading squad to take revenge on Terry for as yet unspecified reasons.\nMaddy begins taking her revenge by convincing Tracy that Terry had cheated on her during the summer and even manages to successfully seduce her at a group gathering of cheerleaders and football players. This greatly hurts Leena (who had been watching the gathering from afar) and angers Terry, who starts a fight, and bans the \"dogs\" (football players) from dating the \"bitches\" (cheerleaders).\nHe then punches Tracy in a fit of anger. The cheerleaders all try to escape the raging football players, only for Terry to cause an accident that claims the lives of all of the cheerleaders. Horrified at what she's seen, Leena manages to revive all of the dead cheerleaders using Wicca magic and magic stones. The following day the girls are all disoriented and scared, especially Martha and Hanna, as they have also somehow swapped bodies.\nNone of them recollect exactly what happened until Leena reveals to them what occurred the night before. They're also very hungry, which prompts them to attack one of Leena's neighbors and suck out all of his blood. The girls then go to school, where the football players all watch them with disbelief, as they'd thought them all dead. During the day the cheerleaders pick off the football players one by one, either out of hunger or, in the case of Martha, out of anger when she realizes that her sister slept with her boyfriend, Manny (Leigh Parker), using her body.\nWhile the girls were all initially willing to work together, their solidarity unravels due to the day's deaths and the discovery from Maddy's video diaries that she had joined the squad out of revenge. She tries to explain her cruel criticism of them, but none of the others will listen to her, especially not Tracy, as she had genuinely begun to fall in love with Maddy.\nThe only person who will listen is Leena and Maddy tells her that she had been raped by Terry while attempting to film a memorial video for Alexis and that up until that point, she had not wanted revenge. The girls are then picked off one by one by Terry, who has figured out what is going on and manages to defeat them by cutting out the magic stones (which reside in the girls' bodies) and swallowing them.\nTerry manages to corner Maddy and Leena in a graveyard where he tries to force Leena to show him how to use her magic for his benefit, only for him to die after Maddy attacks him and Leena's magic somehow manages to force the stones out of him. Maddy dies again as a result of this but Leena manages to revive her through her own grief, the same thing that caused the original resurrection. The two embrace and kiss, only to find that a bloody Alexis is tearing her way out of Terry's corpse (as he had landed on her grave) and screaming Leena's name. The film then cuts to the title card, which reveals that the film is part one in a series and that there will be a sequel."}