{"mid": "AllQuietOnTheWesternFront", "IMDB_id": "tt0020629", "title": "All Quiet on the Western Front", "plot": "The book tells the story of Paul Bäumer, a German soldier who—urged on by his school teacher—joins the German army shortly after the start of World War I. His class was \"scattered over the platoons amongst Frisian fishermen, peasants, and labourers.\" Bäumer arrives at the Western Front with his friends and schoolmates (Leer, Müller, Kropp and a number of other characters). There they meet Stanislaus Katczinsky, an older soldier, nicknamed Kat, who becomes Paul's mentor. While fighting at the front, Bäumer and his comrades have to engage in frequent battles and endure the treacherous and filthy conditions of trench warfare.\nAt the very beginning of the book, Erich Maria Remarque says \"This book is to be neither an accusation nor a confession, and least of all an adventure, for death is not an adventure to those who stand face to face with it. It will try simply to tell of a generation of men who, even though they may have escaped (its) shells, were destroyed by the war.\" The book does not focus on heroic stories of bravery, but rather gives a view of the conditions in which the soldiers find themselves. The monotony between battles, the constant threat of artillery fire and bombardments, the struggle to find food, the lack of training of young recruits (meaning lower chances of survival), and the overarching role of random chance in the lives and deaths of the soldiers are described in detail.\nThe battles fought here have no names and seem to have little overall significance, except for the impending possibility of injury or death for Bäumer and his comrades. Only pitifully small pieces of land are gained, about the size of a football field, which are often lost again later. Remarque often refers to the living soldiers as old and dead, emotionally drained and shaken. \"We are not youth any longer. We don't want to take the world by storm. We are fleeing from ourselves, from our life. We were eighteen and had begun to love life and the world; and we had to shoot it to pieces.\"\nPaul's visit on leave to his home highlights the cost of the war on his psyche. The town has not changed since he went off to war; however, he finds that he does \"not belong here anymore, it is a foreign world.\" He feels disconnected from most of the townspeople. His father asks him \"stupid and distressing\" questions about his war experiences, not understanding \"that a man cannot talk of such things.\" An old schoolmaster lectures him about strategy and advancing to Paris while insisting that Paul and his friends know only their \"own little sector\" of the war but nothing of the big picture.\nIndeed, the only person he remains connected to is his dying mother, with whom he shares a tender, yet restrained relationship. The night before he is to return from leave, he stays up with her, exchanging small expressions of love and concern for each other. He thinks to himself, \"Ah! Mother, Mother! How can it be that I must part from you? Here I sit and there you are lying; we have so much to say, and we shall never say it.\" In the end, he concludes that he \"ought never to have come [home] on leave.\"\nPaul feels glad to be reunited with his comrades. Soon after, he volunteers to go on a patrol and kills a man for the first time in hand-to-hand combat. He watches the man die, in pain for hours. He feels remorse and asks forgiveness from the man's corpse. He is devastated and later confesses to Kat and Albert, who try to comfort him and reassure him that it is only part of the war. They are then sent on what Paul calls a \"good job.\" They must guard a supply depot in a village that was evacuated due to being shelled too heavily. During this time, the men are able to adequately feed themselves, unlike the near-starvation conditions in the German trenches. In addition, the men enjoy themselves while living off the spoils from the village and officers' luxuries from the supply depot (such as fine cigars). While evacuating the villagers (enemy civilians), Paul and Albert are taken by surprise by artillery fired at the civilian convoy and wounded by a shell. On the train back home, Albert takes a turn for the worse and cannot complete the journey, instead being sent off the train to recuperate in a Catholic hospital. Paul uses a combination of bartering and manipulation to stay by Albert's side. Albert eventually has his leg amputated, while Paul is deemed fit for service and returned to the front.\nBy now, the war is nearing its end and the German Army is retreating. In despair, Paul watches as his friends fall one by one. It is the death of Kat that eventually makes Paul careless about living. In the final chapter, he comments that peace is coming soon, but he does not see the future as bright and shining with hope. Paul feels that he has no aims or goals left in life and that their generation will be different and misunderstood. When he dies at the end of the novel, the situation report from the frontline states, \"All is Quiet on the Western Front.\""}