{"mid": "AllStarSuperman", "IMDB_id": "tt1699114", "title": "All-Star Superman", "plot": "Dr. Leo Quintum and his team from P.R.O.J.E.C.T. are exploring the Sun when they are remotely sabotaged by Lex Luthor. Superman rescues them, and acquires the ability to project his bio-electric aura. Luthor orchestrated this event to overwhelm Superman's cells with massive amounts of solar radiation, and Quintum determines that Superman's new level of power is also killing him, and he has one year left to live. Luthor is arrested, thanks to a Daily Planet article by Clark Kent. Superman decides to keep his impending death secret from the public.\nHowever, Superman reveals his secret identity to Lois Lane, because he wants to spend his remaining time with her. Lois initially refuses to believe that Clark and Superman are the same person. For her birthday, Superman takes Lois to the Fortress of Solitude, where they have dinner in a stateroom of the RMS Titanic. During this visit, he also tells Lois that she can explore the Fortress save for one room he is constantly checking. Superman's behavior heightens Lois' suspicions and she becomes paranoid. She attacks Superman with a Kryptonite laser, but his enhanced powers have rendered him immune to it.\nSuperman calms her down and reveals that he was preparing her birthday present in the off-limits room: a costume for her and a liquefied form of his DNA that will grant her all his superpowers for 24 hours. Using the name \"Superwoman\", she and Superman stop a monster attack in Metropolis involving Samson, Atlas and an Ultra-Sphinx. Superman drives Samson and Altas away and he and Lois spend an eventful day that ends with them kissing on the moon before her powers fade and she falls asleep. Superman flies her back home.\nLuthor is convicted of crimes against humanity and sentenced to death. Clark meets Luthor for an interview at Stryker's Island. Luthor discloses his respect for Clark as a journalist and states that he has no desire to escape as long as he defeats Superman by causing his death. He reveals to Clark that Superman is dying, hoping that it will be published in the Daily Planet.\nNearing death, Superman accomplishes a variety of tasks that significantly help both humans & Kryptonians and completes his last will and testament. Meanwhile, Luthor survives his execution as he took a serum similar to what Superman made for Lois and escapes. Superman then learns of Luthor's ally Solaris, who has tampered with the sun. Superman engages Solaris until a Sun-Eater that Superman had cared for in the Fortress and subsequently released returns to sacrifice itself to weaken it. Superman defeats Solaris, leaving its body intact because he has learned from the Superman Squad that Solaris will become an ally in the future. Clark returns to the Daily Planet to submit his article but falls dead. As the staff tries to save him, Luthor arrives and attacks Metropolis.\nBelieving he is on his home planet of Krypton, Superman joins his Kryptonian father Jor-El, who reveals that Superman's body is converting itself to a solar radio-consciousness. He offers him a choice: remain or come back to life. Clark wakes up and fights Luthor with a gravity gun. The gravity gun warps time for Luthor, burning out his powers. As his powers fade, Luthor briefly sees the world as Superman sees it, and weeps before Superman knocks him out. Superman and Lois embrace and he proclaims his love for her once and for all. He takes off, flies into the Sun and repairs it, saving the day for one last time. One year later, Lois tells Jimmy that she still believes Superman will return. Inside the sun, Superman, now a solar being, maintains machinery to keep the sun alive. The story concludes with Quintum revealing that if something happens, they will be ready, standing before a door with Superman's characteristic shield, but with its usual \"S\" replaced with the number \"2\".\nKal-El himself would one day emerge from his seclusion: he was seen once from countless thousands of years in the future, having evolved into a sort of golden god, meeting with his past self shortly after the death of Jonathan Kent and his masquerade as the Unknown Superman, and shortly before his own 'death'. The future Superman presented his dying past self with an indestructible golden flower from New Krypton, \"For him, from all of us. In remembrance of all that we are. And all that we will be.\" The flower was planted at Jonathan Kent's grave."}