{"mid": "AllThatJazz", "IMDB_id": "tt0078754", "title": "All That Jazz", "plot": "Joe Gideon is a theater director and choreographer trying to balance work on his latest Broadway musical with editing a Hollywood film he has directed. He is a workaholic who chain-smokes cigarettes, and without a daily dose of Vivaldi, Visine, Alka-Seltzer, Dexedrine, and sex, he wouldn't have the energy to keep up the biggest \"show\" of all — his life. His girlfriend Katie Jagger, his ex-wife Audrey Paris, and daughter Michelle try to pull him back from the brink, but it is too late for his exhausted body and stress-ravaged heart. In his imagination, he flirts with an angel of death named Angelique.\nGideon's condition gets progressively worse. He is rushed to a hospital after experiencing chest pains during a particularly stressful table read (with the penny-pinching backers in attendance) and admitted with severe attacks of angina. Joe brushes off his symptoms, and attempts to leave to go back to rehearsal, but he collapses in the doctor's office and is ordered to stay in the hospital for three to four weeks to rest his heart and recover from his exhaustion. The show is postponed, but Gideon continues his antics from the hospital bed, in brazen denial of his mortality. Champagne flows, endless strings of women frolic around his hospital room and the cigarettes are always lit. Cardiogram readings don't show any improvement as Gideon dances with death. As the negative reviews for his feature film (which has been released without him) come in, Gideon has a massive coronary and is taken straight to coronary artery bypass surgery.\nThe backers for the show must then decide whether it's time to pack up or replace Gideon as the director. Their matter-of-fact money-oriented negotiations with the insurers are juxtaposed with graphic scenes of (presumably Joe's) open heart surgery. The producers realize that the best way to recoup their money and make a profit is to bet on Gideon dying — the insurance proceeds would result in a profit of over USD$500,000. Meanwhile, elements from Gideon's past life are staged in dazzling dream sequences of musical numbers he directs from his hospital bed while on life support. Realizing his death is imminent, his mortality unconquerable, Gideon has another heart attack. In the glittery finale, he goes through the five stages of grief — anger, denial, bargaining, depression and acceptance - featured in the stand-up routine he has been editing. As death closes in on Gideon, the fantasy episodes become more hallucinatory and extravagant, and in a final epilogue that is set up as a truly monumental live variety show featuring everyone from his past, Gideon himself takes center stage.\nThe final shot shows Joe Gideon's body being zipped up in a body bag."}