{"mid": "AllTheKingsMen", "IMDB_id": "tt0041113", "title": "All the King's Men", "plot": "All the King's Men portrays the dramatic political rise and governorship of Willie Stark, a cynical populist in the American South during the 1930s. The novel is narrated by Jack Burden, a political reporter who comes to work as Governor Stark's right-hand man. The trajectory of Stark's career is interwoven with Jack Burden's life story and philosophical reflections: \"the story of Willie Stark and the story of Jack Burden are, in one sense, one story.\"\nThe novel evolved from a verse play that Warren began writing in 1936 entitled Proud Flesh. One of the characters in Proud Flesh was named Willie Talos, in reference to the brutal character Talus in Edmund Spenser's late 16th century work The Faerie Queene.\nA 2002 version of All the King's Men, re-edited by Noel Polk (ISBN 0-15-100610-5), keeps the name \"Willie Talos\" for the Boss as originally written in Warren's manuscript, and is known as the \"restored edition\" for using this name as well as printing several passages removed from the original edit.\nWarren claimed that All the King's Men was \"never intended to be a book about politics.\"\n=== Themes and imagery ===\nOne central motif of the novel is that all actions have consequences, and that it is impossible for an individual to stand aloof and be a mere observer of life, as Jack tries to do (first as a graduate student doing historical research and later as a wisecracking newspaperman). In the atmosphere of the 1930s, the whole population seemed to abandon responsibility by living vicariously through messianic political figures like Willie Stark. Thus, Stark fulfills the wishes of many of the characters, or seems to do so. For instance, his faithful bodyguard Sugar-Boy, who stutters, loves Stark because \"the b-boss could t-talk so good\"; Jack Burden cannot bring himself to sleep with Anne Stanton, whom he loves, but Stark does so; and so on. (It is in this sense that the characters are \"all the king's men\"; other than borrowing this familiar phrase, the title has nothing to do with the story of Humpty Dumpty. The title is possibly derived from the motto of Huey P. Long, whose life was similar to that of Willie Stark, \"Every Man a King\".) But this vicarious achievement will eventually fail; ultimately Jack realizes that one must \"go out of history into history and the awful responsibility of Time\".\nThe novel explores conceptions of Calvinist theology, such as original sin (\"Man is conceived in sin and born in corruption, and he passeth from the stink of the didie to the stench of the shroud,\" says Willie when told that no adverse information about an opponent would be likely to be found. \"There's always something.\"); and total depravity (\"You got to make good out of bad,\" says Willie when his ruthless methods are criticized. \"That's all there is to make it with.\") Jack discovers that no man is invulnerable to sin under the right circumstances, and thus his search for dirt on the judge begins with questions as to what circumstances would cause one to do wrong. Jack, Willie, and Adam all abandon idealism when they realize that nobody is pure and unblemished.\nAnother motif in the novel is the \"Great Twitch\". When Jack Burden unexpectedly discovers that the love of his life, Anne Stanton, has been sleeping with Governor Willie Stark, he impulsively jumps in his car and drives to California to obtain some distance from the situation. Jack's description of his trip contains overt and indirect references to the notion of Manifest Destiny, which becomes somewhat ironic when he comes back from it believing in the \"Great Twitch\".\nThe \"Great Twitch\" is a particular brand of nihilism that Jack embraces during this journey westward: \"all the words we speak meant nothing and there was only the pulse in the blood and the twitch of the nerve, like a dead frog's leg in the experiment when the electric current goes through.\" On his way back from California, Jack gives a ride to an old man who has an involuntary facial twitch. This image becomes for him the encapsulating metaphor for the idea that \"all life is but the dark heave of blood and the twitch of the nerve.\" In other words, life is without meaning; everything is motivated by some inborn reflex action and nobody is responsible for their choices or even their own destiny. (The concept is brought to life for Jack when he witnesses a lobotomy performed by Adam Stanton.) The emotional distance permitted by this revelation releases Jack from his own frustration stemming from the relationship between Anne Stanton and his boss, and allows him to return to circumstances which were previously unbearable.\nSubsequent events (including the tragic deaths of Governor Stark, Jack's lifelong friend Adam Stanton, and Judge Irwin, Jack's father) convince Jack that the revelation of the \"Great Twitch\" is an insufficient paradigm to explain what he has seen of history. \"[H]e saw that though doomed, [his friends] had nothing to do with any doom under the godhead of the Great Twitch. They were doomed, but they lived in the agony of will.\" Ultimately, he grows to accept some responsibility for his part in the destruction of his friends' lives.\nThe book also touches on Oedipal themes, as Jack discovers his father's true identity after having caused his death.\nThe theme of one's father's identity and its effects on one's own sense of identity is explored twice in the novel, first through Adam and Anne's painful discovery that their father (the late Governor Stanton) once assisted in the cover-up of a bribery scandal. Then Jack discovers that his biological father is Judge Irwin, not, as he previously believed, \"the Scholarly Attorney\". In each case, the discovery catalyzes an upheaval in the character's moral outlook.\nTime is another of the novel's thematic fascinations. The idea that every moment in the past contains the seeds of the future is constantly explored through the novel's non-chronological narrative, which reveals character continuities and thematic connections across different time periods."}