{"mid": "AllThroughTheNight", "IMDB_id": "tt0034449", "title": "All Through the Night", "plot": "Alfred \"Gloves\" Donahue (Humphrey Bogart), a big-shot Broadway gambler, is alerted by his mother, 'Ma' Donahue (Jane Darwell), that her neighbor, Mr. Miller (Ludwig Stossel), a baker who makes Gloves' favorite cheesecake, is missing. Upon searching the bakery, Gloves finds Miller's dead body. A young singer, Leda Hamilton (Kaaren Verne), quickly leaves the shop upon hearing about Miller's demise. Mrs. Donahue believes that the girl knows something and tracks her down to a night club, where she creates a racket by \"crabbing\" about Miller's death. Co-partner of the Duchess Club, Marty Callahan (Barton MacLane), calls Gloves, insisting that he come down and take care of the situation. While at the club, Gloves has a drink with Leda that is interrupted by her piano player, Pepi (Peter Lorre), who takes her away to a back room, where he shoots Marty's partner, Joe Denning (Edward Brophy). Lena and Pepi then disappear in a taxi as Gloves stumbles upon Joe. Before dying, Joe raises up five fingers to indicate who took Leda. Gloves quickly leaves to search for Leda, inadvertently leaving one of his gloves at the murder scene.\nWhile being suspected of Joe's murder by Marty and the police, Gloves traces the taxi to an antique/auction house, named I.J. Madison, Inc. Importers and Exporters, operated by Hall Ebbing (Conrad Veidt) and his assistant, Madame (Judith Anderson). While posing as a bidder in the successful acquisition of a desk, Gloves is recognized by Pepi. He subsequently gets knocked-out by Leda, tied up, and left in a storage room with one of his boys, Sunshine (William Demarest), who was earlier captured. Later, Leta visits them, enabling them to break free from their ropes before they are packed up in crates and shipped out. Before escaping, Gloves and Sunshine walk into a room with maps, charts, a short-wave radio, and a portrait of Adolf Hitler, now knowing that their captors are \"fivers\" or Nazi fifth columnists, which is what Joe was indicating before he died. Gloves finds a notebook and reads Miller's name in it as well as that of \"Leda Hamilton\", her Jewish name \"Uda Hammel\", and the death of her father \"Ludwig Hammel\" at the Dachau concentration camp.\nWith Leda in tow, they escape the building by climbing down from a balcony. They are chased by Ebbing and his cronies into Central Park. It is here that Leda explains that she is working with Ebbing only to save her father's life at Dachau. While Gloves fights with a Nazi, Leda reads the torn-out page that states her father is already dead. Gloves and Leda go to the police, who search the antique house but find it empty. Disbelieving Glove's story, they attempt to arrest him, but he escapes by diving into the East River. He arrives at his lawyer's (Wallace Ford) apartment, only to have Marty and his mob break in, eager to avenge Joe's murder. After Gloves convinces them of his innocence, the two gangs join forces against the Nazi spies.\nGloves, Sunshine, and Barney (Frank McHugh) go to the police station where Leda is being held. Ebbing, however, has bailed her out, and they arrive as she is being forced into a car. They chase the car to a shop named Madison Novelty Co., where an underground Nazi meeting is being held. Gloves and Sunshine pose as Nazi cronies to get into the meeting, which eventually gets broken up by the combined gangs. Ebbing escapes, shooting Pepi to death, as he refused to take part in a two-man suicide mission. Ebbing intends to proceed on the plan to blow up a battleship in New York harbor. Gloves follows him to the docks, where Ebbing surprises him and forces him into a motorboat containing high explosives. At gunpoint, Ebbing forces Gloves to steer the boat in the direction of the battleship. Gloves suddenly veers the boat off its course, and he jumps into the water, while the boat with Ebbing on board crashes into a barge and explodes.\nBack at the police station, Gloves and Leda find out that all charges have been dropped against them and that the mayor is going to honor him at city hall. Ma Donahue enters complaining that the milkman has disappeared, and she is afraid something has happened to him. Gloves asks: \"What makes you think that?\" Ma states, \"Well, son, I've got a feeling\", as the movie ends."}