{"mid": "AllThisAndHeavenToo", "IMDB_id": "tt0032194", "title": "All This, and Heaven Too", "plot": "Mademoiselle Henriette Deluzy-Desportes (Bette Davis), a French woman, starts teaching at an American girls school. She is confronted by the tales and gossip about her that circulate among her pupils and, thus provoked, she decides to tell them her life story.\nDeluzy-Desportes is governess to the four children of the Duc de Praslin (Charles Boyer) and the Duchesse de Praslin (Barbara O'Neil) in Paris during the last years of the Orleans monarchy. As a result of the Duchesse's constantly erratic and temperamental behavior, all that remains is an unhappy marriage, but the Duc remains with his wife for sake of their children.\nHer warmth and kindness wins her the love and affection of the children and their father, but also the jealousy and hatred of their mother. She is forced to leave and the Duchess refuses to give her a letter of recommendation to future employers. The Duc confronts his wife and she invents alternate letters taking opposite attitudes, which in fact she has not written and does not intend to write. Her account enrages him and, at the breaking point, he kills her.\nThe Duc de Praslin is in a privileged position; as a peer his case can only be heard by other nobles. He refuses to confess his guilt or openly to admit his love for Henriette Deluzy-Desportes, knowing that his fellow nobles wish to use such an admission to blame her for the murder by declaring that he was acting at her bidding. Ultimately the Duc takes poison to prevent himself from ever publicly proclaiming his love for Henriette, since he knows that would convict her; however, he lives long enough to reveal it to another of his servants, Pierre (Harry Davenport), a kindly old man who had warned the governess to leave the de Praslin household. With the Duc's death, the authorities accept that they have no evidence upon which to base a judgment that Henriette solicited the murder and she is released.\nDeluzy-Desportes had been recommended for the teaching position \"in the land of the free\" by an American minister, Rev. Henry Field (Jeffrey Lynn), to whom she had expressed a loss of faith while in prison. He proposes marriage, and it is implied that Henriette will accept."}