{"mid": "AlohaScoobyDoo", "IMDB_id": "tt0433771", "title": "Aloha, Scooby-Doo!", "plot": "The gang travels to Hawaii on a free trip from a surfing company called \"Goha Aloha\". The company wants Daphne to design some new swimwear for them. The gang also goes there to see the Big Kahuna of Hanahuna Surfing Contest. However, the contest used to only be open for the natives and not for mainlanders, but now the mayor has made it open for everybody. Many locals are angry because of this, especially Manu Tuiama, a beefcake local surfer, and his friend, Little Jim. Just a few days before the contest, the demons of the evil Wiki-Tiki spirit attacked the village and kidnapped Snookie, Manu's beautiful girlfriend. This drives away most of the tourists and surfers, and the locals believe the spirit is angry that the surfing contest is open to anybody, and also that a new resort, Coconut Beach Condominiums, is being built on supposedly sacred ground by local real estate agent Ruben Laluna. When the gang meets Jared Moon, a representative from the Goha Aloha-company in Hanahuna, he's selling tiki charms that are supposed to ward off evil demons. The mayor refuses to postpone the contest, even after the Tiki demons attack again at a feast.\nThe gang wants to get to the bottom of the mystery, and go to Auntie Mahina, a local shawoman who lives deep in the jungle. On the way there, Manu seemingly gets kidnapped by the Wiki-Tiki. Auntie Mahina tells them the Wiki-Tiki is angry at the mainlanders; the surfing contest is hinted by her to be a Hawaiian ritual and that the winner has to be of Hawaiian descent. She says they need to go to the cave where the monster lives to get rid of it, or Snookie and Manu will be sacrificed in the volcano. She also gives Fred a necklace which should keep the monster away. The necklace is filled with an extract from a sacred root called bola gawana, which she claims that the ancients used to repel away evil spirits. The gang goes to the cave, and get chased by bats and the little demons, until they lose them and find Snookie, who tries to lead them out before getting recaptured by the Wiki-Tiki.\nThe gang then find themselves in a snake pit cave, but are able to get out of it because of music by Shaggy and Scooby-Doo. Then they find that the Wiki-Tiki is not really an evil spirit after all. They find the demons are just robots and the cave they are in is inside the volcano on the island. They also see the surfboard the Wiki-Tiki is using is a Goha Aloha-brand surfboard. Back at the island, it is only one day until the contest, and the locals are really scared something bad will happen. Little Jim blames the mayor for Snookie and Manu's disappearances, and says that whatever happens during the contest will be her fault as well.\nThe following day, Daphne enters the contest in hopes of capturing the Wiki-Tiki, whom they are sure will show up. Sure enough, it comes and scares the surfers and chases Shaggy and Scooby, until it was washed up by a wave. The gang unmasks the Wiki-Tiki, and find it to be Manu, who wanted to scare off both the locals and the tourists so he and Snookie (whose real name is revealed to be Pamela Waeawa) could buy up all (or at least most) of the real estate on the island and then sell it back to the original owners at a big profit. Velma also says that Snookie's an expert in rocket science and robotics, and created the \"demons\". Scooby wins the contest for the way he and Shaggy surfed while battling Manu. Manu expresses his shock and anger at losing the surfing contest to a dog as he and Snookie are arrested and taken to jail.\nLater that night, the gang plus the mayor, Little Jim, Jared Moon, Ruben Laluna and Auntie Mahina enjoy a big luau at the hotel the gang was staying at—during which Laluna informs them that the property bought up by Manu and Snookie will be returned to the original owners and Jared Moon tells Daphne that the Goha Aloha-company loved her designs and wants to buy them (he also gives her a free tiki charm). After Auntie Mahina thanks the gang for what they did, the mini-tikis come to the party and advance—but, instead of attacking people, they start dancing. It's revealed that Scooby has the remote control for them and he's the one making them dance. Everyone laughs while Scooby says his catchphrase before saying \"Aloha!\"."}