{"mid": "AlteredStates", "IMDB_id": "tt0080360", "title": "Altered States", "plot": "Edward Jessup is a university professor of abnormal psychology who, while studying schizophrenia, begins to think that \"our other states of consciousness are as real as our waking states.\" Jessup begins experimenting with sensory deprivation using a flotation tank, aided by two like-minded researchers, Parrish and Rosenberg. At a faculty party he meets fellow \"wonder kid\" and biological anthropologist Emily, and the two eventually marry.\nThe film skips ahead seven years. Eddie and Emily have two daughters, are on the brink of divorce, and reunite with the couple who first introduced them. When Edward hears of a Mexican tribe that experiences shared illusion states, he travels to Mexico to participate in what is apparently an Ayahuasca Ceremony. During the walk into the bush his guide states that the indigenous tribe they are meeting works with Amanita muscaria which they are collecting for next year's ceremonies. The tribe refer to one of the ingredients of the mixture they use as \"First Flower.\" An indigenous elder is seen with Banisteriopsis caapi root in his hand prior to cutting Jessup's hand, adding blood to the mixture he is preparing. Immediately after consuming the mixture, Edward experiences bizarre, intense hallucinations. He returns to the U.S. with a tincture and continues taking it to trigger his ability to experience altered states of consciousness.\nWhen toxic concentrations of the substance make increased dosage dangerous, Jessup returns to sensory deprivation, believing it will enhance the effects of the substance at his current dose. Repairing a disused tank in a medical school, Jessup uses it to experience a series of increasingly drastic visions, including one of early hominids. Monitored by his colleagues, Jessup insists that his visions have \"externalized\". Emerging from the tank, his mouth bloody, frantically writing notes because he is unable to speak, Jessup insists on his being x-rayed before he \"reconstitutes.\" A radiologist inspecting Jessup's X-rays says that they belong to a gorilla.\nIn later experiments, Jessup experiences actual, physical biological devolution. At one stage he emerges from the isolation tank as a feral and curiously small-statured, light-skinned Primitive Man, going on a rampage before returning to his natural form. Despite the concern of colleagues, Jessup stubbornly continues.\nIn the ultimate experiment, Edward experiences a more profound regression, transforming into an amorphous mass of conscious, primordial matter. An energy wave released from the experiment stuns Jessup's colleagues, and destroys Jessup's tank. Emily arrives to find a swirling maelstrom where the tank had been. Emily searches the vortex for Jessup, finding him as he is on the brink of becoming a non-physical form of proto-consciousness and possibly disappearing from our version of reality altogether.\nHis friends bring Edward home, hoping that the transformations will end. Watched over by Emily, Jessup again begins to regress again, the transformations no longer requiring intake of \"first flower\" or sensory deprivation. Urging Jessup to fight the change, Emily grabs his hand, immediately being enveloped by the primordial energy emanating from Jessup. The sight of Jessup's wife, apparently being consumed by the energy, stirs the human consciousness in Jessup's devolving form. He fights the transformation and returns to his human form. In the final scene, Jessup embraces Emily, and his love for her returns him to normal."}