{"mid": "AlvinAndTheChipmunksMeetTheWolfman", "IMDB_id": "tt0252227", "title": "Alvin and the Chipmunks Meet the Wolfman", "plot": "The movie begins with Alvin having nightmares of meeting the Wolf Man, leading to him wake up screaming in fear. Simon and Dave conclude that Alvin's been watching too many horror films at night. Alvin says that it is because their new neighbor, Lawrence Talbot, creeps him out and speculates that he is hiding something. Theodore is having trouble with Nathan, a bully, and will not go to the principal, who plans to retire due to Alvin's daily mishaps, for help. However, Alvin sticks up for him.\nTheir school is rehearsing the play for the famous horror story Strange Case of Dr Jekyll and Mr Hyde by Robert Louis Stevenson. When yet another accident caused by Alvin when mixing unknown chemicals that result in a huge explosion and mess of the school auditorium, Principal Milliken and Dave decide that Alvin be pulled out of his role as Mr. Hyde. To boost his self-esteem, they decide to have Theodore replace the role. Meanwhile, Alvin and Simon are out in search of proof of werewolves (Munks on a Mission). Meanwhile, no one believes that Theodore is scary enough to play the role of Mr. Hyde. However, that all changes after he gets bit by a large dog (later finding out it was a werewolf) on his way home after giving a necklace as a gift to Eleanor, whom he is harboring a secret crush on. The next day at the rehearsal, Theodore does an extremely terrifying impression of Mr. Hyde. Despite this triumph, Theodore's personality continues to drastically change, becoming more vicious and mean. With their brother now a werewolf, Alvin and Simon search for a way to help Theodore and save the school play without Dave finding out the truth (Monster Out in You).\nDespite their best efforts, they find no solution. They eventually decide to take up some advice from known psychic Madame Raya. She says that Theodore is already close to the animal state and will turn into a werewolf soon enough. Simon and Alvin ask her if there is any way to cure him. She suggests knocking him with a silver cane while he is still a \"puppy\" before the next full moon when the transformation will be complete. Heeding this advice, Alvin breaks into Mr. Talbot's home and steals his silver cane. However, as he runs away with it, he knocks into Dave. That night, Dave goes to see Mr. Talbot to apologize and explain everything to him. However, during the conversation, the full moon rises and he transforms into a werewolf. Terrified, Dave runs to the school to warn the boys. However, he runs into a pole, knocking him unconscious. Having followed Dave to the school, Mr. Talbot makes his way inside.\nDuring the play, Theodore changes into a werewolf while on set and starts to attack Eleanor. However, after cornering her, the necklace Theodore gave her earlier shines by the moon, causing Theodore to remember his feelings towards her and to flee. Eleanor follows him, determined to help him, only to almost be attacked by Mr. Talbot, who was the original werewolf that bit Theodore. Theodore quickly defends her and attacks Mr. Talbot, biting him during the struggle. As a result of the bite, Mr. Talbot changes back into a human and Theodore back into a chipmunk. Confused by what happened, Simon explains to everyone how the bite cured them by causing the effect to reverse on them both. With the happy news delivered, Alvin quickly runs up to the stage to join in the applause by the crowd, who believes the entire incident was just an act.\nAt the wrap party, they find out Mr. Talbot is going to be their new principal. Having woke up, Dave shows up as he gives his speech about his new position and nearly attacks him. The boys quickly explain that Theodore took care of everything (leaving out most of the film's events), leaving Dave impressed and proud of him. As Dave hugs Theodore, Mr. Talbot thanks him. The Chipmunks and Chipettes end the wrap party by doing their famous performances, and soon everyone else follow the rhythm as the movie ends with (Everything's Gonna Be Alright)."}