{"mid": "AMatterOfLifeAndDeath", "IMDB_id": "tt0038733", "title": "A Matter of Life and Death", "plot": "On 2 May 1945, Squadron leader Peter Carter is a Royal Air Force pilot trying to fly a badly damaged and burning Lancaster bomber back to his base in England after a mission over Germany. He has ordered his crew to bail out, without revealing that his own parachute has been shot up. He manages to contact June, an American radio operator based in England and talks with her for a few minutes before jumping without a parachute.\nPeter should have died at that point, but Conductor 71, the guide sent to escort him to the Other World, misses him in the thick fog over the English Channel. The airman wakes up on a beach near June's base. At first, he assumes he is in the afterlife but, when a de Havilland Mosquito flies low overhead, discovers, to his bewilderment, that he is still alive.\nPeter meets June cycling back to her quarters after her night shift; and they fall in love. Conductor 71 (a French aristocrat guillotined in the Revolution) stops time to explain the situation, urging Peter to accept his death and accompany him to the Other World; but Peter demands an appeal. While Conductor 71 consults his superiors, Peter continues to live his life. Conductor 71 returns and informs him that he has been granted his appeal and has three days to prepare his case. He can choose a defence counsel from among all the people who have ever died, but he has difficulty picking one.\nPeter's visions are diagnosed by June's fascinated friend Doctor Reeves as a symptom of a brain injury—chronic adhesive arachnoiditis from a slight concussion two years earlier—and he is scheduled for surgery. Reeves is killed in a motorcycle accident while trying to find the ambulance that is to take Peter to the hospital, which allows him to act as Peter's counsel.\nReeves argues that, through no fault of his own, his client was given additional time on Earth and that, during that time, he has fallen in love and now has an earthly commitment that should take precedence over the afterlife's claim on him. The matter comes to a head—in parallel with Peter's brain surgery—before a celestial court; the camera zooms out from an amphitheatre to reveal that it is as large as a spiral galaxy. The prosecutor is American Abraham Farlan, who hates the British for making him the first casualty of the American Revolutionary War. Reeves challenges the composition of the jury, which is made up of representatives who are prejudiced against the British. In fairness, the jury is replaced by a multicultural mixture of modern Americans whose origins are as varied as those they replace.\nReeves and Farlan both cite examples from British and world history to support their positions. In the end, Reeves has June take the stand (Conductor 71 makes her fall asleep in the \"real\" world by so she can testify) and proves that she genuinely loves Peter by telling her that the only way to save his life is to take his place. She steps onto the stairway to the Other World without hesitation and is carried away, leaving Peter behind. Then the stairway comes to an abrupt halt and June rushes back to Peter's open arms. As Reeves triumphantly explains, \"... nothing is stronger than the law in the universe, but on Earth, nothing is stronger than love.\"\nThe jury rules in Peter's favour. The Judge shows Reeves and Farlan the new lifespan granted to the defendant; Reeves calls it \"very generous\", and Farlan jokingly complains, then agrees to it. The two then engage in supportive banter with one another, and against the stern Chief Recorder, who protests against the breach of law. The scene then shifts to the operating room, where the surgery is declared a success by the surgeon."}