{"mid": "AMatterOfLoafAndDeath", "IMDB_id": "tt1118511", "title": "A Matter of Loaf and Death", "plot": "Baker Bob is murdered by an unseen assailant that he recognises; he is the latest of twelve local bakers to be killed. Meanwhile, Wallace and Gromit are running a \"Dough to Door\" delivery service from their bakery \"Top Bun\". While out delivering, the duo encounter Piella Bakewell, a former pin-up girl mascot for the Bake-O-Lite bread company, and her miniature poodle, Fluffles. The brakes on her bicycle appear to have failed as she careers down a hill and into the local zoo. They narrowly save her from crashing into the crocodile enclosure. Gromit becomes suspicious after testing the bicycle brakes and noticing that they work perfectly fine, but Wallace is smitten with Piella.\nA whirlwind romance ensues. Gromit quickly comes to resent Piella for her demanding and controlling relationship with Wallace and insistence on decorating the house (including Gromit's room). He does however befriend Fluffles, realising that she has been poorly treated by Piella. When Piella leaves her purse at the house, Wallace asks Gromit to return it. Upon arriving at Piella's affluent mansion, Gromit discovers photographs of Piella with the twelve murdered bakers. To his horror, Gromit deduces that Piella is the \"Cereal Killer\" as he discovers a picture with Wallace as her apparent intended thirteenth victim, thus completing a \"baker's dozen\". Gromit escapes the house after narrowly avoiding Piella.\nAs Wallace remains oblivious to the danger he's in, Gromit attempts to thwart Piella by installing an airport-style metal detector in their home, locking all their knives in the garden shed, and checking the soup she had brought with her for poison. Piella tricks Wallace into thinking that Gromit bit her and persuades him to chain Gromit up. She then almost succeeds at pushing Wallace to his death, but she is thwarted by a swinging bag of flour from Wallace's dough-mixing contraption. After being struck down and covered flour, Piella snaps into an angry outburst against bakers, then leaves. The following day, she returns to apologise with a large cake, and they agree to share it at a four o'clock tea. When Piella is leaving to attend to the absent Fluffles (who is \"not well\"), she says he will be getting a surprise. A worried Gromit follows her home only to be caught and imprisoned with Fluffles in a storeroom. Escaping in Piella's old Bake-O-Lite hot air balloon, they arrive at Wallace's house as he is lighting the candle.\nAfter a struggle, the cake falls to the floor and a bomb inside is revealed. While attempting to dispose of the bomb (pastiching a well-known scene from the 1966 film Batman), Wallace and Gromit are attacked by Piella, who confirms her murderous identity to the duo and reveals the reason for her hatred of bakers – she blames them for ruining her figure, and resents losing her job as the Bake-O-Lite girl after her obesity made her too heavy to ride the hot air balloon. While attempting to finish off Wallace, a battle ensues between Piella and Fluffles in a yellow forklift truck covered by giant oven mitts (pastiching the climactic power-loader fight in Aliens).\nIn the chaos, the bomb ends up in the back of Wallace's trousers. Gromit and Fluffles neutralise the explosion using a large amount of dough while Piella uses the distraction to leap onto her balloon and escape. However, owing to her weight, the balloon crashes into the crocodile pit at the zoo where she is eaten alive (off-screen). Distraught by the death of her owner, Fluffles leaves, with both Wallace and Gromit depressed over their losses. Deciding to take their minds off things, they head out to deliver bread and find Fluffles standing in the driveway. She joins them in the van and the three drive off into the sunset."}