{"mid": "AmazonWomenOnTheMoon", "IMDB_id": "tt0092546", "title": "Amazon Women on the Moon", "plot": "Fictional television station WIDB-TV (channel 8) experiences problems with its late-night airing of science-fiction classic Amazon Women on the Moon, a 1950s B movie in which Queen Lara (Sybil Danning) and Captain Nelson (Steve Forrest) battle exploding volcanoes and man-eating spiders on the moon. Waiting for the film to resume, an unseen viewer begins channel surfing—simulated by bursts of white noise—through late night cable, with the various segments and sketches of the film representing the programming found on different channels. The viewer intermittently returns to channel 8, where Amazon Women continues airing before faltering once more.\nThese segments feature:\nArsenio Hall as a man who nearly kills himself in a series of mishaps around his apartment;\nMonique Gabrielle as a model who goes about her daily routine in Malibu, California, completely naked;\nLou Jacobi as a man named Murray, zapped into the television, wandering throughout sketches looking for his wife;\nMichelle Pfeiffer and Peter Horton as a young couple having trouble with eccentric doctor Griffin Dunne delivering and then concealing their newborn baby;\nJoe Pantoliano as the presenter of a commercial recommending stapling carpet to a bald head as a hair loss prevention measure;\nDavid Alan Grier and B. B. King in a public-service appeal for \"blacks without soul\";\nRosanna Arquette as a young woman on a blind date, employing unusual methods of investigation to reveal the qualifications of Steve Guttenberg;\nHenry Silva as the host of a show entitled Bullshit or Not?, clearly intended as a spoof of Ripley's Believe It or Not! with Jack Palance and In Search of...;\nArchie Hahn as a man who dies after a critical mauling of his life (by Roger Barkley and Al Lohman, mimicking Gene Siskel and Roger Ebert), then is roasted at his funeral by a variety of people, including Steve Allen, Henny Youngman, and even his own wife;\nWilliam Marshall as the leader of the Video Pirates, who hijack an MCA Home Video ship, uncover a vast amount of videotapes and laserdiscs, and promptly begin illegally bootlegging the media;\nEd Begley, Jr., as the son of the Invisible Man, having trouble with his formula;\nAngel Tompkins as a president's First Lady who is also a former hooker;\nMatt Adler as a sexually frustrated teenager trying to purchase a pack of condoms, with unexpected results;\nMarc McClure renting a personalized date video that spills over into real life;\nAn epilogue at the end of the credits, with Carrie Fisher and Paul Bartel in a black-and-white ephemeral film warning about the spread of \"social diseases\" in the style of Reefer Madness.\n=== Alternative versions ===\nAn alternate version of the \"Pethouse Video\" sketch was filmed for the television broadcast of the film, with Monique Gabrielle in lingerie instead of appearing naked throughout the segment. However, most European television broadcasts of the film retained the original theatrical version. Bullshit or Not? was retitled Baloney or Not? for the television version.\nThe American television edit, in addition to the alternative \"Pethouse Video\" sketch, features an additional bridging sequence between the death of Harvey Pitnik and his subsequent celebrity roast. In it, the mortician successfully cons Pitnik's widow into having the celebrity roast as part of the funeral, and her performance gets such strong positive feedback, it becomes a continuing performance series lasting for weeks.\nThe DVD release features an unreleased sketch titled \"The Unknown Soldier\", starring Robert Loggia. Some television broadcasts of the film featured the sketches \"Peter Pan Theater\" and \"The French Ventriloquist's Dummy\", which were not present in the theatrical version."}