{"mid": "Americathon", "IMDB_id": "tt0078766", "title": "Americathon", "plot": "In the (then-near future) year 1998, the United States has run out of oil, and many Americans are living in their now-stationary cars and using nonpowered means of transportation such as jogging, riding bicycles and rollerskating. Many Americans wear sweatsuits. Paper money has become completely worthless, with all business transactions being conducted in gold; even a coin-operated elevator warns, \"Gold Coins Only\". In search of leadership, Americans elect Chet Roosevelt (Ritter) as President. Roosevelt, a \"cosmically inspired\" former governor of California, proves to have little in common with Teddy Roosevelt or FDR other than his name. Roosevelt, an overly-optimistic man who quotes positive affirmation slogans, stages a number of highly publicized fund raising events, all of which fail. He becomes interested in having a relationship with Vietnamese American pop superstar Mouling Jackson. Real money comes in the form of loans from a cartel of Native Americans, led by billionaire Sam Birdwater (George), in control of Nike (which has been renamed \"National Indian Knitting Enterprise\").\nThe federal government, now housed in \"The Western White House\" (a sub-leased condominium in Marina del Rey, California), finds itself facing national bankruptcy and in danger of being foreclosed and repossessed when Birdwater goes public on national television with the fact that he lent America billions of dollars and now wants the money back, the alternative being foreclosure and the country reverting to its original owners, stating, \"Hey, I have to eat, too. Does that make me a bad guy?\".\nIn desperation, Roosevelt hires a young television consultant Eric McMerkin (Riegert) to help produce a national raffle. Instead, they decide that the only way enough money can be raised to save America is instead to run a national telethon, and hire vapid TV celebrity Monty Rushmore (Korman) to host it. However, Presidential adviser Vincent Vanderhoff (Willard) is secretly plotting to have the telethon fail so that representatives of the United Hebrab Republic (formed by the merger of Israel and the Arab states) can purchase what is left of the country when Birdwater forecloses."}