{"mid": "AmericanBeauty", "IMDB_id": "tt0169547", "title": "American Beauty", "plot": "Lester Burnham is a middle-aged advertising executive and magazine writer who despises his job. He is unhappily married to Carolyn, a neurotic yet fiercely ambitious real estate broker who grows red roses in their yard; their teenaged daughter, Jane, abhors her parents and has low self-esteem. The Burnhams' new neighbors are the Fitts family, consisting of homophobic retired United States Marine Corps Colonel Frank Fitts, his near-catatonic wife, Barbara, and their teenaged son, Ricky, who constantly films his surroundings with a camcorder, collecting hundreds of recordings on videotapes in his bedroom. His job as a part-time bar caterer serves as a front for his secret marijuana dealings. Frank is a strict disciplinarian who previously sent Ricky to a military school and briefly committed him to a psychiatric hospital. Jim Olmeyer and Jim Berkley, a gay couple who live nearby, welcome the Fitts family to the neighborhood. On the way to school, Frank reveals his homophobia while he angrily discusses the incident with Ricky.\nLester becomes infatuated with Jane's vain friend, Angela Hayes, after seeing her perform a half-time dance routine at a high school basketball game with Jane. He starts having sexual fantasies about Angela, in which red rose petals are a recurring motif. Carolyn begins an affair with her married business rival, Buddy Kane. When Lester's boss and efficiency expert, Brad, tells him that he is to be laid off, Lester instead blackmails him for $60,000 and quits his job. Lester takes a minimum-wage job at a fast-food restaurant, trades in his Toyota Camry for his dream car, a 1970 Pontiac Firebird, and starts working out after he overhears Angela tell Jane that she would find him sexually attractive if he got in shape. He begins smoking marijuana supplied by Ricky. The girls' friendship wanes after Jane starts a relationship with Ricky. Jane and Ricky bond over what Ricky considers the most beautiful imagery he has filmed: a plastic bag being blown in the wind.\nLester discovers Carolyn's infidelity, but reacts indifferently. Buddy ends the affair, fearing an expensive divorce. Frank becomes suspicious of Lester and Ricky's friendship when he finds his son's footage of Lester lifting weights while nude, which Ricky captured by chance, leading him to believe that Ricky is gay. After spying on Ricky and Lester through Lester's garage window, Frank mistakenly concludes the pair is sexually involved. He later confronts and beats Ricky for the supposed affair and accuses him of being gay. Ricky falsely admits the charges and goads his father into expelling him from their home. Meanwhile, Carolyn is sitting in her car in the rain, taking a gun out of the glove box while a voice on the radio talks about not being a victim. Jane argues with Angela about the latter's flirtation with Lester. In the midst of their argument, Ricky appears and convinces Jane to flee with him to New York City and assures Angela that she is ugly, boring, and ordinary.\nFrank confronts Lester and attempts to kiss him; Lester rebuffs the colonel, who tearfully flees. Carolyn puts the gun in her handbag, shouting, \"I refuse to be a victim!\" Lester finds a distraught Angela sitting alone in their darkened living room; she asks him to tell her she is beautiful. He does, and they kiss.\nCarolyn drives through the rain, rehearsing a confession to Lester. Just as Lester and Angela are about to have sex, Angela admits her virginity, prompting Lester to change his mind. He instead comforts her and the pair bond over their shared frustrations. Angela goes to the bathroom and Lester smiles at a family photograph in his kitchen. An unseen figure raises a gun to the back of his head, a gunshot sounds, and blood sprays on the wall. Ricky and Jane find Lester's body, while Carolyn breaks down crying in the closet. A bloodied Frank returns home, where a gun is shown to be missing from his collection. Lester's closing narration describes meaningful experiences during his life; he says that, despite his death, he is happy because there is \"so much beauty\" in the world."}