{"mid": "AmericanMary", "IMDB_id": "tt1959332", "title": "American Mary", "plot": "The film begins as protagonist Mary Mason does surgery on a turkey. Mary is a medical student preparing to become a surgeon. She struggles to pay her bills and applies for work at a strip club. Before the job interview ends, she is taken to an underground room by the club's owner, Billy Barker, and presented with a man who has been tortured. She is asked to save the tortured man's life for $5,000. She does so, but returns home in panic and disgust.\nSeveral days later she is approached by Beatress Johnson, a stripper at the club where Mary applied. Beatress has had herself surgically altered to resemble Betty Boop. Beatress offers Mary $10,000 to perform surgery on a friend of hers, Ruby Realgirl, who wishes to be transformed into a human doll by having her nipples and labia removed and will offer her an extra $2,000 just for showing up at the veterinary clinic, as her niece Tessa is a receptionist there and can sneak them in after hours. Although the unusualness of the request troubles her, Mary is still desperate for money and performs the surgery.\nDuring her residency, Mary is invited to a party with several of the surgeons at her hospital. She is drugged and raped at the party by her former teacher, Dr. Alan Grant. Afterward she returns to the strip club and hires their enforcers to kidnap Grant. She performs a series of involuntary body modifications on him, including splitting his tongue, altering his genitals, amputating his limbs, and suturing his mouth closed. She drops out of medical school and goes into consensual body modification surgery full-time.\nMary becomes renowned as a surgeon of great skill, who is willing to perform any surgery desired. The most prominent of her new clients are a pair of twins from Berlin, who want to have their left arms exchanged and horns implanted in their foreheads. Mary is keeping Dr. Grant as a prisoner. She is discovered by a security guard while tormenting the doctor, and she kills the guard to protect herself. A police detective pursues her, suspecting her involvement in the doctor's disappearance.\nBeatress vanishes, but Mary later receives a phone call from her. She has been brutally stabbed, and she reveals that Ruby's husband has been angered by her transformation and is seeking revenge against Mary. He appears out of the darkness and stabs Mary. Mary kills him but dies from internal bleeding after suturing her wound. Her corpse is found by the detective and police, a satisfied smile on her lifeless face."}