{"mid": "AmericanPop", "IMDB_id": "tt0082009", "title": "American Pop", "plot": "In Imperial Russia during the late 1890s, a rabbi's wife and her young son Zalmie escape to America while the rabbi is killed by the Cossacks. Shortly after their arrival in New York City, Zalmie is recruited by Louie, a performer at a burlesque house, to hand out chorus slips. As Zalmie grows into adolescence, he spends more time with Louie backstage at burlesque shows. When Zalmie's mother dies in the Triangle Shirtwaist Factory fire, he begins working with Louie full-time at a small theatre. Though Zalmie aspires to be a singer, he is beginning to enter puberty and his changing voice becomes a significant obstacle. When World War I strikes, Zalmie travels the globe performing for the troops as the bottom half of a pantomime horse and sustains a wound to his throat, which ends his singing career.\nWhen Zalmie returns to New York, he briefly continues performing as a clown, and falls in love with a stripper named Bella, vowing to make her a famous singer and getting involved with mobsters in order to do so. After Zalmie impregnates her, he uses money from mob boss Nicky Palumbo to pay for their wedding. Bella achieves modest success, but she is killed after opening a package containing a bomb intended for Zalmie. Their son, Benny, who is already an introverted child, focuses all of his efforts into becoming a talented jazz pianist. Benny marries Palumbo's daughter at Zalmie's request and enlists to fight in World War II seeking redemption for his family, despite pleas from his father. Benny is killed in Nazi Germany when he stops to play on an abandoned piano and is caught off-guard by a Nazi soldier; Benny begins to play Lili Marleen and the Nazi closes his eyes in bliss, but when the song ends, the Nazi pauses only to thank Benny before riddling him and the piano with gunfire. Benny's wife and son, named Tony, now live in a suburban Long Island town, and they watch as Zalmie testifies against Palumbo on television, calling him a rat.\nA teenage Tony steals his stepfather's car and drives across the country for four weeks, ending up in Kansas, where he spends the day washing dishes at a diner and spends the night with a waitress. In California, Tony takes another job dishwashing, but soon grows tired of it and quits. A six-piece rock group invites him to write songs for them after hearing him playing harmonica under their doorstep. The band becomes successful but slowly starts to decompose because of the heroin addictions of female lead singer Frankie Heart and Tony himself. Tony becomes addicted to drugs after being hospitalized from falling off a stage while on acid at one of Frankie's shows. Frankie and the band's drummer, Johnny Webb marry, but divorce after two weeks, and Frankie begins an affair with Tony. In Kansas, the band is set to perform after Jimi Hendrix, but Frankie overdoses backstage, and Tony meets a blonde, blue-eyed boy, Little Pete, whom Tony realizes is his son, conceived the night he spent with the waitress.\nTony moves back to New York City accompanied by Pete, where he becomes heavily involved with drug dealing. Pete makes a small amount of money playing the acoustic guitar, but Tony takes any money that Pete earns to buy drugs for himself. Tony gives Benny's harmonica to Pete, then takes Pete's guitar to pawn it, telling Pete to wait on a city bench. The next morning, a man approaches Pete and gives him a small package of drugs to sell and tells Pete that Tony said goodbye to him. After years of selling drugs to rock bands, Pete refuses to sell the band members any more cocaine unless they are willing to listen to his music. His talent stuns both the band and the management and they agree to record and hire him on the spot. The film ends with Pete performing in concert with the band, images of his ancestors appearing during his performance."}