{"mid": "Amistad", "IMDB_id": "tt0118607", "title": "Amistad", "plot": "Amistad is the name of a slave ship traveling from Cuba to the United States in 1839. It is carrying African people as its cargo. As the ship is crossing from Cuba to the United States, Cinqué, a leader of the Africans, leads a mutiny and takes over the ship. The mutineers spare the lives of two Spanish navigators to help them sail the ship back to Africa. Instead, the navigators misdirect the Africans and sail north to the east coast of the United States, where the ship is stopped by the American Navy, and the 53 living Africans imprisoned as runaway slaves.\nIn an unfamiliar country and not speaking a single word of English, the Africans find themselves in a legal battle. District Attorney William S. Holabird brings charges of piracy and murder. The Secretary of State John Forsyth, on behalf of President Martin Van Buren (who is campaigning for re-election), represents the claim of Queen Isabella II of Spain that the Africans are slaves and are property of Spain based on a treaty. Two Naval officers claim them as salvage while the two Spanish navigators produce proof of purchase. A lawyer named Roger Sherman Baldwin, hired by the abolitionist Tappan and his black associate Joadson (a fictional character) decides to defend the Africans.\nBaldwin argues that the Africans had been captured in Africa to be sold in the Americas illegally. Baldwin proves through documents found hidden on Amistad that the African people were initially cargo belonging to a Portuguese slave ship, The Tecora. Therefore, the Africans were free citizens of another country and not slaves at all. In light of this evidence, the staff of President Van Buren has the judge presiding over the case replaced by Judge Coglin, who is younger and believed to be impressionable and easily influenced. Consequently, seeking to make the case more personal, on the advice of former American president (and lawyer) John Quincy Adams, Baldwin and Joadson find James Covey, a former slave who speaks both Mende and English. Cinque tells his story at trial.\nDistrict Attorney Holabird attacks Cinqué’s “tale” of being captured and kept in a Lomboko slave fortress and especially questions the throwing of precious cargo overboard. However, the Royal Navy's fervent abolitionist Captain Fitzgerald of the West Africa Squadron backs up Cinqué’s account. Baldwin shows from The Tecora's inventory that the number of African people taken as slaves was reduced by 50. Fitzgerald explains that some slave ships when interdicted do this to get rid of the evidence for their crime. But in The Tecora's case, they had underestimated the amount of provisions necessary for their journey. As the tension rises, Cinqué stands up from his seat and repeatedly cries, \"Give us, us free!\"\nJudge Coglin rules in favor of the Africans. After pressure from Senator Calhoun on President Van Buren, the case is appealed to the Supreme Court. Despite refusing to help when the case was initially presented, Adams agrees to assist with the case. At the Supreme Court, he makes an impassioned and eloquent plea for their release, and is successful.\nThe Lomboko slave fortress is liberated by the Royal Marines under the command of Captain Fitzgerald. After all the slaves were hurried out of the fortress, Fitzgerald orders the ship's cannon to destroy it. He then dictates a letter to Forsyth saying that he was right—the slave fortress doesn't exist.\nBecause of the release of the Africans, Van Buren loses his re-election campaign, and tension builds between the North and the South, which would eventually culminate in the Civil War."}