{"mid": "Amityville3D", "IMDB_id": "tt0085159", "title": "Amityville 3-D", "plot": "After he exposes a pair of con artists with his partner Melanie (Candy Clark) in the infamous 112 Ocean Avenue house in Amityville journalist John Baxter (Tony Roberts) is persuaded to purchase the house by real estate agent Clifford Sanders (John Harkins). While preparing the house for John, Clifford investigates footsteps in the attic. He is locked in the room, where a swarm of flies attack and kill him. John believes Clifford died of a stroke, even after Melanie shows him some photos she took of the real estate agent before his death which depict him as a rotting corpse.\nWhile John is at work, he nearly dies in a malfunctioning elevator. Simultaneously, Melanie experiences bizarre occurrences in John's house. She is found later that night by John, cowering and hysterical against the wall. Her attempts to convince John that something is inside the house fall on deaf ears. Later, while looking over blowups of the photos of Clifford, Melanie discovers a demonic-looking face in the pictures. When she attempts to show the photos to John, she is killed in a horrific car accident. Melanie's death is ruled accidental by everyone, including John, who remains oblivious to the evil in his home.\nWhile John is away one day his daughter Susan (Lori Loughlin) and her friend Lisa (Meg Ryan) and two boyfriends use a Ouija board in the attic. The game tells them Susan is in danger. Growing bored, Susan and the others go out in John's motorboat. Susan's mother Nancy (Tess Harper), who has come to look for her, is surprised to see a drenched Susan silently walk up the stairs. Outside John arrives home to find Susan's friends bringing her lifeless body to shore. Nancy has a nervous breakdown and, believing Susan is still alive and will return shortly, refuses to leave, even for Susan's funeral.\nAfter having nightmares about the old well in the basement and unable to deal with Nancy's delusions that Susan is still alive, John allows his friend, paranormal investigator Doctor Elliot West (Robert Joy), and a team of paranormal investigators to set up in the house, to help prove if Nancy actually saw something or not. As Elliot and John watch, Nancy is confronted by a spectral being speaking in Susan's voice. Nancy follows the spectre into the basement, where the old well has filled with liquid. Elliot urges whatever is in the well to reveal itself and restore Susan to life. Instead, a demon leaps from the well, burns Elliot's face with fiery breath and drags him to Hell. The house begins to implode. Much of Elliot's team is killed by flying and exploding objects, but John and Nancy and several others escape through a window. As John and Nancy leave, the well bubbles ominously as an eerily glowing fly emerges from it."}