{"mid": "AmityvilleIIThePossession", "IMDB_id": "tt0083550", "title": "Amityville II: The Possession", "plot": "The Montelli family; father Anthony (Young), mother Dolores (Alda), elder son Sonny (Magner), elder teenaged daughter Patricia (Franklin) and two younger kids, move into what they think would be the house of their dreams. Initially things begin well, but everything changes after it is discovered that there is a tunnel in the basement leading into the house - from where is unknown.\nAn evil presence is shown to be lurking within, unknown to the family. After unusual and paranormal activities, like unknown forces banging on the door at night (when nobody is outside) and an ugly demonic message painted on the wall of the youngest Montelli kid's room, Dolores tries to have the local priest, Father Frank Adamsky (Olson) bless the house but an argument breaks out within the family shortly after Adamsky arrives, and Anthony orders him to leave. Adamsky leaves, disgusted at Anthony's behaviour. He finds his car door open and the Bible on the passenger seat torn to pieces. It is shown all is not well with the Montelli family - Anthony is strict but abusive, and sacrilegious towards the Church, and Dolores is trying to keep it together for the youngest kids. Also, Sonny and Patricia are revealed to have started to have sexual feelings for each other, due to mutual attraction that neither can act on. Soon afterward, the family go to church with Anthony, so he can apologize for being rude to Adamsky; Sonny stays at home, claiming to feel unwell. He soon hears an alarming noise and goes downstairs to get his father's gun. He hears demonic laughter and follows it to the tunnel in the basement. The (unseen) presence pursues a frightened Sonny to his room and he then falls victim to demonic possession. The first thing a now possessed Sonny does is approach Patricia to \"play a game\" with her - where he is a famous photographer and she is his famous nude model. She agrees to pose naked, and the pair end up having incestuous sex. She later reveals to Sonny when the two are alone that she enjoyed having sex with her brother, and doesn't feel guilty about it.\nShe goes to tell Father Adamsky this, but has a breakdown before she can confess; Sonny becomes more sinister and demon-like, as his face starts contorting demonically. Startled, he tries to keep his family away, but is unsuccessful due to the demon's influence. On Sonny's birthday, he isolates himself from his birthday party, and calls Patricia who comes up to check on him. She freely offers him sex once more. However, due to his demonic phases and his body's gradual demonic contortions, he sends her away, Using foul language at her as Patricia runs away crying, and tries to tell Adamsky that she thinks Sonny is possessed, but he does not answer. Later that night, the evil spirit tells Sonny to \"kill them all\". Sonny then goes and gets his father's rifle, shoots his father, his mother, his younger sister, his younger brother; and after a chase, finally kills Patricia.\nThe next day the cops arrive and pick up the bodies; Sonny is arrested, but lied he does not recall of ever killing his family. Adamsky then realizes that Sonny is possessed and asks the church if he can perform an exorcism on Sonny but they refuse, not believing him. He therefore takes it upon himself to act without the support of the church. After freeing him from police custody, he takes him to church where Sonny attacks Adamsky and escapes after seeing the crosses on the doors. Adamsky soon runs after Sonny and traces him to the house, where he performs the exorcism, releasing Sonny's soul. As the cops arrive, Adamsky asks Father Tom (Prine) to take Sonny away from him. Tom takes Sonny outside, where the police arrest him and take him back into custody. It is then revealed that the demon has transferred itself into Adamsky. What happens to Father Adamsky afterwards is unknown. Sometime later, the house is put back on sale, setting up the events of The Amityville Horror..."}