{"mid": "AMurderOfCrows", "IMDB_id": "tt0133985", "title": "A Murder of Crows", "plot": "Images of haywire outside a prison. It's a rainy night. A police car arrives. The new inmate in cell 6 used to be a lawyer, Lawson Russell (Cuba Gooding Jr.). He speaks in the voiceover and says that people love to see a lawyer trapped in prison, as the system is seen as something which protects the strong versus the week, and he says that he started to understand that a Thursday, during Carnival time.Cut to New Orleans, during Carnival time. People drinking and a girl who shows off her breasts to the cheering crowd. Lawson alleges he's just met his consciousness, that it wouldn't go away, and that a lawyer is not allowed to have one. He phones Judge Banning, and somebody dressed up as the devil who has just broken produces a gun while he's giving that person his back and talking on the phone. Judge Wiley Banning (Carmen Argenziano) is dressed up as Caesar in a party at his home. Lawson wants to recuse himself and resign from his present case. Banning tells him that he's bound to win the case, so that he's being stupid, and he screams at Lawson saying that he wants to see him in his chambers the following day. Lawson admits that it was professional suicide. Banning calls Lawson's present client, Thurman Parks III (Eric Stoltz).Thurman and Lawson had grown up together. Thurman was the mayor's son, and Lawson was a lawyer's son. Thurman had killed a dancer, smothering her with her pantyhose. Lawson says that juries won't declare over the innocence or otherwise of an accused person, but over the abilities of the best lawyer. Lawson says that he showed the jurors a photograph of the half-naked body of the deceased until they were desensitized and it became meaningless, while the parents of the girl were devastated. Lawson recognises that the strategy was working. Talking in private in Lawson's office, Thurman becomes cocky, saying that he had told \"that bitch\" that he'd get away with it, referring to an unknown reporter the audience knows nothing about. That admission makes Russell cringe. They had been preparing the questions and answers Thurman would answer the following day in court. It was a rainy night as well, the wind pushes open the windows, and Lawson says that the case saved his life.The plaintiff, Billy Ray Richardson (Doug Wert) and Lawson are arguing in front of Banning. The judge tells him that he'll have Russell disbarred if he doesn't finish the case. The jury foreman (David Willis) calls for everybody to rise when Banning enters the room. Russell says that if you are very rich, as Thurman was, proof is very hard to come by. He's looking at the victim's photograph while Banning tells him to start, and Thurman smirks triumphantly to him, which it's the last straw for him.Thurman is going to testify before the jury. He starts saying what he'd memorized: on the 17th of June he was in the Silverband Club having a drink with Janey Broussard (Tara Crespo), the deceased. Lawson asks Thurman what they talked about out of the blue; Thurman answers, but afterwards, Lawson shouts to him if she could say something while he killed her. Thurman doesn't want to answer, Banning tries to stop this thread of inquires, declares him out of order and a police officer finally takes Lawson away.It was declared a mistrial. Lawson Russell gets disbarred and he has to leave his office. His best friend Elizabeth Pope (Marianne Jean-Baptiste) tries to defend her friend, but it was an impossible feat. The Louisiana Chief of Justice (Sharon Samples) disbars Lawson. Elizabeth tries to offer some consolation, saying that he defended the innocent and punished the guilty, and that his late father would be proud of his son. Lawson decides to go back to Key West, where his father had left a house, to write a John Grisham-like novel.A year afterwards, a sick old man supposedly called Christopher Marlowe hires Russell and his boat to go out fishing. Lawson is drunk, but they bond over the fishing. Marlowe talks about his late wife while Lawson says that he could feel something odd in his customer. Later, they go to a bar to have some drinks, which Churkie (Shawn C. Suttles) serves. Marlowe asks for a daiquiri, Hemingway's favourite. They talk about pocket watches, and Marlowe says that his is special, as it has a sing-song music. Russell tells Marlowe that he's a writer now, but that he used to be a barrister. Marlowe begins bad-mouthing lawyers. Lawson admits he had fun, but he's as sure as hell glad when he says goodbye to him.Back home, the following morning, Lawson orders the sale of some of his stock, as he's not earning enough money to pay for his expenses and he may lose the house - which he doesn't even want to think about. His book, after a year, was only on page 6. He admits that writing is very hard. At this moment, Marlowe pops in. He seems to feel a bit sick, so Lawson offers him a glass of water. Marlowe produces a novel he's just written, and he asks Lawson to read it and give him his honest opinion. The frail man leaves, and tells Lawson to take his time reading his novel, and that they may meet up at the same bar at night. Lawson turns off his computer and starts reading  A Murder of Crows, by Christopher Marlowe. It begins with a William Shakespeare's quotation: First thing we do, let's kill all the lawyers. A Murder of Crows is about 5 Southern defense attorneys who defend people who they know they are guilty but are finally acquainted. These lawyers are all rich, but they are killed in revenge of their defending rich clients. The suspenseful thriller novel is so exciting, that Lawson goes to the bar to meet Marlowe, but Churkie tells him that he's already left, feeling bad. When Lawson goes to the boarding hotel where Marlowe leaves, he can only see Goethe, a police officer that the old man died without family of natural causes - a heart attack. What Lawson knows doesn't match up with what Goethe knows, as Marlowe had told his landlady (Ellen Gerstein) that he had not family. Goethe says that spouses sometimes go after one another in less than a year. He suggests Russell lights a candle in Saint Andrew's. Goethe says that Marlowe will be cremated tomorrow, and that his belongings will go to the state, so Lawson holds onto  A Murder of Crows.Lawson looks for a publishing house for the computer-version he's plagiarised. Janine DeVrie (Ashley Laurence), owner of DeVrie Publishers, is immediately interested. She treats him as a start from the beginning. The book is an instant bestseller, and Lawson can afford a sports car, a jewellery watch, and he starts a relationship with Janine DeVrie while making it up to the cover of Forbes magazine among others. Janine suggests an advance over Russell's following book. She takes him to his mansion by limousine and they make wild sex. Her nipple is pierced. Outside her one-of-a-15-bedroom room, crows gather.A white-trash man whose surname is Dubose asks for Russell's signature in a long line of people at Planet Hollywood. The audience realises that it's the same man as Goethe and Marlowe, but Lawson pays no attention, in spite of his complaint about having an impersonal greeting. Elizabeth Pope congratulates him as well. It's then when Lawson realises what he's done, and that there would never be a \"next book\". He realises he's a thief, and that he was losing the only decent thing in his life - Elizabeth. He takes a rest to have a smoke, and Thurman appears with his novel in his hands. He's been acquainted in a second trial. Truman threatens him. It looks as if Thurman knew Janine making a stupid remark about her \"not forgetting his whip\".A hand-gloved person sends a signed copy of the book to Clifford \"Cliff\" Dubose (Tom Berenger), and the packet is waiting for him when he returns from his holiday in Jamaica. This Dubose is clearly NOT the Dubose the book was signed for. He starts reading it after feeding his car. A New Orleans desk Sergeant (Robert Peters) mockingly greets Dubose. A police technician who was sleeping while on duty looks for murder victims whose occupation prior was being a lawyer.Dubose arrests Lawson. Billy Ray accuses Russell of having killed the 5 victims, disguising the crimes as suicides or accidents and then telling everything in the book. Obviously, Russell says it's a coincidence, but Billy Ray says that even details which were not released to the press appeared in the book. Immediately, Lawson realises that he burnt the only thing which could prove he didn't write  A Murder of Crows, as he had put the original manuscript into the fire. Dubose was the investigator of the first case, which had been disguised as a burglary gone awry. Lawson won't speak anymore, and he asks for an attorney. Billy Ray cynically wishes him good luck in finding one, as he knows that the association of lawyers had condemned his novel, so he will have problems to hire one. So Lawson calls for Elizabeth Pope's help. He tells her that he'll collaborate with the police if he's let outside. While he and Pope leave the police station, Dubose tells Richardson that Russell is guilty, because he's looked at him. Dubose tells his officers to follow Russell, and Billy Ray says that he knows the judge who would sign a search warrant.Lawson checks in the newspaper news about the five murdered attorneys. She can't believe it when he tells her that he's got no source apart from a manuscript he himself had destroyed in his fireplace. Pope refuses to represent him. On his way back home, Lawson mocks one of the officers (Chad Rose) who are following him, but to his dismay, his house is being searched. Dubose gives permission to the searchers to be \"particularly destructive\", and somewhere something made of glass gets broken. Dubose admits he likes the analogy between crows and lawyers in  A Murder of Crows. Some compromising photographs from the murders have been planted in the Kitchen cupboard. Thurman laughs out loud when the story breaks the news, which a half-naked woman (Gaelle Comparat) is playing with a toy train. Janine is angry, because the media (Renée Estévez) puts pressure on her and her company inquiring whether she knew about the book murders being real. She is more than satisfied in private, though, as she comments with her attractive attorney (Glendon Rich) that the book would be the best sale.Meanwhile, Lawson is at large, escaping by train.A county clerk (Anastasia Roussel-Drake) checks the deaths of Marlowe, and the existence of a Detective Goethe. It's only then when Russell realises that both are writer-based aliases when she mentions the German writer. He reads Christopher Marlow's Faust, a man who sells his soul to the devil, and both writers did masterpieces on the topic.He returns home to pick up a gun. Two police officers (Eric James and Jim Hanna) see him, but he goes to the clerk office of courts. He steals a subpoena and gives it to Evans, Marlowe's landlady. He paid in cash and left after a week. He produces the subpoena to see all the March phone registers. Evans says that Marlowe always used the phone booth in the corner. Two cooperative and flirting phone company supervisors - one male, one female - cooperate with Lawson. Russell has to run away from several police cars, but they (Julie Letche) lose him.Dubose and Richardson complain that the FBI is taking over the case and neither of them want to speak to reporters. Dubose thinks that Lawson wants to commit suicide, and that's why he hasn't left the contry. Lawson goes to Baton Rouge. All calls were local, except one to Althea Delroy (Deneen Taylor), who lives in Jackson Street at the Garden District. Thurman Parks used to live there as well, but he didn't have Althea's number. Thurman and Janine are hooking up and slapping each other. Pope learns that Althea Delroy was a single mother who was a housekeeper and who owed 59,000 dollars of her condo. She leaves the info on a table - from where it disappears. Lawson follows Althea, who was Prof. Arthur Corvus (Mark Pellegrino)'s housekeeper. Lawson recognises him immediately. Corvus is analyzing and discussing Hamlet with students Laura (Marisa Petroro-Parker) and James (Nate Adams).At the Corvus' house, he sees photographs of the wife and little child. The child's room smelled of humidity, so he guessed she must have been at boarding school. At Corvus' laptop, he finds nothing, but then he searches everything, and finds Marlowe's pocket watch. Corvus is a professor of scriptwriting, acting, literature, and he was the Marlowe, Goethe and the book-sign guy. Althea looks startled at the escaping Russell.Corvus arrives home and worries if something happened to Althea. She's speaking to the police, and has recognised Lawson Russell. Corvus pretends not to know who he is straight away. He speaks to Dubose. When Dubose asks about Corvus' family, he doesn't reply, because the FBI arrive and Dubose is not too happy about it. Dubose thinks that there's no relation between Corvus and Russell, and that he was looking for a place to hide away.Jeffrey Lowell was the first murder victim. He had defended a banker who had hit-and-run a lady and her daughter. They were Jean and Trudy Corvus. Lowell got a release on a technicality, as the arresting officer hadn't read the banker his rights. Somebody recognises Russell and he has to run away.Meanwhile, Corvus is loading up a gun. He makes Lawson sit down while threatening him with the gun. They have a conversation at gunpoint and they tell everything.When Corvus is about to shoot Russell, Dubose appears. Dubose asks for back up, but Corvus kills him. Corvus wants to put the blame on Russell. Both fight. Lawson points the gun which killed Dubose to Corvus, leaving his fingerprints on it. Realising there's no way out, Russell kills Corvus.Cut to the prison. Elizabeth visits him. They hold hands.Lawson is a millionaire - the sale numbers for his book went to the roof.Banning judged Russell's case, so the best criminal attorney saved Lawson.As a free man, he moves to a summer destination. He says that the rich and powerful can always trod on the weak and meed, but that all everyone can hope for is a little justice once in a while.-- written by KrystelClaire"}