{"mid": "Anaconda", "IMDB_id": "tt0118615", "title": "Anaconda", "plot": "While shooting a documentary about a long-lost Indian tribe, the Shirishamas, on the Amazon River, director Terri Flores (Jennifer Lopez) and members of her crew—including cameraman Danny Rich (Ice Cube), production manager Denise Kalberg (Kari Wuhrer), her boyfriend, sound engineer Gary Dixon (Owen Wilson), visionary Warren Westridge (Jonathan Hyde), anthropologist Professor Steven Cale (Eric Stoltz), and boat skipper Mateo (Vincent Castellanos)—come across stranded Paraguayan snake hunter Paul Serone (Jon Voight) and help him, believing he knows how to find the tribe they are searching for.\nMost of the crew are uncomfortable around Sarone, and Cale clashes with him several times in regards to Shirishama lore. Later, while trying to free the boat's propeller from a rope, Cale is stung in the throat by a wasp inside his scuba regulator, leaving him unconscious. With that, Sarone takes command of the boat and the crew. They are then forced to help him achieve his true objective—hunting down and capturing a record-breaking giant anaconda he had been tracking. One night, the Anaconda killed a jaguar.\nMateo is the first of the crew to be killed by the anaconda, which coils around him and then breaks his neck near a boat where a poacher (Danny Trejo) had been killed, by shooting himself, at the beginning of the film. A photograph in an old newspaper reveals that Mateo, Sarone and the unnamed poacher were working together to catch animals, including snakes. The others try to find him while Gary sides with Sarone, who promises if they help him find the anaconda, he will help them get out alive. Later at night, the anaconda attacks the boat. When Sarone attempts to capture the snake, it crushes Gary, killing and eating him, leaving Denise devastated. The survivors overcome Sarone and tie him up. The next day, the boat becomes stuck at a waterfall, requiring Terri, Danny and Westridge entering the water to winch it loose. When Denise attempts to kill Sarone as revenge for Gary's death, he gets the edge and strangles her to death with his legs before dumping her body in the river. When the anaconda returns, Westridge distracts it long enough for Terri and Danny to return to the boat while he ascends the waterfall. Danny and the freed Sarone fight, as Westridge is coiled by the snake. Before it can kill him, the tree supporting the anaconda breaks, sending everyone into the water and waking up Cale. With Westridge killed in the fall, the snake coils itself around Danny, only to be shot in the head by Terri. An enraged Sarone attacks Terri, only to be stabbed with the tranquilizer dart by Cale, who soon loses consciousness again. Danny punches the drugged Sarone, knocking him into the river.\nHowever, Terri and Danny are soon re-captured when Sarone catches up to them. He dumps a bucket of monkey blood on them and uses them as bait in an attempt to capture a second, larger anaconda. The anaconda appears and coils around Terri and Danny and begins to suffocate them. They are caught in a net by Sarone, but the snake breaks free. Sarone tries to escape, but the anaconda finally manages to coil around him and suffocate him. Terri and Danny cut their bonds and watch in horror as the anaconda slowly swallows Sarone whole. Terri finds a nest of baby anacondas in a building, but the snake arrives and, after regurgitating the still twitching Sarone, chases her up a smoke stack. Danny traps the anaconda by pinning its tail to the ground with a pickaxe. Danny ignites a fire below the smoke shack and burns the snake alive. The burning anaconda is sent flying out of the building and plunges into the water where it sinks. As Terri and Danny recuperate on a nearby dock, the anaconda appears one final time before Danny slams a splitting maul into the snake's head, killing it. Afterwards, Terri and Danny reunite with Cale, who begins to revive on the boat. As they float down the river, they accidentally locate the natives for whom they were originally searching. They realize Sarone was right and begin filming their documentary as the film ends."}