{"mid": "AnAdventureInSpaceAndTime", "IMDB_id": "tt2663812", "title": "An Adventure in Space and Time", "plot": "In 1966, William Hartnell (David Bradley) is in his dressing room at the BBC. He insults a stagehand who calls him to the set, where the delay caused by his absence is noticed. Hartnell enters in costume, ready to film his last moments as the First Doctor and stands in front of the TARDIS console.\nThree years earlier, BBC executive Sydney Newman (Brian Cox) is asked to create a show that will fill the gap between Grandstand and Juke Box Jury. He has an idea for a science-fiction series with the central character being a \"doctor\", although he does not know of what. When he tells his colleague Verity Lambert (Jessica Raine) she is hesitant to join the project. She changes her mind when Newman asks her to be the producer, not his assistant. Lambert and the show's director, Waris Hussein (Sacha Dhawan), meet William Hartnell to offer him the lead role in what will eventually be titled Doctor Who and, despite some trepidation, he accepts.\nDuring rehearsal, Hartnell is dissatisfied that the TARDIS lacks an interior set. Newman then compliments Hartnell's acting ability to save his producer from a troublesome conversation. However, Newman has misgivings about Lambert's handling of her job. This inspires Lambert to become more assertive and she forces the set designer to finally create the TARDIS interior. He does so effortlessly, impressing Lambert. The recording of the pilot episode is beset with difficulties; Newman dislikes the result and orders a re-shoot. Following this, he is finally contented and schedules a transmission date.\nLambert and Hussein are nervous as the broadcast of the first episode occurs the day after the assassination of John F. Kennedy and its potential audience is diminished. Newman summons Lambert and tells her of Controller of BBC1 Donald Baverstock's (Mark Eden) decision to cancel the show, but Lambert emphasises her belief in it and demands he repeat the first episode before the second is screened. For the next serial, Newman expresses his concern about the Daleks, referring to them as \"bug-eyed monsters\", which he refused to allow on the show since its creation. However, Lambert eventually convinces him. Following the transmission of the first Dalek story, Lambert realises its popularity when she spots children impersonating the creatures' catchphrase, \"Exterminate\". Newman is pleased to tell her that the programme achieved a viewership of 10 million and continued production is now assured.\nAs most of the original cast and crew (including Hussein and Lambert) gradually move on to other projects, Hartnell's health declines, leading him to forget lines and require scenes to be re-shot — something the BBC can ill-afford. Hartnell meets with Newman and asks for a reduced workload, but the decision has already been taken to replace him. Hartnell has grown to embrace playing the Doctor and struggles with his emotional attachment to the character; with little choice, he reluctantly accepts the situation. He breaks into tears as he informs his wife Heather (Lesley Manville) of the news, admitting that he doesn't want to leave the role.\nBefore his final scene, Hartnell shares a brief exchange with his successor, Patrick Troughton (Reece Shearsmith). As the cameras are about to record, Hartnell looks across the main console and sees Matt Smith, who will play the same role nearly 50 years later. Smith silently acknowledges Hartnell's legacy before disappearing as Hartnell begins the scene."}