{"mid": "AnAllDogsChristmasCarol", "IMDB_id": "tt0166960", "title": "An All Dogs Christmas Carol", "plot": "The film opens with angel puppies talking to Annabelle (Bebe Neuwirth). They ask her to tell them a story. She begins to tell them about how Carface saved Christmas with a little guidance from Charlie (Steven Weber) and Itchy (Dom DeLuise).\nThe movie begins in an alleyway with Charlie, Itchy, Sasha (Sheena Easton), and their friends decorating for a Christmas party. Everyone is enjoying themselves as Charlie and Itchy tend to the young puppies. Charlie checks on Sasha and the money collection for Timmy's operation for his bad leg. Unfortunately, Carface (Ernest Borgnine) and Killer (Charles Nelson Reilly) arrive and start collecting debts from everyone. After Charlie refused to pay Carface back, as his debt payment is not due yet, he blows a mysterious hypnotic dog whistle that hypnotizes them all and causes them to give Carface and Killer all of their bones. Before leaving, Carface and Killer make off with all the food, presents, and money which includes that for Timmy's operation and head off cackling.\nAfter Charlie and Itchy fail several times to get the stolen goods from Carface, it is revealed that he is working for Annabelle's evil cousin, Belladonna (Neuwirth), who plots to use a massive version of the hypnotic dog whistle to hypnotize every dog in San Francisco into stealing the masters' Christmas presents, causing them to be thrown out of their houses and abandoned, much in the same way Carface was when he was a puppy. Charlie plots to scare \"the Dickens\" out of him and asks Annabelle for some aid, resulting in them being transformed into characters from A Christmas Carol. Itchy becomes the Ghost of Christmas Past, Sasha becomes the Ghost of Christmas Present, and Charlie becomes the Ghost of Christmas Future (as a reference of The Mask) with a Gospel-style song-and-dance. They visit Carface and make him feel guilty about stealing everything, especially the operation money; Sasha tells him that without it Timmy will die, which will cause another — his own, as Charlie shows him that because of his actions, he will cause his own death, and he will be condemned to Hell for eternity.\nCarface, having seen himself in Timmy, stops the whistle just in time to prevent the dogs from stealing the gifts. Belladonna flies into a rage and is about to kill him and Killer when she is frozen solid by a massive amount of snow caused by Annabelle.\nMeanwhile, with Charlie and the gang, it starts to snow. Everyone celebrates, but Itchy remarks that it's a shame that they didn't have any presents to give the puppies. Just then, Carface appears on a sled pulled by Killer, and gives them everything back, and more. He even gives them Timmy's money box back, which is full to the top. He turns to leave, and Sasha asks him to stay and join the party. Carface respectfully declines the invitation, saying he's going to visit his mother instead, but wishes everyone a merry Christmas.\nAnnabelle finishes the story by saying \"Merry Christmas!\" to the audience (whom the puppies wave at), and Charlie and Itchy wish the same."}