{"mid": "AnalyzeThis", "IMDB_id": "tt0122933", "title": "Analyze This", "plot": "Mob boss Paul Vitti narrates a brief history of the Mafia: in the wake of Albert Anastasia's death, the dispute over who among Vito Genovese, Carlo Gambino and Joe Bananas will ascend to mob supremacy results in the Apalachin Meeting in upstate New York. The meeting is raided by the FBI, and the Mafia does not call a summit again until the present day.\nVitti and his consigliere Dominic are discussing the upcoming meeting and the Mafia's present-day problems. However, just as Dominic warns Vitti to look out for Primo Sindone (an up-and-coming Mafia Don who wants to be capo di tutti capi), gunmen drive past and kill Dominic.\nPsychiatrist Ben Sobel is dealing with his own problems: his son from his first marriage listens to his sessions, his patients are not challenging enough, and his wedding to Laura MacNamara is coming soon. Sobel unknowingly rear-ends a car belonging to Vitti and the trunk opens, revealing a man bound and gagged inside, which Sobel and his son do not notice because they are arguing. Jelly, one of Vitti's made men, takes the blame, but Sobel gives Jelly his business card in case he changes his mind about compensation.\nDuring a meeting with his crew, Vitti suffers a panic attack and tells Jelly that he needs to see a psychiatrist, but it has to be kept a secret and Jelly recommends Sobel. Vitti visits Sobel, claiming his friend needs therapy. Sobel impresses Vitti enough to want to see him whenever necessary. Sobel goes to Miami for his wedding and Vitti, Jelly and the crew follow. Vitti explains he has been suffering from impotency and Sobel suggests the source of the problem might be stress.\nThe next day Vitti has another panic attack and requests to see Sobel. Vitti explains his history with his father to Sobel, who thinks this might have something to do with Vitti's problems. The wedding is interrupted when an assassin is killed by one of Vitti's thugs. Sobel confronts Vitti and argues with him until he becomes angry. Sobel suggests he resolve his anger issue by calling Primo Sindone and telling him how he feels. Vitti phones Primo and starts by telling him how he feels but ends up threatening to kill him.\nSobel and his family return to New York, where they find a fountain in their garden, a gift from Vitti. The FBI arrive and request Sobel inform on Vitti, but he refuses. He changes his mind when the FBI play an altered tape in which Vitti apparently reveals his intention to kill Sobel (Vitti had actually said he would kill anyone who harmed Sobel). Sobel wears a wire to his next meeting with Vitti, but throws it away when he learns that Vitti saw his father murdered when he was a child. Sobel thinks he can help Vitti, but Vitti, informed that Sobel was working with the FBI, takes him to a secluded place to kill him. Sobel and Vitti get into an argument, and Vitti cries when reminded of his father's murder. Just as this occurs, two hitmen sent by Sindone arrive to kill Vitti, but Jelly kills them both as Vitti is on the ground sobbing. Vitti apologizes for planning to kill Sobel, and the two reconcile.\nThe day of the meeting arrives, but Vitti has another meltdown. Jelly interrupts Sobel's wedding, requesting Sobel attend the meeting as Vitti's consigliere. Sobel is initially nervous, but his self-confidence grows to the point that he begins to patronize Primo until Primo finally pulls a gun on him. Vitti arrives, ordering Primo to stand down and announcing he knows a traitor in his own family killed Dominic, but will not seek revenge and instead retire from the Mafia. Once outside, a standoff ensues between Vitti's and Primo's men, during which Sobel accidentally takes a bullet intended for Vitti. The FBI intervenes, the mobsters are arrested, and Sobel is taken to the hospital.\nSobel visits Vitti in prison and Vitti thanks Sobel for his help before informing him that Primo Sindone was recently found dead. At home, Sobel dances with his new wife as Tony Bennett (as a favor from Vitti) serenades them."}