{"mid": "AnAmericanTailFievelGoesWest", "IMDB_id": "tt0101329", "title": "An American Tail: Fievel Goes West", "plot": "Several years after living in New York City, the impoverished Mousekewitz family discovers that conditions are not as ideal as they had hoped, as they find themselves still struggling against the attacks of mouse-hungry cats. Fievel spends his days thinking about the Wild West dog-sheriff Wylie Burp, while his older sister, Tanya, dreams of becoming a singer. Meanwhile, Tiger's girlfriend, Miss Kitty, leaves him to find a new life out west, remarking that perhaps she is looking for \"a cat that's more like a dog.\"\nSoon after, Cat R. Waul forces the mice into the sewers, including the Mousekewitzes, and entices them into moving yet again to a better life out west. Tiger chases the train, trying to catch up with his friends, but is thrown off course by a pack of angry dogs. While on the train, Fievel wanders into the livestock car, where he overhears the cats revealing their plot to turn them into \"mouse burgers.\" After being discovered, he is thrown from the train by Cat R.'s hench-spider, T.R. Chula, landing him in the middle of the desert. His family is devastated once again over his loss and arrive in Green River, Utah with heavy hearts.\nUpon arrival at Green River, Chula blocks up the water tower, drying up the river. Cat R. approaches the mice and proposes to build a new saloon together, although intending to trick the mice into doing the bulk of the work and then eat them afterwards. Meanwhile, Fievel is wandering aimlessly through the desert, as is Tiger, who has found his way out west as well, and they pass each other. However, they each figure that the other is a mirage and continue on their separate ways. Tiger is captured by mouse Indians and hailed as a god. Fievel is picked up by a hawk, dropped over the mouse Indian village and reunites with Tiger. Tiger chooses to stay in while Fievel catches a passing tumbleweed, which takes him to Green River. As soon as he makes his arrival, he quickly reunites with his family but is unable to convince them of Cat R.'s plans to kill them. However, Cat R. hears Tanya singing and is enchanted by her voice.\nHe sends Tanya to Miss Kitty, who is now a saloon-girl cat, and she reveals that she came at Cat R.'s request. He tells Miss Kitty to put her on stage. With a little encouragement from Miss Kitty, she pulls off a performance for the cats. Meanwhile, Fievel is chased by Chula and briefly taken prisoner, but flees.\nWhile walking out of town, Fievel stops to talk with an elderly bloodhound sleeping outside the jail, discovering that he is actually Wylie Burp. Fievel convinces him to help and train Tiger as a lawman and as a dog. Tiger is reluctant at first, but relents at the suggestion that a new persona might win back Miss Kitty. They go back to Green River to fight the cats, who attempt to kill the mice at sunset during the opening of Cat R.'s saloon using a giant mouse trap. Tiger, Wylie and Fievel intervene and battle the cats. When Chula threatens to kill Miss Kitty, however, Tiger rescues her and uses a pitchfork and Chula's web as a lasso with him trapped on it to hurtle Cat R. and his men out of town by having them piled on part of the trap, which the heroes use as a catapult. The cats fly into the air and land into a mailbag. The train picks it up and leaves.\nEnchanted by his new personality, Miss Kitty and Tiger are reunited. Tanya becomes a famous singer and the water tower flows with 9000 gallons of water again, making Green River bloom with thousands of flowers. Fievel finds Wylie away from the party who hands him his sheriff badge. Fievel is unsure about taking it, but realizes that his journey is not over."}