{"mid": "ANewLeaf", "IMDB_id": "tt0067482", "title": "A New Leaf", "plot": "Henry Graham, a playboy from a wealthy patrician family, has run through his entire inheritance and is completely unequipped to provide for himself. His childhood guardian, Uncle Harry, refuses to give him a dime. Henry considers but is unwilling to exercise the only solution he can think of—suicide. At the suggestion of his valet Harold, Henry decides the only other viable option open to him: marrying into wealth. With a $50,000 loan from Uncle Harry to tide him over, Henry has just six weeks to find a rich bride and repay the money, otherwise he must forfeit all of his property to his uncle.\nDesperation sets in as Henry's attempts to meet a suitable mate comically fail. With only days remaining, Henry meets clumsy, painfully shy heiress Henrietta Lowell, a botany professor. She is the answer to his prayers; wealthy and with no family. However, Henrietta's suspicious (and crooked) lawyer Andy McPherson is a problem for Henry, as his Uncle Harry plots with the shyster to prove to Henrietta that Henry only wants her for her money. They fail, and Henrietta marries Henry. On their honeymoon, Henrietta discovers what may be an undescribed species of fern.\nMurder never far from his mind, Henry takes charge of his wife's life. He reorganizes her household staff, who had been taking full advantage of her timidity and naivete—and sharing their profits with her former lawyer. He also learns how to manage accounts and a vast estate. Henrietta is completely disorganized and welcomes Henry's guidance. She also finds out that he has a B.A. in history, and suggests he could get a teaching job at the university she works at, so they could be together all the time and grade term papers together. Wishing nothing more than to be rich, single, and completely idle, Henry finds this prospect utterly horrifying.\nWhen Henrietta's fern is confirmed as an entirely new species, she names it Alsophila grahami after Henry. He is unexpectedly touched, since this gives him a form of immortality, something he has always desired. She invites him to join her on her canoe trip to the Adirondacks for her annual field trip. Henry sees this as an opportunity to rid himself of Henrietta forever in a remote area with no witnesses. He is tortured by mosquitoes and utterly miserable as they portage their way from lake to lake.\nBefore Henry can figure out a way to dispose of her, their canoe capsizes in an area of rapids. Henry makes it to shore, but Henrietta tells him she cannot swim. Henry tells her to let go of the log she's clinging to and he'll rescue her—intending to do nothing of the sort. Then just as he's departing the scene, already thinking of the story he'll tell to the police, he finds an example of the fern Henrietta named after him and turns to tell Henrietta about it, forgetting just for a moment what he's done. He discovers that the token she gave him with a sample of the fern in it has been lost, and he is deeply upset. In this moment Henry realizes that his old life is gone forever, along with the man he used to be, and despite himself he loves Henrietta. Cursing the turn of events, he rescues Henrietta and embraces his unexpected fate as a married man and future professor of history. Henrietta asks him if he'll always be there to take care of her, to which he responds \"I'm afraid so.\" They literally walk off into the sunset together, as birds sing and twee music plays."}