{"mid": "AnExtremelyGoofyMovie", "IMDB_id": "tt0208185", "title": "An Extremely Goofy Movie", "plot": "Max Goof, now nearly 19 years old, departs for college with his best friends P.J. Pete and Bobby Zimmeruski. He strives to work together with his friends to become the top team at the college X Games, excited to finally be free of his overbearing and embarrassing father. Upon arriving, Max is met by the rude and pompous \"Gamma Mu Mu\" fraternity, who are the reigning X-Games champions, including their leader, Bradley Uppercrust III. Bradley invites only Max to join his fraternity, but Max refuses to leave his friends behind. A rivalry starts between Max's team and Bradley's Gammas. Max and Bradley, as de facto leaders of their groups, arrange a bet that whoever loses in the finals will be towel-boy to the other.\nMeanwhile, Goofy doesn't take Max's leaving very well and suffers from empty nest syndrome. His depression causes him become careless at his toy assembly line job, and eventually cause a massive explosion inside the factory. Out of a job, Goofy is forced to finish his 4th and last year of college to obtain a college degree before he is able to find new employment. Much to Max's horror, Goofy joins the same college as Max to complete his degree, all the while sporting clothing and behaviors from the 70s, when Goofy last attended college. Goofy frequently bothers the boys at the dorms, waking them up unnecessarily early, embarrassing them in public, and interrupting their down time with chores. In order to give him and his team some breathing room, Max talks his father into joining the Gammas, whom Goofy had accidentally impressed by interrupting Max's practice. Additionally, at Max's urging to get a library card, Goofy meets and befriends the college librarian, Sylvia Marpole, who shares his nostalgic love for the 70's. Romance soon blossoms between Goofy and Sylvia, and they decide to go for a date that coming Saturday, which becomes a spectacular success with them creating a throwback theme at the club and dominating the dance floor.\nAlthough Max is initially supportive of Goofy's \"distractions\", tensions start to rise between them when Goofy beats Max in the first round during the X-Games qualifiers, effectively stealing Max's fanbase and limelight, though his success is due to cheating by Bradley, who placed a rocket booster on Goofy's skateboard. Bradley also distracts Max as he skates by blinding him with a mirror. Max's team barely makes it into the semi-finals. After the qualifiers, Max, frustrated at being unable to distance himself from Goofy, rudely and selfishly disowns Goofy as his father and telling him to \"leave [him] alone and get [his] own life!\" A depressed Goofy loses his focus, forgets his big date with Sylvia, and fails his first round of midterm exams.\nGoofy returns home and begins to consider dropping out, but after inadvertently getting some advice from Peter Pete, he regains his focus and returns to college. Meanwhile, Max, upset that people now only recognize him through his dad, considers transferring, thinking he had let his teammates down, but after some encouragement from PJ and Bobby, he regains his determination. Goofy returns to campus and reconciles with Sylvia, who then helps him study for his next wave of exams, and aces all of them. Additionally, Goofy quits the Gammas, not wanting to continue competing against Max. The Gammas take this as an insult and literally throw him out. When Goofy re-enters the Gamma house, unknowning by the gang, to return his pledge pin, he overhears the group plotting to cheat in the final X-Games events, like they always have. Later, Goofy tries to warn Max along with Bobby and PJ about the Gammas' intentions, but Max, still holding a selfish grudge against him, refuses to believe him.\nAt the X-Games semi-finals, Bradley and the Gammas repeatedly cheat in various ways unnoticed, eliminating all the teams while trying to eliminate Max's, albeit unsuccessfully. Just before the final race is about to begin, Bradley activates a rocket mechanism in P.J.'s skates that blasts him away, leaving Max's team with only two players. Without enough teammates, Max and Bobby will face disqualification unless they can find a replacement player. Realizing that Goofy was right about the Gammas' cheating, Max calls for Goofy on the Jumbotron and asks him to join his team; Goofy crashes in in the nick of time.\nIn the final race, Slouch, one of the Gammas, is removed from the race when Goofy crashes into him, and Bobby is removed when one of the Gammas loosens the screw on the front wheel of his bike. Goofy is then removed when he accidentally crashes into Bradley. Bradley is angered when Tank, his right-hand man, ignores his orders to take out Max and instead tries to win the race in Bradley's place, and activates a rocket booster placed onto Max's skateboard. Goofy's attempt to stop Bradley fails, and Max, along with Tank, crashes into the inflatable X-games logo. It falls on them and goes ablaze. Ignoring the accident, Bradley skates forward to finish the race, but Max and Goofy help Tank escape the wreckage. Despite the setback, Max manages to catch up to Bradley and wins the race by a nose and receives the grand-prize trophy. Conceding defeat, Bradley shakes hands with Max showing good sportsmanship and will become his towel-boy as agreed, but Max calls off the bet because Bradley has to deal with Tank. Tank then turns on Bradley for betraying him and slingshots Bradley into the X-Games blimp flying overhead, effectively taking over the fraternity.\nOnce the term is over, Goofy graduates and Max gives the trophy to him as an apology gift for his disownment from before, assuring the former that he will always be his son. Goofy forgives Max, bids farewell to the group, and drives away with Sylvia into the sunset for their next date."}