{"mid": "AngelsWithDirtyFaces", "IMDB_id": "tt0029870", "title": "Angels with Dirty Faces", "plot": "In 1923, Rocky Sullivan (Frankie Burke) and Jerry Connolly (William Tracy) attempted to rob a railroad car carrying fountain pens. Jerry, the faster runner, escaped from police, while Rocky was caught and sentenced to reform school.\nThirteen years later, Rocky (James Cagney) is arrested for armed robbery. His lawyer and co-conspirator, Jim Frazier (Humphrey Bogart), asks him to take the blame and, in exchange, he will give Rocky the $100,000 stolen on \"the day\" he is released. Rocky agrees, and is sentenced to three years in prison. After serving his sentence, he returns to his old neighborhood and visits Jerry (Pat O'Brien), who is now a Catholic priest. Jerry advises Rocky to get a place \"in the old parish\"; he does so, renting a room in a boarding house run by Laury Martin (Ann Sheridan), a girl he bullied in school. He then pays a visit to Frazier's casino. Frazier claims to have been unaware of Rocky's release, but promises to have the $100,000 ready by the end of the week. In the meantime, he gives Rocky $500 spending money.\nRocky is pickpocketed after leaving the casino. The culprits turn out to be a group of youths: Soapy (Billy Halop), Swing (Bobby Jordan), Bim (Leo Gorcey), Pasty (Gabriel Dell), Crab (Huntz Hall), and Hunky (Bernard Punsly). They admire Rocky's reputation and criminal lifestyle so, after retrieving his wallet, Rocky invites them to dinner. While they are eating, Jerry shows up and asks the gang why they haven't been playing basketball. With Rocky's help, he convinces them to play against another team. At the match, Jerry and Laury express equal concern over the negative influence Rocky may be having on the gang.\nWhile walking home, an attempt is made on Rocky's life by Frazier's hit squad. Rocky survives, and retaliates by kidnapping Frazier and raiding his house at gunpoint, stealing $2,000 and a ledger. Frazier's business partner, Mac Keefer (George Bancroft), gives Rocky his $100,000 in full, but informs the police of the kidnapping. Rocky is arrested, but after discovering he has possession of the ledger, Frazier tells the police it was all a \"misunderstanding\" and Rocky is released. Jerry learns of the kidnapping, and decides to go to the press in an effort to expose the corruption in New York. Rocky tries to reason with him, but to no avail. On the radio, Jerry publicly denounces the corruption; as well as Rocky, Frazier and Keefer. Frazier and Keefer assure Rocky that no harm will come to Jerry, but Rocky overhears their plans to kill the both of them. Rocky kills Frazier and Keefer instead, and makes his way to an abandoned warehouse after escaping the casino. There, he kills a police officer and a standoff ensues with the rest of the force. Jerry arrives and tries to reason with Rocky, telling him the entire building is surrounded, but Rocky takes him hostage. While trying to escape, the latter is shot in the leg and caught. After standing trial, Rocky is sentenced to death.\nOn the night of his execution, Jerry pleads with Rocky to show people that he died a coward by begging for mercy on his way to the death house, citing the negative influence he has had on Soapy and the gang as his reason. Rocky refuses, but on his way to the electric chair, he does start begging and screaming for mercy, though his motive is unclear to the viewer. The final scene shows Soapy and the gang reading of how Rocky \"turned yellow\" in the face of his execution, and they lose all respect for him."}