{"mid": "AngelsAndDemons", "IMDB_id": "tt0808151", "title": "Angels & Demons", "plot": "CERN director Maximilian Kohler discovers one of the facility's physicists, Leonardo Vetra, murdered, his chest branded with an ambigram of the word \"Illuminati.\" Kohler contacts Robert Langdon, an expert on the Illuminati, who determines that the ambigram is authentic. Kohler calls Vetra's adopted daughter Vittoria home and it is ascertained that the Illuminati- an ancient anti-religious organization thought extinct- have stolen a canister containing antimatter—a substance with destructive potential comparable to a nuclear weapon. When at CERN, the canister is stored in a unique electrical charger which ensures the antimatter's stability but when removed its back-up battery provides power for 24 hours after which the antimatter would fall out of suspension and, on coming into contact with the physical matter of the container, explode. The canister is located somewhere in Vatican City, with a security camera in front of it, as its digital clock counts down to the explosion due to occur at midnight, an explosion which will wipe out the Vatican.\nLangdon and Vittoria make their way to Vatican City, where the Pope has recently died. They are told that the four Preferiti, the cardinals who are most likely to be elected pope, are missing. Langdon and Vittoria search for the preferiti in hopes that they will also find the antimatter canister. Their search is assisted by Camerlengo Carlo Ventresca (the late pope's closest aide) and the Vatican's Swiss Guard.\nLangdon tells Vittoria how the Illuminati created a citywide map known as the Path of Illumination, a trail once used by the Illuminati as a means of inducting new members; aspirants who wanted to join the Illuminati were required to follow a series of subtle clues left in various churches in and around Rome. The clues indicate the secret meeting place of the Illuminati. Langdon is granted access to the Vatican Archives where he believes a document containing the clues to the Path of Illumination is located. The clues to the Illuminati markers are placed inside Galileo's famous book called 'Diagramma.' Langdon then sets off on the Path of Illumination in hopes of saving the preferiti and recovering the antimatter canister.\nThe Path leads Langdon and Vittoria to four churches in Rome, each one representing works of art by Baroque artist Gian Lorenzo Bernini which are associated with one of the primordial elements: Earth, Air, Fire and Water. Langdon realizes the four preferiti will be murdered in a way thematically related to each location's related element. The first cardinal is branded with an Earth ambigram and has soil forced down his throat, suffocating him; the second is branded with an Air ambigram and has his lungs punctured; the third is branded with a Fire ambigram and is burned alive; and the fourth is branded with a Water ambigram and is wrapped in chains and left to drown at the bottom of a fountain.\nDuring their search for the Illuminati lair, Langdon and Vittoria are seen getting closer.\nAfter finding the bodies of the first two preferiti, Langdon hurries to the Santa Maria della Vittoria Basilica and finds the preferiti's abductor in the act of setting the third cardinal on fire. The kidnapper is an unnamed assassin who is working under the orders of the Illuminati master \"Janus,\" whose true identity is unknown. Commander Olivetti is killed and the assassin kidnaps Vittoria. Langdon escapes and accosts the assassin at the final element's marker (Water) but he is unable to save the cardinal.\nLangdon must complete the Path of Illumination in order to find the assassin and rescue Vittoria. His search leads him to Castel Sant'Angelo which he realizes is the Illuminati lair, under which a tunnel leads directly into the pope's private library in the Vatican. Langdon frees Vittoria and together they send the assassin falling several hundred feet to his death. The two hurry back to St. Peter's Basilica where they find that Kohler has arrived to confront the camerlengo in private. Langdon and Vittoria fear that Kohler is Janus and that he has come to murder the camerlengo. Hearing the camerlengo scream in agony from being branded with the Illuminati Diamond, the Swiss Guards burst into the room and open fire on Kohler. Just before he dies, Kohler gives Langdon a mini video camera containing a video Kohler made while confronting the camerlengo and tells him to give it to the media.\nWith time running out, the Swiss Guard evacuates the Basilica. The camerlengo rushes back in, claiming that he has received a vision from God who has revealed the location of the antimatter canister to him. With Langdon in pursuit, the camerlengo ventures into the catacombs and finds the canister sitting atop the tomb of Saint Peter. Langdon and the camerlengo retrieve the antimatter and get in a helicopter with only minutes to spare. The camerlengo manages to parachute safely onto the roof of St. Peter's just as the canister explodes harmlessly in the sky. The crowd in St. Peter's Square look in awe as the camerlengo stands triumphantly before them. Because of this \"miracle,\" the cardinals debate whether to elect the camerlengo as the new Pope. Langdon manages to survive the explosion using a window cover from the helicopter as a parachute, a trick he learned while touring CERN with Maximillian Kohler and lands in the Tiber River.\nAs Langdon regains consciousness, he finds himself in a hospital located on an island. He is given the video camera which he placed in the pocket of his tweed jacket. He is shocked when he hears the footage and becomes desperate to head back to the Vatican. The video shows the camerlengo branding himself with the Illuminati diamond and confessing that he himself is Janus, and who set in motion the night's chain of events in order to sabotage the Vatican. He also confesses that he killed the Pope with an overdose of heparin, a powerful anticoagulant because the Pope revealed he had fathered a child.\nAfter viewing Kohler's tape, Langdon, Vittoria and the cardinals confront the camerlengo. Shortly before the novel begins, the Pope met with Leonardo Vetra who believed that antimatter was capable of establishing a link between science and God. Vetra's beliefs caused great discomfort to the camerlengo. While discussing Vetra, the pope reveals that his support is due to science having given him a son. Without waiting to hear the explanation (that the child was the result of artificial insemination) and horrified that the Pope appeared to have broken his vow of chastity, the camerlengo plots to rectify the situation. He poisoned the pope and, under the guise of an Illuminati master (Janus), he recruited the assassin to kill Vetra, steal the antimatter and kidnap and murder the preferiti. The camerlengo planted the antimatter in St. Peter's basilica, feigned his last minute vision from God and retrieved the canister just in time to save the Vatican from the ensuing explosion. This was in hope to unite the struggling Catholic Church. The Illuminati involvement was merely a plot engineered by the camerlengo to cover his own involvement. Upon the discovery and the camerlengo's attempts to justify his murder of the Pope, Cardinal Saverio Mortati, Dean of the College of Cardinals, reveals that the camerlengo is in fact the late pope's biological son, conceived with a nun through artificial insemination. Overcome with guilt, Ventresca soaks himself in oil and sets himself on fire before a crowd of onlookers in St. Peter's Square. His ashes are recovered by Mortati, who places them in an urn which is placed inside his father's sarcophagus. It is revealed that the cardinals' endorsing of him would have made him Pope by acclamation. Mortati is unanimously elected pope by the cardinals and Langdon and Vittoria reunite at Hotel Bernini where they share an extensive meal before making love. The last brand, the Illuminati Diamond, is given to Langdon on indefinite loan, provided he return it to the Vatican in his will."}