{"mid": "AngryVideoGameNerdTheMovie", "IMDB_id": "tt2123146", "title": "Angry Video Game Nerd: The Movie", "plot": "In 1983, 2 million copies of the \"worst video game of all time\", ET for the Atari 2600, are dumped into a landfill outside Alamogordo, New Mexico. In the present day, game executive Mandi (Sarah Glendening) of Cockburn Industries, Inc. proposes to her bosses creating an intentionally bad sequel, ET 2. Thanks to the popularity and success of the Angry Video Game Nerd, sales of poorly made video games have increased dramatically, and a review of ET 2 by the Nerd would drive his fans to buy the game.\nThe Nerd (James Rolfe) and Cooper Folly (Jeremy Suarez) are working on a video game review. The Nerd has become disheartened over the years, as his fans continue to buy and play the games he reviews and warns people to stay away from. On top of this, the Nerd must promote and sell bad video games as part of his job at GameCops. When he discovers marketing for ET 2, his fans encourage him to review E.T., something he has stood against for years because the game scarred him as a child. After some personal thought, the Nerd decides to go to Alamogordo to debunk the conspiracy surrounding the buried cartridges. He is accompanied by Cooper and Mandi, and the trip is completely funded by Cockburn Industries.\nWhile filming their expedition, Cooper reveals that he believes in a super-being known as Death Mwauthzyx, who has the power to destroy all existence. Sergeant McButter (Helena Barrett) and the legless General Dark Onward (Stephen Mendel), thinking the trio is looking for extraterrestrials, attempt to capture them. Onward accidentally blows his right arm off with a grenade, giving the trio enough time to escape.\nThe Nerd, Cooper and Mandi search for the creator of ET, Howard Scott Warshaw, for answers. They instead stumble across the home of Dr. Zandor (Time Winters), who tells them that ET's level design is an exact map of Area 51. Dr. Zandor gave the code to Warshaw to help him meet the five-week deadline Atari set for ET's completion, and to exact revenge on the government for kidnapping and holding hostage an alien he was attempting to free. The government ordered the burial of the cartridges, while Zandor escaped with the metallic material Area 51 was researching at the time in an attempt to reassemble the alien's spaceship, replacing it with tin foil. Mandi is captured by McButter while wandering outside of the house. The Nerd and Cooper, believing she is a double agent, do not go after her.\nGoing back to the Alamogordo site, the Nerd and Cooper discover a large crowd of fans and the head of Cockburn Industries promoting the release of ET 2 with the promise of digging out a copy of the original ET from the site. The Nerd tells his fans there are no cartridges buried there, but Warshaw himself appears and tells fans the opposite. Annoyed, the Nerd breaks into Area 51 disguised as an alien. He is captured, and General Onward attempts to force him to play E.T.. Onward launches a missile at Mount Fuji, the basis for the Atari logo, and while leaving the room, gets his left arm cut off in the door. During the launch countdown, an alien resembling the one in E.T. grabs the Nerd and pulls him to safety.\nThe destruction of Mount Fuji releases Death Mwauthzyx, who was trapped inside the mountain. Meanwhile, Mandi keeps McButter away from the Nerd and Cooper's location, eventually leading them to a confrontation on the Eiffel Tower in Las Vegas.\nThe Nerd and alien escape in a fighter jet similar to one in the NES Top Gun video game, while the alien reveals Death Mwauthzyx can destroy all existence by turning the satellite dish on his head. Cooper is captured by Death Mwauthzyx and brought to Las Vegas, where Mandi knocks McButter off the Eiffel Tower to her death. Mandi is also captured by Death Mwauthzyx. The Nerd and Alien crash-land at the Alamogordo site, where a captured Dr. Zandor shouts to them that he hid the alien's spaceship metal inside the millions of E.T. game cartridges. Alien summons every single copy of the game to form the spaceship. The Nerd and Alien leave for Las Vegas to stop Death Mwauthzyx. The armless General Onward is killed when attempting to stop them.\nThe Nerd fires a laser at Death Mwauthzyx's satellite dish, causing Death Mwauthzyx to disappear forever. They return to the Alamogordo site and reunite with Dr. Zandor and the Nerd's fans. Cooper and Mandi share a kiss, while the Nerd finally reviews E.T. for his fans before Alien leaves for good. Everyone, including Mandi, throw the copies of the sequel into the landfill."}