{"mid": "Angus", "IMDB_id": "tt0112368", "title": "Angus", "plot": "Angus Bethune (Talbert) is a teenage boy living in Minnesota who, despite his talents as a football player and in science class, holds deep insecurities about himself. Since kindergarten, he has been regularly harassed by handsome Rick Sanford (Van Der Beek) and his complacent cohorts, for not being \"normal\" due to being overweight and is, in their view, \"named after a cow\". His only friend is Troy Wedberg (Owen), who is also a social outcast. He also has feelings for Melissa Lefevre (Richards), though he is fearful of expressing it because she is dating Rick. Eventually, tired of the abuse from Rick, Angus applies to a magnet school where he hopes to be free of the constant humiliation. However, well aware of his feelings for Melissa, Rick rigs an election so that they will dance together in the upcoming freshman Winter Ball as King and Queen, respectively. While confronting Rick about the stunt, he is ordered by the principal not to lay a hand on Rick or he would be expelled and lose his chance to go to the magnet school.\nTo get ready for the dance, Angus gets help not only from Troy, but also his mother, Meg (Bates), and his narcoleptic grandfather, Ivan (Scott). Ivan tells him about a dance move called the Irish Swoon that he claims is a guaranteed lady-pleaser, but Angus fears that his largeness makes him an inept dancer and would embarrass both him and Melissa. To fix this, Ivan takes him to Madame Rulenska (Moreno), where despite his best efforts, he comes out worse than before (and injures her in the process). Later on, despite his request for a black tuxedo and wanting to be normal, Ivan purchases him a plum one and tells him that he can be normal and an individual at the same time. He tells him that running away to another school will not solve anything and that he needs to stand up against Rick while he still can. He also mentions that he doesn't let anyone tell him that his relationship with April (Anna Thompson) is a mistake because she is 30 years younger than him and they see each other as perfect.\nOne day after football practice, Angus opens his locker and sees that his favorite pair of boxers is missing. He and Troy later learn with their own eyes that Rick hoisted them up the flagpole for the school to see, which then fly squarely onto Melissa's face as she passes by. Angus storms home in anger, but Rick and company quickly kidnap Troy. Outside the school, they ask him for anything that would embarrass Angus at the Winter Ball. He refuses their request and tries to escape, only to break his arm as he trips to the floor while Rick gives him an ultimatum. At home, Meg tells Ivan that having Angus transfer to a magnet school would be for the best. She hates seeing him suffer another day with humiliation and does not think Ivan has the right answers. In turn, Ivan confronts Meg for over-mothering Angus and warns her that letting him run away from his bullies to another school is a mistake. He mentions if Angus stands any chance of ending his humiliation, he needs to make the change by standing up for himself and facing his bullies. Ivan admits he never let Meg run away from her problems and admires how strong she is today.\nMeanwhile, Angus helps Ivan prepare for his and April's wedding. As Angus waits outside Ivan's room on the day of the wedding, he confides with him about his love for Melissa. Angus admits he is proud of him because he has the strength to not care if everyone else sees his marriage to April as wrong since they love each other. He wishes to have Ivan's strength to stand up to Rick and tell Melissa how he feels. When he tries to wake him, Angus quickly discovers that he has died and tells the wedding guests there. Distraught, Angus opts to stay home for a few days trying to cope with Ivan's death. By that time, fearful that Rick will hurt him even more, Troy gives him the videotape containing the footage of Angus practicing his dancing with an inflatable doll while confessing his feelings for Melissa. Troy visits Angus at home to offer his condolences, but he doesn't listen and it leads to an argument between them. When Troy calls him out for not understanding how it felt to be ostracized by Rick, Angus snaps and tells Troy that he knows better. Angus also admits he won't go to the Winter Ball mainly because he still plans to transfer, to escape both Rick's humiliation and to better cope with Ivan's death.\nLater that week while cleaning up from the wedding that never happened, Angus receives a box from April and opens it, revealing the plum suit that he had earlier rejected when Ivan bought it for him regardless. She wishes him luck in the future and leaves. In that moment, Angus realizes that Ivan was right all along: he needs to stand up for himself and face Rick or nothing will change. Resolved to follow Ivan's advice, he rejects an interview from the magnet school, wears the plum suit, and marches to the dance in the school gymnasium. Outside the gym, Troy warns him to return home at once because Rick has a bad prank planned for him. A furious Angus rebuffs his request, revealing he is sick of enduring Rick's torment and marches inside anyway. He meets Melissa, and they converse for the first time. He is surprised when she tells him she is nervous because everyone will be staring at them. As they are introduced to the students, Rick plays Troy's videotape on the monitors, and the students laugh. A humiliated Melissa runs out in tears and Angus follows her, infuriated with Troy for betraying him to Rick. Outside, he apologizes, but she does not blame him. Surprisingly, Melissa shows her disgust with Rick and reveals to Angus that she is bulimic. She also mentions that Rick is very controlling and also abusive towards her and the other students, making them fear him. Angus learns that Melissa likes him more than Rick because he is kind and respectful of others. Finding common ground, they go back inside and dance, even as she helps him out with some of the steps. After they receive a mild reception from the students, Rick scolds her, while Angus comes to her defense. Rick begins aggressively shoving Angus and follows up with a hard punch to the face, breaking Angus's nose and sending him crashing through a table. Rick sarcastically tells him, \"Welcome to high school\", and adds that he's glad he's leaving the school. In spite of his broken nose, Angus defiantly rises to his feet and furiously shouts back, \"I'm still here, asshole!\" Angus then repeatedly pushes Rick back until he falls to the ground, petitioning him to realize that there are many people that don't fit his idea of \"normal,\" and are unwittingly ostracized for it, and are fed up with the humiliation. He gives Rick a choice to join them and accept the students as individuals or continue rejecting them by thinking himself as normal. Rick selfishly chooses the latter by replying, \"Whatever I am, it's something you're never gonna be,\" to which Angus retorts \"Thank God!\" The students congratulate Angus for taking a stand against Rick and even Rick's former friends abandon him. Melissa dances with Angus again and Troy enacts a little revenge on Rick by breaking his nose with his cast and impressing a girl upon whom he has a crush.\nIn the end, Melissa asks Angus to walk her home, and they kiss before Melissa retires for the night. Angus rejects the offer to transfer to the magnet school, realizing that his grandfather was right and that he doesn't have to run away anymore. Angus mentions that Rick was suspended for his video prank and that his popularity with the other students suffered because of it."}