{"mid": "AnimalKingdom", "IMDB_id": "tt1313092", "title": "Animal Kingdom", "plot": "After his mother overdoses, 17-year-old Joshua \"J\" Cody (James Frecheville) asks his estranged grandmother, Janine \"Smurf\" Cody (Jacki Weaver), for help, and she invites him to move in with her. Smurf is the affectionate matriarch of a Melbourne crime family that uses her home as a base. Her home is also being watched by cops who are looking for the oldest son, Andrew \"Pope\" Cody (Ben Mendelsohn), who is in hiding. The volatile middle brother, Craig (Sullivan Stapleton), deals drugs successfully enough to have bought the house for his mother. The youngest brother, Darren (Luke Ford), follows the lead of his siblings, while family friend \"Baz\" leads the gang, which specializes in armed robbery.\nCraig takes J along to meet with a crooked cop from the drug squad, who tells him that renegade cops on the armed robbery squad are on the look out for all of them. Later, Baz goes to meet Pope at a shopping centre, where they discuss quitting crime and going straight. As Baz gets in his car to leave, police approach and kill him. Angry, Pope and Craig want revenge, and ask J to steal a Commodore and bring it to Darren's place. The car is then planted in the middle of a street. Two policemen are soon drawn to the scene, where they are ambushed and killed. The next day, Pope, Darren and J are taken in for questioning, where J meets Detective Senior Sergeant Nathan Leckie who also leads the armed robbery squad. Leckie, one of the few non-corrupt police officers, recognizes J's predicament and begins to lean on him. The three are later released from custody, but J returns with his girlfriend Nicky to her parents' home.\nCraig, who has avoided being picked up by the police, Pope, Darren and Smurf meet at a diner, where they recognize J as the weak link. When told by Smurf to give himself up for questioning, Craig panics, and meets a friend in rural Bendigo. He learns that the house is already being monitored, and as the police arrive tries to flee through a field but is gunned down. Pope and Darren take J to meet their solicitor Ezra. He coaches him to not tell the police anything and pressure him to break up with Nicky, which he does. Leckie takes J into custody again, where he proposes that J be moved to witness protection, but J turns down the offer. Meanwhile, Nicky, unsure what to do, shows up at Smurf's home, where Pope gives her heroin, questions her, then smothers her to death to keep her silent.\nWhen J returns to Smurf's house the next morning he discovers Nicky's bracelet outside the house. He calls Nicky's phone, and realising something is not right, flees to Nicky's parents house. Pope gets Nicky's address from Darren and arrives in time to intercept J. J flees on foot and is taken into a safe house. With Craig and Baz dead, Pope and Darren imprisoned, and J potentially being the star witness for the prosecution, Smurf decides, \"J needs to go\". Smurf uses her connections to procure J's address, and persuades the corrupt cop to help her. Police from the drug squad then raid the safe house. J jumps a fence and returns to Smurf's house, saying he wishes to help free Pope and Darren from jail. To do this, the family's barrister then coaches J's answers.\nAfter his day in court, Leckie sees J before his departure from the safe hotel, and asks him if he has found his place in the world (a reference to Leckie's animal kingdom metaphor for J's predicament). Pope, Darren and Smurf celebrate with champagne while being interviewed after their controversial acquittal. Smurf later sees Leckie in the supermarket and taunts him. Later again, J returns to Smurf's home asking to stay, before going to his room. Pope enters and begins to talk to him, but is cut off when J shoots him in the head. In the final scene, J returns to the living room and embraces a now silenced Smurf."}