{"mid": "AnimalFarm", "IMDB_id": "tt0204824", "title": "Animal Farm", "plot": "Manor Farm is a formerly prosperous farm that has fallen on hard times, and suffers under the now-ineffective leadership of its drunken and aggressive owner, Mr. Jones. One night, Old Major, the prize boar and the second-oldest on the farm, calls the animals on the farm for a meeting, where he compares the humans to parasites and encourages the animals to break free from their tyrant's influence, while reminding them that they must hold true to their convictions after they have gained freedom. With that, he teaches the animals a revolutionary song before collapsing dead mid-song to the animals' horror.\nThe next morning, Jones neglects to feed the animals for breakfast, and they decide to break into the storehouse to help themselves. When Jones wakes up and attempts to intimidate them with his whip, the animals revolt and drive the drunken and irresponsible Mr. Jones away from the farm, renaming it \"Animal Farm\". They set to work destroying every trace of the farmer's influence, mainly the weapons used against them. The people of the surrounding area rally against them, but are beaten back after a fierce fight. A subsequent investigation of the farmhouse leads them to concede against living there, though one of the head pigs, an antagonistic boar named Napoleon, takes interest in the abandoned house, and even more so in a litter of puppies left motherless.\nThe Seven Commandments of Animalism are written on a wall of the barn to illustrate their community's laws. The most important is the seventh, \"All animals are equal.\" All the animals work, but the workhorse, Boxer, his friend Benjamin the donkey, and the film's protagonist, put in extra work. Snowball attempts to teach the animals reading and writing; food is plentiful, and the farm runs smoothly. The pigs elevate themselves to positions of leadership, and set aside special food items ostensibly for their personal health. Napoleon takes the pups and trains them privately.\nWhen Snowball announces his idea for a windmill, Napoleon opposes it. Snowball makes a speech in favor of the windmill, whereupon Napoleon has his dogs chase Snowball and kill him. Afterwards, Napoleon declares himself leader with fat pig Squealer as his propagandist, and makes changes. Meetings will no longer be held, and instead, a committee of pigs will run the farm. The animals eventually work harder, with the promise of easier life, once the windmill is completed.\nDuring this time, the pigs also decide to start altering their own laws. \"No animal shall sleep in beds\" is changed to \"No animal shall sleep in beds with sheets\" when the pigs are discovered to have been sleeping in the old farmhouse. Before long, Napoleon's greed drives him to negotiate with a local trader named Mr. Whymper for a supply of both jellies and jams. The price is all of the hens' eggs. When the hens discover this, they attempt to revolt by throwing their eggs at the pigs during an attempted seize by force. To instill fear, Napoleon holds a \"trial\", and a sheep and duck join the hens accused as traitors. They are taken outside and murdered by the dogs, with their blood used to edit a commandment \"No animal shall kill another animal\" to \"No animal shall kill another animal without cause\". After their deaths, the revolutionary song is banned because Napoleon claims the dream of Animal Farm has been realized, and the revolution is over. He also threatens that the penalty for animals caught singing the song is death.\nGrowing jealous of Whymper's financial success due to his trading with Animal Farm, a hostile group of farmers attack the farm, and Jones, shunned for his failure and drunkenness, uses blasting powder to blow up the windmill. Though the animals win the battle, they do so at a great cost of lives, and Boxer is wounded. Boxer continues working until he collapses one night, while working on rebuilding the windmill. Napoleon sends for a van to take Boxer away, which Benjamin recognizes as the \"death wagon\" from Whymper's glue factory. That night, a supply of alcohol is delivered. The next day, Squealer delivers a phony speech, claiming to have been at Boxer's side at his deathbed, and states that his last words were to glorify Napoleon. The upset animals see through the propaganda, and recognize how dictatorial Napoleon has become, but are driven away by the snarling dogs before anything can be done.\nYears pass, and the pigs have now learned to both walk upright and wear clothes. The Seven Commandments are reduced to a single phrase: \"All animals are equal, but some animals are more equal than others.\" Napoleon holds a dinner party for a delegation of outside pigs, who congratulate Napoleon on having the hardest-working and lowest-consuming animals in the country. Napoleon gives a toast to a future when pigs own and operate farms everywhere.\nBenjamin, overhearing the conversation, imagines the faces of all the pigs assuming into the likeness of Mr. Jones, as he realizes the similarity between the two. Realizing that things have become \"worse than ever for ordinary creatures\", all of the animals unite together to overthrow Napoleon. The animals march upon the farmhouse, Napoleon roars his guard dogs for help, only to see the dogs are now drunk, the pigs are unable to overpower their infuriated attackers. Napoleon, now helpless, unable to defend himself as his fellow pigs are trampled underfoot to death (Off-screen). Benjamin standing in grim triumph as he and his fellow animals retake the farm."}