{"mid": "Anjaam", "IMDB_id": "tt0109134", "title": "Anjaam", "plot": "Shivani (Madhuri Dixit) is an air hostess for Air India. She meets Vijay Agnihotri (Shahrukh Khan), the son of a wealthy industrialist in a disco club. He tries to get friendly but without any success. Later he meets Shivani in an airplane and instantly falls in love but she shows no interest in him. This does not stop Vijay and he continues to pursue her, only to be rejected every time. Vijay informs his mother that he intends to marry Shivani. When they approach Shivani’s family with a proposal, they witness that Shivani had married another man named Ashok. Vijay is now heartbroken and shocked. Shivani and Ashok decide to move to America.\nFour years later, Vijay still cannot forget Shivani and repeatedly turns down marriage proposals brought by his mother. He comes across Shivani again and Ashok who have a daughter named Pinky. Vijay befriends Ashok with fake airline project as the hope of getting closer to Shivani. Ashok is totally oblivious to Vijay's real intentions, to the extent that he does not believe Shivani when she tries to convince him of what Vijay is planning against them. One day, Ashok kicks Shivani out of their house after they have an argument. Vijay witnesses this and severely beats Ashok, leaving him unconscious. When Ashok is being treated in the hospital, Vijay removes the oxygen mask keeping Ashok without oxygen supply, thereby killing him. Shivani attempts to convince the police that Vijay is responsible for Ashok’s death. However, Vijay bribes his friend, Inspector Arjun Singh, to provide an alibi, meaning Shivani could not be believed and Vijay is released without charge. Vijay then approaches Shivani's house and begs her to say she loves him. When she refuses, he frames Shivani for his attempted murder and she is sentenced to three years in prison whilst Pinky is placed under the care of Shivani's sister and drunkard brother-in-law (Tinu Anand). Her brother-in-law treats Pinky extremely badly which eventually causes her to run away with the help of her aunt. Vijay accidentally kills Shivani’s sister and daughter by running his car over them. Shivani learns about their deaths and realizes Vijay is the one who killed them. Shivani decides go to any lengths to seek revenge. In an attempt to escape, she makes a complaint about the brutality of her prison guard. Again her plea is ignored. In prison she comes to know that she is pregnant with Ashok's child . When the prison guard learns that Shivani tried to complain, she gives her a severe beating which causes her to have a miscarriage. Shivani soon kills the prison guard by dragging her to the gallows and hanging her by her neck. But as there is no evidence, she is not convicted for that.\nThree years later, Shivani is released from prison. First, she goes to her brother-in-law's house and kills him by choking him with rupee notes and chewing off a significant amount of flesh from his arm. Inspector Singh learns about the murder and suspects Shivani. Singh misbehaves with her in a barn, but she sets the barn on fire, killing Inspector Singh. She then searches for Vijay where she comes to know that he has moved to Tikamgarh. She then goes to work at a hospital for the mentally ill and finds Vijay, who had become paralyzed in the car accident after running over Shivani's family. She volunteers to look after him and rehabilitate him. When cured, Vijay begs Shivani to say she loves him. She opens her arms to him. Whilst they embrace, she stabs him and then starts attacking him for everything he did. She confesses that she made him better for one purpose: to kill him. (She says it's a sin to kill a handicapped person, who cannot defend himself.) Eventually, they both dangle from a cliff (with Vijay holding onto Shivani’s foot). Vijay says that if he falls to his death he'll take Shivani with him. Deciding that it is not necessary for her to live as long as Vijay is dead, Shivani lets go of the ledge causing both of them to fall off the cliff to their deaths."}