{"mid": "AnOfficerAndAGentleman", "IMDB_id": "tt0084434", "title": "An Officer and a Gentleman", "plot": "Zachary \"Zack\" Mayo (Richard Gere) is preparing to report to Aviation Officer Candidate School. As he is doing so, he has brief flashbacks of his childhood. After the death of his unnamed mother (who committed suicide), an adolescent Zack was sent to live with his only living relative, his father Byron Mayo (Robert Loggia), who is stationed in the Philippines. The elder Mayo, a Navy Chief Petty Officer/Chief Boatswain's Mate, made no attempt to hide his heavy drinking and hiring of prostitutes from a young Zack. When Zack said he needed help, Byron said he did not ask to get married nor be a father, because he is always out on sea all the time. But seeing the look on his face, he decide to let him stay with him. Mostly Zack became a Navy brat and travelled with his father. The flashbacks advance to the present, where Zack has just graduated from college and informs his father he will be going to Aviation Officer Candidate School (AOCS). Byron, who hates officers, tells Zack that his dream of becoming an officer is as unrealistic as hoping to become President. Despite his father's discouragement, Zack is determined to go through with his childhood dreams of becoming a Navy pilot as well as prove to him that he can make it and in the end Byron would have to \"salute\" Zack.\nUpon arrival at AOCS, Zack and his fellow AOCs are shocked by the harsh treatment they receive from their head drill instructor, Marine Gunnery Sergeant Emil Foley (Louis Gossett, Jr.). Foley makes it clear that the 13-week program is designed to eliminate OCs who are found to be mentally or physically unfit for commission as an ensign in the U.S. Navy, which will earn them flight training worth over $1,000,000. Foley warns the male candidates about the \"Puget Sound Debs\"—young women in the area who dream of marrying a Naval Aviator to escape their dull, local lives. Foley claims they scout the regiment for OCs, and will feign pregnancy or even stop using birth control to become pregnant to trap the men.\nZack becomes friends with fellow candidates Sid Worley (David Keith), Emiliano Della Serra (Tony Plana), Lionel Perryman (Harold Sylvester), and Casey Seeger (Lisa Eilbacher). Zack and Sid meet two local young women—factory workers—at a Navy Ball. Zack begins a romantic relationship with Paula Pokrifki (Debra Winger) and Sid with Lynette Pomeroy (Lisa Blount).\nFoley rides Zack mercilessly, believing he lacks motivation and is not a team player. When Zack's side business of selling pre-shined shoes and belt buckles is discovered, Foley hazes him for a weekend in an attempt to make him DOR (\"Drop on Request\", a Navy term for requesting termination of training), but Zack refuses. Foley states Zack will be declared unfit, which frightens Zack into admitting he has no options in civilian life. Satisfied that Zack has come to a crucial self-realization and realizing what he's made of, Foley decides to let him stay. He punishes Zack by making him clean all the urinals, but does not recommend attrition. Henceforth, Zack starts behaving like a team player.\nZack and Paula spend the next weekend together, and she takes him home for dinner to meet her family. Her stepfather behaves strangely, and when Zack asks why, Paula shows him an old picture of her biological father. He was an AOC who had an affair with her mother, but deserted her following his commissioning and refused to marry her when she became pregnant with Paula.\nZack is close to breaking the record time for negotiating the obstacle course, but Casey faces disqualification when she cannot negotiate the 12-foot-high wall (3.7 m). Zack abandons his attempt to break the course record in order to coach Casey over the wall, and she makes it.\nZack attends dinner with Sid and his parents and learns that Sid has a long-time girlfriend back home. Sid plans to marry her after he receives his commission. Meanwhile, Lynette has been dropping hints to Sid that she may be pregnant. Sid agonizes over this possibility, especially when Lynette tells him she will not have an abortion. After having a severe anxiety attack during a high-altitude simulation in a pressure chamber, Sid realizes he joined the officer training program out of a sense of obligation to his family, and he Drops On Request (\"DOR\"s, meaning he voluntarily resigns). He leaves the base without saying goodbye, so Zack and Paula go out to look for him.\nSid goes to Lynette's house and proposes marriage. She is elated until he tells her he DORed, and she would not be marrying a Navy pilot after all. Disgusted, she turns him down and confesses she was not pregnant. She says she thought he understood. She wants to marry an aviator, escape from her small town and live an exciting life overseas. She berates him for dropping out and gives back the engagement ring he bought her. Crushed, Sid goes to the motel where he and Lynette spent his free weekends, asks for their old room, and begins drinking.\nZack and Paula arrive at Lynette's shortly after Sid leaves and ask about Sid's whereabouts. Zack curses Lynette for trying to trick Sid, and he and Paula rush off to search for him. Zack goes to the motel and is heartbroken when he finds Sid has committed suicide out of grief. Paula tries to comfort Zack, but he rejects her and heads back to base with the intent to DOR himself. Foley will not let him quit so close to graduation and feels bad about what happened to Sid. Zack challenges Foley to an unofficial martial arts bout. Although Zack dominates for most of the fight, Foley wins by kicking Zack in the groin and then tells him he can quit now if he still wishes to do so.\nZack shows up for graduation and is sworn into the Navy with his class. Following naval tradition, he receives his first salute from Foley in exchange for a US silver dollar. While tradition calls for the drill instructor to place the coin in his left shirt pocket, Foley places the coin in his right pocket, acknowledging that Zack was a special candidate. Zack thanks him for not giving up on him and tells him he never would have made it without him. While leaving the base, he sees Foley initiating a set of new candidates for AOCS who are in the same position he was 13 weeks prior.\nZack, now Ensign Mayo with orders to undertake flight training, seeks out Paula at the factory where she works and declares his love to her. He picks her up and walks out with her in his arms to the applause of her co-workers, including Lynette."}