{"mid": "Anonymous", "IMDB_id": "tt1521197", "title": "Anonymous", "plot": "After a monologue delivered by Derek Jacobi, the film opens in 1603, with Robert Cecil, Earl of Salisbury, ordering a desperate search for a trove of manuscripts. Ben Jonson, who has the manuscripts, flees down the streets of London and into the theatre known as The Rose. Hot on his heels, the soldiers who have been sent to arrest Jonson, break down the doors and intentionally set the theatre alight. Successive flashbacks cast us back five and then forty years, as the film evokes the reputed life of Edward de Vere from childhood through to his entanglement in an insurrection, and later on to his deathbed.\nThe main action takes place five years earlier in 1598, a decade after the defeat of the Spanish Armada, as political intrigue flourishes between the Tudors and the Cecils (father William and son Robert), over the succession to Queen Elizabeth I. In flashbacks, de Vere is portrayed as a prodigious genius, writing at eight or nine years of age (1558/1559) A Midsummer Night's Dream, de Vere acting the role of Puck before the young queen Elizabeth. He is then forced to live in the repressive, puritanical house of William Cecil where, years later, he kills a spying servant lurking behind an arras, much like the death of Polonius in Hamlet. William Cecil uses this murder to blackmail de Vere into a loveless marriage with his daughter, Anne Cecil, compelling him also to renounce literature. De Vere later becomes the Queen's lover, and sires – unknown to him – an illegitimate son; the son is adopted, becoming Henry Wriothesley, 3rd Earl of Southampton, but his true parentage is hidden from all but the Cecils.\nDe Vere must struggle against a taboo that would forbid him to write; against his wife's impatience with his literary work as a dishonour to her family; and against the Queen's counsellors. Foremost among these is his father-in-law William Cecil, who believes that theatres are sinful. Cecil's plan to have James VI of Scotland, the son of Mary, Queen of Scots, crowned king is also threatened by the presence of de Vere's and the Queen's child, who would be an alternative contender for the throne, and also of pure Tudor lineage.\nAlmost four decades after his private premiere, de Vere visits a public theatre and is deeply impressed by the way spectators can be swayed. The play, written by Jonson, is halted mid-performance by the royal militia because of its allegedly seditious content. Jonson is arrested and imprisoned. Much taken by the propagandistic power of art, de Vere decides to employ his secretly written plays for the promotion of the Earl of Essex's cause (Essex being another of the Queen's illegitimate sons) over the candidate preferred by the Cecils, writing Henry V and, later, Richard III as propaganda designed to foment revolution. He contacts Jonson, who is confined in the Tower of London until de Vere uses his influence to free him, in order to have his play Henry V staged under Jonson's name. Jonson is unhappy about the plan, assuming that the play will be an amateurish effort that will tarnish his name. Jonson does not claim authorship, allowing an unscrupulous young actor, William Shakespeare, to step up on stage as author. It is this \"drunken oaf\" who takes on the role as de Vere's front man, while Jonson becomes de Vere's only confidant in the truth.\nShakespeare however, having discovered the real author's identity, extorts money from de Vere to build the Globe Theatre, and wangles £400 per year for posturing as a front. After Christopher Marlowe stumbles on the truth that Shakespeare's inexplicable talents hide the genius of another hand, he is found with his throat slit. Jonson later confronts Shakespeare and accuses him of the murder.\nAt the climax, de Vere uses the play Richard III as a thinly veiled attack on the hunchbacked Robert Cecil. The plan is to incite a mob to march against Cecil, and thus weaken his position at court. At the same time, Essex is to march with the Earl of Southampton to the Palace, to promote his own claim to the succession. Meanwhile, de Vere writes Venus and Adonis to remind the Queen of their old love. He hopes to see her again in an atmosphere of renewed intimacy, and to persuade her to dismiss Cecil.\nThe plan fails, however, as a jealous Jonson, unaware of de Vere's plan, betrays the plot to Cecil. Jonson soon learns of the plan, but fails to alert Francesco of his betrayal in time, as the mob is massacred by soldiers with muskets and artillery pieces, stopping it from joining Essex. The Queen, swayed by Cecil, thinks that Essex is trying to depose her. Essex and his men are lured into the Palace courtyard, where they are ambushed by soldiers firing muskets from the balconies above. Essex and Southampton surrender honorably. Essex is later executed, but not before screaming \"God save the Queen!\". Southampton is later released.\nRobert Cecil then tells a broken de Vere that Elizabeth had other bastard sons – one of whom was de Vere himself. If true, it would mean that de Vere committed incest with his mother. He has a private audience with Elizabeth, at which the Queen agrees to spare Southampton, but insists that de Vere remain anonymous as the true author of \"Shakespeare's\" works.\nAfter the Queen's death, James VI succeeds as James I of England, though Cecil's hopes for a more puritanical regime are shattered when James reveals himself to be an avid \"theater man\". Shakespeare retires on his ill-gotten gains to Stratford to become a businessman, and de Vere dies in 1604, having commended his manuscripts to the care of a repentant Jonson. Cecil, however, still wants the manuscripts destroyed. With the destruction of The Rose, he believes them destroyed, but he later discovers they have survived. Nevertheless, the \"truth\" remains concealed: that Edward de Vere, not the nearly illiterate Shakespeare, is their real author."}