{"mid": "Anthropoid", "IMDB_id": "tt4190530", "title": "Anthropoid", "plot": "It is the height of Nazi occupation in Europe.\nIn December 1941, two agents from the Czechoslovak government-in-exile, Jozef Gabčík (Cillian Murphy) and Jan Kubiš (Jamie Dornan) are parachuted into their occupied homeland. Jozef is injured when he crashes through a tree upon landing, but both men set out to find their contact in Czechoslovakia. They are discovered shortly after by two resistance fighters who turn out to be traitors; one is shot by Jozef but the other man escapes. Stealing their truck, the agents head for Prague.\nWhen they seek out their contact, they are directed to Dr. Eduard (Sean Mahon), who stitches Jozef's foot, and arranges for the agents to meet other members of the resistance, led by \"Uncle\" Jan Zelenka-Hajský (Toby Jones). The agents reveal that they are to execute \"Operation Anthropoid,\" the assassination of Reinhard Heydrich (Detlef Bothe), the main architect of the Final Solution, and the head of Nazi forces in German–occupied Czechoslovakia.\nWith limited intelligence and little equipment in a city under lock-down, Jozef and Jan must find a way to assassinate Heydrich, an operation that, they hope, will change the face of Europe. With the help of two young women, Marie Kovárníková (Charlotte Le Bon) and Lenka Fafková (Anna Geislerová) along with other plotters, the agents plan to ambush Heydrich as he arrives at his headquarters by car. When the agents learn that Heydrich is about to be transferred, the plan goes into effect with the duo bolstered by the addition of other agents who have been parachuted into Czechoslovakia and the remaining resistance fighters in Prague.\nOn 27 May 1942, the attack is carried out but nearly botched when Jozef's Sten submachine gun jams, but Heydrich is severely wounded when Jan throws a bomb that shatters his limousine, followed by Jozef's fusillade of gunfire. Immediately after, the assassins go on the run, and Nazi forces round up thousands of Czech citizens and carry out a terrible reprisal. When Heydrich dies, the combined group of seven parachutists are pursued to their refuge at the Orthodox Cathedral of Saints Cyril and Methodius in Prague. Resistance fighter Karel Čurda (Jiří Šimek) turns on the agents and reveals where they are hiding. The family who Jozef and Jan stay with are punished, their house attacked by numerous officers. The mother commits suicide by taking a cyanide tablet in the bathroom. The son is brutally tortured, which leads him to give in to the Nazis' demands. He tells them where Jozef and Jan are hiding, in the cathedral. Hundreds of Nazi troops storm the cathedral and all the agents are killed in a fierce battle.\nReprisals continue with the village of Lidice destroyed with all the males 16 years old and older shot, children gassed to death and women sent to camps. Another Czech village, Ležáky, is also destroyed and its inhabitants are murdered because a radio transmitter is found there. Ultimately, a total of 15,000 Czechs were killed in the aftermath of the \"Heydrich Terror\". The assassination of SS-Obergruppenführer Heydrich was the only successful government-organised assassination of a top-ranking Nazi in the Second World War."}