{"mid": "Antichrist", "IMDB_id": "tt0870984", "title": "Antichrist", "plot": "=== Prologue ===\nA couple makes passionate love, as their toddler, Nic, climbs up to the bedroom window and falls to his death.\n=== Chapter One: Grief ===\nThe mother collapses at the funeral, and spends the next month in the hospital crippled with atypical grief. The father, a therapist, is skeptical of the psychiatric care she is receiving and takes it upon himself to treat her personally with psychotherapy. But it is not successful, and so when she reveals that her second greatest fear is nature, he decides to try exposure therapy. They hike to their isolated cabin in a woods called Eden, where she spent time with Nic the previous summer while writing a thesis on gynocide. He encounters a doe which shows no fear of him, and has a stillborn fawn hanging halfway out of her.\n=== Chapter Two: Pain (Chaos Reigns) ===\nDuring sessions of psychotherapy, she becomes increasingly grief stricken and manic, often demanding forceful sex to escape the pain. The area becomes increasingly sinister to the man, including acorns rapidly pelting the metal roof, awakening with a hand covered in swollen ticks, and finding a self-disemboweling fox that tells him, \"chaos reigns.\"\n=== Chapter Three: Despair (Gynocide) ===\nIn the dark attic the man finds the woman’s thesis studies: terrifying pictures of witch-hunts, and a scrapbook in which her writing becomes increasingly frantic and illegible. She reveals that while writing her thesis, she came to believe that all women are inherently evil. The man is repulsed by this and reproaches her for buying into the gynocidal beliefs she had originally set out to criticize. In a frenzied moment, they have violent intercourse at the base of an ominous dead tree, where bodies are intertwined within the exposed roots. He suspects that Satan is her greatest hidden fear.\nThrough the autopsy and old photos, he becomes aware that she had been systematically putting Nic’s shoes on the wrong feet, resulting in pain and deformity. She attacks him, accuses him of planning to leave her, mounts him, and then smashes a large block of wood onto his testicles, causing him to lose consciousness. The woman then performs a sex act on the unconscious man, culminating in an ejaculation of blood. She drills a hole through his leg, bolting a heavy grindstone through the wound, and then tossing the wrench she used under the cabin. He awakens alone; unable to loosen the bolt, he hides by dragging himself into the deep, dark foxhole at the base of the dead tree. Following the sound of a crow he has found buried alive in the hole, she locates him and attacks and mostly buries him with a shovel.\n=== Chapter Four: The Three Beggars ===\nNight falls; now remorseful, she unburies him but cannot remember where the wrench is. She helps him back to the cabin, where she tells him she does \"not yet\" want to kill him, adding that \"when the three beggars arrive someone must die.\" In a flashback she watches Nic climbing up to the window, but she does not act, thus displaying her essential evil much like her hypothesis. In the cabin she cuts off her clitoris with scissors. They are visited by the crow, the deer, and the fox. A hailstorm begins; earlier it had been revealed that women accused of witchcraft had been known to have the power to summon hailstorms. Finding the wrench under the floorboards, he is stabbed by her with the scissors, but is able to unbolt the grindstone. Finally free, he shows a vicious face, and strangles her to death. He then burns her on a funeral pyre.\n=== Epilogue ===\nHe limps from the cabin, eating wild berries, as the three diaphanous beggars look on. Reaching the top of a hill, under a brilliant light he sees hundreds of women in antiquated clothes coming towards him, their faces blurred."}