{"mid": "Antiviral", "IMDB_id": "tt2099556", "title": "Antiviral", "plot": "In a dystopian near-future, Syd March (Caleb Landry Jones) is employed by the Lucas Clinic, a company which purchases viruses and other pathogens from celebrities who fall ill, in order to inject them into clients who desire a connection with celebrities. In particular, the pathogens supplied by the Lucas Clinic's exclusive celebrity Hannah Geist (Sarah Gadon) are extremely popular, and another employee at the clinic, Derek Lessing (Reid Morgan), is responsible for harvesting them from Hannah directly. To make extra money, Syd uses his own body as an incubator, steals pathogens from the lab, and sells them on the black market. To do so, he uses a stolen console to break the copy protection placed on the virus by the clinic; once injected in a client, the pathogen is rendered incommunicable. He then passes the pathogens to Arvid (Joe Pingue), who works at Astral Bodies, a celebrity meatmarket where meat is grown from the cells of celebrities for consumption.\nAfter Derek is caught smuggling and arrested, Lucas asks Syd to take his place and harvest a pathogen from Hannah, who has recently fallen ill. Once he has taken a blood sample from Hannah, Syd quickly injects himself with some of her blood. He experiences the first symptoms, fever and disorientation, rapidly, and he leaves work early. His attempts to remove the virus' copy protection are unsuccessful, and the console is destroyed during the process. When Syd awakens from severe delirium the next day, he discovers Hannah has died from the unknown disease, and all products harvested from her have skyrocketed in popularity. Desperate to fix his console, he approaches Arvid, who sets up a meeting with Levine, the leader of the piracy group. Levine offers to fix the console in exchange for samples of Syd's blood, but Syd refuses. Levine subdues him and forcibly takes samples from Syd, as the pathogen which killed Hannah is now hotly in demand on the black market, and lethal pathogens are not legal to distribute.\nThe next day, a severely ill Syd is approached by two men, who drive him to an undisclosed location where Hannah is actually still alive. Syd learns from Hannah's physician Dr. Abendroth that the virus infecting them both has been intentionally engineered with a security measure to prevent analysis, which explains why Syd's console was destroyed. Hannah's death was fabricated to protect her, but she is shown to be in the extreme stages of the illness, extremely weak and bleeding from her mouth. Dr. Abendroth reveals to Syd that the virus is a modified version of an illness that Hannah has had before, and that he himself has an infatuation with her, having had samples of her skin grafted to his own arm. He further suggests that since Syd unnecessarily injected himself with Hannah's blood, he too is \"just another fan.\" As Syd's condition worsens, he returns to the Lucas Clinic, where he traces the original strain of the virus to Derek, who sold it to a rival company, Vole & Tesser. Dr Abendroth discovers that Vole & Tesser patented the modified strain, though their motives remain unclear.\nBefore Syd can proceed further, he is abducted by Levine and incarcerated in a room where his deterioration and death will be broadcast on reality television to sate Hannah's fans, who could not witness her death. As Syd begins to show the final symptoms, he escapes by spearing Levine in the mouth with a syringe and holding a nurse hostage with his infected blood. After Syd realizes that Vole & Tesser infected Hannah to harvest their own patented pathogen from her, Syd contacts Tesser and negotiates a deal. The film closes with a virtual-reality version of Hannah that advertises her \"Afterlife\" exclusively from Vole & Tesser. Syd is shown working for Vole & Tesser, where Hannah's cells have been replicated to form a distorted cell garden from Astral Bodies' celebrity meat technology. Viruses injected into her system are sold. Syd demonstrates a new virus as he sticks a needle into a genetically created arm. Later, while alone, Syd cuts the arm and drinks the flowing blood; it is revealed the arm is in fact Hannah's, as her deformed face and body are shown to be in the Cell Garden chamber."}