{"mid": "Antz", "IMDB_id": "tt0120587", "title": "Antz", "plot": "In a Central Park ant colony, Z-4195, or \"Z\" for short, is a neurotic and pessimistic worker ant who longs to express himself. His friends include fellow worker Azteca and a soldier ant, Weaver. Princess Bala uses a bar to escape her suffocating royal life, and Z falls in love with her there. To see Bala again, Z exchanges places with Weaver and joins the army, where he befriends Barbatus, a staff sergeant. Z is unaware the army's leader and Bala's fiancé General Mandible is secretly sending the soldiers loyal to the Queen Ant to die so he can build a powerful ant colony.\nAt the base of a tree near nightfall, Z realizes he is marching into battle; everyone except Z is killed by acid-shooting termites. Before dying, Barbatus tells Z to think for himself instead of following orders. Z returns home and is hailed as a war hero (despite not doing anything; left traumatized by the fighting). Secretly irate, Mandible congratulates him and introduces him to the Queen Ant. There he meets Bala, who eventually recognizes him as a worker. Finding that he has been cornered, Z panics and pretends to take Bala hostage, causing him and Bala to fall out the anthill via garbage chute. After escaping from a magnifying glass, Z searches for Insectopia, a legendary insect paradise. After arguing, Bala attempts to return to the colony but quickly rejoins Z after encountering a praying mantis.\nNews of the incident spreads through the colony, and Z's act of individuality inspires the workers and some soldier ants, halting productivity. To gain control, Mandible publicly portrays Z as a self-centered war criminal. Mandible promotes the glory of conformity and promises them a better life through the reward of completing a \"Mega Tunnel\" planned by himself. However, Colonel Cutter, Mandible's second-in-command, becomes concerned about Mandible's plans.\nAfter some misdirection, Z and Bala arrive at a picnic, where they meet two wasps, Chip and Muffy. The human owning the picnic swats Muffy, and Z and Bala end up on a dramatic ride on the human's shoes. Finally, Z and Bala find Insectopia, which consists of a human waste-bin overfilled with decaying food. Bala begins to reciprocate Z's feelings. After interrogating Weaver, Mandible learns that Z is looking for Insectopia and sends Cutter to retrieve Bala and kill Z. That night, Z gathers more stuff to burn at the fire while Cutter arrives in Insectopia and forcefully flies Bala back to the colony. Z finds them gone and returns to the colony, aided by Chip, now drunk while grieving over Muffy's death.\nZ arrives back and finds Bala held captive in Mandible's office. After rescuing her, he learns Mandible's \"Mega Tunnel\" leads straight to the lake (a puddle next to Insectopia) which Mandible will use to drown the Queen Ant and workers at the opening ceremony. Bala warns the ants at the ceremony, while Z goes to the tunnel exit to stop the workers but fails, and the water leaks in. Z and Bala unify the workers into building a towering ladder of themselves towards the surface as the water rises.\nMeanwhile, Mandible and his soldiers gather at the surface, where he explains his vision of a new colony with none of the \"weak elements of the colony\". When the workers break through, Mandible tries to kill Z, but Cutter rebels against Mandible and instead helps Z and the worker ants. Enraged, Mandible charges toward Cutter, but Z pushes Cutter out of the way and is tackled into the flooded colony with Mandible, who lands upon a root, killing him on impact; Z falls into the water. Cutter orders the soldiers to help the workers and the Queen Ant while he himself goes after Z. Although Z has seemingly drowned, Bala resuscitates him. Z is praised for his heroism and marries Bala. Together they rebuild the colony, transforming it from a conformist military state into a community that values all of its members."}