{"mid": "AnyWhichWayYouCan", "IMDB_id": "tt0080377", "title": "Any Which Way You Can", "plot": "Two years after throwing his fight with Tank Murdock, Philo Beddoe is still fighting in underground bare-knuckle boxing matches to make money on the side. Philo decides to retire when he realizes that he has started to enjoy the pain. Philo and his manager Orville decide to end his career. The problem is Jack Wilson, a new breed of fighter from the east coast who mixes martial arts with boxing. He is so effective at maiming his opponents that his handlers cannot book fights for him.\nThe Black Widows, the biker gang with a long-running grudge against Philo, make their return. They still want revenge for the destruction of their bikes. However, Philo bests them in a chase that runs through an asphalt machine during a road-paving project. They lose their hair and must wear wigs and penciled-on eyebrows to camouflage their appearance.\nAfter a fight between a mongoose and a rattlesnake, one of the handlers realizes that if Philo, king of the west coast brawlers, agreed to fight Wilson it would be the biggest draw in the history of bare-knuckle boxing. The Handlers, led by handicapper Jimmy Beekman, in conjunction with the Mafia, kidnap Philo's love interest, country-western singer Lynn Halsey-Taylor, in order to coerce Philo to agree to the fight.\nWilson, however, is a prize fighter with a sense of right and wrong. After learning of the plot, and helping Philo and Orville rescue Lynn, he decides they really don't need to fight to prove who is best. On the other hand, both fighter's personal pride makes them wonder who would have won. The brawl between the two characters ends up taking place, but is punctuated by pauses and personal reflections on their mutual admiration. Wilson breaks Philo's arm and offers to end the fight, but the two men continue the brawl. Meanwhile, the Black Widows bet everything they have on Philo because, despite their rivalry, they know he is the better fighter. When the mobsters decide to kill Philo once he gains the upper hand, the Black Widows protect their investment by beating up the Mafia men. After a long fight, Philo knocks Wilson out long enough to qualify for a win. Wilson helps Philo to the hospital to have his arm looked at, and the fighters and their friends have a beer at a bar."}