{"mid": "APassageToIndia", "IMDB_id": "tt0087892", "title": "A Passage to India", "plot": "The film is set in the 1920s during the period of growing influence of the Indian independence movement in the British Raj. Adela Quested (Judy Davis) and Mrs Moore (Peggy Ashcroft) sail from England to India, where Ronny Heaslop (Nigel Havers), Mrs Moore's son and Adela's suitor, is a magistrate in the provincial town of Chandrapore. Adela is considering marriage to Ronny, but is visiting India accompanied by his mother to see if she can adapt to living in such a foreign place.\nBoth Adela and Mrs. Moore are excited to meet Indians and learn more of Indian culture. They are disappointed to find that the British community are overtly racist and live lives totally disconnected from the Indian population. They are pleased to meet the local school superintendent Richard Fielding (James Fox), who brings them to meet the eccentric elderly Hindu Brahmin scholar Professor Narayan Godbole (Alec Guinness). Mrs. Moore meets a junior doctor named Dr. Aziz Ahmed (Victor Banerjee), a widower who is surprised by her kindness and lack of prejudice. Aziz offers to host an excursion to the local Marabar Caves.\nThe outing goes reasonably well until the women begin exploring the caves with Aziz and his sizeable entourage. Mrs Moore experiences an overwhelming sense of claustrophobia due to the volume of the echo inside the caves; this forces her to return to the open air. She encourages Adela and Aziz to continue their exploration but suggests they take just one guide. The three set off for caves far from the rest of the group, and before entering, Aziz steps away to smoke a cigarette. He returns to find Adela has disappeared; shortly after he sees her running headlong down the hill, bloody and dishevelled. She is picked up by the doctor's wife, Mrs. Callendar (Ann Firbank), and taken to the Callendars' home. Adela is bruised, delirious, exhausted, and incoherent. Dr. Callendar is seen approaching Adela with a hypodermic syringe. Not shown in the film but revealed later, Adela apparently signed a statement that was interpreted as accusing Aziz of attempting to rape her. Upon his return to Chandrapore, Aziz is jailed to await trial, and an uproar ensues between the local Indians and the British colonists.\nThe case becomes a cause célèbre among the British. When Mrs Moore makes it clear that she firmly believes in Aziz's innocence and will not testify against him, it is decided she should return to England. She subsequently suffers a fatal heart attack during the voyage and is buried at sea.\nTo the consternation of her fiancé and friends, Adela has a change of heart and clears Aziz in court, suddenly remembering events and retracting her accusation. The Colonials are forced into an ignominious retreat while the Indians carry the exonerated man from the courtroom on their shoulders, cheering wildly just as the monsoons begin. Fielding looks after Adela since she has no one else to turn to. In the aftermath, Adela leaves India, while Dr Aziz, feeling betrayed by his friend Fielding, abandons his Western attire, dons traditional dress, and withdraws from expatriate society, opening a clinic in the lake area near Srinagar, Kashmir. Meanwhile, through Adela, Fielding has married Stella Moore, Mrs Moore's daughter from her second marriage. Aziz eventually reconciles with Fielding, and Aziz writes to Adela asking her to forgive him for taking so long to come to appreciate the courage she exercised when she withdrew her accusation in court."}