{"mid": "APatchOfBlue", "IMDB_id": "tt0059573", "title": "A Patch of Blue", "plot": "Selina D'Arcey (Elizabeth Hartman) is a blind girl living in a city apartment with her prostitute mother Rose-Ann (Shelley Winters) and grandfather Ole Pa (Wallace Ford). She strings beads to supplement her family's small income and spends most of her time doing chores. Her mother is abusive and Ole Pa is an alcoholic. Selina has no friends, rarely leaves the apartment, and has never received an education.\nSelina convinces her grandfather to take her to the park, where she happens to meet Gordon Ralfe (Sidney Poitier), an educated and soft-spoken black man working night shifts in an office. The two quickly become friends, meeting at the park almost every day. Gordon learns that she was blinded at the age of five when Rose-Ann threw chemicals on her while attempting to hit her husband, and also that she was raped by one of Rose-Ann's \"boyfriends\".\nRose-Ann's friend, Sadie, is also a prostitute, and while lamenting the loss of her youth, she realizes that Selina can be useful in their business. Subsequently, Rose-Ann and Sadie decide to move into a better apartment, leave Ole Pa and force Selina into prostitution.\nIn the meantime, Gordon has contacted a school for the blind, which is ready to take Selina. While Rose-Ann is out, Selina runs away to the park and, with some difficulty, meets Gordon. She tells Gordon about Rose-Ann's plan, and he assures her that she will be leaving for school in a few days. Finding Selina missing from the apartment, Rose-Ann takes Ole Pa to the park and confronts Gordon. Despite Rose-Ann's resistance, Gordon manages to take Selina away, and Ole Pa stops Rose-Ann, telling her that Selina is not a child anymore.\nAt Gordon's house, Selina asks Gordon to marry her, to which Gordon replies that there are many types of love, and she will later realize that their relationship will not work. Selina tells him that she loves him, and knows that he is black, and that it does not matter to her. He then tells her they will wait one year to find out if their love will lead to marriage. Meanwhile, a bus arrives to pick up Selina and both said goodbye. Gordon wanted to give a music box that his grandmother gave him to Selina but the bus already left so he went back to his apartment."}