{"mid": "APerfectMurder", "IMDB_id": "tt0120787", "title": "A Perfect Murder", "plot": "Steven Taylor (Michael Douglas) is a Wall Street hedge fund manager whose investments and speculations allow him to live an extravagant, upper class lifestyle with his much younger wife Emily (Gwyneth Paltrow). Unfortunately, his risky investments are unraveling; to alleviate the financial pressure and to maintain his status, Steven will need his wife's personal fortune, roughly $100 million. However, Emily is having an affair with a painter, David Shaw (Viggo Mortensen), and is considering leaving her husband.\nSteven knows about the affair; he has also uncovered David’s dirty past as an ex-convict having a long history of conning rich women out of their money. Steven meets with David to reveal his knowledge of David's true identity and then makes him an offer of $500,000 in cash to murder his wife. At first David wants nothing to do with the plan, claiming instead that Emily and he are in love. Steven then reminds David that he already has two strikes against him and that the third arrest would be enough to send him to prison for 15 years without parole.\nSteven has already laid out a detailed plan to supply him with a firm alibi. He will hide Emily's latch key outside the service entrance to his apartment. Steven will then go out for his regular card game, during which time his wife usually stays in and takes a bath. David has to sneak in and kill her, making it look like a robbery.\nThe following evening, when Emily arrives home, Steven removes the key from her keychain, hides it as planned, and then leaves. That night Steven takes a break from his card game and uses his cellphone to make a call to an automated bank number, while using a second phone to call his house. Emily leaves her bath to answer the phone but is attacked in the kitchen by a masked assailant; during their struggle she manages to kill the attacker by stabbing him in the neck with a meat thermometer.\nLater Steven returns—to find his wife alive and the hired killer dead. He quickly takes the key from the killer's pocket and puts it back on Emily's keychain. Police arrive, led by Detective Karaman (David Suchet). They remove the assailant's mask and Steven sees that it is not David but a stranger, someone he later learns that David hired to do the job. Steven takes Emily to her mother's house, from where she attempts to call David to let him know that she is all right. David, under the impression that she is dead, does not answer in time. Later, Steven and David meet on a ferry boat and decide to wait until Steven has another plan. Meanwhile, Emily learns of Steven's serious financial troubles and tells the detective about this, acknowledging that Steven might have a motive to kill her.\nDavid has already made a tape of Steven detailing the whole plan and demands the money promised earlier for her murder. Emily meanwhile has noticed that the key on her keychain does not belong to their home; suspecting something she goes to the apartment of the dead assailant to discover that her key, in fact, unlocks his door. Emily confronts her husband with this and the knowledge of his financial problems. To her amazement, he exposes David's sordid past and accuses him of being a blackmailer conning her and threatening him. When he saw the attacker's dead body in their kitchen, he assumed it was David and took the key from his pocket so as not to implicate Emily in any way.\nSteven goes to David's loft to pay him but finds a note directing him to meet in a public place. The phone rings, and Steven picks up thinking it's David, but it's a ticketing agent confirming David's train out of the city. Steven meets David in a park and hands over the money; David gives him a copy of the tape and then leaves to board a train to Montreal. Once on the train and assuming he is safe, he opens the bathroom door in his cabin; Steven lunges out and stabs him. A dying David claims to have the last laugh because he sent another copy of the tape to Emily. Steven rushes home to try to get the tape before she can. At the apartment, he finds the mail still unopened while Emily is on the terrace. He hides the money and tape in his safe before Emily enters the room.\nThinking his problems are over, Steven takes a shower, but Emily sees the empty bag that contained the money. She manages to open the safe, finds the tape, and listens to it. Steven returns, and she reminds him that she still has not found her key. Emily pretends to leave to pick up food for dinner. Steven goes to the service entrance where he originally left the key for David. He finds it, and realizes that the killer had put the key back after using it to unlock the door. Emily confronts him, revealing that she knows everything now. Steven attacks her, but she has a gun and kills him, while the police qualifies her actions as self-defense and close the case. But in the closing scene Emily has a bruise on her face whereas she did not receive one in her struggle with Steven - suggesting she bruised herself to strengthen her alibi."}