{"mid": "APestInTheHouse", "IMDB_id": "tt0039700", "title": "A Pest in the House", "plot": "The cartoon starts with a brief narration describing a labor shortage that \"became so bad\" that compels employers to hire \"anybody or anything\". Daffy is a hotel bellboy and Elmer Fudd is the manager. Elmer tells Daffy to take a customer to room 666. The customer (voiced by Arthur Q. Bryan, in his natural voice) asks for peace and quiet, and suddenly threatens to punch Elmer right in the nose if he's disturbed at any time.\nDaffy, in a Jerry Colonna-like sarcastic aside to the audience, remarks: \"Likable chap, isn't he?\" Daffy does many stunts that keep the man awake, complete with escorting him to room 666. Every time he is awakened again, the increasingly irritated man trudges to the lobby, to the tune of \"Pop Goes the Weasel\", and at the second where the song says \"pop\", he punches Elmer in the face.\nAfter several shenanigans, Daffy finally concludes it is too cold in the man's room and decides to fix the radiator. Elmer, knowing he'll get beat up again, chases after Daffy. Daffy makes the heat vibrate to the room. Elmer hears whistling and covers it with several pillows. Daffy, thinking that Elmer is blowing whistles, proceeds to rant loudly to him: \"So, a fine kettle of fish! Here I work myself down to the skin and bones trying to keep this guy to sleep, and what do you do? Blow whistles! Just when I got things so quiet you could hear a pin drop, you bust in here and bust out with a whistle, and you snafu the whole works! How in the name of all that's reasonable do you expect a guy to get his slumber when a goof like you goes around making noises like a one-man Fourth of July celebration? He needs peace and quiet! It's positively outrageous!\". His screaming obviously wakes the now infuriated man, so Elmer hurries downstairs and he and Daffy switch places through a promotion in an effort to fool the man: \"For vewy mewitowious soyvice, you are herewith pwomoted to the position of manager. Take ovew.\" However, Elmer gets punched one last time, and Daffy concludes the cartoon with another Jerry Colonna-like aside: \"Noisy little character, isn't he?\"."}