{"mid": "APlaceInTheSun", "IMDB_id": "tt0043924", "title": "A Place in the Sun", "plot": "George Eastman (Montgomery Clift), is the poor nephew of rich industrialist Charles Eastman (Herbert Heyes), who takes a job in his uncle's factory. Despite George's family relationship to the owner, the rich Eastman family treats him as an outsider and gives him the humblest job available in the factory and no entree into their exclusive social circle. George, uncomplaining, hopes to impress his uncle, whom he addresses as \"Mr. Eastman\", with his hard work and earn his way up. While working in the factory, George starts dating fellow factory worker Alice \"Al\" Tripp (Shelley Winters), in defiance of the workplace rules. Alice is a poor and inexperienced girl who is dazzled by George and slow to believe that his Eastman name brings him no advantages.After a stepping out with Alice, George meets the attractive \"society girl\" Angela Vickers (Elizabeth Taylor) and they quickly fall in love. Being Angela's escort at local parties and dances thrusts George into the intoxicating and carefree lifestyle of high society of the idle rich that his wealthy Eastman kin had denied him.When Alice announces that she is pregnant and makes it clear that she expects George to marry her, he temporizes, spending more and more of his time with Angela and his new well-heeled rich friends. An attempt to procure an abortion for Alice fails, and she renews her insistence on marriage. George is invited to join Angela at the Vickers's holiday lake house and excuses himself to Alice, saying that the visit will advance his career and accrue to the benefit of the coming child.George and Angela spend time at secluded Loon Lake, and after hearing a story of a couple's supposed drowning there, with the man's body never being found, George hatches a plan to rid himself of Alice so that he can marry Angela.Meanwhile, Alice finds a picture in the newspaper of George, Angela, and their friends, and realizing that George lied to her about being forced to go to the lake, she meets George in the nearby town and threatens to expose everything to his society friends if he doesn't marry her. They quickly drive to City Hall to elope but they find it closed for Labor Day, and George suggests spending the day at the nearby lake; Al unsuspectingly agrees.When they get to the lake, George acts visibly nervous when he rents a boat from a man who seems to deduce that George gave him a false name; the man's suspicions are aroused more when George asks him whether any other boaters are on the lake (none are). While they are out on the lake, Alice confesses her dreams about their happy future together with their child. As George apparently takes pity on her and, judging from his attitude, decides not to carry out his murderous plan, Alice tries to stand up in the boat, causing it to capsize, and Alice drowns.George escapes, swims to shore, and eventually drives back up to the Vickers' lodge, where he tries to relax but is increasingly tense. He says nothing to anyone about having been on the lake or about what happened there.Meanwhile, Alice's body is discovered and her death is treated as a murder investigation almost from the first moment, while an abundant amount of circumstantial evidence and witness reports stack up against George. Just as Angela's father approves Angela's marriage to him, George is arrested and charged with Alice's murder.Though the viewers know that the planned murder in fact turned into an accidental drowning, George's furtive actions before and after Alice's death condemn him.During his trial, George takes the witness stand where he gives a heartful testimony about his relationship with Alice and about his thoughts about killing her to have a life with Angela, and gives the details about the boating accident. But his testimony is pulled apart in cross-exmination by the hot-tempered and agressive prosecutor (Raymond Burr) who tries to imply that George planned and commited first degree murder because of his nervous behavior and of his filing a false name with the boat owner, and of other inconsistances involving both Alice and Angela.George's denials are futile, and he is found guilty of murder by the jury and is immediatley sentenced to death in the electric chair. A few weeks later, on his last day on Death Row, George writes a goodbye letter to Angela explaining that although he didn't kill Alice, his feelings of abandonment and loss of his privledge life made him leave Alice to drown in an attempt to cut off his past lifestyle to be with Angela. George is taken out of his cell to the death chamber to be executed."}