{"mid": "ARiverRunsThroughIt", "IMDB_id": "tt0105265", "title": "A River Runs Through It", "plot": "The film follows the true story of the Maclean brothers, Norman and Paul, growing up in Missoula, Montana with their father, Presbyterian minister John. A common theme in the film is the men's love of fly fishing for trout in the Blackfoot River and how it impacted their lives. The film is told from Norman's point of view, with director Robert Redford as narrator.\nThe story begins with the brothers learning to fish from their father, a preacher who treats fishing as a sacred act. The boys become accomplished fishermen as a result. Norman and Paul are home taught and must adhere to the strict moral and educational code of their father. However, whenever they get a chance they enjoy practicing the art of fly fishing. As they grow older, it becomes clear that Norman is the more disciplined and studious brother, while Paul is the fun loving, wild one and the more talented fly fisherman.\nNorman attends a July 4th dance with his friends after returning home from six years away at Dartmouth, where he meets his future wife, Jessie Burns. Paul has become a reporter at a newspaper in Helena, the state capital. He has angered many of the locals by falling behind in a big poker game at Lolo, a hamlet near Missoula with a popular bar that is also a front for gambling and prostitution, and by dating a beautiful Blackfoot Indian woman, Mabel, who is deemed to be of an inferior race by the community. Paul gets arrested after fighting a man who insulted her, and Norman is awakened in the middle of the night by a phone call from the police to come bail Paul out of jail.\nAfter Norman and Jessie go on several dates, she insists that Norman make an effort to get along with her brother Neal, who is back in Montana, visiting from California. Norman and Paul do not like the self-centered Neal, who tells tall tales of socializing with film stars in Hollywood, but at Jessie's insistence they invite him to go fishing. Neal shows up drunk with a woman (a part-time prostitute) he met at a bar the evening before. Norman and Paul decide to fish anyway and return to their car hours later to find Neal and his ladyfriend \"Rawhide\" have drunk all their beer and passed out naked in the sun.\nNorman returns a painfully sunburned Neal home, where Jessie is waiting for them. She is angry that the brothers did not fish with Neal. When Norman asks Jessie to drive him home, he tells her that he is falling for her. She drives away angry but a week later asks Norman to come to the train station to see Neal off back to California. After the train departs, Norman shows Jessie a letter from the University of Chicago that is a job offer for an English Literature teaching position. Norman asks Jessie to marry him.\nWhen Norman tells Paul about the job offer and marriage proposal, he also urges Paul to come with him and Jessie to Chicago. Paul tells Norman that he will never leave Montana. Just before leaving for Chicago, Norman, Paul and their father go fly fishing one last time as a family. Paul catches a huge fish that carries him down the river. John proudly tells his son Paul what a wonderful fisherman he has become, much to Paul's delight. They pose for pictures with the huge fish for their mother.\nSoon after the fishing excursion, Norman is again contacted by the police. They tell him that Paul has been found beaten to death in an alley, and that all the bones in his right hand have also been broken. Norman goes home and tells his parents the sad news. The story then jumps ahead a few years to a sermon being given by John with Mrs. Maclean, Norman, Jessie and their two children in attendance. The narrator mentions that John dies soon after this sermon. The last scene is of Norman as an old man, back in the Montana river where he used to fish with his family many years ago. He mentions that nearly everyone from his youth is dead, and that he is haunted by waters."}