{"mid": "ArlingtonRoad", "IMDB_id": "tt0137363", "title": "Arlington Road", "plot": "Michael Faraday (Jeff Bridges) is a widower and college history professor at George Washington University with a son, Grant (Spencer Treat Clark). While driving he encounters a boy, Brady (Mason Gamble), staggering in the road with horrific injuries to his hands. Michael takes him to hospital, and meets his parents Oliver (Tim Robbins) and Cheryl Lang (Joan Cusack), discovering they are his neighbors. The families soon become friends, and their sons join the Discoverers, a Scouts-style group.\nActions of the Langs arouse latent suspicion in Michael. Michael sees blueprints in the Lang's house which are not for the building project Oliver, a structral engineer, claims, and a wrongly delivered letter suggests he lied about where he attended college. Over dinner, Michael describes impersonal treatment from the government after his wife, an FBI agent, was killed in the line of duty. Oliver states his belief that the government should be punished for its mistakes. Michael's girlfriend, Brooke (Hope Davis), and his wife's former FBI partner, Whit Carver (Robert Gossett), dismiss Michael's concerns as paranoia.\nOn a field trip to the site of the standoff in which his wife was killed, Michael describes to his college class what he sees as a needless tragedy: that although certain activities of the besieged family raised \"flags,\" other facts, not investigated before the FBI visit, both exonerated them and explained their wariness of the FBI agents, which provoked the standoff. Michael's students appear uneasy at the intensity with which Michael condemns the FBI's actions.\nConversing with Michael, Oliver says that Grant wishes someone could be punished for his mother's death, at which Michael is again suspicious. Researching archives, Michael discovers that Oliver's real name is William Fenimore, and that he tried to blow up a post office in Kansas at age 16. He is seen by Oliver, who later confronts him, incensed at Michael's intrusions and presumptions of judgment. He states that he was retaliating against the government for seizing his family farm's water supply, which rendered it unusable and eventually led to his father's suicide. He states he was imprisoned, and admits to assuming the identity of his deceased friend Oliver Lang to hide his criminality from his children.\nMichael appears to let the matter drop. However, Brooke later sees Oliver swap cars with a stranger in a parking lot, and follows him to a delivery depot where a number of metal boxes are exchanged. From a payphone, she leaves Michael a message that his suspicions may have been correct, but is discovered by Cheryl.\nMichael learns of Brooke's (off-screen) death on the news, where it appears she died in a car crash. He discovers inadvertently that messages left on his answering machine had been erased, and again suspects foul play, telling Whit about Oliver/William and asking him to check FBI records, and records of calls to his home.\nMichael visits the father of Dean Scobee, accused of blowing up a federal building in St. Louis, from where the Langs had moved. Dr. Scobee is certain his son was not the perpetrator of the bombing since 10 children were killed, which he would never have done knowingly. Michael becomes certain that Dean was set up when he sees a photo of him in a Discoverer troop with Brady, with whom Grant is currently on a field trip. In a panic Michael rushes back to Washington to retrieve Grant, but is told by troop leaders that he was taken home with Brady. Returning home, Michael does not find Grant and confronts Oliver at his home. Oliver confirms that his group killed Brooke, and implies that Grant will be killed if Michael tries to involve others.\nWhit accosts Michael the following day, stating the FBI discovered nothing suspicious about Oliver/William or his acquaintances, and says that Michael's 'missing' telephone message was from a payphone. The next day, Michael rents a car under a false name and drives to the payphone where he seeing a passing delivery vehicle, follows it to its depot, where he sees men he recognizes from Oliver's house and from Discoverer photographs, loading metal boxes into the van.\nMichael follows the van and is shocked to see Grant at the window, and gives chase. Oliver blocks Michael's car with his own, causing a crash, and drags him to an abandoned building where he beats him, saying Michael will not see Grant again. Oliver believes his group is waging war against the government, and states their target is the FBI. Michael overpowers Oliver and drives to FBI headquarters, calling Whit at his office to warn him.\nMichael sees a delivery van at the gate and illegally pursues it into the secure parking garage, but discovers that the van has a different driver and is empty. Whit tells Michael that he is the only unauthorised person in the building, in panic Michael rushes back to his own car discovering at the last moment that the conspirators have planted the bomb in his own trunk seconds before it detonates. Hundreds of government agents, and civilians, including Whit are killed in the massive blast which partially collapses the FBI headquarters. Oliver impassively watches the bombing from a distance.\nIn a montage of television news clips, Michael is portrayed as a lonewolf terrorist who had sought revenge for his wife's death and targeted the FBI, in particular her former partner, Whit. Statements from his students, one of whom is a conspirator, support the official story, giving accounts of his erratic and paranoid behavior in the days prior and inferring from them that he held a dangerous grudge against the FBI. Grant, now orphaned, moves in with relatives, tragically unaware of his father's innocence.\nIn the final scene, the Langs imply that they will move again to another city to plan their next terrorist strike as well as look for another fall guy to take the blame for their group's actions as they did with Michael Faraday and several others before him."}