{"mid": "AShotInTheDark", "IMDB_id": "tt0058586", "title": "A Shot in the Dark", "plot": "Inspector Clouseau (Peter Sellers) is called to the country home of millionaire Benjamin Ballon (George Sanders) to investigate the murder of his chauffeur, Miguel Ostos. The chauffeur was having an affair with one of the maids, Maria Gambrelli (Elke Sommer), and attacked her in her bedroom after she broke off with him. Miguel was shot and killed in her bedroom and Maria was found with the smoking gun in her hand, but claims no knowledge of how it got there as she maintains she was knocked unconscious. All evidence points to Maria as the killer, but Clouseau is convinced of her innocence because he has developed an immediate attraction to her. Realizing Clouseau has been inadvertently assigned to a high profile case, Commissioner Dreyfus (Herbert Lom) has him removed and personally takes charge of the investigation.Dejected, Clouseau returns home. He is awakened in the early hours of the morning by an apparent attempt on his life by a Chinese assassin. When the phone rings, the life or death struggle ceases and it becomes apparent that his assailant is his valet, Kato (Burt Kwouk), to whom Clouseau has given instructions to attack him when he least expects it to keep his senses sharp. The Inspector is reinstated to the Ballon case and immediately orders Maria Gambrelli's release from prison, as he is convinced she is shielding the real killer, who Clouseau suspects is Ballon himself.A series of additional murders of the Ballon staff follows. Each time the evidence points to Maria, who is continually arrested, only to have Clouseau release her again despite the growing number of murder charges laid at her feet. One of which involves, both Clouseau and Maria being arrested after fleeing from a nudist colony... without their clothes.Clouseau's actions embarrass the Sûreté in the press, but Commissioner Dreyfus is unable to remove him from the case because Ballon has exerted political influence to keep the unorthodox and seemingly incompetent detective assigned to the investigation. As Clouseau continues to bungle the case, Commissioner Dreyfus becomes increasingly unhinged and suffers a nervous breakdown that reduces him to a delusional psychotic. He stalks Clouseau in order to assassinate him, but accidentally kills a series of innocent bystanders instead and adds further notoriety to the case.When Clouseau confronts the Ballon household to unmask the murderer, it is revealed that Ballon, his wife (Tracy Reed), and three members of the staff are all guilty, as each of them has killed at least one earlier victim due to crimes of passion or subsequent blackmail attempts. Only Maria is innocent of any crime. As a massive row breaks out between employers and staff, the lights are cut (an arrangement Clouseau had made with his assistant), and the guilty take the opportunity to pile into Clouseau's car and escape. They are all killed when the car is destroyed by a bomb that had been planted by Commissioner Dreyfus. Having witnessed the explosion, and realizing that he has failed again to kill Clouseau, Dreyfus is reduced to an animalistic fury and is taken away. Clouseau and Maria celebrate the clearing of her name with a long and passionate kisswhich is swiftly interrupted by another sneak attack by Kato."}