{"mid": "ASimpleWish", "IMDB_id": "tt0120133", "title": "A Simple Wish", "plot": "Oliver Greening is rejected from a coveted performance in a musical version of A Tale of Two Cities for simply not being a bankable performer. After Oliver's 8-year-old daughter Annabel attempts to get her 12-year-old brother Charlie to believe that the tooth fairy exists, Murray, a clumsy fairy godmother, appears after Charlie has gone to sleep. Annabel wants to wish for her father to get the role, but Murray suddenly remembers he is late for an important engagement and promises to return to grant her wish later.\nHortence (Ruby Dee), the head of all fairy godmothers, is holding the annual meeting of the North American Fairy Godmothers Association (NAFGA). Due to Hortence's rule, all the fairy godmothers must check in their wands before the meeting. Claudia, a former fairy godmother turned evil witch, has shown up at the meeting uninvited and intends to steal all the wands. She gives Hortence's receptionist, Rena (Teri Garr) a witch's apple that puts her to sleep, casts a spell on Hortence turning the head fairy paper-thin and binding her mouth with bricks, and locks all the fairy godmothers downstairs on her way to stealing the wands. Murray, however, arrives at the meeting late and never checks his wand, leaving it as the only wand Claudia doesn't have.\nAnnabel realizes that Murray has left his magic wand behind and decides to return it to him, but Charlie breaks it. The two disappear to Nebraska, by way of a misconstrued spell cast by him to get out quickly. After he tries and fails to turn a selfish motel owner they meet there into a giant rabbi. The two end up back in Central Park. Because of them disappearing in an unexplained way, the school closes early. Charlie finds them. Annabel begs Murray to try to grant her wish now that they are close to her father, but due to yet another mishap by him, Oliver is turned into a statue. To fix the problem, the three of them go to NAFGA and ask for the help of Hortence, who is still under the effects of Claudia's spell. While Murray, Charlie and Rena who has awoken from Claudia's sleeping spell fix Murray's wand, Hortence tells Annabel of Claudia's plot and explains that the awry spell must be lifted before midnight, or Oliver will be doomed to remain a statue forever. Claudia, meanwhile, has been looking through the wands, searching for hers. After going through, she realizes it is missing and now belonging to Murray, and is determined to obtain it.\nAnnabel and Murray head to the theater and see Tony Sable, the selfish and conceited actor who is auditioning for Oliver's part. Knowing this could ruin her father's chance of being in the show, she asks Murray to sabotage the audition any way he can. First he tries to make it rain on the stage but it is dismissed as a simple technical problem and the audition continues. Then she asks him to give Sable a frog in his throat to impair his singing. He takes this wish too literally, and frogs start hopping out of Sable's mouth, shocking the cast and crew. Annabel and Murray celebrate but Sable gets the part since Oliver has not shown up. Boots, who has been looking for Murray, finds them. Murray mentions the story of Brer Rabbit to Annabel and they beg her not to take them to Claudia's lair so she will.\nClaudia catches them, and demands them to tell her where her wand is. When Murray tries to persuade Annabel otherwise into not telling her, as punishment, Claudia changes her and Murray into ballerinas and makes them dance uncontrollably until Annabel agrees to tell her. Murray, Charlie, and Annabel return to Central Park and restore Oliver just in time. He is given the part of Sable's understudy thanks to a producer who enjoyed his audition. In order to finally grant Annabel's wish, Murray appears backstage and causes Sable to slip on a bucket, and twist his ankle. The resultant temper tantrum gets him fired and Oliver, his understudy, is cast in his place. Charlie and Annabel watch the show with Murray and the other fairy godmothers including Hortence who is now free from Claudia's spell."}