{"mid": "Assassins", "IMDB_id": "tt0112401", "title": "Assassins", "plot": "Robert Rath (Sylvester Stallone) is a paid assassin who wants nothing more than to get out of 'the business', haunted by the memory of murdering his own mentor Nicolai years ago. Rath is a quiet, morose professional who is on an assignment to kill someone when someone else gets to the 'mark' (the target) before he does. That person turns out to be Miguel Bain (Antonio Banderas), a fellow assassin and a competitive sociopath.\nAs Rath tries to figure out who sent Bain, the contractor offers him one last job that could financially allow him to retire: killing a computer hacker named Electra (Julianne Moore) and the four Dutch buyers of a disk that contains sensitive information and Rath has to retrieve. However, Electra has set up cameras in all the rooms of the apartment block where she lives and watches them like watching television.\nBain first kills the four Dutch buyers who turn out to be Interpol agents, but when Rath comes to kill Electra, for the first time he has a change of heart. His pay for the job is given to him in a briefcase in exchange for the disk. But the briefcase actually contains a bomb placed by his own contractor in an attempt to kill him. Luckily, Electra had swapped the disk, not sure if Rath was coming back or not.\nThe contractor takes the chance and hires Bain to terminate him; now having become a target along with Electra he must try and extract enough money out of his contractor so he can disappear for good, while avoiding the bloodthirsty Bain. Rath's contractor turns out to be none other than Nicolai himself who also hired Bain to track down Electra and the disk.\nNicolai revealed he had a vest on when Rath shot him years ago and faked his death ever since. Knowing that Nicolai would kill him too, Bain, along with Rath, shot him dead. Bain plans to kill Rath to be the number one assassin. But Electra puts on her sunglasses to allow Rath to see Bain. Rath shot Bain through his jacket killing him."}