{"mid": "AtlanticCity", "IMDB_id": "tt0036619", "title": "Atlantic City", "plot": "Sally (Susan Sarandon) is a young waitress in an Atlantic City casino who has dreams of becoming a blackjack dealer in Monte Carlo. Sally's estranged husband Dave (Robert Joy) returns to her one day with the intention of selling a large amount of cocaine that he had stolen in Philadelphia and meets Lou (Burt Lancaster), an aging former gangster who lives in Sally's apartment building and runs numbers in poor areas of the city; he also acts as a caretaker for Grace (Kate Reid), an elderly invalid. Dave convinces Lou to sell the cocaine for him, but as Lou sells the first batch, Dave is attacked and killed by the mobsters from whom he had stolen the drugs.\nLou is left with the remaining cocaine and continues to sell to impress Sally, whom he has long pined for, with money. Sally and Lou make love one day, but she returns to her apartment to find it trashed; she has been tracked down by Dave's killers, who beat her to find out if she has the drugs. They leave, but Lou laments not being able to protect her. Sally is fired from the casino when her late husband's criminal record is discovered. Lou sells the remainder of the cocaine, while both Sally and the mobsters discover Lou's affiliation with Dave. The mobsters corner them one night, but are killed when Lou produces a gun and shoots them. He and Sally then steal their car and leave the city. That night, from a hotel outside Atlantic City, they watch the TV news reporting on the killing. A police sketch of the suspect is shown. It looks nothing like Lou. Lou is overjoyed with relief and pride. He confesses to Sally that this was the first time he had ever killed anyone.\nAt a motel during the night, Lou takes the phone to the bathroom to call Grace and brag about the killings. Sally also wakes and steals the money with the intention of sneaking off; Lou witnesses this, allowing her to leave and giving her the car keys so she can escape to France, rather than go to Miami with Lou. Lou returns to Atlantic City to be with Grace and continue selling a portion of the cocaine that he had stashed away."}