{"mid": "AttackTheBlock", "IMDB_id": "tt1478964", "title": "Attack the Block", "plot": "Walking home on Bonfire Night through a housing estate in South London, Samantha Adams (Jodie Whittaker), a 25-year-old trainee nurse, is mugged by a small gang of teenage hoodlums: Pest (Alex Esmail), Dennis (Franz Drameh), Jerome (Leeon Jones), Biggz (Simon Howard), and leader Moses (John Boyega). The attack is interrupted when a meteorite falls from the sky into a nearby car, giving Samantha the chance to escape. As Moses searches the wreck of the car for valuables, his face is scratched by a pale, hairless, eyeless dog-sized creature; the object which fell from the sky was its cocoon. The creature runs away, but the gang chase and kill it. Hoping to gain fame and fortune, they take the corpse to their acquaintance, cannabis dealer Ron (Nick Frost), to get advice on what to do. He lives at the top of their tower block, Wyndham Tower.\nMoses asks Ron and his boss, Hi-Hatz (Jumayn Hunter), to keep the creature in their fortified \"weed room\" while he decides how to proceed. More objects fall from the sky. Eager to fight the creatures, the gang arm themselves and go to the nearest crash site. However, they find these aliens are much larger, gorilla-sized, with spiky fur which is so black it reflects no light, huge claws and rows of glowing fangs. Fleeing the aliens, the gang are intercepted by two policemen and Moses is arrested, identified as a mugger by Samantha. The aliens, following Moses, maul the police to death and attack their van, leaving Samantha and Moses trapped inside. Dennis reaches the vehicle and drives the van away, only to crash into Hi-Hatz's car. Samantha runs away while the rest of Moses's gang catch up and confront Hi-Hatz.\nEnraged by the damage to his car, Hi-Hatz threatens them with a gun, refusing to believe their story of aliens, until his henchman is attacked by one, allowing the gang to escape. The gang try to flee to Wyndham Tower but are again followed and attacked en route by the aliens, where Biggz is forced to hide in a recycling bin and Pest is severely bitten in the leg. They find that Samantha lives in their building, force their way into her flat, and persuade her to treat Pest's leg. An alien bursts in and Moses kills it with a samurai sword through the head. Understanding that the group was not lying about the creatures being extraterrestrial, Samantha reasons that it is safer to stay with the gang than on her own and joins them. The gang moves upstairs to the flat owned by Tia (Danielle Vitalis), Dimples (Paige Meade), Dionna (Gina Antwi) and Gloria (Natasha Jonas) believing that their security gate will keep them safe. The aliens instead attack from outside, climbing up the side of the tower block and smashing through the windows, one of whom decapitates Dennis.\nAfter Samantha saves Moses' life from one of the aliens, the girls believe them to be the focus of the creatures and kick the gang out of the flat. In the hall, the gang is attacked by Hi-Hatz and more henchmen. The gang escapes while an alien chases Hi-Hatz and his henchmen into a lift. Hi-Hatz kills the alien, though his henchmen perish, and continues his search for Moses. Making their way upstairs to Ron's weed room, the gang runs into more aliens, but using fireworks as a distraction, they manage to get through. Jerome, however, becomes disoriented in the smoke and is killed by an alien. Entering Ron's flat they find that Hi-Hatz is already there. Hi-Hatz prepares to shoot Moses but hordes of aliens smash through the window and tear off his face. Now joined by Brewis (Luke Treadaway), one of Ron's customers, Moses, Pest and Samantha retreat into the weed room, while Ron hides in the flat.\nBiggz, still trapped in the bin by a lurking alien, is saved by two unruly children, Probs (Sammy Williams) and Mayhem (Michael Ajao), using a water-gun filled with petrol and a flame to torch the creature from a safe distance. In the weed room, Brewis notices a luminescent stain on Moses' jacket under the ultraviolet light. As a zoology student, Brewis theorises that the aliens are like spores, drifting through space on solar winds until they chance on a suitable planet. After landing in an area with enough food, the female lets off a strong pheromone which will attract the male creatures to it so that they can mate and propagate their species in their new world. Brewis suggests that the smaller, hairless alien which Moses killed in the beginning was such a female and it had left a mating scent on Moses that the larger male aliens have been tracking throughout the evening. The gang form a plan for Samantha, who has not been stained with the pheromone, to go to Moses's flat and turn on the gas oven.\nMoses forces Pest to return the ring they stole from her, feeling guilty for having mugged her. Samantha successfully avoids the aliens, turns on the gas and leaves the Block. Moses, with the dead female alien strapped to his back, rushes out of the weed room and into his flat, while the males converge on the scent and chase Moses through the block. Inside his flat he throws the female into the kitchen and the males follow. Using fireworks, Moses ignites the gas-filled room and leaps out of the window. The explosion engulfs the flat and the aliens, but Moses survives, clinging to a Union Flag hanging from the side of the building. In the aftermath, Moses, Pest, Brewis and Ron are arrested, considered responsible for the deaths around the Block including the two policemen who had earlier arrested Moses. Samantha, however, comes to their defence. In the back of the police van, Moses and Pest hear the residents of the Block cheering for Moses."}