{"mid": "AugustOsageCounty", "IMDB_id": "tt1322269", "title": "August: Osage County", "plot": "The action takes place over the course of several weeks in August inside the three-story home of Beverly and Violet Weston outside Pawhuska, Oklahoma.\nPrologue\nThe play opens with Beverly Weston, a once-famous poet, interviewing Johnna, a young Cheyenne woman, for a position as live-in cook and caregiver for his wife Violet, who is being treated for mouth cancer due to heavy cigarette use for most of her life. Violet is addicted to several different kinds of prescription drugs and exhibits paranoia and mood swings. Beverly, who freely admits that he is an alcoholic, lightly converses about Violet's current problems, most of which Beverly concedes are the result of personal demons too powerful to be cured by drugs. Violet enters the scene clearly affected by her drugs. After an incoherent and combative argument with Beverly, Violet returns upstairs. Beverly hires Johnna, lends her a book of TS Eliot's poetry, and continues to drink.\nAct One\nSeveral weeks later. Beverly Weston has not been seen for five days. Several family members have gathered in the house to provide support for Violet including her daughter Ivy, her sister Mattie Fae and Mattie Fae's husband Charlie. When Violet is not making calls attempting to track down her husband or popping pills, she spends the time sniping at her family, particularly Ivy, whom she criticizes for her mode of dress and lack of a romantic life. The news comes that Beverly's boat is missing, furthering the fear that he has committed suicide. Ivy's older sister Barbara arrives from Boulder, Colorado with her husband Bill and 14-year-old daughter Jean. Barbara has not visited her mother in several years, and has mixed feelings about returning to the house because of the confrontational nature of their relationship. They fall into an argument almost immediately, during which Violet accuses her of abandoning her family and breaking her father's heart.\nLater in the evening, Jean bonds with Johnna after the older woman allows her to smoke some marijuana in her room. She confides to Johnna that her parents are separated and are attempting to hide the fact from the family. Bill and Barbara argue over the cause of their separation as they make a bed out of the fold-out sofa in the living room: Bill is sleeping with a much-younger woman, one of his students at the university where he teaches. At five AM, the local sheriff, Deon Gilbeau (Barbara's high school boyfriend) rings the doorbell and breaks the news that Beverly has been found drowned. Barbara goes to identify the body as Violet comes downstairs in a drug-addled fog. The act ends with her spiraling into confusion.\nAct Two\nSeveral days later. The family has come from Beverly's funeral. Violet spends a quiet moment alone in Beverly's office, bitterly reproaching him for leaving her, and takes some more pills. Before the memorial dinner prepared for the family by Johnna, several family arguments and scenes arise. Ivy and Barbara's sister Karen has flown in from Florida with her new fiancé and can talk about nothing except her wedding plans, distressing Barbara. During an argument with her mother and Mattie Fae, Ivy unwittingly confesses that she is seeing someone romantically but refuses to say who. Mattie Fae and Charlie's son Little Charles has overslept and missed the funeral. His father is sympathetic but Mattie Fae is, as usual, rude to and critical of her son. Karen's fiancé Steve discovers that Jean is a pot-smoker and offers to share his stash with her, lewdly flirting with the teenaged girl. In a private moment, it is revealed that Ivy's lover is actually Little Charles, her first cousin.\nDinner is served, and Violet begins insulting and needling all of her family members. After inappropriately discussing Beverly's will at the table, she cruelly exposes Barbara and Bill's separation. When Barbara starts to fight back, Violet tauntingly reveals the full extent of her addiction, and the tensions develop into a violent confrontation, culminating in Barbara physically attacking her mother. After family members separate them, Barbara takes control of the situation, ordering that the family raid the house to discover all of Violet's hiding places for her pills.\nAct Three\nSeveral hours later things have calmed down, but the pain of the dinner confrontation has not gone away. Barbara reports that Violet's doctor thinks she has brain damage, and the three sisters share a drink in their father's study, discussing their mother. Ivy reveals that she and Little Charles are planning to run away to New York, and refuses to acknowledge the need for someone to take care of Violet. She reveals that it was Violet, not Beverly, who was heartbroken when Barbara left Oklahoma. Violet enters, now more coherent and off her drugs but no less incorrigible, is resigned to dealing with her demise on her own terms. She discusses a depressing story from her childhood with her daughters. In a private moment, Barbara and Violet apologize to each other, but it is uncertain how long the peace will last.\nMattie Fae observes a tender moment between Little Charles and Ivy, and begins taunting him again when the ever-patient Charlie finally loses his temper with his wife, berating her for her cruelty to her own son and promising her that unless she can find a way to be kind to Little Charles, he is going to leave her. The lecture is accidentally overheard by Barbara, who confirms when pressed that Little Charles and Ivy are lovers. She is shocked when Mattie Fae reveals that Little Charles is not just Ivy's first cousin but also her half-brother, the result of a long-ago affair between Mattie Fae and Beverly. Mattie Fae refuses to tell Ivy or Little Charles the truth, leaving it up to Barbara, who knows that the news will destroy Ivy, to find a way to end the incestuous affair.\nLate that night, Steve and Jean share a joint, and before long, Steve attempts to molest Jean. Johnna walks in on the scene and attacks Steve with a shovel; the noise brings Jean's parents and Karen to the scene. An ugly argument follows when Jean defensively lashes out at her parents with hurtful comments about her father's affair, and Barbara slaps her. Karen leaves with Steve, choosing to lie to herself and mistakenly blaming Jean for what happened. Bill elects to return to Boulder with Jean and admits, when Barbara confronts him, that he is not going to come back to her. He leaves as Barbara tells him she loves him.\nTwo weeks pass. Barbara, now drinking heavily, offers Johnna a chance to quit and leave the toxic environment of the Weston house, but she chooses to stay. Sheriff Gilbeau drops by the house with the news that Beverly had stayed at a motel shortly before he committed suicide. He and Barbara nearly share a tender moment, but she is too emotionally exhausted and drunk to consummate it.\nSeveral days later, Ivy has dinner with Barbara and Violet. Ivy attempts to tell her mother, over Barbara's objections, of her plans with Little Charles but Violet suddenly confesses that she already knows that Little Charles is Beverly's son. Ivy recoils in shock and horror, rebuffing Barbara's attempts to comfort her, and says that she will never tell him and leaves for New York anyway. Violet calmly reveals that she has deliberately destroyed Ivy and Charles' affair, which she knew of the entire time. Barbara and her mother have one last angry confrontation during which Violet blames Barbara for her father's suicide. Violet also reveals his suicide might have been preventable since she knew which motel he stayed in the night he left the house. Barbara, realizing that her Mother has slipped beyond her help, leaves the house. Violet breaks down and is left only with Johnna, who ends the play with a quotation from a T.S. Eliot poem: \"This is the way the world ends, this is the way the world ends.\""}