{"mid": "Austenland", "IMDB_id": "tt1985019", "title": "Austenland", "plot": "Jane Hayes (Russell) is a single 30-something American woman obsessed with Jane Austen, especially Colin Firth's portrayal of Mr. Darcy in the 1995 BBC version of Pride and Prejudice who wishes for a nice Englishman of her own. After yet another failed relationship, Jane decides to blow her entire savings on a once-in-a-lifetime trip to a Jane Austen–themed resort in England.\nThe resort seems like the perfect escape from 21st-century life. The guests at Austenland, which is run by the prickly Mrs. Wattlesbrook (Seymour), are assigned pseudonyms, dress in period costume, and conduct themselves like ladies of the Regency era. They live without modern conveniences (though the plumbing is modern). Activities offered at the resort include needlepoint, riding, reading, shooting, and entertaining the other guests through musical performances or theatrics. At the conclusion of each guest's stay, a ball is held ... romance guaranteed! The highlight of the resort is the score of attractive young gentlemen actors who attend to the female guests--though no touching is allowed.\nUpon her arrival, Jane realizes that, while she could only afford the cheapest \"copper\" package, the other guests—including Ms. \"Elizabeth Charming\" (Coolidge), an absurd and extremely wealthy American woman who has never read any of Jane Austen's books—have all purchased the most expensive \"platinum\" option. Although she quickly befriends Martin, the resort's chauffeur, Jane is treated with disrespect and disdain by Mrs. Wattlesbrook, who prefers the resort's wealthier guests despite their ridiculousness. While the other guests are given a wide choice of elaborate costumes and shown to luxurious rooms, Jane is given a plain dress and a sparsely-decorated chamber in the \"creepy tower\" of the servants' quarters.\nAt dinner on their first night, Jane and Elizabeth are introduced to the gentlemen of the house: Colonel Andrews (Callis), a silly and obsequious character who seems to love his job, and Mr. Henry Nobley (Feild), Mrs. Wattlesbrook's sternly handsome—albeit unenthusiastic—nephew. They are also introduced to another platinum level, long-term guest, who has been given the name Lady Amelia Hartwright (King). Amelia and Elizabeth flirt openly with Nobley throughout dinner, while Jane finds him rather disagreeable. Their argument mirrors the one had by Elizabeth Bennet and Mr. Darcy upon their first meeting in Pride and Prejudice. Ultimately, Jane is humiliated by Mrs. Wattlesbrook and leaves the table.\nThroughout her experience at Austenland, Jane becomes somewhat disenchanted with the Regency era. She is self-conscious of her costume and treatment, bored without technology, and her modern independence is often at odds with expected behavior. The silliness of the guests and actors also acts as a mirror to her own formerly-obsessive behavior.\nJane again feels left out the following morning during a walk around the grounds. After leaving the group to seek solace with a book in the stables, she is discovered by Martin (McKenzie). Martin flirts with her, but the two are interrupted by Elizabeth, Nobley, and Colonel Andrews, who arrive with news of an upcoming hunt. Martin's attentions to Jane during the pheasant shooting incites Nobley's jealousy; Jane's surprising skill in turn incites Amelia's. When Jane is forced to walk back to the house in the rain, she is rescued by Nobley. That evening, Jane becomes bored of the group's card games and leaves the house for a walk around the grounds. She runs into Martin; after flirting and witnessing the birth of a foal in the stables, they kiss. The following afternoon, Jane convinces Martin to break the rules: they take a rowboat out on the canal and spend the afternoon together.\nThe following day, the party is disrupted by the sudden arrival of another actor, the handsome and flashy Captain East. Everyone except Nobley is impressed by the Captain, who in turn seems taken with Jane. Martin witnesses the Captain making a pass at Jane from a distance. When Jane comes to visit him in the stables, he rebuffs her for \"parading around\" with the actors. When she asks if he is breaking up with her, he replies that they were never \"going steady.\" Jane is left alone, angry and confused.\nThe next day finds the actors and staff relaxing by the staff swimming pool, where Nobley's dislike of the self-absorbed George (\"Captain East\") is evident. Martin nonchalantly asks the other men's opinion of \"that girl Jane,\" indicating that he likes her despite their argument.\nLater that day, in the retiring room, Mrs. Wattlesbrook demands that Jane play the piano for the group. Frustrated by Mrs. Wattlesbrook's behavior, Jane defiantly chooses to play and sing the only song she knows -- \"Hot in Herre\"—before leaving the room. On her way to find Martin in the stables, Jane is stopped by Nobley, who knows about her dalliance with Martin and who insists upon the impropriety of a lady being alone at night, \"let alone cavorting with the servants.\" His attitude frustrates Jane and leads to an argument. Back at the house, Jane is accosted by a drunken Mr. Wattlesbrook. She fights off his attempted assault, which draws the attention of Nobley and Captain Andrews.\nFrustrated, Jane decides to take her \"story\" into her own hands and make her trip a growing experience. She asks Elizabeth for help and the two of them steal some of Amelia's extensive wardrobe of costumes. Jane wows the group with her charm and new-found boldness, but her stay at Austenland is threatened when Mrs. Wattlesbrook discovers her cell phone, which Jane had smuggled into her room at the start of her stay. Just when Mrs. Wattlesbrook is ready to evict Jane, Amelia surprises everyone and steps in to save her. In exchange, Amelia blackmails Jane into creating situations in which she and Captain East can be alone together.\nJane pairs with Nobley for the final play to allow Amelia time with Captain East. During rehearsals Jane and Nobley discover their mutual honest affection for the Austen era, for which Jane now has a healthier level of appreciation. The pair genuinely enjoy working with each other during the disastrous play (during which Elizabeth accidentally injures Amelia's eye), after the conclusion of which, Jane and Nobley sneak off to Jane's room, where Nobley confesses that he feels something for her and requests a dance during the final ball.\nAt the ball, Nobley draws Jane to a private balcony where he confesses his love for her. Disillusioned with \"the game\" after watching the other actors fulfill their guests' fantasies with elaborate (fake) proclamations of love and proposals of marriage during the ball, Jane decides she would rather have something \"real\" over the perfect Darcy fantasy with which she's finally been presented and leaves Nobley to spend the rest of the evening with Martin.\nAs their Austen experience has come to a close, Elizabeth decides to extend her trip to make sure the next batch of ladies knows Colonel Andrews is now hers. Jane is reluctant to tell her that Andrews is a gay actor, and not actually in love with Elizabeth. Jane and Amelia leave the house together. Upon departing, Jane is amazed to discover that Amelia is, in fact, an American, who visits Austenland yearly to distract herself from her marriage to a wealthy old man, and that Nobley is the one who had asked Amelia to pretend Jane's phone was hers to prevent Jane being sent away. As Jane leaves, Mrs. Wattlesbrook informs Jane that Nobley was not \"assigned\" to her—Martin was. Martin was actually an actor, meaning that his romance with Jane was fully scripted. Angry at being duped and suspecting that she is not the first guest to be assaulted by Mr. Wattlesbrook, Jane threatens to sue Mrs. Wattlesbrook and shut down Austenland.\nMartin is sent to the airport on Mrs. Wattlesbrook's orders in an attempt to smooth things over. As Jane dismisses Martin's scripted claims of love, Nobley appears and pleads with Jane to believe that his own affections for her were genuine, but she doesn't believe him either. When the two start fighting in the middle of the airport, Jane dismisses them both, triumphantly declaring herself to be \"over it all.\" When Nobley tries once more to express his feelings, Jane thanks him for being \"perfect\" and leaves in good spirits.\nBack home, Jane clears out the remains of her Darcy collection (including photos, stuffed animals, and life-sized cardboard cutouts).\nNobley shocks Jane by appearing at the front door of her apartment, having traveled all the way across the Atlantic to return her sketchpad and profess his feelings once more. Jane, dubious of his intentions, tells him he needn't have come all that way—she wasn't going to press charges against his aunt. He explains that his name truly is Henry Nobley, that he is a history professor, and that he only agreed to work for his aunt as a favor to her so he could experience the Austen era, a time when love and life were simple. Jane finally believes him and they kiss.\nIn the post-credits scene, it is revealed that Elizabeth has bought Austenland and turned it into a theme park. Jane and Nobley are among the guests, obviously very much in love. Mr. Wattlesbrook now works as a garbage picker, Captain East does a strip show of which Amelia is a keen fan, and Elizabeth is living the dream, surrounded by handsome footmen, as well as keeping Colonel Andrews as her co-host/companion. Martin is seen attempting to pick up women as he drives a buggy around the grounds, but they all snub him."}