{"mid": "AustinPowersInternationalManOfMystery", "IMDB_id": "tt0118655", "title": "Austin Powers: International Man of Mystery", "plot": "In 1967, British spy Austin Powers (Mike Myers) thwarts an assassination attempt by his nemesis Dr. Evil (also played by Mike Myers) in a London nightclub. Dr. Evil escapes in a space rocket disguised as a Big Boy statue, and cryogenically freezes himself. Powers volunteers to be placed into cryostasis in case Dr. Evil returns in the future.\nThirty years later, in 1997, Dr. Evil returns to discover his henchman Number 2 (Robert Wagner) has developed Virtucon, the legitimate front of Evil's empire, into a multibillion-dollar enterprise. Uninterested by genuine business, Dr. Evil conspires to steal nuclear weapons and hold the world hostage for $100 billion. Evil also learns that during his absence his associates have artificially created his son, Scott Evil (Seth Green), using his frozen semen. Now a Generation X teenager, Scott is resentful of his father’s absence, and resists Dr. Evil's attempts to get closer to him.\nHaving learned of Dr. Evil's return, the British Ministry of Defence unfreezes Powers, acclimatizing him to the 1990s with the help of agent Vanessa Kensington (Elizabeth Hurley), the daughter of his sidekick in the 1960s, Mrs. Kensington (Mimi Rogers). Posing as a married couple, Powers and Kensington track Number 2 to Las Vegas and meet his Italian secretary, Alotta Fagina (Fabiana Udenio). Later, Powers infiltrates Fagina's penthouse suite for reconnaissance and discovers plans for Dr. Evil's \"Project Vulcan\", which involves drilling a nuclear warhead into the Earth's molten core and triggering volcanic eruptions worldwide. Fagina discovers Powers in her suite and seduces him into revealing his true identity. Learning that Powers is back, Dr. Evil and his entourage conspire to defeat the spy by creating a series of fembots; beautiful female androids equipped with automatic guns concealed in their breasts.\nPowers and Kensington attempt to infiltrate the Virtucon headquarters, but are soon apprehended by Dr. Evil's henchman, Random Task (Joe Son). Meanwhile, the United Nations accede to the demands of Dr. Evil, who decides to proceed with Project Vulcan regardless. Powers and Kensington are placed in a death trap by Dr. Evil, but the pair easily escape and Kensington is sent for help. While searching for Dr. Evil, Powers is confronted by the fembots, whom he defeats by performing a striptease. Led by Kensington, British forces raid the underground lair, while Powers finds the doomsday device and deactivates it. Powers confronts Dr. Evil, but Fagina arrives holding Kensington hostage. They are interrupted by Number 2, who attempts to betray Dr. Evil by making a deal with Powers. Dr. Evil uses a trap door to eliminate Number 2, then activates the base’s self-destruct mechanism and escapes. Powers and Kensington escape just as the lair is destroyed in a nuclear explosion.\nPowers and Kensington are later married, and during their honeymoon Powers is attacked by Random Task. Powers subdues the assassin using a penis pump, allowing Kensington to knock him out using a bottle of champagne. Afterwards, the couple adjourn to their balcony. Among the stars, Powers spots the cryogenic chamber of Dr. Evil, who vows revenge on Powers."}