{"mid": "AvasPossessions", "IMDB_id": "tt3727982", "title": "Ava's Possessions", "plot": "The film opens with a priest (John Ventimiglia) successfully completing an exorcism on Ava (Louisa Krause), who is stunned to find that she has spent the last 28 days possessed by the demon Naphula. She's initially flippant towards her actions during this time, but soon discovers that she caused serious emotional and physical damage, resulting in her losing her job, friends, and boyfriend, as well as potential jail time. Ava's parents (William Sadler and Deborah Rush), sister (Whitney Able), and her sister's fiancee Roger (Zachary Booth) are all concerned for her and push her into accepting a plea deal that would spare her jail time or commitment in a facility for troubled ex-possessed people as long as she attended a rehabilitation program for the recently exorcised, as possessions are seen as real, common phenomena in this universe. The program is led by Tony (Wass Stevens), a gruff man that insists that Ava take the program seriously as to do otherwise would just raise the likelihood that the demon would return, as repossessions will frequently happen. Participants will ultimately be tested by wearing a necklace that invites the demon back into their body. If they can pull the necklace off and reject the demon, they graduate since this shows that they are strong enough to deter future possessions. At one meeting Ava meets Hazel (Annabelle Dexter-Jones), a fellow ex-possessed person that wants her demon to return since she enjoyed its presence and felt that it was \"special\" for both of them.\nWhile Ava is trying to piece together her missing 28 days she discovers blood stains on her apartment floor, which implies that she murdered someone. Ava's family is of little help, as Ava gets the distinct impression that they are hiding something from her. Her only clue to the person's identity is an engraved watch that leads her to Ben (Lou Taylor Pucci), who tells her that it belonged to his father. Sure that he is dead as a result of her, Ava lies to Ben about where she gained the watch but ends up reluctantly engaging Ben in a romantic relationship as the film progresses. Lonely and confused as to what exactly caused her to become possessed, Ava agrees to help Hazel's demon return via a ritual, which results in Hazel getting committed. The ritual also leaves a tattoo on her neck, which Tony discovers. He throws her out of the program, as the tattoo makes it so easy for the demon to return that the program would be seen as futile. This also ultimately results in Ava's family choosing to commit her, as they feel that she is too unpredictable to leave on her own. Ava manages to gain one more lead on Ben's father via a prostitute, but the woman is murdered before she can tell Ava anything. Ava is then recaptured and is put in a car with Roger, who is to take her to the asylum. However instead of taking her to the facility Roger instead tries to kiss her and reveals that he murdered the prostitute in order to keep her from telling anyone that he had visited her. She then discovers that while she did kill Ben's father, he was only in the apartment because he was a hitman that Roger had hired to murder her, as Ava had seen Roger with the prostitute and then joined the two of them for a sexual encounter. Roger drives Ava to Tony's now empty classroom, where he forces her to put on the necklace and bring back the demon, as he believes the two of them had a connection and confesses his crimes in front of the facility's security cameras. The necklace is successful in bringing back the demon, however Ava is able to control the demon and use its abilities to capture Roger. She then rips the necklace off, showing that she has complete control.\nThe film ends with Ava rebuilding her life and working with Tony in the facility office. Before leaving for the day he assures her that the demon would not be able to return, as she is stronger. However she soon begins to sense that the demon is near and accidentally causes some boxes to fall, revealing some old files on former possessed people. She discovers that her mother had also previously been possessed by the same demon, hinting that their bloodline is predisposed to possessions. Ava then recalls finding a tattoo similar to the one she received during the ritual, making her realize that her sister had deliberately sent the demon into her in order to avoid getting possessed herself. Furious, Ava begins screaming and the office door swings open, showing the shadow of Ava's demon."}