{"mid": "AvatarTheLastAirbender", "IMDB_id": "tt0417299", "title": "Avatar: The Last Airbender", "plot": "==== Book One: Water ====\nKatara, a fourteen-year-old Southern Tribe Waterbender, and her older brother, Sokka, find and revive Aang and Appa. Aang learns of the war occurring in his absence, and the siblings join him to reach the Northern Water Tribe at the North Pole, so that he and Katara can learn Waterbending from a master. Aang's return attracts the attention of prince Zuko, the exiled son of Ozai, who pursues the three thereafter. Aang is also pursued by Zhao, a Fire Nation militant who intends to win Ozai's favor and rob Zuko of his redemption.\nEn route to the North Pole, Aang meets the Kyoshi Warriors (established by an eponymous previous Avatar) and his childhood friend, King Bumi, attempts to learn Firebending from the deserter Firebending master, Jeong Jeong, and gains a traveling companion in a winged lemur he names Momo. Aang discovers the genocide of his people while visiting the Southern Air Temple. During the winter solstice, Aang meets his predecessor, Avatar Roku, who was a firebender.\nAt the Northern Water Tribe, Aang and Katara learn advanced Waterbending from its Master, Pakku, while Sokka falls in love with Princess Yue, the tribal chief's daughter. Zhao lays siege to the Northern Water Tribe, seizing the mortal forms of the Ocean and Moon Spirits, the source of waterbending, and thus causing a lunar eclipse. Zhao kills the moon spirit to render the Waterbenders powerless. Aang uses his Avatar State and combines with the Ocean Spirit to drive off the enemy's fleet while Princess Yue sacrifices her life to revive the Moon Spirit. When Ozai hears of Iroh's resistance to Zhao, he sends his daughter, Azula, to capture Iroh and Zuko.\n==== Book Two: Earth ====\nAfter leaving the Northern Water Tribe, Aang continues to master Waterbending under Katara's tutelage as the group searches for an Earthbending teacher. Their search brings them to Toph Beifong, a twelve-year-old blind tomboy and Earthbending prodigy who wants independence from her upper-class family. Pursued by Azula, Zuko and Iroh lead new lives in the Earth Kingdom, first as wanderers and later as refugees in the capital of Ba Sing Se. At a library guarded by the spirit Wan Shi Tong, Aang and his group learn that an imminent solar eclipse could allow them to stop the Fire Nation before Sozin's Comet arrives. Their journey to Ba Sing Se to inform the Earth King of this is complicated when Appa is kidnapped. At the city, they find the Earth King Kuei and Ba Sing Se manipulated by Long Feng, the leader of the Dai Li secret police.\nAfter Aang's group finds Appa and exposes Long Feng, Toph is captured, but escapes by \"Metalbending\", while Aang attempts to consciously access the Avatar state. The Dai Li join Azula to instigate a coup d'état of Ba Sing Se; and Zuko, having tried to ignore his past obsession, relapses when the Avatar appears to rescue Katara. As Aang tries to enter the Avatar state, Azula nearly kills him. With Ba Sing Se and the Earth Kingdom now under Fire Nation rule, the group escapes thanks to Iroh, who is imprisoned for betraying the Fire Nation, and Kuei goes into hiding.\n==== Book Three: Fire ====\nAang recovers from a long coma to find his friends and allies disguised as soldiers on a Fire Nation ship, preparing invasion of the Fire Nation. Despite receiving credit for the Avatar's apparent death, Zuko regrets his role therein. Although the invasion meets great success at first, Aang and his friends are unable to find Ozai and are forced to retreat with many of their allies captured. At the same time, having learned of his father's intention to destroy the Earth Kingdom at the time of Sozin's Comet, Zuko leaves the palace to teach Aang Firebending.\nAs the comet approaches, Aang becomes reluctant to kill Ozai, and goes alone to consult his predecessors' spirits. Katara and the others unsuccessfully search for Aang, and find the newly escaped Iroh, joined by the other members of a secret society called the Order of the White Lotus: Bumi, Master Pakku, Jeong-Jeong, and Master Piandao (a master swordsman who taught Sokka). Together, the Order of the White Lotus liberates Ba Sing Se. Sokka, Toph, and Kyoshi Warrior Suki hinder the Fire Nation's airships, while Zuko and Katara prevent Azula from becoming the new Fire Lord. As Sozin's Comet arrives, Aang confronts Ozai, but finds himself in a losing battle until Ozai mistakenly re-establishes Aang's connection to the Avatar State. Thus enabled, Aang strips Ozai of his firebending powers, instead of killing him.\nSoon after, Zuko is crowned the new Fire Lord and initiates an armistice. The series ends in a meeting of all the protagonists at Ba Sing Se in Iroh's tea shop, the Jasmine Dragon, where Aang and Katara hug and then kiss beneath the sunset. The camera then zooms up and into the sunset, displaying the words \"The End\" with their Chinese counterparts above them."}