{"mid": "AvengersGrimm", "IMDB_id": "tt4296026", "title": "Avengers Grimm", "plot": "Snow White and Prince Charming's kingdom is under attack by Rumpelstiltskin's brainwashed army of thralls. After killing the prince, Rumple confronts Snow in the throne room; he wants access to the Magic Mirror, which can act as a portal to a land without magic, where he can reign unchallenged. A fight ensues, resulting in them falling through the mirror's portal and into the other world. Later, Cinderella, Sleeping Beauty and Rapunzel arrive, noting the time that's passed since the battle, and how the other world's time moves much faster than theirs; they are joined by Red Riding Hood, who is tracking down Rumpelstiltskin's right-hand man, the Wolf. Having survived the battle, the Wolf attacks them; he tackles Red into the mirror, shattering it and embedding a shard into her shoulder. The princesses follow after them.\nThey arrive in L.A., but find Red and the Wolf are nowhere to be found. They attempt to search for Snow White, only to be met with hostility at a bar; they're quickly rescued by Snow, who has become a freedom fighter in the six months that have passed. She takes them to her hideout, explaining that Rumpelstiltskin has managed to gain some power by becoming mayor Heart; he continues to brainwash the populace in secret, rebuilding his army of thralls. The princesses tell Snow about the Magic Mirror shard Red has, learning that it's the only way to get back home. Snow hands them fashion magazines, telling them to blend in.\nRed continues tracking the Wolf, but ends up incurring the wrath of local gang leader \"Iron\" John; John believes in order, and doesn't tolerate chaos. Red, Wolf, and John are all arrested, though Red escapes and is eventually rescued in an ensuing battle by her friends. Mayor Heart pays John and Wolf a visit, freeing wolf and promising John \"order\"; he transforms John into an iron being befitting his moniker. They manage to track down Snow's group, resulting in a fight in which Red and Snow are captured by Heart. He brainwashes Red into a thrall, as the princesses are immune, and tries seducing Snow into being his queen when he takes over the world. Rejected, Heart uses his magic to amplify the shard's power and opens a portal back to fairy tale land.\nCinderella fights with Red, managing to get Red to remember her true self. Iron John sees that Heart lied to him and shatters the shard, sacrificing himself to shut the portal. Snow and Heart fight again. Heart dies, and Snow become frozen as a result of her powers, sparing her from otherwise certain death. The princesses and Red decide to find another way to get home and help with Snow's revival."}