{"mid": "AVeryBradySequel", "IMDB_id": "tt0118073", "title": "A Very Brady Sequel", "plot": "Following its predecessor, the film places the 1970s Brady Bunch family in a contemporary 1990s setting, where much of the humor is derived from the resulting culture clash and the utter lack of awareness they show toward their relatively unusual lifestyle.\nOne evening, a man claiming to be Carol's long-lost first husband, Roy Martin, shows up at the suburban Brady residence. He is actually a con man named Trevor Thomas and is there to steal their familiar horse statue that is actually a $20 million ancient artifact. They, portrayed as naïve, believe his story about suffering from amnesia and having plastic surgery after being injured. Throughout Trevor's stay, he is openly hostile to them, his sarcasm and insults completely going over their heads. Bobby and Cindy start a \"Detective Agency\" hunting down her missing doll and stumble upon Trevor's true intentions. Trevor kidnaps Carol and takes her and the artifact to a buyer in Hawaii. The remaining Brady family travels to Hawaii to save her and foil his plans.\nBesides the main storyline, the children have their own subplots in the film. Greg and Marcia both want to move out of their shared rooms and when neither wants to back down, they have to share the attic together. When Trevor's arrival suggests that Carol and Mike might not be married, Greg and Marcia believe that they are technically not related. That leads them to realize they are in love with each other, but try to hide it from one another throughout the movie. Eventually both cave in and they share a kiss at the end of the movie, but Marcia agrees to let Greg have the attic to himself, until he goes to college. Jan's subplot involves her making up a pretend boyfriend named George Glass in order to make herself seem more popular. Jan then meets a real boy named George Glass during the family's trip to Hawaii. Peter, who is trying to decide what career path to choose, starts idolizing and emulating Trevor, which frequently gets him in trouble at the architect firm where Mike works. Mike has been planning a second wedding/renewal of vows for himself and Carol, for an anniversary present without her knowing, although Trevor's arrival throws a monkey wrench into things."}