{"mid": "Awakenings", "IMDB_id": "tt0099077", "title": "Awakenings", "plot": "In 1969, Dr. Malcolm Sayer (Robin Williams) is a dedicated and caring physician at a local hospital in the New York City borough of The Bronx. After working extensively with the catatonic patients who survived the 1917–1928 epidemic of encephalitis lethargica, Sayer discovers certain stimuli will reach beyond the patients' respective catatonic states; actions such as catching a ball, hearing familiar music, and experiencing human touch all have unique effects on particular patients and offer a glimpse into their worlds. Leonard Lowe (Robert De Niro) proves elusive in this regard, but Sayer soon discovers that Leonard is able to communicate with him by using a Ouija board.\nAfter attending a lecture at a conference on the subject of the L-Dopa drug and its success with patients suffering from Parkinson's Disease, Sayer believes the drug may offer a breakthrough for his own group of patients. A trial run with Leonard yields astounding results: Leonard completely \"awakens\" from his catatonic state. This success inspires Sayer to ask for funding from donors so that all the catatonic patients can receive the L-Dopa medication and experience \"awakenings\" back to reality.\nMeanwhile, Leonard is adjusting to his new life and becomes romantically interested in Paula (Penelope Ann Miller), the daughter of another hospital patient. Leonard also begins to chafe at the restrictions placed upon him as a patient of the hospital, desiring the freedom to come and go as he pleases. He stirs up a revolt by arguing his case to Sayer and the hospital administration. Sayer notices that as Leonard grows more agitated, a number of facial and body tics are starting to manifest, which Leonard has difficulty controlling.\nWhile Sayer and the hospital staff are thrilled by the success of L-Dopa with this group of patients, they soon find that it is a temporary measure. As the first to \"awaken\", Leonard is also the first to demonstrate the limited duration of this period of \"awakening\". Leonard's tics grow more and more prominent and he starts to shuffle more as he walks, and all of the patients are forced to witness what will eventually happen to them. He soon begins to suffer full body spasms and can hardly move. Leonard puts up well with the pain, and asks Sayer to film him, in hopes that he would someday contribute to research that may eventually help others. Leonard acknowledges what is happening to him and has a last lunch with Paula where he tells her he cannot see her anymore. When he is about to leave, Paula dances with him, and for this short period of time his spasms disappear. Leonard and Sayer reconcile their differences, but Leonard returns to his catatonic state soon after. The other patients' fears are similarly realized as each eventually returns to catatonia no matter how much their L-Dopa dosages are increased.\nSayer tells a group of grant donors to the hospital that although the \"awakening\" did not last, another kind — one of learning to appreciate and live life — took place. For example, he himself overcomes his painful shyness and asks Nurse Eleanor Costello (Julie Kavner) to go out for coffee, many months after he had declined a similar proposal from her. The nurses also now treat the catatonic patients with more respect and care, and Paula is shown visiting Leonard. The film ends with Sayer standing over Leonard behind a Ouija board, with his hands on Leonard's hands, which are on the planchette. \"Let's begin,\" Sayer says."}