{"mid": "Azumi", "IMDB_id": "tt0384819", "title": "Azumi", "plot": "Azumi focuses upon the life of the titular young female assassin. The manga begins an indeterminate number of years after the Battle of Sekigahara. As Azumi begins her duty, the manga introduces its characters into mainstream history. Many of the early missions that Azumi undertakes are the assassinations of the prominent supporters and generals of the Toyotomi Clan, against whom Tokugawa Ieyasu expected to again go to war. The manga 'reveals' that many of the Toyotomi leaders who conveniently died of diseases or accidents prior to the final confrontation between the Toyotomi and Tokugawa were actually victims of assassinations by Azumi and her comrades, thus indicating to the reader when the events were taking place.\nAzumi is raised by an old man known as Jiji (Grandfather), whose name is later revealed to be Gensai Obata, as the only girl among ten students. They are secluded from the society in a tiny valley called Kiridani (Fog Valley) to such an extent that they do not know the difference between men and women, what a baby is, or customs like marriage. Early in the manga, as part of their training, Azumi and her comrades are ordered to go to Shimotani, a hidden community of ninja who became farmers, to learn the basics of ninjutsu. The manga sets a very chilling tone early on. The 10 erabareta senshi (chosen warriors), who are all young children (Azumi has her first period well after her first missions, so she appears to be somewhere between 10–12 years of age at the onset of the manga) are told by Jiji that they have completed their training. For their first mission, they are to form a pair with whomever among the 10 that they feel the closest. Azumi pairs with Nachi, and all others pair with their closest friends. Having formed the pairs, Jiji tells them their first mission is to kill their partner—whoever is too weak to kill their partner is too weak to fulfill their life's missions, and will not be allowed to survive. The ten children each fight their respective duels, and Azumi slays Nachi, an event which appears to deeply traumatize Azumi, but she hides her feelings, as do the others. Then, their second mission was to massacre all 53 residents of the peaceful ninja village, including their teacher, women and children, as they know of the group's existence. Azumi slays three men and four teenagers but is unable to kill a woman with baby, a task which one of her comrades quickly accomplishes.\nThe remaining five warriors proceed to go on assassination missions of the various important supporters of the Toyotomi faction. As the manga proceeds, it evokes various moral concepts such as the morality of assassinations (and killing in general), the dehumanization effect of politics, as well as leading the reader to question basic assumptions of right and wrong. For example, throughout much of the middle volumes of the manga (Vol. 8-19), Azumi frequently fights and kills many bandits—many of whom are depicted robbing, murdering, and raping innocent victims. Azumi does not question that her killing such bandits is right, and few readers probably question her righteousness. Later on in the manga, the political background to the reason for the banditry is revealed. The Tokugawa ruling family deposed and ended many previously prominent daimyo feudal lords who opposed them leaving the samurai and mercenaries in their employ without work or any means to live—therefore they resorted to banditry. Azumi questions whether it was right for her to have killed so many men who had been driven to banditry not by their own choice.\nA consistent recurring theme is the contrast between Azumi and other prominent characters. Azumi is compared to a bodhisattva—a kind of enlightened being. This is indicative of the theme in Azumi where characters around Azumi are motivated by a variety of obsessions. Some are motivated by a kind of blind idealism, others by religion, others by a lust for battle, greed, or even normally sanctified motivations like honor. Not all the forces (particularly those motivated by more noble incentives, like a pair of ninja assassins whom Azumi kills, who are participating in the planning of a revolt as the only way for a ninja community to survive) are depicted as if their single-minded drive towards their goals are somehow evil. However, nonetheless, in each case, those who are attached intensely to something in the world are killed by Azumi, while she, who seemingly has little attachment to the earthly world and few personal desires, survives."}