{"mid": "BabePigInTheCity", "IMDB_id": "tt0120595", "title": "Babe: Pig in the City", "plot": "Months later, Babe and his master Arthur Hoggett are given a welcome home parade after Babe's success as a \"sheepdog\". One day, Babe inadvertently causes an accident and Arthur ends up in a hospital. Esme is unsuccessful tending the farm by herself. Soon, two men from the bank arrive to inform Esme that she and Arthur have not paid their rent on time, and they will soon be evicted at the end of the month. Esme locates a letter from a fan saying that if she enters Babe in a sheepdog herding contest, held at a fair far away, she will win a large amount of money. She decides to enter Babe and they leave the farm together.\nAt the airport in the city of Metropolis, a sniffer dog falsely detects that Babe and Esme are accused of carrying illegal substances. Airport security officers interrogate them, causing them to miss their connecting flight. An airport cleaner informs them about a hotel that is suitable for accommodating animals, so Esme and Babe go there. While Esme runs an errand, Babe chases a black and white capuchin monkey named Tug after he steals Esme's suitcase. Fleeing into a hotel room, Babe follows it and meets three clothed chimpanzees named Bob, Zootie and Easy, as well as Thelonius, an orangutan butler for the landlady's elderly uncle Fugly Floom (Mickey Rooney), a clown who kidnaps Babe to use in his act. Babe initially refuses, but accepts when the chimps mention a reward he will receive after doing the act. When Esme returns, Fugly tricks her into thinking that Babe ran off into the city. Esme leaves to look for Babe, but ends up getting arrested after causing an uproar with some thugs. Fugly performs his clown act in a hospital, but Babe accidentally trips him and he throws a flaming torch into the stage curtains which catch fire, forcing everyone out.\nThe next morning, Fugly goes to the hospital in a food coma escorted by the landlady. Babe is in his room, hungry and waiting for Esme to return. That night, the chimps try to steal food from a store and use Babe to distract two dogs, who chase Babe around the city. Babe falls into a river and swims away, but returns and saves one of the dogs from drowning. The dog becomes friends with Babe, and Babe invites him and the other homeless animals into the hotel. They share the food around and then sing, alerting the duck Ferdinand who was searching for Babe. Zootie gives birth to twins, and the animals celebrate. Animal control officers are called to capture all the animals and seize them, except for Babe, Tug, Ferdinand and Flealick. Esme is released from jail by the judge after explaining her situation. That night, Babe, Tug, Flealick, and Ferdinand sneak into animal control and open their friends' cages. Esme returns to the hotel and reunites with the landlady, who is mourning her uncle's death, and tells Esme that her neighbor Hortense was the one who got the animals taken away. Esme and the landlady confront Hortense to find out where the animals have been sent, then set off to find them.\nEsme and the landlady track the animals to a charity dinner in the hospital's ballroom, where they battle the chefs and waiters with fire extinguishers. In the epilogue, the landlady sells the hotel and gives the money to Esme so she can save the farm. The landlady and the animals come to stay at the farm, where Arthur has recovered from his injury. Arthur proudly watches Babe saying, \"That'll do, pig. That'll do.\""}