{"mid": "BabysDayOut", "IMDB_id": "tt0109190", "title": "Baby's Day Out", "plot": "Bennington Austin \"Bink\" Cotwell IV (Adam and Jacob Worton), a mischievous baby who lives in a huge mansion with his family, is just about to appear in the social pages of the newspaper. Three criminals, Eddie, Norby, and Veeko, pose as the photographers and kidnap him, demanding a ransom. After the kidnapping, however, they have difficulty controlling him. While trying to get Bink to fall asleep, Norby does so reading Bink's book titled Baby's Day Out, leaving him unattended. Looking through it, Bink notices a pigeon on the page and then one by the open window. He follows it out and successfully gets away from his kidnappers, with Eddie falling off the building and into a garbage bin while chasing after him through the rooftop.\nThe FBI arrives at the mansion, headed by Dale Grissom (Fred Thompson), where they try to piece together clues along with Bink's parents and his loving nanny, Gilbertine (Cynthia Nixon).\nBink follows the story of his book by exploring the city and visiting the same locations in the same order. He crawls onto a bus, goes inside a department store and is briefly mistaken for having escaped from the care centre, stows away in a taxi and goes to the zoo, where he ends up inside a cage with a protective gorilla, and eventually a construction site. All the while, the kidnappers pursue him all over, but are unable to catch him. When they end up stuck inside the construction site after its closure for the day, they decide to give up and go home. Bink next visits the Old Soldiers' Home, where the veterans recognize him as the missing baby.\nBink's parents are notified by the FBI of various sightings of him in the city and Gilbertine deduces that he has been following the happenings of his favorite book and will most likely head for the Old Soldiers' Home next. Sure enough, they find him there, but on the way home, he begins to call out \"Boo-Boo\" toward the kidnappers' apartment. As the kidnappers contemplate such a humiliating defeat, they are horrified when the FBI moves in and arrests them after Grissom demands to throw down the book first.\nBack home, Bink is put to bed by his family. As his parents discuss having his picture taken by a normal photographer in the morning, he wakes up and gets ready to read another book, this one entitled Baby's Trip to China."}