{"mid": "BabyDoll", "IMDB_id": "tt0048973", "title": "Baby Doll", "plot": "Archie Lee Meighan (Karl Malden), a middle aged cotton gin owner, lives with his teen bride, Baby Doll (Carroll Baker) and her eccentric Aunt Rose Comfort (Mildred Dunnock) in a dilapidated plantation house in Tiger's Tail County, Mississippi. Archie Lee and Baby Doll have yet to consummate their marriage; they have separate bed rooms, with Baby Doll sleeping in an oversized crib in hers. Archie Lee desperately wants to but Baby Doll keeps him at arm's length. But on her 20th birthday -- one day away -- Baby Doll has promised to give her virginity to Archie Lee. She and Archie Lee fight a lot, and she threatens to leave him and live in a hotel in town if he doesn't provide for her. The situation boils over when the furniture company repossesses their furniture.Archie Lee's business is in terrible straits. All of the cotton fields are now working with the Syndicate Gin run by a Sicilian, Silva Vaccaro (Eli Wallach). Vaccaro has put many local business owners out of work with his large operation. One night, during a party in honor of the Syndicate Gin, Archie Lee burns the gin house to the ground. When the local authorities refuse to pursue an investigation because Vaccaro is an outsider, Vaccaro vows to take matters into his own hands. He realizes that Archie Lee was the only person not at the party and determines to prove his guilt.The next day Vaccaro takes his cotton to Archie Lee to have it ginned. While Archie Lee tries to get his antiquated machinery working, Vaccaro flirts with Baby Doll. She lets slip that, contrary to what he had told Vaccaro a few minutes earlier, Archie Lee was not at home at the time of the fire. Becoming suspicious of Vaccaro's intentions, Baby Doll goes to Archie Lee for protection. But he is upset because his gin has broken down. Vaccaro demands that Archie Lee go wherever he has to to find a replacement part. Archie Lee agrees and immediately leaves. Vaccaro sends an associate to get the replacement out of Vaccaro's own storehouse then continues to pursue Baby Doll.Baby Doll believes the plantation house is haunted. Vaccaro playfully uses this to \"scare\" Baby Doll and eventually get her to lower her guard. They play hide and seek, and Baby Doll hides in the attic. The floorboards are dangerously loose. Vaccaro, now forceful and angry, tells Baby Doll that she can't come out of the attic until she agrees to sign his handwritten \"affidavit\" that Archie Lee burned down the gin house. Baby Doll signs it. Vaccaro lets her out and prepares to leave. But Baby Doll persuades him to stay and take a nap with her in the crib, one of the few pieces of furniture left in the house.Archie Lee returns with the part and is angered and embarrassed to discover that Vaccaro has begun to take over his business. These emotions are only amplified when he discovers Baby Doll lounging around the house with Vaccaro, he still curled up in that oversized crib, she clad only in her slip. Baby Doll suggests that Vaccaro is interested in becoming partners with Archie Lee and suggests they discuss it over dinner. When Archie Lee sneaks away to make a phone call to friends in hopes they will come over to he house and help him deal with Vaccaro, Baby Doll kisses Vaccaro. Over dinner, she and Vaccaro taunt Archie Lee about his poor luck and flirt openly. When Archie Lee tries to take his anger out on Aunt Rose by threatening to evict her from the house, Vaccaro offers to hire her as his cook.Humiliated, Archie Lee loads his shotgun to kill Vaccaro. While Baby Doll calls the police, Vaccaro hides in a tree. Drunk, Archie Lee wanders the house and front yard looking for Vaccaro but can't find him. When the police arrive, they disarm Archie Lee; when Vaccaro shows them the affidavit signed by Baby Doll, they arrest Archie Lee as well. Baby Doll hopes Vaccaro will stay with her but he is more interested in ensuring his cotton is processed and goes home. Resigned, Baby Doll leads Aunt Rose back into the plantation house, telling her they will have to see what tomorrow brings."}