{"mid": "BadAss", "IMDB_id": "tt1928330", "title": "Bad Ass", "plot": "--written by KrystelClaireThe film starts with photos and shorts of the Latin quarters. There are buses, plenty of grafitti, highways in the middle of the city of LA. Some of the shots have been taken from YouView, which works, obviously, the same as YouTube.Frank Vega (Shalim Ortiz) is travelling by bus, and two punks get in. He starts remembering his teenage years, saying that they were the simplest and the happiest. He was the son of some small local farmers, and had a beautiful girlfriend called Lindsay (Jillian Murray). He has to do something with his life, so he decides to join the Army, and ends up being tortured and wounded in Viet Nam. When he returns to the USA, he has to follow rehabilitation, and then he tries to come back to his life.However, when he visits adult Lindsay (Donzaleigh Abernathy), she is already married with two children. He tries to join the police forces, but his wonds cause him to be rejected. He can't find a decent job, as all the possible employees want university degrees and experience. Finally, he starts selling hot dogs in a street post. And 40 years have gone by, and Frank (Danny Trejo)'s life has slipped through his fingers.He repents about his life. When two punks enter the bus, they bother a passenger. Frank tells them to stop, so he becomes the object of their wrath, but he defends himself and ends up beating them to a pulp. Some other passengers record this with their mobile phones, and they upload it onto YouView with the title Bad Ass. Frank becomes an instant celebrity, and he and Mrs Vega (Tonita Castro) are interviewed at the morning programme LA Mornings by a journalist (Sam Rubin). Now, his community and the police respect him. Officer Marlak (Patrick Fabian) even takes with them on patrol.Three months later, Frank's mother dies. Father Miller (Richard Riehle) gives out a deep and nice speech, but Frank is sad anyway. He takes all the cutlery to their local church, as stated in her will. The rest will be for him.On TV, Mayor Williams (Ron Perlman) wants to improve the safety of the Latin quarters.He is about to move in with his best friend in Mrs Vega's home. During the moving, they stop to drink Mrs Vega's drinks and they reminiscence about the old times in Nam, how Klondike Washington (Harrison Page) saved Frank's life, and they talk about the best day of their lives, which is yet to come. Klondike also gives Frank a pen drive, saying that it's important for Frank to keep it in Mrs Vega's old safe. Klondike mentions a plan to become rich.Klodike goes out to buy more liquor, and two punks threaten him. They are looking for something, which he says he doesn't have. It looks as though Klodike has won the fight. However, the guy called Sebastian (Craig Johnson) shoots Klodike and kills him. He and the other (Dorian Kingi) run away.Frank beats the crap of three punks at a liquor shop, so that the clerk (Ezra Buzzington) gives him the things he didn't have money to pay.A neighbour lady called Amber Lamps (Joyful Drake) offers him some consolation, stating that it's impossible to live on the neighbourhood anymore.Frank decides not to go out with his cop friend, and thinks that Detective Shah (Frank Maharajh) is not doing anything to investigate Klondike's death because he was black. He watches TV, and a news anchour (Christine Clayburg) says that 20 detectives were implied in the investigation of a person's runover. Frank feels frustrated when he sees some detectives playing games instead of working, so he decides to take things in his own hands. In fact, he goes to the place of the fight and finds one strange cartridge and a necklace with a photograph inside. He has a conversation with a boy but his father (Chris Spencer) tells the boy not to talk with unknown people and neighbours.It is a hunter weapon, a Baretta, something designed for the government and its army. The gun shop says that the girl in the photo looks like a girl who usually attends his church. He visits that lady, who is fed-up with the man who supposedly lost her necklace at Frank's, called Terrance (Erik Betts). She tells him that he's been away for a week, probably playing ball with his friends. At 22nd Street park, Terrance's friends (Joe Holiday, Buddy Sosthand & Mark Rhino Smith) are beaten until they tell Frank to look for Renaldo (Andy Davoli).He visits Renaldo's apartment, and a man dressed as a Catholic priest (Jack Freshkin) thinks that he was going to rob them, so he attacks them.Williams talks to Panther (Charles S. Dutton), the former's contact on the streets. Williams is facing re-ellection in 90 days, and it all depends in finding that pen-drive. Williams is afraid of Frank. Panther says that the streets are his, and that he'll take care of Bad Ass, because his brothers dealth with Klonkike in the wrong way.Frank helps an elderly lady (Norma Michaels) with her bags, and somebody shoots him. Frank still talks to Martin (John Duffy) the cutely savvy son of his neigbhbour, who has put violent Terrance out after he has hit her.Frank questions about Renaldo in a bar, starting a bar prawl, who he wins. The bartender (Tommy Rosales) tells him that Renaldo is upstairs. A pimp tells that Renaldo is with Tatiana (Winter Ave Zoli). At Mrs Vega's, a thug asks Frank about a pen drive. Frank tells Martin to use it, and that's how they see all the plans for the regentrification of the whole neighbourhood.Frank goes to Tatiana's massage parlour. Tatiana is a blonde masseuse who says she has split up with Reanldo and leaves Frank.Looking for Renaldo, a Bad-Ass fan (Esteban Cueto) neighbour tells him to burglar it in; in fact, he tells him that Tatiana always leaves her back door open. Tatiana and Renaldo are at it. Frank takes Renaldo's hand through the rabbish disposal system, and cuts several fingers. He says that Sebastian killed Klondike, and that Buster was the one who called the shots. On leaving, all the kitchen stained with blood, Frank says that Renaldo's wife sends a message: \"Fuck You\".Frank defends Martin's mother from Martin Sr., who's hitting her. Frank gets all cute to have dinner with her at her garden, which reminds Frank of his own mother.Frank gives to his friend Officer Malark the pen - just in case something bad happens to him. Frank goes to confess, because he's looking for revenge.Frank goes to Panther's garage directly. Two thugs are there, but Panther decides to face him directly, but not on his own. Panther tortures Frank with electricity, the same kind of torture that he had to face in Nam. Panther finds a photograph of Amber at Frank's wallet, so he threatens him with him going to attack her. As soon as Panther leaves, Frank releases himself with a lighter - in a cheese moment, in my opinion - and then there's this huge fight. Fire is everywhere, and then everything blows up.Panther runs away and takes a bus from a driver (Robert Sean Burke). When Frank tells a bus driver (Craig Moss) that he needs to steal his bus, the driver happens to be a fan of Frank's, so he will let him take his bus happily. Frank runs after the bus,creating havoc and chaos on their way, until Frank bumps onto a building. Panther decides to meet Frank face to face at the LA Market premises. On the last second, Frank swerves, but Panther's bus is crashed by an incoming train.Of course, this doesn't stop either of them. They both reach Amber's at the same time, and they fist-fight. Panther wonders how Frank Vega was able to find such a sexy lady. Amber takes Frank's side, obviously, but is Frank Vega who gives Panther the final punches. Frank says that he never had a woman rescuing him. She is worried because Frank's got a black eye and is bleeding. She takes Frank inside to take care of him, while Panther is left on his own, thrown to the soil, with a bleeding face, in the outside garden yard.A journalist says that the audience may remember Frank Vega \"Bad Ass\", but that he uncovered a major political corruption case, which meant that the mayor's office was linked to a terrorizing streetgang. The mayor is seen alleging that he's being attacked by special terrorist groups which are trying to destroy his political and economic agenda for the city.Frank is named an honorary police officer, and Malark gives him his badge. Frank goes speechless.Amber and her son dine together with Frank. Frank says that that was the best day of his life. The son tells him to trim that damn beard."}