{"mid": "BadGirl", "IMDB_id": "tt0021635", "title": "Bad Girl", "plot": "Dorothy Haley (Sally Eilers) and Edna Driggs (Minna Gombell) are store models, first seen in bridal clothes at work one afternoon. After the job Dorothy fends off her boss, who wants to take her for a ride, by claiming to be married to a prize fighter. The girls then go to Coney Island. On the return steamboat trip, the women make a bet about attracting a certain man's attention, and proceed to annoy him by playing a ukulele. This man is Eddie Collins (James Dunn), and after reacting to the women grouchily, he slowly forms a connection with Dorothy and sees her home. Eddie works in a radio shop and dreams of having a shop on his own, for which he has been saving.\nOn a subsequent date, Eddie keeps Dorothy in his apartment past 4 a.m., and she fears the reaction of her abusive older brother, who has been her guardian. Eddie proposes marriage as a solution and Dorothy joyfully accepts. Dorothy's brother calls her a tramp and evicts her from her home. After Dorothy suffers some anxiety the next day when Eddie seems to have disappeared, he turns up, having made arrangements for a new place to live, and the two are happily married.\nTen weeks later Dorothy confides to Edna that she is pregnant, but is reluctant to tell Eddie the news when she learns that he is ready to open his new shop, an expensive commitment. Instead she tells Eddie that she'd like to return to work, to which he objects. Wrongly guessing that she wants a larger place to live, Eddie cancels his plans for the shop in favor of a lavish new building and new furnishings, increasing Dorothy's worries. By the time Eddie finally finds out he's going to be a father, the two mutually misunderstand that the other is unhappy about the pregnancy, resulting in a strain on their marriage. The strain intensifies when Eddie stays away from home while earning extra money and arranging for the best possible doctor, all without telling Dorothy. After the child is born, Dorothy plans to leave Eddie until the misunderstanding is joyfully cleared up on."}