{"mid": "Badlands", "IMDB_id": "tt0069762", "title": "Badlands", "plot": "Badlands is set in 1959 and is narrated by the impressionable 15-year-old Holly Sargis (Spacek), a teenage girl living in a dead-end South Dakota town called Fort Dupree. She lives with her sign painter father, although their relationship has been strained since her mother died of pneumonia some years earlier. One day Holly meets the 25-year-old garbage collector Kit Carruthers (Sheen). Kit is a young, troubled greaser, who resembles James Dean, an actor Holly admires. Kit charms Holly, and she slowly falls in love with him. Holly's narration, describing her adventures with Kit in romantic clichés, is juxtaposed with the gradual revelations of Kit's increasingly antisocial and violent behavior.\nHolly's father disapproves of Holly and Kit's relationship, and shoots her dog as a punishment for spending time with him. Kit then comes to Holly's house and shoots her father dead. The couple fakes suicide by burning down the house and go on the run together, making their way towards the badlands of Montana. Kit and Holly build a treehouse in a remote area and live there happily for a time, fishing and stealing chickens for food, but are eventually discovered by bounty hunters. Kit shoots the three bounty hunters dead, and the couple flees. They next seek shelter with Kit's friend Cato, but when Cato attempts to deceive them and go for help, Kit shoots him; he also shoots a teenage couple who arrives to visit Cato shortly thereafter.\nKit and Holly are hunted across the Midwest by law enforcement. They stop at a rich man's mansion and take supplies, clothing, and his Cadillac, but spare the lives of the man and his housemaid. As the fugitives head across Montana to Saskatchewan, the police find and pursue them.\nHolly, who is tired of life on the run and of her relationship with Kit, refuses to go with him and turns herself in. Kit leads the police on a car chase but is soon caught, and enjoys the attention he receives from police and reporters. They admire him and engage with him as he is sitting in their custody, asking him questions and cracking jokes. Kit is later executed for his crimes, while Holly receives probation and marries her defense attorney's son."}