{"mid": "BadLieutenant", "IMDB_id": "tt0103759", "title": "Bad Lieutenant", "plot": "After dropping off his two young sons at Catholic school, an NYPD Lieutenant (who is never named) takes a few bumps of cocaine and drives to the scene of a double murder in The Bronx. Wandering away, the Lieutenant finds a drug dealer and gives him a bag of drugs from a crime scene, smoking crack during the exchange; the dealer promises to give him the money he makes from selling the drugs in a few days. At an apartment, the Lieutenant gets drunk and engages in a threesome with two women. Meanwhile, a nun is raped inside a church by two young hoodlums.\nThe next morning, the Lieutenant learns that he has lost a bet on a National League Championship Series game between the New York Mets and the Los Angeles Dodgers. He tries to win back his money by doubling his wager on the Dodgers in the next game. At another crime scene, the Lieutenant rifles through the car and finds some drugs which he stashes in his suit jacket. However, he is too impaired to secure the drugs, and they fall out onto the street in front of his colleagues. The Lieutenant tries to play it off by instructing them to enter the drugs into evidence.\nAt the hospital, the Lieutenant spies on the nun's examination, and learns that she was penetrated with a crucifix. Later that evening, he pulls over two teenage girls who are using their father's car without his knowledge to go to a club. As they have no driving license, the Lieutenant tells one of the girls to bend over and pull up her skirt, and the other to simulate fellatio while he masturbates. The following day, he listens in on the nun's deposition, where she says she knows who assaulted her but will not identify them.\nWhile drinking in his car, the Lieutenant listens to the final moments of the Dodgers game and shoots out his car stereo when they lose. Despite being unable to pay the $30,000 wager, he doubles his bet for the next game. Eavesdropping on the nun's confession, he hears her state that she has no anger about what happened, and he begins cursing at God before breaking down in tears and sobbing that he wants to redeem himself. The Lieutenant drinks in a bar when the Dodgers lose again. After scoring cocaine in a nightclub, he tries to double his bet yet again. His friend refuses to make the wager, insisting that the bookie would kill him.\nContinuing his drug use, the Lieutenant picks up his $30,000 share from the drug dealer and calls the bookie personally to place his bet. He then visits a woman (Zoë Tamerlis Lund) and does heroin with her. At the church, he tells the nun that he will kill her attackers, but she repeats that she has forgiven them and leaves. In the resulting emotional breakdown, the Lieutenant sees the crucified Christ and tearfully curses him before begging forgiveness for his crimes and sins. The figure is revealed to be a woman holding a gold chalice, which turns out to have been pawned at her husband's shop.\nThe Lieutenant tracks down the two rapists with the help of the woman, to a nearby crack den in Spanish Harlem and cuffs them together. He holds them at gunpoint and smokes crack with them as the Mets win the pennant. Instead of booking the two rapists, he drives them (mirroring the drive in the opening scene) to the Port Authority Bus Terminal and puts them on a bus with a cigar box containing the $30,000. He demands that they take the bus and never come back to New York. After he leaves the terminal, he parks on the street in front of Penn Station. Another car drives up beside him, and a voice yells, \"Hey, cop!\" before two shots ring out. The film closes as bystanders gather around the car, followed by police, realizing that the Lieutenant has been murdered."}