{"mid": "Balance", "IMDB_id": "tt0096880", "title": "Balance", "plot": "The film depicts five individuals living on a small platform floating in space. These men are all identical apart from a number at the back of their coats: 23, 35, 51, 75, and 77. Whenever one of them moves, the platform tilts and the others must move as well to ensure that the platform does not tip over. They all move out to the edge of the platform, take out fishing rods, and cast their lines over the edge. The one numbered 51 reels in a large, heavy box while the others scramble to the opposite side of the platform. One by one, the individuals inspect the box: it has a wind-up key that causes the box to play music. As each man in turn moves to inspect the box, the platform becomes unstable, prompting each of the group to converge in the center to keep the platform from tipping over. The man with the number 75 attempts to tip the box over the edge, but number 51 counterbalances the platform to prevent it. These two scuffle briefly, causing the box to slide to number 23, who tap dances to the tune as the others look on. 75 moves away from the center of gravity, tipping the platform and causing the box to slide toward him, but 23 sits on top of the box and moves with it.\nThe added weight moves the box to the very edge of the platform. The others rearrange themselves to bring the box back to the center. Riding the box as it slides from side to side, 23 pushes 35 off the platform as the former slides to the very edge. The others rearrange themselves again to compensate for the loss of mass. 51 trips and falls over. 75 shoves 77 to the ground as he avoids the careening 23. 77 scrambles to the opposite edge as 23 moves with the box again. 23 kicks 75 off the platform, unbalancing the platform and causing 77 to fall over the edge also. 23 gets off the box, approaches 51 and kicks him over the edge. Now alone, 23 turns around to look at the box, which is perched on the edge farthest from him. Without the others, 23 has to maintain the balance on his own, keeping the box out of reach. One step back and he falls, one step forward and the box falls. He can only watch as the box slowly winds down and plays its music, which 23 is unable to hear."}