{"mid": "BallotBoxBunny", "IMDB_id": "tt0043315", "title": "Ballot Box Bunny", "plot": "Yosemite Sam runs for mayor of a small town, and in his campaign speech, he makes several empty promises like \"There's enough fresh air and sunshine in this great country of ours for everybody - and I'll see to it that you'll get your share!\" As the speech continues, we see that Bugs Bunny is drinking carrot juice beneath Sam's podium. When Sam pledges to make good on a previous promise \"to rid this country of every last rabbit\", Bugs decides that the best way to fight him is to run for mayor against him. Bugs soon tries to win the townspeople over with Theodore Roosevelt's famous quote \"I speak softly, but I carry a big stick!\", which leads Sam to declare \"I speak LOUD and I carry a BIGGER stick, and I use it too!\".Sam has several tricks up his sleeve, but Bugs finds a way to answer every one. When Sam steals Bugs' cigar stand, Bugs switches the \"Smello\" cigars he had been selling for five-cent \"Atom\" explosive cigars (the box includes the slogan \"You Will Get A BANG Out of This\"). Sam gives a cigar to a man, but after the cigar explodes, the man punches Sam in the face. Sam then sends a box full of \"assorted\" picnic ants to steal all of the food at Bugs' picnic, which leads Bugs to hide a stick of dynamite in a watermelon being stolen.Sam rigs up a cannon at the front door of Bugs' headquarters, then turns up at the back door greeting Bugs in a friendly manner. When he taps his foot on the floor, he suggests that someone is knocking at the front door, and Bugs leaves Sam and goes to answer it, but this plan backfires when Bugs tells Sam that it was someone for him, and she said to mention St. Louis, which leads Sam to think that a pretty girl named Emma is there. Sam runs to the front door, opens it and gets shot by his own cannon.Sam's next challenge is to ask Bugs if he can \"play the pi-anna\". Bugs accepts, so Sam rigs an explosive in a particular piano key, and presents the piano to Bugs with a sheet of music containing the tune \"Those Endearing Young Charms\". When Bugs plays the tune, he deliberately hits a sour note that avoids the explosive key. When Bugs gets the note wrong a second time, it infuriates Sam, who shows Bugs how to play the tune correctly, and falls for his own trap by playing the note that sets off the explosion.After this, Sam and Bugs engage in a short pursuit through the streets of the town, which ends when they come across a parade that celebrates the newly-elected mayor - a chestnut horse who rides in a car bearing a sign that says \"Our New Mare\" - a literal \"dark horse\" candidate. This leads Bugs to make the odd suggestion to Sam to play a game of Russian Roulette and hand a gun to Sam. Sam agrees to the game, points the gun to his head, closes his eyes, pulls the trigger and hears the click of an empty barrel. Sam then passes the gun to Bugs, who points it to his head, closes his eyes and pulls the trigger as the film irises out into black in the middle. We hear the sound of a gunshot, then the film irises in on the left hand side to reveal a ducking Bugs, who holds a smoking gun as he says \"I missed\". A second iris appears on the right hand side to show Sam, who appears scorched and is missing his hat as a result of being hit in the face by Bugs' wayward shot. After Sam says \"I hate that rabbit!\", both sides of the film iris out for good."}