{"mid": "BallOfFire", "IMDB_id": "tt0033373", "title": "Ball of Fire", "plot": "A group of bachelor professors (one was a widower) have lived together for some years in a New York City residence, compiling an encyclopedia of all human knowledge. The youngest, Professor Bertram Potts (Gary Cooper), is a grammarian who is researching modern American slang. The professors are accustomed to working in relative seclusion at a leisurely pace with a prim housekeeper named Miss Bragg (Kathleen Howard) keeping watch over them. Their impatient financial backer Miss Totten (Mary Field) suddenly demands that they finish their work soon.\nVenturing out to do some independent research, Bertram becomes interested in the slang vocabulary of saucy nightclub performer \"Sugarpuss\" O'Shea (Barbara Stanwyck). She is reluctant to assist him in his research until she needs a place to hide from the police, who want to question her about her boyfriend, mob boss Joe Lilac (Dana Andrews). Sugarpuss takes refuge in the house where the professors live and work, despite Bertram's objections and their housekeeper's threat to leave because of her. In the meantime, Lilac decides to marry her, but only because as his wife she would not be able to testify against him.\nThe professors soon become enamored of her femininity, and she begins to grow fond of them. She teaches them to conga and demonstrates to Bertram the meaning of the phrase \"yum yum\" (kisses). She becomes attracted to Bertram, who reciprocates with a vengeance by proposing marriage to her. She avoids giving an answer to the proposal, and agrees to Lilac's plan to have the professors drive her to New Jersey to marry Lilac. After a series of misadventures, including a car crash, Sugarpuss realizes that she is in love with the Professor, but is forced to go ahead with her marriage to Lilac to save the professors from Lilac's henchmen. Bertram, meanwhile, unaware of Sugarpuss' love for him, prepares to resume his research, sadder but wiser, until he discovers her true feelings.\nThe professors eventually outwit Lilac and his henchmen and rescue Sugarpuss. She decides she is not good enough for Bertram, but his forceful application of \"yum yum\" convinces her to change her mind."}