{"mid": "Bandolero", "IMDB_id": "tt0062708", "title": "Bandolero!", "plot": "Posing as a hangman, Mace Bishop (James Stewart) arrives in the Texas town of Val Verde with the intention of freeing his brother Dee (Dean Martin) from the gallows. Dee and his gang have been arrested for a bank robbery in which Maria Stoner's (Raquel Welch) husband was killed by gang member Babe Jenkins (Clint Ritchie). After freeing his brother, Mace successfully robs the bank on his own after the gang has fled with the posse in pursuit.\nDee has taken Maria as a hostage after they come across her wagon, during which Gang member Pop Chaney (Will Geer) shoots and kills the man escorting Maria. The posse, led by local sheriff July Johnson (George Kennedy) and deputy Roscoe Bookbinder (Andrew Prine), chases the fugitives across the Mexican border into territory policed by bandoleros, whom Maria describes as men out to kill any gringos (foreigners) that they can find. Maria further warns Dee that the sheriff will follow, because they have taken the one thing that he has always wanted: her.\nDespite initial protestations, Maria falls for Dee and finds herself in a quandary. She had never felt anything for the sheriff, nor for her husband, who had purchased her from her family. The posse tracks them to an abandoned town and captures the gang. The bandoleros also arrive, shooting and killing Roscoe, so the sheriff releases the outlaws so that the men can fight back in defense.\nIn this final showdown, almost everyone is killed. Dee is fatally stabbed by the leader of the bandits, El Jefe, after savagely beating him when he attempts to rape Maria. Then Mace is shot by another. Babe and gang member Robbie O'Hare (Sean McGlory) die after killing several bandoleros. Pop Chaney is killed while going after the money Mace stole, and his son Joe (Tom Heaton) dies after trying to rescue him. Maria grabs Dee's pistol and shoots El Jefe dead, sending the now leaderless bandoleros into full retreat. Maria professes her love to Dee and finally kisses him before he dies. Mace returns the money to sheriff Johnson, and then falls dead due to his wound. Maria and the sheriff, with little left of the posse, bury the Bishop brothers and dead posse members without markers, after which Maria notes that no one will know who was there nor what had happened. They then begin the ride back to Texas."}