{"mid": "BarbieAFairySecret", "IMDB_id": "tt1800254", "title": "Barbie: A Fairy Secret", "plot": "Barbie is at the premiere of her latest movie when her rival and co-star, Raquelle, steps on her dress, ripping it. Her stylists, Carrie and Taylor, use magic to mend it. Crystal, a photographer, greets Carrie and Taylor and, taking one last picture of Ken, leaves to go back to Gloss Angeles. Crystal shows Princess Graciella the pictures she took at the premiere. She gives the Princess a love potion, which, due to the effects, turns her eyes from blue to purple. Crystal then shows the Princess the picture of Ken she took, and Graciella falls in love with him on the spot.\nThe next day at Wally’s restaurant, Barbie confronts Raquelle about the dress-stepping incident. Princess Graciella, Crystal, and two assistant fairies show up and kidnap Ken. Carrie and Taylor sprout their wings and attempt to stop the Princess from taking Ken, but the portal to Gloss Angeles closes before they can enter it. The stylists attempt to dissuade Raquelle and Barbie of the fact that they just saw fairies, but finally admit their existence. They explain that Ken is in trouble because if a human marries a fairy, the human has to stay in Gloss Angeles forever. Meanwhile, in Gloss Angeles, Ken and the Princess arrive in the royal palace, where they meet Zane, Graciella’s boyfriend. Zane is outraged at Graciella's new love interest and challenges Ken to three duels.\nBarbie, Raquelle and the fairies go to a clothing store, where they enter the Flyway (a fairy method of transport), which leads them to the top of the Eiffel Tower in Paris. The fairies reveal that Lilianna Roxelle, a fashion critic, is the oldest and wisest fairy living on Earth. After they arrive at Lilianna’s home, she informs them that Princess Graciella is under a love potion spell. She gives Barbie a potion that will turn the Princess back to normal if it rains down on her. It is also revealed that Taylor and Carrie were banished from Gloss Angeles. The girls then take Liliana's portal to continue their journey.\nBarbie, Raquelle, Taylor, and Carrie make it to Gloss Angeles and they make a stop to Wings and Things in order to get wings for Barbie and Raquelle where they run into the human owner named Reena and her fairy husband Graylon. They then disguise as cooks to try to reveal Princess Graciella about Crystal's love potion; however, Crystal reveals Taylor and Carrie by recognizing Taylor's shoes, and the princess locks the four in furyspheres. Barbie and Raquelle talk and finally figure out their misunderstanding. The reason Raquelle has always been so mean to Barbie is because she never got the chance to be Barbie's friend. They apologize to each other and become friends. Their reconciliation breaks the furyspheres and their wings become real, and they now realize that forgiveness lets them fly. The two then go to stop the wedding between Graciella and Ken, holding off the attendants and the princess. Finally, Barbie puts the antidote on Graciella, curing her from the love potion. Graciella realizes that it was Crystal who gave her the love potion and apologizes for the misunderstanding. She also explains that the reason she banished Taylor and is because the three of them were once friends but Taylor and Carrie started spending so much time together that she felt left out and betrayed. At the urging of Barbie and Raquelle, she lifts Taylor and Carrie's ban, and the three fairies forgive each other. Graciella then punishes Crystal by having her clean up after the ceremony, and goes to marry Zane.\nAfter the wedding, Graciella tells Barbie and Raquelle that their wings will disappear when they and Ken go back to the human world, and then reappear when they return to Gloss Angeles. Graciella sends them back to Earth with magical dust. The next morning, Barbie wakes up with no recollection of Gloss Angeles or the fairies, thinking it was a dream. However, she and Raquelle are now friends. Carrie and Taylor tell the two that they reconnected with an old friend (Princess Graciella) and are going back to their hometown (Gloss Angeles)."}