{"mid": "BarbarianQueen", "IMDB_id": "tt0088771", "title": "Barbarian Queen", "plot": "A peaceful barbarian village prepares to celebrate the wedding of Queen Amethea (Lana Clarkson) to Prince Argan (Frank Zagarino). During preparations for the wedding ceremony, the forces of Lord Arrakur (Arman Chapman) attack the village, taking Argan and Amethea's younger sister Taramis (Dawn Dunlap) along with several others prisoner and slaughtering the remaining villagers. Amethea, her handmaiden Estrild (Katt Shea) and the female warrior Tiniara (Susana Traverso) survive the attack and set out for Arrakur's city to rescue the others and seek revenge for the destruction of their village.\nAlong the way the three women come across a small encampment of Arrakur's forces. Amethea and Tiniara ambush and kill the men, discovering Taramis captive inside the camp, who has seemingly been traumatized by her experience and acts withdrawn.\nOn the outskirts of Arrakur's realm the women meet members of an underground resistance force who agree to help smuggle Amethea's party into the city, but refuse to take up arms with them against the tyrannical Arrakur. Inside the city gates, Amethea discovers Argan and the other men taken from her village are being forced to fight as gladiators in the arena at the center of town. Meanwhile, Taramis notices Arrakur leading a procession of troops into his palace and approaches him. Arrakur recognizes Taramis from the camp and allows her to accompany him inside, while in another part of town Estrild is attacked and raped by two of Arrakur's guards. Amethea and Tiniara come to her defense, but the women are overpowered and taken prisoner.\nEstrild is made into one of the harem girls who serve the desires of the gladiators, where she is reunited with Argan, telling him of their failed rescue attempt. Amethea and Tiniara are interrogated separately; Tiniara dies in an escape attempt, while Amethea is sent to the dungeon to be tortured. Arrakur and his new concubine Taramis visit Amethea in the dungeon, where she has been stripped naked save for a leather collar and thong, to find her being stretched on the rack by the chief torturer (Tony Middleton). Taramis pretends to not know Amethea, while Arrakur demands information about the rebels who helped Amethea into the city. Amethea refuses to speak, and Arrakur demands answers by the morning, taking his leave. Meanwhile, Argan, the other gladiators, and Estrild plot an uprising against Arrakur.\nThe torturer later rapes Amethea, but she uses her feminine strength to squeeze his manhood painfully during the assault, forcing him to release her from the rack, whereupon Amethea hurls him into a pool of acid and escapes the dungeon. Finding Estrild, the two women flee the castle and regroup with the rebels, who agree to help in the planned overthrow of Arrakur's forces led by Argan during the gladatorial games. Amethea and the rebels join with the gladiators in the attack. Amethea fights Arrakur in one-on-one combat during the melee, but is defeated and disarmed by him. Before Arrakur can deliver the killing blow, however, Taramis stabs him in the back, killing him. Amethea and Argan are reunited and celebrate the liberation of the city from Arrakur's tyranny."}