{"mid": "BarbieAndTheThreeMusketeers", "IMDB_id": "tt1484922", "title": "Barbie and the Three Musketeers", "plot": "In one of her new movies, Barbie stars as Corinne, a seventeen-year old girl who dreams of becoming a Musketeer.\nBut unfortunately, being a musketeer is not easy for Corinne. She is made fun of by other people, especially the prince's evil cousin, Phillippe. His dog, Brutus takes the letter of Monsieur Treville and flees to the castle. Corinne fails to get the letter, Cause, Brutus rips it. After having conservation with Treville, Corinne felt disappointed that she realized this day to be a musketeer wasn't according to the plan just as she hoped to be. But Brutus chased Miette towards the castle making a worse scenario with the three coworkers as palace maids. Corinne encounters Madame de Bosse, who hires her as a palace maid. After the hard day, the three palace maids, Viveca, Aramina, and Renee befriends with Corinne. Cause, they forgive her after what happened. The next day when they return to work, a chandelier drops towards the prince but he jumps out of way just in time and Viveca, Aramina and Renee show off their musketeering skills to defend themselves. Corinne also finds a small ruby and above finds that the rope has been cut. Then Corinne tells her friends about her dream is to become a musketeer. They were surprised at first, but they were excited. Cause the three girls said they also had a same dreams of being musketeers too.\nAn old maid named Helen overhears their conversation and takes them through a secret passageway, where she leads them to the old musketeer training room and agrees to train the four girls to be true musketeers. Soon the four girls are practicing their skills with Helen's help.\nOne day, while Corinne is cleaning the windows, she spots the prince hanging from his flying hot-air balloon and runs to help him. The prince thanks Corinne and immediately falls in love with her. but later, she finds that the rope attached to the hot-air balloon has been cut, just like the chandelier in the castle. Helen warns her and the girls to keep eyes and ears open for enemies, Otherwise, Prince Louis will be in danger. Miette sneaks to the castle with Alexander's help to join training with Corinne and her friends. Finally, their training with musketeering skills has succeeded and Helen is very impressed.\nOne night, Corinne, Viveca, Aramina, and Renee decide to celebrate their musketeering skills and walk into the dark, quiet streets. They encounter a man named Regent who pulls out a knife and Corrine realizes it matches the ruby she found next to the chandelier. They soon discover that the Regent's men were sneaking weapons into the masquerade ball to kill the prince. Corinne and her friends decided to have a chance to save Prince Louis from Phillippe and his men. They wear disguises and sneak into the ball without being caught. In the end after defeating Phillippe and his men, Prince Louis names them royal musketeers on the day of his coronation to be king. Helen take Madame de Bosse's place and Corinne's mother is very proud that her daughter had finally become a musketeer. Treville received the word of the plot against the king so Corinne and her three friends rides their horses saying \"All for one, and One for all!\" and together they rode off happily towards the sunset with their next destination."}