{"mid": "Baseketball", "IMDB_id": "tt0131857", "title": "BASEketball", "plot": "Somewhere around the beginning of the 21st century, sports like football, baseball, hockey and basketball have fallen in decline as competitive play was replaced by an ever-growing corporative play, to the point where teams could change cities, stars were easily traded like 'hired guns of the Old West', stadiums became huge outdoors and even prison inmates were chosen to integrate sports teams. All of this, combined with unchecked violence and no genuine game, alienated true loving sports fans whom abandoned sport loving, which yearned for a hope at revival that'd soon come in the most unexpected way possible.\nCoop (Trey Parker) and Remer (Matt Stone) are 23 and unemployed. They arrive uninvited at a party hosted by a former high school classmate. After finding that their classmates have matured, Coop and Remer find themselves outside drinking beer and shooting hoops. Two former classmates challenge them to a game. The two see that their opponents are very good at basketball, so they say they will only play a new game they picked up while secretly inventing the rules (based on basketball as well as baseball) as they go along and winning the new game, which also includes psyche-outs - ways to disrupt the game without being considered cheating. While the game isn't taken seriously, it slowly grows in popularity while Coop and Remer adopt Kenny 'Squeak' Scolari (Dian Bachar), a former gas company employee whom isn't taken as seriously as the other two.\nSix months later, Businessman Ted Denslow (Ernest Borgnine), enticed by the game itself, shows up to propose the creation of the National BASEketball League (NBL), with numerous rules in place to prevent this sport from deteriorating as the other sports had done: teams cannot switch cities, players cannot be traded, and individuals cannot make money via corporate sponsorship deals. It's also completely open to all publics, with Denslow stating 'anyone can be a sports' hero'. Coop hesitates, but comes to accept, realizing the opportunity in hand.\nFive years after creation of the league, the NBL is in full swing with stadiums, teams, fans, cheerleaders (most half-naked) and a major championship, the Denslow Cup. They even have a major network television contract (though it is never made clear which network it is) with Al Michaels and Bob Costas as the announcers. During the 1997 championship, Denslow, who is the owner of the Milwaukee Beers (in reference to real-life baseball team, Milwaukee Brewers) for whom Coop and Remer both play, dies choking on his hot dog, which causes Coop to miss his shot and the Beers to lose the finals. Denslow's will grants Coop ownership of the Beers for one year - if they do not win the next Denslow Cup, ownership reverts to Denslow's widow Yvette (Jenny McCarthy). Meanwhile, Coop and Remer meet (and eventually fight over) Jenna Reed (Yasmine Bleeth), who is head of the childrens' Dream Come True Foundation. They also get an opportunity to approach her through one of her children, Joey (Trevor Einhorn), who's an avid fan of BASEketball.\nThe greedy owner of the Dallas Felons, Baxter Cain (Robert Vaughn), wants to change the rules to allow corporate dealing, teams to move cities and players to switch teams, but could not accomplish this while Denslow was alive. Yvette, shown to be easily swayable, would've complied had she been given ownership of the team, but Coop refuses to accept any changes. Cain and Yvette work to make sure the Beers will lose the next Denslow Cup and Yvette will win ownership of the team. Cain starts with slowly convincing Remer to make a deal, which has the rest of the team start alienating from Coop, thinking his traditionalist management is denying the Beers their opportunities.\nAfterwards, Cain, realising Coop's relationship with Jenna, cuts the funds to her foundation, forcing Coop and Remer to ask Cain for help. Cain suggests creating a clothing line but Coop is entirely against it, but Remer, as part team owner, immediately agrees, and becomes so obsessed with his newfound fame that he alienates Coop. After they win the league semifinals, Cain informs Coop and Remer through photos that their clothing line has been produced through child labor in Calcutta. If the public finds out the team and Jenna's foundation will be ruined. Cain threatens to release the photos unless Coop and Remer lose or forfeit the Denslow Cup game, effectively losing the Beers ownership. Jenna learns about the child labor scandal and breaks it off with Coop. Coop blames Remer for the mess, while Remer blames Coop for saying no to Cain's proposals in the first place. They fall out, and Coop goes to Calcutta to resolve the situation.\nCoop replaces all the child workers in the factory with adults and makes it back just as the fifth annual Denslow Cup begins. The Beers start with an abysmal performance, failing to make one hit in six innings. At the seventh-inning stretch, the Beers are down 16-0, and Coop and Remer continue to blame each other and fight. Having had enough, especially after a cerimonial play, Squeak gives both a pep talk, reminding them of where they came from, what they did that changed their and everyone else's lives and what they were risking losing. Squeak's speech is so moving that Coop and Remer reconcile their differences and Yvette breaks off her alliance with Cain. Coop, Remer, and Squeak finally get back into the game and start scoring.\nIn the bottom of the ninth, Remer is on second, Squeak is on third, and Coop is up when his custom-made BASEketball (La-Z-Boy) pops. Joey brings Coop a new custom-made BASEketball made from a Barcalounger. Coop misses, but successfully completes the conversion, which is considered a home run for the win and the Denslow Cup. Coop and Jenna reunite while Remer hooks up with Yvette, as the team happily carries Squeak on the Denslow Cup.\nAfter the credits have rolled, Al Michaels and Bob Costas repeat the Coop and Remer \"Dude\" argument from earlier in the film and the movie ends as they draw the curtain and are seemingly about to kiss."}