{"mid": "BaseballBugs", "IMDB_id": "tt0038333", "title": "Baseball Bugs", "plot": "A baseball game is going on in New York City at the Polo Grounds (but the depiction of the frieze on the top deck was borrowed from Yankee Stadium), between the visiting Gas-House Gorillas and the home team, the Tea Totallers. The game is not going well for the home team, as the Gorillas, a team of oversized roughnecks, are not only dominating the Tea Totallers, made up of old men, but intimidating the umpire by knocking him into the ground like a tent peg after an unpopular judgment. The Gorillas' home runs go screaming out of the ballpark and the batters form a conga line, with each hitter knocking a ball out.\nBugs Bunny, fed up with the unfair game and the Gas-House Gorillas playing dirty, talks trash against the Gorillas, claiming that he could win the game single-handed with an endless barrage of home runs. He loses a bit of his bravado when he suddenly gets surrounded by the Gorillas. His challenge is forced on him by the Gorillas and, as a result, Bugs now has to play all the positions on the opposing team, including speeding from the mound to behind the plate to catch his own pitches.\nBugs first throws his fastball so hard that it zips by the opposing batter but also knocks him offscreen and into the backstop with a crash as he catches it. In the course of his dual role, he shouts encouraging words to the pitcher before going back to the pitcher's mound to make the next pitch, then returning to home plate to catch it. Next, Bugs decides to \"perplex 'em with [his] slowball\", throwing a pitch so slow that three Gorillas in a row strike out attempting to hit it.\nBugs takes his first at-bat, and selects a bat from the stack brought out by the batboy, a literal hybrid of a bat and a boy. Bugs starts smacking the ball as promised. On the first pitch, he makes a long hit, dashing around the bases while also showing off for the crowd, only to find a grinning Gorilla holding the ball just ahead of the plate. Bugs then pulls out a pin-up poster, distracting the player and allowing Bugs to score his first run. The scoreboard now shows the Gorillas as the home team, still with 95 runs, and with Bugs batting in the top of the fifth with one run so far.\nBugs hits another one deep, and while rounding the bases, a Gorilla ambushes the plate umpire and puts on his uniform. Bugs slides into home, obviously safe, but the fake umpire calls him out. Bugs gets in his face and argues the call, pulling his time-honored word-switching gag so that the umpire demands that he accept the safe call or go to the showers. He gives in, but the faux-umpire gets wise too late as the board flashes another run.\nBugs hammers the next pitch on a line drive that bounces off each Gorilla with a ping sound as with a pinball game. The scoreboard then blinks a random series of numbers and the word \"Tilted.\"\nThe story jumps ahead to the final inning, announced by a radio-style jingle, with Bugs leading 96–95, the Gorillas having lost a run somewhere along the way. The radio booth has also lost its original play-by-play announcer and Blanc's voice is now heard as the announcer. With two outs in the last of the ninth, a Gorilla is on base and another is up at bat, having just fashioned a bat out of a big tree and swinging it menacingly.\nBugs proceeds with a tremendous wind-up and lets the pitch go, but the ball is rocketed out of the ballfield. Startled, Bugs goes chasing after it desperately, clear out of the stadium, is almost led astray by a Gorilla driving a taxi, jumps out and catches a bus, goes to the top of the \"Umpire State Building\", climbs a flagpole, throws his glove in the air and manages to catch it, winning the game."}