{"mid": "Basic", "IMDB_id": "tt0264395", "title": "Basic", "plot": "A helicopter circles over the Panamanian jungle. On board is a team of Army Ranger trainees and their instructor, Master Sergeant Nathan West (Samuel L. Jackson). Their objective is to move through the jungle while a hurricane rages above, use live ammo to hit pop-up metal targets, then rendezvous at a small bunker.Seventeen hours later, Colonel Bill Styles (Timothy Daly) is aboard a helicopter searching for the same team he had expected back on base a long time ago. He sees a Ranger later identified as Ray Dunbar emerges from the jungle carrying one of his wounded comrades, Second Lieutenant Levi Kendall, on his back. He then sees another soldier walk out of the jungle and shoot at Dunbar. This soldier, later identified as Mueller, is killed in self-defense by Dunbar. Apparently, the mission has gone horribly wrong. The rest of the team, including West, are presumed dead.In an interrogation room back on base, Captain Julia Osborne (Connie Nielsen) makes little headway with Dunbar, who refuses to talk. Dunbar is given a pad of paper and pen and he writes that he will only speak to a fellow Ranger, someone from outside the base, and draws an \"8\" inside a circle on the piece of paper. Noticeably spooked upon seeing the 8, base commander, Colonel Styles calls in an experienced interrogator and friend, Tom Hardy (John Travolta). Hardy, an ex-Ranger who quit the army is now a DEA agent who is presently under investigation for suspicion of bribery. We also find out that Hardy served under West when he was a Ranger and hated him. Hardy and Osborne, initially wary of each other, are forced to work together during the 6 hours they are given before the CID transportation from Washington will arrive to take Dunbar and Kendall away to initiate an investigation. Styles wants the investigation kept quiet.Osborne doesn't approves Hardy's involvement in her investigation because of his spotty resume but does come around when Hardy strikes a conversation with Dunbar, who, until now, had not uttered a single word, proving how good Hardy is at interrogations.The audience learns through Dunbar that West is infamous for being a ruthless, tough-as-nails sergeant. One trainee in Dunbar's unit, a black soldier named Pike, earned West's wrath more than any other. Pike was selected for the Panama training mission along with Dunbar, Kendall, Mueller and two other soldiers, Nuñez and Castro. Since he seemed to have plenty of reasons to hate West, it is suggested that Pike had enough motive to murder him. At this point, Dunbar refuses to say anything more but confirms that the other members of the team and West are all dead.Hardy and Osborne then go see the other surviving team member, Second Lieutenant Levi Kendall, who is recovering from gunshot wounds sustained during the mission. It is revealed that Kendall is the son of a Joint Chiefs of Staff general. At the hospital, Hardy runs into Dr. Peter Vilmer (Harry Connick Jr.), an old friend, and also Osborne's on-again, off-again lover.Kendall reveals that he's gay and once had a homosexual relationship with another soldier that became public. His father pulled some strings to have Kendall transferred to West's unit to cover up the scandal. He claims West hated him for that. He also claims that West silently threatened his life in the helicopter, shortly before the mission began. Kendall was partnered with Castro for the mission and feared that West may have bribed Castro to give him a \"training accident\".Kendall claims that West was killed by being hit in the back with a white phosphorus grenade, and that Pike confessed to the crime, thinking that his comrades would go along with it. However, the team decided to turn Pike in when they would be picked up the next morning. In the middle of the night, Pike tried to rouse Kendall's sympathies by playing to their mutual hatred of West. Pike proposed they kill Mueller and Nunez and convince Dunbar and Castro to back them up. Kendall dismissed Pike's suggestion then went back to his sleeping area, but later spotted Pike whispering to Dunbar. According to Kendall, Dunbar then went back to his bag, extracted his pistol and aimed it at the sleeping Mueller. Kendall intervened, and caused Mueller to shoot Castro. After Castro was hit, he fired frantically striking Nunez, Kendall and Pike. Nunez and Pike were killed and Kendall was wounded. Dunbar then carried the wounded Kendall on his back through the jungle, exchanged fire with Mueller, and was picked up, as seen in the beginning of the movie. When asked why Dunbar would go through all the trouble of carrying him out of the firefight, Kendall suggested that perhaps Dunbar expected him to cover for him in gratitude.Hardy and Osborne confronts Dunbar with Kendall's revelations. Dunbar claims that Kendall is lying and that he didn't shoot West. He also claims that Mueller and Castro were selling prescription drug injection kits called \"combat cocktails\" which help dull physical pain and sharpen the mind, and that Kendall was in on it.Hardy refuses Dunbar's drug story because he thinks Dunbar said drugs only to get Hardy's attention as a DEA agent. This leads to a fight and Hardy almost leaves. He then remembers Dunbar's words about not shooting West. He realizes that, according to Kendall's story, West was not shot but hit with a phosphorus grenade. They return to Dunbar to listen to the rest of his story.Dunbar claims that Mueller shot West because he was aware of their drug dealing. He then claims that Mueller used Pike's grenade, which he had stolen from his pack earlier. Back at the bunker, Mueller tried to pin the blame on Pike, but when Pike began pointing out evidence that threw suspicion on Mueller, a fierce argument began, Mueller lost his temper and shot Pike in the head. A firefight broke out in the bunker and Castro and Nunez were killed. Dunbar rescued Kendall, hiked through the jungle, killed Mueller and was picked up by the helicopter.At Osborne's request, Dunbar provides proof of the alleged drug-dealing operation. He also says that it was Vilmer who supplied the drugs to Mueller and Castro.When Osborne and Hardy return to the hospital, they speak briefly with Dr. Vilmer. After a short interrogation, during which Osborne breaks his nose with a phone book, Vilmer admits that he distributed to Mueller and Kendall and that he falsified drug tests so that the soldiers would come up clean. Vilmer is placed under arrest.Hardy and Osborne then go to confront Kendall, who is acting very strangely and refuses to give them any useful information. However he still claims that Dunbar is the guilty party. After a few minutes, Hardy notices that Kendall is bleeding out of his ears. Suddenly, Kendall starts vomiting blood and then abruptly dies. However, right before Kendall dies he uses his blood soaked finger to draw the symbol for infinity () in Osborne's hand.Styles is furious that Osborne and Hardy talked to Kendall a second time after he explicitly ordered them not to. He relieves Osborne of duty and asks Hardy to leave. He informs them that Dunbar and Vilmer will be taken away shortly on the transport plane that has arrived from the U.S. and he considers the investigation closed.Osborne realizes that Kendall didn't draw the infinity symbol, but an 8. Remembering Dunbar's note which also had an 8, she shows this to Hardy, who first denies knowing what the 8 may symbolize. When she insists on pursuing her investigation even though they were just ordered to drop it, Hardy finally explains the conversation he had earlier with Styles about a rumoured group of ex-Rangers in Panama, trained under West, who turned rogue and became drug-dealers. They call themselves Section 8. Osborne, mad at Hardy for not telling her sooner engages him in a fight.After the fight, they return to the stockade where Vilmer, still in custody, remarks to Hardy and Osborne in an offhand manner that he will be on the same plane with Pike. Hardy corrects him, saying that he'll be on the same plane as Dunbar, but Vilmer says that's not right. He says Ray Dunbar is black. This means that the white \"Dunbar\" Hardy and Osborne have been questioning is in fact Pike, the man whom West antagonized during training (according to his own story). Pike had switched his tags with Dunbar's in order to throw off the local authorities, then disappear after being transported for trial. The soldier files never specifies the soldier's ethnicity.Hardy and Osborne rush back to the base just as Pike is being taken onto a transport plane. Hardy grabs Pike and holds his face dangerously close to the plane's whirling propeller until Pike drops to his knees, out of breath. Afterwards, Hardy and Osborne lead Pike away to interrogate him again now that they know the truth.In Pike's new story, West was not shot. Pike claimed West knew about the main operation going on at the base, cocaine smuggling. He claims West confronted the Rangers in the bunker and told them that he would turn them in to authorities in the morning and tell Styles everything. A brief Mexican standoff ensues and West escapes the bunker. Nuñez chases after him, and gets shot by West. Shortly after Castro and Mueller go looking for West, Pike finds Dunbar dead, West shoots Kendall, wounding him, and tries to convince Pike to give himself up. Mueller manages to kill West. Pike shoots at Mueller, and then, knowing that he would be blamed if West died, took Dunbar's dog tags. It is still thoroughly established that he managed to escape, carried Kendall through the jungle, killed Mueller and was picked up by the helicopter.To prove his story, he gives Hardy, Osborne and Styles, the number of a crate where Vilmer had stowed cocaine.Satisfied that they finally have their answers, Hardy and Styles retreat to Styles' office, unknowingly followed by Osborne who find it curious that she was not invited in the office too. Hardy tells Styles that he finds it curious that West didn't tell his colonel (Styles) about the drugs as soon as he suspected something. Hardy then accuses Styles of lying; he tells Styles that he believes West did in fact go to him, but that he was behind the drug dealing operation the whole time. Rather than side with West, he ordered Mueller and Kendall to kill him and then poisoned Kendall afterward to keep him quiet. Styles laughs off the accusations, but as Hardy starts to leave Styles offers him a percentage of the operation, once he's back in business, to keep his mouth shut. Hardy now understands why Styles called him to investigate. If he found anything, he could be easily discredited or bought. Hardy says he'll have to think about it and turns to leave. Styles draws his weapon to shoot Hardy, but he is shot and killed by Osborne who heard the whole exchange.After the Military Police wrap up the investigation into Styles' shooting, Hardy and Osborne have a coffee before they leave the base separately. Hardy tells Osborne not to worry about the charges and that she would be cleared. All she has to do is \"Tell the story right\". Osborne recalls hearing that same phrase during both Kendall and Pike's stories, particularly in describing how members of the conspiracy planned to cover up West's death.\nThis makes Osborne suspect Hardy may be somehow involved, especially since he hated West and because Section 8 contains West's former trainees. She tails him out of the base and watches as Pike runs out from some bushes and into Hardy's jeep.She follows them by car and then by foot through the streets of Panama City and watches as the two of them enter a doorway with a big eight ball hanging above it. Osborne sneaks up behind Hardy and Pike, with her weapon drawn, believing that they are Section 8 and are responsible for West's murder. She confronts Hardy with her own theories but becomes very confused when West, very much alive, walks up behind her and sits at the table with Pike and Hardy. Castro, Dunbar and Nuñez, also alive, come out of the kitchen and join them.They reveal to Osbourne that Section 8 is in fact a special black-ops anti-drug unit led by Tom Hardy himself. The mercenary story is a cover to spook the cartels. Dunbar, Castro, Nuñez and Pike (under fake names) infiltrated the base to investigate the cocaine trafficking that was going on, and discovered that Mueller, Kendall and Vilmer were responsible. West, not realizing that Styles was also involved, informed him of their findings, although keeping their involvement secret. Styles responded by ordering Mueller and Kendall to kill West. The training mission was a set-up to get rid of Mueller and Kendall, and fake West's death. West joined Section 8, and Hardy went to the base to confirm Styles' and Vilmer's involvement. West and Hardy then offer Osborne a job within their group. The movie ends when it is revealed that Tom Hardy is not a DEA agent and never left the army. He's in fact, a Colonel."}