{"mid": "BastardOutOfCarolina", "IMDB_id": "tt0115633", "title": "Bastard Out of Carolina", "plot": "The book opens with Bone relating the details of her birth. Bone's 15-year-old mother Anney gives birth to her after being seriously injured in a car accident. Anney, who is comatose during the delivery, is unable to lie about being married. Her mother and older sister Ruth attempt to give a false name and are caught in their deception. This results in Bone being declared a bastard (an illegitimate child; born out of wedlock). Anney, who \"hated to be called trash\", then spends the next two years unsuccessfully petitioning to get a new birth certificate issued without the word \"bastard\" stamped on it. This opens her up to the ridicule of the customers in the diner in which she works.\nAt age 17, Anney marries Lyle Parsons and gives birth to another daughter, Reese, in short order. Lyle is killed in a car accident, leaving Anney \"all bitter grief and hunger\". After remaining single for a few years she begins to date Glen Waddell, the son of a socially prominent dairy owner. Two years later, as a result of her becoming pregnant, they get married.\nAnney gives birth to a stillborn boy and becomes unable to have more children. During labor, Glen masturbates while touching Bone in the car. The family's fortunes plummet, with Glen losing job after job due to his anger management problems. It is then that Glen, who had been loving and gentle with Bone, begins sexually molesting her. The abuse culminates in beatings and whippings that leave Bone nursing bruises and broken bones.\nWhen Anney discovers the abuse, she leaves Glen, who promptly promises never to do it again. Anney takes him back and the abuse resumes. Anney leaves Glen again after her tough, hard-drinking brothers severely beat Glen upon discovering that he has beaten Bone once again. Bone then announces to her mother that she will never live in the same house with Glen again. Bone tells her mother that she loves her and will forgive her if she decides to go back to Glen, reiterating that she will not return to the house with Glen. Her mother then vows not to go back to Glen unless Bone comes with her.\nWhen Glen discovers this, he attacks Bone at her Aunt Alma's house, breaking her arm and raping her on the kitchen floor. Anney walks in on him and fights him off. Glen follows the two out to the car, begging Anney to kill him rather than abandon him. To Bone's disgust and amazement, Anney ends up crying and throwing her arms around Glen.\nBone's aunt Raylene visits her at the hospital and takes custody of Bone, as Anney has disappeared. While Bone is recuperating at her aunt's house, Anney shows up with a new birth certificate for Bone, this time without the word \"illegitimate\" stamped on the bottom. She asks Bone's forgiveness and leaves without telling Bone where she is going."}