{"mid": "BatmanAndRobin", "IMDB_id": "tt0041162", "title": "Batman and Robin", "plot": "In Gotham, one year after the defeat of Two-Face and the Riddler in the previous film, Batman and Robin attempt to thwart Mr. Freeze from robbing diamonds, but he steals one and flees. In South America, Pamela Isley is working under Dr. Jason Woodrue, experimenting with the Venom drug. She witnesses Woodrue use the formula to turn the violent, but diminutive, convicted serial murderer Antonio Diego into a hulking monstrosity dubbed \"Bane\". Woodrue and Isley argue over the use of the drug and Woodrue kills her by overturning a shelf of various toxins. She transforms into the beautiful and seductive Poison Ivy before killing Woodrue with her poisonous kiss. She finds that Wayne Enterprises funded Woodrue, thus she takes Bane with her to Gotham City. Meanwhile, Alfred Pennyworth's niece, Barbara Wilson, makes a surprise visit and is invited by Bruce Wayne to stay at Wayne Manor until she goes back to school.\nWayne Enterprises presents a new telescope at a press conference interrupted by Isley. She proposes a project that could help the environment, but Bruce declines her offer, as it would kill millions of people. That night, a charity event is held by Wayne Enterprises with special guests, Batman and Robin, and she decides to use her abilities to seduce them. Freeze crashes the party and steals a diamond from the event. However, he is captured and sent to a chamber prison in Arkham Asylum, but escapes with the help of Ivy and Bane. Batman and Robin begin to have crime fighting relationship problems because of Ivy's seductive ability with Robin. Ivy is then able to contact Robin once more, she kisses him but fails to kill him due to Robin wearing rubber lips. Robin and later on Batman become trapped, but are rescued by Batgirl, who shows up and defeats Ivy, and reveals that she is Barbara Wilson and knows the location of the Batcave.\nBatman, Robin and Batgirl decide to go after Freeze together. By the time they get to the lab where Freeze and Bane are, Gotham is completely frozen. Batgirl and Ivy fight each other as Robin is attacked by Bane. Robin eventually defeats Bane when he and Batgirl kick apart his venom tubes stopping the flow of venom to his body, Bane collapses before transforming back to his original diminutive size of Antonio Diego and is left helpless on the ground. Meanwhile Batman and Freeze begin to fight each other, with Batman defeating Freeze. Batgirl and Robin manage to unfreeze Gotham; and Batman shows Freeze a recording of Ivy during her fight with Batgirl. Freeze learns that Ivy has betrayed him over the death of his wife. Ivy blamed Batman for Nora's death, but she informs Batgirl that it was her idea. Freeze is angered by the betrayal and is informed by Batman that his wife is not dead; she is restored in cryogenic slumber and has been moved to Arkham waiting for him to finish his research. Batman proceeds to ask Freeze for the cure Freeze has created for the first stage of MacGregor's Syndrome, the disease that Freeze's wife is suffering from, for a friend (Alfred) who is dying. Freeze atones for his misunderstanding by giving him medicine he had developed. Ivy is shown imprisoned in Arkham and Freeze walks in. Alfred is eventually healed and everyone agrees to let Barbara stay at Wayne Manor."}