{"mid": "BatmanReturnOfTheCapedCrusaders", "IMDB_id": "tt5973626", "title": "Batman: Return of the Caped Crusaders", "plot": "At stately Wayne Manor, Bruce Wayne (Adam West) and his ward Dick Grayson (Burt Ward), watch their favorite show The Gotham Palace. During the programming, a band that was supposed to play on the show is revealed to be hidden and replaced by four of the dynamic duo's greatest villains: Joker (Jeff Bergman), Penguin (William Salyers), Riddler (Wally Wingert), and Catwoman (Julie Newmar). Bruce and Dick suit up as Batman and Robin and head towards the Gotham City Police Department, where they receive a riddle from Commissioner Gordon (Jim Ward) and Chief O'Hara (Thomas Lennon).\nThey discover that the crooks are robbing the Acme Atomic Energy Laboratory of their newest invention, the replication ray, which has the power to make a perfect duplicate out of anything. After a brief fight, the criminals manage to escape Batman, but leave behind a clue that leads the caped crusaders to their lair in an abandoned TV dinner factory. While discussing what to do with the Replication Ray, Catwoman reveals her plan to make Batman join their side with a scratch from a substance called \"Batnip.\" After Batman and Robin break in, they are defeated by the criminals and trapped on a frozen food tray heading towards a large oven. Catwoman uses her Batnip on Batman, but he is supposedly unaffected by it. The two escape the trap after the villains leave the factory.\nBack at stately Wayne Manor, Bruce starts showing signs of aggression after Aunt Harriet (Lynne Marie Stewart) nearly discovers the Batcave. He blames Alfred (Steven Weber) for the incident and fires him leaving the butler to wander on the streets homeless. After days of not finding Joker, Penguin, Riddler, and Catwoman, Batman figures out that the four crooks are no longer on Earth and have hijacked a space station. The two heroes go into space with the help of their Bat-Rocket.\nAt the space station, Joker, Penguin, and Riddler betray Catwoman as they don't trust her on their side due to her feelings for Batman. They try to throw her out into space. She is rescued by the Dynamic Duo and aids them in defeating her former allies for revenge. Batman savagely beats the three men and recovers the replication ray, but Catwoman escapes in an escape pod in the process.\nAfter the mission, Dick expresses concern towards Bruce for his behavior in the space station and at the Gotham City Police Department (where he left when Gordon wasn't looking without a word). Bruce kicks Dick out of the house and takes a break from being Batman, resulting in a crime spree in Gotham City.\nA few weeks later, Batman returns to the Gotham City Police Department and blames the police for the increase in crime. He uses the replication ray on himself to replace Gordon and O'Hara as police commissioner and police chief respectively.\nBatman soon replaces most of the government, jobs, and citizens in Gotham with his replicas and plans to take over the world. Dick realizes that the Batnip had a delayed effect on Batman and was slowly making him more evil over time. He then suits up as Robin and goes to Catwoman's lair to request her help in curing Batman which she agrees to do as she thinks the effects of the Batnip were more severe than she planned.\nThe two take the Catmobile to the Bat Cave, where Catwoman attempts to give Batman the antidote, but Batman anticipated it and took the Bat Anti-Antidote. Batman defeats the two in a fight and leaves them to die in the Nuclear Reactor, but they survive thanks to Robin's Bat Anti Isotope Spray. Knowing they can't take on an army of Batmen by themselves, Robin and Catwoman arrange the prison break of most of Batman's rogues gallery escape from Gotham State Penitentiary like Archer, Black Widow, Bookworm, Clock King, Egghead, False Face, King Tut, Louie the Lilac, Mad Hatter, Minstrel, Mr. Freeze, Sandman, Shame, and Siren by claiming to Warden Crichton (Thomas Lennon) that the ball and chains and pickaxes aren't in good shape. This resulted in the replaced versions carrying the villains out of the prison. While a prison guard tells Warden Crichton that Joker, Riddler, and Penguin didn't escape, the three of them mysteriously turn into a pile of dust.\nThe two confront Batman and his army on The Gotham Palace set, but they still lose even with the help of the criminals. Before Batman kills Robin and Catwoman, a disguised Alfred arrives and gives Batman a strong enough antidote to counter the Anti-Antidote. Batman returns to normal, and the rest of his clones turn to dust as the replication ray wasn't strong enough to make perfect clones.\nBatman realized that his behavior change was used as a distraction by Joker, Penguin, and Riddler, and that the ones they arrested were fake copies. The real ones were using the opportunity to rob the Gotham Art Museum. Batman, Robin, and Catwoman (who came as vengeance for what they did at the space shuttle) chase them to Penguin's blimp, where the villainous trio is defeated after they're knocked off the blimp to a safe location to be arrested. Catwoman tries to escape with the stolen paintings, but Batman recovers them and Catwoman, unwilling to be put in a cage again, allows herself to fall into a smokestack, leaving her fate ambiguous.\nBruce and Dick then throw Aunt Harriet a surprise birthday party (acting as if that's the secret they've been hiding from her) before being called away by the Bat Signal."}