{"mid": "BatmanAssaultOnArkham", "IMDB_id": "tt3139086", "title": "Batman: Assault on Arkham", "plot": "Batman rescues Riddler from a black ops assassination ordered by Amanda Waller, returning him to Arkham Asylum. Invoking Priority Ultraviolet, Waller captures criminals Black Spider, Captain Boomerang, Deadshot, Harley Quinn, KGBeast, Killer Frost and King Shark for the Suicide Squad. Their mission is to break into Arkham and recover a thumbdrive in the Riddler's cane. While in Waller's employ, Riddler copied information on the squad to make it public knowledge. She forces compliance by threatening to detonate nano-bombs implanted in their necks. KGBeast, who believes it's a bluff, walks out on Waller and is killed as an example to the others.\nThe six are sent to Gotham City, where Penguin has been hired by Waller to give them arms, equipment, and a place to stay, although he is angry with Harley and Joker for tossing his cigarettes in the harbor for a laugh. Deadshot repeatedly clashes with Boomerang as the latter does not respect his leadership of the group. To get to Arkham, Harley breaks into a doll store and begins trashing it. Batman arrives, demanding she tell him where Joker hid a dirty bomb; Batman has been ransacking the city in search of it, even resorting to interrogating Riddler for answers. This is also a dead end, as Harley has no clue where the bomb is located; Batman is forced to send her back to Arkham.\nAt Arkham, Harley encounters the Joker, who begins taunting how he previously kicked her out of a car, and ends up lashing out by attempting to shoot him with a stolen gun, only to fail in doing so due to the Joker's bulletproof prison cell. This distraction allows the others to infiltrate Arkham in disguises. Black Spider causes an explosion, putting the asylum on Yellow Alert; King Shark suggests playing the previous day's footage to keep both Batman and Waller from noticing them. Despite some in-fighting, the team manages to get to the storage room, where they find Riddler's cane and Harley's mallet. Batman arrives, as the footage showed employees who had that day off, fighting the squad until Black Spider pins him during an explosion; Black Spider later emerges with Batman's belt as his trophy. However, they then notice Killer Frost is missing. It turns out Frost was tasked by Waller to kill Riddler; however, he reveals Waller can't kill him with a nano bomb because he knows how to defuse it. The rest of the squad find her and Riddler outside the Medical Facility; they agree to help Riddler escape if he can defuse the bombs. Unfortunately, Joker also manages to escape as Harley's attack weakened his cell.\nRiddler hooks the squad up to the electro shock machine, minus Black Spider as he wishes to stand guard. At the same time, a dazed Batman wanders around and is found by the Joker, who sneaks up to shoot him. Riddler turns on the machine as Waller calls for an update; seeing the bombs' signals fading and learning of the squad's betrayal, she activates them. Harley, Deadshot, Boomerang and Frost survive, but King Shark's head explodes; oddly so does Batman's before Joker can shoot him. Riddler begins laughing as the squad hasn't figured out that \"Black Spider\" is Batman; revealing himself, Batman demands to know why the squad is in Arkham, only for the Joker to arrive and start shooting at everyone. Harley manages to sweet-talk the Joker into forgiving her, and Deadshot manages to \"out-crazy\" Joker to scare him away. It's then revealed Joker had hidden the dirty bomb in Harley's mallet, which he then activates. Joker broadcasts to Arkham, telling Batman and the squad that soon Gotham will be destroyed; he releases the inmates as a distraction to allow him to escape. Deadshot manages to escape in a helicopter, while Frost is presumably killed in the chaos by Bane and Deadshot and Captain Boomerang battle for who escapes in the helicopter with Deadshot tackling him out and leaving him to be arrested. Batman notices three heartbeats coming from the helicopter, realizing Joker and Harley stowed away.\nBatman follows them in the batwing, ending up crashing the helicopter into a building. Batman knocks out Harley and disarms the bomb. At the same time, Joker and Deadshot fight as Joker is not pleased with Deadshot touching his \"property\" - Harley. Badly beaten, Deadshot manages to pin Joker to the inside of the helicopter as it crashes to the ground. Batman later meets with Waller, warning her to discontinue the Suicide Squad program. Waller tells him that they never found Joker's body. The moment Batman leaves, Waller finds a laser pointing at her; the camera backtracks to where the laser is coming from - it's Deadshot. Now free and reunited with his daughter, Deadshot wants revenge on Waller. The movie ends before he pulls the trigger."}