{"mid": "BatmanForever", "IMDB_id": "tt0112462", "title": "Batman Forever", "plot": "In Gotham City, a few years after defeating the Penguin, the crime fighter Batman stops a hostage situation caused by a criminal known as Two-Face, the alter ego of the former district attorney Harvey Dent, but Two-Face escapes and remains at large. Edward Nygma, a researcher at Wayne Enterprises who idolizes Bruce Wayne, has developed a device that can beam television into a person's brain. Bruce offers to let Nygma come up with schematics for the device and set up a meeting with his assistant. However, after Nygma demands an answer from him immediately, Bruce rejects the invention, believing it to be too close to mind manipulation. After killing his supervisor Fred Stickley, Nygma resigns and seeks retaliation against Bruce for rejecting his invention and begins to send him riddles. A news report reveals how Harvey Dent became Two-Face: when he was prosecuting a mob boss named Sal Maroni, Maroni threw acid on Dent's face, disfiguring half of it. Batman tried to save him, but failed. After the incident, Dent seeks to kill Batman for failing to save him. Bruce meets Chase Meridian, a psychiatrist who is obsessed with Batman, and invites her to come with him to a circus event. After a performance from the circus performers, The Flying Graysons, Two-Face arrives and threatens to blow up the circus unless Batman comes forward and surrenders his life to him. The Flying Graysons attempt to stop Two-Face, but they get killed by as a result. However, Dick Grayson, the youngest member, survives as he climbs to the roof and throws Two-Face's bomb into a river.\nBruce invites the orphaned Dick to stay at Wayne Manor. Dick, still troubled by the murder of his family, intends to kill Two-Face and avenge his family. When he discovers that Bruce is Batman, he demands that Bruce help him find Two-Face so that he can kill him, but Bruce refuses. Meanwhile, Nygma turns himself into a criminal called the Riddler and forms an alliance with Two-Face. The two steal capital in order to mass-produce Nygma's brainwave device. At Nygma's business party, Nygma discovers Bruce's alter ego using the brainwave device. Two-Face arrives and crashes the party. He nearly kills Batman, but Dick manages to save him. Meanwhile, Chase has fallen in love with Bruce, which surpasses her obsession with Batman, but she soon discovers that they are one and the same. Bruce decides to stop being Batman in order to have a normal life with Chase and to prevent Dick from murdering Two-Face. Dick angrily runs away while Bruce and Chase have dinner together in the manor. The Riddler and Two-Face arrive and attack Wayne Manor. The Riddler destroys the Batcave and kidnaps Chase, while leaving an injured Bruce another riddle.\nUsing the riddles, Bruce and his butler, Alfred, find out the Riddler's secret identity. Dick returns and becomes Batman's sidekick, Robin. Batman and Robin head to Riddler and Two-Face's lair, Claw Island, where they are separated. Robin encounters Two-Face and nearly kills him. Realizing that he does not have it in him to murder, Robin spares him. Two-Face gets the upper hand and captures Robin. Batman arrives at the lair, where Robin and Chase are held as hostages. The Riddler gives Batman a chance to save only one hostage. But instead, Batman destroys the Riddler's brainwave collecting device, causing the Riddler to suffer a mental breakdown. Batman manages to save Robin and Chase. Two-Face corners the trio and determines their fate with the flip of a coin, but Batman throws a handful of identical coins in the air, causing Two-Face to stumble and fall to his death. The Riddler is taken to Arkham Asylum and imprisoned, but he claims he knows who Batman is. Chase is asked to consult on the case, but Nygma says that he himself is Batman, due to his damaged memories. Chase meets Bruce outside and tells him that his secret is safe before parting ways. Bruce resumes his crusade as Batman with Robin as his partner to protect Gotham from crime."}