{"mid": "BatmanVsRobin", "IMDB_id": "tt4324274", "title": "Batman vs. Robin", "plot": "During an investigation of missing children, Damian Wayne, AKA Robin, Batman's son with Talia al Ghul, has taken the Batmobile out to an abandoned toy factory without Batman's consent. He finds the perpetrator, Anton Schott, who has mutated some of the victims into dolls. Batman arrives, and in the resulting battle, Robin chases Schott while Batman knocks out the dolls with gas and frees the remaining children. Upon defeating Schott, Robin chooses to spare him, but an owl-masked assassin named Talon suddenly kills Schott and frames Robin for the murder. Batman is eventually convinced of Robin's innocence after finding an owl feather at the crime scene.\nThe next night, Bruce has dinner at Wayne Manor with fellow wealthy socialite Samantha Vanaver, who meets Damian. Later, he tries to connect with Damian, but he voices his frustration towards Bruce for never trusting him. Bruce goes out, leaving Damian with Nightwing to look after him (and calling off his date with Starfire in the process) and starts to investigate the owl feather, which leads him to the Gotham Museum of Natural History's Hall of Owls. He is reminded of a childhood story about the Court of Owls, a secret society of wealthy men who ruled Gotham from the shadows and killed any who opposed them by sending agents called talons. On the night his parents were murdered, Bruce had seen an owl clutching a bat flying away from the crime scene. He became convinced that the Court of Owls was to blame, but after finding no evidence of their existence, Bruce dismissed the legend.\nWhile continuing to investigate, Batman is attacked by three undead, owl-masked assailants. After killing one, Batman witnesses the other two suddenly liquefying into black ooze. Meanwhile, Damian, having escaped Nightwing and fled the mansion, is approached by Talon, who encourages Robin's choice of punishing criminals and offers Robin a chance to join him. Unsure of the decision, Robin returns home, where Bruce discovers him and warns him that he will be sent away to a school in Switzerland unless he learns to discipline himself.\nWhile driving to a date with Samantha, Bruce is kidnapped by white owl-masked people and he is brought before the Court of Owls, who offer Bruce a chance to join them. After Bruce leaves, given time to consider the offer, Talon reveals himself to be working for the Court of Owls, who are secretly raising an army of inhuman, undead talons to destroy Gotham City and allow the Court to rebuild it in their own image. However, their current talons are imperfect and dissolve after a period of time. It's also revealed that Talon's in a romantic relationship with Samantha, who's secretly the Grandmaster of the Court of Owls. While the Court is planning for Talon to become one of their undead soldiers, with Robin serving as Talon's replacement, Samantha's secretly planning to save Talon from this procedure and have him become a member of the Court, so he can rule Gotham by her side.\nDamian, having contacted Talon, starts accompanying him to take out criminals, though he hesitates to kill them, which frustrates Talon. Sensing how Robin looks up to Batman as a father, Talon explains that after he gave his abusive thief father up to the police, who shot him, Talon was recruited by the Court of Owls. Batman shows up, having tracked Robin's activity, but is blocked by Robin from capturing Talon. Batman tries to convince Robin that Talon and the Court of Owls are using him, but Robin is unconvinced, believing Batman is trying to hold him back from his potential. A confrontation breaks out between them, with Robin nearly getting the chance to kill Batman before leaving.\nBatman sneaks into the Court of Owls's headquarters through the sewers, but is exposed to psychotropic gas by the Court, causing Batman to hallucinate. He is rescued by Nightwing and Alfred Pennyworth. Meanwhile, Talon introduces Robin to the Court and the Grandmaster. When Damian reveals himself to her, Samantha deduces that Batman is Bruce. When ordered to kill Damian, Talon instead turns against and overthrows the Court and kills every single member, including Samantha. Now in control of the Court's army of talons, Talon leaves Damian behind, offering him another chance to join him once he has killed Batman.\nTalon and his soldiers attack Wayne Manor, breaking into the Batcave as Batman, Nightwing, and Alfred fight them off. Batman and Talon battle each other. Talon gains the upper hand until Robin, who escaped from the Court's headquarters, intervenes and fights in Batman's place. He eventually defeats Talon and holds a sai to his throat. However, Talon commits suicide by forcing Robin's sai through his own neck, leaving Robin stunned and confused.\nBatman tries to welcome Robin back home, but Robin refuses, claiming he needs to sort out who he is. He leaves for a monastery in the Himalayas that Batman suggested to him."}