{"mid": "BatmanBeyondReturnOfTheJoker", "IMDB_id": "tt0233298", "title": "Batman Beyond: Return of the Joker", "plot": "Late one night in future Gotham, several members of the infamous Jokerz gang - Bonk (Henry Rollins), Chucko (Don Harvey), Woof (Don Harvey), a human spliced with hyena DNA, Ghoul (Michael Rosenbaum), and the Dee-Dee twins, Delia and Deidre, (Melissa Joan Hart) - break into a warehouse full of high-tech equipment. They attempt to use a hovercraft to move one large piece of machinery but are quickly confronted by Batman (Will Friedle). The gang flees and an air chase ensues over Gotham, resulting in the destruction of the machinery and the gang's hasty escape.Back in the Batcave, an elderly Bruce Wayne (Kevin Conroy) practices throwing a Batarang to keep his remaining skills sharp. The aerial Batmobile returns and Bruce's protégé, Terry McGinnis, confirms that he was able to stop the Jokerz from taking what they sought but admits that he doesn't know why. Since the same gang of Jokerz has been stealing high-tech equipment several times over the past month, Bruce suspects that they are acting as fences for the stolen goods. A news report flashes on the TV announcing Bruce's plans to take control of Wayne Enterprises after years of absence. The majority of the company is happy about the return of their founder but one board member, Jordan Price (Mark Hamill) is bitter about the transition since he was next in line, after the departure of Derek Powers (Sherman Howard), for the chief position. Having finished his patrols, Terry leaves to go out with his girlfriend, Dana (Lauren Tom) at a night club but soon dozes off from exhaustion.The Jokerz gang returns to their hideout to face their mysterious boss who berates them for their failure to procure the latest gear. Bonk is no less pleased with the situation and accuses their employer of tricking them into stealing for no apparent purpose or payout before he insinuates that the man is not who he says he is. The darkened figure pulls out a gun and pulls the trigger, making Bonk flinch, but all that comes out is a banner with BANG written on it. However, with a second flex of the finger, the BANG flag shoots out and impales Bonk, killing him. His identity no longer a secret, the original Clown Prince of Crime, the Joker (Mark Hamill), stands and makes the other Jokerz swear their allegiance. Ghoul uses a computer to find another source for their missing materials. The Joker spots one entry on the list and points it out, noting that he thinks it will be 'fun'.The next night, Bruce and Terry attend a function for Wayne Enterprises celebrating Bruce's return on the roof of one of the company buildings. As Bruce begins giving a speech to the crowd, the microphone cuts out and the speakers erupt with the sound of the Joker's trademark laugh. Terry finds a moment in the confusion to find shelter and change into his Batman suit as Woof appears in the crowd and sends people into a panic. Dee-Dee startles Bruce on stage just as a shock rocks the platform and a plume of smoke obscures everything. Bruce is knocked to the ground as a panel rises on the stage and a figure emerges. Bruce's eyes widen in horror as he recognizes the apparent return of his greatest foe; the Joker.Batman arrives and puts himself between the Joker and Bruce. Joker is hardly impressed with the new Batman and even critiques his suit before fleeing. He tosses a few hapless people off the edge of the roof as he makes his escape, forcing Batman to rescue them instead of continuing his pursuit. Later, Terry returns to Bruce and, as they drive away, beats himself over his failure to stop the Joker. Bruce reassures Terry and tells him he did the right thing. Terry wonders how the Joker, after all these years, could still be around. Curious, and receiving no immediate information from a clearly shaken Bruce, Terry visits Commissioner Barbara Gordon (Angie Harmon), formerly Batgirl, to learn more about the Joker. However, she refuses to tell him much of anything. She meets with a man named Tim as Terry leaves.The following night in the Batcave, Bruce analyzes the night's events and compares voice samples from the Joker's latest appearance with those from his earlier encounters. They prove to be an exact match. Bruce remarks to Terry that it still isn't possible that the Joker has returned since he died more than forty years ago. Terry asks if he's sure, to which Bruce states that 'he was there'. Terry theorizes that Bruce himself, as Batman, killed the Joker but only because he had no other choice, else something truly terrible would have happened. Bruce doesn't answer but tells Terry to return his Batsuit. He feels that Terry has done enough for the city and cannot be burdened to do any more. Terry objects, saying that he feels being Batman helps to amend for past sins and insists that the life of Batman is the one he wants. Bruce becomes impatient and insults Terry, calling him a 'stupid kid' who knows nothing of what he wants. Terry storms out in anger, leaving the suit behind.The next morning, Terry gets up to have breakfast with his mother, Mary (Teri Garr), and his young brother, Matt (Ryan O'Donohue), who are both shocked to see Terry up so early given his normal late-night schedule. Terry admits he no longer works for Mr. Wayne.That night, Dana is happy to see that Terry is more energetic and able to spend time with her and give her his full attention. Terry is equally glad until he is approached by two blonde girls - the Dee-Dee twins. The Jokerz gang appears on the dance floor and attack Terry.Meanwhile, at the Batcave, Bruce is examining a chemical mixer when he is attacked by a gas bomb. The Joker emerges out of the shadows, surprisingly aware of whom Bruce really is.Terry manages to fight off the Jokerz gang at the club, but Dana is injured in the struggle. When paramedics arrive and assure Terry that Dana will recover, he speeds off towards Wayne manor. He knows that the Jokerz would have no reason to attack him so publicly unless they had very good reason to. He calls Bruce and receives no response. At the manor, Terry finds Bruce's dog, Ace, injured and races inside to find the old man. He enters the Batcave to see Joker graffitti sprayed all over the walls, a haunting reminder of the night his father was murdered. He finds Bruce sprawled on the ground of the Batcave, a horrible grin etched on his face. Despite his infected state, and barely conscious, Bruce directs Terry to a supply of the Joker venom antidote he'd been working on before the attack. Terry quickly administers the antidote.The next day, Barbara watches over Bruce as he slowly recovers from the toxin while Terry releases a cover story to Wayne Enterprises that Bruce suffered a bad fall and will not be able to take control of the company just yet. Afterwards, Terry meets up with Barbara and presses her for information. Finally, Barbara relents and starts at the beginning:Nigh on forty years ago, Barbara lived the life of Batgirl, part of the family that comprised of Bruce as Batman and young Tim Drake (Mathew Valencia) as Robin. One night, while Robin was on patrol alone, he came upon what he thought was a damsel in distress. The woman turns out to be none other than Harley Quinn (Arleen Sorkin), accomplice and lover of the Joker. Harley knocks Robin out and kidnaps him. For three weeks, Batgirl and Batman search the city for Robin until they come upon an obvious Joker booby trap. The 'gift box' erupts, leaving evidence that points Batman to the remains of Arkham Asylum, long since abandoned due to a relocation. They enter the asylum where the Joker and Harley welcome them in a grim scene resembling a casual family outing. They introduce the newest member to their 'family', their 'son' Joker Junior - Tim. Dressed in a suit matching the Joker's and wearing a freakish smile on his pale face, Tim is clearly brainwashed by the Joker's toxins. In a fury, Batman attacks the Joker while Batgirl pursues Harley. Batgirl and Harley fight in the rusted upper levels of the asylum and Batgirl demands to know why Harley allowed the Joker to do such a thing. Harley admits that they 'roughed' Tim up a bit, but she'll make it right. Harley is then knocked into a crevasse and, before Batgirl can pull her back up, loses her grip and falls into darkness.Meanwhile, the Joker flees further into the asylum and begins to play 'home movies' on a large projector screen for Batman to watch. Joker darkly narrates how he first captured Robin and tortured him until his will broke, at which point he began to share secrets. Joker calls Bruce by his name and admits that he finds it rather pathetic that Batman is, after all, merely a 'little boy in a playsuit crying for Mommy and Daddy'. When the projection ends, Joker ambushes Batman and slashes his chest with a knife before stabbing him in the leg and knocking him hard to the floor. Joker stands over Batman and tosses a gun to Tim who is standing nearby. Tim aims the gun at Batman and Joker encourages him to finish him. Tim pulls the trigger, laughing maniacally, and a BANG flag pops out. Batman begs to Tim, calling him by his name, as Joker becomes impatient. Tim's face twitches despite his laughter and he quickly re-aims the gun and pulls the trigger. The BANG flag shoots out, launching into the Joker's chest and knocking him back. He coughs blood and mutters, \"Thats not funny,\" before dying. Tim's laughter then succumbs to tears as Batgirl returns. She comforts Tim before they all leave together.Completing her story, Barbara explains to Terry that the Joker was buried beneath Arkham, Harley's body was never found, and Tim spent over a year with a friend, Leslie Tompkins, while his mind recovered, though he never again took up the mantle as the Boy Wonder. Barbara herself left the Dark Knight's company later on and relations between the three of them have never been the same. Tim is now a communications engineer and seems to be doing fine.Suspicious of Tim's current mental state, Terry takes the Batsuit back and decides to examine him in stealth. However, he is spotted right away due to Tim's years of training with the elder Batman. Tim swears that he has put his old life behind him and is less than nostalgic about his life as Robin. Regardless of his suspicions, Terry follows a secondary theory in Jordan Price, knowing that he harbors resentment against Bruce. He finds Price on his yacht surrounded by the Jokerz gang. Batman confronts them and Price admits that he gave the gang clearance so that they could steal goods from the factory but knows nothing about the attempt on Wayne's life. The Jokerz then reveal that they've been assigned to kill Price in order to 'tie up loose ends'. Batman saves Price as his yacht explodes from a localized beam of energy from above while the Jokerz escape once more. On shore, Batman gives Price to polic ealong with a recording proving his involvement with the Jokerz. Price is taken into custody.In the Batcave, a recovered Bruce sits with Ace at the computer, sullen over his inability to piece anything together. Terry confronts him and claims that the 'real' Batman would have recalled something to solve the case by now but Bruce claims that things are rarely that simple. He admits that he did not want Terry to end up like Tim; bitter, which is why he asked for the suit back. As they argue, Terry suddenly notices that, among the items in the cave smashed from the Joker's attack, only the Robin suit was shredded beyond recognition. Adding that to the fact that everything the Jokerz gang had stolen is consistent with communications software leads Terry's suspicions all the more to Tim as the answer behind the Joker's true identity. Following more research, Terry and Bruce discover that the stolen items could create a satellite defense system which Terry realizes was responsible for the spontaneous destruction of Price's yacht.Bruce instructs Terry to suit up and investigate. Terry requests one more weapon for his arsenal: Ace.Batman confronts Tim again at the local research station but finds that he is nothing more than a hologram. As the image disappears, the Joker communicates with Batman, seemingly confirming Terry's theory, and activates the satellite defense laser, destroying the station. Batman and Ace barely manage to outrun the laser with the Batmobile. After tracing down the Joker's headquarters, Batman engages the residing Jokerz gang one on one, with Ace helping to fight against the animalistic Woof. Having subdued the gang, Batman goes further inside and finds the real Tim who appears confused and unsure of how he got there. Batman becomes impatient with Tim's behavior and calls him out on working for the Joker. Tim suddenly suffers a flashback of killing the Joker and falls into a state of panic. Batman offers to call an ambulance, but Tim insists that he is fine, calling Batman 'Terry'. Shocked that Tim would know his true identity, Terry falters as Tim attacks and restrains him, telling him to stick around so that he won't miss the show.Tim then undergoes a transformation where he is revealed to be the Joker himself! Joker explains to a shocked Terry and Bruce that, while Tim was under his wing, he was also part of a breakthrough genetic experiment. The Joker implanted a microchip into the back of Tim's head where the Joker's DNA was essentially implanted; leading to Tim's transformation into a clone of the Clown Prince, all while remaining unaware. The Joker powers up the satellite defense system again and happily lists a few possible targets: the hospital where Dana is recovering, the park where Terry's mother and brother are, and Wayne manor. Not intimidated by Batman's threats, the Joker remains confident that he knows everything the old Batman and Robin knew at the top of their game and is thus one step ahead. But Batman asserts that the Joker doesn't know a thing about him. Ace then appears and attacks Joker, giving Batman time to escape. Bruce gives Terry some tips about the Joker; that he is very vain and likes to talk and not to let him get into Terry's head. Terry then comes up with an idea; he likes to talk too.Hiding in the rafters, Batman calls out to Joker and insults him, calling him less than a comedian and berating his unoriginal jokes. He surmises that the reason the Joker got such a kick out of teasing the original Batman was because he could never get a laugh out of him. He then starts laughing. This quickly infuriates the Joker who launches several bombs into the rafters, damaging the control system for the satellite in the process and re-aiming the beam onto the factory itself. Joker manages to knock Batman out of the ceiling and pins him down, choking him. He laughs in his face and maniacally begs one more laugh out of him. Batman manages to choke out a \"ha-ha\" as he takes an electric hand buzzer and zaps the microchip on the back of the Joker's neck, destroying it and whatever essence of the Joker was in Tim. Back to his old self, Tim collapses. Batman collects him and Ace and escapes the factory just before the satellite beam destroys it.Later, the Dee-Dee twins are released from jail on bond into the custody of their grandmother who beats them over the head, calling them ungrateful. The girls leave with her, calling her Nana Harley.The next day, Terry visits Tim in the hospital with Barbara. Tim thanks Terry for saving his life and notes that he is a fine successor to Bruce as Batman. As Terry leaves, Bruce appears in the doorway and makes peace with Tim.That night, Terry dons the Batsuit once more, vowing to continue the legacy."}