{"mid": "BattleRoyale", "IMDB_id": "tt0814023", "title": "Battle Royale", "plot": "Battle Royale takes place in a fictional police state version of Japan in the year 1997. The state, known as the Republic of Greater East Asia (大東亜共和国, Dai Tōa Kyōwakoku), originated after a population uprising was put down by the combined military and police forces. From time to time, fifty randomly selected classes of third-year junior high school students are forced to take arms against one another until only one student in each class remains in what is officially called the Battle Experiment No. 68 Program (戦闘実験第六十八番プログラム, Sentō Jikken Dai Roku Ohako Puroguramu). The Program was created, supposedly, as a form of military research, with the outcome of each battle publicized on local television. A character discovers that the Program is not an experiment at all, but a means of terrorizing the population. In theory, after seeing such atrocities, the people will become paranoid and divided, preventing another uprising.\nUnder the guise of a \"study trip\", a group of students from Shiroiwa Junior High School (城岩中学校, Shiroiwa Chūgakkō), a junior high school operated by the fictional Kagawa Prefecture town of Shiroiwa, are corralled onto a bus and gassed, only to awaken in a school on an isolated, vacated island, wearing metal collars around their necks. After being briefed about the Program by Kinpatsu Sakamochi, the students are issued survival packs and a random weapon or a tool, and sent out onto the island one by one. While most of the students receive guns and knives, some acquire relatively useless items like boomerangs, dartboard darts, or a fork. Hiroki Sugimura finds a radar device that tracks nearby students, and Toshinori Oda receives a bulletproof vest.\nTo make sure the students obey the rules and kill each other, the metal collars around their necks track their positions, and will explode if they linger in a \"Forbidden Zone\" or attempt to remove the collars. The Forbidden Zones are randomly chosen areas of the map that increase in number as time goes on, re-sculpting and shrinking the battlefield and forcing the students to move around. The collars secretly transmit sound back to the organizers of the game, allowing them to hear the students' conversations, root out escape plans, and log their activities. The collars also explode if the students go a full day without anyone dying.\nIn the end, only four students remain: Shuya Nanahara, Noriko Nakagawa, Shogo Kawada, and antagonist Kazuo Kiriyama. There is a car chase and shootout between them and Kiriyama is killed. Kawada fakes Nanahara and Nakagawa's deaths and boards a ship with the soldiers and Sakamochi. When Sakamochi reveals that Nanahara and Nakagawa are alive and attempts to execute Kawada, Kawada kills him. Nanahara and Nakagawa board the ship and kill the soldiers on board and meet up with Kawada, who succumbs to his own wounds and dies. Heeding Kawada's advice, Nanahara and Nakagawa escape to the mainland, where they become fugitives."}