{"mid": "Battleground", "IMDB_id": "tt0041163", "title": "Battleground", "plot": "In mid-December 1944 Pvt. Jim Layton (Marshall Thompson) and his buddy Pvt. William J. Hooper (Scotty Beckett) are fresh replacements assigned to separate companies in the 327th Glider Infantry Regiment, 101st Airborne Division. As a newcomer Layton receives a chilly welcome from his squad. PFC Holley (Van Johnson) returns to the company after recuperating from a wound sustained from fighting in the Netherlands.\nInstead of going on leave in Paris, the squad is trucked back to the front to help stop a surprise German breakthrough in the Ardennes. They stop that night in the town of Bastogne. The platoon is put up for the night in the apartment of a local young woman, Denise (Denise Darcel), with whom Holley hopes to fraternize. Jarvess (John Hodiak) is informed by Denise that she is taking care of two orphaned French girls. Jarvess later goes on guard in the village, where he runs into a group of battle weary soldiers. The soldiers inform Jarvess that they are making a \"strategic withdrawal\". The next morning, led by Platoon Sgt. Kinnie (James Whitmore), the men are ordered to dig in on the outskirts of town. Just as they are nearly done, they are ordered to a new location and have to dig in again.\nHolley, Layton and Kippton (Douglas Fowley) stand guard that night at a roadblock. A patrol of German soldiers, disguised as American soldiers, infiltrates their position and later blows up a nearby bridge. In the morning the squad awakes to a heavy winter storm. Roderigues (Ricardo Montalbán), a Latino from Los Angeles, is delighted by the novelty of snow, but his foxhole mate Pop Stazak (George Murphy), awaiting a \"dependency discharge\" that will send him home, is unimpressed. Layton goes over to see his friend Hooper, only to find that he had been killed hours before, and that no one in his company knew his name.\nKinnie informs the squad about the infiltration and sends out a patrol—Holley, Roderigues and Jarvess to move through the woods. Just before they start out, the platoon is shelled by German artillery, causing Bettis (Richard Jaeckel) to panic and desert. During the barrage Layton reminds his squad leader, Sgt. Wolowicz (Bruce Cowling), of his name and finds for the first time that he has been accepted as a part of the squad. Holley's patrol briefly skirmishes with the infiltrators. Roderigues is wounded by machine-gun fire from an enemy tank. He is unable to walk, so Holley hastily conceals him under a disabled jeep half-buried in snow, promising to return for him. Unfortunately, by the time they can get back to him, Roderigues has died due to the exposure of the elements (freezing to death).\nWolowicz, who has been wounded by shellfire, and a sick Cpl. Standiferd (Don Taylor) are sent back to a field hospital. Not too long after, Doc (Thomas E. Breen) informs the 3rd Squad that the field hospital had been captured. Holley is appointed the new squad leader, and partnered with Layton, while Pop Stazak is paired with Hansan (Herbert Anderson). When Pop's discharge comes in they find out from Kippton that the 101st is surrounded forcing Pop to stay with the men.\nMoved again and again, 3rd Platoon is attacked at dawn. Garby (James Arness) is killed by machine gun fire. Hansan demonstrates bravery by crawling out of his foxhole and being the first to fire on the Germans. Just when it appears that the platoon will be overrun, Hansan is wounded and Holley loses his nerve and runs away. Layton follows Holley. Ashamed of his cowardice, Holley leads a flanking counterattack that defeats the German attack. The platoon leader, Lt. Teiss (Brett King), announces that he will recommend Hansan for a Silver Star. Jarvess's foxhole partner, country boy Abner Spudler (Jerome Courtland), is killed while trying to put on his wet boots.\nAfter they get Hanson to the aid station, the squad runs into Bettis, who is doing K.P. duty in the rear and gives them a hot meal. Holley discovers that Layton is a quick learner, finding him being entertained by Denise. Later, while on guard duty, they encounter a party of Germans who have come under a flag of truce to offer Brig. Gen. McAuliffe (Ian MacDonald) surrender terms, resulting in his famous reply of \"Nuts!\" to the puzzled Germans.\nIn the bitter, foggy weather, the squad is short of supplies – supply transport aircraft are grounded. Several men attend impromptu outdoor Christmas services held by a chaplain (Leon Ames). That night the Luftwaffe bombs Bastogne. Denise is killed. Bettis, slowed by his fear of going back to the lines, is killed by a collapsing house. The \"walking wounded\", including Hansan and mess sergeant he befriended (George Chandler), are recalled up to duty for a last-ditch defense of the town.\nAs the platoon is down to its last few rounds of ammunition, the weather clears, allowing the Allied fighters to attack the Germans and C-47 transports to drop supplies, enabling the 101st to hold. Afterward, the siege lifted, Kinnie leads the survivors of the platoon toward the rear for a well-earned rest. As they move out, they spot a relief column of clean, well-equipped soldiers marching toward Bastogne. Kinnie begins calling \"Jody cadence\" and the veterans pull themselves together, proudly chanting the refrain as they pass the other GIs."}