{"mid": "BattleOfTheBulge", "IMDB_id": "tt0058947", "title": "Battle of the Bulge", "plot": "Military Intelligence officer and former policeman Lt. Col. Daniel Kiley (Fonda) and his pilot, Joe, are flying a reconnaissance mission over the Ardennes forest, spotting a German staff car. Under the ground in a subterranean lair, German Col. Martin Hessler (Shaw), a fictional character loosely based on SS-Standartenführer Jochen Peiper, is briefed by his superior, Gen. Kohler (Werner Peters). Kohler points out a clock with a 50-hour countdown, which is the time allotted for the operation, beyond which Germany has no resources for full-scale attack. At the same time German soldiers disguised as American troops, led by Lt. Schumacher (Ty Hardin), are tasked with seizing vital bridges and sowing confusion behind the Allied lines.\nMeanwhile, Kiley returns to headquarters where he warns that the Germans are planning one more all-out offensive. His superiors, Gen. Grey (Robert Ryan) and Col. Pritchard (Dana Andrews), dismiss it out of hand: all available intelligence points to Germany not having the resources and manpower to launch another attack.\nHoping to uncover more proof, Kiley visits a US infantry position on the Siegfried Line under command of Maj. Wolenski (Charles Bronson). A patrol led by Lt. Weaver (James MacArthur) and Sgt. Duquesne (George Montgomery) capture some young and obviously inexperienced German soldiers. Kiley concludes that experienced German troops have been replaced by these men and withdrawn for an offensive, but Pritchard dismisses this as well.\nHessler launches his attack the next day. Awakened by the noise of German tanks, Wolenski leads his men into the wooded area of the Schnee Eifel, where they try to fight them off but are overrun. A group of Allied tanks led by Sgt. Guffy (Telly Savalas) also attempts to slow the Panzers, but their tanks' weak guns and thin armor make them ineffective, forcing him and his crew to retreat.\nLt. Schumacher and his disguised troops capture the only bridge over the Our River capable of carrying heavy tanks. Hessler continues his spearhead toward Ambleve, while being observed by Kiley. Schumacher later takes control of a vital intersection of three roads connecting Ambleve, Malmedy and the Siegfried Line. He sabotages the road signs, and the rear echelon of Wolenski's troops take the wrong road to Malmedy; almost the entire unit is captured and massacred. Lt. Weaver manages to escape, but Duquesne is killed. US soldiers become suspicious when they witness Schumacher's \"military police\" lay explosives incorrectly on the Our bridge, and his masquerade is revealed.\nHessler's tanks and infantry storm Ambleve, finally taking the town. Although many Americans, including Wolenski, are captured, Grey, Pritchard, Kiley and others escape to the River Meuse. American forces regroup and begin to reorganize for a counterattack. Facing the dangers of a foggy night, Col. Kiley conducts an aerial reconnaissance in an attempt to locate the main German spearhead. He orders the pilot to shut off the engine and glide in an attempt to listen for enemy tanks. Suddenly, through a gap in the fog, he spots Hessler's tank column heading toward American lines. Kiley radios in the coordinates, but his plane is hit by German fire and crashes near an American fuel depot.\nMeanwhile, Gen. Grey's forces, with the Meuse at their back, prepare to fight off Hessler. The outgunned, outarmored American tanks are systematically destroyed, but at the cost of the Germans burning up much of their fuel. Guffy, Weaver and the surviving Americans head to the depot.\nAware of the fuel shortages, Hessler leads a detachment toward the depot to capture its stocks. Weaver and the stragglers arrive first. Weaver recognizes Lt. Schumacher, who is still posing as an American MP and whose men have taken control of the depot, but Schumacher doesn't recognize him. At Weaver's signal, he and his men open fire on the disguised Germans, killing them all. The US defenders flood the road with gasoline and set it ablaze. Nearly all the German tanks are destroyed in the fire, including Hessler's. The remaining Germans give up the attack, marching back to Germany."}