{"mid": "BeatTheDevil", "IMDB_id": "tt0046414", "title": "Beat the Devil", "plot": "Billy Dannreuther (Humphrey Bogart) is a formerly-wealthy American who has fallen on hard times. He is reluctantly working with four crooks: Peterson (Robert Morley), ex-Nazi Julius O'Hara (Peter Lorre), Major Jack Ross (Ivor Barnard) and Ravello (Marco Tulli), who are trying to acquire uranium-rich land in British East Africa. Billy suspects that Major Ross murdered a British Colonial officer, who threatened to expose their plan. While waiting in Italy for passage to Africa, Billy and his wife Maria (Gina Lollobrigida) meet a British couple: Harry (Edward Underdown) and Gwendolen Chelm (Jennifer Jones), who plan to travel on the same ship. Harry is a very proper and traditional Englishman, while Gwendolen is flighty and fanciful and a compulsive liar. Billy and Gwendolen have an affair, while Maria flirts with Harry. Peterson becomes suspicious that the Chelms may be attempting to acquire the uranium themselves. His suspicions are unfounded, but they seem to him to be confirmed by Gwendolen, who lies about her husband and exaggerates his importance.\nBilly and Peterson are in a car accident and wrongly reported to have been killed. In order to replace Peterson's lost capital, Ravello approaches Harry Chelm and explains their scheme. Just then, to everyone's surprise, Billy and Peterson return to the hotel alive and unharmed. The purser announces that the ship is at last ready to sail. On board, Harry reveals that he knows about Peterson's scheme and intends to inform the authorities. Peterson orders Major Ross to kill Harry, but Billy thwarts the murder attempt. Harry's outraged accusations alienate the ship's drunken captain, who locks Harry in the brig, where he is uncomfortable, but safe from Major Ross.\nThe ship's engine malfunctions and the ship sinks. When Billy goes to free Harry he finds that Harry has escaped and left the ship, intending to swim ashore. The passengers abandon the sinking ship in a lifeboat and land on an African beach, where they are arrested by Arab soldiers. They are interrogated by Ahmed (Manuel Serano), an Arab official who suspects that they may be spies or revolutionaries. Billy befriends Ahmed by talking with him about Rita Hayworth, upon whom Ahmed has a crush. Billy persuades him to send the party back to Italy. When they land, they are met and questioned by a Scotland Yard detective (Bernard Lee), who is investigating the murder of the Colonial officer. Gwendolen reveals Peterson's scheme, and his involvement in the murder, and his attempt to murder Harry, to the detective, who promptly arrests Peterson, O'Hara, Major Ross and Ravello. As the four crooks are led away in handcuffs, Gwendolen receives a telegram from British East Africa saying that Harry has acquired the land Peterson and the others meant to steal, and is now extremely rich and willing to forgive Gwendolen. Billy laughs happily, saying \"This is the end, the end!\"."}