{"mid": "BeepPrepared", "IMDB_id": "tt0054674", "title": "Beep Prepared", "plot": "As in all other cartoons featuring the pair, Wile E. Coyote tries to catch the Road Runner. It begins with the Coyote (Hungrii flea-baggius) assuming the \"on your mark\" stance used in track and field events. As soon as he goes into \"get set\" mode, he hears the familiar beeping sound and gets shocked into a backward move, suspended in mid-air atop a ravine. The Road Runner (Tid-bittius velocitus) issues the gunshot that causes the Coyote to drop (one of three overhead shots shown in the short). The episode title card follows.\n1.) First, Wile E. tries to trip the Road Runner with his own foot, only to have it flattened by a passing delivery truck.\n2.) Taking higher ground, Wile E. uses a bow and arrow to skewer the Road Runner, only to backfire and cause a chain of reactions that leads to him getting sandwiched by boulders.\n3.) Lifting a manhole cover off a manhole, Wile E. intends to trap the Road Runner in the manhole. But when the Road Runner approaches the manhole, the laws of physics break as the Road Runner picks up the manhole as a portable hole and runs off. Furiously, Wile E. gives chase after Road Runner towards the bridge. Road Runner stops half-way in the middle of the bridge as he drops the hole in Wile E.'s path. The result: Wile E. falls in through the hole in the bridge and plummets to the ground below.\n4.) Hoping to have a better advantage in the air, Wile E. uses a cloth-based Bat-Man Costume, but this time, to ensure he goes faster, he uses a small rocket to help him chase after Road Runner. An explosion follows, leaving behind nothing but the framework of the device. And since the wings were made of cloth, the fabric was also destroyed in the blast. With no support left whatsoever (not even slots in the wings), gravity takes over as the Coyote leaves a trail of soot.\n5.) Wile E. obtains a box of ACME Iron Bird Seed for use as bait. This time, he's wearing roller skates. Wile E. sets up the bait with a \"FREE LUNCH!\" sign, skates over behind a rock, and straps on a big magnet. When Road Runner eats the seeds, the magnet that Wile E. had strapped on suddenly gets attracted to the bird. As the magnet follows potential prey, so does Wile E. as the skates provide transportation. Road Runner leads Wile E. up a hillside and onto railroad tracks. Just as Road Runner approaches a bridge, he suddenly runs off as Wile E. runs into the path of a train. The Coyote tries to run off, but the magnet remains facing the train. The magnet remains upright as he winds up snared in the track bed.\n6.) After that failure, and as dusk approaches, Wile E. sets up a spring-loaded block of pavement, which ends up crushing him just as the Road Runner stopped right in front of it.\n7.) As the day comes to a close, Wile E. erects a pair of machine guns connected by a trip rope, and ends up getting reduced in size when the guns blast him in the midsection. Out he comes, holding up his midsection.\n8.) Finally, at night, Wile E. gets two last things from ACME: a Little Giant Do-It-Yourself Rocket Sled Kit and 30 miles of railroad tracks. However, just as Wile E. was about to pursue the Road Runner, one last time... The rocket sled blasts off from the ground and soars off, up in the sky, leaving Earth's atmosphere. His rocket passes Sputnik I and Explorer I, the first satellites in orbit. It sends Wile E. past the moon and beyond the stars. After the rocket sled explodes in deep space, the night sky has a new Sagittarius-like constellation... in the form of Wile E. Coyote. Twinkle twinkle little star.\nLike all Merrie Melodies cartoons, the closing scene said, \"That's all Folks!\"."}