{"mid": "BehindTheCandelabra", "IMDB_id": "tt1291580", "title": "Behind the Candelabra", "plot": "In 1977, 18-year-old Scott Thorson, who works as an animal trainer for movies, meets Bob Black, a Hollywood producer, in a gay bar in Los Angeles. At Black's urging, he leaves his adopted home in search of better-paying work. Black takes Scott to Las Vegas where they see a live stage show of Liberace. Afterwards, Black introduces Thorson to Liberace in his backstage dressing room who takes an immediate liking to the handsome younger man. However, Liberace's co-performer and fellow piano player, Billy Leatherwood, is cold and avoids Scott and Bob, despite their attempts to be friendly.Liberace invites the two men to his luxurious home in Las Vegas. Thorson observes that one of Liberace's beloved dogs is suffering from a temporary form of blindness, and with his veterinary assistant background, informs the famous pianist that he knows how to cure the condition. After treating the dog, Thorson becomes Liberace's \"assistant\" at the performer's request.Scott moves in with Liberace and soon becomes his lover. Scott even becomes part of Liberace's stage at playing his chauffeur in driving Liberace on stage in a Rolls Royce automobile for his performances. In the meantime, Billy Leatherwood is cut from Liberace's stage act and leaves town after receiving a large bribe from Liberace's management team.After another night of lovemaking, Scott confides in Liberace that he is bisexual because he is also attracted to women. Liberace is sympathetic, informing him that he wanted and tried to love women, but was exclusively attracted to men. He relates a story of a \"divine healing\" in which a \"messenger\" informed him that God still loved him.However, flaws in Scott's life begin to appear. Carlucci, Liberace's live-in \"house boy\", disapproves of Scott and privately warns him that Liberace sooner or later will discard him as he's done with \"many teenage boys\" in the past. Liberace's long-term manager, Seymour Heller, also disapproves of Scott and is overly loyal to Liberace in protecting Liberace's (who is called Lee) sexual orientation from the public at all costs for be belives (rightly so) that if Liberace would ever come clean about being gay, he would lose everything.It gradually becomes clear that Liberace is trying to mold Scott into a younger version of himself. In 1979, after turning 60, Liberace requests his plastic surgeon, Dr. Startz, to do a complete face-lift for himself to make him appear younger. Liberace also requests that Dr. Startz transform Scott's face to more closely resemble his own. Liberace also makes an unsuccessful attempt to formally adopt Scott. Scott soon turns to drugs (first pain pills, and later cocaine) as he becomes more angry and frustrated with Liberace trying to control him as well as Liberace's obsession to publicly hide their romance at any cost.In 1980, Liberace's mother, whom he always adored, dies and he holds a funeral. Scott is troubled by Liberace's lack of grief over his mother's death by claiming that he is \"finally free.\"In 1981, Scott's increasing drug abuse and Liberace's promiscuity towards younger men creates a rift that ultimately destroys their relationship. Liberace begins moving away from Scott by viewing gay porn videotapes and even takes Scott on an excursion to an adult bookstore and porn shop just as Scott is going through a drug withdrawal.In 1982, when Liberace suggests to Scott that they begin seeing other people, Scott becomes upset and goes on a drug bender. When Scott learns that his foster mother has died, he goes to Los Angeles for her funeral and when he returns to Las Vegas, he finds that Liberace has taken in yet another young man whom he hires as his \"personal assistant\". Scott is then thrown out on the street with all his things in plastic garbage bags by Seymour and told never to make contact with Liberace again. Scott moves in with Bob Black where he persuades Scott to take Liberace to court with the fact that he should be entitled to half of what Liberace has.In 1984, Scott retains an attorney to seek his financial share of the property by suing Liberace for over $100 million in palimony. During Scott's palimony lawsuit, he gives details about his five-year romance with the entertainer, while Liberace flatly denies any sexual relationship. However, Liberace offers Scott a settlement which is $75,000 in cash along with three of his cars, and three dogs totaling $20,000 in exchange for dropping his claim to Scott's $250,000 Las Vegas house that Liberace bought for him as well as sign a clause to prohibit Scott from ever revealing the true nature of his relationship with him. Scott reluctantly agrees to settle since he is broke from spending all of his money on drugs.Some time later, Scott is working as a clerk in a post office somewhere in Los Angeles where one day he notices a customer carrying a book about Liberace. Scott goes to a bookstore where he views a copy of Liberace's personal picture book containing photos of his luxurious homes as well as anecdotes by 'Lee' about his \"straight\" way of life. Scott leaves the store without purchasing the book. He passes by a Los Angeles newspaper stack dated October 3, 1985 with the front page cover detailing actor Rock Hudson's death from AIDS (an ominous thing).The following year on Christmas Day 1986, Scott, living alone in a small condo apartment, receives a phone call from Liberace who, speaking in a very weak voice, asks Scott to come visit him at his house in Palm Springs. The following day, Scott drives to Palm Springs to Liberace's house and is shocked to find the entertainer bedridden and dying of AIDS. Liberace thanks Scott for coming to visit saying that he only wanted to see Scott one last time before he died. He gives Scott one of his gold rings by his nightstand as a reminder to him and makes Scott promise never to tell anyone that he saw him like this saying \"I don't want anyone to remember me as just another gay queen who died of AIDS.\"Not long thereafter (on February 4, 1987), Liberace dies. Despite efforts to hide the true nature of his death, the newspapers reveal that Liberace indeed died of the AIDS virus. Scott attends Liberace's funeral in Los Angeles in which he imagines seeing Liberace performing one last time on stage with his traditional flamboyance, before being lifted to heaven with a stage harness."}