{"mid": "BeingThere", "IMDB_id": "tt0078841", "title": "Being There", "plot": "Chance (Peter Sellers) is a middle-aged man who lives in the townhouse of an old, wealthy man in Washington, D.C. He is simple-minded and has lived there his whole life, tending the garden. Other than gardening, his knowledge is derived entirely from what he sees on television. When his benefactor dies, Chance naively says he has no claim against the estate, and is ordered to move out. Thus he discovers the outside world for the first time.\nChance wanders aimlessly. He passes by a TV shop and sees himself captured by a camera in the shop window. Entranced, he steps backward off the sidewalk and is struck by a chauffeured car owned by Ben Rand (Melvyn Douglas), an elderly business mogul. In the car is Rand's much younger wife, Eve (Shirley MacLaine).\nEve brings Chance to their home to recover. She mishears \"Chance, the gardener\" as \"Chauncey Gardiner.\" Chance is wearing expensive tailored clothes from the 1920s and '30s, which his benefactor had allowed him to take from the attic, and his manners are old-fashioned and courtly. When Ben Rand meets him, he takes \"Chauncey\" for an upper-class, highly educated businessman. Chance often misunderstands people and states the obvious, particularly about gardening, but his simple words are repeatedly misunderstood as profound, allegorical statements about life, business and the economy. Rand admires him, finding him direct, wise and insightful.\nRand is also a confidant and adviser to the President of the United States (Jack Warden), whom he introduces to \"Chauncey.\" The President, who is concerned about the economy, asks Chance his opinion about \"temporary incentives.\" Chance hears the words \"stimulate growth\" and following a pause goes on a short speech about the changing seasons of the garden. Chance goes on to say \"there will be growth in the spring.\" The President completely misinterprets this as optimistic political and economic advice. Chance, as Chauncey Gardiner, quickly rises to national public prominence. He remains an adviser to Rand, attends important dinners, meets with the Soviet ambassador and appears on a television talk show. During the show, Chance again goes into detail about the importance of gardening and what a serious gardener he is, the host and public misunderstand this to be Chance talking about running the country and being a serious President should he get the chance. Though he has now risen to the top of Washington society, he remains very mysterious. The Secret Service is unable to find any background information about him. Public opinion polls start to reflect just how much his \"simple brand of wisdom\" resonates with the jaded American public. The President even begins to fear Chance's popularity with the public. During this time Rand's physician, Dr. Allenby (Richard Dysart), becomes increasingly suspicious of Chance, and seems to be able to see what everyone else cannot that Chance is not a wise political expert and that the mystery of his identity may have a more mundane explanation. Dr. Allenby considers confiding his suspicions to Rand but when he realizes how happy Chance is making him during his final days he decides not to.\nRand, who is dying, encourages Eve to become close to \"Chauncey.\" She is already attracted to him and makes a sexual advance. Chance has no interest in or knowledge of sex, but mimics a kissing scene from the 1968 film The Thomas Crown Affair, which happens to be on the TV. When the scene ends, Chauncey stops suddenly and Eve is confused. She asks what he likes, meaning sexually; he replies \"I like to watch,\" meaning television. She is momentarily taken aback, but decides she is willing to masturbate for his voyeuristic pleasure. As she becomes involved in the act, she does not notice that he has turned back to the TV and is watching it, not her.\nChance is present at Rand's death and shows genuine sadness at his passing by crying. Chance then talks briefly with Rand's physician, Allenby finally asks what he has been wanting to and has his thoughts confirmed that \"Chauncey\" is merely a simpleminded gardener who knows nothing of finance or politics, Allenby does not appear bothered by this and it is left ambiguous what he will do about the knowledge. At Rand's funeral, while the President delivers a speech, the pall-bearers hold a whispered discussion over potential replacements for the President in the next term of office. They unanimously agree on \"Chauncey Gardiner.\"\nOblivious to all this, \"Chauncey\" wanders through Rand's wintry estate. He straightens out a pine sapling, touches some flowers and then walks off across the surface of a small lake. He pauses, dips his umbrella into the deep water under his feet as if testing its depth, turns, and then continues to walk on the water as the President quotes Rand: \"Life is a state of mind.\""}