{"mid": "BelleDeJour", "IMDB_id": "tt0061395", "title": "Belle de jour", "plot": "Séverine Serizy (Catherine Deneuve), is a 23 year old. beautiful, newlywed housewife, married to the respectable and uninteresting surgeon, Dr. Pierre Serizy (Jean Sorel). Despite their love for each other, Séverine is frigid and sleeps in a separate bed, rejecting his sexual advances. Her sexual life is restricted to elaborate fantasies involving dominance and submission, sadomasochism, and bondage. Although frustrated by his wife's frigidity, he respects her wishes.While visiting a ski resort, they meet two friends, Henri Husson (Michel Piccoli) and Renée (Macha Méril). Séverine does not like Husson's manner and the way he looks at her. Back in Paris, Séverine sees Renée again and learns that a mutual friend, Henriette, has turned to prostitution for money. At her home, Séverine receives roses from Husson and is unsettled by the gesture. At the tennis courts, she bumps into Husson and she asks him questions about Henriette and brothels. Husson mentions to Séverine the address of a high-class brothel at 11 Cité Jean de Saumur. He tells her he'd like to spend time with her -- without her husband being present -- but Séverine rejects his advances.Haunted by childhood memories involving her father, Séverine goes to address of the high-class brothel, leaves, and then enters, meeting Madame Anaïs (Geneviève Page). Reluctant at first, she responds to the \"firm hand\" of Madame Anaïs, who names her \"Belle de Jour,\" and has sex with her first john. After staying away for a week, incurring Madame Anaïs wrath, Séverine returns to the brothel and begins working everyday from two to five o'clock, returning to her unsuspecting husband each evening. One day Husson visits her at home, but Séverine refuses to see him, although she fantasizes about having sex with him in her husband's presence. Having sex as a prostitute allows her to begin enjoying sex with her husband.Husson discovers her secret one afternoon when he comes to the brothel for sex. Séverine at first demands he leave, then offers to have sex with him, but he says he was more attracted to her when he knew she was the wife of a \"Boy Scout\" and declines.A young gangster, Marcel (Pierre Clémenti), visits the brothel and requests Séverine's company. She's attracted by his rough, dangerous manner like that she seeks in her fantasies. Marcel sees her repeatedly and becomes increasingly jealous and demanding of her. When Séverine is gone for a week, vacationing with her husband, Marcel is upset. Séverine decides to leave the brothel and Madame Anaïs' agrees. After one of Marcel's gangster associates follows Séverine to her home, Marcel visits her and threatens to reveal her secret to her husband. Séverine pleads with him to leave, which he does, referring to her husband as \"the obstacle.\"Marcel waits outside for Pierre to return home and shoots him three times. Marcel drives away, but has an auto accident and is killed by the police when he attempts to flee the scene and shoots at the officers. Séverine's husband survives but is left a paraplegic. The police are unable to find a motive for the attempted murder. Séverine takes care of Pierre at home, who is confined to a wheelchair. Husson visits and tells Séverine that he is going to tell Pierre about his wife's secret life. She offers no objection. Séverine fantasizes that her husband recovers and they are happy together."}