{"mid": "Belle", "IMDB_id": "tt2404181", "title": "Belle", "plot": "Dido Elizabeth Belle Lindsay was born in 1761, the natural daughter of Maria Belle, an enslaved African woman in the West Indies, and Captain Sir John Lindsay, a British Royal Navy officer. After the death of Dido's mother, Captain Lindsay takes Dido to England in 1765 and entrusts her to his uncle William Murray, 1st Earl of Mansfield, the Lord Chief Justice, and his wife, Elizabeth who live at Kenwood House, an estate in Hampstead outside London. Lord and Lady Mansfield raise Dido as a free gentlewoman, together with their niece Lady Elizabeth Murray, who came to live with them after her mother died and her father remarried. When the two nieces reach adulthood, the Mansfields commission an oil portrait of their two great-nieces, but Dido is unhappy about sitting for it as she is worried that it will portray her as a subordinate, like other portraits she has seen depicting aristocrats with black servants. Dido's father dies and leaves her £2,000 a year. Lady Elizabeth, by contrast, will have no income from her father, whose new wife has been named his sole heir. Arrangements are made for Elizabeth to have her coming out to society, but Lord and Lady Mansfield believe no gentleman will agree to marry Dido because of her mixed-race status.Lord Mansfield agrees to take a vicar's son, John Davinier, into an apprenticeship for law. In 1783, Mansfield hears the case of Gregson v. Gilbert, regarding the payment of an insurance claim, for slaves killed when thrown overboard by the captain of a slave-ship an event now known as the Zong massacre. Dido helps her uncle with his correspondence and after John tells her about the Zong case, she begins sneaking correspondence to him which he believes will advance the cause of the abolitionists. Lord Mansfield and John have a disagreement on the main issue of the case and John is told not to see Dido again. Didos aunts, Lady Mansfield and Lady Mary Murray, Lord Mansfield's sister, seek to steer Dido into an engagement with Oliver Ashford, son of a scheming grand dame and younger brother to the bigoted James Ashford. At first James is interested in Elizabeth but stops courting her once he finds out she will have no inheritance. Oliver proposes to Dido and she accepts, even though she continues to see John. After James threatens Dido with violence, she tells Elizabeth and says she will give part of her inheritance to her for a dowry so she can find a different match. Lord Mansfield finds out about Dido's visits to John and confronts both of them. During the confrontation, John professes his love for Dido. Sometime later, Dido meets with Oliver and breaks off their engagement.Dido is relieved when the painting is unveiled, showing her as Elizabeth's equal. She tells Lord Mansfield that the portrait commission proves that he can defy convention. Dido sneaks into the balcony of the Inn of Court, so that she can hear Lord Mansfield narrowly rule that the Gregson slave-trading syndicate, based in Liverpool, were not due insurance payments for the loss of slaves during a voyage, when they were thrown overboard by the crew. The ship's officers claimed they ordered this action because they were out of potable water. It appeared to Lord Mansfield that the slaves were over-crowded, making them sick and not likely to fetch a high price at auction, so the officers decided they would be worth more in insurance payments after their loss. Lord Mansfield sees John and Dido outside the Court after his ruling and says that Dido can only marry a gentleman. Therefore, he agrees to resume John's apprenticeship in law, so that he can become a gentleman.On-screen text informs the viewer that Dido and John married and had two children, that Elizabeth also married and had children, and that the painting hung at Kenwood House until 1922, when it was moved to Scone palace.© Wikipedia"}