{"mid": "BeMyValentineCharlieBrown", "IMDB_id": "tt0072687", "title": "Be My Valentine, Charlie Brown", "plot": "Linus is fond of his teacher, Miss Othmar. To prove his point, he buys her a huge heart-shaped box of chocolates. However, Violet warns him it is probably not smart to fall in love with a teacher. But Linus says that he is fond of the ground she walks on. When he leaves Sally believes that Linus bought the candy for her, and decides to make him a valentine in return. Later, Lucy goes to a puppet show held by Snoopy. At the concession stand, Lucy asks for popcorn. However, because Snoopy cannot understand Lucy he gives her candy, then soda, and finally (as having been requesting all along) popcorn. With Charlie Brown narrating the show, Snoopy tells a story about true lovers that is a little too interactive for Lucy's taste.\nValentine's Day then comes and the gang brings valentine cards for everybody. At Birchwood School, Schroeder explains a box labelled \"VALENTINES FOR THOSE WE LOVE\" with a slot for putting the cards in. Charlie Brown brings a briefcase hoping he will get lots of valentines. However, after the cards are passed out, it turns out Charlie Brown got none except for a very small candy heart reading \"Forget It Kid.\" Linus also never gave his candy to Miss Othmar because she left with her boyfriend. Sally who still believes the box of candy is for her, is dismayed when he attempts to go after the teacher to give her the candy. Charlie Brown and Linus vent their heartbreak in different ways: Linus throws his chocolates off a bridge (\"This one is for love! This one is for valentines! This one is for romance...!\"), not knowing that Snoopy and Woodstock are under it, catching and eating every chocolate he throws off; Charlie Brown kicks his mailbox, only to have Snoopy pop out of it and kiss him. (\"I hate Valentine's Day!\" Charlie Brown says). The next day, Violet gives Charlie Brown a used valentine (she struck her own name from it) as an apology, despite Schroder berating her for dropping by the day after Valentine's Day and acting out of guilt. (\"Don't listen to him; I'll take it!\" Charlie Brown says). As Charlie Brown and Linus meet at the brick wall later, Charlie Brown expresses hope that Violet's pity valentine will start a trend, and he will get even more valentines the following year."}