{"mid": "Ben10RaceAgainstTime", "IMDB_id": "tt1037011", "title": "Ben 10: Race Against Time", "plot": "Taking place after the series, the story opens in Bellwood as a mysterious black figure appears and immediately starts destroying things. Ben Tennyson (Graham Phillips), in the form of Heatblast (voiced by David Franklin), confronts him. After a short battle, Ben seemingly obliterates the villain, which is strange considering it was way too easy.\nThe next day, Ben goes back to school, and has trouble adjusting to normal life again. After a bad day he gets bullied by Cash (Tyler Patrick Jones) and JT (Tyler Foden) and two girls he tried to flirt with earlier in the movie resulting in Greymatter (voiced by Carlos Alazraqui) getting his revenge on the bullies by causing complete chaos at the diner where Ms. Dalton (Aloma Wright) works. Later he and Gwen Tennyson (Haley Ramm) go over and reveals the same villain Ben defeated earlier. Max Tennyson (Lee Majors) identifies him as Eon (Christien Anholt), an alien called a Chronian from an unknown dimension, who the Plumbers captured almost two centuries ago. When he arrived, he was half dead and brought a device with him called the Hands of Armageddon, which would open a time rift to his home dimension and unleash his race upon Earth if activated. They travel to the containment facility where Eon is supposed to be kept in suspended animation, only to find it empty and his guard aged to near-death. The guard tells Max not to let Eon find the hardware store, where the Hands were kept. Before he dies, the Plumber warns Ben that Eon is after him.\nTraveling back to Bellwood, Max takes Ben and Gwen to the location of the Hands of Armageddon, guarded by the few remaining Plumbers ranging from Ms. Dalton, Mr. Hawkins the Postman (Jeff Jensen), Fire Chief Whittington (Michael Runyard), Principal White (Robert Picardo), Mrs. Carlay the Plant Caregiver, Mr. Jenyx the Telephone Company Worker, and Mr. Enguells the Sanitation Worker. Eon has followed them and breaks into the facility, but cannot activate the device. When Ben attempts to use the Omnitrix, it malfunctions glowing bright purple and burning giving Ben intense pain. Eon attempts to kidnap Ben, claiming it to be a rescue, but Ben escapes. Eon manages to corner Ben, explaining that his race learned to control time itself, but trapped themselves by misusing their power. He claims that his fate is intertwined with Ben's. Eon is scared off by an old man who happens to be another Plumber before he can elaborate. Grandpa Max decides it would be best for Ben to leave Bellwood so that Eon won't find him, but Ben bravely refuses and they both come to a deal where Ben will be monitored daily by a Plumber in disguise. The Plumbers, all around town, guard Ben around the clock. When Ben goes to the school gym to be alone, Principal White attempts to calm Ben's fears just when Eon freezes then reverses time as he throws White out of the way. Eon then tries to show Ben his future by disabling the Omnitrix. However, Ben sets off the fire alarm, strikes Eon in the side, and breaks out of his grasp. This time, Ben is able to become Diamondhead (voiced by Daran Norris) and fights him off. Later that night, Ben decides to lure Eon into a trap by purposefully leaving himself open, but this backfires and he is captured, along with Gwen and Max after the Rustbucket is destroyed.\nAt the Plumber facility storing the Hands of Armageddon, Eon explains some of the background of the Omnitrix: Ben can only remain in his alien forms for ten minutes at a time, a fail-safe to prevent them from overwhelming his human self and personality with the forms own. He also reveals that he is an evil version of Ben from an alternate timeline, which Max admits he never wanted Ben to figure out. Eon knows how to deactivate the fail safe, and in doing so, can turn Ben into a Chronian. This is because the Hands need the energy of a young Chronian, which is why he kidnapped Ben. He does so, Eon presses the Omnitrix that is glowing bright purple and turns Ben into a younger clone of him. Meanwhile, Principal White has gotten out of the nurse's office and finds the imprisoned Plumbers. When trying to find the key to that room, they point to the button near the door which freed them all. Gwen and Max manage to free themselves. While Max tries to disable the Hands of Armageddon at the cost of his own life, Gwen reaches to Ben inside young Eon. Ben successfully overcomes Eon, and with the help of the other Plumbers, manages to save Max and disables the time rift, sending Eon's race back to their own dimension.\nJust when it seems like they've won, time stops for everyone but Ben. The older Eon reappears, angered at Ben's victory. After Ben points out that the Hands and Eon's world is gone, Eon throws Ben across the room in fury. Ben transforms into Wildmutt and fights him off, eventually knocking him into the Hands of Armageddon, destroying both the Hands and Eon. After doing an impromptu magic trick for the school talent show and getting second place, using Wildmutt's timely de-transformation and a well placed stage curtain, Ben finally accepts being just Ben for a while and go for pizza. Max says that it's probably a good idea to put away the Omnitrix for the time being. Max also points out that aliens are persistent, and as they walk off into the night, an alien ship flies towards Earth."}