{"mid": "BendItLikeBeckham", "IMDB_id": "tt0286499", "title": "Bend It Like Beckham", "plot": "Jesminder \"Jess\" Bhamra (Parminder Nagra) is the 18-year-old daughter of Punjabi Sikhs living in Hounslow, London. Juliette \"Jules\" Paxton (Keira Knightley) is the same age and the daughter of a native English family. Jess is infatuated with football, but because she's a woman, her family won't let her play. However, she sometimes plays in the park with boys including her best friend, Tony (Ameet Chana), a closet homosexual.\nWhilst on a jog through the park, Jules discovers Jess's skills, befriends her, and invites her to try out for the local women's football team, the Hounslow Harriers coached by Joe (Jonathan Rhys Meyers). Jess is extremely happy and excited about the tryouts, even though Joe is skeptical about a new player joining the team. After seeing Jess's skills, Joe accepts her on the team and Jess lies to Joe about her parents being cool with the idea.\nHer parents eventually discover that Jess has been playing football behind their backs, Jess's parents (Anupam Kher and Shaheen Khan) become more strict and forbid Jess from playing any more matches. The elder Bhamras are also distracted by their elaborate wedding plans for Jess's older sister, Pinky (Archie Panjabi). Thanks to Jess and Jules's skills, the Harriers reach the finals of the league tournament. Unfortunately, the final and Pinky's wedding are on the same day.\nJoe pleads with Mr. Bhamra to allow Jess to play, but Mr. Bhamra refuses, revealing that he doesn't want Jess to suffer the same way he did when he was kicked out of the cricket club because of him being Indian. Jess develops an attraction toward Joe, and when the team plays in Hamburg, Germany and goes out clubbing, they're caught about to kiss by Jules, who also has a crush on Joe, souring Jess and Jules's friendship, as Jules is adamant she'd told Jess about her crush. When Jess goes to Jules's house to try to patch up their friendship, Jules's mother (Juliet Stevenson) is misled and thinks they're hiding a lesbian relationship.\nJoe accepts that Jess isn't allowed to play, and the final begins without her. But halfway through Pinky's wedding, Tony convinces Mr. Bhamra to let Jess go. He agrees, and Tony drives Jess to the game, where the Harriers are losing 1–0 with half an hour left. Jess and Jules tie the score, and when Jess is awarded a free kick, she must bend the ball around the wall of players to score. She succeeds and the Harriers win the tournament. Jess and Jules are offered scholarships at Santa Clara University in California, which Jules tells her parents immediately, whereas Jess has trouble telling hers. Jules and her mother arrive at the wedding so that Jules can celebrate with Jess. When Mrs. Paxton accuses Jess of being a hypocrite and a lesbian, Jules grabs her mother and runs off in shame.\nJess still hasn't told her parents about the scholarship. Tony decides to lie to the family and tells them he's engaged to Jess as long as she gets to go to any college she wants. Jess reveals the lie and her mother blames Jess's father for allowing her to play. Jess's father convinces her mother to accept Jess's wishes after telling her he doesn't want Jess suffering as he did. Jess flees to the football field to tell Joe of her parents' decision. The two almost kiss, but Jess pulls away, saying her parents would object, and that although they had come far enough to let her go to America to play, she doesn't think they would be able to handle another cultural rebellion from her.\nOn the day of Jess and Jules's flight, Jules's mother gives her daughter a football jersey and wishes her good luck. The two are about to board the plane when Joe arrives and confesses his love for Jess. The two kiss and Jess agrees to sort out their relationship (and her parents) when she returns for Christmas. While at the airport, they see David Beckham with his wife Victoria, which Jules takes as a sign. Jess and Jules send their parents a team photograph, and it is revealed that Pinky is pregnant. Mr. Bhamra practices cricket with Joe's help."}