{"mid": "BennyAndJoon", "IMDB_id": "tt0106387", "title": "Benny & Joon", "plot": "As adults, Benjamin \"Benny\" Pearl (Aidan Quinn) and his mentally ill sister Juniper \"Joon\" Pearl (Mary Stuart Masterson), live together following the accidental death of their parents. Benny's friend Mike (Joe Grifasi) has his cinephile cousin Sam (Johnny Depp) staying with him. Joon joins a poker game at Mike's that Benny is unaware of, and loses a bet that commits Sam to live with the Pearls. Benny is at first outraged, but after an evening with Sam at the local diner and then coming home the next day to find Sam has cleaned the house, Benny decides Sam should be Joon's \"housekeeper\" since her other housekeepers had been scared away by Joon's outbursts.\nJoon aids an illiterate Sam when he is struggling with writing to his mother, and the two go to the local diner where Ruthie (Julianne Moore) is working. She takes them on an errand, and then takes them home. After Ruthie stays for dinner, her car won't start, and Benny drives her home, where they set a dinner date. Meanwhile, left alone, Joon and Sam kiss. Benny and Ruthie have a fun date, but it ends abruptly because Benny wants to get home to Joon. Sam goes to a video store to try and apply for a job there. Benny, Joon and Sam go to a park where Sam starts doing Keatonesque tricks with his hat, attracting an appreciative crowd. Benny stays at the park to reflect and sends Joon home with Sam, where they make love. Sam then tells Joon he loves her which Joon reciprocates.\nBenny tries to persuade Sam that he could do more with his life than be Joon's housekeeper and persuades a buddy to let Sam audition. When Benny makes suggestions to Sam about his comedy routines, Joon becomes agitated and makes Sam explain that he and Joon are romantically involved. An angry Benny throws Sam out of the house, yells at Joon, and shows her a pamphlet about a group home that Dr. Garvey (C.C.H. Pounder) thinks would be a better home for her. Joon starts hitting Benny and screaming \"I hate you!\", and he pushes her away. Feeling bad, Benny leaves to get her some tapioca. While Benny is away, Sam arrives. They pack suitcases and get on a bus, but Joon soon begins to hear voices in her head and argues with them, in great distress. Sam tries to soothe her, but she continues to become more agitated. The bus is stopped, and two men with the ambulance service restrain Joon. When Benny arrives at the hospital, Dr. Garvey tells him Joon doesn't want to see him. He finds Sam in the waiting room, and they argue. Sam who told Benny that he became a different person, goes to stay with Ruthie, who is an apartment manager. At that point, Benny begins to feel guilty about his treatment towards Joon.\nBenny discovers Sam, now working at the video store and asks for his help. They go to the hospital. Benny apologizes to Joon for his behavior and persuades her to consider getting her own apartment and convinces her that Sam has come back for her. While being interviewed by Dr. Garvey, Joon sees Sam swinging on a platform outside her window and waving, and she states that she would like to try living in her own apartment. Dr. Garvey agrees to try out her choice. Benny and Joon reconcile, and Sam and Joon are reunited upon her release. At the end, Benny brings roses to Ruthie. He takes another bouquet upstairs to Joon's apartment but smiles and leaves the flowers in the doorway when he discovers Sam and Joon together contentedly making grilled cheese sandwiches with a clothes iron."}