{"mid": "Bereavement", "IMDB_id": "tt1100051", "title": "Bereavement", "plot": "Martin Bristol, a young boy with congenital analgesia, is kidnapped by psychotic Graham Sutter. At his farmhouse, Graham cuts Martin's cheek then proceeds to butcher a captive young woman in front of him. Martin attempts to escape and makes a run for freedom, but Graham catches him and returns him to the farmhouse, where he continues to hold him and future female victims captive.\nOver the next five years, Graham brutally butchers several young women forcing Martin to watch. Graham is seen throughout the film talking and arguing with a skull of a bull hung on his wall of the farmhouse.\nAllison comes to live with relatives in the town where Graham is committing his crimes. While out for a run, she sees Martin from the window of the supposedly abandoned farmhouse. During her run she is almost hit by a truck and falls on the road. There she meets a local teenager, William, and the two bond and form a relationship of sorts. One night, her uncle Jonathan discovers her about to have sex with William and intervenes.\nThe next day, Allison goes to the farmhouse after again seeing Martin in the window and is captured by Graham. When Allison doesn't return home, Jonathan gets concerned and drives to the farmhouse in search for her, but is killed by Graham. William drives by and sees Jonathan's abandoned car and becomes curious. He investigates and discovers Allison trapped inside a locked meat room, but he is also killed by Graham. Allison manages to escape and rescue a mute, blood-covered Martin.\nMeanwhile, Graham takes Jonathan's body to his home where he kills Jonathan's wife, while their young daughter hides upstairs. Allison arrives at the house just as it has been set on fire by Graham. She stabs Graham twice as he was about to kidnap her young cousin, and he flees. As Allison calls the police, she is stabbed in the stomach repeatedly by Martin, who has now inherited Graham's psychopathic behavior. Martin goes upstairs to Allison's cousin, and her scream is heard. The house burns down. Martin returns to the farmhouse and kills Graham with an axe. The next morning, the authorities arrive at the smoldering ruins of the house, where the Millers' beagle is the only survivor.\nMartin uses bones from Graham's remains to construct a skeletal shrine in the farmhouse, using the bull skull as the head. Martin is then seen staring out the window, waiting for his next victim.\nIn a post-credit scene set five years later, a young girl (Courtney Harrison from Malevolence), flees from an unseen pursuer. She enters the farmhouse and discovers an adult Martin sitting at a table. When she asks for help, Martin turns around with a deranged look and the film ends."}