{"mid": "BeyondTheBlackRainbow", "IMDB_id": "tt1534085", "title": "Beyond the Black Rainbow", "plot": "In the 1960s, Dr. Arboria founded the Arboria Institute, a New Age research facility dedicated to finding a reconciliation between science and spirituality, allowing humans to move into a new age of perpetual happiness. In the 1980s, Arboria's work has been taken over by his protégé, Dr. Barry Nyle. Outwardly a charming, handsome scientist, Nyle is in fact a psychopath who has been keeping Elena, a young girl, captive in an elaborate prison that doubles as a hospital beneath the Institute. Elena demonstrates psychic capabilities, which Nyle can suppress, using a glowing, prismatic device.\nIn an effort to understand Elena's abilities, Nyle subjects her to daily therapy sessions, which take the form of interrogations, during which Elena only communicates by way of telepathic demands to see her father. By night, Elena is kept in a brightly lit, completely white room, with only a television for companionship. Nyle spends his own nights at home with his wife, a docile, servile woman who gives Nyle endless praise and exists in a state of constant stupor. Nyle takes massive quantities of prescription medication and disguises his complete lack of hair and the color of his irises by way of an elaborate wig and contact lenses.\nAttempting to elicit an emotional response from Elena, Nyle speaks to her about her dead mother, who he calls \"beautiful\" and \"desirable\". He then hints to her that a photo of her mother might be in her room. Later she discovers the photo under her bed.\nThat evening, Margo, (a nurse or orderly who works with Elena), is about to go home when she discovers Nyle's case notes on Elena in a wall cavity. In it are strange symbols and images that indicate Nyle's violent sexual obsession with Elena. Fearful of what the notes contain, Margo puts the notes back. Soon afterwards, Nyle receives a phone call and rushes back to the Institute where he discovers ash from Margo's cigarette near the case notes. Nyle takes a psychedelic drug to calm himself.\nSuspicious of Margo, Nyle informs her the next day that Elena has somehow smuggled contraband into her room. When Margo attempts to forcibly take the photograph from Elena, Elena kills her by psychically crushing her head. Nyle, monitoring Elena's actions, is intrigued by this blatant display of psychic ability and pleased at Margo's death. He allows Elena to leave her cell, then activates the prism, causing her to convulse and pass out. While unconscious, Elena is approached by a massive entity in a red space suit (identified as a \"Sentionaut\"), who injects her with a syringe before walking off.\nNyle goes to see Dr. Arboria, now aged, somewhere on the grounds of the Institute. Displaying signs of senility, Arboria remains either ignorant or indifferent of Nyle's psychosis, regarding him as his best protégé. A flashback to 1966 reveals that Elena's mother was Dr. Arboria's wife, who was present when Arboria himself led a young Nyle through a procedure meant to allow him to achieve transcendence. As a part of the procedure, Nyle was submerged in a vat of black liquid, providing him with hellish, otherworldly visions; Nyle emerged from the vat insane, fatally attacking Mrs. Arboria. An unperturbed Dr. Arboria is shown submerging the infant Elena in the black liquid. Back in the present, Nyle kills Arboria by administering a drug overdose.\nNyle returns home and presents himself to his wife without his wig or contacts and tries torturously to explain his inner pain to her before crushing her head. Meanwhile, Elena makes her torturous escape from the Aboria Institute, encountering a zombie-like \"mutant\" which attempts to eat her in an air shaft as well as an entire room full of Sentionauts, who are suspended immobile in a large, factory-like chamber. Nyle, having dissolved his final contact to the material world, collects a ceremonial dagger he calls \"The Devil's Tear-Drop\", and heads out in pursuit of Elena. While chasing her through the woods surrounding the Institute, he encounters a pair of \"heshers\", who he kills with his dagger after insisting one of them had sex with Elena.\nNyle eventually corners Elena in a clearing and repeatedly implores her to \"Come to me\". Elena uses her psychic abilities to keep Nyle's feet planted in the ground. Trying to leap forward, Nyle flings his head fatally onto a rock. Free of her captor, Elena follows the light generated by a television set to a nearby town. Following the credits, the camera focuses on an action figure of a Sentionaut lying on a carpet. A voice can be heard, recorded in reverse, before the film ends. Played in reverse, the voice says \"I've lost visual contact. Do you read? Repeat, do you read?\""}