{"mid": "BicentennialMan", "IMDB_id": "tt0182789", "title": "Bicentennial Man", "plot": "A character named Andrew Martin requests an unknown operation from a robotic surgeon. However, the robot refuses, as the operation is harmful and violates the First Law of Robotics, which says a robot may never harm a human being. Andrew, however, changes its mind, telling it that he is not a human being.\nThe story jumps to 200 years in the past, when a robot with a serial number beginning with \"NDR\" is brought to the home of Gerald Martin (referred to as Sir) as a robot butler. Little Miss (Sir's daughter) names him Andrew. Later, Little Miss asks Andrew to carve a pendant out of wood. She shows it to her father, who initially does not believe a robot could carve so skillfully. Sir has Andrew carve more things, and even read books on woodwork. Andrew uses, for the first time, the word \"enjoy\" to describe why he carves. Sir takes Andrew to U.S. Robotics and Mechanical Men, Inc. to ask what the source of his creativity is, but they have no good explanation.\nSir helps Andrew to sell his products, taking half the profits and putting the other half in a bank account in the name of Andrew Martin (though there is questionable legality to a robot owning a bank account). Andrew uses the money to pay for bodily upgrades, keeping himself in perfect shape, but never has his positronic brain altered. Sir reveals that U.S. Robots has ended study on generalized pathways and creative robots, frightened by Andrew's unpredictability.\nLittle Miss, at this point, is married and has a child, Little Sir. Andrew, feeling Sir now has someone to replace his grown-up children, asks to purchase his own freedom with Little Miss's support. Sir is apprehensive, fearing that freeing Andrew legally would require bringing attention to Andrew's bank account, and might result in the loss of all Andrew's money. However, he agrees to attempt it. Though facing initial resistance, Andrew wins his freedom. Sir refuses to let Andrew pay him. It isn't long afterwards that he falls ill, and dies after asking Andrew to stand by his deathbed.\nAndrew begins to wear clothes, and Little Sir (who orders Andrew to call him George) is a lawyer. He insists on dressing like a human, even though most humans refuse to accept him. In a conversation with George, Andrew realizes he must also expand his vocabulary, and decides to go to the library. On his way, he gets lost, and stands in the middle of a field. Two humans begin to walk across the field towards him, and he asks them the way to the library. They instead harass him, and threaten to take him apart when George arrives and scares them off. As he takes Andrew to the library, Andrew explains that he wants to write a book on the history of robots. The incident with the two humans angers Little Miss, and she forces George to go to court for robot rights. George's son, Paul, helps out by fighting the legal battle as George convinces the public. Eventually, the public opinion is turned in favor of robots, and laws are passed banning robot-harming orders. Little Miss, after the court case is won, dies.\nAndrew, with Paul's help, gets a meeting with the head of U.S. Robots. He requests that his body be replaced by an android, so that he may better resemble a human. After Paul threatens legal action, U.S. Robots agrees to give Andrew an android body. However, U.S. Robots retaliates by creating central brains for their robots, so that no individual robot may become like Andrew. Meanwhile, Andrew, with his new body, decides to study robobiology – the science of organic robots like himself. Andrew begins to design a system allowing androids to eat food like humans, solely for the purpose of becoming more like a person.\nAfter Paul's death, Andrew comes to U.S. Robots again, meeting with Alvin Magdescu, Director of Research. He offers U.S. Robots the opportunity to market his newly designed prostheses for human use, as well as his own. He successfully has the digestive system installed in his body, and plans to create an excretory system to match. Meanwhile, his products are successfully marketed and he becomes a highly honored inventor. As he reaches 150 years of age, a dinner is held in his honor in which he is labeled the Sesquicentennial Robot. Andrew is not yet satisfied, however.\nAndrew decides that he wants to be a man. He obtains the backing of Feingold and Martin (the law firm of George and Paul) and seeks out Li-Hsing, a legislator and chairman of the Science and Technology committee, hoping that the World Legislature will declare him a human being. Li-Hsing advises him that it will be a long legal battle, but he says he is willing to fight for it. Feingold and Martin begins to slowly bring cases to court that generalize what it means to be human, hoping that despite his prosthetics Andrew can be regarded as essentially human. Most legislators, however, are still hesitant due to his immortality.\nThe first scene of the story is explained as Andrew seeks out a robotic surgeon to perform an ultimately fatal operation: altering his positronic brain so that it will decay with time. He has the operation arranged so that he will live to be 200. When he goes before the World Legislature, he reveals his sacrifice, moving them to declare him a man. The World President signs the law on Andrew's two-hundredth birthday, declaring him a bicentennial man. As Andrew lies on his deathbed, he tries to hold onto the thought of his humanity, but as his consciousness fades his last thought is of Little Miss."}