{"mid": "BigHouseBunny", "IMDB_id": "tt0042248", "title": "Big House Bunny", "plot": "Needing to get away from hunters, Bugs digs a tunnel and accidentally winds up in Sing Song Prison (a clear reference to Sing Sing Prison; \"No Hanging Around\") and utters his catch phrase \" . As he tries settling himself to his hiding spot, prison guard (later a prisoner) Yosemite Sam (here called Sam Schultz, presumably as a character role, possibly a reference to Dutch Schultz) beats Bugs with a billy club, telling him, \"Trying to pull an escape, 777174, huh?\" To which Bugs replies, \"I'm not 777174 - I'm only 3½.\"\nSam believes that, but he does not believe that Bugs is not a prisoner. Thus, Bugs is arrested, numbered 3 1/2, and is sent to the rock pile (\"My mother told me there would be days like this.\") When Sam smugly tells Bugs that he will be locked up in jail for 50 years, Bugs quickly comes up with an escape plan. He screams that a prisoner is escaping and points into the distance, allowing Bugs to insert his chain ball into a cannon when Sam isn't looking. A few seconds later, Sam fires the cannon to shoot down the \"escaping prisoner\", sending Bugs over the wall to freedom. However, it doesn't take long for Sam to get wise; he drives out of the prison with a police car and recaptures Bugs.\nFor his attempted escape, Sam punishes Bugs by ordering him to be confined in his jail cell. When Sam locks Bugs inside, Bugs pulls a switch so that Sam is tricked into locking himself in the cell and freeing Bugs.\nSam breaks out and holds Bugs at gunpoint, threatening him with solitary confinement for 99 years. Bugs pulls another switcheroo by telling Sam that a real tough person would not use his uniform to intimidate another (\"Eh, you wouldn't be so tough if you weren't wearing that uniform!\"). Accepting the challenge, Sam takes off his police officer suit and aims his fists at Bugs, who has taken off his prison outfit. Bugs quickly admits to Sam that he is tough without his uniform and they redress with Bugs putting on the police uniform and Sam absentmindedly putting on the prison outfit. Bugs blows a whistle and Sam, realizing too late that he's been tricked again, is beaten up by several police officers for trying to escape and thrown into a jail cell.\nInside his cell, Sam throws a tantrum and demands a \"habus corpeas\". Bugs, who is having too much fun with outsmarting Sam to leave, pretends to be a sympathy guard and gives Sam a loaf of bread, which is an \"Ajax Escape Kit\" containing a shovel, pickaxe, jackhammer, and map (\"I'm getting ya out of here, see? I haven't forgotten what you've done for Mary an' the kids, see?\"). Sam starts digging and comes up in what appears to be a jungle but is oversized plants... in the warden's office. The warden scolds Sam for fooling around, gives him a new officer's uniform and dismisses him from his office. Resuming his pursuit of Bugs, Sam chases him up a ladder to the gallows. Bugs escapes through the trap door but Sam accidentally hangs himself. As Sam angrily rants at this latest failure, he is called upon by the warden (\"SHULTZ! OFFICE!\") who is Bugs in disguise. The faux warden tricks Sam into sitting on an electric chair but then his moustache slips off, revealing the ruse. Sam chases Bugs out of the warden's office and around the prison, corners him back into the office and whacks him over the head with his club, only to find that he has clubbed the real warden.\nThe warden furiously warns Sam that he'll be fired if he messes up one more time. Having had enough of Bugs, Sam finds him and orders him out of the prison. Bugs walks out and Sam celebrates, but the warden, having had enough of Sam, arrests and imprisons him for apparently letting a prisoner escape (which is a false pretense since Bugs was never a prisoner to begin with). Sam, back in prisoner garb, groans over his predicament at the rock pile and asks \"I'd like to know what dirty stool pigeon squealed on me\". Nearby, a grinning Bugs acts like a pigeon while standing on a stool."}