{"mid": "BigJake", "IMDB_id": "tt0066831", "title": "Big Jake", "plot": "In 1909, there is a raid on the McCandles family ranch by a gang of ruthless outlaws led by John Fain. They massacre the ranch hands and kidnap \"Little\" Jake, the grandson, leaving a ransom note and heading back for Mexico, where they have been hiding out. Martha, the head of the family, is offered the help of both the state militia and the Texas Rangers in rescuing Little Jake or delivering the ransom. She replies that this will be \"a harsh and unpleasant kind of business and will require an extremely harsh and unpleasant kind of person to see it through.\" In consequence, she sends for her estranged husband, the aging Jacob \"Jake\" McCandles, a near legendary landowner and gun fighter gunfighter who roams the west with his Rough Collie, simply named Dog.\nWhen Jake arrives by train, he and Martha discuss a plan to take the ransom to the kidnappers, a million dollars in a big red strongbox. After looking at the boxes content Jake asks Martha \"Is this the way you want it\" to which she replies \"Yes, these are very dangerous men\". Jake then warns Martha, \"Pay or not, we run the risk of never seeing the boy again\". Then his son Michael rides up on a motorcycle, bringing word that he has seen the kidnappers in the Chilicothe Canyon. Buck, The Texas Ranger Captain, offers the services of his men, equipped with three REO touring cars. Martha agrees to the plan and the Rangers, Michael and Jakes oldest son James set off to ambush the kidnappers. The Rangers however, are ambushed with several killed and their cars put out of action. Jake, preferring the old ways, has followed on horseback, accompanied by an old Apache associate, Sam Sharpnose. Jake and Sam come across the defeated Rangers and Jake chides Buck for risking his Grandson's life. Michael and James are invited by Jake to ride along and they agree although the relationship is tense, especially with James, because of Jakes 10 year absence from the family.\nThat night, Fain rides into their camp to make arrangements for the handover, telling Jake that they will “send the boy's body back in a basket\" if anything should go wrong. Both men deny any personal stake in the business, Fain claims he's \"just a messenger boy\" and Jake truthfully saying he's \"Never laid eyes on him\". The family party crosses into Mexico the next day and checks into a hotel. Knowing that they have been followed by another gang intent on stealing the strongbox, Jake sets a trap for them and the would be theives are all killed. During the attack, the chest is blasted open, revealing newspaper clippings instead of money. Michael and James become suspicious of Jake with James asking \"Where's the money, Daddy?\" Jake takes a punch from each of his sons and returns the favor knocking them out. Afterward Jake informs them it was Martha's and his idea. When James and Michael question Martha's involvement in the decision Jake replies \"There were seven McCandle's people killed, one crippled. Your own brother shot, maybe crippled, maybe even dead and my grandson kidnapped. I ain't gonna pay 'em for that. Neither is your mother\". James fears for Little Jake's life, revealing for the first time to Jake that his grandson is named after him.\nA thunderstorm breaks and Pop Dawson, one of the kidnappers, arrives to give them the details of the exchange. Dawson gives away part of the plan that a sniper will have a gun trained on the boy in case of a double-cross. Jake arranges for Michael to follow after them to take care of the sharp shooter. When questioned by Dawson about Michael's whereabouts Jake tells Dawson they had to pay a price to keep the box suggesting that Michael had been killed in the fight. Dawson objects and Jake tells him he could view Michael's body down at the jail. Dawson knowing they only have limited time to get to the meeting and wary of the law declines and leads them toward the exchange. At the hideout, Jake is told to go in alone to where Fain and four other gang members are waiting, with Will holding a shotgun on the boy. Michael sneaks in with Jake using Jakes horse as cover. At the exchange Jake tosses the key of the chest to Fain telling him \"that's what dreams are made of\". Fain opens the box and is stunned to find it contains the clippings instead of money.\nFain orders his brother Will to kill the boy but Will is shot and killed by Jake. Dog knocks Little Jake off his horse saving him for the moment but is wounded by the sniper. As Jake and the boy run for cover Jake is wounded in the leg by the sniper before Michael kills him. Jake tells the boy to escape and find James, giving him a small Derringer for protection. Michael attempts to climb down from his counter-sniper position on the water tower but accidentally drops his rifle. Little Jake is pursued by the machete wielding John Goodfellow, who had hacked Sam to death but not before Sam is able to wound him with a knife. Goodfellow locates the boy hiding in a haystack but is attacked by Dog who is killed in his attempt to save Little Jake. Big Jake arrives and attempts to shoot Goodfellow but has exhausted his pistols ammunition and resorts to impaling Goodfellow with a pitchfork. Fain rides up and is preparing to finish off the two when Michael arrives after retrieving his rifle and shoots Fain off his horse. Before he dies, Fain asks, \"Who are you?\" When Jake answers, \"Jacob McCandles,\" Fain says, \"I thought you was dead,\" as have other characters during the course of the film. “Not hardly,\" Jake replies.\nWith Little Jake rescued, and the broken family bonded, they prepare to head home."}