{"mid": "BigNothing", "IMDB_id": "tt0488085", "title": "Big Nothing", "plot": "The film is set in a small Oregon town, where a brutal serial killer nicknamed the 'Oregon undertaker' has been murdering and mutilating young women.\nCharlie (David Schwimmer) is an ex-teacher turned disaffected call center employee who is fired on his first day. Distraught at being unable to provide for his daughter Emily and policewoman wife Penelope (Natascha McElhone), he is approached by former colleague Gus (Simon Pegg), an aspiring scam artist who presents Charlie with a seemingly snag-free plan to make some cash: blackmail Reverend Smalls, who is listed in the company database of visitors to illegal porn websites. Gus plans on extorting money from Reverend Smalls, with the intention of publicly exposing his secret shame should he refuse to pay. The normally cautious Charlie reluctantly agrees to play a part in the scam, confident that with the money he will garner from the deal he would be able to support his family. A teenage pageant queen Josie McBroom (Alice Eve), Gus's scheming one-night stand, forces herself into the scheme. Josie convinces Charlie and Gus that she should make the call to Smalls on the grounds that if either of them called, the police could trace their voices and connect them to the job.\nThe plan goes into action, and Gus goes to Smalls' house where he is surprised by the Reverend wielding a gun. From outside the house two shots are heard. At the same time, Charlie arrives at the bar to explain his and Gus' alibi, only to find out that the blind owner of the gas station where Gus has supposedly gone is at the bar celebrating his 80th birthday. Charlie runs away and goes to Smalls' house, where he finds the Reverend dead. Scared, he drags the body outside, and dumps him into a nearby septic tank. He goes back inside the house, tries to call Josie. He then finds Gus and learns that the Reverend shot Gus in the leg, explaining the blood near the corpse. After the first shot, Gus hit the Reverend over the head with a vase, leaving him alive but unconscious. Gus and Charlie leave the house to escape the scene of the crime, but Charlie remembers that he left Josie's card inside. They go back and get it, but in the process Gus stumbles upon a hidden DVD collection of the Reverend. They put one in, and find a video of the Reverend killing and torturing a young girl. They try to flee the house, but are immediately met by a deputy police officer outside the door. The policeman explains that the Reverend was found dead, with three bullet holes in his head.\nCharlie lets in the policeman, who notices some blood on the floor. Charlie, in the kitchen, grabs a knife and cuts himself, and then goes back to the policeman to explain that he cut himself on a vase. Right before leaving, the policeman decides to see what Charlie had been watching, much to Charlie's protests. He presses play, and watches the beginning of a children's movie Gus had secretly switched in. Satisfied, he leaves the house, but finds marks in the ground that look like someone had been dragged. Charlie follows the policeman to the end of the drag marks, the septic tank. As Charlie is about to open it, Gus smashes a vase against the head of the deputy, who is promptly dragged inside.\nInside, Charlie panics about the murder of the Reverend and the kidnapping of a policeman and leaves, where he is met by the Reverend's wife (Mimi Rogers) who has a gun pointed at Charlie. They go back inside, where she explains that she shot the Reverend and that she was going to meet her lover, Max, at the house so they could collect their $2,000,000 the real Reverend had left. Gus and Charlie explain that Max will not be seeing her, and she asks them where the money is, pointing a gun at the tied-up policeman. They frantically try to say that they don't know anything about the money, and right before she is about to shoot the deputy, Josie comes in and lodges an axe in the wife's head. As Charlie and Gus talk over what's been happening, Josie finds the money hidden in the Reverend's oven, and calls Charlie and Gus over. As they are looking at the stacks of hundred dollar bills, they hear cries of \"help\" from outside. The deputy has escaped through the front door, and, rolling himself along, is soon caught by the three. In his rolling, the deputy drops his badge, which Charlie picks up and puts in his pocket. They agree to dispose the body of the wife. The policeman, still alive, asks to use the toilet. Inside, he tries to escape through a window, but slips and kills himself by breaking his skull on the toilet.\nCharlie, Gus, and Josie hide the bodies in suitcases and drive away to dispose them, but soon get into an argument. Charlie reveals that the reason why he has been reeling off random facts is because of a neurological disorder. This problem with the neurotransmitter acetylcholine means that eventually his mind will become blank and explains why he was fired from his teaching position. After driving for a while Charlie realises that Gus, who had originally said he needed the money for his daughter's cornea operation, does not really have a daughter, and punches him. In this small fight, they nearly get into an accident with a fat man, who tries to call the police, but is persuaded by Gus to not do so. Charlie, Gus and Josie drive away and get to their disposal point, only to find that one of the bodies is missing. They drive back and hit the Reverend's wife, who had jumped out of the car and was trying to get help. As they look over the body, two police officers arrive, one of them being Charlie's wife, and quickly see the body. Charlie's wife tries to call her deputy, but it goes to voicemail. Josie hurriedly makes up a story, but the three are taken to the station where a special agent is waiting.\nAgent Hymes (Jon Polito), the fat man the three almost got into an accident with, examines the body with Gus and Josie, seeming to understand the earlier events. However, it turns out not to be the case and he lets them go. In the waiting room, Charlie finds his sleeping daughter, who could not be left alone at the house and was brought by his wife, and gives her his coat. Charlie, Gus and Josie drive to a tar pit, where they plan to dispose of the bodies, but they find that the special agent has been following them. He gets angry at Gus for calling him fat before, and Gus swipes and stabs him with an insulin needle in the foot. The agent throws the gun up, which is caught by Charlie, who then points the gun at the agent. The agent then reveals that Josie is the Wyoming Widow; a murderer who befriended men and killed them with whiskey laced with highly concentrated thallium. She disregards it as nonsense, but Charlie and Gus make her empty her pockets, where they find the tell-tale flask of poisoned whiskey. They make her drink some, and she pretends to die, but soon begins laughing at their foolishness as it is not poisoned. They check for the agent, but as he has disappeared they go looking for him. Gus goes back to the car and tries to hide the money, but is caught by the agent, who complains of his lack of payment for what he does. He shoots Gus twice, killing him, and gets the money. In the mean time, Charlie's wife finds the badge of her deputy in her husband's coat, but drives to a bridge and throws it off, removing the evidence.\nThe agent runs to his car, but is surprised by Josie, who was waiting in the back seat. They make him eat a large sugary lollipop, dangerous because of his diabetes, and leave him for dead. Charlie remarks on what monsters they have become, and is then faced by Josie, who has a gun pointed at his head. She explains that she really is the Wyoming Widow, and then gives him the choice of the bullet or the poisoned whiskey (from her second flask). Charlie tells her not to spend all the money in one place, and drinks the whiskey, dying quickly, but not before he happily sees Josie discover that the bag is filled with nothing but his daughter's stuffed animals. At home, Charlie receives a message on his phone from a publishing firm regarding his book and his dream job and an office. Also, his daughter is seen drawing with marker on some of the hundred dollar bills next to several large stacks of money.\nJosie tries to hitch a ride away from Oregon, and finally gets one from an old man. The old man goes to the back to \"double-check on something\", and Josie takes out the poisoned whiskey. The old man covers a bloody leg with a tarpaulin (where it is revealed he is the Oregon undertaker), and goes back into the truck to drive away with Josie."}