{"mid": "BigTroubleInLittleChina", "IMDB_id": "tt0090728", "title": "Big Trouble in Little China", "plot": "Visalia, California Truck driver Jack Burton (Kurt Russell) wins a bet with his restaurant owner friend Wang Chi (Dennis Dun), and accompanies him to the airport to pick up Wang's Chinese fiancée Miao Yin (Suzee Pai) to make sure he honours the payment. A Chinese street gang, the Lords of Death, tries to kidnap another Chinese girl at the airport who is being met by her friend Gracie Law (Kim Cattrall), intending to sell her as a sex slave. After Jack intervenes, they take Miao Yin instead. In Jack's big-rig truck, he and Wang track the Lords of Death to the back alleys of Chinatown, where they find a funeral procession that quickly erupts into a tong war between the Chang Sing and Wing Kong, two ancient Chinese societies. When \"The Three Storms\" - Thunder, Rain, and Lightning, mighty warriors with weather-themed powers - appear, slaughtering the Chang Sing, Jack tries to escape but runs over Lo Pan (James Hong), a powerful and legendary sorcerer and the leader of the Wing Kong. Horrified, Jack exits his truck, but finds Lo Pan entirely unfazed and glowing with malicious power. Wang hurriedly guides Jack through the alleys; the two escape the carnage and mayhem, but Jack's truck is stolen.\nWang takes Jack to his restaurant, where they meet up with Gracie, Wang's friend Eddie Lee (Donald Li), and magician Egg Shen (Victor Wong), a local authority on Lo Pan. They try to explain to an incredulous Jack some of the ancient knowledge and sorcery the Chinese brought with them to America, eventually devising a plan to infiltrate a brothel, where they think Miao Yin is being held. The infiltration effort is moderately successful, but the Storms interrupt the operation and make off with Miao Yin, taking her to their master Lo Pan. Jack and Wang track down the front business used by Lo Pan and impersonate electricians to gain access, but are quickly subdued by Rain. After being tied up and beaten by Thunder, the two meet Lo Pan - however, he now appears as a crippled old man. Wang tells Jack that Lo Pan needs a special green-eyed girl to break an ancient curse, and he intends to sacrifice Miao Yin. Centuries ago, Lo Pan, a great warrior and even greater wizard, was defeated in battle by the first sovereign emperor Qin Shi Huang. The Emperor placed upon Lo Pan the curse of No Flesh. Although Lo Pan can be temporarily granted a decrepit body by supplication to the gods, in order for him to permanently break the curse and regain his human form, he must marry a woman with green eyes. This simple act will appease Ching Dai, the God of the East. But to satisfy the Emperor, he must sacrifice her. When Jack and Wang's friends attempt to save them, they are also captured, and Lo Pan notes that Gracie has green eyes, too. Lo Pan decides to sacrifice Gracie, while making Miao Yin his unwilling wife. After getting the drop on Thunder, Jack and Wang escape, and free many women kept in holding cells in the process; a horrible orangutan-like monster recaptures Gracie before she leaves.\nWang and Jack regroup with the Chang Sing and Egg Shen, and as a group they enter an underground cavern to return to Lo Pan's headquarters. Egg pours each of the group a potent potion that Jack says makes him feel \"kind of invincible.\" During the wedding ceremony, a huge fight ensues. Jack is largely incapacitated during the battle, first knocking himself out and then getting trapped under an automaton suit of armour. Wang kills Rain in a sword duel, while Jack and Gracie pair up and chase the newly-alive Lo Pan. Wang joins them, and just when all seems lost, Jack kills Lo Pan with a skillful knife throw. Thunder, too distracted by Wang to prevent his master's death, inflates to an enormous size from dishonoured fury, finally exploding and killing himself. Jack, Wang, Gracie, and Miao Yin are cornered by Lightning in a corridor, who triggers a collapse with his powers. Egg rescues them with a rope and kills Lightning by dropping a stone Buddha statue on him when he tries to follow. After finding Jack's truck, the group busts out and escapes back to Wang's restaurant.\nThe group celebrates their victory in the restaurant with the rescued women; Wang and Miao prepare to marry, while Eddie is pairing up with Gracie's journalist friend Margo. Egg sets off on a long-due vacation - Jack suggests his homeland, but Egg says that China is in the heart. Jack, presented with a new life with Gracie, instead bids farewell to the group and hits the open road, not wanting to be tied down. Unbeknownst to him, the orangutan-like monster survived the battle in the labyrinth and has stowed away on his truck."}