{"mid": "BillyMadison", "IMDB_id": "tt0112508", "title": "Billy Madison", "plot": "Billy Madison is the 27-year-old heir to a Fortune 500 hotel company that his father, Brian, has created. He spends his days drinking with friends and creating disturbances across his father's estate. One day, Billy ruins a dinner meeting between his father and his associates by acting obnoxiously. Brian loses confidence in his son and chooses the conniving Eric Gordon as his successor. When Billy begs his father to reconsider his decision, Brian reveals that he secretly bribed Billy's school teachers to give him passing grades. The two finally compromise: Billy must complete all 12 grades in two-week intervals to prove he is competent enough to manage the company.\nShortly after enrolling into school, Billy becomes attracted to a teacher named Veronica Vaughn, who initially ignores him. Nevertheless, Billy successfully progresses through his first two grades. He finds himself as one of Veronica's students in the third grade and earns her respect by standing up for Ernie, his friend and classmate. Billy becomes popular among the third graders and misses them as he advances through school. Billy's progress alarms Eric, who becomes increasingly agitated as Billy completes each grade. Eric blackmails Billy's principal, Max Anderson, into claiming that Billy bribed him for passing grades.\nBrian swiftly terminates his agreement with Billy and renames Eric as his successor. Billy grows distraught and reverts to his carefree lifestyle. Veronica motivates him to return to school, while his grade school classmates convince Max to retract his bribery accusations. Brian agrees to give Billy another chance but Eric cites that Billy failed the challenge by taking more than two weeks to complete a grade. He then threatens to sue Brian if he does not pass the company onto him. Billy intervenes and challenges Eric to an academic decathlon to finally settle their feud.\nBoth men excel in different activities but Billy manages to take a single-point lead before the contest's final event, a Jeopardy!-style academic test. Billy stumbles on the opening question in the event, and Eric is given the chance to win the contest by answering a question about business ethics. Eric is unable to withstand the pressure and breaks down. He brandishes a handgun, but Max tackles Eric before he can harm Billy. Eric recovers from the attack and attempts to shoot Veronica, but he is shot by Danny McGrath, a rifle-wielding madman whom Billy apologized to earlier for bullying him.\nAt his graduation, Billy is delivering a speech. Billy announces he will pass the hotel business to Carl Alphonse, one of his father's more polite businessmen, and attend college in order to become a teacher. Eric watches on and fumes in frustration over Billy's decision."}