{"mid": "BillyLiar", "IMDB_id": "tt0056868", "title": "Billy Liar", "plot": "Billy Fisher (Tom Courtenay) works by day as a clerk in an undertaker's office but lives his dreams in his own imaginary world. He is having such a dream when the film begins in which he is a returning war hero passing through crowds of applauding people. He is soon brought back to reality by his mother's call for breakfast. He sits at the table to eat with his father and grandmother who tell him that he should grow up and live in the real world.Billy arrives late to work and is questioned by his employer, Mr Shadrack (Leonard Rossiter) about the disappearance of a large number of calendars that he was meant to deliver to clients. The calendars are in fact locked away in a wardrobe in Billy's bedroom.Billy is also engaged to not one but two local young women, the sweet and virginal Barbara (Helen Fraser) and the rough and ready Rita (Gwendolyn Watts). Unbeknown to both women, they share an engagement ring. It is the freewheeling Liz (Julie Christie) who has just recently returned from London however that Billy is truly in love with.Billy comes to hear that comedian Danny Boon is making an appearance in town and tries to show him a script that he has written but is quickly dismissed by Boon. Despite this, he still tells people that he is going down to London to write scripts for the comedian.Under pressure, Billy arranges a date on the same night with both Rita and Barbara in the same venue, the local dance hall. It is not long before Billy's double engagement is discovered when Rita sees the ring on Barbara's finger. He quickly makes an exit as a catfight ensues. Whilst on the upper level of the ballroom, he encounters Liz and soon leaves with her. As they are walking outside, Liz asks Billy to accompany her to London that evening. He accepts and heads promptly home to pack his bags. Billy's father (who has been trying to reach him by phone at the ballroom) tells him that his grandmother has been taken to hospital. Billy heads to the hospital en route to the train station where he finds his mother in the waiting area. It is not long after his arrival that they are told that his grandmother has just passed away. Billy tells his mother of his plans to go to London and continues on to the station.He arrives at the station and meets Liz. They board the train and Billy decides to rush back to the station to get them both a carton of milk for the journey. Although hesitant, he moves quickly but just misses the train. A disappointed Liz looks on from the window. The film's final shot sees Billy walking back up a dark and deserted road to the family home."}