{"mid": "BirdsAnonymous", "IMDB_id": "tt0050194", "title": "Birds Anonymous", "plot": "Sylvester is in another chase with Tweety, and is just about to eat him when he is interrupted by his friend Sam, who tells Sylvester to return Tweety to his cage. Sylvester does this, and listens to Sam explain how he can become addicted to birds and \"suddenly, without realizing it, you're a victim.\" Sam gives Sylvester a card linking to an organization called Birds Anonymous, and advises Sylvester to join if he wants to curb his addiction to birds.Sylvester attends a meeting of \"B.A.\" and listens to several cats recount how becoming a member of the organization helped them greatly (one cat even petting a bird on the head). Sylvester proudly tells the club members, \"From now on, my motto is 'Birds is strictly for the birds!'\", leading to rapturous applause.Sylvester returns home, greeting an astonished Tweety on the way in, convinced that nothing is going to tempt him to chase and eat Tweety now. He turns on the television, to discover a show on cooking birds is playing. The program immediately fills him with temptation. He tries to go after Tweety, but slaps himself repeatedly to stop himself. He turns on the radio to try and get his mind off birds, but the radio happens to be playing songs that mention birds in the title (\"Bye, Bye, Blackbird\" and \"When the Red, Red Robin Comes Bob, Bob, Bobbin' Along\", to be specific). Sylvester then handcuffs himself to a radiator so he is unable to get at Tweety. This prompts the yellow bird to ask Sylvester, \"Don't you like me anymore?\" This drives Sylvester into an insane rage, and he snaps away from the radiator and captures Tweety. Before Sylvester can eat him, Sam intervenes and fires a plunger into Sylvester's mouth. He apologizes, but admits it was necessary because Sylvester seemed to be weakening.That night, Sylvester is completely unable to sleep because of his obsession with birds. He snatches Tweety again, convincing himself that just one more bird would be okay before he quits. Sam stops him by pouring alum into his mouth, causing his mouth to pucker up. Sylvester then tries to suck Tweety through a straw, but the straw breaks. Sylvester then breaks down in tears, pounding on the floor and screaming, \"I gotta have a bird!\" Sam attempts to lecture Sylvester on how cats and birds can live together, and proves his point by kissing Tweety. However, upon doing this, his allegedly quashed desire reawakens, and laughing maniacally, attempts to eat Tweety. Sylvester restrains Sam, holding him down and yelling at him to control himself. Tweety, watching all of this take place from a distance, remarks, \"Like I said before-- once a bad ol' putty tat, always a bad ol' putty tat.\" Iris out."}