{"mid": "BirdemicShockAndTerror", "IMDB_id": "tt1316037", "title": "Birdemic: Shock and Terror", "plot": "Rod (Alan Bagh) is a young software salesman living a successful life in Silicon Valley. He meets up with old classmate and aspiring fashion model Nathalie (Whitney Moore) and begins dating her. Things go well for the couple, with Rod receiving a large bonus that he uses to start his own business, while Nathalie is chosen as a Victoria's Secret model. As they grow closer, the couple remains oblivious to signs of something going wrong around them, such as unexplained wildfires and the carcasses of diseased birds turning up on beaches.\nAfter consummating their relationship in a motel, Rod and Nathalie wake up to find that their town is under attack from eagles and vultures. The birds spit acid and explode into flames upon striking the ground. On the DVD commentary, the director explained that was because they became mutated and toxic due to global warming. Rod and Nathalie escape from the motel by joining up with an ex-Marine named Ramsey (Adam Sessa) and his girlfriend Becky (Catherine Batcha). As they leave town, they rescue two young children, Susan (Janae Caster) and Tony (Colton Osborne), whose parents have been killed by the birds.\nThe group proceeds to drive from one town to the next, fending off more bird attacks along the way and briefly meeting a scientist named Dr. Jones (Rick Camp) studying the phenomenon. Becky is killed by the birds. Ramsey tries to save a busload of tourists. As they leave the bus, Ramsey and the tourists are killed by acid that is dropped by the birds. Nathalie stops Rod from attempting to rescue Ramsey because she feared the birds will kill him, too.\nRod, Nathalie and the kids continue to flee from the birds, driving into a forest where they briefly meet a \"Tree Hugger\" named Tom Hill (Stephen Gustavson), who talks to them about the dangers of global warming. On the DVD commentary, the director explained that the birds were attacking people in retaliation for global warming, and that they were targeting gas stations and cars, since they burn carbon dioxide [sic]. After escaping a forest fire, the quartet ultimately settles on a small beach, where Rod fishes for dinner. As they prepare to eat, they are attacked by the birds, but then doves appear and all the birds leave in peace. The film ends as Rod, Nathalie and the kids watch the birds fly off into the horizon."}