{"mid": "BlackSunday", "IMDB_id": "tt0075765", "title": "Black Sunday", "plot": "Dahlia Iyad, an operative from the Palestinian terrorist group Black September, arrives in Beirut where she meets with Black September operatives in a safe house outside the city where she informs them about her plan for the upcoming \"operation\" in the USA to be carried out in two months the following year in the month of January. That same evening, a group of Israeli Mossad counter-terrorist commandos under the command of Major David Kabakov, arrives in Beirut from an Israeli spy ship and travel to raid the safe house. They kill most of the Black September operatives, but Kabakov backs down from shooting Dahlia when he finds her in a bathroom shower, mistakenly thinking that she might be an innocent call-girl. The Israelis take many files as well as an audio tape that Dahlia just made accepting responsibility for an upcoming attack in America at the start of the next year. Kabakov and the commandos set explosive charges around the house and detonate them before retreating back to their ship. Dahlia and a few operatives manage to escape.The film then switches to Los Angeles, several weeks later where Michael Lander is introduced. Lander is a pilot who flies the Goodyear Blimp over National Football League games to film them for network television. Secretly deranged by years of torture as a prisoner of war in Vietnam, he had a bitter court martial on his return and a failed marriage. He longs to commit suicide and to take with him as many as possible of the cheerful, carefree American civilians he sees from his blimp each weekend. Dahlia arrives in Los Angeles where it is revealed that she is his handler who has conspired with him to launch a suicide attack using a bomb composed of plastique and a quarter million steel flechettes, housed on the underside of the gondola of the blimp, which they will detonate over the Miami Orange Bowl during Super Bowl X. Dahlia and Black September, in turn, intend the attack as a wake-up call for the American people, to turn their attention and the world's to the plight of the Palestinians.Meanwhile, agent David Kabakov travels to Washington DC where he meets with Federal Bureau of Investigation agent Sam Corley, where they race to prevent the catastrophe. After discovering the audio recording Dahlia made, meant to be played after the attack, Kabakov and Corley try to piece together the path of the explosives into the country, and Dahlia's own movements.Lander and Dahlia don masks and travel to a cargo ship in Long Beach harbor where they pick up the shipment of plastic explosives that they intend to use to detonate the bomb and flee from the harbor police after a wild chase. Kabakov and Corley arrive in Los Angeles after learning about the incident and Kabakov questions the captain from the cargo ship who tells them about an unknown man and woman purchasing the explosives. However, the ship's captain is killed by a bomb left behind by Lander in which Kabakov is wounded. At the hospital, Dahlia arrives where she attempts to murder Kabakov but is forced to retreat after she kills Kabakov's friend and Mossad agent, Robert Moshevsky, who attempts to stop her.After recovering, Kabakov questions Muzi, a dockside owner, about the movements of the cargo ship's origins from Libya to Hong Kong. Kabakov then travels back to Washington where he secretly meets with a Russian KGB informant, named Colonel Riat, who researches and gives him the history and identity of Dahlia.Back in California, Dahlia and Lander travel by plane to a remote desert airfield where Lander conducts a \"dry run\" of the plan by detonating a small explosive device to test the steel darts and killing a park ranger who happens by. Lander's giddy reaction to the destructive force of the darts effectiveness unnerves Dahlia, but she says nothing.Dahlia drives the completed bomb from Los Angeles to Miami where she hides it in a storage facility by disguising it as a small motorboat and leaves it there before driving back to Los Angeles. When she learns from Lander that her identity has been discovered, she considers calling off the plan. But Lander persuades her to continue it by rambling about his determination to carry it out.When Dahlia was spotted in Miami during her brief stay there, Kabakov and Corley fly out to Miami where they attempt to arrest a certain Mohammed Fasil whom Dahlia met to discuss the final stages of the attack. Kabakov attempts to arrest Fasil but he runs and guns down several policemen forcing Kabakov to kill him. A search of Fasil's hotel room leads Kabakov to finally realize that the upcoming Super Bowl is the target for the Black September attack. At the same time, Dahlia and Lander arrive in Miami and easily evade the lax police screenings to set up the final stages of the plan. When Lander discovers that he has been replaced as the pilot of the blimp, Dahlia murders the pilot in his hotel room so that Lander can take his place.On the day of the Super Bowl, Kabakov and Corley survey with the local security detail in the Orange Bowl stadium as the football game gets underway. Lander arrives at the airfield where he tells the blimp crew (whom already know him) that he has been hired as the replacement pilot. Taking the blimp up and circling the stadium as usual, Lander starts a fire in one of the blimp's engines forcing it to return to the airfield for repairs. At the same time, Dahlia picks up the bomb from the storage docks and drives it to the airfield. At the Orange Bowl, Kabakov learns over his radio about the police finding the dead body of the blimp pilot in his hotel room. He frantically races to locate the blimp which flies off and finally figures out that the replacement pilot, Lander, is the terrorist collaborator with Dahlia.When the blimp returns to the airfield, Dahlia arrives with the bomb where, in the confusion, Lander tricks the ground crew into hooking up the bomb to the underside of the blimp's gondola. Lander is forced to kill the ground foreman who receives a phone call from the police who tell him to detain Lander. Dahlia and Lander are forced to hijack the blimp by opening fire with sub-machine guns at the ground crew and the police. After throwing out all the camera equipment from the overweight blimp so they can take off, Lander and Dahlia set off just as Kabakov and Corley arrive at the airfield to see the blimp flying away. Kabakov and Corley commandeer a civilian UH-1 Huey helicopter to chase the bomb-carrying blimp as it approaches the stadium. With Lander flying the blimp, Dahlia provides covering gunfire as she fires and shoots down a police helicopter and damages the helicopter carrying Kabakov and Corley who is slightly wounded. By ordering the chopper pilot to make some evasive moves, Kabakov then opens fire on the blimp gondola, killing Dahlia, mortally wounding Lander, destroying the detonator and damaging one of the blimp's engines. But Lander defiantly continues to fly the blimp and prepares a backup fuse to detonate the bomb.Kabakov lowers himself from the helicopter onto the blimp's tail just as it crashes into the stadium creating panic and chaos just as Lander lights the backup fuse. Kabakov manages to hook up the blimp's tail to the lowered cable wire and the helicopter literally hauls the heavy blimp out of the stadium and over Miami Bay. Kabakov releases the blimp and hoists himself back on the tow wire where the helicopter safely flies away with him seconds before the blimp blows up, and the thousands of steel darts harmlessly rain into the water."}