{"mid": "BlackSea", "IMDB_id": "tt2261331", "title": "Black Sea", "plot": "Robinson (Jude Law), a veteran captain of under-sea salvage who is recently divorced and estranged from his young son, receives news that he is to be made redundant. He receives £8,640 for his services and is asked to clean his desk and leave the premises.\nLater, while having a drink with some former colleagues, Robinson meets up with his friend Kurston and a Russian called Blackie (Konstantin Khabensky). Kurston informs the duo of an idea to make money. He tells them about a German Type VIIC U-boat from World War II that sank off the coast of Georgia with a cargo of gold worth millions and how their former employer found the U-boat's location but was unable to salvage it due to the Russo-Georgian War. He also informs them both of a plan he has been working on to secretly recover the gold. After meeting with Kurston, Robinson agrees to meet with an unknown backer called Lewis.\nLewis agrees to fund Robinson's expedition on the grounds he receives a 40% split of the proceeds up to $40 million, a 20% cut on any amount above that, and that his executive Daniels (Scoot McNairy) accompany the expedition. Robinson agrees to the deal. Upon returning home Robinson finds a youth, Tobin, who notifies him of Kurston's suicide and indicates they were friends. Robinson takes the young man in and decides to bring him along on the expedition, and acquires a Foxtrot-class submarine from the Port of Sevastopol. The crew is 50% Russian and 50% British and almost immediately there are issues between the two groups. Only Blackie speaks Russian and English and the Russians view the young Tobin as a bad omen, mistakenly assuming he is a virgin when he is in fact an expecting father.\nDue to the close confines, tension begins to mount between the two crews. Robinson makes the decision to split the take equally between each crewman. Due to the mounting pressures the crew fall out and there is a fight leading to Fraser (Ben Mendelsohn) losing his head and stabbing and killing Blackie. In the ensuing scuffle a fire breaks out and the sub is damaged leading to an explosion which knocks Robinson unconscious and kills at least 2 men.\nRobinson wakes up 18 hours later to find tensions at breaking point. The Russians have taken over half of the ship with the British in the other half. The ship is also badly damaged and they have no means to speak with the Russians as Blackie was killed. The sub's drive shaft is damaged but they discover they are close to the old U-boat and may be able to transfer its drive shaft and save the ship. Tensions continue to mount but Robinson discovers Morozov (Grigoriy Dobrygin) speaks English.\nRobinson sends Tobin with Fraser and another diver to recover the drive-shaft and the gold. While making their way back, third diver (David Threlfall) perishes when his air hose gets cut. Through Morozov they manage to get the Russians to install the drive-shaft and get the sub moving again. At this stage Daniels admits to Robinson that his prior employer set them up such that they are being used to do the dangerous work, while the employer waits to seize the gold as soon as the submarine surfaces. Robinson then decides to remain submerged and travel to Turkey, to try to keep the gold and avoid arrest. Furthermore, he decides they will attempt a risky navigation through a narrow channel, against the wishes of the crew. Meanwhile Daniels persuades Fraser to murder Zaytsev thus forcing Robinson's hand, since there are no longer enough men to safely operate the sub. At this point a second fire and explosion sends the sub back to the seafloor, and the sub begins to take on water.\nFraser and the rest of the remaining crew try to repair the leaks but their efforts are futile. Before they can escape, a panicked Daniels locks the bulkhead behind him leaving 3 men to drown but traps himself in the next compartment with his snagged clothing. Morozov closes the final bulkhead, leaving Daniels to drown and protecting Robinson, Tobin, and himself in the torpedo section where Robinson has hidden three escape suits. Robinson evacuates Tobin and Morozov and explains to Tobin that he will follow in the third suit using an emergency lever. Both men surface whereupon Morozov informs the young Tobin that there was no emergency lever and that Robinson had chosen to sacrifice himself. Minutes later the third suit appears containing some of the gold and a picture of Robinson's family."}