{"mid": "BladeII", "IMDB_id": "tt0187738", "title": "Blade II", "plot": "NOTE: Sequel to Blade (1998).Prologue: At the Parizska Blood Bank in Prague, Czech Republic, Jared\nNomak [Luke Goss] has come to donate blood. As he is being led into the donation room,\nhe is informed that his blood is of a rare phenotype. Bad news for Jared;\ngood news for the blood bank, the phlebotomist says and bares his vampire\nfangs. Jared laughs hysterically. Suddenly, his chin cracks open revealing\na gaping maw with a barbed tongue. He pounces on the phlebotomist's neck,\nand blood flies everywhere.Two years have passed since Blade's mentor, Abraham Whistler, shot\nhimself, after being brutally beaten and bitten by vampires. When Blade [Wesley Snipes]\nlearned that the vampires were keeping Whistler alive, he followed their\ntrail through Eastern Europe--first to Moscow, then to Romania, and now to\nthe Czech Republic. When Blade discovers that the vampires are keeping\nWhistler in stasis in a halfway house, he breaks into the house and\nrescues him, after killing a number of vampires with silver stakes and\nbullets made of silver nitrate and garlic extract. One accelerated\nretrovirus detox shot later, and Whistler [Kris Kristofferson] is back among the living.Much has happened in the last two years. Blade has taken on a new\nassistant named Scud [Norman Reedus] who doesn't get along very well with Whistler, now\nthat he's returned. The High Council of Vampires has created a group of\nsix warriors, referred to as the Bloodpack, who are being trained to fight\nagainst Blade. However, a vampire virus called the Reaper Strain has\nmutated in Jared Nomak who passes the virus to everyone he bites. Since\nthe Reaper virus makes carriers extremely voracious, Nomak (and each of\nhis victims) need to feed daily, and they feed on both humans and\nvampires. The numbers of Reapers, noticeable because they resemble nosferatu with their bald, blue-veined heads and pointy ears, are increasing exponentially, and the\nvampires fear the Reapers will first wipe them out then start on humans. Soon...\nyou do the math.Now that the Reapers are presenting an even bigger threat to the\nvampires than Blade ever did, Vampire Overlord Eli Damaskinos [Thomas Kretschmann] has sent a\nmessage to Blade, requesting a truce and asking him to join with the\nvampires and actually lead the Bloodpack against the Reapers. Blade\nagrees, but the Bloodpack--Lighthammer, Verlaine, Priest, Snowman, Chupa,\nand Reinhardt--are not happy being led by the Daywalker they were training\nto kill. To assure their cooperation, Blade plants a silver nitrate bomb,\ncourtesy of Scud, on the back of Reinhardt's [Ron Perlman] head. Blade holds the\ndetonator, and it is set to explode should anyone tamper with it.Accompanied by the vampires Asad [Danny John-Jules] and Nyssa [Leonor Varela],\ndaughter of Overlord Damaskinos, Blade and his Bloodpack begin their search for Nomak by\nstaking out places where vampires congregate, such as blood banks and safe\nhouses, figuring these places will also be attractive to the Reapers.\nFirst on the list is the House of Pain, an old hotel converted into a\nsafehouse sheltering some 200-300 \"suckheads,\" all dancing and feeding. As\nthe Bloodpack searches the building, Reapers begin emerging from the\nsubbasement. About 1/2 hour before dawn, the Reapers attack. The Bloodpack\nmanages to take out several Reapers with ultraviolet guns, but Nomak gets\naway, even after being injected with the anticoagulant EDTA, and a Reaper\nbites Priest, requiring that Priest be destroyed in the rising sun.\nLighthammer also gets bitten, but he hides it. In this first battle with\nthe Reapers, Blade learns that Reapers are impervious to silver, EDTA, and\ngarlic, and they rapidly bounce back from almost any wound, including\nsilver stakes thrust into their chests. How in the world can these\ncreatures be stopped, and whose side should Blade be on anyway,\nconsidering that both Blade and Nomak are enemies of the vampires?Meanwhile, back at the High Council, Damaskinos' lawyer, Karel\nKounen, has informed Damaskinos of Priest's death and warns the Overlord\nthat he is playing a dangerous game, one that could result in his\ndaughter's death. Damaskinos informs Kounen that his \"friend inside\" says\nthat everything is going as planned. Friend inside? Who could that be? One\nof the Bloodpack? Nyssa? Whistler?Outside the House of Pain, Scud and Whistler, who have been working\nsurveillance from the van and on the roof, have managed to capture a\nReaper who was trying to escape down a manhole into the sewers but got\nstuck. For some odd reason, this Reaper is dying. Blade surmises that the\nReaper's body, having gone several hours without feeding, is beginning to\nfeed on itself. Since he is dying anyway, this provides Nyssa with an\nopportunity to perform an autopsy and learn more about the Reapers. She\nlearns that the barbed tongue contains a nerve toxin to paralyze the\nvictim while the Reaper feeds. Their hearts are encased in bone, making it\nvirtually impossible to shove a stake through them. The only thing that\nseems to affect them is exposure to sun and to ultraviolet light.\nUnfortunately, these are also deadly to vampires, which is going to make\nit difficult for Blade to destroy the Reapers without harming his vampire\nallies.Scud spends the rest of the night working to build UV grenades out of\nphosphor rods. The next morning, meaning to use daytime, the only\nadvantage they have over the Reapers, Blade, Whistler, Nyssa, Asam, and\nthe Bloodpack, armed with UV guns, UV grenades, and large-scale UV bombs\ngo down into the sewers. They split into three units. Whistler goes with\nChupa and Reinhardt down the east tunnel. Lighthammer, Verlaine, and\nSnowman go in the opposite direction, and Blade goes with Asam and Nyssa.\nUnfortunately, treachery abounds. When Chupa and Reinhardt get Whistler\nalone, Chupa beats him up. We lose a partner and Blade loses one, Chupa\nthreatens. Lighthammer completes his evolution into a Reaper and feasts on\nSnowman, then goes after Verlaine, who has no recourse other than to open\na manhole cover, killing both herself and Lighthammer in the sunlight.Then the Reapers start arriving, crawling on the sewer floor, walls,\nand ceiling. Asam is attacked by a half dozen Reapers crawling underwater.\nBlade sets off a UV grenade, killing all the Reapers, but it is too late\nfor Asam. Chupa falls prey to Reapers. Reinhardt is being followed by\nReapers, so he sets a UV bomb, but the detonator sticks. Blade radios\norders to everyone to regroup, but the only ones left standing are Nyssa,\nReinhardt, and Blade, so Blade goes back to get the UV bomb that Reinhardt\nleft behind. Only after Blade has found the bomb and is surrounded by\ndozens of hungry Reapers does Reinhardt radio Blade to inform him that the\ndenotator doesn't work. Holding off Reapers with both hands, Blade kicks\nat the lever until it finally gives. Ten seconds later, UV light floods\nthe tunnels. It fries the Reapers, but it also hits Nyssa and Reinhardt.Where is Whistler? Whistler has met up with Nomak who, instead of\nattacking him, has given Whistler a ring and told him to tell Blade the\ntruth, which Nomak whispers in Whistler's ear.Meanwhile, Blade has caught up with Nyssa to find her severely burned\nby the UV bomb and badly in need of blood, so he cuts his wrist and makes\nher drink his blood. Suddenly, Blade is shot in the back with stunguns.\nKounen and Reinhardt step in. Vampires from the Council round up Whistler,\nNyssa, and Blade and deliver them to Damaskinos.When Nyssa regains consciousness, she is back in her father's study.\nShe tells him how Blade saved her life and asks whether he is still alive.\nOh, Blade's alive alright. He, Scud, and Whistler are being held in a\nchamber deep in Damaskinos' sanctuary. Just as Whistler begins to tell\nNomak's \"truth\" to Blade--that the Reaper virus didn't evolve, it was\ngenetically designed--Damaskinos, Nyssa, and Reinhardt enter the chamber.\nDamaskinos explains that he has been searching for a way to rid the\nvampires of their hereditary weaknesses by recombining DNA. As he talks,\nhe shows Blade a cylinder filled with hundreds of small fetal vampires.\nNomak was first, Damaskinos says, but Nomak was a failure in that he isn't\nimmune to light. Soon, however, Damaskinos thinks he will have created a\nnew pure race of daywalking vampires, immune to silver and sunlight. All\nhe needs is to figure out why Blade is immune to light and then program\nthat quality into his fetal vampires.Whistler tosses Nomak's ring at Damaskinos' feet. Nyssa recognizes it\nimmediately as the Damaskinos family crest. Turns out that Nomak is\nDamaskinos' son, Nyssa's brother! She storms out, followed by her father.\nReinhardt takes this chance to beat up on Blade, but Blade pulls out the\ndetonator to the UV bomb on the back of Reinhardt's head. He presses the\ndetonator button, but nothing happens. Scud laughs. I designed the bomb to\nbe a dud, Scud explains as Reinhardt pulls it off his head and tosses it\nto Scud. Scud then tells Blade how he's been Damaskinos' familiar all\nalong. What do you think of that, Scud asks Blade. Two things, says Blade.\nOne, I've known about you all along and, two, the bomb isn't a dud. Blade\nthen presses a second button. Goodbye Scud.Blade is then repeatedly stun-gunned and taken to an operating room\nwhere Kounen drives spikes through Blade's body in order to secure him.\nKounen explains that he is going to harvest Blade's blood and body parts\nin order to search for the key to what makes him a Daywalker. However,\nWhistler manages to get out of his handcuffs, knock out Reinhardt, and\nescape through the floor ducts to the operating room. He shoots Kounen,\nand releases Blade. Blade is drained of blood and severely weakened, so\nWhistler carries him into a bloodbath where Blade quickly regenerates. The\nfirst thing Blade does after leaving the bloodbath is to take out two or\nthree dozen guards. Next, he slices Reinhardt in half from head to toe.\nThen he's off to find Damaskinos while Whistler destroys the fetal\nvampires.Meanwhile, Nyssa is having it out with her father. She feels totally\nbetrayed because Damaskinos sent her and her Bloodpack out, expecting them\nto die. He used both of his children, her and Nomak, for his own purposes,\nand he used Blade, too. Blade, her supposed enemy, saved her life. As she\ndebates where her loyalties lie, Nomak has succeeded in invading the inner\nsanctum where Nyssa has sealed herself and Damaskinos. Damaskinos attempts\nto apologize to his son for all that has befallen him, but Nomak bites his\nfather's neck anyway. As Damaskinos lay dying on the floor, his\nbluish-green blood spilling out, Nyssa takes off her family ring and\ntosses it in her father's blood. Nyssa then offers herself to Nomak who\ndives into her neck, too.Enter Blade. A drawn out fight ensues between Blade and Nomak until\nBlade manages to thrust his sword through Nomak's side, the one place\nwhere his heart is unprotected by bone. Nomak seems almost happy and, in\nfact, thrusts the blade in further, and his body disintegrates. Poor Nyssa\nhas been bitten and can already feel her body changing into that of a\nReaper. I want to die while I'm still a vampire, she tells Blade. I want\nto see the sun. Blade carries her outside. Together, they watch the\nsunrise before Nyssa burns up in Blade's arms.In the end Blade disposes of Rush, the vampire he had left alive in the beginning of the movie, at the vampires' half-way house."}