{"mid": "BlastFromThePast", "IMDB_id": "tt0124298", "title": "Blast from the Past", "plot": "In 1962, Dr. Calvin Webber (Christopher Walken), an eccentric scientist who, like so many people at the time, thinks that a nuclear war between the U.S. and the Soviet Union is imminent, has built a large, fully functional fallout shelter in his backyard deep underground. During the Cuban Missile Crisis, thinking the conflict could escalate, Calvin takes his pregnant wife Helen (Sissy Spacek) into the fallout shelter as a precaution. When a fighter jet flying over loses control, the pilot bails out and the jet crashes into their house, causing a large explosion; Calvin, thinking the worst has happened, sets and activates the shelter's locks (designed not to open for 35 years). Everyone assumes the entire family was killed in the accident, as no one knew of Calvin's secret fallout shelter.\nCalvin's wife Helen gives birth to a boy, whom they name Adam. Adam grows up being taught and exposed to all culture up to 1962, such as watching reruns of The Honeymooners and listening to Perry Como and Dean Martin. During their 35-year stay in the shelter, a small diner called \"Mom's\" is built on the site where their house stood. A young man named Melcher (Joey Slotnick) works for Mom (Dale Raoul) as a soda jerk. The diner (which later becomes a pub) is shown throughout the 1960s, 70s, and 90s, as the neighborhood deteriorates from suburban to inner city ghetto complete with abandoned graffiti-marked buildings, adult bookstores, and the homeless, prostitutes, and addicts as its residents. Eventually, Mom gives the pub to Melcher, who lives in the abandoned remains (in 1995), an alcoholic.\nWhen the locks open in 1999, Calvin is so shocked to see how the world has changed (believing it to be a post-apocalyptic wasteland populated by irradiated mutants), he decides the family must stay underground. However, their supplies are running out, and Calvin suddenly falls ill from the stress, so Adam (Brendan Fraser) must venture onto the surface to procure more. As he leaves the shelter for the first time, he meets Melcher who had encountered Calvin in his radiation suit the previous night and mistook him for God after he burst through the floor of the abandoned pub using his elevator to the surface. Having built a shrine above the elevator shaft, Melcher now worships Calvin and the elevator, with Adam's words of encouragement to him being mistaken as affirmation of his new religion. As he marvels at the outside world, seeing many things for the first time the sky, a little girl, and \"a Negro\", Adam eventually realizes that while purchasing supplies in bulk, he has strayed too far from the pub containing the elevator to the fallout shelter and cannot remember his way back.\nAdam meets Eve Rustikoff (Alicia Silverstone) when he tries to sell his father's classic baseball cards at a hobby shop. She stops the store owner (Bill Gratton) from trying to buy the cards for much less than their collectible value and is immediately fired. Adam asks Eve to drive him to a Holiday Inn in exchange for a rare baseball card; she takes the card and leaves, but returns the next morning to give it back out of guilt. When Eve mentions that she must find a new job, Adam asks her to help him purchase supplies and, unaware of the value of money, immediately agrees to her request for $1,000 a week. He also asks Eve to help him find a wife from Pasadena, California (per his mother's advice), who is \"not a mutant\"; he uses the term literally as meaning a mutant due to radiation from the nuclear war which never happened. Adam meets Eve's gay housemate and best friend, Troy (Dave Foley), who is amused by Adam's naiveté but offers advice and gives Adam a fashion makeover.\nEve and Troy take Adam to a 1940s swing-style nightclub to find him a wife. Adam immediately attracts the attention of several women, including Eve's flirtatious rival and nemesis Sophie (Carmen Moré). Eve becomes jealous and reconnects with her ex-boyfriend Cliff (Nathan Fillion), but leaves after Cliff goads Adam into an altercation ultimately backing off as Adam demonstrates his skills in boxing (having trained every day with his dad). Troy later returns home alone and explains to Eve that Adam went home with Sophie. Adam returns later, explaining that he politely rejected Sophie's advances, saying that he could only think about being with her. He and Eve kiss, but when Adam tells her the truth about his past and states that he wants to take her to be his wife \"underground,\" she asks him to leave.\nThe next morning after successfully locating the pub containing the elevator (as well as a full congregation of destitute people hanging onto Melcher's every word), Adam returns to Eve's house, where she is waiting with a team of mental health professionals to have him committed. He sadly cooperates at first, but escapes as they leave the house asking that Eve and Troy collect his things for him and pay his hotel bill. Troy and Eve find toiletries and clothing manufactured in the early 1960s as well as absurdly valuable stocks in companies like IBM, and realize that Adam was telling the truth.\nWith Melcher and his cult helping with loading the supplies into the shelter, Calvin is prepared to seal him and his family inside once more, until Eve spots Adam standing outside of the abandoned pub, the two share an embrace as Adam takes her to meet his parents. Calvin and Helen are impressed with Eve and agree to Adam's request for the two of them to set the lock timer for two months while they stay down there.\nDuring this time which time he and Eve use the money from selling the stocks to build his parents a new home in the country, which is a 1950s style suburban tract home identical to the home that was destroyed except it is built on a beautiful spot way out in the country. Included with the house is a restored red 1960 Cadillac convertible. They also use the money to help Melcher rebuild the old pub into a 50's themed night club after convincing him that Adam isn't God. When they are settled in, Adam lets Calvin know the truth about the jet crash. He tells his father there was never an atomic war and that the Soviet Union collapsed. Calvin takes the news stoically, thrilled to hear of the fall of the Soviet Union, but still suspecting it was a Commie trick. He tells Adam not to mention this to Helen. After Adam walks away upon being told by Helen that dinner is ready, Calvin mutters \"Commies...\" to himself and begins measuring the space in the backyard, beginning the development of a new fallout shelter as Eve watches from the window while playing with her engagement ring."}