{"mid": "BloodTheLastVampire", "IMDB_id": "tt0275230", "title": "Blood: The Last Vampire", "plot": "The year is 1966. Saya is the only remaining original\nvampire, and she hunts Chiropterrans--demons who live off human blood.\nSaya's a testy and demanding little bitch but apparently very valuable to\n\"the top.\" Her next assignment, as her boss David explains it to her, is\nto infiltrate the U.S. Yokota Air Base's High School, which has been the\nscene of several deaths in the past and is thought to be harboring at\nleast two Chiropterrans. Saya's cover is that of a student who will be\nparticipating in classes for a few days.Saya's first day at Yokota High is pretty uneventful. After classes\nare over and everyone has cleared out, Saya snoops around the school and\nlearns that blood has been spilled on the floor in the infirmary. She\nsuspects that the infirmary is the Chiropterrans' feeding room. The next\nday is the school's Halloween party. After school lets out, the students\nchange into their costumes and head for the dance...all except for Sharon\nand Linda, that is. Linda isn't feeling well, and Sharon thinks it's a\nflare-up of Linda's anemia, so she's going to walk Linda over to the\ninfirmary and they will attend the party later. Saya enters the infirmary\njust as Sharon and Linda are about to feed on nurse Makiho Amano. Linda\nchanges her form into Chiropterran, and Saya slays her with her sword.\nSaya turns on Sharon and wounds her, but Sharon gets away, spilling blood\nas she flees. The astonished nurse follows the trail, which leads to the\ndance hall where she finds Sharon in Chiropterran form hiding under a\nblanket. While Saya battles the creature, Makiho runs for help.Meanwhile, at a nearby bar, the mama-san sets the bar on fire, takes\nChiropterran form, and heads for the army base. She kills the military\nguard who is escorting the Makiho back to the dance. Saya saves the\nterrified nurse, and they take refuge in a military garage, but the demon\nfinds them. Saya, without her sword, battles the creature with a shovel\nwhile Makiho hops in a jeep and rams through the door. David, who has been\nlooking for Saya and was standing outside the garage, tosses a sword to\nSaya, and she chops the demon (Sharon) in half. As Saya and David take\nMakiho from the jeep and lay her unconscious form gently in the grass, they see the mama-san in demon form on the roof, preparing to fly away.\nDavid and Saya follow in the jeep. The Chiropterran tries to escape by landing\non the wing of a military jet tooling down the runway. The jeep gives chase,\nand Saya slays the monster. As the Chiropterran lies dying on the runway,\nSaya feeds it with a few drops of her own blood.Epilogue: Makiho attempts to describe what she saw to the military brass, but\nshe has little proof of anything. When she returned to the infirmary,\nLinda's body was no longer there and the bloody mess had been cleaned up.\nThe military brass deny knowing anything about David, but they do show\nMakiho a photo taken in 1892 that clearly shows Saya and has the word\n\"Vampire\" written on it. Makiho returns to her office, wondering to\nherself whether Saya is still around and still fighting demons, \"just as\nwe humans continue to kill each other.\" At that moment, an announcement\ncomes over the radio that the Liberation Front has attacked the American\nBlake base and that Yokota base personnel have been ordered to fly to Don\nHoi in North Vietnam. As the credits roll, the background shows some very\nblurry photos of what looks like American forces in Vietnam.\n[Original Synopsis by bj_kuehl] [Edited by m-lissa1]"}