{"mid": "BloodNightTheLegendOfMaryHatchet", "IMDB_id": "tt1161404", "title": "Blood Night: The Legend of Mary Hatchet", "plot": "In 1978, Mary Mattock has her first period, and due to menstrual psychosis, murders her parents with a hatchet. Deemed mentally unfit, Mary is placed in Kings Park Psychiatric Center, where she is raped and impregnated by a guard in 1989. This incident is covered up, and after being told her child was a stillbirth, Mary goes on a rampage through the hospital. The police find Mary wandering the grounds, and open fire on her after she throws the severed head of her rapist at them, ending her killing spree. \"Mary Hatchet\" subsequently becomes a folklore figure, with local youngsters celebrating the Mischief Night-esque \"Blood Night\" in her name.\nIn 2008, a group of teenagers prepare for their Blood Night party by holding a séance at Mary's grave at a cemetery on Sweet Hollow Road in Huntington, where they are told one of the stories relating to her by the cemetery caretaker, Gus, a former King's Park employee who claims that Mary will keep coming back to kill until she finds her child, who was buried in a shallow grave near Kings Park. The teenagers proceed to party at a house, where straggling guests are killed by an unseen murderer amidst supernatural occurrences.\nThe remaining teenagers flee when they uncover their friends' bodies, and run into Gus. After hearing the teenagers' story, Gus has them accompany him to the abandoned Kings Park Psychiatric Center, where they dig up the grave of Mary's baby, Gus being convinced that reuniting mother and child will appease Mary's spirit. The baby's casket is empty, so the group break into Kings Park in search of answers, and discover paperwork that reveals that Mary's child is Alissa, a missing party guest visiting from Chicago. A series of flashbacks show that Alissa killed everyone either due to being influenced by Mary, or because she is experiencing the onset of a disorder similar to her to mother's.\nAlissa appears, kills Gus, and chases the others through the asylum, picking them off until only Alex and Lanie remain. Alex and Alissa fight, and after a bloody struggle, Alex strangles Alissa to death. As Lanie and a wounded Alex search for an exit, the latter is decapitated by Mary's enraged ghost, which then lunges at the screaming Lanie."}