{"mid": "BloodyMallory", "IMDB_id": "tt0299556", "title": "Bloody Mallory", "plot": "Mallory is France's answer to Buffy...sort of. Buffy was blonde;\nMallory has flaming orange-red streaked hair. Buffy dressed in pastel\nskirts and flowery halter tops; Mallory wears red and black vinyl with\ncombat boots. Buffy hung around with two other high school students--geek\nXander and witch Willow; Mallory hangs with a mute, telepathic juvenile\nnamed Talking Tina, a blue-haired drag queen and explosives expert named\nVena Cava, and the head of Commando Operations, Inspector Durand. Buffy\ntook directions from her mentor Giles; Mallory consults the Necronomicon.\nBuffy was single; Mallory killed her husband with an ax on their wedding\nnight when she found out he was a demon about to sacrifice her. What Buffy\nand Mallory do have in common is that they fight vampires and other evil\ncreatures.While speaking to a crowd in Paris, Pope Hieronymous I has been\nkidnapped. The Ministry of Secret Services has called Anti-Paranormal\nCommando Operations leader Mallory [Olivia Bonamy] to find him, much to the dismay of\nCarmina Belladone, the Vatican's press attache. After watching a videotape\nof the actual kidnapping, Mallory believes the masked kidnappers to be the\nliving dead, but Belladone thinks they were just terrorists in bulletproof\nvests. She's not about to buy rubbish about \"living dead\" nor does she\nlike Mallory and her band of superstitious mercenaries.It's not going to be an easy mission. On their last assignment\nfighting ghouls, Vena Cava wound up in a neck splint, and Talking Tina was\nbitten by baby ghouls and now lies in a coma that the doctors say could be\npermanent. Worst of all, Inspector Durand was killed. Before embarking on\nthe search for the Pope, Mallory invokes the spirit of her dead husband [Julien Boisselier]\nwho is now a wandering demon in limbo. He is able to identify the\nkidnappers as evil spirits who have vowed obedience to Abbadon the Dark,\nthe exterminating angel who fell from God's grace during the Original\nFall. Rumors are circulating about him in limbo, demon hubby says. They\nsay that he's preparing to free the fallen angels and destroy all of\ncreation.Mallory gets a list of all supernatural events occurring in France\nover the past five years. Plotting them on a map of France, she notices\nthat they form a pentangle. Using that pentangle, she heads south from\nParis in her pink and black hearse to a spot where 5,000 inhabitants\ndisappeared some 15 years ago. Along the way, she is surprised when a bat\nlands on her windshield and it turns out that Talking Tina has possessed\nit. Using her negative energy detector, Mallory is led to a gate in the\nmiddle of a forest. Passing through the gate, she finds herself in another\ndimension, so she gets back in her car and drives through the gate. When\nshe comes to a crossroads and has the choice of going to the Crypte des\nVampires (Vampire's Crypt) or the Relais des Loups Garou (Werewolf Inn),\nshe heads towards the vampires.Mallory stops at a gas station that sells Fresh A+. Talking Tina\ndetects telepathic waves coming from behind the station. Mallory checks\nit out and finds several humans being held in cages. After releasing them,\nshe discovers that one of them is Father Carras [Adrià Collado], one of the Pope's\nbodyguards who also disappeared when the Pope was kidnapped. Carras\ndoesn't know where the Pope is, but he decides to teem up with Mallory.\nTina takes over the hulking body of the gas station attendant, and they're\non their way again.Meanwhile, Vena Cava [Jeffery Ribier], who was left behind in Paris, has been\nsearching for Mallory with her locator. She found the gate, went through\nit, and meets up with Mallory just as Mallory, Tina, and Carras are\nattacked by hordes of cloaked ghouls. Vena jumps on top of a cement post,\naims her thick-soled boots, and shoots silver bullets. Well, she thought\nthey were silver bullets. Guess that the salesman lied. In order to get\naway from the ghouls, the four Commandos jump into a well where they find\na secret passage. Labyrinth though it is, they manage to find the Pope [Laurent Spielvogel]\nwhen Tina leans on a wall and it breaks through. While the Pope complains,\nCarras releases him. Mallory notices the lack of guards and becomes\nconcerned that releasing the Pope was a bit too easy.Unbeknown to the Commandos, they have been being watched by the\nvampire Lady Valentine [Valentina Varagas] and the succubus Morphine [Sophie Tellier]. Cautiously, the\nCommandos head back through the labyrinth, looking for the exit. Suddenly,\nthey come upon a green dragonlike monster that chases them until they\ndeadend in a small room and the door closes, shutting out the dragon. When\nthey spread out to look for an exit, a wall of spikes drops down in the\ncenter of the room, trapping Vena, the Pope, and Tina on one side and\nMallory and Carras on the other. While the Pope continues to kvetch, Vena\nfinds a lever under a floorstone and turns it. The wall begins to move.\nIt's going to crush Mallory and Carras. Vena turns the lever the other\nway, and the wall stops. Then it begins to move in the opposite direction.\nIf not stopped, it's now going to crush Vena, Tina, and the Pope.Vena grabs her tube of blue lipstick and aims it at one of the other\nwalls. The lipstick explodes, creating a hole. First she pushes the Pope\nthrough the hole. Then Vena follows. Unfortunately, the hole isn't big\nenough for the gas station attendant to fit through, so Tina transfers\nherself into Vena's body. The gas station attendant is crushed. While Tina\nlooks for another body to possess (she can't get into the Pope for some\nreason), Mallory and Carras come across some writing carved into the wall.\nIt's in Latin and Carras can read it after making a rubbing. It tells the\nstory of how God locked the fallen angels in an abyss but Abbadon escaped.\nA prophecy says that he will reincarnate as a human every 100 years \"until\nhe is the one God entrusts with the keys to His Kingdom.\" Mallory and\nCarras put 2+2 together and realize that Abbadon is none other than the\nPope.Separated from Vena, Tina, and the Pope, Mallory and Carras search\nfor them. They come upon a young man in chains. Carras wants to release\nhim, but Mallory notices the bite marks on his neck. As they fight over\nwhether or not to destroy the man, Lady Valentine appears. In front of\nMallory and Carras, she sinks her fangs into the man's neck and drinks him\ndry. Mallory recognizes her immediately as the Pope's press attache, Carmina Belladone\n(\"always sucking up\"). Lady V then turns on Mallory. Mallory puts up a\nfight, but Lady Valentine is immortal. Not even a pole through her heart\ncan stop her. Lady V captures Mallory and Carras and takes them to her\ncastle in the sky, where Vena is already being held in chains.The Pope is there, too. He explains to them that his kidnapping was\nactually an elaborate ruse to lure Mallory to him. Now that she's out of\nthe way, he plans to destroy the world of sinful humans to make room for\nthe fallen angels who were created by God in His image, perfect and\nimmortal. Wanting her to witness his ascendancy, he has Mallory placed in\nspiked handcuffs and suspended from the ceiling rather than destroying\nher. Mallory reminds him that she never works alone, so the Pope/Abbadon\ncalls in Morphine the succubus, who can assume other personas. Morphine\nmetamorphs into Mallory, kills the Minister of Secret Services, and\nconvinces the Army General to send his troops to the Loire valley, leaving\nParis unprotected.Morphine then pays a visit to Tina in her hospital bed. Tina [Thylda Barès] has\nmanaged to get back into her own body, so when Morphine shows up, they\nhave a telepathic showdown. Tina wins. Because her body is still weak,\nTina takes over the body of a young nurse and returns to help Mallory. In\nthe meantime, Mallory's demon hubby comes to her to enjoy the spectacle\nbut, perhaps out of a sense of guilt or maybe even love for Mallory, he\ninforms her that the mixing of their blood when she killed him has\nactually imbued her with power. He compels her to use this power to free\nherself. Mallory focuses, and the handcuffs break away. Mallory kisses\ndemon hubby. The next thing she knows, she is kissing Carras.Tina advises Mallory and Carras about Morphine killing the chief and\nhaving the troops sent to the Loire. The three of them hurry back to\nParis, where the Pope/Abbadon is invoking the Powers of the Universe and\nthe Forces of the Ether to open the Gates of Hell, where he intends to\nsend all humans (which doesn't sit well with the vampire Valentine). On a\nmakeshift altar in front of him lies Vena, awaiting sacrifice. While\nghouls chant \"Abbadon! Abbadon!\" Carras and Tina sneak up. Tina sends a\ntelepathic message to the ghouls to kill themselves and to one ghoul to\ncut the ropes that bind Vena. They then turn on the rest of Abbadon's\nfollowers while Mallory concentrates on Lady V.Suddenly, a line of protective green fire goes up around Abbadon.\nCarras pulls out the rubbing he made and reads, \"He who crosses the Line\nof Peril shall confront his worse enemy. Only inner faith will triumph\nover this ordeal.\" Mallory looks to Carras, but he throws away his cross.\nHis faith has crumbled, and he cannot help. The deed falls to Mallory.\nConcentrating all her faith, Mallory steps across the flames. An ax takes\nshape in her hands. Suddenly, she is facing herself in her wedding gown\nand herself as an executioner. \"You can't escape the Evil inside of you,\"\nsays one of them. \"Good and Evil are two faces of the same monster,\" says\nthe other. They take swings at Mallory with their axes. Mallory tosses\naway her ax and ducks. Mallory the bride and Mallory the executioner\ncancel each other out, and now it's just Mallory and Abbadon face-to-face.The sky opens up, and Abbadon attempts to force Mallory back, but she\nstruggles to approach him. When it's apparent that there is no stopping\nher, Mallory grabs the edict from Abbadon's hands and eats it, mumbling,\n\"Fut toi!\" She tosses Abbadon down the stairs, the sky closes up, and\nAbbadon and Lady V tuck tails and run. \"I lost the battle, but not the\nwar!\" screams Abbadon as he goes through a door into the interstellar\nvoid, tumbling...tumbling...Epilogue: Mallory visits the grave of her demon hubby and gives him\nback his wedding ring, releasing him from limbo (re: Necronomicon, chapter\n112). Lady Valentine moves to the island of Izu, Japan and becomes a special\ncorrespondent on the television. The Commandos head for Japan. [Original synopsis by bj_kuehl]"}