{"mid": "BloodForDracula", "IMDB_id": "tt0071233", "title": "Blood for Dracula", "plot": "In the first years of the 1920s, a sickly and dying Count Dracula, who, as a vampire, must drink virgin blood to survive, travels from Transylvania to Italy just before the rise of Mussolini into power, following his servant Anton's plan and thinking he will be more likely to find a virgin in a Catholic country. At the same time, all of Dracula's family has vanished because of two reasons, the lack of virgins in their hometown and how the family's reputation prevents any normal family from choosing to bring women to the renowned castle. Shortly after arriving in Italy, Dracula befriends Marchese di Fiore (De Sica), an impecunious Italian landowner who, with a lavish estate falling into decline, is willing to marry off one of his four daughters to the wealthy aristocrat.\nOf di Fiore's four daughters, two regularly enjoy the sexual services of Mario, the estate handyman, a proud peasant and staunch Marxist who believes that the socialist revolution will happen soon in his country. The youngest and eldest daughters are virgins, the eldest is thought too plain to be offered for marriage and is past her prime, and the youngest is only 14 years old (portrayed by 23-year-old Dionisio). Dracula obtains assurances that all the daughters are virgins and drinks the blood of the two who are considered marriageable. However, their tainted blood reveals to him the truth and makes him even weaker. Nevertheless, he is able to turn the two girls into his telepathic slaves.\nSoon after the Marchese Di Fiore travels out of Italy to pay his great debts, Mario discovers that Dracula is a vampire and what he has done to the Di Fiore sisters. When he realizes the danger Dracula poses to the youngest daughter, he rapes her to achieve her protection. Mario warns Di Fiore's wife, La Marchesa Di Fiore, about Dracula's plan. Meanwhile, Dracula has drunk the blood of the eldest daughter, turning her into a vampire and regaining strength. La Marchesa confronts, and is stabbed by, Anton, whom she shoots and kills before dying. Mario dismembers Dracula with an axe and kills him and the eldest Di Fiore daughter with a stake, becoming the de facto master and manager of the estate."}