{"mid": "BloodFeast", "IMDB_id": "tt0056875", "title": "Blood Feast", "plot": "In the midst of a series of gruesome murders, a young woman is killed inside her suburban Miami house by a grey-haired, wild-eyed man. He stabs her in the eye and hacks her leg off with a machete, bagging the leg before he leaves. At the police station the next day, detective Pete Thornton investigates the killing, noting that it is the latest in a series of four murders by a homicidal maniac who has yet to leave any clues. The police chief advises him to continue to pursue the case.\nAt Fuad Ramses Catering store, wealthy socialite Dorothy Fremont arrives, where she arranges for Fuad to cater a party for her daughter Suzette. Fuad agrees and tells Mrs. Fremont that the Egyptian feast that he is preparing has not been served for over 5,000 years. Mrs. Fremont wants the catering done in two weeks, and Fuad assures her that he will have enough time to procure the last of his needed ingredients. After Mrs. Fremont leaves, Fuad ventures to the back storage room where he has displayed a large gold statue of his \"Egyptian goddess\" Ishtar. Fuad is preparing a \"blood feast\" – a huge vat containing the dead women's body parts – that will ensure the goddess's resurrection. That evening, teenagers Tony and Marcy make out on a nearby beach. Fuad attacks them, subduing Tony and slicing off the top of Marcy's head. He removes her brain to serve as the latest ingredient. Thornton arrives on the scene with the police chief. After failing to obtain any useful information from the distraught Tony, they interrogate Marcy's mother, who can only tell Pete that her daughter belonged to a book club.\nStaking out a local motel, Fuad sees a drunken sailor drop his wife off at her room. Fuad knocks on the woman's door and attacks her when she opens it. Fuad rips the woman's tongue out through her throat as another ingredient to his \"blood feast\". Pete continues to investigate this latest killing, and discovers that the latest murder victim also belonged to a book club.\nPete attends his weekly Egyptian Studies lecture at the local university with his girlfriend, who happens to be Suzette. The lecturer tells them about the cult of Ishtar, and describes how virginal women were sacrificed to the goddess on an altar as a blood offering to the Egyptian goddess. When the lecture is over, Pete takes Suzette out for an evening drive. She becomes worried about the recent attacks and fears that a serial killer is loose in the area. Their date is interrupted by the car radio announcing that another victim has been found near death. Pete drops Suzette home and races to the hospital. The police chief informs him that the maniac has struck again and hacked off the face of another woman named Janet Blake. Pete questions Janet in her hospital bed. Her face bandaged, Janet tells the detectives that the man who attacked her was old, with wild eyes, and that he said something which sounded like \"Etar\". Janet then dies and Pete can't shake the feeling that this word sounds familiar. Fuad receives a letter from Trudy requesting a copy of the book Ancient Weird Religious Rites, written by Fuad Ramses. Fuad calls Trudy's home phone number and learns that she's staying with Suzette. That afternoon, Fuad stakes out the Fremont residence, kidnaps Trudy from the grounds and takes her to his store. He whips her savagely and collects her blood, the final ingredient in his bloody potion.\nWith Trudy missing, Mrs. Fremont insists that the party continue. Pete calls Suzette to inform her that he will be late. Meanwhile, Fuad arrives with the food that he has cooked at his store. Elsewhere, Pete calls upon the college lecturer and gets more information about the cult of Ishtar and Fuad's book. He deduces that Fuad is the killer, since all the victims were women who personally called upon him to send them copies of his book. Pete and the police race over to Fuad's store and find Trudy's chopped-up body in the back. Pete tries to call Suzette to warn her, but Fuad cuts the phone line to the Fremont house.\nAt the Fremont party, Fuad's meal is ready, but he first asks Suzette to come into the kitchen to help him. He has Suzette lie on a counter, which he makes his altar, and says a prayer to Ishtar as he prepares to decapitate her with his machete as a final offering to his goddess. This takes forever because she can't take him seriously. Dorothy Fremont interrupts Fuad just as he's about to decapitate Suzette, and Fuad escapes as the police arrive. Pete and the rest of the police chase Fuad through a nearby garbage dump, where he attempts to escape by climbing into the back of a departing garbage truck. The truck's compact blades turn on and Fuad is crushed to death. The police stop the truck, noting that there's not much left of Fuad. As Pete puts it, \"He died a fitting end, just like the garbage he was.\""}