{"mid": "BloodrayneTheThirdReich", "IMDB_id": "tt1153546", "title": "BloodRayne: The Third Reich", "plot": "Rayne fights against the Nazis in Europe during World War II with the French resistance, encountering Ekart Brand, a Nazi leader whose goal is to inject Adolf Hitler with Rayne's blood in an attempt to transform him into an all powerful dhampir and attain immortality.\nThe film opens with train cars full of humans being sent to concentration camps when they're intercepted by a French resistance group. Soon, Rayne (Natassia Malthe) arrives and kills most of the Nazi troops and corners their commandant in a train car. As the two talk, a Nazi shoots Rayne, splashing her blood on the commandant's face. Rayne kills the soldier before impaling the commandant on a pole and leaving him to die. Rayne soon converses with the leader of the resistance, Nathaniel, who is aware that Rayne is a dhampir. After finding the train cars full of prisoners, the resistance and Rayne decide to work together to fight the Nazis. After they leave however, the commandant is revealed to have survived his presumed death as a result of some of Rayne's blood getting in his mouth, implying that he is a dhampir.\nBack at the headquarters of the Third Reich, a scientist named Mangler (Clint Howard) is torturing vampires as a way of studying them so he can make Adolf Hitler and the Third Reich immortal. A Third Reich lieutenant informs the doctor that the commandant was attacked by a 'vampire' in the daytime, intriguing his interest.\nElsewhere, Rayne heads to a brothel to get a massage when she overhears a soldier beating on one of the women. Rayne easily beats the man down, forcing the owner of the brothel to close early, despite being warned that the Nazis would suspect something. She ignores the warning and warns Rayne that she'd not be a problem for her business. As Rayne prepares to leave, a voluptuous woman stops Rayne and thanks her for saving the woman from before. Initially refusing at first, the woman seduces Rayne and has sex with her."}