{"mid": "BloodRage", "IMDB_id": "tt0085253", "title": "Blood Rage", "plot": "Todd and Terry are blond and identical twins. In 1974, one night at a drive-in theater, Terry sees his parents kissing inside the car and escapes from the backseat with Todd. Deep inside, Terry soon becomes violent from always seeing people, including his parents, having sex. Taking a carpenter's hatchet, he murders a teenager having sex with his girlfriend in the backseat in their car, and frames a shocked Todd by smothering the blood onto him and placing the hatchet into his hand. When their mother Maddy (Louise Lasser) and the police arrive on the scene, Todd without question is found guilty and is locked in a asylum.\n10 years later, in 1984, Terry lives happily with his mother in their neighborhood Shadow Woods. On Thanksgiving, Terry's insanity revives again when not only his mother is getting re-married again with her fiancé Brad, but news that Todd has escaped from his mental hospital. To ensure that Todd gets framed for the murders for him to go back to the asylum, Terry murders Brad by chopping his right hand off with a machete before splitting his head.\nMeanwhile, Dr. Berman and her assistant Jackie go out in search for Todd. Terry greets Jackie before stabbing him with his machete, and murders Dr. Berman in the woods by dismembering her waist. After this, he switches from his bloody t-shirt into a vest. He then proceeds nearby to his new neighbor Andrea, who is babysitting a young newborn baby. They begin to have a relationship until her mother Julie and her date Bill come home. During this, Terry's friend Karen bumps into Todd, who she believes is Terry; Todd announces himself and she flees to tell her friends about her encounter. She also tells Terry about her brother, and he then disappears into the night in search of him, while Karen and her friends Gregg and Artie to go to Andrea's house to party.\nMaddy begins to panic upon hearing about Todd coming into Shadow Woods, and Todd breaks down in the woods when he comes across Dr. Berman's body; he takes a hidden revolver with him. Meanwhile at Julie's house, Bill is decapitated by Terry, and Julie is stabbed after this. Terry spies on Gregg and Andrea playing tennis, before he murders both of them by the swimming pool. Artie finds the bodies of Gregg and Andrea, and in his car is held at gunpoint by Todd who tries to truthfully convince him that Terry is actually murdering everyone. When Artie, still under gunpoint, knocks on Terry's door, the latter answers and sees Todd before the said person flees. When Artie and Terry look for Todd, Artie gets stabbed in the neck with a carving fork.\nKaren soon discovers Terry's true nature, and he chases her around the neighborhood to kill her; in the process she discovers Brad's body. She flees to Julie's house to find her body, and takes the baby with her. During this, after Maddie contacts the police, she discover's Terry's secret upon finding his bloodied t-shirt in the garbage bin, and horrifyingly discovers Brad's body with his head split open. At the swimming pool, Terry finds Karen with the baby, but Todd arrives and fights his brother inside the pool. While Todd gets pulled out by Karen, Maddie appears and shoots at Terry, killing him and thinking it is Todd. She turns frightened when she realizes that she shot Terry and when Todd reveals himself to her, she commits suicide by shooting herself in the head. The film ends with Karen fleeing with the baby, and Todd remains shocked over his mother's death as police sirens can be heard, leaving his fate unknown."}