{"mid": "BlooperBunny", "IMDB_id": "tt0101484", "title": "(Blooper) Bunny!", "plot": "The cartoon opens with a short special, celebrating Bugs Bunny's 51½ Anniversary. Once that is finished, what happened earlier that day is shown, with a backstage look at the characters (featuring 3D rendering of the scenery). Bugs is shown rehearsing his one line in the special. Elmer Fudd is shown trying to use minoxidil to regrow his hair. Daffy Duck and Yosemite Sam are shown only begrudgingly going along with the act, complaining non-stop until called to their places by the director. They attempt a performance, which results in a series of animated \"bloopers\".\n=== Featured bloopers ===\nBlooper 1:\nBugs Bunny begins to dance, but the music is slightly out of tune and the record skips. He then dryly looks at the camera and says, \"Ehh...What's up, Doc?\" in an annoyed and sarcastic voice. The director and producers laugh as Bugs walks off stage. He then peeks back in to say \"Monotonous, isn't it?\", which gets the director and producers laughing again and right when the screen fades to black, the record scratches.\nBlooper 2:\nBugs halts the performance midway, having noticed a loose floorboard on the stage. He then suggests moving the action back and readjusting the camera.\nBlooper 3:\nBugs misses the cane when it flies out.\nBlooper 4:\nThe cane is thrown before Bugs is ready to catch it.\nBlooper 5:\nWhile waiting for the cane to be thrown, it becomes clear that Daffy Duck has refused to throw it to Bugs. According to Daffy, his contract states that he is not supposed to throw canes to rabbits, resulting in the director agreeing to have someone else throw it in Daffy's place.\nBlooper 6:\nDaffy enters the stage at the exact time that Bugs does, saying that he thought it was a vast improvement as he walks away, only to bump his head on the boom mike.\nBlooper 7:\nDaffy does not appear when he is supposed to. Offstage, Daffy is heard telling Bugs, the director and the producers to wait, followed by the sound of a toilet flushing. As Daffy then rushes onto the stage dancing, the director yells, \"Cut! CUT! CUT!\"\nBlooper 8:\nElmer Fudd fires a real gun as opposed to a prop, grazing Daffy's head. Bugs scolds him, but Elmer responds that he thought that it would be \"a gweat, big birthday surpwise\" if he finally shot Bugs \"after 51 ½ years of twying\". Daffy starts yelling at Elmer for not using the prop gun and neglects Bugs's insistence on cutting. As he walks away telling Elmer to expect his lawyers to call him, he steps on the loose board Bugs had avoided earlier, and the board strikes him in the face and goes through his beak. When Bugs asks if they can cut now, Daffy grumbles, \"You smug son of a—\" and is then cut off.\nBlooper 9:\nDaffy dances onto the stage with the board still stuck to his face. When he pulls it off, he yanks his beak off as well in the process, but continues speaking and where his beak was, a mouth appears, though he fails to notice it.\nBlooper 10:\nEverything plays out correctly until Yosemite Sam emerges from the cake with a scowl on his face and two Cowgirls come up and spruce him up. The director instructs him to act cheerful for the next take. Yosemite Sam goes back into the cake, mumbling \"But I hates rabbits\".\nBlooper 11:\nThe spectacular performance is done perfectly, except for one thing, as Bugs puts it – there were supposed to be five rockets. A fifth rocket attached to Sam's belt sends him flying about before crashing into the camera. He then yells at Bugs, calling him a \"low down flop-eared son of a kangaroo\", along with his usual cursing (which lasts throughout the credits) before being knocked out by an unseen glass object. Bugs then suggests that what had just happened can be fixed in the editing before one of the producers asks, \"Can we go to lunch now?\""}