{"mid": "Blowup", "IMDB_id": "tt0060176", "title": "Blowup", "plot": "The plot is 24 hours in the life of a glamorous fashion photographer named Thomas (David Hemmings), inspired by the life of an actual \"Swinging London\" photographer, David Bailey.In the opening scene, Thomas wakes up after spending the night at a doss house where he has taken pictures for a book of art photos. He is late for a photo shoot with Veruschka von Lehndorff (playing herself) at his studio, which in turn makes him late for a shoot with other models later in the morning. He grows bored and walks off, leaving the models and production staff in the lurch. As he leaves the studio, two teenage girls who are aspiring models, a blond (Jane Birkin) and a dark-haired brunette (Gillian Hills) ask to speak with him, but the photographer drives off to look at an antiques shop.Wandering into Maryon Park, he takes photos of two lovers making out. The woman (Vanessa Redgrave) is furious at being photographed and demands that Thomas hand over the film, but he refuses. When she walks away to rejoin her boyfriend, he is gone and she runs away with Thomas taking photos of her as she runs.Thomas then meets his agent for lunch, and notices a man following him and looking into his car. Back at his studio, the mysterious woman from the park arrives asking for the film, but he refuses. The woman introduces herself as 'Jane' and tries to seduce Thomas by removing her top to entice him to hand over the film and negatives. Thomas agrees without going any further, but he deliberately hands Jane a different roll. She in turn writes down a telephone number to give to him.After Jane leaves, Thomas begins work on developing his photos that he took that day. His many enlargements of the black and white film are grainy but he finds something strange. In the Maryon Park photos, Thomas notices a figure hiding in the bushes near Jane and her boyfriend and upon enlarging them in a series of 'blow-up' shots, sees that it is a man with a gun (the same man he saw following him earlier). In the shots where Jane is running away with her back to the camera, Thomas also notices something on the ground in the distance. The blow-up shots of the blurred figure on the ground that Jane is running to appears to be a body in the grass. Thomas gets the feeling that he just witnessed the before and afterwards of a murder.Thomas is disturbed by a knock on the door, but it is only the two girls again, with whom he has a group-sex romp in his studio and falls asleep. Awakening, he finds they hope he will photograph them but he tells them to leave, saying, \"Tomorrow! Tomorrow!\"As evening falls, Thomas goes back to the park to investigate and finds a dead body (Jane's dead lover), but he has not brought his camera and is scared off by a twig breaking, as if being stepped on by someone unseen watching him. Thomas returns to his studio to find that someone (possibly Jane and her gunman accomplice) has broken into his place and all the negatives and prints from the park are gone except for one large, very grainy blowup showing the body (which proves nothing). He tries to call the phone number Jane gave him, but learns from the operator that the number does not exist.After driving into town, Thomas sees Jane walking alone on a sidewalk and he pulls his car over and follows her on foot into a night club where The Yardbirds, featuring both Jimmy Page and Jeff Beck on guitar, are seen playing. Thomas moves to confront Jane, but she sees him and runs. Thomas loses her on the crowded street.Thomas then goes to a drug-drenched party in a house on the Thames near central London. He finds a strung-out Veruschka, who had told him that she was going to Paris, and when confronted, she says she is in Paris. Thomas then meets his agent Ron (Peter Bowles), whom he wants to bring to the park as a witness to show the dead body. However, Thomas (after taking a few puffs from a joint given by a party guest) cannot put across what he has photographed. Ron invites him to stay and they take LSD. Waking up in the house at sunrise after the party, Thomas takes a spare camera from Ron's house with film in it and goes back to the park alone to take photos of the murder victim, but the body is gone without any trace.Befuddled and emotionally defeated, Thomas (aware that someone has just gotten away with murder), begins walking out of the park when, he watches a group of mimes arrive and play a mimed tennis match. Thomas is drawn into it when the mimes beckon him to retrieve their imaginary tennis ball that they have \"lost\". Beat and deciding to play along, Thomas picks up the imaginary ball and throws it back to the two mimes playing. While he watches the mimes, the sound of the ball being played is heard. Thomas walks out of the park as his image fades away, leaving only the grass as the movie comes to an end."}