{"mid": "BluesBrothers2000", "IMDB_id": "tt0118747", "title": "Blues Brothers 2000", "plot": "Elwood Blues (Dan Aykroyd) is released from prison after serving eighteen years for the events of the previous film and is informed that his brother, \"Joliet\" Jake Blues (John Belushi) has died. He is picked up by Matara (Shann Johnson) a friend who works for his former drummer Willie Hall who wants to help him get back on his feet.\nBefore meeting up with Willie, Elwood asks to be dropped off to see Sister Mary Stigmata (Kathleen Freeman) who is now working at a hospital after the orphanage was closed. She informs him that Curtis (Cab Calloway) has also died but fathered an illegitimate son Cabel Chamberlain (Joe Morton) who is an Illinois State Police commander, and introduces him to an orphan Buster (J. Evan Bonifant) to suggest mentoring him.\nAgainst Stigmata’s advice, Elwood tracks down Cabel at his police department to inform him of his real father and asks him to join The Blues Brothers Band that he plans on reforming. Cabel, upset by the news and offended by the suggestion to join him after seeing Elwood's and Jake's criminal history, throws him out of the building where Buster steals his wallet containing enough money for Elwood to purchase a new Bluesmobile.\nElwood and Buster begin tracking down members of the former band to recruit them from their current jobs. Willie runs a strip club and joins after it is burned down by the Russian mafia because Elwood enlisted the help of Willie’s barman \"Mighty\" Mack McTeer (John Goodman) to try and convince them to leave the club alone. Another member Matt \"Guitar\" Murphy joins again at the advice of his wife (Aretha Franklin) who now run a Mercedes-Benz dealership together. Three members work at a radio station and quickly agree to join, and finally Murphy Dunne joins after his boss at call center gives him permission.\nThe newly reformed band uses their old agent to book them a show. On the way to the show they are followed by Cabel and the Illinois state police who are now looking for Elwood for stealing Cabel’s wallet earlier, and believing that he has kidnapped Buster. While avoiding the police Elwood interrupts a Militia group meeting unintentionally destroying their boat full of explosives they planned to use. The Band arrives at the show to find they have been mistakenly booked as a Bluegrass Band but perform the show anyway. Afterward they evade capture by the police, but they catch up with them at a Tent revival where Reverend Cleophus James (James Brown) is preaching. Before Cabel can arrest them he has an epiphany brought on by Reverend Cleophus that he should join the band instead of being a police officer. The Band evades capture once more now with Cabel joining them who the police believe they have brainwashed.\nThe band continues on to their next booking, a tryout for a Battle of the Bands put on by Queen Mousette (Erykah Badu) who Mack informs is allegedly a 130 year old voodoo witch. Queen Mousette requests the band play something Caribbean, and when Elwood beings to explain they don’t play that kind of music, she casts a spell on them to play anyway. Mousette accepts the band into the battle, however Elwood, Mack, and Cabel are turned to stone statues.\nAt the show, Queen Mousette undoes the spell to allow The Blues Brothers band to play against The Louisiana Gator Boys; a supergroup of blues musicians who they lose the battle to. After the battle the show is interrupted by the arrival of the Russian mafia and the Militia group from earlier who are turned into rats by Queen Mousette. The Illinois state police arrive but stand down after Cabel informs them that he is all right. Elwood suggests that two bands jam together on stage, and uses the performance as cover when Sister Mary Stigmata arrives to say goodbye to Cabel and Mack and escape with Buster with the police giving chase."}