{"mid": "BlueCatBlues", "IMDB_id": "tt0049020", "title": "Blue Cat Blues", "plot": "A depressed Tom sits on the railroad tracks, bent on suicide. Watching from a bridge above the tracks overhead, Jerry laments his old friend's state. Jerry knows that when he gets home, his own friends will ask him why he didn't even try to stop Tom. Jerry believes that \"it's better this way, and for the first time since he met her, he will be happy\". Jerry recalls the events leading up to Tom's depression:\nTom and Jerry are inseparable friends, until a beautiful white female cat catches Tom's eye. The white cat initially reciprocates Tom's affections, but that soon changes for the worst: the much-wealthier Mr. Butch lives next door to the white cat and he also becomes smitten by her. He rudely interrupts her relationship with Tom to make his move and ignores Tom's attempts to stop him. Attracted by Butch's wealth, the white cat proves herself to be an opportunist as Jerry always suspected her to be and leaves Tom.\nHaving seen the white cat for who she is and how she has made a fool of his best friend, Jerry urges Tom to give up and let Butch have her. Ignoring Jerry's warnings, Tom pushes himself and his finances to the limit and beyond, in futile attempts at winning back the white cat's affections. He brings her such presents as flowers, perfume, a diamond ring (with the diamond so small it has to be looked at with a magnifying glass), and a car (an utter jalopy, for which Tom literally sold himself into slavery – 20 years of it – so that he could cover 26 years' worth of payments at the annual interest rate of 112%). However, because Butch's presents are much bigger, to the point of outrageous extravagance (a large floral wreath, a tanker truck full of perfume, a ring with a diamond so large and shiny that it could not be looked at without eye protection, and an extremely long luxurious car), the white cat rejects the desperate Tom. After this incident (the refusal of his jalopy), Tom gives up all hopes of gaining the white cat and falls into a depression.\nBroken-hearted, penniless and hopelessly in debt, Tom drowns his sorrows in milk – despite Jerry's pleas for him to stop. Tom almost lets himself go down the gutter (literally), but Jerry rescues him. As Jerry resuscitates Tom, they both see the white cat riding by in Butch's coupe, laden with luggage and a \"Just Married\" sign on the back.\nJerry breaks from the sad story to think about his own girlfriend, \"Toots\". He is happy that, unlike Tom's ex-girlfriend, she has been faithful. Suddenly, Jerry's love world is shattered when Toots rides by with another mouse (who looks like an adult Tuffy), a \"Just Married\" sign on the back of their car. Jerry, now dejected, joins Tom on the railroad tracks. They sit and wait for an oncoming train, which draws near to run over them. The oncoming train's whistle sounds louder as the cartoon fades out."}