{"mid": "BobsBurgers", "IMDB_id": "tt1561755", "title": "Bob's Burgers", "plot": "The show centers on the Belcher family—Bob, Linda, and their children Tina, Gene, and Louise—who run a hamburger restaurant on Ocean Avenue in an unnamed seaside community (informally known as \"Seymour's Bay\" among the show's writing staff). While series creator Loren Bouchard has said that the show's location was an indeterminate Northeastern United States shore town, calling the setting a \"semi-Springfield\", some critics, particularly for the episode \"It Snakes a Village\", have deduced that the unidentified setting appears to actually be southern New Jersey.\nBob's Burgers is located in a green two-floor building that features an apartment on the second floor where Bob and his family reside. The restaurant is sandwiched between two other commercial buildings, one of which houses \"It's Your Funeral Home and Crematorium\", whose owner Mort is a regular at the restaurant. One of the show's running gags involves the other building, which is usually vacant during episodes but has been home to such businesses as \"Uncle Marty's Breast Pumps\", \"Extra Moist Yoga\", \"That's A-Door-A-Bell Doorbells\", and \"Tire-Rhea\".\nSuccess is not easy, as Bob must compete with several other eateries for business. His biggest rival is Jimmy Pesto's Pizzeria, which is located right across the street. It reels in way more customers than Bob's Burgers, creating tension between the two owners. Jimmy particularly enjoys humiliating Bob, such as when he got the high score on an arcade machine Bob had rented and taunted him by putting \"BOB SUX\" as his initials. The hatred between Bob and Jimmy Pesto is full of humor because, although they dislike each other very much, Bob's daughter, Tina shows obsessive interest toward Pesto's son, Jimmy Jr. However, it is often unclear how Jimmy Jr. feels toward Tina. He approves of her erotic friend fiction, starring himself, in \"Bad Tina\", but tends to forget they are dating because he is always occupied with activities, such as spending time with best friend and wrestling buddy, Zeke, and dancing by himself.\nBob's restaurant also has seen its fair share of bad luck. For example, in the show's opening, the property falls victim to a fire, an infestation of vermin, and a broken front window caused by a car knocking down a utility pole. In spite of all this, Bob does have a small but loyal group of regular customers, including the aforementioned Mort and Teddy, the local handyman."}