{"mid": "Bordertown", "IMDB_id": "tt0445935", "title": "Bordertown", "plot": "The opening titles explain that American corporations are using the North American Free Trade Agreement by opening large maquiladoras right across the United States–Mexico border. The maquiladoras hire mostly Mexican women to work long hours for little money in order to produce mass quantity products.\nLauren Adrian (Jennifer Lopez), an impassioned American news reporter for the \"Chicago Sentinel\" wants to be assigned to the Iraq front-lines to cover the war. Instead, her editor George Morgan (Martin Sheen) assigns her to investigate a series of slayings involving young maquiladora factory women in a Mexican bordertown.\nWorker Eva (Maya Zapata), originally from the southern Mexican state of Oaxaca, takes a bus to go back to her shanty-town home after work. After a while she is the last passenger still in the bus. The driver asks her if she minds if he goes to a gas station to fill up, and Eva agrees. However, he takes her to a remote place and assaults and rapes her, together with another man, who then tries to strangle her. The two men, believing she's dead, bury her alive. With the little energy she has left, Eva escapes.\nAdrian heads to Ciudad Juárez, Chihuahua, on the U.S.–Mexico border to investigate the murders, hoping that if she does well she will be promoted by Morgan to be a foreign correspondent. In Juárez, Adrian meets up with Diaz (Antonio Banderas), whom she had been working with six years before, and who is now the editor for the local newspaper \"El Sol de Juárez\". She also meets Eva.\nThe three try to find the two killers and have them prosecuted. For this purpose she starts working in the factory, in order to act as bait on the bus ride. The driver tries to assault her in the same way he did Eva, and although police assistance has been arranged, they are at the wrong place. She manages to escape her attacker. Later Diaz gets shot and killed in a drive-by shooting. Eva changes her mind and does not want to testify any more for fear of revenge, and tries to flee to the U.S., together with others in the trunk of a car. She gets caught and is sent back. Adrian convinces her to testify after all. For political reasons the Chicago Sentinel refuses to publish Adrian's story. Adrian quits and becomes the editor for El Sol de Juárez."}