{"mid": "BossNigger", "IMDB_id": "tt0072725", "title": "Boss Nigger", "plot": "Upon finding a wagon under attack by bandits, two black bounty hunters, Boss and Amos (Fred Williamson and D'Urville Martin, respectively) intervene and save Clara Mae, a black woman (Carmen Hayworth). Upon inspecting the bodies, the bounty hunters find several have rewards to their name and one holds a letter from the mayor of the nearby town San Miguel inviting him to become sheriff on the recommendation of fugitive Jed Clayton (William Smith). The pair take Clara Mae to safety in San Miguel and meet Mayor Griffin (R.G. Armstrong). Knowing that there is no sheriff and holding proof that the mayor intended to give it to a gang member, Boss is able to outsmart the mayor and intimidate other members of the town council into giving him the position. As sheriff, Boss and Amos keep the peace and enforce several \"Black Laws\" such as issuing fines or periods in jail for calling either of them a \"nigger\" in public. In his duties Boss meets Miss Pruit (Barbara Leigh), a white schoolteacher, who initially offends Boss by talking of the fond memories she has of her family's black slaves, but earns his forgiveness and develops a romantic interest in him. When a gang of Jed Clayton's men meet the mayor in the town saloon to extort supplies from the town (an arrangement that the mayor allows on the understanding that the gang will do no harm to the town or its citizens), Boss and Amos kill one gang member and arrest two more - with one prisoner being killed as he attempts to escape town assisted by the mayor.\nJed and his outlaws then attempt to help the imprisoned outlaw escape by blowing a hole in the prison wall using dynamite. During the resulting raid on the town Clara Mae is kidnapped and taken away by Jed's men, while a Mexican child named Poncho (whom Boss had befriended) is killed. Boss attempts to meet Jed and his gang at their hideout but is himself kidnapped, tied to a pole, and tortured. When Jed leaves at night to meet with the mayor, Amos is able to rescue an injured Boss with the help of Clara Mae, taking him to Miss Pruit's house to recover. Knowing that Jed and his men will be riding through town the next day on their supply run, the bounty hunters plan an ambush.\nWith the assistance of other residents such as the doctor and blacksmith of the town, Boss and Amos prepare by planting explosives around the town and take up firing positions out of sight. As the gang rides into town, they enter the cantina where Clara Mae is living. When she refuses Jed's advances, he murders her. They then move on to the town itself, while Boss and Amos launch their surprise attack. Boss follows Jed into the Saloon where they fight, and Boss finally kills Jed. As Boss steps outside, he is shot twice by Mayor Griffin, but manages to kill his attacker by throwing a knife at his chest. Now seriously wounded, Boss pleads with Amos to not let him \"die in a white folks' town\". Miss Pruit urges Boss to take her with him, though he declines. The movie concludes as Amos rides out of town with Boss towed on a wagon, his fate left ambiguous."}