{"mid": "BriansSong", "IMDB_id": "tt0068315", "title": "Brian's Song", "plot": "The movie begins as Chicago Bears running back Gale Sayers (Williams) arrives to team practice as an errant punt is sent to Sayers. Running back Brian Piccolo (Caan) goes to retrieve the ball, and Sayers flips it to him. Before Sayers meets with coach George Halas (Jack Warden) in his office, Piccolo tells him – as a prank – that Halas has a hearing problem, and Sayers acts strangely at the meeting. Sayers pranks him back by placing mashed potatoes on his seat while Piccolo is singing his alma mater's fight song. During practice, Piccolo struggles while Sayers shines. Sayers and Piccolo are placed as roommates, a rarity during the racial strife at the time. Sayers quickly becomes a standout player, but he injures his knee in a game against the San Francisco 49ers. To aid in Sayers' recovery, Piccolo brings a weight machine to his house. In Sayers' place, Piccolo rushes for 160 yards in a 17–16 win over the Los Angeles Rams, and is given the game ball. Piccolo challenges Sayers to a race across the park, where Sayers stumbles but wins. Piccolo is given the starting fullback position, and both he and Sayers excel. But Piccolo starts to lose weight and his performance declines, so he is sent to a hospital for a diagnosis. Soon after, Halas tells Sayers that Piccolo has cancer. In an emotional speech to his teammates, Sayers states that they will give Piccolo the game ball. After a game against the St. Louis Cardinals, Sayers visits Piccolo's wife, who reveals that Piccolo has to have another surgery for his tumor. After he is awarded the \"George S. Halas Most Courageous Player Award\", Sayers dedicates his speech to Piccolo, telling the crowd that they had selected the wrong person for the award and saying, \"I love Brian Piccolo, and I'd like all of you to love him, too. And tonight, when you hit your knees, please ask God to love him.\" In a call, Sayers mentions that he gave Piccolo a pint of blood while he was in critical condition. Piccolo dies with his wife by his side. The movie ends with a flashback of Piccolo and Sayers running through the park, while the narrator says that Piccolo died at age 26 and is remembered as he lived, rather than how he died."}