{"mid": "BridgeOfSpies", "IMDB_id": "tt3682448", "title": "Bridge of Spies", "plot": "Set in 1957, at the height of the Cold War, both the United States and Soviet Union employed spies against each other out of fear regarding the nuclear capabilities of one another.In Brooklyn, Rudolf Abel (Mark Rylance) is painting a self-portrait. He receives a phone call. He never speaks but only listens to what he hears. Abel leaves his apartment and walks around the city, unaware of a man, Agent Blasco (Domenick Lombardozzi) stepping out of a cab to follow him. Blasco follows Abel through the subway station where he is joined by Agent Gamber (Victor Verhaeghe). Abel ends up at a park where he sits on a bench to paint. He recovers a coin under a bench. He returns to his apartment and uses a razor to split the coin open, where he finds that it contains a piece of paper. Soon, Blasco and Gamber, joined by other FBI agents, storm into Abel's home and arrest him for espionage.We meet lawyer James B. Donovan (Tom Hanks) in his workplace discussing a client with his co-worker. He is brought into the office of his associate Thomas Watters Jr (Alan Alda) to discuss the case of Abel. Donovan is given the report on Abel's case, and Donovan knows what kind of reputation he would gain for defending a suspected spy.Donovan has dinner with his wife Mary (Amy Ryan) and kids Carol (Eve Hewson), Roger (Noah Schnapp) and Peggy (Jillian Lebling). Carol is upset because her date stood her up. Donovan tells his family about the case, just as his other co-worker Doug Forrester (Billy Magnussen) enters with documents involving the case.In a motel room, pilot Francis Gary Powers (Austin Stowell) is undergoing a lie detector test. Later, he and a group of fellow pilots are brought into a room where they are told their mission - they are to become spies for the CIA to detect any nuclear activity occurring in the Soviet Union.Donovan meets with Abel in prison. Abel never admits to any wrongdoing and doesn't want to fully cooperate with the United States government.On a rainy night, Donovan is followed by CIA Agent Hoffman (Scott Shepherd). The two sit together at a bar where Hoffman tries to get Donovan to tell him what Abel is telling Donovan, for the sake of the country, though Donovan refuses to say anything.The pilots are brought into the Peshawar Air Station to see the U-2 planes that they will use in their mission, complete with cameras and the like.Roger's class watches a video on the dangers of nuclear warfare and the precautions that ought to be taken in the event of a catastrophe. He then sets up his own \"duck and cover\" station at home, worrying his father.Abel's trial begins, and nobody is on Donovan's side. The people in court think Abel deserves the death penalty for his supposed crimes, and nobody thinks Donovan can get Abel acquitted. On the train, everyone that Donovan sees is reading unkind headlines for his case, and one woman on the train looks at him scornfully. To make things worse, someone shoots at the Donovan home one evening, harming no one, but also not earning any sympathy for the family as most of the country thinks Donovan is a traitor.By the end of the trial, Abel is found guilty on all charges, but Donovan convinces the judge to give him a 30 year prison sentence instead of the death penalty.Powers and his comrades undergo their mission over the USSR. His plane suddenly takes a hit as it's shot down by a ground-to-air missile. He goes down but manages to eject himself from the plane and sail down on his parachute. Powers is later captured and held by the Soviet Union.In West Germany, American student Frederic Pryor (Will Rogers) rides his bike by the construction site of the Berlin Wall, to meet his girlfriend Katje (Nadja Bobyleva). Pryor is confronted by East German Stasi agents who find him suspicious. He shows off his books to prove he is a student, but he is subsequently arrested.With both American men in detainment, an exchange is planned between the U.S. and USSR to trade Abel for Powers. However, Donovan thinks they should get Pryor back as well. The CIA only wants Powers back, but Donovan plans to make a negotiation regardless. He travels to East Germany to meet with Wolfgang Vogel (Sebastian Koch), a German lawyer who can broker a deal. Donovan meets three people posing as Abel's family before meeting Vogel. Donovan sees through the ruse, however.During his time in East Germany, Donovan is forced to stay in a cold and crummy hotel room. As he passes by the wall on the train, he sees several East Germans trying to climb over the wall to escape, but they are shot down by guards. The sight of this horrifies Donovan.The East German government refuses to give up Pryor after learning that the USSR was involved in the negotiation. While the CIA thinks they should leave Pryor, Donovan makes a bold move by threatening the East German government. If Pryor is not released to them, the whole deal is off, and Abel would be interrogated, leaving bad blood between Germany and the USSR.The men on both sides meet on the Glienicke Bridge. Powers's buddy Joe Murphy (Jesse Plemons) is brought over to confirm that it is definitely Powers on the other side. Meanwhile at Checkpoint Charlie, Pryor is brought over. After he is confirmed, the exchange is made, and Abel crosses over to the other side, but not before letting Donovan know that he left him a gift. The two men share one final look before departing the bridge. On the plane ride, Powers tells Donovan that he never told his captors anything, to which Donovan states that none of it matters anymore. He then opens the gift from Abel, which is a painting of Donovan himself.Donovan returns home to his family. The kids see the news story on the exchange and are shocked to hear their dad's name mentioned, thinking he was away on a fishing trip. Mary then walks into the bedroom to find her husband lying there, resting comfortably at last.Donovan rides the train where he sees people are now reading positive headlines. The lady who stared at him earlier now looks at him with a smile. As he looks out the window, he sees children climbing over a fence, reminding him of what he saw in Germany.The ending text states that Rudolf Abel returned home and was never acknowledged as a spy. Francis Gary Powers died when his plane crashed in 1977. Frederic Pryor went on to become a professor at Swarthmore College. James B. Donovan was asked by President Kennedy to negotiate the release of 1,000 Cuban exile prisoners from Cuba after the failed 1961 Bay of Pigs invasion. He would eventually get over 9,000 men, women, and children released."}