{"mid": "BriefEncounter", "IMDB_id": "tt0037558", "title": "Brief Encounter", "plot": "In the latter months of 1938, Laura Jesson (Celia Johnson), a respectable middle-class British woman in an affectionate but rather dull marriage, tells her story while sitting at home with her husband, imagining that she is confessing her affair to him.\nLaura, like many women of her class at the time, goes to a nearby town every Thursday for shopping and to the cinema for a matinée. Returning from one such excursion to Milford, while waiting in the railway station's tea shop, she is helped by another passenger, who solicitously removes a piece of grit from her eye. The man is Alec Harvey (Trevor Howard), an idealistic doctor who also works one day a week as a consultant at the local hospital. Both are in their late thirties or early forties, married and with children.\nEnjoying each other's company, the two arrange to meet again. They are soon troubled to find their innocent and casual relationship quickly developing into something deeper, approaching infidelity.\nFor a while, they meet openly, until they run into friends of Laura and the perceived need to lie arises. The second lie comes easier. They eventually go to a flat belonging to Stephen (Valentine Dyall), a friend of Alec's and a fellow doctor, but are interrupted by Stephen's unexpected and judgmental return. Laura, humiliated and ashamed, runs down the back stairs and into the streets. She walks for hours, sits on a bench and smokes, and is confronted by a police officer, with the implication that she could be perceived as a \"streetwalker.\"\nThe recent turn of events informs the couple that both an affair and a future together are impossible. Realizing the danger and not wishing to hurt their families, they agree to part. Alec has been offered a job in Johannesburg, South Africa, where his brother lives.\nTheir final meeting occurs in the railway station refreshment room, now seen for a second time with the poignant perspective of their story. As they await a heart-rending final parting, Dolly Messiter (Everley Gregg), a talkative acquaintance of Laura, invites herself to join them and begins chattering away, oblivious to the couple's inner misery.\nAs they realize that they have been robbed of the chance for a final goodbye, Alec's train arrives. With Dolly still chattering, Alec departs with a last look at Laura but without the passionate farewell for which they both long. After shaking Messiter's hand, he discreetly squeezes Laura on the shoulder and leaves. Laura waits for a moment, anxiously hoping that Alec will walk back into the refreshment room, but he does not. As the train is heard pulling away, Laura is galvanized by emotion and, hearing an approaching express train, suddenly dashes out to the platform. The lights of the train flash across her face as she conquers a suicidal impulse. She then returns home to her family.\nLaura's kind and patient husband, Fred (Cyril Raymond), suddenly shows not only that he has noticed her distance in the past few weeks but that he has perhaps even guessed the reason. He thanks her for coming back to him. She cries in his embrace."}