{"mid": "Brimstone", "IMDB_id": "tt0041210", "title": "Brimstone", "plot": "Revelation\nDakota Fanning plays Liz, who lives with her husband and two children (one is a 14 yr old boy from her husband's prior marriage, the other is a young girl) in the old west. She is a midwife, but is mute and communicates through sign language. A new reverend (Guy Pearce) comes to their church. The moment Liz hears his voice she is terrified. She is convinced the man is dangerous. Eli, her husband does not believe her. Slowly it becomes clear she is right as strange and nasty things start to happen, even though her husband thinks it is done by Nathan, a man whose newborn baby died during labor and blames Liz who delivered it. Liz decides she is going to murder him and sneaks off at night. When she finds her daughter's doll in the bed of The Reverend instead of him, she understands her family is in danger. As she is rushing back her husband Eli gets knifed by The Reverend, and left to die as she returns. Her husband's final request is for his son to take them up in the mountains where grandpa (his father) lives. With a horse and carriage, Liz and her two children manage to flee from The Reverend as he sets the farm on fire.\nExodus\nA young girl named Joanna (played by Emilia Jones) walks exhausted through the desert and is picked up by a Chinese family. She's sold in a bar/brothel, in the mining town Bismuth, owned by Frank (Paul Anderson). A prostitute named Sally takes care of her and makes sure Frank and other men do not sexually abuse her. But when Sally shoots a violent customer she is hanged, leaving Joanna behind. Frank has sex with her. A few years later Joanna works in 'Frank's Inferno' as a prostitute and is now played by Fanning, revealing that Joanna and Liz are the same person. However, she can talk. Her friend is another prostitute, named Elizabeth. One day, she bites the tongue of an abusive customer, for which Frank cuts off her tongue as punishment. Now being a mute, Joanna teaches her sign language from a book the doctor gave her. Elizabeth plans to sneak out of Bismuth and makes arrangements through a marriage broker. On a photograph we see Eli and his son. As Joanna is helping Elizabeth preparing to leave, The Reverend shows up in the brothel. He pays to take Joanna to a room where things get violent and Elizabeth runs in with a knife to save her. She saves her from being whipped, but she is killed by The Reverend. Joanna proceeds to grab the knife and slashes the throat of The Reverend. Joanna takes Liz's clothes and identity, and cuts out her own tongue in order to be able go to Eli, who has never seen Elizabeth, and marry him.\nGenesis\nIn the desert a couple of dead bodies are lying around. It is the aftermath of some violent dispute over stolen gold. Two men are alive, Samuel (played by Kit Harington) and Wolf (Jack Roth) are badly wounded. Young Joanna (again played by Emilia Jones) lives with her mother (Anna, played by Carice van Houten) and father, who is revealed to be The Reverend. They are part of a Dutch community who came over from The Netherlands to establish a purer form of Christianity. Anna does not want to go to bed with her husband which infuriates him. As he is preaching in church, he humiliates her in front of the whole congregation and at night he chastises her with a cat o' nine tails. Joanna gets her first period and her father tells her she's become a woman. Samuel and Wolf arrive at the farm and without telling her parents, she hides the outlaws and takes care of them. The Reverend's sexual interests are shifting more and more towards his daughter, who is a full grown woman in his eyes. To prove that to God, he allows her to slaughter a pig. When Samuel gets the chance he murders Wolf, and Joanna sees him strangling him. The outlaw explains Wolf would have done it to him, if he hadn't killed him. He urges Joanna to not be like her mother, who will always turn the other cheek. When Anna confronts The Reverend with his intentions toward their daughter, he beats her up and has a scold's bridle made for her. Anna commits suicide in church in front of the whole congregation by hanging herself. That night Joanna offers herself to Samuel, but he declines. The next day The Reverend takes Joanna to church and starts to perform a wedding ceremony between himself and his daughter. Samuel comes in to rescue her, but The Reverend kills him. Angry she has hidden this man from him The Reverend drags her towards their house through the mud. She screams that she loves Samuel and enrages her father when she admits she lusted after him. After The Reverend whips Joanna, he rapes her. In the morning she runs off, away from her sleeping father.\nRetribution\nThe story returns to Liz (Dakota Fanning). With her children, Sam and Matthew, she is plowing through the snow to go to the home of Eli's father, up in the mountains. When they cross a frozen lake, Matthew is shot by The Reverend and dies. Liz and Sam reach their destination. As Liz is guarding the house, The Reverend shows up again. He tells her that God has provided him with an alternative again and that he will do exactly to her daughter what he did to Liz. When Liz runs in to protect Sam, she finds Eli's father dead; The Reverend already killed him. Liz and Sam try to escape The Reverend yet again, but he catches them. He ties Liz up and whips her daughter. As he is undressing to rape her daughter, Liz manages to break free and set fire to him. With a rifle she shoots him out of the window.\nQuite a while later Liz has turned Eli's place into a saw mill where she lives with her young daughter. But Nathan turns up to arrest her. He tells her that it was The Reverend who instructed him to go to Bismuth to start a new life. He became a deputy and when the old sheriff died, the town chose him as the new one. He then found the 'Wanted Poster' of Elizabeth Brundy, a woman without a tongue. It turns out the original Elizabeth killed Frank, just before she turned up to save Liz/Joanna and Nathan is coming to take her back and hang her. As Nathan is escorting her off on a ferry, Liz looks at the unknowing Sam, who seems to be doing fine without her. Not wanting to be subjugated to the will of another once more, Liz decides to throw herself in the lake and drown. When Sam is a grown woman with a child of her own, she thinks of her mother. She has always felt her presence, as though she was watching over her. As she is walking towards the house, it seems somebody watches her from the trees. Sam seems to feel it, looks towards the trees and smiles. She and her daughter go in."}