{"mid": "BroadwayDannyRose", "IMDB_id": "tt0087003", "title": "Broadway Danny Rose", "plot": "The story of Danny Rose (Woody Allen) is told in flashback, an anecdote shared amongst a group of comedians over lunch at New York's Carnegie Deli.\nRose's one-man talent agency represents countless unorthodox, unsuccessful entertainers, including washed-up lounge lizard Lou Canova (Nick Apollo Forte), whose career is on the rebound. On those rare occasions any of Danny's acts do succeed, they invariably leave him for better representation.\nLou, who has a wife and three kids, is having an affair with a woman, Tina (Mia Farrow), who had previously dated a gangster. Lou wants her to accompany him to a big gig Danny has landed for him at the Waldorf Astoria, where he will perform in front of Milton Berle, who could potentially hire him for even bigger things.\nAt the singer's insistence, Danny acts as a \"beard,\" masquerading as Tina's boyfriend to divert attention from the affair. Tina's ex-boyfriend is extremely jealous, and believing Tina's relationship with Danny to be real, he orders a hit on Danny, who finds himself in danger of losing both his client and his life.\nDanny and Tina narrowly escape, as Danny at gunpoint says Tina's real boyfriend is one of Danny's clients who Danny believes is on a cruise for a few weeks. Danny and Tina escape and show up at the Waldorf to find Lou drunk and unprepared to perform. Danny sobers Lou with a unique concoction that he has come up with over the years; Lou sobers up, and gives a command performance. With a new prestigious talent manager in attendance at the performance, Lou, in front of Tina (and with her encouragement), fires Danny and hires the new manager. Danny, feeling cheated, goes to the Carnegie Deli where he hears that the client he ratted on to save himself was beaten up by the hit men and is now in the hospital. Danny goes to the hospital to console his client and pays his hospital bills.\nLou, who has left his wife and kids to marry Tina, becomes a success. Tina, feeling guilty for not sticking up for Danny, is depressed and they eventually split up. It is now Thanksgiving and Danny is hosting a party with all of his clients there. Tina shows up to the door and apologizes, asking Danny to remember his uncle Sidney's motto, \"acceptance, forgiveness, and love.\" At first Danny turns Tina away, but later catches up with her and they appear to make up. During this closing shot, the voiceover of the group of comedians talking about the story is heard. They praise Danny, and say that he was eventually awarded Broadway's highest honor: a sandwich at Broadway's best-known deli was named after him."}