{"mid": "BrokenTrail", "IMDB_id": "tt0482857", "title": "Broken Trail", "plot": "Part 1\nIn San Francisco in 1898, countless Chinese girls are sold into slavery and brought to the American West to live as prostitutes among the miners and railway workers. Capt. Billy Fender (James Russo) arrives in San Francisco and purchases five Chinese girls to be sold as prostitutes in Idaho.\nIn southeastern Oregon, Prentice \"Prent\" Ritter (Robert Duvall), an aging cowboy, arrives at the Gap Ranch to inform his cowboy nephew, Tom Harte (Thomas Haden Church), that his mother died. Estranged from her son years earlier after he left the family ranch to become a buckaroo, she left behind a brief impersonal note informing her son that she left everything in her will to her brother Prent. Uncomfortable with her unfair decision, and wanting to reconnect with his nephew, Prent tells him about his plan to transport 500 horses from Oregon to Sheridan, Wyoming, where he will sell them to the British Army. He offers Tom 25% of the profits if he joins him in the business venture.\nAfter purchasing 500 horses from various ranches in the region, Prent and Tom head out east with the herd toward the Idaho border. Along the way, Prent sends Tom into a nearby town to purchase supplies. At the local saloon, he purchases three bottles of whiskey. When the bartender attempts to throw out an Irish fiddler named Heck Gilpin (Scott Cooper), Tom intervenes and punches out the bartender. He hires the fiddler to accompany them on their venture.\nBack on the trail, they meet Capt. Billy Fender and his five Chinese girls. Fender asks if he can follow along and Prent agrees. That night, Fender offers the cowboys sex with one of the Chinese girls, but they decline. Later, Fender drugs the cowboys' whiskey, and while they sleep, he steals their money and saddled horses and escapes with one of the girls, leaving the other Chinese girls behind. The next morning, the men realize what's happened, and Tom rides off in search of Fender. He finds him in a drunken sleep after he's raped the girl. Tom hangs Fender from a tree and heads back to camp with the girl.\nMeanwhile, Prent becomes acquainted with the Chinese girls who are taught to call him \"Uncle Prent\". Unable to bridge the language gap, Prent assigns numbers to the girls, naming Ghee Moon (Jadyn Wong) #1, Mai Ling (Caroline Chan) #2, Sun Fu (Gwendoline Yeo) #3, Ye Fung (Olivia Cheng) #4, and Ging Wa (Valerie Tian) #5. After Tom returns with #4, the group continues east across Idaho. As the oldest of the girls, #3 explains to the others that these men are good and will protect them. Along the way, Tom teaches #3 how to drive the wagon, and Prent teaches #5 how to ride a horse. One night, #2 develops a tick fever. While Tom watches over her during the night, she dies. The next morning, after they bury her, Prent speaks over the grave: \"We're all travelers in this world. From the sweet grass to the packing house, from birth 'til death, we travel between the eternities.\"\nMeanwhile, a hired killer named Ed \"Big Ears\" Bywaters (Chris Mulkey) rides into the town of Caribou City, Idaho where he meets up with \"Big Rump\" Kate Becker (Rusty Schwimmer), the woman who runs the city and its illegal activities. Fender was supposed to deliver the five Chinese girls to Kate, who provided him with the money. She offers to pay Ed to bring the girls back to her, but he is more interested in abusing one of Kate's prostitutes, Nola Johns (Greta Scacchi).\nBack on the trail, Prent and his outfit meet up with two strangers, one of whom Prent identifies as Smallpox Bob, and proceeds to gun him down. He orders Tom to kill his companion and his horse. Smallpox Bob infected thousands of Indians by selling them smallpox-infected blankets. Afterwards, they burn Bob and his companion and their horses and blankets. As the flames rise, the ghosts of their Indian victims dance over the flames. That night, #3 notices a hole torn in Tom's shirt, and she mends the shirt while he sleeps. A silent attraction has grown between the two.\nThe next day, Prent orders Tom and Heck to take the girls into the town of Caribou City and find someone who will take care of them. In town, after finding a room for the girls, Tom meets Lung Hay (Donald Fong) who is able to speak with the girls in their native language. Lung Hay explains to Tom that the girls do not want to leave Tom, Prent, and Heck—that they do not feel safe without them. Later at the saloon, Tom and Heck meet \"Big Rump\" Kate, who offers them one of her whores. After they decline, she demands that they hand over the Chinese girls whom she paid for when she hired Fender.\nBack at the girls' room, three men break in and attack the Chinese girls wanting to rape them. Nola Johns hears the nearby screams and rushes in to help them, only to be hit in the face by one of the attackers. Tom and Heck rush in, throw one man out the window and beat up another. They throw the third man to the floor, and Tom shoots both of his thumbs off. Nola begs Tom to take her with them for her protection. As they all prepare to leave town, Kate and her henchmen approach, but Tom draws his weapon and guards his party as they leave. Kate vows to take revenge.\nPart 2\nPrent and his group recover from their ordeal, as Tom stitches the wound on Lung Hay's head, and Prent treats Nola's broken nose. They decide to spend several days resting the horses by the Snake River. Prent sees two men fly fishing and wishes he could try it someday. At night the men talk about the unfathomable mysteries of women, and they all enjoy listening to Heck's fiddle music. They begin to reveal more about themselves. Lung Hay left his wife in China many years ago to follow the promise of gold in America. Nola turned to prostitution after her husband killed himself. Heck was educated back east, but the prospect of adventure led him out west. Prent and Nola begin spending more time together, but Prent—whose memory of his dead wife and seven-year-old daughter still haunt him—is cautious about his feelings for her. Tom and #3 also spend time with each other, going for long walks together. No one notices #4 growing more depressed and withdrawn. One afternoon on the trail, she steps in front of stampeding horses and is killed.\nPrent and his outfit continue east through Wyoming, encountering a band of Crow Indians who demand payment to pass through their land. They demand two horses. Prent insists on only one, but gives the Indians a small carved horse figure he made as the second horse. Further on, Prent and Tom sense that they are being followed. That night, Prent sits alone by the fire while the others hide nearby. Ed and his gang ride into the camp. They were hired by Kate to bring back the Chinese girls and kill the rest. Pretending to be Smallpox Bob, Prent scares them away with the help of Tom and Heck providing cover.\nAfter passing through Cody, Wyoming, Prent decides to head north through the Big Horn Mountains and over a steep pass known as the Whale's Back in order to avoid Ed and his gang. Tom wants to face the horse thieves and kill them, but Prent remains adamant. Although the way is steep, they manage to make it over with the horses safely. Eventually, Prent leads his horses safely into Sheridan, Wyoming, where he closes out the deal with Malcolm, who purchases the horses on behalf of the British Army. Afterwards, Prent and the others relax, bathe, and enjoy a good meal at Malcolm's home. That night, Prent gives Tom his share of the profits so he can start a new life.\nThe next day, after Tom rides off to gather in the strays, Ed and his gang show up in Sheridan and kill Heck. In the ensuing gun battle, Ed takes Nola, Lung Hay, and the girls hostage, forcing Prent to throw down his rifle. Just as Ed prepares to torture and kill Prent, the aging cowboy yells out a warning to Tom, who has just arrived back at the ranch. Tom rushes to the scene, aims, and shoots the gang members and wounds Ed. As the burly killer takes aim at Tom, Prent takes a heavy mallet and clubs Ed to death.\nSometime later, Nola and the girls prepare to board a stagecoach to San Francisco. Tom says goodbye to #3 as a gentle snow falls over them. She hugs Tom and boards the stage, but at the last minute, overwhelmed by feelings of love for the young cowboy, steps down with her bags. As the stage pulls away, Tom sees her standing there, and he smiles.\nIn 1912 at Siam Bend on the Snake River in Wyoming, Prent is fly fishing on his ranch when his longtime friend Lung Hay approaches with a letter from Nola, who has been corresponding with him for fourteen years. She writes that the girls are doing fine, and that her love for him has never wavered. In 1913, Heck's parents had his body disinterred and reburied in Richmond, Virginia. Ging Wa (#5) studied medicine at Stanford University and moved to China with Ghee Moon (#1) to start a hospital. They were lost in Mao Zedong's revolution. Tom Harte and Sun Fu married, and their grandchildren still ranch in Wyoming. Nola Johns was buried at Siam Bend on the Snake River. Prent rests at her side."}