{"mid": "Bronson", "IMDB_id": "tt1172570", "title": "Bronson", "plot": "The film begins with short scenes from Bronson's delinquent childhood and early life, narrated with a wry humor by Hardy as Bronson/Peterson. Initially he is shown confronting the camera directly, dressed in prison garb; other times he is shown telling his tale in a vaudeville-style theater in front of a live audience who laughs and applauds at his stories. The film's story is not told in a purely linear fashion but unfolds as a surreal narrative of connected vignettes, punctuated by vaudeville interludes which sometimes break into the film at unexpected times.\nHe recounts various episodes of criminal behavior and violence which lead to his being sentenced to seven years in prison. At his sentencing, his mother optimistically declares her hope that he'll get out in four years. While in prison, however, he engages in numerous violent outbursts, assaulting prison guards and fellow prisoners alike, which results in his sentence being extended beyond seven years.\nEventually Peterson is sent to a psychiatric hospital where he continues to rebel against those charged with the duty of controlling him. In response, Peterson is kept heavily drugged which makes him physically weak. His first escape attempt is merely to walk sluggishly toward the exit until he is calmly thwarted by a staffer standing nearby who waves him into a chair. Later, he decides to escape by earning himself a transfer back to prison. He attempts to strangle another detainee with his socks, but is apprehended before killing the man, which means he will not be transferred. He comments to the audience that despite all his prison time and solitary confinement, he has never yet killed anyone.\nIn the vaudeville theater, Peterson/Bronson shows film footage of a rooftop protest during which he escaped to the institution's roof and managed to cause what he calls \"tens of millions of pounds' damage\". He credits this destruction with the government's subsequent decision to declare him \"sane\" and have him released.\nAfter a brief reunion with his parents, who have moved to a small suburban home, he sets off to see his Uncle Jack in Luton, where he was raised. He is welcomed back and reintroduced to an old prison mate, who promises to set him up with a new career as a bare-knuckle boxer and gives him the new name Charles Bronson, after the famous American actor.\nBronson enters the world of bare knuckle boxing and seems to enjoy both the violence and showmanship involved. Not content with his meagre winnings, he ups the stakes by fighting two opponents at once, and even fights a dog. Banged up and in love, Bronson proposes to a woman he met at his uncle’s, but she tells him she loves another man, \"her boyfriend.\" Bronson steals a thousand-pound ring in the hopes that she will marry him. She declines, stating she plans to marry her boyfriend, and anyway Bronson is shortly apprehended and brought back to jail.\nThus after sixty nine days of freedom he once again finds himself imprisoned. He kidnaps the prison librarian and calmly waits for reinforcements to arrive, alternatively screaming at his hostage and peaceably asking him about his family. When he hears the other guards arriving, he strips naked and forces the librarian to assist in covering his body with \"war paint,\" which is actually petroleum jelly meant to make him harder to grab a hold of for the imminent brawl. After being restrained again, he is warned by the prison governor that he will die inside if his behavior does not improve.\nThe next few scenes show Bronson's embrace of drawing and cartooning. Encouraged by a prison art teacher who notices something special in his drawings, he seems to become a model prisoner for a while, channeling his confusion and pain into vivid imagery of birds and grotesque creatures. He is allowed access to a prison art studio where advanced art supplies are available for use. When told the art studio will be closing, the art teacher attempts to comfort Bronson that his artistic talents may help him secure early release. Bronson's response is to attack the teacher, holding him hostage in the studio as prison officials wait outside.\nWhile this standoff takes place, he demands music be played, and he paints his naked body black as he listens, and ties the teacher to a post. He forces an apple into his mouth, paints a matching mustache onto his face, and removes his own hat and glasses to put on the teacher's head. After this human still life has been arranged to his satisfaction, he accepts his fate, calling for the prison guards to burst in for yet another violent brawl which will send him back to solitary."}