{"mid": "Brother", "IMDB_id": "tt0222851", "title": "Brother", "plot": "In the autumn of 1997, Danila Bagrov (Sergei Bodrov Jr.) returns to his small hometown of Priozersk following his demobilization from the Russian Army after the First Chechen War. Before he reaches home, he ends up in a fight with security guards, after he accidentally walks onto the set of a music video for the band Nautilus Pompilius. After Danila rejects a job offer from the chief of the local militsiya, who was a classmate of Danila's deceased father, he is released, on the condition that he will find work within the week. His mother insists that he travels to St. Petersburg to seek out his successful older brother Viktor, whom his mother is confident will help him make a living.\nDanila travels to the city, but his attempts to make contact with Viktor are unsuccessful. Instead, he travels around the city and befriends several people from a very wide urban spectrum: Kat (Mariya Zhukova), an energetic drug addict and party-girl, and \"German\" Hoffman (Yury Kuznetsov), a homeless street vendor whom Danila helps after a thug attempts to extort him. Danila knocks the thug unconscious and takes a revolver from his pocket.\nUnbeknown to their mother, Viktor (Viktor Sukhorukov) is an accomplished hitman who goes by the street name \"Tatar\" but is growing too independent and is starting to irritate his mob boss \"Roundhead\" (Sergei Murzin). His latest target is \"Chechen\", a Chechen mafia boss who was recently released from prison and runs an open-air market. Roundhead, who is unhappy with the amount of money that Viktor demanded for the hit, orders his thugs to secretly watch him.\nWhen Danila finally finds Viktor's apartment, he is welcomed by Viktor. To avoid exposure, Viktor passes his assignment to his brother, gives him money to settle into the city, and then lies to him that the Chechen has been extorting from him, and asks Danila to perform the hit. Although Danila claims that his army service was spent at the headquarters as a clerk, he carries out the task professionally. First, he asks German to find him a room in a communal flat in the city center (much to the dismay of the old alcoholic landlord who threatens to shoot German with his vintage hunting rifle, as revenge for World War II). He then constructs a makeshift silencer out of a plastic soda bottle and an oil filter, as well as a decoy firecracker out of a matchbox. Finally, he follows Chechen and, despite the latter's security, takes him out without being spotted. As Danila makes his exit, Roundhead's thugs spot him and chase him. Making his escape, Danila jumps into a freight tram and, despite being wounded in the abdomen, manages to kill one of the pursuing thugs.\nThe tram driver, a woman named Sveta (Svetlana Pismichenko), helps Danila escape. Later, despite her marriage to an abusive husband, the two begin an affair. Danila later recovers, with German's help. With the money given to him by Viktor after the hit, he begins to enjoy St. Petersburg, gives his provincial image a makeover, goes to a concert with Sveta to see his favorite band, Nautilus Pompilius, and manages to scare away her husband. He meets up with Kat to go to a nightclub and then smokes cannabis in an afterparty, where he taunts a French tourist whom he mistakes for an American. The night ends with him sleeping with Kat.\nRoundhead's loss of a thug and the fact that Viktor employed Danila to carry out the hit aggravates him even more. He decides to draw him into a combined raid. Once again Viktor, suspecting a trap, passes the job to Danila. The two thugs raid the apartment, but their main target is away. While they wait, in an apartment on the floor above, a party is taking place with several well-known Russian rock stars. A young radio director, Stepan (Andrey Fedortsov) mistakes the raided flat for the party flat and is almost killed by the thugs, who take him as a hostage. Vyacheslav Butusov, the lead singer of Nautilus Pompilius, makes the same mistake, but Danila instead follows Butusov above and relaxes in the friendly musical atmosphere. Realizing the balance between right and wrong, he comes downstairs and finds that the thugs have just killed their main target, and are about to do the same with Stepan. Instead, Danila kills both thugs. Danila and Stepan drag the corpses to the Smolensky Lutheran Cemetery, where German and his friends dwell. Once again, German helps Danila by disposing of the bodies.\nRoundhead is furious upon finding out what happened. Instead of going after Tatar, he decides to track Danila and intercepts Sveta's tram. They later raid her apartment, where his men beat and rape her, and learn his phone number, as well as his address. A henchman nicknamed \"Mole\" ambushes Danila near his apartment building, but the bullet hits Danila's music player, giving him a chance to fire back and kill Mole. Realizing that staying home is unsafe, he travels to Sveta's house and is shocked at her state. Initially thinking it was her husband, he then learns who was responsible and realizes that the only way they could have tracked Sveta was when he returned a phone call from her home telephone to his brother.\nAt the same time, Roundhead raids Viktor's apartment and forces him to call Danila at gunpoint, so that he comes to pick up his payment. Realizing the depth of the situation, Danila decides to end it all at once. He goes back to the communal room that he was renting, buys the rifle from the old man, converts it into a sawed-off shotgun, and replaces the duck-hunting pellets with nailheads. At Viktor's apartment, he makes easy work of Roundhead and two of his henchmen and tells the surviving thug to warn the rest of the gang that anyone who hurts his brother will be killed. In reply, the thug tells him that it was Viktor who turned him in.\nDanila forgives his brother, gives him some of the money from Roundhead's suitcase (keeping the rest for himself) and then tells him to return home and to work for the militsiya. Danila decides to go to Moscow, as St. Petersburg, according to Viktor, \"is a pretty town, but provincial nonetheless\". Once again he visits Sveta, intending to take her with him, but her husband has returned and is beating her. Seeing Danila, he challenges him to a fight, but before he can come closer, Danila fires a shot into his leg. Sveta rushes to her husband and begins to treat his wound. Danila urges her to come with him, but she tells him to get out and never come back. He leaves her a Nautilus Pompilius CD. He then meets up with German, converses with him about the influence of the city on its residents, saying that everyone is weak here, to which German replies that the city is an evil that drains the strength from those who enter it. Danila offers him money, but German declines, saying \"What's good for the Russian is death for the German\". Before he leaves the city, he finds Kat to say goodbye. She is indifferent to his departure, but he gives her money nonetheless.\nThe last scene of the film shows Danila walking out of a snow-covered forest. He hitches a ride to Moscow on a passing Kamaz truck. As he chats up with the driver, the final shot is of the winter road stretching far into the wilderness."}