{"mid": "Brotherhood", "IMDB_id": "tt1273241", "title": "Brotherhood", "plot": "Frank (Jon Foster) is an active member of fictional fraternity Sigma Zeta Chi, and hazes pledges for initiation by forcing them to believe they are going to rob convenience stores. Adam (Trevor Morgan) and Kevin (Lou Taylor Pucci) are pledges who go with Frank to rob the stores. Before they enter the store, another active brother gives them the money and reveals it was a break designed to test their bravery. However, due to confusion over which stores to stop pledges, Kevin is not stopped and actually tries to rob the store; Kevin is shot in the shoulder as a result. Frank finds out of the mix-up and attempts to stop Kevin but is too late. With Adam's help, he subdues the store clerk, Mike (Arlen Escarpeta), who is a high school friend of Adam. They return to the fraternity house and clear a party to take care of Kevin's wounds, but Frank orders Adam and Graham (Luke Sexton) to go back to the store, recover the security tape, and check on Mike. When returning to the store, they find that the security camera does not work, but Mike is reluctant to tell the police a lie to cover their tracks.\nScared by Mike's attitude, Adam and Graham kidnap him and take him back to the house. Frank refuses taking Kevin to the hospital, fearful that the police will learn about the night's actions, and instead calls Bean's (Jesse Steccato) medical professor to take care of Kevin. Adam tries to blackmail Mike by secretly recording an elicited confession, but Mike stops talking once he discovers the recorder. Kevin's sister Emily (Jennifer Sipes) appears and angrily threatens to call the police over an unrelated prank. As she leaves, she is involved in a car accident with Bean's professor, who suffers a concussion and is rendered unable to help Kevin. With time running out and Kevin losing blood, Frank orders Mike's torturing to ensure his cooperation. At the same time, Officer Jennings (Jeff Gibbs), who is a former member, discovers Kevin but decides to stay quiet. Adam becomes insistent in taking Kevin to the hospital and tells Frank he can get leverage on Mike after hearing money is missing from the store. Adam is able to get Mike to admit he stole the money, but Mike will only cooperate if they return the stolen money and clear his name. After a tense standoff with a nervous clerk, Adam and Frank succeed in returning the money, and Frank allows them to drop off Kevin in the hospital; they claim it is a hunting accident.\nFrank says the night is a victory but Adam sees otherwise and decides to leave the fraternity, angry at their arrogance and callousness. After Adam punches Frank, the other members catch Adam and begin to beat him harshly, as Frank claims that their brotherhood and loyalty helped them get out of trouble. Another fraternity member, Jackson (Chad Halbrook), returns to the house and remembers that a pledge was locked into the trunk during the party; when they open the trunk, they discover the pledge has died from alcohol poisoning. Adam finally calls the police and tells them everything, which leads to the arrest of Frank and others."}