{"mid": "BugsyMalone", "IMDB_id": "tt0074256", "title": "Bugsy Malone", "plot": "A mobster named Roxy Robinson is \"splurged\" by members of a gang, using rapid-fire cream-shooting \"splurge guns\". Once splurged, a kid is \"all washed up... finished\". Speakeasy boss Fat Sam introduces himself and Bugsy Malone, a boxing promoter with no money (\"Bugsy Malone\").\nAt Fat Sam's speakeasy, there is much dancing and singing (\"Fat Sam's Grand Slam\"). Fat Sam is worried that his rival Dandy Dan will try to take control of the speakeasy. Blousey Brown, an aspiring singer, has come for an audition, but Sam is too distracted to see her. Bugsy meets Blousey when he trips over her luggage. He is smitten and flirts with her. Fat Sam's is raided by Dandy Dan's men, who shoot up the place. Dandy Dan's men continue to attack Fat Sam's empire, eventually taking away rackets and splurging members of Fat Sam's gang. Fat Sam sends all his available men to see if they can track down the guns. They are trapped at a laundry and all are splurged by Dandy Dan's gang.\nBugsy returns to Fat Sam's to arrange a new audition for Blousey. Fat Sam's girlfriend, the chanteuse Tallulah, makes a pass at him. Although Bugsy rejects her flirtation, Tallulah plants a big kiss on Bugsy's forehead when Blousey enters; Blousey is jealous. Fat Sam hires Blousey after her audition, but she refuses to speak to Bugsy (\"I'm Feelin' Fine\").\nFat Sam hires Bugsy to accompany him to a meeting with Dandy Dan. The meeting is a trap, but Bugsy helps Fat Sam escape. Gratefully, Fat Sam pays him $200. Bugsy and Blousey reconcile and have a romantic outing on a lake; Bugsy promises to take her to Hollywood. When he returns Sam's car to the garage, he is attacked and his money is stolen. Bugsy is saved by Leroy Smith, who assaults the attackers and drives them away. Bugsy realizes that Leroy has the potential to be a great boxer. Bugsy introduces Leroy to Cagey Joe and helps him train (\"So You Wanna Be a Boxer?\"). Fat Sam again seeks Bugsy's aid after his assistant Knuckles is unintentionally killed. Bugsy resists, but Fat Sam offers $400, enough money to keep his promise to Blousey. Blousey is disappointed when she learns that Bugsy hasn't bought the tickets to California yet (\"Ordinary Fool\"). Bugsy and Leroy follow Dandy Dan's men to a warehouse, where the guns are being stashed. The two of them can't take the place alone, so Bugsy recruits a large group of down-and-out workers at a soup kitchen (\"Down and Out\").\nThey steal the crates of guns and take them to Fat Sam's, arriving just as Dandy Dan's gang arrives. Chaos ensues as a massive splurge gun fight erupts, covering everyone (except Bugsy and Blousey) with cream. Unarmed patrons throw cream pies. The piano player is hit from behind and falls onto the keys, striking a single bass note. The tone silences the room, and the cream-covered crowd performs in a final number (\"You Give a Little Love\"). They realize they can all be friends, and Bugsy and Blousey leave for Hollywood."}