{"mid": "Bullitt", "IMDB_id": "tt0062765", "title": "Bullitt", "plot": "Ambitious politician Walter Chalmers (Robert Vaughn) is about to present a surprise star witness in a Senate subcommittee hearing on organized crime. The witness, Johnny Ross, a defector from the Organization in Chicago, is put under San Francisco Police Department protective custody for the weekend, 40 hours until his Monday morning appearance.\nTo improve his own image, Chalmers requests SFPD Lieutenant Frank Bullitt (Steve McQueen), who is well-liked by the local media. Bullitt and his team, Sergeant Delgetti (Don Gordon) and Inspector Carl Stanton (Carl Reindel), put Ross (Felice Orlandi) under around-the-clock protection in a cheap hotel selected by Chalmers. Late Saturday night, while Bullitt is with his girlfriend Cathy (Jacqueline Bisset), a designer, Stanton is on solo duty when the desk clerk unexpectedly calls to announce that Chalmers wants to come up. While Stanton checks by phone with Bullitt, Ross unchains the hotel room door. A pair of hitmen (Paul Genge and Bill Hickman) burst in and shoot Stanton and Ross, seriously wounding both.\nAt the hospital, Chalmers holds Bullitt responsible. Later, a second assassination attempt is thwarted by Bullitt, but Ross soon dies of his original injuries. Helped by a sympathetic doctor (Georg Stanford Brown) who had been snubbed by Chalmers, Bullitt delays news of the death by sending the body to the morgue as a John Doe.\nBullitt and Delgetti investigate. The cab driver (Robert Duvall) who drove Ross to the hotel remembers stopping to let Ross make a long-distance call from a pay phone. A confidential informant reveals that Ross was caught stealing $2 million from the Chicago Mob and fled to San Francisco after escaping an attempted hit in Chicago. Meanwhile, Chalmers serves Bullitt's captain (Simon Oakland) with a writ of habeas corpus to force him to make Bullitt give up Ross, but the lieutenant does not cooperate.\nWhile driving his 1968 Ford Mustang GT, Bullitt spots the Ross hitmen tailing him in a 1968 Dodge Charger R/T. He maneuvers to get behind them, they attempt to flee, and a high-speed muscle car chase ensues through the hilly streets of San Francisco's Russian Hill and out onto the highway, ending when the Mustang forces the Charger off the road and into a gas station, causing a fiery explosion that incinerates the hitmen.\nBullitt and Delgetti face their superiors. They reveal that Ross is dead and that their only lead is phone records showing that Ross's call was to a Dorothy Simmons in a hotel in nearby San Mateo. It is Sunday; the detectives are given until Monday to follow up the lead. With his car out of commission, Bullitt gets a ride from Cathy in her Porsche 356. The detectives find Dorothy Simmons strangled to death. Cathy sees police rushing in and follows, fearing for Bullitt. Afterwards, horrified by the crime scene, she confronts him about his violent world, wondering whether she even really knows him.\nBack in San Francisco, Bullitt and Delgetti search Simmons's luggage, discovering men's and women's clothing, empty ticket and passport folders, a travel brochure for Rome, and thousands of dollars in travelers' checks made out to Albert and Dorothy Renick. Bullitt requests passport information for the Renicks and a fingerprint check for the dead Ross.\nChalmers again confronts Bullitt, demanding a signed admission that Ross died while in his custody. Bullitt refuses. A facsimile of Albert Renick's passport application arrives, showing the man they thought was Ross was actually Renick, a used car salesman from Chicago with no criminal record. Bullitt realizes that Simmons was Mrs. Renick; the real Ross had used Chalmers to fake his own death by setting up Renick to die, then murdered her to complete the cover-up.\nDelgetti discovers reservations for the Renicks on an evening flight to Rome. Bullitt and he head to the airport to look for the real Ross (Pat Renella), who must be traveling as Renick. They stake out the Rome flight gate, only to find that Ross has switched to an earlier flight to London that is already taxiing toward takeoff. Chalmers shows up to lay claim to the real Ross, though he is now wanted for murder, and is again rebuffed by Bullitt.\nBullitt has the plane stopped, but Ross escapes. A foot chase across the busy runways ends in a tense pursuit inside the crowded passenger terminal. When Ross bolts and shoots a security guard, Bullitt shoots and kills Ross. Left behind, empty-handed, is Chalmers, who is driven off in a Lincoln Continental with a \"Support Your Local Police\" bumper sticker.\nEarly the next morning, Bullitt drives home. As he walks up to his apartment, he spots Cathy's car. He looks in and sees her sleeping in his bedroom, but he does not wake her. He takes off his gun and balances it on a banister. As he begins to wash up at the bathroom sink, he looks up into his own reflection and contemplates himself for a long moment."}