{"mid": "BunnyAndTheBull", "IMDB_id": "tt1251725", "title": "Bunny and the Bull", "plot": "Stephen is an agoraphobic recluse who has not left his flat in nearly a year. Each of his days are structured around carefully planned routines, but one day his routine is disrupted when he discovers an infestation of mice in the kitchen cupboards. He contemplates leaving the flat to buy mouse traps, but can not bring himself to open the door, so he reminisces about the events leading up to his current situation, with objects around the flat triggering flash backs.\nOne year earlier, after being \"friend zoned\" by the woman he loved, Stephen went on a sightseeing holiday across Europe with his friend Bunny, who is addicted to gambling. They visit several bizarre museums, but Bunny finds them all boring and is more concerned with seducing women. At a seafood restaurant in Poland, Stephen and Bunny meet Eloisa, a Spanish waitress who has recently left her boyfriend and plans to return to Spain for an upcoming fiesta. Bunny wins the restaurant's delivery car in a bet, and Eloisa accompanies them on their journey towards Spain. They stop at a hostel in Switzerland, where Stephen plans to ask Eloisa on a date, only to discover that she has already started a sexual relationship with Bunny.\nWhen they arrive in Spain, Eloisa is reunited with her brother Javier, an aspiring matador. Bunny decides he wants to fight a bull, so asks Javier to teach him everything he knows about bullfighting. Javier shows him a prized matador suit he keeps in a display cabinet, which Bunny later steals and subsequently loses in a bet. Elsewhere, Eloisa falls in love with Stephen and they sleep together, but the next morning Bunny explains about the lost matador suit and urges Stephen to come with him as he flees Spain. Eloisa finds out about the suit and breaks up with Stephen. On the train ride home, Stephen angrily confronts Bunny about his recklessness, but he misinterprets Stephen's frustrations as a challenge, so that night Bunny sneaks into a field and attempts to fight a bull. The bull kills him, and Stephen is left traumatised. When he returns home, Stephen's guilt develops into agoraphobia, and he has remained in his flat ever since.\nIn the present day, Stephen imagines a conversation with the ghost of Bunny, who asserts that his death was not Stephen's fault and urges him to talk to Eloisa. This conversation gives Stephen the confidence he needs to overcome his anxiety, so he contacts Eloisa and gains enough courage to leave the flat."}