{"mid": "Buried", "IMDB_id": "tt1462758", "title": "Buried", "plot": "On October 23, 2006, Paul Conroy, an American civilian truck driver working in Iraq, wakes up and finds himself buried alive in a wooden coffin, bound and gagged, with only a Zippo lighter and a BlackBerry phone at hand. Although he initially has no idea how he got there, he starts to piece together what has happened to him. He remembers that his and several other trucks were ambushed by terrorists, who killed his colleagues; he was hit by a rock and passed out. He receives a call from his kidnapper, Jabir, demanding that he pay a ransom of $5 million by 9PM or he will be left in the coffin to die.\nConroy calls the State Department, which tells him that due to the government policy of not negotiating with terrorists, it will not pay the ransom but will try to rescue him. They connect him with Dan Brenner, head of the Hostage Working Group, who tells Conroy they are doing their best to find him.\nHis kidnapper calls Conroy and demands he make a ransom video, threatening to execute one of his colleagues who survived the attack. Conroy insists that no one will pay $5 million, so the kidnapper drops the amount to $1 million. Despite his compliance in making a video, the kidnappers execute his colleague and send him the recording of it, which he watches in horror. Shortly afterwards, distant explosions shake the area, damaging his coffin, which begins to slowly fill with sand. Conroy continues sporadic phone calls with Brenner, skeptical of the man's promises of help. To reaffirm his wholehearted intentions, Brenner tells Conroy about a 26-year-old named Mark White who was rescued from a similar situation three weeks previously, telling him that the kid is home with his family and happy.\nLater on, Conroy receives a phone call from his employers, who inform him that he was fired from his job due to an alleged prohibited relationship with a colleague (the one who was executed), and thus he and his family will not be entitled to any benefits or pension he earned during his time with the company. Brenner calls back and explains that the explosions that had damaged his coffin earlier were in fact several F-16 bombings, and that his kidnappers may have been killed. Conroy begins to lose all hope and does a last will and testament in video form, giving his son all of his clothes and his wife his personal savings. Jabir calls back demanding that Conroy video record himself cutting his finger off, threatening Conroy's family back home in Michigan if he refuses, saying that he lost all of his children. Conroy records himself cutting off one of his fingers and sends the video.\nShortly after making the video, the cell phone rings, Paul begins to hear shovels and distorted voices. The voices come clearer, saying to open the coffin, and the coffin opens. But abruptly, it becomes obvious he hallucinated the encounter.\nAfter some minutes, Brenner calls, notifying Conroy that they have found his location and are driving out to find him. Then Conroy's wife Linda calls him, so Conroy hangs up on Brenner. She cries with him and begs him to promise her that he will come home. He promises, but hangs up due to another call from Brenner. Brenner reports that they have found the site. The group starts to dig up a coffin, but Conroy cannot hear anyone near the coffin. When they open it, the coffin turns out to be Mark White's, not Conroy's, indicating that White was never rescued. Paul starts to cry as he realizes he is not going to be saved. The sand fills his coffin and he suffocates to death as the light goes out and the screen goes black. The last thing we hear is Brenner, repeating, \"I'm sorry, Paul. I'm so sorry.\" as the connection finally times out."}