{"mid": "BurkeAndHare", "IMDB_id": "tt1320239", "title": "Burke and Hare", "plot": "The film opens in Edinburgh. Narration by Angus the Hangman explains how the corpses of the hanged are transported to Dr Robert Knox for dissection. Knox's rival, Dr Alexander Monro, wants the steady supply of cadavers but is forced to rely on severed limbs for dissection. Monro's assistant Charles Darwin arrives with a forged letter directing that all corpses thenceforth must be sent to Monro. Angus tells Knox's assistant, Patterson, the news. Patterson delivers the message to Knox.\nWilliam Burke and William Hare, immigrants from Ulster, attempt to sell cheese mould as a patent medicine. When their fraud is discovered, they flee to an inn owned by Hare's wife, Lucky. She tells them that one of the lodgers has died. Burke and Hare decide to sell the corpse to Knox. They are forced to break the corpse's spine to fit it into a barrel in order to smuggle it through the city. They stop at a pub along the way, where a young former prostitute, Ginny Hawkins, loudly performs an excerpt from Macbeth. The patrons ignore her. Burke asks her why she did this, and she says that it is her ambition to become an actress. They share a drink; Hare reminds Burke that they must continue to Knox's house.\nBurke and Hare present the now-mangled corpse to Knox. After some negotiation, Knox agrees to pay them a good sum of money for each corpse they bring him for dissection. Burke plans to use his money to finance Ginny's theatrical ambitions, and Hare decides to open a funeral parlour. Returning to the inn, they find Lucky drunk and barely conscious. Lucky says she is drinking because Joseph, another lodger at the inn, is near death. Not willing to wait for the outcome, Burke and Hare suffocate Joseph and take the body to Knox.\nAfterward, Burke tells Ginny about the money. She allows him to take her home. Hare meets Fergus, the henchman of villain Danny McTavish, at a bar. Fergus says that McTavish uses him to cheat at games of chance, but keeps all the winnings for himself. Hare details the arrangement with Knox. Fergus relays the information to McTavish.\nBurke is kidnapped from Ginny's side and bundled into a horse carriage by McTavish and Fergus, who have already captured Hare. McTavish threatens to kill them unless they give him half the money from Knox. Forced to agree, they are then thrown from the carriage. As they trod back to the inn, they plan a string of murders to make up their losses to McTavish. Lucky becomes suspicious of the mounting death toll, as does Police Captain Tom McLintock. McLintock seeks the advice of Lord Harrington and William Wordsworth, who give permission to hunt down the criminals and have them hanged.\nMcTavish kidnaps Hare again and attempts to extort the remainder of the money. Shortly afterward, McTavish appears as Knox's next dissection cadaver. McLintock takes notice. He arrests Burke and Ginny, and Hare and Lucky, while both couples are having sex. He tells them that if any one of them confesses to the murders, the others will go free. Burke agrees to confess if he and Ginny can finish what they were doing when McLintock apprehended them.\nJust before Burke's hanging, Angus advises him to speak if he has any final words. Burke sees Ginny in the crowd, and says, \"I did it for love.\"\nOnscreen text over the credits describes the fates of all the characters in the story, concluding with an image of the actual skeleton of William Burke at the Anatomical Museum of the University of Edinburgh Medical School."}