{"mid": "BurnNoticeTheFallOfSamAxe", "IMDB_id": "tt1697851", "title": "Burn Notice: The Fall of Sam Axe", "plot": "Set two years before the pilot episode, the film is narrated by Sam Axe (Bruce Campbell), a US Navy SEAL Commander, who is being questioned by Admiral Lawrence (John Diehl) about a mission in Colombia. Sam reveals that he had unwittingly had an affair with a superior's wife (Chandra West) and that he was punished with a dangerous mission: to track down a terrorist group known as the Espada Ardiente and assess the need for American support against them.\nIn Colombia, Sam meets his new team, including Commandante Veracruz (Pedro Pascal), then goes to a local clinic to tell them that they're in danger only to be brushed off by the two employees, doctor Ben Delaney (RonReaco Lee) and charity worker Amanda Maples (Kiele Sanchez). Later, while scouting the area against orders, Sam discovers that Veracruz and his men are preparing to attack the clinic themselves and kill him to game the system for aid, so Sam sneaks off to the clinic to sound the alarm again, yet they still won't take his help. Thinking Sam has been kidnapped, Veracruz moves quickly to destroy the clinic but a local teenager, an orphan girl named Beatriz (Ilza Rosario), gets to the clinic early and tells Sam he's coming. Once he's convinced Ben and Amanda of the danger, Sam helps them get all the patients out and blow up the clinic as a distraction for the escape. Beatriz suggests hiding with her only friends, the Espada Ardiente, which works for Sam and his mission, especially since they have no alternative. Upon their arrival, Sam discovers that the Espada Ardiente is merely a small, but resilient, group of shepherds on a small farm that the corrupt Veracruz is trying to secure as a way-point for drug transportation. After watching them do very basic training and promising Amanda he won't leave them, Sam heads back to Veracruz's camp to call for support and stall long enough for help to arrive. Veracruz calls his bluff and almost forces him to reveal where the Espada Ardiente are hiding out, but the farmers give Sam a way out and he escapes back to them, where he apologizes and tells them how they can all help him stop Veracruz. Altogether, they then travel to a CIA outpost to ask for help, narrowly escaping a trap set by Veracruz along the road. They arrive to the isolated outpost and find its only use is observation, and is practically empty except for two men and some radio equipment, which they use to call for assistance. Sam is instructed that nothing will happen until he travels to the nearest military base first to detail the situation. Again, Sam promises he'll return and gets on the helicopter with the two men, but they admit nobody is coming until they go through the proper channels, and that the locals are essentially being left for dead in a \"compromised\" facility, giving Sam no choice except to force them to land at gunpoint.\nIn the present, the Admiral tips his hand that things are heading towards a trial, but Sam refuses a lawyer and continues his story.\nAt the outpost in Colombia, Sam strong-arms the CIA men into calling for backup, which won't arrive for three hours, leaving him and the others to hold off Veracruz as long as possible. Their odds get worse when reinforcements show up for Veracruz, and, despite their best efforts to block his path, eventually they run out of ammunition and must retreat back to the outpost. Still anticipating assistance, Sam has the guys call out again, birthing his alias \"Chuck Finley,\" and learns that they won't have enough time. Shortly thereafter, Veracruz arrives on scene, so Sam heads outside to buy his friends more time. They refuse to surrender to Sam and rough him up a bit before firing on the outpost, and then, the cavalry arrives to save the day. Once Veracruz and his forces are in custody, and all of Sam's friends have said their goodbyes, he is escorted back to the base to testify.\nThe Admiral evaluates the situation and threatens Sam with a court martial, but Sam has an ace up his sleeve: Beatriz, seeking redemption for influencing her friends to fight in the first place, has photographs of the entire operation and published them in Colombia's largest newspaper with his encouragement. He then strikes a graymail deal with Lawrence, promising to remain silent about the whole thing in exchange for the following: exoneration for all his friends; rebuild the clinic; leave the farmers alone to their herds; finally, for himself, an honorable discharge with full pension, a first-class plane ticket to the city of his choice (Miami), a change of clothes, and one ice-cold beer."}