{"mid": "BuryingTheEx", "IMDB_id": "tt3339674", "title": "Burying the Ex", "plot": "Nice guy and horror fanatic Max (Anton Yelchin) is dating the beautiful-but-manipulative Evelyn (Ashley Greene). Evelyn is an extreme environmentalist working for a blog company that promotes \"going green\", while Max works a dead-end job at the local horror shop named Bloody Mary's. In many situations, Max often finds himself trapped trying to do whatever he can to keep Evelyn happy, including changing his diet and selling his old car. In addition to this, Max dreams of opening up a horror memorabilia shop of his own in the future, much to Evelyn's dismay. One day at the shop, Max unloads the latest shipments and finds a Satan Genie, an object that claims it can grant anyone's wants or desires. Believing it to just be another silly item for the shop, Max places it on the shelf in the storage room and dismisses it. Later that night, he and Evelyn have sex in the shop and make a promise to each other that they'll be together forever. Shortly thereafter, Max has Evelyn move in with him. Max and Evelyn initially decide to celebrate this new development in their relationship by grabbing a bite to eat. Wanting Evelyn to try something he enjoys for a change, Max suggests they go to I-Scream, a malt hot-spot run by Olivia (Alexandra Daddario). Evelyn is immediately unkind to Olivia and believes her and Max were flirting with each other. As Max pleads his case to her, Evelyn tearfully admits that she doesn't want to lose him and that he's the only thing in her life that has made her happy since her mother's death.\nAll seems to be great until Max comes back home to discover that Evelyn has redecorated their entire apartment to what she feels is aesthetically pleasing and has put away all of Max's collectables and posters, ruining their price values. This leads to an argument where Max states that he and Evelyn should be making decisions together instead of her taking the reins on every little thing all the time. Feeling that Evelyn's overbearing nature will lead him to be unhappy for the duration of their relationship, Max plans to break up with her but is too scared to do so. Max turns to his slacker half-brother Travis (Oliver Cooper) for advice. Travis suggests that Max break up with Evelyn in a public place so he can make a quick getaway and have everyone present see her for the control freak she truly is. However, the plan backfires when Evelyn accidentally gets hit by a bus on her way to the park. She dies in the middle of the road as a tearful Max watches.\nA couple weeks go by and Max has shut himself off emotionally, feeling responsible for Evelyn's death. Travis swings by his place and, after seeing the funk he's in, encourages him to get back out and move on. Max eventually runs into Olivia again and starts to hit it off with her. As the night progresses, Max and Olivia learn that they both share the same fascination for horror. But when Max and Olivia visit the Hollywood Forever Cemetery, Evelyn is shown to have risen up from the dead and has dug herself up out of the ground. After Olivia walks Max back home, he's quickly greeted by an undead Evelyn at the door. Evelyn is overjoyed and believes hers and Max's love is being given a second chance and thinks they're still dating. Frightened, Max realizes that the Satan Genie from the shop made their wish of being \"together forever\" come true and has brought Evelyn back from the dead. Still wanting to pursue Olivia, Max actively attempts to hide Evelyn from her. He's also left to ponder how exactly he's going officially dump Evelyn. Max presumes that the answer to his problems lie with the Satan Genie, only to have it shatter on the ground when he loses his footing. For his backup plan, Max then researches the occult/spell books the shop has available in the hopes of finding something that will send Evelyn back to her grave. He tries these techniques, but to no avail; as they have no effect on Evelyn whatsoever.\nTravis stumbles upon Max with a drunken Evelyn, and is reluctant to help him. He soon has a change of heart and tells Max that the only true way he can get rid of Evelyn is to decapitate her with a machete. Max tries to accomplish this but backs out at the last minute. The day before Halloween, Olivia drops by the shop to visit Max. It's later interrupted by a phone call from Evelyn. Olivia (who still doesn't know that Evelyn's a zombie) thinks Max still hasn't gotten over her just yet, but offers him an invitation to a screening of Night of the Living Dead at the cemetery. Travis steps up to the plate and offers to kill Evelyn so Max can meet Olivia at the movie. Travis shows up at the apartment under the guise of searching for an old DVD Max never returned to him and intentionally prolongs his stay, annoying Evelyn. She then develops a sudden craving for brains and ends up eating Travis. Meanwhile, Max and Olivia are enjoying each other's company and end up having sex in the back of Olivia's car.\nUpon Max's return, he discovers Travis's corpse in the living room. Knowing that Evelyn is now determined to kill anyone who gets in her way, Max tricks her into drawing a hot bubble bath for themselves in order to barricade the bathroom door and trap her inside. He rushes out of the apartment to get the police but leaves his cell phone behind. Evelyn doesn't take too long to break free and escapes. She then kidnaps Olivia after she's read the texts between her and Max. Having had no luck with the police, Max hears through one of the police scanners about someone knocking over a malt shop and realizes Olivia's in trouble. Back at the apartment, Max sees Olivia tied up and Evelyn threatens to kill her. A battle ensues between Max, Evelyn, and Olivia, ending with Travis (now revealed to be a zombie himself) fatally stabbing Evelyn through the chest with the machete. With Evelyn finally gone, Max and Olivia take her body back to the cemetery and bury her.\nOne year later, Max and Olivia's relationship is still going strong. Max has long since quit his job at Bloody Mary's, became business partners with Olivia—having joined his horror memorabilia store and her malt shop as an enterprise of their own—and is now truly happy. Max then surprises Olivia with an engagement ring, which she gladly accepts. And Travis, still in his zombie form, is shown sign-spinning outside the shop."}