{"mid": "ByeByeBirdie", "IMDB_id": "tt0056891", "title": "Bye Bye Birdie", "plot": "=== Act one ===\nAgent and songwriter Albert Peterson finds himself in trouble when hip-thrusting rock and roll superstar Conrad Birdie is drafted into the Army. Albert's secretary and sweetheart, Rose \"Rosie\" Alvarez, comes up with a last-ditch publicity stunt to have Conrad Birdie record and perform a song before he is sent overseas. She makes Albert promise to give up the music business and to start teaching English at schools (\"An English Teacher\"). They plan to have Birdie sing Albert's new song \"One Last Kiss\" and give one lucky girl from his fan club a real \"last kiss\" on The Ed Sullivan Show before going into the Army.\nThe lucky girl chosen randomly from Conrad's fan club is fifteen-year-old Kim MacAfee from Sweet Apple, Ohio. All the teenagers in Sweet Apple are catching up on the latest gossip about Kim MacAfee and Hugo Peabody going steady (\"The Telephone Hour\"). Kim, excited to have a boyfriend, reflects on how happy she is with her maturity (\"How Lovely to Be a Woman\"). She quits the Conrad Birdie fan club over the phone because of the new milestone happening in her life, and as she tells the news, her best friend Ursula is shocked. Meanwhile, Conrad, Albert, and Rose set off to Sweet Apple to prepare for the event. Before they depart by train from New York City, local teenage girls are ecstatic to meet Conrad, although one young girl is sad because she thinks that by the time Conrad gets out of the army, she'll be too old for him. Albert advises her to be optimistic (\"Put on a Happy Face\"). Soon, reporters arrive with questions for Conrad, but Rosie, Albert, and the girls answer for him, pushing away tabloids (\"Normal, American Boy\"). Conrad receives a hero's welcome in Sweet Apple, and Hugo worries that Kim likes Conrad more than she likes him, but Kim assures Hugo that he's the only one she loves (\"One Boy\"). Conrad shocks the town's parents and drives the teenage girls crazy with his performance of \"Honestly Sincere\", which causes all of the girls (and the Mayor's wife) to faint.\nConrad becomes a guest in the MacAfee house and irritates Kim's father, Harry MacAfee, by being a rude and selfish guest. Mr. MacAfee does not want Kim to kiss Conrad until Albert tells him their whole family will be on The Ed Sullivan Show. Mr. and Mrs. MacAfee, Kim, and her younger brother Randolph sing Sullivan's praises (\"Hymn For a Sunday Evening\").\nHugo senses Kim's attraction to Conrad and becomes very jealous. Albert's overbearing, interfering mother, Mae Peterson, comes to break up her son's relationship with Rosie. She introduces Albert to Gloria Rasputin, a curvy blonde she met on the bus who could replace Rosie as his secretary. Gloria hopes that if she helps Albert with papers, he can get Gloria into show business, as she is a tap dancer. Mae sings \"Swanee River\" as Gloria tap dances (usually depicted as her making a fool of herself) and ends doing a split. Unfortunately, she needs a little help getting up from her stance. Albert gives her a job to type up some revenues and Rosie is furious but hides it from Albert.\nRosie, jealous and angry, dreams of violent ways to murder Albert (\"One Hundred Ways Ballet\"). Rosie and Hugo plot to ruin the broadcast. Conrad sings on The Ed Sullivan Show (\"One Last Kiss\") and as he leans in to kiss Kim, Hugo runs onstage and punches him in the face. On live television, Conrad faints, Rosie breaks up with Albert, and Albert, trying to cover for the mishaps of the evening, leads a chorus of \"Normal American Boy\".\n=== Act two ===\nDespite plans to re-film the broadcast, Rosie and Kim resolve to leave Albert and Hugo, lamenting their own stupidity for having fallen in love with the boys (\"What Did I Ever See in Him?\"). Rosie leaves the MacAfee house and Kim plans to go with her, but her father doesn't let her. Kim sneaks out of the house and joins the Sweet Apple teens. Conrad decides he wants to go out and have a good time on his last night as a civilian and encourages the teens to party (\"A Lot of Livin' to Do\"). Conrad, Kim, and all the teenagers except Hugo head for the Ice House to party without adult supervision. The Ice House is where people go when they want to be alone. Hugo goes to Maude's Roadside Retreat, hoping to get drunk, but proprietor Charles F. Maude can tell that he's under age and refuses to serve him.\nWhen Mr. MacAfee finds out Kim has run away, he and Mrs. MacAfee lament how disobedient kids are today (\"Kids\"). Rosie ends up at Maude's Roadside Retreat and starts hitting on other men, but Albert calls her on the telephone and begs her to return to him (\"Baby, Talk to Me\"). Rosie, hoping to forget Albert, interrupts a Shriners meeting being held in Maude's private dining room. She flirts with all the Shriners, and they begin a wild dance. Hugo and Albert rescue Rosie from the crazed Shriners, and Albert finally stands up to his mother, telling her to go home. Mae becomes so upset that she leaves, but not before heavily dramatizing the sacrifices she made for him. (\"A Mother Doesn't Matter Anymore.\") Hugo tells the MacAfees and the other parents that the teenagers have gone to the Ice House, and they all declare that they don't know what's wrong with their kids (\"Kids Reprise\"). Randolph joins in, stating that his older sister and the other teens are \"so ridiculous and so immature\".\nThe adults and the police arrive at the Ice House and arrest Conrad, although he doesn't appear to have done anything illegal. Kim claims she was intimidated by Conrad and gladly returns to Hugo. After a reconciliation with Albert, Rosie tells Albert's mother, Mae, that she will marry Albert despite Mae's racist objections, and to irritate her, declares she's Spanish (\"Spanish Rose\") with deliberate comic exaggeration. Albert bails Conrad out of jail and arranges for him to sneak out of town dressed as a middle-aged woman — presumably so he can report for Army induction as scheduled. Albert gets his mother to leave Sweet Apple bound for home on the same train, getting Conrad and his mother out of his life for good. Albert tells Rosie they're not going back to New York; they're going to Pumpkin Falls, Iowa, a small town in need of a (married) English teacher. Albert professes that everything is rosy with Rosie (\"Rosie\"), and they go off together happily engaged as Rosie had always dreamed."}