{"mid": "CampNowhere", "IMDB_id": "tt0109369", "title": "Camp Nowhere", "plot": "Morris \"Mud\" Himmel has a problem: his parents want to send him away to a summer computer camp. He hates going to summer camp, and would do anything to get out of it. Talking to his friends, he realizes that they are all facing the same sentence of going to a boring summer camp. Together with them, he hatches a plan to create their own summer camp with no parents, no counselors, and no rules. Word gets out and other kids want to join the made up summer camp. Mud decides to blackmail former drama teacher Dennis Van Welker into helping; he had bought an AMC Gremlin and failed to make most of the payments and is being pursued by soon-to-retire collector T.R. Polk, and agrees to help them in return for $1,000.\nWith Dennis' help, the kids trick all the parents into sending them to the camp, and then rent an old campground (that used to be a hippie commune back in the 1960s and 1970s.) with a cabin on a lake. Some parents believe it is a computer camp, while others believe it is a fat camp, military camp, or an acting camp. The kids use the money their parents had paid for camp to buy toys and food. After a little while, they get bored and wonder if they should just return home. Mud goes to Dennis for help, and with a bribe, he soon finds ways to keep things interesting and help them continue to have fun.\nEventually, the parents want to come visit their kids, despite being told that there are no parents' days. Mud makes a plan to trick them and, along with his friends, they keep the camp concealed. In a matter of hours, they fix it up and set up different scenarios representing the different camps (fat camp, computer camp, military camp, etc.) Their plan works and the parents don't suspect a thing. T.R. Polk then meets a state trooper who was also seeking Dennis, and they find their way into the camp and catch him. The police are called and Mud finds Dennis running away from the authorities. Mud is confronted by the police and protects Dennis from them, but soon after Dennis turns himself in. Mud confesses and explains that the whole thing was his idea, and uses the rest of the money to pay T.R. Polk, who'll retire with a perfect record. Dennis gets off the hook and the kids leave for home, having had the greatest summer of their lives."}