{"mid": "CandymanFarewellToTheFlesh", "IMDB_id": "tt0112625", "title": "Candyman: Farewell to the Flesh", "plot": "Helen Lyle, a Chicago graduate student who is researching urban legends, hears of a local legend known as the Candyman. The legend claims that Candyman can be summoned by saying his name five times while facing a mirror, whereupon he will murder the summoner with a hook jammed in the bloody stump of his right arm. She encounters two cleaning ladies who tell her about the murder of a woman named Ruthie Jean, a resident in the notorious Cabrini-Green housing project who they claim was a victim of Candyman. Helen's research turns up 25 other murders in the area similar to Ruthie Jean's. Later that evening, Helen and her friend Bernadette Walsh, skeptical of Candyman's existence, call Candyman's name into the mirror in Helen's bathroom; nothing happens.\nHelen learns from Professor Philip Purcell that Candyman was the son of a slave who became prosperous after developing a system for mass-producing shoes during the Civil War. He grew up in polite society and became a well-known artist, sought after for his talent in producing portraits. After falling in love with and fathering a child with a white woman in 1890, Candyman was set upon by a lynch mob hired by his lover's father; they cut off his painting hand and replaced it with a hook. He was smeared with honey stolen from an apiary, prompting the locals to chant \"Candyman\" as hungry bees stung him to death. His corpse was burned in a pyre and his ashes were scattered across the area where Cabrini-Green now stands.\nHelen decides to write a thesis on how the residents of Cabrini-Green use the Candyman legend to cope with the hardships of living there. Helen and Bernadette enter the housing project to visit the scene of Ruthie Jean's murder. There, they meet Anne-Marie McCoy, one of the residents, and a young boy named Jake, who tells her the disturbing story of a child who was castrated in a public restroom by Candyman. While Helen explores the run-down restroom, she is attacked by a gang leader who carries a hook and has taken the Candyman moniker as his own in order to enhance his \"street cred\". Helen survives the assault and is able to identify her attacker to the police, who believe him to be responsible for the killings attributed to Candyman. Then Helen tells Jake that Candyman is a made-up character no different than Dracula and therefore isn't real.\nIn a parking garage, Helen is confronted by the real Candyman, who explains that since Helen has discredited his legend, he must \"shed innocent blood\" to perpetuate belief in himself and continue his existence. Helen blacks out and wakes up in Anne-Marie's apartment, covered in blood. Anne-Marie, whose Rottweiler has been decapitated and whose baby Anthony is missing, attacks Helen; in the midst of defending herself, the police arrest Helen. Trevor, Helen's husband, bails her out of jail, but Candyman appears to Helen again and cuts her neck, causing her to bleed to the point of unconsciousness. Bernadette appears at the apartment and is murdered by Candyman, who frames Helen for the murder. Helen is sedated and placed in a psychiatric hospital.\nAfter a month's stay at the hospital, Helen is interviewed by a psychologist in preparation for her upcoming murder trial. While restrained, Helen attempts to prove her innocence by calling Candyman. Candyman appears, kills the psychologist, and allows Helen to escape. She returns home and briefly confronts Trevor, who is now living with Stacey, one of his female undergraduate students. Helen then flees to Cabrini–Green to confront Candyman and locate Anthony, finding murals depicting Candyman's lynching. She finds Candyman in his makeshift lair and he tells Helen to surrender to him to ensure Anthony's safety. Offering Helen immortality, Candyman opens his coat to reveal a ribcage wreathed in bees and kisses her. After Candyman vanishes with Anthony, Helen finds a mural of Candyman alongside a woman (presumably the lover he fathered a child with) who happens to bear a striking resemblance to her with the \"It was always you Helen,\" implying that Helen's the reincarnation of Candyman's lover.\nCandyman promises to release Anthony if Helen helps him incite fear among Cabrini-Green's residents. However, in order to feed his own legend, Candyman reneges and attempts to immolate them all in a community bonfire when it is lit by the residents. Helen manages to save baby Anthony while Candyman is destroyed in the fire—but Helen is fatally burned and ultimately dies from her injuries. The residents, including Anne-Marie and Jake, pay their respects at Helen's funeral, with Jake tossing Candyman's hook into her grave. Afterwards, Trevor stands before a mirror in the bathroom of their former apartment, where he says Helen's name five times in grief. As a result, Helen's vengeful spirit is summoned and kills Trevor with Candyman's hook. Stacey screams in horror when she finds Trevor's body. In Candyman's lair, a new mural of Helen dressed in white and consumed by flames with her hair ablaze is seen on the far wall, showing she has now entered folklore and become a legend herself."}