{"mid": "CandymanDayOfTheDead", "IMDB_id": "tt0165662", "title": "Candyman: Day of the Dead", "plot": "Several years after the events of the second film, the ghostly serial killer returns once again from beyond the grave, this time, during the eve of Day of the Dead, to haunt a Los Angeles art gallery owner named Caroline McKeever, a distant relative of the Candyman (and also Annie Tarrant's daughter) in order for him to claim her soul so she will be next to him. In the meantime, the Candyman goes about killing all those associated with Caroline (starting with artist Miguel Velasco, her lover, and following with her roommate Tamara) in his usual gory ways with his hook. He also kidnaps her friend David de la Paz and makes it appear to the authorities that Caroline is the one responsible for the killings. Seasoned police detective (who is secretly prejudiced against most minorities) L.V. Sacco is murdered by Candyman while Caroline is in the car, which not only brings the whole local police department down on her head, but puts her in the firing line of Sacco's equally bigoted partner Lt. Det. Samuel Deacon Kraft, who has no intention of bringing her in alive.\nCaroline is kidnapped by a gang who take her to an abandoned building and call Candyman in hope of sacrificing Caroline to Candyman to end the murders, but Candyman kills the whole gang. He reveals to Caroline that after her mother Annie Tarrant told the story of him, she called him to give herself to him to protect her daughter. Candyman killed her by slitting her throat with his hook and made it look like a suicide. He also reveals that he killed her father Paul, uncle Ethan, and grandparents Coleman and Octavia. Caroline, enraged, threatens to kill him for killing her family, but Candyman disappears. Caroline explores the building and finds David alive but injured. Candyman suddenly appears and convinces her to give her life to him. However Caroline, changes her mind and destroys the painting of him that was the cause of his resurrection with a hook, causing the Candyman to burst into flames, killing him for good.\nCaroline frees David but is attacked by Det. Kraft, who tries to kill her with a hook but is shot in the back of the head by Det. Jamal Mathews, who was following Kraft. Before he dies, Kraft gasps, \"Candyman!\" Caroline then remembers her mother's advice to destroy the myth and tells Mathews that Kraft was the Candyman killer. After the news that Kraft was the Candyman gets out, Caroline chants the name \"Candyman\" in the mirror to make sure he is dead. Candyman's hook bursts through the mirror, but this is revealed to be a nightmare. Caroline has a picnic with her now boyfriend David and his daughter Christina in front of Annie Tarrant's grave while the Day of the Dead celebrations go on; she is finally happy that the Candyman no longer exists."}