{"mid": "CantBuyMeLove", "IMDB_id": "tt0092718", "title": "Can't Buy Me Love", "plot": "Ronald Miller (Dempsey) is a typical high school nerd living in Tucson, Arizona. He has spent all summer mowing lawns to save up for a telescope. At an opportune moment, he makes a deal with popular cheerleader Cynthia \"Cindy\" Mancini (Peterson). Cindy had borrowed an expensive suede outfit belonging to her mother, without her permission, to wear to an End of the Summer/Back to School party, and needs to replace it quickly after Quint (Cort McCown) accidentally spilled red wine on it at the party. Having few options, save for telling her mother the truth, Cindy reluctantly agrees to Ronald's proposal: he will give her $1000 to purchase a new suede outfit, and she will help him look \"cool\" by pretending to be his girlfriend for a month, even though she already has a boyfriend named Bobby who is away at his freshman year at the University of Iowa. Ronald feels that he can be a part of the popular crowd if they think Cindy is dating him. Both agree never to reveal their financial arrangement.\nRonald then trades his nerdy, yet loyal, friends for the popular, but shallow, students, and undergoes a complete clothing and hair makeover under Cindy's direction. Over the course of the month, they discover each other's individuality and a bond develops organically between the two. Cindy soon starts to genuinely like Ronald and appreciates his company. As he washes her car at her house, she opens up to him, fetching a poem that she had written that means the world to her and letting Ronald read it. She gets to know him better as he reveals his interests in astronomy and space travel. They gaze at the moon and he tells her how, when they are their parents age, \"people will be working there and living there... maybe even us\". On the last date which Ronald has \"paid\" for, Cindy hints that she would like to kiss Ronald, signifying that she has real feelings for him, but he misunderstands and assumes she wants to talk about ending their arrangement. They dramatically \"break up\" in front of a crowd at school, but Ronald takes things too far and says some hurtful things about Cindy in front of their friends. She becomes cool and distant, but warns him that popularity is hard work and he needs to make sure that he \"stays [him]self\". The next day, Cindy appears disgusted with Ronald when she sees him behaving arrogantly at school, and becomes jealous when she sees him flirting with her best friends Barbara and Patty, whom he later takes out on dates.\nRonald continues playing \"cool\" by hanging out with the jocks and hot chicks. He takes Patty to a dance at school, where he performs a dance he learned from an African cultural show on public television (he mistakenly thought he was watching American Bandstand). At first, the other kids are mystified, but they soon join in, and Ronald's new \"trendy\" dancing further increases his popularity at school. On Halloween night, he and some other boys drive to the house of Kenneth (Courtney Gains), Ronald's best friend, where the jocks test his loyalty by coercing him to hurl dog feces at Kenneth's house. Kenneth is lying in wait and catches Ronald, but lets him go before his dad can call the police. Kenneth ignores Ronald the next day at school.\nAt a New Year's Eve party at Big John's (Eric Bruskotter) house, Ronald gets drunk and has sex with his date, Iris (DeVasquez), in the bathroom. Iris has a reputation nailing a lot of popular guys. Cindy walks by and hears Ronald reciting to Iris the very poem that she had written and allowed him to read. Devastated, she starts drinking heavily. Later, as a surprise, Cindy's boyfriend, Bobby, shows up at the party, as he still has strong ties to the athletes at the school. After he learns about her relationship with Ronald, through Quint and Ricky (Gerardo Mejia), Cindy is brutally dumped in front of her friends. Even though she tried to explain to Bobby, he paid her to go out with him. Bobby didn't believe her and he still broke up with her. In anger and frustration, she tells the party-goers the truth about her relationship with Ronald and his \"cool\" pretenses. She scolds her friends for falling for his act and for being \"a bunch of followers\". \"Our little plan worked, didn't it Ronald?\" Cindy says as she crushes his popularity, sending Ronald back to the bottom rung of the high school social ladder. Rejected and dejected, Ronald leaves the party alone to spend the night in his garage, crying himself to sleep. When school resumes after the holiday break, he immediately finds himself ostracized as a social pariah. The \"jocks\" once again tease and throw food at him, and he soon finds that the nerdy crowd has abandoned him also. His distress only deepens when his attempts to reconcile with both Cindy and Kenneth are rebuffed.\nA moment for Ronald to redeem himself comes when he defends Kenneth against a potentially violent encounter with Quint. Kenneth, while helping Patty (Darcy DeMoss) with her math homework, is approached by Quint, who orders him back to his side of the cafeteria, or take a serious beating. Ronald intervenes, threatening to break Quint's pitching arm if he does not leave Kenneth, who had only been tutoring Patty out of sincere kindness, with no ulterior motive, alone. Ronald points out that the three were all friends at one time: when they were nine, Quint had fallen out of their tree house and broken his arm. Kenneth carried him twelve blocks to the hospital, with Quint crying all the way. He tells Quint that he - Ronald - was desperate to run with the popular crowd, but he had messed up by trying to buy his way in. Kenneth, however, was just trying to make friends by being himself. Ronald goes on to say that the cool/nerd dynamic is \"all bullshit, it's tough enough just being yourself\", and walks away. Quint apologizes to Kenneth and the two shake hands as the whole school applauds. Ronald finally redeem himself with everyone.\nFollowing the incident, Cindy recognizes Ronald's worth, and the two reconcile when she decides to hop on the back of his riding lawn mower instead of hanging out with her popular friends. He asks her to prom and the two kiss as the title song plays. Closing credits roll while the two of them ride off into the sunset on the lawn mower."}