{"mid": "CapitalismALoveStory", "IMDB_id": "tt1232207", "title": "Capitalism: A Love Story", "plot": "Moore begins by looking back at the contradictions in Ancient Rome, drawing similarities with the present day, and wondering how people of the future will look back on American society now. Would they pay more attention to viral videos or the wave of home foreclosures after the late-2000s financial crisis? Moore meets with his friend Wallace Shawn and they discuss what capitalism and \"free enterprise\" mean. Looking back on his happy and prosperous early life, Moore reflects, \"if this was capitalism, I loved it... and so did everyone else\": in the 1950s, the top tax rate was 90% and this meant that the country could build dams, bridges, schools and hospitals, most families only had one parent in work, union families had free healthcare, college tuition was free, most people had little personal debt and pensions were guaranteed. This prosperity was driven by the manufacturing industry, which benefited from post-war Germany and Japan struggling to recover.\nHe describes President Jimmy Carter's Crisis of Confidence speech as a turning point, which culminated in the election of Ronald Reagan in 1980, whom Moore calls a \"spokesmodel\" for the banks and corporations, who wanted to remake America to serve their interests. He points to the influence of Donald Regan, the Chairman and CEO of Merrill Lynch who served as Reagan's Secretary of the Treasury (1981–1985) and White House Chief of Staff (1985–1987), and the dismantling of America's industrial infrastructure, which was done for short-term gain by companies posting massive profits, and to destroy the unions. Unemployment and productivity increased as wages stagnated, the top tax rate was halved, household debt increased to almost 100% of GDP, bankruptcies and the incarceration rate skyrocketed and sales of anti-depressants and healthcare costs rose. This is compared to an increase in the Dow Jones Industrial Average and the ratio of CEO pay compared to the pay of average workers.\nMoore looks back on his first film, Roger & Me, about the regional economic impact of General Motors CEO Roger Smith's decision to close several auto plants in his hometown of Flint, Michigan, despite large profits. Moore tries to go into the General Motors head office in Detroit to speak to the Chairman but is denied access. He notes that by the time of the job cuts in Flint, Germany and Japan had rebuilt their automotive industries and were producing better, safer, cleaner, more reliable cars. Moore returns to the present, showing President George W. Bush enjoying his final year in office as companies announce massive layoffs and the economy starts to collapse. He also examines the Kids for cash scandal in Wilkes-Barre, Pennsylvania, which saw judges bribed by the builder of two private, for-profit juvenile detention centers, in return for contracting with the facilities and imposing harsh sentences on juveniles brought before their courts to increase the number of residents in the centers.\nAfter seeing the Congressional testimony of pilot Chesley \"Sully\" Sullenberger, who reported that over his career, his salary had been cut by 40 percent and his pension, like most airline pensions, was terminated and replaced by a \"PBGC\" guarantee worth only pennies on the dollar, Moore interviews other airline pilots on their experiences. They corroborate this, reporting low pay, massive debt, being on food stamps and taking second jobs. Moore notes that pilots being overworked and underpaid didn't enter into the media discussion following the crash of Colgan Air Flight 3407. He says that capitalism allows people to get away with anything, including making a profit from someone's death. He speaks to the family of a man who worked for Amegy Bank of Texas, which had secretly taken out a life insurance policy on him, with itself as the beneficiary, and then accidentally wrote to his widow, telling her that they were receiving a $1.5m payout because he died of cancer. He wonders how this can be legal when he is prohibited from taking out home insurance on someone else's property.\nMoore speaks to Catholic priests and Bishop Thomas Gumbleton, who agree that capitalism is evil and contrary to the teachings of Jesus and the Bible. Moore examines the claim that the tenets of capitalism are compatible with Christianity, arguing that the rich ignore religion when it comes to the poor, sick and disadvantaged. He points to Citigroup's leaked \"plutonomy memo\", which said that America and other countries were not democracies any more, but were ruled by the wealthy; though it feared a backlash from the \"99%\", who still had equal votes, but were content with the arrangement as they aspired to join the 1%. Moore then goes to see the United States Constitution, where he can find no trace of support for capitalism, only passages like \"we the people\", \"a more perfect union\" and \"promoting the general welfare\". He wonders what America would be like if all workplaces were democracies, like the worker owner co-operatives Isthmus Engineering & Manufacturing and Alvarado Street Bakery, where he finds that the workers are happy, concerned about fairness, productive and in the latter case, earn over $65,000 working on the assembly line. Moore also points to Jonas Salk, who developed and refused to patent a polio vaccine. He notes that now, top college graduates are so burdened with debt that they seek out high-paying jobs, leading many of them to work in derivatives and credit default swaps. Moore struggles to understand these concepts, finding that they are purposely complicated so as to avoid proper regulation.\nCutting financial regulations also allowed for increased refinancing to access home equity, which meant that lenders like Countrywide Financial, Citibank, Wells Fargo and Chase Bank offered subprime mortgages to people who couldn't afford the increasing interest rates and defaulted, causing the subprime mortgage crisis, which led to the global financial crisis. Moore meets with an ex-Countrywide employee, whose job it was to give prominent politicians, regulators and financiers cheap mortgages and discounted loans. He then meets William K. Black, who was a central figure in exposing Congressional corruption during the Savings and loan crisis, who tells Moore that the FBI was investigating mortgage fraud but had its priorities changed after the September 11 attacks, leading to white-collar crime going unpunished. Black compares the financial crisis to the failure of a dam: slowly at first, with a little failure that stretches back years, that ultimately ends in a sudden catastrophe. He also reports that bank executives and former politicians and regulators, like Robert Rubin, Lawrence Summers and Timothy Geithner, were the ones who profited financially from this, after changes in the law that allowed commercial banks to get into investment banking, hence the merger of Citicorp and Travelers Group.\nMoore meets with several members of Congress, who report being told that they needed to vote for the $700 billion bailout of the banks or the economy would collapse. He notes that the Treasury Department, which negotiated the bailout with Congress, is full of former Goldman Sachs executives, as it was under President Bill Clinton, including Treasury Secretary Henry Paulson, the former CEO of Goldman Sachs. Moore reports that these former Goldman executives used the bailout money to rescue Goldman and other favored companies. After Congress rejected the bailout on September 29, 2008, pressure was applied. There was another vote on October 3 and the bailout passed. Moore asks Elizabeth Warren, Chair of the Congressional Oversight Panel, what happened to the money and she tells him that the Treasury Department and the banks followed a \"don't ask, don't tell\" policy. Moore calls Paulson's office to ask why he followed this policy but is hung up on by his secretary. So he drives to Wall Street in an armored car to attempt to ask the banks for the money back and perform citizen's arrests on the executives.\nMoore reports on the Occupy movement and the 2008 presidential campaign of Democratic Senator Barack Obama, who is demonised as a \"socialist\". He notes that the smears against Obama don't work, as support for him increases and people become curious as to what socialism actually means. He profiles Wayne County Sheriff Warren Evans, who orders an end to foreclosures; the Miami Low Income Families Fighting Together, who re-occupy foreclosed homes; and workers at Republic Windows and Doors, who organised a sit-down strike after being fired without severance, vacation time, or health care benefits after the company was taken over by Bank of America and JPMorgan Chase. The striking workers are met with support from Obama, clergy and Illinois politicians and Moore asks if this is the beginning of a worker's revolt. After six days, Bank of America agrees to all their demands. Moore compares this action with the Flint sit-down strike of 1936–1937 and recalls President Franklin D. Roosevelt's proposed Second Bill of Rights during his 1944 State of the Union address and lamenting that Roosevelt's early death meant that none of it was accomplished. However, as Roosevelt's advisors went abroad after the end of World War II, many other countries adopted his ideas. In contrast, Moore muses, ordinary American people eventually suffered from crises like Hurricane Katrina, while the rich are unaffected.\nThe film ends with Moore marking Wall Street off as a crime scene, narrating that American people live in the richest country on Earth and deserve a decent job, healthcare, a good education and a home of their own, saying that it's a crime that they don't have these things, and never will as long as the evil of capitalism continues to enrich the few at the expense of the many. He calls for it to be eliminated and replaced with something good for all people—democracy. Moore concludes that he can't do this alone and appeals for help from the viewer."}