{"mid": "CapricornOne", "IMDB_id": "tt0077294", "title": "Capricorn One", "plot": "Capricorn One—the first manned mission to Mars—is on the launch pad. The bewildered crew of Brubaker (James Brolin), Willis (Sam Waterston), and Walker (O. J. Simpson) are removed from Capricorn One and flown to an abandoned desert base. The launch proceeds on schedule, and the public is unaware that the spacecraft is empty. At the base, the astronauts are informed by NASA official Kelloway (Hal Holbrook) that a faulty life-support system would have killed the astronauts during the flight, and they must help counterfeit the television footage during the flight to and from Mars. Initially they refuse, but Kelloway threatens their families if they do not cooperate.\nThe astronauts remain in captivity during the flight and are filmed landing on Mars within a studio located at the base. The conspiracy is known to only a few officials, until alert technician Elliot Whitter (Robert Walden) notices that ground control receives the crew's television transmissions before the spacecraft telemetry arrives. Whitter mysteriously disappears before he can finish sharing his concerns with journalist friend Robert Caulfield (Elliott Gould). Caulfield discovers that all evidence of his friend's life has been erased and begins investigating the mission, surviving several attacks.\nUpon returning to Earth, the empty spacecraft burns up due to a faulty heat shield during re-entry. The captive astronauts board a plane to be placed in the spacecraft, but the plane unexpectedly turns around and returns to the airfield. They realize that something has gone wrong with the re-entry process and that officials can never release them because doing so would automatically expose the hoax. They break out of their confinement and escape in a plane, which runs out of fuel soon after take-off. Forced to crash-land and stranded in the desert, they attempt to return to civilization while being pursued by two helicopters. They start walking in three directions. Brubaker is the only one to avoid capture.\nCaulfield's investigation leads him to the desert, where he finds the military base and the hangar abandoned. Looking around, he finds a necklace given to Brubaker by his wife and concludes that the astronauts were in the hangar. With the help of crop-dusting pilot Albain (Telly Savalas), he searches the desert and rescues Brubaker from the men in the helicopters. The helicopters chase their plane but are destroyed after being blinded with crop spray. Ultimately, Caulfield and Brubaker arrive at the astronauts' memorial service, exposing the conspiracy."}