{"mid": "CaptainCorellisMandolin", "IMDB_id": "tt0238112", "title": "Captain Corelli's Mandolin", "plot": "The story begins with Dr. Iannis, an experienced and multilingual doctor who has a well-established practice on the Greek island of Cephallonia. Iannis lives with his daughter Pelagia; Pelagia's mother died of tuberculosis when Pelagia was still a girl. Pelagia, now a young woman, is headstrong and intelligent, and has learned about medicine by observing her father. Some of the subsequent chapters, however, are told from the perspective of Carlo Guercio, a homosexual Italian man who has decided to join the Italian army which has been raised under the rule of Benito Mussolini during World War II.\nPelagia meets a young fisherman named Mandras, and they rapidly become engaged. Meanwhile, war has been declared, and Mandras decides to go fight at the front. Pelagia's letters to him go unanswered. Carlo Guercio fights among the Italian forces that invade Albania, and watches his beloved friend Francisco be shot by the defending Greek army. The Italian army is hopelessly incompetent, and eventually German forces arrive and drive back the Greek army, thus paving the way for Italy to occupy Greece.\nIn 1941, following the Italian invasion of Greece, Italian and German soldiers are posted to Cephallonia, where they are ostracized by the locals. Pelagia is determined to hate them, especially when a jovial young captain by the name of Antonio Corelli is assigned to live in her home. Mandras comes home from the war, injured and filthy, and as Pelagia nurses him she realizes that she no longer loves him. He admits that he is illiterate, which explains why he never answered Pelagia's letters. Soon after he is recovered, Mandras leaves again to join the underground. Pelagia gradually comes to know Corelli, and discovers that he is conscientious, civilised, humorous and far from fanatical, as well as being a consummate mandolin player. They inevitably fall in love, and become engaged, Pelagia being convinced that Mandras has died.\nAfter Mussolini loses power, Italy joins forces with the Allies. The Italians who occupy Greece thus are freed from their duties. However, the Italian army refuses to be disarmed by the Germans, and instead fight them. After defeating the Italian division, the German soldiers on Cephallonia turn on the Italians, and order a massive execution. Corelli's life is saved by Carlo Guercio, who shields him with his body when they face execution by firing squad. Guercio dies, and the wounded Corelli is aided by a Greek man back to Pelagia's house. Corelli has to stay hidden from the German soldiers, whose orders are to kill any surviving Italians. As soon as he is well enough, Corelli escapes to Italy, promising Pelagia that he will return as soon as the war ends and then they will be married. Corelli leaves Antonia, his mandolin, with Pelagia for safekeeping. The Germans become brutal, and Dr Iannis is sent to a camp. Mandras returns, indoctrinated with Communist ideologies and having learned to read. He has read Pelagia's letters and knows that she does not love him, so he tries to rape her. Ashamed, he later commits suicide. Some time after, a baby girl is left on Pelagia's doorstep, whom Pelagia adopts. Dr Iannis comes home traumatised. Life goes on in Cephallonia, though interrupted by the 1953 Ionian earthquake, in which Iannis dies. Yet Corelli does not return, though Pelagia is convinced she sees his ghost. The baby girl, whom Pelagia has named Antonia, grows up and marries.\nMany years later, an old man visits Pelagia, who is revealed to be Antonio Corelli, now a famous mandolin player. He explains that he did not visit before because, having seen her with baby Antonia on her doorstep and believing her to be married, he was bitter. The novel ends on a happy note.\n=== Major themes ===\nCaptain Corelli's Mandolin explores many varieties of love. We see the initial lust-based love between Pelagia and Mandras, which burns out as a result of the war, and the change it prompts in both of them. Corelli and Pelagia's slow-developing love is the central focus of the novel. Love is described by Dr Iannis as \"what is left when the passion has gone\", and it certainly appears that this criterion is fulfilled by the love of Corelli and Pelagia. The paternal love of Iannis for Pelagia is also strong and is heavily compared and contrasted to that of Corelli.\nThe theme of music is predominant, offering a direct contrast to the horror and destruction that the war brings and showing how something beautiful can arise from something horrible.\nThe war is described in graphic detail, particularly the death of Francesco. It is responsible for the fall of Mandras and Weber, the deaths of Carlo and Francesco, and the separation of Pelagia and Corelli.\nThroughout the novel, Bernières takes a harsh view of all forms of totalitarianism, condemning Fascism, Nazism, and Communism alike. Bernières himself described this as a novel about \"what happens to the little people when megalomaniacs get busy.\"\nAnother theme of the novel is the study of history. Dr Iannis spends much of his spare time attempting to write a history of Cephallonia, but he often finds his personal feelings and biasses running through whatever he writes. There is also a strong feeling against 'professional' history, which is suggested by Carlo Guercio's statement that \"I know that if we [the Axis] win then there will be stories about mass graves in London and vice versa\". This is reinforced by a quotation from Bernières which says that: \"history ought to be made up of the stories of ordinary people only.\" From this viewpoint, it can be seen that Bernières is very much a revisionist historian, considering social history superior to political history.\nBernières takes an ambiguous attitude towards heroism and villainy in the novel: many of the characters, despite committing atrocities, are viewed as human victims of bad circumstances. For example, the character Günter Weber receives a great degree of sympathy from the writer, even though he fully engages with the Nazi ideology and is guilty of taking part in the killing of an entire Italian division. Despite having become friends with many of the men, Weber must follow orders. Similarly, Mandras is guilty of murder, torture, and rape, yet the author portrays him sympathetically: \"just another life tarnished... by war.\"\n=== Major characters ===\nDr. Iannis – The island's unofficial, unlicensed doctor, who spends much of his time writing about the history of Cephallonia. He is respected by the community, although regarded as a bit odd, and is thanked for his medical services by means of food and drink.\nPelagia – Dr Iannis's daughter, who is not like the other women on the island (she is well educated and has a lot of respect from her father), who at first falls in love with Mandras, then later with Corelli.\nAntonio Corelli – An Italian captain with a love of music and life. He detests the war and gradually falls in love with Pelagia; but the war inevitably tears them apart again.\nMandras – A young, handsome fisherman who falls in love with Pelagia, only to destroy their relationship by going to fight in the war, and ultimately humiliating himself.\nCarlo Piero Guercio – A good-natured homosexual Italian soldier who falls in love with Francesco only to lose him to the war. He later falls in love with Corelli and sacrifices his life to save the Captain's."}