{"mid": "CaptainBlood", "IMDB_id": "tt0014759", "title": "Captain Blood", "plot": "In 17th-century England, Irish doctor Peter Blood (Errol Flynn) is summoned to aid Lord Gildoy, a wounded patron who participated in the Monmouth Rebellion. Arrested while performing his duties as a physician, he is convicted of treason against the King and sentenced to death by the infamous Judge Jeffreys. By the whim of King James II, who sees an opportunity for profit, Blood and the surviving rebels are transported to the West Indies to be sold into slavery.\nIn Port Royal, Blood is purchased by Arabella Bishop (Olivia de Havilland), the beautiful niece of local military commander Colonel Bishop (Lionel Atwill). Attracted by Blood's rebellious nature, Arabella does her best to improve his situation by recommending him as the personal physician of the colony's governor, who suffers from painful gout. Outwardly resentful towards Arabella, yet silently appreciative for her efforts on his behalf, Blood develops an escape plan for himself and his fellow slaves. The plan is almost uncovered by the suspicious Colonel Bishop, who has one of Blood's men flogged and interrogated. Blood is spared a similar fate when a Spanish man-o-war attacks Port Royal. During the raid, Blood and his fellow slaves seize the Spanish ship from its drunken night watch, and sail away to begin lives of piracy.\nBlood and his men quickly achieve great fame among the brotherhood of buccaneers. When the old governor is unable to contain the pirate menace, Colonel Bishop is appointed governor. He sends Arabella to England on an extended holiday, but three years later she returns to the Caribbean. Her ship, also carrying royal emissary Lord Willoughby (Henry Stephenson), is captured by Blood's treacherous partner, Captain Levasseur (Basil Rathbone), who plans to hold them for ransom, but Blood forces Levasseur to sell them to him, relishing the opportunity to turn the tables on Arabella. When Levasseur vehemently objects, Blood is forced to kill him in a duel.\nBlood offers Arabella valuable jewelry from his conquests as a sign of his love for her. Ungrateful for her \"rescue\", Arabella is indignant at having been purchased by Blood, and calls him thief and pirate. Angered by her rejection, he orders his men to set sail for Port Royal where he will deliver Arabella and Lord Willoughby, despite the danger to himself and his crew.\nAs they approach Port Royal, they sight two French warships attacking the city; Bishop has left it undefended in his single-minded pursuit of Blood. With England now at war with France, Lord Willoughby pleads with Blood to save the colony, but the captain and his crew refuse to fight for the corrupt king. Willoughby reveals that James II has been deposed in the Glorious Revolution; England's new king, William of Orange, has sent Willoughby to offer Blood and his men full pardons and commissions in the Royal Navy. This startling news quickly changes the pirates' minds, and they prepare for battle with the French.\nAfter ferrying Arabella ashore, Blood and his men approach Port Royal flying French colors, but soon that ensign is replaced with the British Union Jack. A pitched ship-to-ship battle ensues, leading to frenzied hand-to-hand deck combat. Blood and his men defeat the French frigates, saving the colony, but not before losing their ship in the battle. As a reward, Blood is appointed the new governor of Port Royal by Lord Willoughby and has the pleasure of dealing with his hostile predecessor, now returned from his pirate hunt and under arrest for dereliction of duty in a time of war. As Arabella playfully pleads with the new governor to spare her Uncle's life, Peter Blood reveals his face to the astonished Colonel. With a sly smile of triumph, he greets Bishop with, \"Good morning, Uncle\", having won the hand and heart of Arabella."}