{"mid": "CaptainAmericaCivilWar", "IMDB_id": "tt3498820", "title": "Captain America: Civil War", "plot": "In 1991, Bucky Barnes (Sebastian Stan), brainwashed to be the Winter Soldier, causes a car to crash and recovers bags of a serum that turns people into super soldiers.After the Avengers defeated Ultron, Thor and Hulk are nowhere to be found. Hawkeye (Jeremy Renner) has gone home to spend time with his family. Even Iron Man (Robert Downey Jr.) has apparently disengaged. Captain America (Chris Evans) and Black Widow (Scarlett Johansson) are leading a new team of Avengers, consisting of Scarlet Witch (Elizabeth Olsen), Vision (Paul Bettany), War Machine (Don Cheadle) and Falcon (Anthony Mackie). But the world hasn't forgotten the numerous civilian casualties that resulted from the Avengers' previous missions.In Lagos, Nigeria, the team is tracking the movements of Brock Rumlow (Frank Grillo), a Hydra agent who had infiltrated S.H.I.E.L.D. until Captain America exposed him. Brock was on one of the three ships that Cap had caused to fire on each other, and he managed to survive the resulting crash, but he was badly burned, and now he wears a skull mask and goes by the name Crossbones. In Lagos, Crossbones and his team of mercenaries ram a garbage truck into the Institute for Infectious Disease building and clear out the guards with smoke canisters. Crossbones uses hydraulic gauntlets to give him super strength, and pounds open the glass around the lab. He grabs a vial containing a deadly, highly contagious virus. Cap's team takes out some of the mercenaries, and Crossbones and the rest of the men make their escape in a truck. After a chase, the truck is taken out of action. Crossbones hands the vial to one of his men, and tells them all to scatter. He then engages Cap, repeatedly punching him with enhanced strength, while the rest of the team chases after the mercenaries. Falcon finds the one holding the vial and shoots him, with Black Widow grabbing the vial before it hits the ground. Cap gets the upper hand on Crossbones, pinning him against the wall. Crossbones tells him that Bucky Barnes remembers him. With Cap momentarily distracted, Crossbones pushes a button, triggering a bomb on his vest. Cap braces himself, but Scarlet Witch is able to contain the force of the explosion. She uses her powers to push it up into the air, but she's only able to elevate it a bit before she loses control, and the explosion rips into the seventh floor of a nearby hotel. Cap calls for fire and rescue, and then runs into the building to help evacuate. Wanda tearfully looks at the destruction.In a theater inside Tony Stark's old college, a video plays of him and his parents, Howard (John Slattery) and Maria. At the end, Tony tells the students that he is starting the Howard and Maria Stark Foundation, and each one of them has been approved for a research grant. In a corridor, a woman confronts him and shows him a picture of her son, who had been killed in Sokovia, crushed by a building that the Avengers had knocked down.At the Avengers' headquarters, the team is watching news footage of the Lagos mission. The reporter says that eleven people were killed in the hotel. Steve tells them that he let his guard down, and people died because of it. Vision tells Steve that Tony has arrived, and he brought the Secretary of State as a guest. General Thaddeus Ross (William Hurt) had been involved in the experiment that turned Bruce Banner into the Hulk, and then had spent years trying to hunt him down. Ross tells them that some people look up to them as heroes, but others think they're vigilantes. He shows pictures of the destruction that follows the team wherever they go. Then he sets a thick document down on the table and tells them it's the Sokovia Accords, ratified by 117 countries. The accords state that the Avengers will operate under a panel's supervision, only acting when the panel decides it's necessary. He says there will be a meeting in Vienna in three days, and if they don't sign on, they'll have to retire.The team spends hours debating whether to agree to the accords, and Tony pulls out the picture of the boy who was killed in Sokovia. Steve asks what will happen if there's somewhere they need to go, but the panel won't allow them. Tony replies that if they don't agree to this now, it will be forced on them later. Getting nowhere, Steve leaves in disgust. The next day, Natasha finds him in an old church. She tells him that she, Tony, James Rhodes and Vision had signed on, with Clint and Wanda holding out.In Vienna, several heads of state have gathered for the ratification of the accords. Natasha meets the prince of Wakanda, T'Challa (Chadwick Boseman), and his father, King T'Chaka (John Kani). Wakanda had become abundant in vibranium, the material that was used to make Captain America's shield, after a meteorite crashed there. Additionally, some of the Lagos victims were from Wakanda. King T'Chaka takes the podium for the keynote address, and Natasha notices security personnel surrounding a van parked outside. An explosion rips through the building, killing the king.Back in the U.S., Steve is sitting in a hotel room with Sam and his old friend, Sharon Carter (Emily VanCamp), when a news report comes in, showing the destruction in Vienna. Security footage shows the man who planted the bomb, and Steve realizes that it's Bucky. Sharon gets a text, and tells Steve that she has to go to work, and takes a military plane to Vienna. Natasha looks around and sees hundreds of injured people. Prince T'Challa picks up a printed photo showing Bucky leaving the van that had the bomb. Natasha calls Steve, and he tells her that he has to be the one to bring in Bucky. He hangs up and looks at the damaged building, having already arrived in Vienna. Sharon sees him, and she hands him a file so he can get a head start on the manhunt, ahead of a German military task force, GSG9, who have orders to shoot to kill.In Bucharest, Bucky picks up a newspaper and sees that he is being accused of the bombing in Vienna. He realizes that he'll have to leave quickly. Steve goes to Bucky's apartment and finds him there. The GSG9 storm in, and Bucky blocks their bullets with Cap's shield. He jumps down to the street, where he is confronted by the Black Panther, who scrapes his armor with metal claws on his hands. Cap jumps down and lands next to them, and all three take fire from the GSG9. Cap and Bucky run for cover, but the Black Panther stands still, letting the bullets hit him and bounce off harmlessly. Cap realizes his armor must be made of vibranium. Bucky runs through the streets with Black Panther coming after him, and Cap and Falcon following the Panther. Cap commandeers a GSG9 SUV, while the Panther leaps from the top of one car to the next, steadily gaining on Bucky. Bucky knocks a man off a motorcycle, then jumps on himself and guns the engine, driving into a tunnel. Black Panther is still tirelessly giving chase. Cap drives the SUV near Bucky's motorcycle, and the Panther jumps onto the SUV's roof, and then onto the back of the motorcycle. Bucky swings backward, knocking the Panther off, but he sticks his claws into the side of the SUV and clings to its side. Bucky looks ahead and sees Falcon flying straight toward him. He hits the brakes, and turns the motorcycle around and drives back past the SUV. Cap throws it into reverse, trying to keep up with Bucky. The Panther jumps into the air, and lands on Falcon's wings. Bucky takes a metal ball and throws it up to the roof of the tunnel. It explodes, blowing a hole in the concrete. Falcon uses his wings to shield himself, throwing off the Panther, who went straight through the explosion, unharmed. Bucky swerves to avoid a car, and falls off the bike. The Panther jumps on him, swinging his claws at him. Cap tackles the Panther, and they trade blows, with the Panther's claws leaving gashes in Cap's shield. War Machine flies in through the hole, and the GSG9 surrounds them all and tells them to put their hands up. They are all arrested, and the Black Panther's mask is removed. Cap recognizes him as Prince T'Challa of Wakanda.On the ride to the task force headquarters in Berlin, Cap tells the prince that he has the wrong man. Cap, Falcon and the prince get out, and in another truck, Bucky is taken out in a cage. They are met by Everett Ross (Martin Freeman), the leader of the headquarters. The men have their weapons removed, and they are led inside the building, where Black Widow is waiting for them. Everett takes Prince T'Challa into one room, and the others are led to another room, where Tony tells them that Secretary Ross wants to have them all prosecuted. Tony says that as a compromise, they won't get back the shield and wings, which are now government property.T'Challa uses his influence to have Bucky extradited to Wakanda, where he will face charges of terrorism. Bucky is given an evaluation to determine his mental state. Still in the room with Tony, Cap watches it unfold. Tony tells him that if he signs the accords now, Bucky will be transferred to an American psych facility instead of a Wakandan jail. Steve agrees, but only if safeguards are put into place. Tony brightens, telling Steve that this will get him and Wanda reinstated. Steve asks what he means about Wanda, and he tells Steve that she is being confined to the compound by Vision. Tony says it's the best he can do, since she's not a U.S. citizen and they won't give her a visa. Steve says that she's only a kid, and doesn't deserve to be imprisoned. He leaves without signing onto the accords.Hawkeye breaks into the facility where Vision is holding Scarlet Witch. He attacks Vision, but is unable to hurt him. Scarlet Witch uses her powers to make Vision fall through the floor, and she and Hawkeye escape.Colonel Zemo (Daniel Brühl), having already killed a Hydra agent and recovered a book containing a list of words that will trigger Bucky's reversion to his brainwashed state, infiltrates the compound and reads off the list. Bucky pounds his way out of his cell and fights Cap and Iron Man. Cap subdues him and takes him away. Regaining his senses, Bucky tells Steve that Zemo is going to Siberia, where there are several more super soldiers waiting for someone to wake them up and give them a mission.Cap assembles a team consisting of Bucky, Falcon, Hawkeye, Scarlet Witch and Ant-Man (Paul Rudd) to stop Zemo. By operating outside of authority, they all become renegades. Iron Man forms his own team, made up of War Machine, Black Panther, Black Widow, Vision and Spider-Man (Tom Holland) to arrest the others. In the battle, Ant-Man turns into a giant, distracting Team Iron Man and buying time for Cap and Bucky to escape to an aircraft hangar. Black Widow appears intent on stopping them, but she turns on Black Panther, allowing Cap and Bucky to fly off. War Machine tries to stop them from escaping, but Falcon flies after him. Vision shoots an energy beam at Falcon, but he dodges and it hits War Machine instead, causing him to fall from the sky and nearly killing him.After seeing evidence that Bucky was framed for the Vienna explosion, Iron Man heads to Siberia to meet up with Cap and Bucky and make peace. They find that the super soldiers have already been killed, and Zemo, hidden behind indestructible glass, reveals that his real plan was to find footage of the Winter Soldier's first mission. Black Panther had been following, unseen, and he hears Zemo admit responsibility for the explosion. Zemo shows them a videotape of Bucky causing the car crash, and then murdering the occupants, Howard and Maria Stark, in cold blood.Incensed, Iron Man attacks both Cap and Bucky, and he demands to know if Steve knew what had happened. Steve tells him that he only knew that Hydra was behind his parents' murder. They fight, and Iron Man blasts off Bucky's metal arm. Cap disables Iron Man's suit, and Tony tells him that he doesn't deserve to carry his shield. Steve drops it and leaves with Bucky. Zemo is sitting outside, and Black Panther stands behind him. He tells Black Panther that his family was killed in Zokovia, and he wouldn't stop until he destroyed the Avengers from within. With his success, Zemo tries to commit suicide with a gun, but Black Panther places his hand over the barrel, stopping the bullet, and then apprehends Zemo for judgment.Tony is helping Rhodes with his recovery, giving him robotic legs to recover from paralysis. Steve breaks the heroes out of their island prison and they go to Wakanda, where T'Challa gives them asylum. Bucky elects to be put back into cryogenic sleep until they can find a way to cure his brainwashing, so that no one will be able to manipulate him again. Peter Parker is recovering from his injuries at home, and he tries out a new version of the web shooter that Tony gave him. It projects the Spidey signal onto the ceiling."}