{"mid": "CapturingTheFriedmans", "IMDB_id": "tt0342172", "title": "Capturing the Friedmans", "plot": "The investigation into Arnold Friedman's life started after the U.S. Postal Service in 1987 intercepted a magazine of child pornography received from the Netherlands. In searching his Great Neck, New York home, investigators found a collection of child pornography. After learning that Friedman taught children computer classes from his home, local police began to suspect him of abusing his students.\nDuring police interviews, some of the children Friedman taught reported experiencing bizarre sex games during their computer classes. Jarecki interviewed some of these children himself; some stated that they had been in the room with other children alleging abuse, and that nothing had happened. The film portrayed police investigative procedures as the genesis of a \"witch-hunt\" in the Friedmans' community. The charges assumed that the abuse had taken place with multiple children over an extended period of time, yet none of them ever told any of it to anyone, nor were they in distress when parents arrived to pick them up from the computer classes.\nThe Friedmans were allowed to stay at home in order to prepare for court, and took numerous home videos while Arnold Friedman (and, later, his son Jesse) awaited trial. The videos were not made with publishing in mind, but as a way to record what was happening in their lives. The movie shows much of this footage: family dinners, conversations, and arguments. Arnold's wife, Elaine, quickly decided that her husband was indeed guilty and advised him to confess and protect their son; she soon divorced him.\nArnold Friedman pleaded guilty to multiple charges of sodomy and sexual abuse. According to the Friedman family, he confessed in the hopes that his son would be spared prison time. Jesse Friedman later confessed as well, but later claimed he did so to avoid being sent to prison for life. He said in mitigation that his father had molested him. According to Jesse's lawyer Peter Panaro, who visited Arnold in a Wisconsin federal prison, Arnold admitted to molesting two boys, but not those who attended his computer classes. He is also quoted as claiming that, when he was 13, he sexually abused his younger brother, Howard, who was eight years old at the time; Howard Friedman, interviewed in the movie, says he does not recall this. Jesse Friedman, in a subsequent statement, said that his father told him and his brothers of his abusing his younger brother.\nArnold Friedman committed suicide in prison in 1995, leaving a $250,000 life insurance benefit to Jesse. Jesse Friedman was released from New York's Clinton Correctional Facility in 2001 after serving 13 years of his sentence. Currently, he is running an online book-selling business."}