{"mid": "Carnosaur", "IMDB_id": "tt0106521", "title": "Carnosaur", "plot": "In a small town in the American Southwest, a mysterious illness befalls its citizens. Dr. Jane Tiptree (Diane Ladd), a scientist working for the Eunice Corporation, is secretly breeding a strain of extra large and fertile chickens by splicing their DNA with that of different animals. The sponsors of the corporation become suspicious of her research, but cannot legally interfere. One night during transportation of the chickens, a mysterious creature hatches from a chicken egg, kills the drivers and escapes into the night.\nDoc Smith (Raphael Sbarge) is an alcoholic security watchman protecting digging equipment from environmental activists, though he befriends one of them named Ann Thrush (Jennifer Runyon). Meanwhile, the creature, which turns out to be a juvenile Deinonychus, goes on a killing spree, killing two truck drivers and a group of teenagers. One of the dead teenagers was the daughter of Jesse Paloma (Frank Novak), an employee for Tiptree. Afraid of the truth about her research being leaked, she lures Paloma into a laser-protected Tyrannosaurus pen, where it consumes him.\nThrush and the other activists begin to protest by handcuffing themselves to the digging equipment. However, the grown Deinonychus appears and slaughters the activists while Thrush watches in horror. Doc finds Thrush in shock and brings her back to his trailer, where she is attacked by the Deinonychus but survives. Doc locates a truck belonging to the Eunice Corporation. Pretending to be the dead driver, he talks to Tiptree on the radio and makes his way to her facility. Meanwhile, Sheriff Fowler (Harrison Page) discovers a dinosaur embryo in a carton of eggs and brings it into a lab to study.\nDoc sneaks into Tiptree's lab and holds her at gunpoint, telling her to show him her experiments. She reveals that the infected chicken eggs are responsible for the town's mysterious illness, as they contain a lethal virus that kills men and impregnates women with dinosaur embryos, which kill the host when birthed. The goal of this is to spread the virus around the world, effectively driving the human race into extinction and letting the dinosaurs rule the Earth once more. When news of the town's deaths reaches the Eunice sponsors, they trace it back to Tiptree. The government infiltrates the town and has it placed under quarantine. In order to sterilize the situation, all civilians, infected or not, are shot and killed on sight.\nFowler investigates a disturbance at a puppy kennel where he is attacked by the Deinonychus. He fatally wounds and kills the creature, but not before being impaled by its sickle claw and succumbing to his wounds. Back at the lab, Tiptree reveals a serum that can cure the illness. Doc steals it tries to escape, accidentally ending up in the Tyrannosaurus pen. Tiptree releases the dinosaur from its laser bounds and it chases Doc. He escapes and the Tyrannosaurus breaks out of the facility. Tiptree is revealed to have infected herself with the virus, and dies as a baby dinosaur rips its way through her stomach.\nDoc returns to Thrush, who has fallen ill to the virus. Before he has a chance to inject her with the serum, the Tyrannosaurus makes its way to the construction site. Doc battles the creature with a skidsteer but is nearly killed. Thrush joins in with another skidsteer and impales the dinosaur, killing it. Bringing Thrush back into the trailer, she succumbs to the virus and Doc is shot and killed by government soldiers, who then burn his and Thrush's bodies."}