{"mid": "CarnalKnowledge", "IMDB_id": "tt0066892", "title": "Carnal Knowledge", "plot": "The story follows the sexual exploits of two Amherst College roommates over a 25-year period, from the late 1940s to the early 1970s. Sandy (Art Garfunkel) is gentle and passive, while Jonathan Fuerst (Jack Nicholson) is tough and aggressive. Sandy idolizes women, Jonathan objectifies women. He frequently uses the term \"ballbuster\" to describe women as emasculating teases whose main pleasure as he sees it is to deny pleasure to men. Since each man's perspective of womanhood is extreme and self-serving, neither is able to sustain a relationship with a woman.\nThe film has three parts. Part I occurs when Sandy and Jonathan are college roommates. Part II follows the men several years after college. In the final part, the men have become middle-aged.\nIn the beginning, Sandy and Jonathan are discussing women, and what kind appeals to each. Sandy wants a woman who is intellectual. Jonathan is more interested in a woman's physical attributes.\nSandy shyly meets Susan (Candice Bergen) at an on-campus event and they begin dating. Although they enjoy each other's company, Susan is reluctant to enter into a physical relationship. Unknown to Sandy, she meets Jonathan, feeling a physical attraction for him. They have sex. Jonathan convinces Susan not to have sex with Sandy. Susan therefore has a purely intellectual relationship with Sandy, while at the same having a purely physical relationship with Jonathan.\nPart II finds Sandy married to Susan, while Jonathan is still searching for his \"perfect woman.\" Jonathan now defines perfection by a woman's bust size and figure. Jonathan begins a relationship with Bobbie (Ann-Margret), a beautiful woman who fulfills all of Jonathan's requirements. However, Jonathan constantly berates Bobbie for being shallow. Jonathan finds that this purely physical relationship is no more satisfying than his previous relationship with Susan.\nSandy's relationship with Susan is faring no better. Sandy is dissatisfied with the physical part of their relationship. He relates how they are \"patient with each other\" and concludes with a statement that perhaps sex is not \"meant to be enjoyable with a person you love.\"\nSandy and Susan end their relationship. He begins dating Cindy (Cynthia O'Neal) next. Sandy, Cindy, Jonathan and Bobbie find themselves together at Jonathan's apartment, where Jonathan suggests privately to Sandy that they trade partners. Sandy goes to a bedroom looking for Bobbie. Cindy reprimands Jonathan for attempting to bed her with Sandy nearby, but says that he should contact her at a more appropriate time. In the meantime, upset by an earlier fight with Jonathan about her desire to get married, Bobbie has attempted suicide.\nPart III opens with Jonathan presenting a slideshow entitled \"Ballbusters on Parade\" to Sandy (now in his 40s) and his 18-year-old girlfriend, Jennifer (Carol Kane). The slideshow consists of pictures of Jonathan's various loves throughout his life. He skips awkwardly over a slide of Susan, but not before Sandy notices. He also shows an image of Bobbie, saying they are divorced and he is paying her alimony. Jennifer leaves in tears. Sandy idolizes his new lover, explaining that \"she knows worlds which I cannot begin to touch yet.\" Jonathan believes his friend is deluding himself.\nTime passes. Jonathan, by now extremely successful, is alone and suffers from impotence. A prostitute (Rita Moreno) is with him, manually stimulating Jonathan while reciting a monologue written by Jonathan praising his power and \"perfection,\" apparently the only way he can now become aroused."}