{"mid": "CartoonAllStarsToTheRescue", "IMDB_id": "tt0154129", "title": "Cartoon All-Stars to the Rescue", "plot": "In Corey's bedroom, an unseen person steals her piggy bank from her dresser. The theft is witnessed by Papa Smurf, who emerges from a Smurfs comic book with the other Smurfs and alerts the other cartoon characters in the room (Garfield as a lamp, ALF from a framed picture, Baby Kermit as an alarm clock, Winnie the Pooh as a doll, Alvin and the Chipmunks from a record sleeve, and Slimer who passes through a wall).\nThe cartoon characters track down the thief and discover that it is Corey's big brother, Michael. Simon opens a box under Michael's bed and identifies its contents as marijuana. Meanwhile, Corey expresses her concerns about Michael's change in behavior. He storms out of the house. The cartoon characters quickly realize that something must be done about his addiction and they set off, leaving Pooh behind to look after Corey.\nAt the arcade, Michael smokes pot with his old \"friends\" and \"Smoke\", an anthropomorphic cloud of smoke. They run out and are chased into an alleyway by a policeman. The \"policeman\" is then revealed to be Bugs Bunny wearing a policeman's hat. Bugs traps Smoke in a garbage can and uses a time machine to see when and how Michael's addiction was started.\nMeanwhile, at home, Corey and Michael's parents are concern about their son's behavior, but Corey passes it off as nothing despite also being worried about. Pooh then approaches her and questions her about Michael, which she responds saying she doesn't want to get Michael into trouble, Pooh however tries to reason with her.\nInside a Hall of Mirrors, ALF shows Michael his reflection of how he is today, then his reflection if he does not stop taking drugs: an aged, corpse-like version of himself. When Michael insists that he could quit if he wants to and that he is in charge of his own life, ALF takes him to see the \"man in charge\" — Smoke.\nCorey and Pooh re-enter Michael's room and find his marijuana box. Smoke appears and throws Pooh inside a cabinet and tempts Corey to try the drug. Corey reasons that if she does what Michael does, then maybe they could have fun together, like they used to before he started doing drugs.\nMichael comes back into his bedroom, just in time to stop Corey from using the drugs herself. He tells her that he never wants to see her end up like him, and admits he was wrong, though he is unsure if he can change. She advises him to talk about his problems to their parents and to her. Smoke tries to persuade him otherwise, but Michael throws him out of the window, as he feels that he \"listened to him long enough.\" While in a garbage truck, Smoke vows to return saying \"[Michael] can bet on it!\" The special ends with Michael letting Pooh out of the cabinet and Michael and Corey go tell their parents about Michael's drug problem, while Pooh jumps into a poster on the wall with the other cartoon characters."}