{"mid": "Casper", "IMDB_id": "tt0115128", "title": "Casper", "plot": "Following the death of her father, neurotic and spoiled heiress Carrigan Crittenden discovers he has only left her Whipstaff Manor in Friendship, Maine. Carrigan and her attorney Dibs discover a vast treasure allegedly is in the manor, but they find it is haunted by a friendly ghost named Casper and his obnoxious prankster uncles, the Ghostly Trio, who scare the two off the property, causing them to try several attempts to get the ghost out of the house, but with no success. A lonely Casper watches a news report of paranormal therapist James Harvey, and is instantly smitten with his teenage daughter Kat, which led him to inspire Carrigan, so she can summon Dr. Harvey to Whipstaff. Harvey and Kat have an estranged relationship due to the former’s reputation, and searching for the ghost of his late wife Amelia. Moving into Whipstaff, Kat and her father quickly encounter Casper, who tries to befriend them, while his uncles try to scare them out of the house.\nAfter befriending Casper over breakfast, Kat goes to school with Casper following her. She becomes popular when her class agree to host their Halloween party at Whipstaff upon learning she lives there. Amber, Kat’s classmate who immediately dislikes her, becomes envious of Kat stealing her spotlight since originally the party was going to be at her place and plots with her boyfriend Vic to humiliate Kat during the party. Harvey attempts to have therapy sessions with the Ghostly Trio, who reveal to know Amelia; in exchange for getting Carrigan to leave them alone, they promise to go through the \"red tape\" involved to get Harvey a meeting with his wife.\nMeanwhile, Kat learns Casper has no memory of his life, and unlocks his old bedroom to remind him. Casper comes across an old wooden sled, recalling that when he was a young boy, his father bought it for him. Casper was so happy that he played outside on a very cold day until he caught a severe cold and died of pneumonia. After his death, he became a ghost to keep his father company. A newspaper article reveals that Casper’s father was declared legally insane after he built a machine named the Lazarus, which he claimed could bring the dead back to life. Casper and Kat venture down into the manor’s basement, discovering the Lazarus. Carrigan and Dibs sneak in, stealing the formula that powers the Lazarus and plot to use the machine to their advantage, believing it could grant them immortality. However, the two attempt to kill each other as an experiment; as a result, Carrigan falls off a cliff to her death and rises as a ghost.\nMeanwhile, Dr. Harvey becomes dispassionate, encouraging the trio to take him out for a night on the town. But unknown to him, they plan on killing him to make themselves a quartet, but ended up having a change of heart after a drunk Harvey states that he is going to tell Carrigan off so they can stay in their home. However, Harvey accidentally falls to his death down in a manhole.\nBack in the secret laboratory, Carrigan confronts Casper and Kat and launches Dibs out of a window when he tries to double-cross her. Casper and Kat trick her into stating that she has no unfinished business on Earth, causing Carrigan to be involuntarily ejected into the afterlife. The alleged treasure is revealed to be Casper’s prized baseball signed by Duke Snider. After Dr. Harvey has returned with Casper's uncles now as a ghost, which causes Kat to be in despair, Casper sacrifices his last chance to be alive once more to restore her father.\nThe Halloween party kicks off upstairs, and Amber and Vic’s prank is thwarted by the Ghostly Trio. Casper is visited by Amelia who became an angel in heaven instead of a ghost. She temporarily transforms him into a human boy as a reward for his sacrifice until ten o’clock. Casper dances with Kat, while Amelia speaks with Harvey, revealing that she was so content alive that she had no unfinished business, encouraging him to move on. Amelia departs as the clock chimes ten, and after kissing Kat, Casper transforms back into a ghost, which scares off the party guests, leaving him and the Harveys to dance to the ghostly trio's music."}