{"mid": "CastleFreak", "IMDB_id": "tt0112643", "title": "Castle Freak", "plot": "After inheriting a 12th-century castle which belonged to a famed Duchess, John Reilly and his family, including his wife Susan and their blind teenage daughter Rebecca, travel to Italy to live. Susan blames him for the death of their son in a drunk driving accident which killed his five-year-old son and cost their daughter her eyesight.\nOn the advice of the estate's executor, the three plan to stay at the castle until they can liquidate the estate. Little do they know, however, that a horrible, freakish monster has been kept locked away in the basement. Unbeknownst to them, the duchess' son, Giorgio Orsino, who was kept imprisoned and tortured by the duchess in revenge for her husband leaving her, still lives in the dungeons of the castle.\nSoon, the disfigured beast has escaped by means of breaking off his own thumb to get out of the manacles which bind him. The only reference to the H.P. Lovecraft story occurs when the monster beholds his hideous reflection in a mirror. He has emerged hungry for blood, leading to a series of unexplained deaths and disappearances including that of a prostitute who don't speak one word of english and John has picked up and brought to the castle after being rejected by his wife.\nWhen the police name John their prime suspect, he must find the true murderer before he or his family becomes the next victim. Along the way, he must not only battle the creature itself but overcome demons from his own guilty past.\nThe prostitute is sexually mutilated and killed by the monster, who also prowls around the bedroom of the terrified Rebecca, who can hear, but not see, him. The monster later kills one of the policemen investigating the castle, as well as the maid who lives at the castle and finds the prostitute's body. Eventually he abducts Rebecca and she is manacled in his old cell. Susan comes to the rescue and manages to stab the monster and rescue Rebecca but the monster survives his wound and continues to attack Rebecca and Susan.\nJohn starts putting together some of the weird things he’s been discovering around the castle and realizes that the Freak is actually his brother, and it was his mother that chained him up and tortured him all of his life because her husband abandoned her for America. John must now save himself and his family from this castle's unknown inhabitant before the \"castle freak\" has his way with them. A climactic rooftop battle between John and the monster ensues, ending in tragedy.\nJohn's funeral began and we see the son of the prostitute with the police at the end."}