{"mid": "CasualtiesOfWar", "IMDB_id": "tt0097027", "title": "Casualties of War", "plot": "The story is presented as a flashback of Max Eriksson, a Vietnam veteran.\nLt. Reilly leads his platoon of American soldiers on a nighttime patrol. They are attacked by the Viet Cong after a panicked soldier exposes their position. While on flank security, the ground cracks under Eriksson and he ends up partially stuck in a Viet Cong tunnel. Eriksson's squad leader, Sergeant Tony Meserve, pulls Eriksson out of the hole and eventually, the platoon retreats out of the jungle.\nThe platoon takes a break outside a river village in the Central Highlands. While relaxing and joking around, one of Meserve's friends, Specialist 4 \"Brownie\" Brown, is killed when the Viet Cong ambushes them. Brownie's death has a major impact on Meserve. Shortly afterward, the platoon is sent back to their barracks at Wolfe Base. Private First Class Antonio Dìaz arrives as the replacement radio operator.\nFrustrated because his squad has been denied leave for an extended period, Meserve orders the squad to kidnap a Vietnamese girl to be their sex slave. Eriksson strenuously objects but Meserve, Cpl. Thomas E. Clark, and Private First Class Herbert Hatcher ignore Erikkson's objections. Before the five-man squad disembarked, Eriksson talks about his concerns to his closest friend, Rowan. At nightfall, the squad enters a village and kidnaps a Vietnamese girl, Than Thi Oahn.\nAs the squad treks through the mountains, Dìaz begins to reconsider raping Than and begs Erikkson to back him up. The squad and Than eventually take refuge in an abandoned hooch, where Erikkson is confronted and threatened by Meserve, Clark, and Hatcher. As the taunting continued, Dìaz decides to go along with the rape in order to avoid ridicule. Erikkson, who is now outnumbered, is ordered to the guard the hooch as the rest of the men take their turn raping Than.\nAt daybreak, Erikkson is ordered to guard Than while the rest of the squad takes up a position near a railroad bridge overlooking a Viet Cong river supply depot.\nThrough his acts of kindness, Erikkson manages to earn Than's trust and prepares to go AWOL and return Than to her family. However, Meserve sends Clark to get Erikkson and Than to go to the bridge before Erikkson can carry out his plan.\nMeserve has Dìaz order air support for an assault on the depot and then orders Than to be stabbed to death by Dìaz. Before Dìaz can kill her, Eriksson fires his rifle into the air, exposing them to the nearby Viet Cong. In the midst of the firefight, Than tries to escape. Eriksson tries to save her but is stopped by Meserve, who knocks Eriksson down with the butt of his gun. Eriksson watches helplessly as the entire squad shoots Than numerous times until she falls off of the bridge.\nAfter the battle, Eriksson wakes up in a field hospital on Wolfe Base. Erikkson eventually bumps into Rowan and tells him everything that happened. Rowan suggests that Erikkson sees Lt. Reilly and Company commander Captain Hill. Both Reilly and Hill prefer to bury the matter and Erikkson is told that he will be reassigned to a Tunnel Rat unit. In addition, the other four men were to be split up and reassigned to other units.\nLater that evening an attempt on Eriksson's life is made by Clark, who tries to frag Eriksson while he is using the latrine. Eriksson takes action by confronting Meserve and his men, and using a shovel, strikes Clark across the face, scaring the rest of the men.\nEriksson then meets a chaplain at a bar and tells him the story of what happened during the patrol. There is an investigation and the four men who participated in the rape and murder are court martialed: Meserve receives ten years hard labor and a dishonorable discharge, Clark is sentenced to life in prison, Hatcher receives fifteen years hard labor, and Dìaz receives eight years hard labor.\nAt the end of the film, Eriksson wakens from a nightmare to find himself on a J-Church transit line in San Francisco, just a few seats from a Vietnamese-American student who resembles Than (same actress). She disembarks at Dolores Park and forgets her scarf and Eriksson runs after her to return it. As she thanks him and turns away, he calls after her in Vietnamese. She surmises that she reminds him of someone, and adds that he's had a bad dream. They go their separate ways and Eriksson is somewhat comforted."}