{"mid": "Catfish", "IMDB_id": "tt1584016", "title": "Catfish", "plot": "Young photographer Yaniv \"Nev\" Schulman lives with his brother Ariel in New York City. Abby Pierce, an 8-year-old child prodigy artist in rural Ishpeming, Michigan, sends Nev a painting of one of his photos. They become Facebook friends, which broadens to include Abby's family: including her mother, Angela (Wesselman); Angela's husband Vince (she uses a photo of Stephen Fogarty); and Abby's attractive older half-sister Megan, who lives in Gladstone, Michigan.\nFor a documentary, Ariel and Henry Joost film Nev as he begins an online relationship with Megan. She sends him MP3s of song covers she performs for him, but Nev discovers that they are all taken from performances on YouTube. He later finds evidence that Angela and Abby have lied about other details of Abby's art career. Ariel urges Nev to continue the relationship for the documentary, although Nev seems reluctant to continue. The siblings decide to travel to Michigan in order to make an impromptu appearance at the Pierces' house and confront Megan directly. As they arrive at the house, Angela takes some time to answer the door, but is welcoming and seems happy to finally meet Nev in person. She also tells him that she has recently begun chemotherapy for uterine cancer. After leaving multiple messages while trying to call Megan, she drives Nev and Ariel to see Abby herself. While talking with Abby and her friend alone, Nev learns that Abby never sees her sister and rarely paints.\nThe next morning, Nev wakes up to a text message from Megan saying that she has had a long-standing alcohol problem, and has decided to check into rehab and cannot meet him, which is confirmed by one of Megan's Facebook friends, but Nev realizes that this is likely another lie from Angela. After meeting with the family back at their house, Angela admits that the pictures of Megan were of a family friend, that her daughter Megan really is in rehab downstate and that Angela had really painted each of the paintings that she had sent to Nev. Nev thus realizes that while believing he was talking to Megan, it was really Angela posing as her with an alternate Facebook account and mobile phone. As he sits for a drawing, Angela confesses that the various Facebook profiles were all maintained by her, but that through her friendship with Nev she had reconnected with the world of painting, which had been her passion before she sacrificed her career to marry Vince—who has two severely mentally disabled children who require constant care. Through a conversation with Vince himself, the siblings learn that Angela had told him (falsely) that Nev was paying for her paintings, and that he had encouraged her to seize the opportunity to have him as a patron.\nVince, talking with Nev, tells the story about how live cod were shipped along with catfish in the same tanks to keep the cod active, and thus ensure the quality of the fish. He further explains this as a metaphor on how there are people in everyone's lives who keep them alert, active, and always thinking. It is implied that he believes Angela to be such a person.\nSome time after, Nev receives a package labeled as being from Angela herself; it is the completed drawing that she labored over during their meeting, although Nev seems ambivalent in his feelings about it.\nOn-screen text then informs the viewer that Angela did not have cancer, there was no Megan at Dawn Farms, and she doesn't know the girl in the pictures. Over the course of their nine-month correspondence, Angela and Nev exchanged more than 1,500 messages. It was revealed later on that the girl in the pictures was Aimee Gonzales, a professional model and photographer, who lives in Vancouver, Washington with her husband and two children. In October 2008, two years subsequent to the events, Ronald, one of Vince's twin sons, has died. Angela deactivated her 15 other profiles and changed her Facebook profile to a picture of herself, and now has a website to promote herself as an artist. Nev is still on Facebook and has more than 732 friends, including Angela."}