{"mid": "CatsDontDance", "IMDB_id": "tt0118829", "title": "Cats Don't Dance", "plot": "In 1939, Danny, an optimistic cat, dreams of Hollywood stardom, so he travels from Kokomo, Indiana to Hollywood in hopes of starting a career there. After meeting a new friend Pudge, Danny is selected by agent Farley Wink to feature in a film called the Li'l Ark Angel that is in production alongside a white cat named Sawyer at Mammoth Studios. Upon joining fellow animals; Tillie, Cranston, Frances, and T.W., Danny is dismayed on learning how minor his role is and tries to weasel his way into more time in the spotlight. Danny winds up angering Darla Dimple, a popular, extremely spoiled child actress and star of the film, so she assigns her Valet Max to intimidate Danny into no longer trying to enlarge his part.\nDanny learns from the studio's mascot Woolie that human actors are normally given more important roles than animals; a fact that none of them are very happy with but know they must accept. He longs for the spotlight and tries to make a plan that will encourage humans to provide animal actors with better scenarios — such as by assembling a massive cluster of animals and putting on a musical performance for the humans.\nLater, Danny is given advice by Darla (while masking her true villainous nature with a sweet one as she always does) through song on how to interest and satisfy audiences. He takes this information to heart and groups the animals for an audition on the Ark in hopes of attracting the humans' attention. However, Darla, fearing that the animals are jeopardizing her spotlight, has Max help her flood the stage, while L.B. Mammoth, the head of Mammoth Studios; and Flanagan, the film's director, is giving an interview, gets the animals blame and fired. The animals are depressed at being barred from acting in Mammoth Studios (especially Danny who was convinced by Darla that she was trying to help the animals). As Woolie tells Danny to leave for home, Cranston, Frances, and T.W. blame him for ruining their careers while Tillie suggests Sawyer to follow Danny.\nAfter a comment from the bus driver and seeing Pudge wander the streets, Danny comes up with a plan yet again. He secretly invites Sawyer, her friends, and Woolie to the premiere of Lil' Ark Angel. After the screening and a battle with Max that sends him flying away on a Darla Dimple balloon, Danny calls the audience's attention. Upon Sawyer, Woolie; Tillie bringing Cranston, Frances, and T.W. backstage to help Danny, the eight animals put on a musical performance that entertains and impresses its viewers. Meanwhile, Darla attempts to sabotage the show by tampering with the set and special effects equipment, but her attempts instead cause her to inadvertently enhance the performance as well as injure herself. Then last, she tries to ruin the show by pulling a big all-switch, though this sets off an enormous fireworks finale, making the animals' performance a complete success.\nFurious at the animals, Darla berates Danny then she accidentally confesses to flooding Mammoth Studios and framing the animals when her screaming is picked up and amplified by a nearby microphone, revealing the truth about the incident to the audience, including L.B. Mammoth and Flanagan. Pudge pulls a lever, sending Darla down a trapdoor. At last, the animals' demand for larger roles are met and their dreams are fulfilled after so long.\nThere is a montage of film poster parodies which put the main animals in roles. It is shown afterwards that Darla fired from show business and is now working as a janitor for her punishment. She puts up a \"The End\" poster on a wall, and it falls down and wraps around her."}