{"mid": "Chained", "IMDB_id": "tt1989475", "title": "Chained", "plot": "Eager to marry his devoted secretary, Diane Lovering (Joan Crawford), New York City shipping magnate Richard Field (Otto Kruger) asks his wife Louise (Marjorie Gateson) for a divorce. Louise, however, refuses to give up her social position and denies Richard's request. Although Diane insists that she will continue to love him without the benefit of marriage, Richard asks her to contemplate her choices while cruising to South America on one of his boats. Diane agrees to the cruise, but vows to return to New York unchanged.\nSoon after boarding, Diane meets Johnnie Smith (Stuart Erwin) in the ship's bar and rejects his flirtations. Johnny asks his smooth-talking best friend, Mike Bradley (Clark Gable), for help, but is double-crossed when Mike treats him like a drunk who's annoying Diane. Mike charms her and a shipboard romance blossoms. Still true to Richard, Diane makes no commitments to Mike. He persists, inviting her to visit his ranch in Buenos Aires. After a fun-filled day, Diane and Mike confess their mutual love. Diane finally tells him about Richard, but ealizing that Mike is the man she truly loves, Diane promises that when she returns to New York, she will end her affair with Richard.\nRichard, however, presents her with a wedding ring and explains that his wife finally agreed to divorce him on condition that he not be allowed to see his sons. Overwhelmed by his sacrifice for her, Diane says nothing about her new romance. After writing Mike a \"Dear John\" letter dumping him, she marries the millionaire.\nA year later, Diane runs into Mike in a New York gun shop and suggests they dine together. In spite of his bitterness, Mike still loves Diane and senses that she still loves him. Diane explains why she is loyal to Richard. Mike drops by their country house and, in spite of Diane's protests, vows to confront his rival. When Mike sees how kind and caring Richard is with Diane, however, he backs down and leaves. Richard reveals he had long sensed that she was in love with another man and nobly offers to divorce her. Unchained at last, Diane and Mike begin their married life on his Argentine ranch."}