{"mid": "ChallengeOfTheGobots", "IMDB_id": "tt0139769", "title": "Challenge of the GoBots", "plot": "In the series' backstory, thousands of years ago on the planet Gobotron, there lived a race of human-like beings known as GoBings. Civil war erupted on the planet when the power-hungry terrorist group known as the Renegades arose, led by a madman dubbed the \"Master Renegade\", who waged war against the peaceful Guardians.\nWhen a Renegade sabotage operation inadvertently resulted in a gigantic asteroid colliding with Gobotron, the natural disasters that resulted from the asteroid's impact pushed the GoBings to the verge of extinction. However, the genius who became known as the \"Last Engineer\" saved his people, taking his experiments to replace parts of his own body with mechanical substitutes to the ultimate extent and transferring the GoBings brains into large robot bodies known as \"GoBots\".\nThe GoBot forms possessed an additional ability; after being run through the device named the Modifier, the GoBots' bodies were able to transform into other vehicles. His work done, the Last Engineer intended to retreat to a pre-prepared workshop elsewhere in the galaxy, but the Master Renegade stole his ship and escaped in his stead. The Last Engineer placed himself into suspended animation beneath the surface of Gobotron, while above, the war continued to rage between the Guardians and the Renegades, now all encased in GoBot shells.\nIn the last quarter of the 20th Century, the planet Earth became involved in the conflict between Leader-1's Guardians and Cy-Kill's Renegades. During one of these battles, one of Leader-1's lieutenants, Turbo, became severely damaged. Unwilling to let his friend and teammate die, Leader-1 began his quest to find the legendary Last Engineer. Leader-1 found the person he believed to be the Last Engineer, but Leader-1 had unwittingly released the Master Renegade (though he did repair Turbo to gain the Guardians' trust).\nThe Guardians later found the true Last Engineer, who was instrumental in frustrating the alliance between Cy-Kill's Renegades and the Master Renegade. The Master Renegade later escaped the custody of the Renegades, and plagued both factions, notably attacking the UniCom colony of New Earth."}