{"mid": "CharleyVarrick", "IMDB_id": "tt0069865", "title": "Charley Varrick", "plot": "Charley Varrick (Walter Matthau) is a former stunt pilot who pretends to operate a crop-dusting business, which he uses as a cover for small scale robberies. With his wife Nadine (Jacqueline Scott), Al Dutcher (Fred Scheiwiller) and Harman Sullivan (Andrew Robinson), Charley robs a small bank in the rural community of Tres Cruces, New Mexico. While Nadine waits outside in the getaway car, the heavily disguised Charley and his two accomplices draw their guns and demand the safe be opened. Outside, an officer in a passing police car recognizes the license plate of their car as one reported stolen. When the police approach Nadine, she shoots, killing one and seriously wounding the other, who returns fire, wounding her. The melee distracts the robbers inside the bank, and the bank guard kills Dutcher. Sensing that the bank manager is concealing something, Charley forces him to reveal two large satchels of cash. Charley, Harman and Nadine flee, but Nadine dies soon after. Charley and Harman switch to a van marked with the crop-dusting business's signage. They set a charge to blow up their getaway car with Nadine's body inside. They drive away and are stopped by another policeman, but before he can search their van, the timed explosion goes off and the officer races away to investigate.\nWhen they return to their trailer and count the money, it is much more than they expected: $765,118. After a local television news broadcast reports that only $2,000 was stolen, Charley realizes the bank must be involved in a mob money laundering operation. He warns Harman that the Mafia will pursue them relentlessly and that their only chance is to lie low and not spend the money for three or four years, but the young, headstrong Harman will not listen. Meanwhile, Maynard Boyle (John Vernon), president of the bank, dispatches hitman Molly (Joe Don Baker) to recover the money.\nRealizing that Harman's rashness will doom them both, Charley double-crosses him. Because he, Nadine and Harman all had dental work done recently at the same dentist's office, Charley breaks in, stealing his and Nadine's X-rays and swapping Harman's for his own. To obtain illegal passports, Charley contacts gun dealer Tom (Tom Tully), an old accomplice of Dutcher's, who directs him to a beautiful local photographer Jewell Everett (Sheree North); he has his photograph taken, but he also gives her Harman's driver's license, which he has stolen as Harman slept. He leaves her his address, guaranteeing that Molly will find Harman in their trailer, which Charley watches at a distance. Tom immediately informs on Charley. Jewell also betrays Charley, but he never returns for the passports. Molly turns up at Charley's trailer and tortures Harman to death to try to locate Charley and the money.\nBoyle meets secretly with Tres Cruces bank manager Harold Young (Woodrow Parfrey), advising Young that his Mafia superiors will suspect that the robbery was an inside job because it occurred during the brief period when the money was there. He suggests that Young will be tortured. Young is so terrified that he later commits suicide.\nCharley purchases dynamite, then flies to Reno, where he has flowers delivered to Boyle's secretary, Sybil Fort (Felicia Farr), at her office so he can identify her as she leaves and follow her home. He seduces Fort in her apartment. Fort warns Charley not to trust her boss.\nShe helps Charley telephone Boyle. Charley offers to return the money. He arranges a rendezvous at a remote automobile wrecking yard and insists that Boyle come alone. Charley overflies the wrecking yard and spots Molly's car. After landing, Charley hugs the confounded Boyle, acting overjoyed as if they have been accomplices in a successful robbery; Molly falls for the ruse, assumes that Boyle is Charley's co-conspirator, and runs Boyle down with his car, killing him. Molly then chases Charley, who tries to fly away, but Molly damages the crop-duster's tail with his car and the aircraft flips over. Trapped upside down in the wreckage, Charley tells Molly that the money is the trunk of a nearby Chevrolet. However, Charley had flipped his aircraft on purpose, a trick he learned in his barnstorming days. When Molly opens the trunk, he sees Harman's body, wearing Charley's wedding ring, and the bank satchels; an instant later, he is killed by a dynamite booby trap. Charley throws a wad of hundred-dollar bills toward the burning car, making it seem that the money has been destroyed, then drives away."}