{"mid": "CheerleaderCamp", "IMDB_id": "tt0092744", "title": "Cheerleader Camp", "plot": "Cheerleader Alison (Betsy Russell) dreams of giving a performance in an empty stadium during which she exclaims, \"I need love,\" after being rejected by both of her parents. A menacing laugh is heard as her arms are slashed, causing Alison to wake up with a start, revealing that she had fallen asleep in the backseat of a car which is carrying her and her cheering teammates to a remote cheerleader camp called Camp Hurrah to compete in a contest, led by the icy Miss Tipton (Vickie Benson). At the camp, Alison rooms with the mascot, Cory (Lucinda Dickey), who is often ridiculed by the cheerleaders, and Alison's boyfriend, Brent (Leif Garrett) immediately begins flirting with a blonde cheerleader named Suzy. The girls go to the river where they sunbathe, and are spied on by Tim (Travis McKenna), who is a member of Alison's cheering team. Also watching them is Sheriff Poucher (Jeff Prettyman), who gets interrupted by the camp handyman, Pop (George Buck Flower).\nThe next morning, Alison finds Suzy in her cabin with her wrists cut, dead of an apparent suicide. The next day, Alison goes into the kitchen walk-in refrigerator in search of a drink and discovers Suzy's corpse on a shelf. The police are called, and Miss Tipton explains to Sheriff Poucher that, in order to protect her job, she didn't want to report Suzy's death until the program was finished. The Sheriff assures Tipton that he will take care of the matter, and the deal is sealed by the pair having sex, an act which is caught on video by Tim. As the result of a prank, the sex tape is broadcast the next day instead of a video of the camp's cheer routines.\nIn the meantime, Brent has begun to flirt with teammate Pam, garnering Alison's concern. Alison has a nightmare in which she cheers along with a group of mascots as Brent has sex with Pam. At the river the next day, Brent and Pam leave to have sex. They argue, however, and he leaves Pam in the woods where she is murdered with garden shears by an unseen killer. That evening, Alison has a dream in which she kills Pam. The next day at the competition, Alison worries that she may have hurt Pam in a fit of rage and not remembered it. She mentions this to Cory who assures her that she slept through the night.\nIt is now the day of the competition and Pam is nowhere to be found. Cory competes in the mascot dance contest, but is denied the win by Tipton. During the team's improvised routine, Tim falls offstage, knocking Pop to the ground in the process, prompting the handyman to declare, \"I hope you die!\" During the Camp Queen competition, Theresa, who has become increasingly worried about Pam, slips away to find her. Cory and Brent follow separately into the woods to look for Pam and Theresa, and Miss Tipton sends Pop to search for her as well. Theresa finds Pam's body in the woods, and is chased down by a van before getting splattered against a tree.\nIn the meantime, Alison and Bonnie compete for title of Queen, which Bonnie wins. Tim has managed to impress a cheerleader from another team and takes her outside to have sex with her. He returns almost immediately with his hand covered in blood and reveals that he has found Theresa's body. Brent announces at the party that there is a killer on the loose, prompting the cheerleaders to panic and flee in their cars. Miss Tipton stumbles drunkenly into the woods to search for Pam, but she is soon hacked in the back by the killer. Alison, Cory, Bonnie, Tim, and Brent try to drive away, only to discover that their car has been tampered with, rendering it undriveable.\nThe four hear gunshots in the woods, causing them to run separate directions; Alison returns to the van followed by Brent, Bonnie, and Cory, who claims someone attacked her in the woods. Brent retrieves Timmy's video camera in the woods, where they watch Timmy being killed on tape. The four set a booby trap using a bear trap in the tool shed, which inadvertently kills the Sheriff. They then encounter Pop, armed with a shotgun; Cory who believing Pop to be the killer, shoots him with a revolver. Back at the camp, Cory and Bonnie go to call the police, leaving Brent alone with Alison. He attempts to have sex with her, but she resists. Cory stumbles in, saying she can't find Bonnie; Brent goes to look for her and Cory tells Alison she thinks Brent may be the killer. Armed with the revolver, Cory sends Alison to shoot Brent. They find him standing over Bonnie's corpse and Alison shoots him. When the police arrive, they charge a distraught Allison with the murders. Cory supports this, claiming that Alison would have done anything to be number one. In the ambulance, Alison insists she only killed Brent, but the detective says that Cory blamed all the murders on her. Alison screams as she is taken away while Cory, dressed in a cheerleading uniform, cheers in front of the camp in the morning."}