{"mid": "Chef", "IMDB_id": "tt2883512", "title": "Chef", "plot": "Miami-born Carl Casper is the head chef of Gauloise in Brentwood, California. While popular with his kitchen staff and hostess Molly, the restaurant owner Riva wants Carl to stick to tired \"classics\" rather than innovative dishes. Carl has a strained relationship with his tech-savvy preteen son Percy and rich ex-wife Inez.\nWhen Carl has a chance to prove his creative talents during a visit from prestigious critic and blogger Ramsey Michel, Riva demands that he stick with old favorites at the last minute, causing Carl to concede, leading to a scathing review. On Twitter, Carl insults Ramsey for the review, not realizing that his reply is public, and gains a large Twitter following. Carl comes up with an inspirational new menu that his staff loves and invites Ramsey to a \"rematch\". After a confrontation with Riva as the owner wants the same old menu again, Carl walks out, quitting. At home, he prepares the menu he wanted to serve to Ramsey. Carl's assistant becomes the interim chef and even the regular dishes become a disaster. Ramsey again starts to tweet negatively about Carl, leading Carl to go to the restaurant, where he angrily and publicly berates Ramsey.\nVideos featuring Carl's meltdown go viral, and his professional credibility evaporates. Molly and Inez encourage him to run a food truck. He accepts Inez's invitation to Miami, where he spends some quality time with Percy and rediscovers his love for Cuban cuisine. Inez's ex-husband Marvin offers him a dilapidated food truck, and Carl reluctantly accepts. He also finds out that Marvin and Inez spent some time together after his divorce from Inez, which makes him a little angry. He and Percy bond while restoring the truck and buying groceries and Carl buys him a chef's knife. Martin, his friend from Gauloise, turns down his restaurant promotion to work with Carl, who has become an exuberant and passionate chef again.\nThe three drive the food truck across the country back to Los Angeles, serving top-quality Cuban sandwiches and yuca fries. Percy finds ways to promote the food truck on social media websites, and the truck becomes successful in New Orleans and Austin, Texas, where the daily specials include items made with local ingredients such as po' boys and barbecued brisket.\nBack in Los Angeles, Carl realizes the importance of his relationship with his son and accepts Percy's enthusiastic offer to help out on weekends and holidays. Ramsey visits the truck to explain that he wrote the bad review as he knew Carl's creativity did not suit a restaurant which had been serving the same menu for years. He leaves with an offer to bankroll a new restaurant. In a flash-forward set six months later, the new restaurant is a hit and closed for a private event: Carl and Inez remarry."}