{"mid": "ChillFactor", "IMDB_id": "tt0163579", "title": "Chill Factor", "plot": "Ten years after a covert military experiment on a remote Pacific island went wrong and killed eighteen servicemen and his assistant, Dr. Richard Long (David Paymer) is still trying to forget the havoc and death that his experiment caused.\nLiving in the small town of Jerome, Montana, Long still conducts scientific experiments at the local base, but far more enjoys his time fly-fishing with Tim Mason (Skeet Ulrich), who works in the local greasy spoon and has a checkered past.\nLong's life changes, and then ends, when he's visited by Colonel Andrew Brynner (Peter Firth), a former military officer who took the blame and served ten years in Leavenworth for Long's experiment.\nNow a free man with a score to settle with the government, Brynner has assembled a team of high-tech terrorists, including an icy woman named Vaughn (Hudson Leick), and plans to steal and then sell \"Elvis\"—Long's highly volatile, blue crystal substance—to the highest international bidder, thus having his revenge against the government for covering up its existence, and making him a scapegoat for their handling of the weapon.\nUnfortunately for Brynner, Long has already delivered \"Elvis\" to Tim, along with the directions that the substance must remain below fifty degrees, or it will detonate, and kill everyone within several hundred miles of it.\nAfter Mason and Arlo (Cuba Gooding Jr.), a wisecracking ice cream delivery man, have a run-in with Brynner, they set off en route for Fort Magruder, some ninety miles away. The two don't get along with each other—Arlo only agrees to transport the substance in his ice cream truck because Mason held a gun on him—but they find a common bond in trying to avoid Brynner and his team.\nWith the help of Colonel Leo Vitelli (Daniel Hugh Kelly), Arlo and Mason try to survive Brynner's attacks, avoid the local deputy, Pappas (Jim Grimshaw), who's also hot on their trail, and keep \"Elvis\" below fifty degrees.\nArlo and Mason finally reach the base, but get ambushed by Brynner and his team who plan on detonating the device in an abandoned weapons test facility. Brynner does not want to leave witnesses,and decides to kill both of them. However, the military arrives and rescues Arlo and Mason before the device explodes, killing Brynner and his men. Colonel Vitelli arrives and congratulates them on a job well done, but Arlo and Mason threaten to expose the U.S. government for using unstable nuclear weapons for the past decade. Vitelli decides to pay them both to keep them silent, but also threatens to have them killed if they say a word about what had happened. All three of them leave the area in a helicopter."}