{"mid": "ChildrenOfTheCornGenesis", "IMDB_id": "tt1745672", "title": "Children of the Corn: Genesis", "plot": "Tim and Allie's car breaks down and they attempt to find shelter in a remote desert farmhouse after becoming lost. A strange Charles Manson-like character, Preacher (Billy Drago), allows them inside to use the phone. The couple find out they won't be able to get tow service until the following day. Preacher and his Ukrainian wife Oksana also known as Helen let them stay the night with strict orders to be gone by morning, and not wander \"where you are not invited.\" They find their hosts weird but don't think much of it and head to bed after dinner. Allie wanders off in the middle of the night after using the outhouse, and discovers the garage has been converted into a cult worshipping church. She then stumbles upon a crumbling outbuilding where she hears faint cries coming from a child.\nAllie runs back and tells Tim what she witnessed, but at first he doesn't believe her. He agrees to confront the Preacher about the voices, but falls into a hypnotized trance while viewing digital photos in Preacher's camera. The child then walks into the house and plants a seed inside Allie and disappears before being seen. Tim and Allie try to leave the house, but get locked in the house by a supernatural force. Allie calls the police, but is unsure if she got through as the line gets cut off halfway. Allie falls asleep and dreams about being murdered by children in a cornfield. Allie and Tim wake up to headlights flashing into the room and a cop arrives to check on the house but is thrown into the air and killed by the supernatural force. After witnessing this Tim insists on answers from the Preacher, finding out that the supernatural force needs children to survive and has already planted a seed inside Allie.\nCome morning, a parcel delivery driver drops things off at the house. He agrees to give Tim and Allie a ride into town. Tim has a bad feeling about the driver so he takes off with Allie in the abandoned police vehicle instead. They get to the main road. The child in the outbuilding then kills Helen and psychokinetically causes Tim and Allie to have a car accident, in which Tim dies. The parcel driver approaches the accident and brings Allie back to the farmhouse where a group of children and their mothers greet her. In a trance, she sits next to the little child in the outbuilding and begins to sing to him. The child is then seen playing with a doll, then drops it on the floor, which causes the cop's corpse to fall from the sky onto the ground."}