{"mid": "ChildrenOfTheCorn", "IMDB_id": "tt1290135", "title": "Children of the Corn", "plot": "In an attempt to save their failing marriage, Burt and Vicky, a bickering couple, are driving to California for vacation. As they drive through rural Nebraska, they accidentally run over a young boy who ran onto the road. Upon examination of the body, Burt discovers the boy's throat had been slit and he was bleeding to death before he was hit. After opening the boy's suitcase, they find a strange-looking crucifix made of twisted corn husks. Knowing they will have to report this to the authorities, they place the body in their car's trunk. After arguing over where to take the body, Burt decides to go to Gatlin, a small, isolated community which is right down the road. Vicky wants to take the body to Grand Island (which is 70 miles away), but Burt argues that it would not be a good idea to take the body so far away.\nWhen they finally arrive in Gatlin, it appears to be a ghost town. As they explore the town and visit a gas station and an empty lunchroom, the couple notice that many things about the town are out-of-date, such as gas prices and calendar dates. Vicky starts to get a bad feeling about the town and wants to leave, but Burt insists that they keep going until they find the police station. When they finally reach the center of town, they find no one there either.\nBurt then sees a church with a recent date on the sign out front. In stark contrast with the rest of Gatlin—which has been neglected for years—the church is reverently cared for. After telling Vicky he's going to have a look inside, they get into another argument. After Vicky threatens to drive off and leave him stranded in Gatlin, Burt grabs her purse, and takes out her car keys. Vicky, on the verge of hysteria, begs him to leave Gatlin and find another place to call the police. He ignores her and walks away.\nInside, Burt finds that someone has torn the lettering off the walls and created a strange mosaic of Jesus behind the altar, as well as ripping out the keys and stops of the pipe organ and stuffing its pipes full of corn husks. At the altar, Burt finds a King James Bible (with several pages from the New Testament cut out), and a ledger where names have been recorded, along with birth and death dates. While reading the ledger, he notices that twelve years ago all names were changed from modern to Biblical ones, and that everyone listed as deceased died on their 19th birthday. Burt comes to the horrifying realization that twelve years ago the children of Gatlin killed the town's adults and that members of their community are sacrificed on their 19th birthday.\nAfter hearing Vicky sound the car's horn, Burt runs from the church to find that a gang of children dressed in Amish-style clothing and armed with farm tools have surrounded the car. Vicky tries to fight back, but the children drag her out of the car and slash holes in all of the tires. Burt tries to intervene, but one of the children (a teenaged boy with red hair) throws a kitchen knife at him, stabbing Burt in the arm. The teenager then attempts to claw Burt's eyes, but he pulls the knife out of his arm and stabs the teenager in the throat, killing him. The children step back in shock. Burt then realizes that Vicky is gone. When he asks where she is, one of the children holds up a knife and makes a slashing motion.\nBurt then is chased into an alley. Managing to outrun them, Burt ducks into the corn field and hides while his attackers search for him. He notices several odd things: there are no animals or weeds anywhere in the cornfield, and that every stalk of corn is free of any blemishes. As the sun begins to go down, Burt becomes lost and wanders around until he stumbles onto a circle of empty ground in the middle of the cornfield. There he discovers Vicky's dead body. She has been tied to a cross with barbed wire, with her eyes ripped out, and her mouth stuffed with corn husks. Gatlin's previous minister and police chief, who are now skeletons, have also been crucified. As Burt starts to flee, he notices that every row in the cornfield has closed up, preventing him from escaping. Burt soon realizes that something is coming for him. Before he can do anything, he is killed by a giant red-eyed monster that comes out of the cornfield. Shortly thereafter, a harvest moon appears in the sky.\nThe next day, the children of Gatlin (all members of a cult that worships \"He Who Walks Behind the Rows\", a wrathful deity that inhabits the cornfields that surround the town) meet where Burt and Vicky were slain. Isaac, their nine year old leader, tells them that He Who Walks Behind the Rows is displeased with their failure to kill Burt, an act that the deity was forced to commit on its own, as it did with the former minister and police chief. As punishment for their failure He Who Walks Behind the Rows commands that the age limit be lowered to eighteen years old.\nAs night falls, Malachi (the killer of the boy that Burt and Vicky ran over) and all of the other eighteen-year-olds walk into the cornfield to sacrifice themselves to He Who Walks Behind the Rows. Malachi's pregnant girlfriend, Ruth, waves goodbye to him and begins to weep. It is revealed that she has a secret hatred for He Who Walks Behind the Rows and dreams of setting the cornfield on fire, but is afraid to actually do so because He Who Walks Behind the Rows can see everything, including the motives inside human hearts. The story ends with the simple statement that the corn surrounding Gatlin is pleased."}