{"mid": "ChildsPlay2", "IMDB_id": "tt0099253", "title": "Child's Play 2", "plot": "In 1990, two years after Chucky was destroyed by the Barclays and detective Mike Norris, the killer \"Good Guy\" doll Chucky (voiced by Brad Dourif) is rebuilt from scratch by the Play Pals company to prove there is no fault with the dolls. As a result of Andy Barclay (Alex Vincent) blaming Chucky for the murders committed, the company has suffered. One of the men working on Chucky is killed via electrocution; as a result, the CEO of the company Mr. Sullivan (Peter Haskell) orders his assistant Mattson (Greg Germann) to cover the accident and get rid of Chucky.\nMeanwhile, Andy is now in foster care, due to his mother being in a mental hospital for supporting his story about Chucky. Andy is adopted by Phil (Gerrit Graham) and Joanne Simpson (Jenny Agutter). In his new home, Andy meets his new foster sister Kyle (Christine Elise).\nAfter work, Mattson goes to a corner store and while he leaves his car, Chucky uses the car phone to ring Grace Poole (Grace Zabriskie), the manager of Andy's foster center. He claims to be a relative of Andy's in order to get his new address. He then carjacks the car and orders Mattson to drive outside the Simpson household at gun point. Chucky then kills him by suffocating him with a plastic bag. In the house, Chucky accidentally activates \"Tommy\", another \"Good-Guy\" doll, and destroys him with Joanne's ornament. Chucky then buries the doll in the garden and takes his place as \"Tommy\". Phil punishes the children believing one of them broke the ornament. After Andy spends the rest of the day with Kyle, Chucky waits for nightfall and ties up Andy in order to possess him. However, Kyle, who snuck out, arrives and the ritual is interrupted. After Andy claimed Chucky tied him up, Phil throws Chucky in the basement.\nThe next day, Chucky hitches a ride on the bus to Andy's school. Andy's teacher Miss Kettlewell (Beth Grant) discovers an obscenity Chucky wrote on his worksheet. Believing Andy was responsible, she forces Andy to stay in the classroom as punishment, and locks Chucky in the closet. Andy escapes, and Chucky beats Miss Kettlewell to death with a yardstick. After Andy insisted Chucky got him in trouble, Phil considers taking him back to the foster center.\nThat night, Andy tries to kill Chucky with an electric knife in the basement, but Chucky attacks him. Phil goes to investigate the commotion but he is killed by Chucky who trips him and throws him to the floor, snapping his neck. Joanne, onvinced that Andy killed him, sends him back to the foster center. Later, Kyle discovers the buried doll in the garden and realizes Andy was telling the truth all along, and rushes in to find Joanne dead. Chucky attacks Kyle and orders her to take him to the center. There, during a false fire alarm, he kills Grace and orders Andy to take him to the PlayPals \"Good-Guy\" factory for the transfer.\nKyle follows Chucky and Andy to the factory. After knocking Andy unconscious once again, Chucky fails to possess the boy, since he spent too much time within the doll's body. Enraged, Chucky decides to kill Andy and Kyle instead. Chucky murders a factory worker. He then loses one of his hands, which he replaces with his knife, and his legs, but still goes after the two. Kyle and Andy then pour molten plastic over him before inserting an air hose in his mouth, which causes his head to explode and finally defeating him. Andy and Kyle leaves the factory for \"home\", with Andy asking where \"home\" is and Kyle responding that, in truth, she doesn't know."}