{"mid": "ChillOutScoobyDoo", "IMDB_id": "tt1097636", "title": "Chill Out, Scooby-Doo!", "plot": "On a climbing expedition in the Himalayas, Professor Jeffries is led by his Sherpa, Pemba, to a high point on a mountain using an ancient tablet. Jeffries is out looking for the Abominable Snowman, who lives in the mountains. He's convinced that the Snowman lives close by, but Pemba tells him he won't lead Jeffries anymore, as it would be intruding on the territory of the Abominable Snowman. Jeffries, who seems to care about the Snowman over their safety, decides to cut the rope and continue. As soon as Jeffries fades from view, Pemba sees the outline of a large creature in front of him.\nMeanwhile, Fred, Daphne and Velma are on vacation in Paris. However, Scooby-Doo and Shaggy have not arrived yet, and the gang wonders where they are. Shaggy and Scooby are in a small plane that they think is going to Paris, but is really going to the Himalayas to drop off Alphonse LaFleur, a French hunter and trapper. LaFleur wants to find and kill the Snowman, and is taking Shaggy and Scooby along as bait. LaFleur then locks Shaggy and Scooby up with his equipment, and throws them off the plane. Shaggy, realizing they are not going to Paris, manages to get a quick phone call through to Fred before the phone goes dead. Fred uses the GPS on his phone to track them, and then he, Daphne and Velma, head to the Himalayas to find them.\nMeanwhile, Shaggy and Scooby manage to land near a small village on the mountain, where Professor Jefferies and Pemba currently are. Jeffries tells Pemba he never should have left him, and that he almost died on the mountain. Many of the other villagers are leaving, fearing the creature and its wrath. Shaggy and Scooby go to the High Lama to ask for a phone to call their friends. The High Lama, a strange person, tells them there is only a phone on the weather station nearby. The High Lama is uneasy about letting them go in, but lets them. In the room is a statue of the Snowman holding a very large crystal, which the High Lama says it protects the villagers from the Abominable Snowman's powers. They then meet Pemba's sister Minga, who has decided to stay in the village. Minga constantly listens to the radio, and has a crush on the DJ from the station that she's listening to. Pemba tells her to leave the village, and he, Shaggy, Scooby and Jeffries (who says that everyone should stick together), decide to go to the weather station. LaFleur arrives, and decides to accompany them.\nAs they travel, Minga runs up to them and says that she heard on the radio that a big storm is approaching. Shaggy wonders how there could be any radio reception so high up, and Pemba tells him there isn't, as it's just the weather station man pretending to be a DJ. Pemba realizes that Minga has a crush on the weatherman and deduces that she's just tagging along with them as an excuse to meet him. Minga denies this, and explains that there really is a storm coming. Everyone looks up and sees a dark cloud, and they decide to set up camp to wait out the storm. During the night, Jeffries gets out of his tent and leaves with his sled, which is filled with TNT and other explosives. Some time later, the Snowman attacks Shaggy and Scooby. LaFleur tries to capture the Snowman, but all his traps backfire on the Snowman, instead working on him. Scooby and Shaggy manage to lose the Snowman but get lost themselves. However, they are relieved to see a snowplow approach them. In the snowplow is Del Chillman, whom the gang had met before. Del takes them to the weather station, where he works. Chillman tells them he decided to take the job so he could find out if the legend of the creature is true. He also reveals that he's the DJ/weatherman. He had the radio just to do weather reports, but plays songs to pass the time.\nMeanwhile, Fred, Daphne and Velma get to the village and see it is deserted. They follow Shaggy’s tracks and see where the party camped the night before, and also the footprints of the Snowman. Velma notes that they are not very deep in the snow. They find Pemba, who was caught by one of LaFleur's traps. Minga is nowhere to be found and Jeffries is still gone, so the gang decides to split up and search for everyone else. At the weather station, Del goes out to look for the others. Once he leaves, the Snowman appears and attacks Shaggy and Scooby. As they run away, LaFleur shows up and tries to capture the creature, but falls of a cliff, apparently to his death. Scooby and Shaggy manage to escape and find their way to the lost kingdom of Shangri-La, but are pursued by the Snowman.\nDel catches up to the rest of the gang, but finds the weather station destroyed and some helium tanks missing. As Scooby and Shaggy walk around the city, the Abominable Snowman appears and chases them. Daphne and Pemba find a large cave and go inside, and conclude that is where the Snowman lives. They also find an empty helium case. Shaggy and Scooby lose the Snowman again, and everyone meets up in an old mine, each coming from a different direction. There, they see Jeffries mining for lots of crystals like the one on the Yeti statue. They conclude he is the Snowman and capture him, although he denies it. Then the Snowman appears and chases everyone, while Jeffries gets free and follows them. The Snowman chases Shaggy, Scooby, and Jeffries down the mountain. Jeffries attempts to get the crystals in the mine cart that Scooby and Shaggy are riding in. The rest of the gang prepares a trap for the Snowman, but Shaggy, Scooby and Jeffries get caught in it. The High Lama comes out to see what happened. Then an avalanche starts, and almost crushes Velma and Del, but the Snowman saves them at the last moment. The Snowman is revealed to be Minga, who has been behind the mystery from the very beginning. She used the helium to fly, which caused the footprints to not be as deep. Minga confesses that she did it so that Del wouldn't stop broadcasting his radio show (also her way of admitting that she has feelings for Del). Del's touched by what Minga says, and finds it romantic. Jeffries is taken to jail because he was taking the crystals for his own gain. The gang wonders if there really is a Snowman, but then LaFleur appears and tells them that something saved him from his fall and brought him to the village (assumably the real Snowman).\nThe gang, along with Del and Minga (who are now boyfriend and girlfriend), return to Paris for their vacation. Unfortunately, Fred gets on the wrong plane and somehow ends up in the Amazon. The others go to find Fred, with Daphne complaining, \"I'd like to have a vacation that actually stays a vacation.\"."}