{"mid": "ChinaTown", "IMDB_id": "tt0268220", "title": "China Town", "plot": "Multimillionaire Sonia Chang (Isha Koppikar) finds out her only 2 year son is kidnapped. She lives in her huge mansion named \"36 China Town\" with a servant couple Mr.Lobo (Dinyar Contractor) and Mrs.Lobo (Roshan Tirandas) in Goa. Sonia is consoled by Rocky (Upen Patel), a local flirt. Sonia declares 25 lakh reward if anyone returns the child to her.\nThe story then focusses upon Raj (Shahid Kapoor), a struggling actor & Priya (Kareena Kapoor), a runaway jilted girl. They both meet each other after both of their dreams have been shattered. They find a child who is dumped in Mumbai. They take pity on him, but after seeing a missing persons ad, they realise that the child is the only son of Sonia Chang. The ad says that they will get a lot of money if they return the son back. They both need the money so they decide to return the baby to her. Before leaving for Goa, they call Sonia Chang and tell that they have her child. She was discussing the change in her will with her lawyer Mr Dixit (Vivek Vaswani), when the duo inform her about her baby. Meanwhile, Raj falls in love with Priya. But she is irritated by his presence.\nSonia is overjoyed & calls them to Goa. During midnight, her casino is hosting some interesting people. One of them is Mr. Natwar (Paresh Rawal), a notorious gambler who has come along with his wife Gracy (Payal Rohatgi). Natwar has pawned his four hotels to Sonia & has only one hotel left in his possession. When he loses money, he is forced to pawn the last hotel too. He keeps this a secret, but Gracy knows the fact. Another person is KK (Johny Lever), who has come along with his wife Ruby (Tanaaz Currim). There is also playboy Rocky among them, who is a big hit with ladies, especially Sonia. Rocky flirts with Ruby. Ruby wins a lot of money in casino. But when she doesn't get the money even after claiming it, she enters 36 China town to meet Sonia in a very angry mood. Even Natwar goes inside the mansion to meet Sonia and pawn the last hotel. Upset by this, Gracy goes to 36 China Town in an angry mood. Then, she goes her bedroom with Rocky. Meanwhile, KK and Natwar decide to play together and they lose all of their money. They fight and get out of the casino by the bouncers.\nMeanwhile, Raj & Priya come to Goa, where they run into a drunkard (Raj Zutshi) loitering near the mansion. The drunkard runs away on seeing them. The duo are surprised to see the mansion to be in dark, since they expected Sonia to be waiting for them. They enter the mansion & call for Sonia. When she doesn't answer, they realise that something is wrong. On seeing the state of the house, they realise that Sonia has been robbed, but are later horrified to see Sonia dead. The duo run, but find that the child is left inside the mansion. Raj enters the mansion again to take him. He witnesses two eyes and legs of the killer behind a cupboard. Terrified, he gets out of the mansion with the child. Raj and priya then inform Goa police about the murder. They keep the child inside a police van and run away. But Priya finds that she has left her suitcase inside the mansion inside which her passport is kept. Meanwhile, audience watch that Sonia's body is kept inside Priya's suitcase by somebody and kept outside the mansion. KK reaches the mansion and finds the suitcase. Thinking that it is containing lot of money, he takes it and reaches his room in hotel where Ruby is waiting for him. Meanwhile, Raj and Priya go back to the mansion to take her suitcase. Raj enters the mansion but is arrested by Inspector Karan (Akshaye Khanna), the investigating officer and Ravi (Vivek Shauq). Meanwhile, KK and Ruby find out that the suitcase contains dead body, not money. They decide to dispose the suitcase. Meanwhile, Priya, who wants to help Raj, gets arrested. Priya and Raj become the prime suspects of the murder. Inside the cell both fall for each other. Meanwhile, KK and Ruby unable to dispose the suitcase, are arrested by police. KK tells the truth to Karan about Natwar. Karan goes to meet Natwar. Natwar lies to him that he was in his room with his wife, Gracy. Karan goes away. Natwar then finds out that Gracy was with Rocky in the room. Next day, Karan comes to meet Natwar and Gracy. Natwar tells him that it was he who was in the room and he got out from pipe directly to the neighbouring house's bedroom (Which actually Rocky did). But to his shock, the room turns to be Sonia Chang's mansion's bedroom where she was murdered. Natwar is arrested.\nNatwar then tells the truth to Karan about Rocky. Karan calls Rocky to police station. But seeing Rocky's eyes, Raj recollects that it was rocky's eyes and shoes which he had seen behind the cupboard. Rocky then tells that he was in Gracy's room that night. He had got out from the pipe to sonia's bedroom only to find her already murdered. When he was about to get out from the house, Raj and Priya had entered with the child and started searching for Sonia. Then, when Raj had entered the mansion again to take the child, he had seen his (Rocky's) eyes and legs. Karan is able to reconstruct what actually happened that night. Based on Mr. Dixit's statement about the will & everybody's statement, Karan is able to find the truth. First, he procures the drunkard, whom Raj & Priya believe to be the murderer. But, Karan goes on to explain that he is in fact, the kidnapper.\nKaran goes on to explain that the kidnapper was hired by the killer but the kidnapper lost the baby's possession, who was then found by Raj and Priya in Mumbai. After Sonia is informed by Raj & Priya about the baby's discovery, the mastermind found that his/her plan was failing. Hence, he/she murdered Sonia, while other people incriminated themselves by fooling others to believe that it was robbery gone wrong. The actual killer was Mr. and Mrs. Lobo, Sonia's servants. According to Sonia Chang's initial will, after her death, the person who was most close to her son (which were her servants) would inherit everything but then one day she found out about their evil intentions and decided to change her will, which led to them murdering her."}