{"mid": "Chisum", "IMDB_id": "tt0065547", "title": "Chisum", "plot": "John Chisum (John Wayne), a virtuous, patriarchal land baron, locks horns with greedy Lawrence Murphy (Forrest Tucker), who will stop at nothing to get control of the trade and even the law in Lincoln County, New Mexico.\nChisum is an aging rancher with an eventful past and a paternalistic nature towards his companions and community. Murphy, a malevolent land developer, plans to take control of the county for his own personal gain.\nThe story begins with Murphy's men tipping off Mexican rustlers who plan to steal Chisum's horses. Chisum and his sidekick Pepper (Ben Johnson) stop the bandits with help from a newcomer to the area, William Bonney (Geoffrey Deuel), also known as Billy the Kid. A notorious killer, Billy has been given a chance to reform by Chisum's philanthropic neighbor, rancher Henry Tunstall (Patric Knowles). Billy also falls for Chisum's newly arrived niece, Sallie (Pamela McMyler).\nMurphy is buying up all the stores in town and using his monopoly to push up the prices. He appoints his own sheriff and deputies. He also brings in a lawyer, Alexander McSween (Andrew Prine), whose principles lead him to switch sides and seek work with Chisum and Tunstall. The two ranchers set up their own bank and general store in town under McSween's control.\nChisum's land and cattle remain targets. Murphy's men attempt to steal Chisum's cattle before he can sell them to the Army. Chisum's ranch hands are warned by Pat Garrett (Glenn Corbett), a passing buffalo hunter. Garrett agrees to help Chisum and soon befriends Bonney. Together they foil an attack by Murphy's men on the wagons bringing in provisions for the new store.\nFed up with Murphy's underhanded activities, Tunstall rides off to Santa Fe to seek the intervention of Gov. Sam Axtell (Alan Baxter). On the way he is intercepted by Murphy's deputies, who falsely accuse him of cattle rustling and shoot him dead. Chisum and Garrett hunt down the deputies and bring them back to town for trial. Bonney, seeking revenge for the murder of his mentor and skeptical that the men will truly face justice in town, overpowers Garrett by surprise and shoots dead both deputies. Before Sheriff Brady (Bruce Cabot) can organise a posse, Billy rides into town and kills him, too.\nMurphy appoints bounty hunter Dan Nodeen (Christopher George) as the new sheriff, giving him orders to hunt down Bonney. Nodeen has a score to settle, as a previous encounter with Bonney has left him with a permanent limp.\nBilly's plans for revenge are only just beginning. He breaks into McSween's store looking for dynamite to rob Murphy's bank. He is spotted by Nodeen, who surrounds the store with Murphys's men. McSween's wife is allowed to leave. McSween later comes out unarmed but Nodeen shoots him in cold blood.\nChisum is alerted by McSween's wife (Lynda Day George) and rides into town. The main street is blocked, so Chisum stampedes his cattle through the barricades. He tracks down Murphy and takes him on in a fist fight which ends with both men falling from a balcony. Murphy ends up impaled on steer horns. With his paymaster dead, Nodeen flees, with Billy in pursuit.\nThe film ends with Garrett taking over as sheriff and it is implied that is settling down with Sallie. It is learned that General Lew Wallace has become governor of the area. With law and order restored, Chisum can resume his iconic vigil over the Pecos valley."}