{"mid": "ChittyChittyBangBang", "IMDB_id": "tt0062803", "title": "Chitty Chitty Bang Bang", "plot": "Commander Caractacus Pott is an inventor who buys and renovates an old car after gaining money from inventing and selling whistle-like sweets to Lord Skrumshus, the wealthy owner of a local confectionery factory. The car, a \"Paragon Panther\", was the sole production of the Paragon motor-car company before it went bankrupt. It is a four-seat touring car with an enormous bonnet, or hood. After the restoration is complete, the car is named for the noises made by its starter motor and the characteristic two loud backfires it makes when it starts.\nAt first Chitty-Chitty-Bang-Bang is just a big and powerful car, but as the book progresses the car surprises the family by beginning to exhibit independent actions. This first happens while the family is caught in a traffic jam on their way to the beach for a picnic. The car suddenly instructs Commander Pott to pull a switch which causes Chitty-Chitty-Bang-Bang to sprout wings and take flight over the stopped cars on the road. Commander Pott flies them to Goodwin Sands in the English Channel where the family picnics, swims, and sleeps. While the family naps, the tide comes in threatening to drown them. Chitty-Chitty-Bang-Bang wakes them just in time with a hiss of steam. At the car's direction, Commander Pott pulls another switch which causes it to transform into a hovercraft-like vehicle. They make for the French coast and land on a beach near Calais. They explore along the beach and find a cave boobytrapped with some devices intended to scare off intruders. At the back of the cave is a store of armaments and explosives. The family detonates the cache of explosives and flees the cave.\nThe gangsters/gun-runners who own the ammunition dump arrive and block the road in front of Chitty-Chitty-Bang-Bang. The gangsters threaten the family, but Commander Pott throws the switch which transforms the car into an aeroplane and they take off, leaving the gangsters in helpless fury. The Potts stay overnight in a hotel in Calais. While the family sleeps, the gangsters break into the children's room and kidnap them and drive off towards Paris. Chitty tracks the gangsters' route, wakes Commander and Mrs. Pott, and they drive off in pursuit.\nThe gangsters are planning to rob a famous chocolate shop in Paris using the children as decoys. The Pott children overhear this and manage to warn the shop owner, Monsieur Bon-Bon. Chitty arrives in time to prevent the gangsters from fleeing. The police arrive and the gangsters are taken away. As a reward Madame Bon-Bon shares the secret recipe of her world-famous fudge with the Potts, and the two families become good friends. Chitty flies the family away to parts unknown, and the book implies that the car has yet more secrets."}