{"mid": "ChristmasInJuly", "IMDB_id": "tt0032338", "title": "Christmas in July", "plot": "Dr. Maxford (Raymond Walburn) is thoroughly exasperated. He is supposed to announce on national radio the winners of a slogan contest for his Maxford House Coffee; the first prize is $25,000. Maxford's jury is deadlocked by the stubborn Mr. Bildocker (William Demarest). As a result, the program ends without an announcement.\nOne of millions of contestants, office worker Jimmy MacDonald (Dick Powell) dreams of winning, hoping to validate his faith in himself, provide some luxuries for his mother (Georgia Caine), and marry his girlfriend Betty Casey (Ellen Drew). Betty, among others, does not understand his slogan: \"If you can't sleep at night, it's not the coffee, it's the bunk.\"\nAs a joke, three of his co-workers place a fake telegram on Jimmy's desk informing him that he has won. Jimmy's boss, J. B. Baxter (Ernest Truex), is so impressed, he promotes Jimmy on the spot to advertising executive, with his own office, a private secretary (Betty), and a raise. Tom Darcy, one of the pranksters, tries to clear things up before they go too far, but loses his nerve.\nWhen Jimmy arrives to collect the check, Dr. Maxford assumes his committee finally reached a decision without informing him, and writes a check to Jimmy. Jimmy and Betty go on a shopping spree at Shindel's department store. After telephoning Maxford to confirm the check is good, Mr. Shindel gives Jimmy credit to buy an engagement ring for Betty, a luxury sofa-bed for his mother, and presents for all of their neighbors.\nWhen the truth comes out, Shindel descends on Jimmy's street to try to repossess his merchandise. Maxford follows them and confirms Jimmy did not win. In the commotion, Shindel learns that Maxford's signature is genuine; instead of reclaiming the merchandise, he tries to force Maxford to pay for it. Tom and the other two pranksters admit they are to blame.\nThat night, Jimmy and Betty confess to Baxter. Betty's heartfelt plea persuades Baxter to let Jimmy try to prove himself and keep his promotion, although on a very short probationary period and with no raise. Meanwhile, Bildocker bursts into Maxford's office to announce that the other jury members have finally given in and accepted his choice for the grand prize winner: Jimmy."}