{"mid": "Chronicle", "IMDB_id": "tt1706593", "title": "Chronicle", "plot": "Seattle high-school teenager Andrew Detmer (Dane DeHaan) starts videotaping his life. At home, his mother Karen (Bo Petersen) is slowly dying from cancer and his alcoholic ex-firefighter father Richard (Michael Kelly) browbeats him. At school, Andrew is unpopular and frequently bullied.Andrew's cousin Matt (Alex Russell) invites him to a rave to help him meet people, but Andrew's filming angers an attendee and Andrew leaves the rave, despondent. Approached outside by Steve Washington (Michael B. Jordan), the school's popular star quarterback and future politician, Andrew is persuaded to join him and Matt and record something strange the pair of them have found in the woods nearby: a hole in the ground that emits a loud and strange noise. The three enter the hole and discover a large, blue, glowing, crystalline object. As Andrew films, the object turns red and the group is stricken by nosebleeds and pain. The camera cuts out. Weeks later Andrew records himself, Matt, and Steve as they display telekinetic abilities; able to move objects with their minds, but suffering nosebleeds when they overexert themselves. They return to the hole, but find that it has collapsed and that the sheriff's department are sealing off the area for safety.As their abilities continue to grow more powerful, Matt theorizes that their abilities function like a muscle, becoming stronger with use. The three boys develop a close friendship and begin employing their abilities to play pranks. However, after Andrew pushes a rude motorist off the road and into a river, Matt insists that they restrict the use of their powers, particularly against living creatures. The three later discover that they can use their powers to fly and revel in the experience. They agree to fly around the world together after graduation, with Andrew expressing an interest in visiting Tibet because of its peaceful nature.Steve encourages Andrew to enter the school talent show to gain popularity. Andrew amazes his fellow students by disguising his powers as an impressive display of magic tricks, juggling, and tightrope walking. That night, Andrew, Matt and Steve celebrate at a house party, where Andrew is the center of attention. After drinking with his classmate Monica (Anna Wood), Andrew and her go upstairs to have sex but Andrew vomits on Monica, disgusting her and humiliating himself.Andrew becomes increasingly withdrawn and hostile, culminating when his father attacks him and Andrew uses his ability to overpower him. His outburst inflicts nosebleeds and pain on Steve and Matt. Steve is drawn to Andrew, who is floating in the middle of a storm. Steve tries to console him, but Andrew grows increasingly angry until Steve is suddenly struck by lightning and killed. At Steve's funeral, Matt confronts Andrew about the suspicious circumstances of Steve's death. Andrew denies knowledge or responsibility to Matt, but he privately begs forgiveness at Steve's grave.Andrew grows distant from Matt and again finds himself alone and unpopular at school. After being bullied, he uses his power to tear several teeth from the bully's mouth. Andrew begins to identify himself as an apex predator, rationalizing that he should not feel guilt for using his power to hurt those weaker than himself. When his mother's condition deteriorates, Andrew uses his powers to steal money for her medicine. After mugging some local thugs, he robs a gas station where he inadvertently causes an explosion that puts him in the hospital and under police investigation. At his bedside, his upset father informs the unconscious Andrew that his mother has died, and he angrily blames Andrew for her death. As his father is about to strike him, Andrew awakens to stop his father's punch and blows out the outer wall of the hospital room.Matt, while attending a family birthday party with his girlfriend, Casey (Ashley Grace), suddenly experiences a nosebleed and senses Andrew is in trouble. He sees a television news report about the explosion at the hospital and knows it involved Andrew. Matt and Casey travel to the hospital and finds Andrew floating outside the building. Andrew drops his father, who is saved by Matt, and proceeds to wreak havoc with his powers. Matt confronts Andrew at the Space Needle and tries to reason with him, but Andrew grows increasingly hostile and irrational at any attempt to tell him what to do. Andrew attacks Matt and the pair fight across the city, crashing through buildings and hurling vehicles. Andrew, injured and enraged, begins using his power to destroy the buildings around him, threatening many other lives. Unable to get through to Andrew, Matt tears a spear from a nearby statue and impales Andrew, killing him. The police surround Matt, but he flies away.Some time later, Matt lands in Tibet with Andrews camera. Speaking to the camera while addressing Andrew, Matt vows to use his powers for good and to find out what happened to them in the hole. Matt positions the camera to view a Tibetan monastery in the distance and says \"You made it\" before flying away, leaving the camera behind to continue recording the tranquil scene."}