{"mid": "CinderellaIIDreamsComeTrue", "IMDB_id": "tt0291082", "title": "Cinderella II: Dreams Come True", "plot": "In the royal palace, Cinderella's mice friends Gus and Jaq head to a chamber where the Fairy Godmother is reading the story of Cinderella to the other mice. Much to their disappointment, Gus and Jaq arrive just as she has finished the story. With her help, the mice set off to make a new book to narrate what happens after the Happily Ever After, by stringing three segments of stories together into one narrative.\n=== Aim to Please ===\nCinderella and Prince Charming return from their Honeymoon and Cinderella reunites with her mice friends and her dog Bruno. She is later put in charge of the palace banquets and parties while the King and Prince Charming are away. A sharp and snobbish woman named Prudence, introduces Cinderella to her assigned ladies in waiting: Beatrice and Daphne. However, Cinderella is dissatisfied with the way the traditions are run, and ends up falling over when it becomes too much to handle. She goes into her room and the mice find her crying, after they comfort her, Cinderella realizes that she does not have to follow the usual traditions around the palace and decides to organize the upcoming party in her own way. Prudence is appalled by the changes and exclaims at one point \"It simply isn't done!\" (with Jaq making fun of her words and dancing around with Gus), Cinderella enters the village and hands out invitations to all the commoners, Prudence points out that the princess should be inviting dukes and aristocrats and Cinderella is intent on doing so in addition to inviting everyone in the village. Later, Prince Charming and his father arrive at the party. Although he seems to be shocked at seeing commoners, the King is satisfied with everything. While sitting on their thrones, Cinderella tells Prince Charming that someday she will get the \"Princess thing\" right and Charming replies with \"I think that day is today\". The two kiss, ending the segment.\nThe mice add that story to the book as Jaq gets some magical help from the Fairy Godmother opening a bottle of ink. Proclaiming that he does not like \"that magic stuff,\" Gus reminds him of his last encounter with it. Looking to impress Mary, a mouse who he has feelings for, Jaq allows the Fairy Godmother to tell his story.\n=== Tall Tail ===\nJaq thinks he is too small to help Cinderella in the palace like he did in the first movie. The Fairy Godmother appears to help him out, and turns him into a human, six times taller than his height as a mouse so he can help out like everyone else. However, this does not stop Pom Pom, the palace's snobby cat (who became the mice's new nemesis as soon as they moved to the palace along with Cinderella), from chasing Jaq around. He is named \"Sir Hugh\", after coughing while trying to tell Cinderella that he is now human. After an incident with an elephant at a fair, he learns to be happy for who he is and is returned to his mouse form. Pom Pom makes a final attempt to eat Jaq but is picked up by a lady, who Jaq met as a human earlier, and had assumed Pom Pom to be his pet cat, she decides to find her \"master\" as Pom Pom tries to escape from her hold.\nOne of the mice uses the magic dust onto the art supplies, causing them to become animated. The supplies begin to almost destroy the nearly completed book until the Fairy Godmother puts a stop to it. As the mice survey the mess, they reminisce how they have seen worse and Jaq reminds them of the time Anastasia fell in love.\n=== An Uncommon Romance ===\nAnastasia, one of Cinderella's stepsister, falls in love with a kind but common baker, which her mother Lady Tremaine and older sister Drizella disapprove of. Lady Tremaine tells her daughter to never speak to the baker as she forbids it. After a mishap in trying to get Anastasia and the Baker together again, Cinderella's mice friends (including Jaq and Gus) run into Lucifer and the minute he sees them; he starts chasing after them. Anastasia meets the baker again but the chase involving the mice and Lucifer, causes Anastasia to get kicked by a horse into the baker's shop. However, she is distraught by this and runs out of the baker's shop. A few villagers laugh at Anastasia upon seeing her covered in egg yokes and she retreats to a quiet area with a small fountain, Cinderella finds her and tries to convince her step sister to do what she wants and not continue to obey Lady Tremaine. Lucifer enters the palace while still chasing Cinderella's mice friends but stops once he spots Pom Pom and falls in love with her she sees him too but dislikes him. The mice decide to help their old nemesis. That is, if Lucifer promises to stop chasing mice. The next day, The baker buys a flower garland to give to Anastasia who also buys one to give to him. As she heads near his shop, she sees him with another woman commenting on the garland. Anastasia assumes that the baker has left her for someone else and does not see the other lady's lover as she runs off in tears. When Lucifer and Pom Pom get together, Pom Pom goads Lucifer into breaking his promise and helping her catch the mice. In the ensuing chaos, a jug of water pours on Pom Pom and she leaves Lucifer. The baker goes after Anastasia but gives up and sits near a fountain (which is bigger than the one shown earlier), where Anastasia is. A goat appears and eats up most of his garland, reducing it to only a few flowers. The baker hears Anastasia crying and proves his love for her by placing one of the flowers from his garland into her hair, the moment between them is interrupted when Lady Tremaine and Drizella arrive. Cinderella; unknown to anyone else, arrives and secretly watches as Lady Tremaine berates Anastasia. She tries to pull Anastasia away from the baker again, but Anastasia finally stands up to her mother and declares that she and the baker are going to the ball together. Rather than argue with Anastasia's decision; Lady Tremaine makes her leave, shortly followed by Drizella. Later at the ball, Anastasia thanks Cinderella for helping her with Cinderella replying \"Dreams do come true\", the segment then ends.\nThe mice finish their book, and the Fairy Godmother asks if they are ready to show it to Cinderella. She is spotted out in the hallway and the mice follow after her with the book. They sing a reprise of \"Bibbidi-Bobbidi-Boo\", When they catch up with her (with some assistance by the Fairy Godmother), she asks them what it is, Gus telling her is a book about them all. Cinderella thinks it is wonderful and asks if the mice would like to read it together, to which the mice give a resounding \"Yes!\". The movie ends as they gather in front of the fire and Cinderella begins to read."}