{"mid": "CityOnFire", "IMDB_id": "tt0078976", "title": "City on Fire", "plot": "William Dudley (Leslie Nielsen) is a corrupt mayor of a nameless Midwestern U.S. city who has allowed an oil refinery to be built right in the center of town, far from any river, lake or reservoir. On one typical hot summer day, Herman Stover (Jonathan Welsh), a dangerously disturbed employee at the works has been denied an expected promotion and in addition, finds himself fired. He then decides to take his revenge against the works by opening the valves to the storage vats and their interconnecting pipes, flooding the area and sewers with gasoline and chemicals. It doesn't take long for this act of petty vandalism to start a fire, which starts a chain reaction that causes massive explosions at the refinery, destroying it and spreading a mushroom-cloud of flame that soon engulfs the entire metropolis. The drama focuses on a newly built hospital which, like the refinery and all civic buildings that went up during the mayor's crooked administration, is shoddily built and poorly equipped where the head doctor, Frank Whitman (Barry Newman), and his staff treat thousands of casualties from the fire while the city fire chief Risley (Henry Fonda) keeps in constant contact with the fire companies fighting a losing battle against the fires, and Maggie Grayson (Ava Gardner), an alcoholic reporter, sees it as her chance to make it nationwide with her coverage of the story of the \"city on fire\".\nA major subplot of the film involves Diana Brockhurst-Lautrec (Susan Clark) a wealthy socialite who is currently and secretly involved with Mayor Dudley to further advance her rank up the social circles and whom also finds herself, along with the mayor, at the hospital assisting the head nurse Andrea Harper (Shelley Winters) with treating the large number of casualties. The womanizing Dr. Whitman also becomes smitten with Diana after meeting her during the hospital's dedication ceremony prior to the fire. Herman Stover also arrives at the hospital having left the refinery before the explosion to stalk Diana, having known her since attending high school. No one ever finds out that Stover is the one responsible for the citywide fire, and on top of that, Stover is not sane enough to understand or regret his actions.\nWhen the hospital becomes surrounded by the fire, Chief Risley orders his son, Harrison (Richard Donat), assemble a fire company to create a \"water tunnel\" composing of firemen creating a channel across a burning street to evacuate the hospital. Despite some casualties of the hospital staff and patients, the evacuation is successful. Stover is one of the casualties when, distraught and in a daze after Diana rejects him, is killed by falling debris from a building. Nurse Harper is also killed when she attempts to rescue Stover. Diana, Mayor Dudley, and Dr. Whitman are the last ones to make it out of the hospital.\nThe final scene is set the following day at a quarry outside the city which is set up as a makeshift camp for the thousands of people rendered homeless by the fire as it is finally brought under control. There, Dr. Whitman and Diana acknowledge their love for each other, while Mayor Dudley gives a press statement about his actions and of his intention now to run for governor. Maggie Grayson, still reporting from the studio, signs off her broadcast and leaves with her assistant Jimbo (James Franciscus) on a date for assisting her throughout her coverage. The final scene shows Chief Risley leaving his headquarters with his staff telling them that it takes only one man to set fire and destroy a city."}