{"mid": "ClassOfNukeEmHigh", "IMDB_id": "tt0090849", "title": "Class of Nuke 'Em High", "plot": "The film follows the events that unfold at Tromaville High School in New Jersey, which is conveniently located next to a nuclear power plant. An accident at the nuclear plant is covered up by plant owner Mr Paley who does not want the facility shut down by the safety commission. The accident causes a radioactive water leak which ends up gruesomely killing a student at the school after the tainted water reaches the drinking fountain. The gang of the school, called \"The Cretins,\" who were originally part of the honor society, torments the school, and it's implied that they have been turned into violent psychopaths by the runoff from the plant. They pick leaves from a radioactive marijuana plant located in the yard of the nuclear plant and sell it to Eddie for $10. At his \"indoor bikini beach party\" that night, Eddie pressures his friend Warren and Warren's girlfriend Chrissy into smoking the radioactive joint, but it is accidentally ruined by the dancers before anyone else can try it. The mutated drug shows itself to have potent aphrodisiac effects, leading to Warren and Chrissy having sex in Eddie's loft. However, that same night, both of them have disturbing nightmares about hideously mutating, though these effects are seemingly gone by morning. Some time later, Chrissy discovers that she is pregnant, and spits a little monster into a nearby toilet. The creature travels through the water pipes and lands in a barrel filled with radioactive waste, and mutates into a bigger creature. Meanwhile, Warren, tired of the Cretins' constant harassment, ends up going on a radiation-fueled rampage, killing two of them, with no memory of the event once he comes to his senses. The Cretins, expelled from the school and cut off from their customer base, assault the principal and forces him to use the school's Radiation Alarm to cause an evacuation, letting the Cretins bar the building and occupy it. Capturing Chrissy as bait for Warren, the leader of the gang holds her hostage in the basement and plans to kill her in front of Warren, only to be interrupted by the now adult monster.\nWarren goes into the school to save her, and he discovers the adult monster, who kills every one of the Cretins. Warren finally zaps the beast with a laser in the physics laboratory, and he and Chrissy flee from the school, right after the monster explodes along with the school, also killing Mr. Paley inside. The students celebrate victory as over the loudspeakers that the school will be shut down for remodeling. While reconstruction is taking place, one of the monster \"babies\" appears squirming through the remains of the destroyed school. The screen freeze frames on the creature as the screen inverts, shortly before fading out and the credits roll."}