{"mid": "Clown", "IMDB_id": "tt1780798", "title": "Clown", "plot": "Kent McCoy is a loving husband and father who hosts a birthday party for his son Jack complete with a clown. However, the clown he hired accidentally goes to another party. Fortunately, Kent discovers an old clown costume in the basement of a house he is selling and dresses himself to entertain everyone. After the party, Kent falls asleep wearing the clown costume, and the next morning he is unable to take it off. The body suit, wig, and red nose are slowly adhering to his skin.\nKent is forced to go to work wearing the costume and the three guys who are helping him renovate the house laugh at him. He tries to remove the costume, cutting his wrist with a knife and breaking a vibrating hand saw. He goes home and tells his wife Meg what is happening, so she tries to help him remove the fake nose. But as she tries to remove the nose, it rips his flesh and wounds him. He goes to the hospital for his wounds where he is inadvertently made fun of by the emergency room doctor. Suddenly, Kent also begins to show strange behavior and a deep sense of hunger, with a noisy gurgling in his stomach. He eats all the food in the house, wrecking the kitchen.\nKent tries to understand what is happening to him and tracks down Herbert Karlsson, the brother of cancer treatment specialist Dr. Martin Karlsson, and the costume's previous owner. Bert tells him on the phone to avoid the costume. Kent meets with Karrlson and learns that the clown costume is actually the hair and skin of an ancient demon from Northern Europe which was long forgotten: the \"Cløyne\", which attracted five children to devour. Karlsson drugs Kent with tea, revealing that the only way to stop the demon is to behead the wearer. Karlsson lands a butcher knife in Kent's shoulder as Kent jumps up and asks what he is doing. Kent subdues Karlsson during an ensuing fight and learns that he is slowly becoming the demon.\nKent returns home and, after a series of incidents, moves away from his family and into one of his property listings, where he fights his demonic hunger and attempts to commit suicide. He shoots himself in the mouth but does not die, spattering the wall with rainbow blood. He then attempts to behead himself with a pair of buzzsaws but fails, causing a little boy to be killed instead, whom Kent later eats. Kent eventually gives in and starts to become the demon, devouring his second victim, a child who had bullied Jack earlier. Meg becomes involved, trying to understand what is afflicting Kent and to help him fight against the demon. Desperate, she joins forces with Karlsson with the intent of freeing Kent from the suit, although Karlsson is prepared to kill Kent if necessary.\nMeg learns from Karlsson that freedom from the clown costume can be gained by offering the demon what it wants: five children. She also learns that many years ago, Karlsson put on the costume to entertain the children at the oncology clinic that Martin worked for and became the demon. Martin smuggled out five dying children from the cancer ward to free Herbert from the costume. Karlsson also warns Meg that the curse follows any part of it, explaining how earlier the family dog had become afflicted by the curse after eating Kent's clown \"nose\"; which forced him to kill it by chopping off its head.\nKent, now almost fully lost, succumbs to the demon and begins hunting more children. He sneaks into an indoor playground/arcade and devours two children. Karlsson fails to kill Kent, and Meg tries to get through to her husband. Instead, the demon offers her a deal: feed it one more child, and it will release Kent. It tells her to bring the final child to their \"special place\".\nMeg works as a dental nurse, and a child from her clinic recognizes her. The girl asks for a lift home when she cannot find her parents. Meg drives her to the \"special place\" and locks her out of the car. She suddenly changes her mind when the girl sees Kent.\nThe demon clown searches for Jack, killing Jack's grandfather and ripping off his jaw. Meg fights against her husband, but the demon is drawn to her uterus, as it is revealed she is pregnant. After a long chase inside the house, Meg is forced to knock his head off with a hammer, killing the demon and her husband. In the end, the costume is packed up to be analyzed by the police."}