{"mid": "Clue", "IMDB_id": "tt0088930", "title": "Clue", "plot": "In 1954 New England, six strangers are invited to a party at a secluded New England mansion known as Hill House. After being met at the door by the butler, Wadsworth, the guests are reminded that they have been given a pseudonym to protect their true identity and asks that they only use that name with the other guests. During dinner, Wadsworth admits a seventh attendee, Mr. Boddy, and announces that each of the guests is being blackmailed:\nProfessor Plum is a former professor of psychiatry and current employee of the World Health Organization whose medical license was revoked because he had an affair with one of his female patients.\nMrs. Peacock is the wife of a U.S Senator who has been accused of accepting bribes to deliver her husband's vote and claims she must pay their blackmailer to avoid a political witch hunt.\nMiss Scarlet is the owner of an illegal escort service in Washington, D.C..\nColonel Mustard is thought, at first, to have been blackmailed for scandalous photographs with one of Miss Scarlet's employees, but it is later revealed that he was a war profiteer who made his money from selling stolen radio components on the black market. He now works at the Pentagon on a private fusion bomb (which is revealed later in the film).\nMrs. White is an alleged \"black widow\" who was drawn in to avoid a scandal regarding the mysterious death of her nuclear physicist husband. She was previously married to an illusionist, who also disappeared under mysterious circumstances.\nMr. Green is a homosexual, a secret that would cost him his job with the State Department if it were widely known.\nFinally, Wadsworth reveals Mr. Boddy's secret to the guests: he is the one who has been blackmailing them. As the guests begin to shout at Mr. Boddy, Wadsworth explains that he has gathered all the guests together to confront Mr. Boddy and turn him over to the police. Confronted by Wadsworth's revelation, Mr. Boddy reminds the guests that, if turned over to the police, he can reveal their secrets while in police custody. Mr. Boddy then distributes to each guest a wrapped gift box which, when opened, reveal one of six weapons: a wrench, a candlestick, a lead pipe, a knife, a revolver, and a rope with a hangman's knot. Mr. Boddy suggests that they use the weapons provided to kill Wadsworth and destroy the evidence, keeping their secrets safe. Mr. Boddy turns out the lights in the room, creating a moment of chaos in which someone shoots the revolver. When the lights come back on, Mr. Boddy is lying on the ground and is pronounced dead by Professor Plum.\nEveryone denies killing Mr. Boddy, and Wadsworth reveals that he arranged the event in revenge for his wife who had committed suicide after being blackmailed by Mr. Boddy for having Socialist friends. While trying to decide how to proceed, Wadsworth and the guests check on Mrs. Ho, the Cook, who is found dead in the kitchen with the knife. Upon returning to The Study, Mr. Boddy is gone and is later found dead by Mrs. Peacock in the bathroom from the candlestick. Wadsworth and the guests assume there must be another person in the house that killed The Cook and Mr. Boddy, so they split up in pairs and search the house with the weapons locked in the cupboard. Over the course of search, three weapons (the wrench, the lead pipe, and the revolver) are used to a kill stranded motorist found dead in the lounge, a police officer (after he investigate the motorist's abandoned car) in the Library, and a singing telegram girl in the Hall. Yvette, the maid, is found dead in the Billiard Room with the rope.\nWadsworth announces to the other guests that he deduced the identity of the murderer and runs through a frantic re-enactment of the entire evening, scene by scene, with the guests in tow. Wadsworth points out that each of the victims had a connection to one of the guests and were actually accomplices that enabled Mr. Boddy to find out the secrets he later used to blackmail the guests.\nThe cook had earlier been employed by Mrs. Peacock.\nThe motorist was Colonel Mustard's driver during the war and knew of his involvement with the black market.\nYvette had worked for Miss Scarlet and had an affair with Mrs. White's husband, which made Mrs. White hate her, and led her to kill her husband. Colonel Mustard's scandalous photographs were of him and Yvette \"in flagrante delicto\" (caught in the act).\nThe police officer had been on Miss Scarlet's payroll for his silence.\nThe singing telegram girl was one of Professor Plum's patients. He once had an affair with her.\nThe accounting is interrupted by an evangelist at the front door warning \"the 'Kingdom of Heaven' is at hand\", who is encouraged to leave. Wadsworth then flips the electricity to the house.\nAt this point, the story proceeds to one of three endings: A, B, or C.\n=== Ending A ===\nHaving used her former call girl Yvette to murder Mr. Boddy and the cook, Miss Scarlet killed her and the others to keep her true business of \"secrets\" safe, planning on using the information learned tonight for her own benefit. While Miss Scarlet holds Wadsworth at gunpoint with the revolver, Wadsworth tells her that there are no more bullets in the gun, but Miss Scarlet insists she still has one left and threatens to kill him. Wadsworth reveals himself to be an undercover FBI agent and arrests Miss Scarlet as police arrive and secure the house. The evangelist is revealed to be the chief. Although still insisting to Miss Scarlet the revolver is empty, Wadsworth realizes she was right when he accidentally fires the last bullet into the air, hitting a chandelier and causing it to crash closely behind Colonel Mustard.\n=== Ending B ===\nMrs. Peacock is revealed as the murderer of all the victims and escapes after holding the others at gunpoint. However, Wadsworth reveals himself as an FBI agent with the night's activities set up to spy on Mrs. Peacock's activities, believing her to be taking bribes by foreign powers. As Mrs. Peacock makes her way to her car, she is captured by the police, and the evangelist is revealed to be the chief.\n=== Ending C ===\nThis ending is dubbed by the movie (on the home video release) as \"But here's what really happened.\" Each murder was committed by a different person: Professor Plum killed Mr. Boddy in the hall with the candlestick, Mrs. Peacock killed the cook in the kitchen with the knife, Colonel Mustard killed the motorist in the lounge with the wrench after unlocking the cupboard where the weapons were kept and getting into the lounge via a secret passage from the conservatory, Mrs. White killed Yvette in the billiard room with the rope, and Miss Scarlet killed the cop in the library with the lead pipe. Mr. Green is accused of shooting the singing telegram girl in the hall with the revolver. Wadsworth then reveals not only did he kill her himself, but that he is, in fact, the real Mr. Boddy and the man Professor Plum killed was simply his butler. He had brought the other victims, who were his accomplices in the blackmail scheme, to the house to be killed by the guests and thus plans to continue blackmailing them now that there's no evidence against him. Mr. Green then draws another revolver and kills the blackmailer. Mr. Green reveals to the others that he is actually an undercover FBI agent and the whole evening was a set-up to catch the criminals. The police and FBI arrive and arrest all the guests for murder as the evangelist is revealed to be the chief. Mr. Green then declares that he killed Mr. Boddy, \"In the Hall, with the revolver.\" He tells the chief to round everyone up, then smiles and says, \"I'm going home to sleep with my wife.\""}