{"mid": "Cobra", "IMDB_id": "tt0090859", "title": "Cobra", "plot": "\"Crime is a disease. Meet the cure.\" Lt. Marion Cobretti, nicknamed Cobra, is a sunglass wearing, tooth pick chewing cop who is all about getting the criminal and breaking\nthe rules. He has the entire department on his back all the time about his very violent\nand forceful way of getting the bad guys, normally making the punks end up in a body\nbag loaded with lead issued from his trusty pearl handled Colt .45.But Cobra is set a real challenge when a killer cult is spreading\nrapidly in the city. The cult kills innocent people, seeming to pick random victims and\nslaying them with jagged knifes and getting off on the hunted's fear. But they make a huge mistake when they kill a woman at an bus stop and a young model sees them. She\ndoesn't exactly know that they've killed someone, but is extremely scared when one\nof the killers, a muscle bound and rather deformed looking man, gives her a spine chilling\nlook. Soon the killers are after her! And they kill her photographer, a security guard\nand very nearly make her meet their sadistic style of murder. Cobra is soon on the\nseen, with his partner the junk food loving, Sergeant Gonzales. They ask the young model,\nwhose name turns out to be Ingrid, if she saw the killers. She says she only saw some\npeople at the bus stop acting very odd and a man who scared her badly.But Cobra's progress into solving the case is halted by the pencil pushing, fat headed Detective Monte,\nwho is always on his case about too much force. He tells Cobra that he's on the Zombie\nsquad for a reason, he's too violent and doesn't please the press.Much too Monte's disgust, the Chief and Captain Sears decided to let Cobra use his street wise talk to fight the\nkiller. Cobra goes through the entire population of the nocturnal seediness of\ndowntown, where all the prostitutes, pimps, bar flies and cons of the city hang out. But\nhe doesn't find any kind of help from these people, they have no idea who the killers are.Cobra soon connects a supermarket killing, that involved a physco who claimed that he\nwas part of \"the new order\" who would wipe out the weak and make the strong survive,\nto the mass murders ripping at the soft under belly of the capital. But Detective Monte's\nsmart mouth antics and somewhat spineless Captain Sears try to stop him from using\nagressive force, not caring that Ingrid almost got killed by one of the cult followers, Night\nSlasher and that numerous other people where slayed in the hospital at night. The Captain\nagrees to let Cobra take Ingrid to the countryside with Gonzales and a female cop\nnamed Nancy Stalk. Little does he know that the heat is going to be turned up instead\nof cooled off when they leave the city. Nancy is infact a cult member and leading the\nNight Slasher and his cronies right to where Cobra is taking Ingrid.While in a motel that's off the beaten track, Ingrid and Cobra realise their attraction to one another. The\nromantic mood is short lived however, and the cult is back on Cobra's trail. They burn\ndown the motel and almost kill Gonzales. Cobra and Ingrid ride off in a pick up truck\nand almost meet their end by crashing into a burning car that's blocking the road. Cobra\nstill manages to take some punks down though, with a very nice piece of weaponary called the laser mount submachine gun.They end up in a chemical factory and finally Night Slasher and Cobra come face to face. In a very phycotic speech Night Slasher\nsays that Cobra's law is weak and that their cult will always survive. This sends Cobra off\nthe deep end and Slasher onto a huge metal hook, that rips through his back and sends\nhim off into a molten vat of metal. Nancy however is still alive and tries to kill Cobra,\nbut she is also killed.After all the bloodshed, Cobra and Ingrid emerged slightly bruised\nand dirty, from the factory. The Captain congratulates Cobra, but Monte is too proud to\nactually admit that Cobra one the fight. He picks up his bit about too much excessive\nforce, but earns himself a good punch from Cobra, sending him to the ground stone cold.\nIngrid and Cobra ride off on a motorbike into the sunset to Kiss singing \"Can you get\nenough me baby, I can't get enough of you.\" In true Stallone/ Cobra style, the day\nis saved and the conveniantly pretty chic is too!"}