{"mid": "ColdWar", "IMDB_id": "tt0170896", "title": "Cold War", "plot": "One midnight, a Hong Kong Police Force Emergency Unit (EU) van carrying advanced equipment and five police officers goes missing. As the police investigate the case, they became aware that the terrorists possess detailed knowledge of the police's procedures and have planned several steps ahead, even possibly breaching the secured police network. As the Commissioner is away, Deputy Commissioner M.B. Lee (Tony Leung Ka-fai), plans and leads a rescue operation code-named \"Cold War,\" and declares Hong Kong to go under a state of emergency.\nAfter being repeatedly misled by the terrorists and failing to track them down, fellow Deputy Commissioner Sean Lau (Aaron Kwok) believes Lee is acting too rashly, due to one of the five abducted policemen being his own son, Joe Lee (Eddie Peng). After consulting with superintendent Vincent Tsui (Chin Kar-lok) and Albert Kwang (Gordon Lam), who both believe Lee is taking measures too extreme, Lau relieves Lee of his command and assumes command of Operation Cold War.\nLau plans to negotiate with the terrorists while secretly tracking them to their hide-out. The terrorists asks Lau to prepare a ransom equal to the calculated value of the policemen and the EU van. As the police force prepare the cash, the terrorists call again and say they only want roughly half of it, and for Lau to personally deliver the money. At the request of the bank manager, Lau takes only enough for the ransom and have the rest delivered back to the bank. When Lau eventually arrives at the meeting location, he is ordered to stop the car immediately and throw the cash down a bridge, causing a traffic blockage. In the confusion, Lau is attacked by the terrorists, and superintendent Tsui was killed in action in the crossfire. The terrorists escape, while superintendent Kwang notifies Lau that the terrorists simultaneously intercepted the other half of the money that was supposed to be returned to the bank. However, the police force did successfully rescue the missing policemen at a different location.\nLau attempts to question the bank manager, but the manager was then killed by a car bomb. Superintendent Kwang investigates the bombing to track the bombers, but is instead led into a trap and killed with his team. Lau suspects that the terrorists were aided by insiders in the force, but before he can investigate any further, he is arrested by ICAC Officer Billy Cheung (Aarif Rahman), who received leaked information from an anonymous source about Operation Cold War. Lau is interrogated by Cheung, who accuses him of poorly handling the rescue operation, leading to the loss of the ransom money which he secretly took for himself. Lau denies this, and the ICAC fail to find evidence against him. Cheung makes some further investigations and discovers that the police Commissioner will be stepping down in two years, and thus either Lee or Lau will receive a promotion. Lau has the support of the Security Secretary because of his skillful management of the police's finances. On the other hand, Lee rose through the ranks from Constable and has the support of the front-line officers including the CID. Cheung now suspects that Lee is trying to use the failure of Operation Cold War to ruin Lau's chance for promotion.\nThe ICAC eventually discover, based on forensic evidence, that Joe Lee was the mastermind behind the abduction of the EU van. Lau presents this information to Lee, and reveals that it was Lau himself that leaked information to the ICAC (who has the power to act independent to the police force), in order to borrow their resources to investigate the case, thus not alerting the insider. Lee confronts his son, who reveals that he planned this with other associates from the police force who wanted to see Lee rise to the position of Commissioner. Seeing that Joe is unrepentant and unwilling to reveal anymore, Lee reluctantly shoots and arrest him. The following day, Lee and the current Commissioner announce their plans to retire, nominates Lau as the next Commissioner, and congratulate Lau on his resourcefulness on solving the case.\nThe film ends with Lau receiving a mysterious phone call from the terrorists, who announces that they have kidnapped his wife, and wants Joe Lee released in return."}