{"mid": "Colors", "IMDB_id": "tt0094894", "title": "Colors", "plot": "Two white cops, Bob \"Uncle Bob\" Hodges (Robert Duvall), a respected 19-year LAPD veteran, and rookie officer Danny McGavin (Sean Penn) have just been teamed together in the C.R.A.S.H. unit that patrols East L.A. and South central.\nThe older cop is appreciated on the local streets. He is diplomatic on the surface, preaching \"rapport\" to gang members to encourage them to offer help when it is truly needed and recognizes that every action cops take is scrutinized by the very people they are trying to help. Hodges explains his view on policing to his young partner with a joke about bulls and cows. Although the pair bond quickly, life lessons are seemingly lost on the aggressive, cavalier McGavin, whose stunted actions soon bring him quick notoriety with the local gang members and the people themselves, such as attacking a graffiti artist by spraying his eyes with the paint can. When McGavin wrecks their first unmarked car during a pursuit, its replacement, painted a vivid yellow, results in McGavin being nicknamed \"Pac-Man\" by officers and gang members alike.\nMcGavin also has a short lived romance with a waitress named Louisa (María Conchita Alonso) who, like the offended Hodges, feels the weight of the Pac-Man persona. Amidst the strains of these relationships, the murder of a Bloods gang member leads to a series of escalations between two other street gangs. A series of seemingly random incidents culminates in a plot that finds the two partners in the middle of the Crips, Bloods and Hispanic Barrio war. The 21st Street Gang, led by a criminal named Frog, attempts to negotiate a peace similar to Hodges and steer clear of the melee. To protect his partner, Hodges unwittingly exposes Frog as his source on the Crips leader Roccet (Don Cheadle) with his scheme to kill McGavin. Each group attempts to right the wrongs against their respective crews as police work to prevent the hit and stand their authority over the fall out.\nIn the end, the unit moves in on the would-be last crew standing - the 21st Street Gang. While arresting Frog, Hodges is fatally shot by a gunman trying to enact the hit on McGavin. With medics en route, McGavin comforts Hodges and breaks down with regret as the elder partner falls into delirium and dies.\nSometime later, a more conservative McGavin has a rookie partner, a black cop who grew up in the neighborhood where they patrol and sports an attitude similar to the \"Pac-Man\". McGavin tells him the same joke about the bulls that Hodges taught him, and the younger officer reciprocates in the same way as the younger McGavin did. The film ends with McGavin considering the cycle as the pair drive on and continue their patrol."}