{"mid": "ComingToAmerica", "IMDB_id": "tt0094898", "title": "Coming to America", "plot": "Akeem Joffer, the heir to the throne of Zamunda (a fictional African kingdom), lives a pampered lifestyle with every daily task performed by servants. Akeem has become fed up with this and wishes to do more for himself. The final straw comes when his parents, King Jaffe and Queen Aeoleon, present him with an arranged bride-to-be named Imani Izzi, whom he has never met and who has been trained to obey Akeem's every command. Akeem concocts a plan to travel to the United States to find an intelligent, independent-minded woman he can both love and respect, and who will love Akeem for who he is and not for his wealth and social status as a prince. Akeem and his best friend/personal aide, Semmi, flip a coin to decide between going to either Los Angeles or New York City, and end up going to New York City. They end up in the borough of Queens and rent a run-down apartment in the neighborhood of Long Island City, passing themselves off as poor foreign students. They begin working at a local fast food restaurant called McDowell's—an obvious ripoff of McDonald's—owned by widower Cleo McDowell and his two daughters, Lisa and Patrice.\nAkeem soon falls in love with Lisa, who possesses all the qualities that the prince is looking for in a woman, as first seen by Akeem at a rally where she makes a strong plea to renovate a playground. The rest of the film centers on Akeem's attempts to win Lisa's hand in marriage, which is complicated by Lisa's lazy and obnoxious boyfriend, Darryl Jenks (Eriq La Salle), whose father owns \"Soul Glo\" (a Jheri curl–like hairstyling aid). Lisa eventually breaks up with Darryl after he announces their engagement (without Lisa having given her consent) to their families, and starts dating Akeem. Although Akeem thrives on hard work and learning how commoners live, Semmi is not comfortable with living the life of a poor man. When Akeem randomly donates their travel money to the homeless Randolph and Mortimer Duke (characters in the previous Eddie Murphy film Trading Places), Semmi transmits a plea to the King of Zamunda for financial help. This causes Akeem's parents to travel to Queens and expose Akeem's identity as a prince to the McDowells.\nMr. McDowell, initially disapproving of the match as he did not want to see his daughter with a man of poor means, is ecstatic that she has in fact attracted the interest of an extremely wealthy prince, but Lisa becomes angry and confused as to why Akeem lied to her about his identity, as he had told her before that he was actually a Zamundan goat herder. Still hurt and angry that Akeem lied to her, she refuses to marry him, even after he offers to renounce his throne, and he returns home with a broken heart, resigned to marry the woman chosen for him by his parents. On the way to the airport, King Jaffe remarks that Akeem can't marry Lisa anyway because of \"tradition,\" and tries defending himself by saying \"Who am I to change it?\", with Queen Aeoleon curtly responding, \"I thought you were the King\".\nAt the final scene's wedding procession, Akeem, still heartbroken, waits dejectedly at the altar as his soon-to-be consort makes her way down the aisle. However, when Akeem lifts the veil to kiss her, he finds Lisa instead of Imani. Akeem and Lisa are married, and they ride happily in a carriage after the ceremony to the cheers of Zamundans. Witnessing such splendor, Lisa is both surprised and touched by the fact that Akeem would have given it up just for her. Akeem offers to formally abdicate if she doesn't want a life like this, but Lisa playfully declines and decides to become royalty instead."}