{"mid": "Commando", "IMDB_id": "tt0088944", "title": "Commando", "plot": "Retired Delta Force operator Colonel John Matrix is informed by his former superior Major General Franklin Kirby that all the other members of his former unit have been killed by unknown mercenaries. The mercenaries, among them Bennett, an Australian ex-member of Matrix's team fired for excessive violence, attack Matrix's secluded mountain home and kidnap Matrix's young daughter Jenny. While trying to intercept them, Matrix is also overpowered and abducted by the mercenaries. He is taken before their leader, Arius, a South American former dictator who needs Matrix to carry out a political assassination in his home country of Val Verde, where Arius wishes to lead a military coup. Matrix previously led a United States-backed revolution that deposed Arius, who has chosen Matrix because the new US-puppet president trusts him implicitly. With Jenny's life on the line, Matrix reluctantly accepts the demand.\nAfter boarding a plane to Val Verde, Matrix manages to kill his guard, Henriques, and jumps from the plane just as it is taking off. With approximately 11 hours, he sets out after another of Arius' men, Sully. He enlists the aid of an off-duty flight attendant, Cindy, and instructs her to follow Sully to a shopping mall. Cindy first assumes that Matrix is a maniac, but after she sees Sully pull a gun on Matrix in the ensuing fight, she has a change of heart and henceforth assists him in his endeavor. After a lengthy car chase, Matrix catches up with Sully and drops him off a cliff to his death. Taking a motel key from Sully's jacket, Matrix tracks down and confronts Cooke, a former Green Beret in Arius' employ. He kills Cooke after a lengthy fight and learns where Jenny is being held after searching Cooke's car.\nMatrix breaks into a surplus store to equip himself with military weaponry, but is immediately arrested by the police. Cindy helps him escape with a rocket launcher and, after commandeering a seaplane from a nearby marina controlled by Arius, Matrix and Cindy land the plane off the coast of Arius' island hideout. Matrix instructs Cindy to contact General Kirby and then proceeds to Arius' villa, killing the leader as well as his men on the way. Jenny escapes her confinement to the villa's basement, but is captured by Bennett. Matrix tracks them and faces Bennett in a fierce struggle until Matrix fatally impales Bennett with a steam pipe, killing him. Kirby arrives with a military detachment and asks Matrix to rejoin the Special Forces Unit, but Matrix declines and departs the island aboard the seaplane with Jenny and Cindy."}