{"mid": "Compulsion", "IMDB_id": "tt0052700", "title": "Compulsion", "plot": "Compulsion tells the story of Anjika Indrani, a wealthy young Cambridge graduate who is in a secret relationship with fellow graduate, Alex.\nAnjika’s father, Satvick, forces her into an arranged marriage with a business associate’s son, Hardick. Satvick’s chauffeur, Don Flowers, realises Anjika is not happy with her father’s plans and says he will help her out, on the condition she spends the night with him. Anjika hates him, so she refuses at first, but reluctantly agrees eventually. Hardick collapses on a date with Anjika, and Flowers seizes the opportunity and takes him back to his flat, scattering illegal drugs everywhere, making Hardick look like a dealer.\nAnjika’s parents call off the marriage, but Flowers reminds her she needs to keep up her end of the deal. Reluctant, she visits the hotel room Flowers booked and allows him to flirt with her, touch her and smell her, before the pair have sex. Anjika wakes up the next morning and quickly leaves; Flowers awakes and thanks her.\nThings are not simple from then on. Anjika makes up the excuse that if Flowers stops providing her brother with drugs, she will bed him again. Flowers realizes Anjika has feelings for him, and makes her beg to take her to bed.\nThe pair continue in their affair, obviously strongly loving each other. Things complicate, however, when Alex and Anjika reveal their relationship and her parents strongly approve, even arranging a marriage for the two. Anjika becomes stressed, realizing her heart belongs with Flowers despite the age difference, yet she’s in denial and insists she still loves Alex.\nHardick returns and blames his messed up life on Alex, however realises Anjika is to blame. Anjika and Flowers have just had sex when Hardick arrives. He grabs Anjika but a messy Flowers appears, warning Hardick away. Hardick realizes the two had sex, but before he can speak Flowers strangles and kills him.\nAnjika’s life continues to go downhill. Her affair with Flowers continues. Flowers presents her with a bracelet, however she says she can’t wear it. Anjika and her friend are collected from a nightclub and Anjika writes a flirtatious text; when asked by her friend she says it’s for Alex, however she is caught sending it to Flowers. Alex discovers this and confronts Anjika, she denies anything with Flowers.\nRealizing the affair has gone way out of hand, Anjika prepares a knife for her latest date with Flowers. The two have sex but Anjika remains hesitant, saying she could get Flowers done for rape. Flowers is shocked but admits he loves Anjika and insists that she loves him too, which she does. Flowers then continues to have sex with her, although this time, Anjika pleads him not to. Flowers devastated and in love, puts the knife in her hand and begins stabbing himself in the stomach and then, caught in the moment, Anjika begins stabbing furiously into his side. She phones the police and says she’s killed a rapist.\nThe next shot is of Anjika and Alex emerging from their wedding. Anjika seems less than thrilled but puts on a brave smile. As she hugs her mother, she is seen to be wearing Flowers’ bracelet. She gets into the car and stares as the new chauffeur gets in the front seat. She looks out of the window sadly, implying she truly was in love with Flowers."}