{"mid": "ConAir", "IMDB_id": "tt0118880", "title": "Con Air", "plot": "Honorably discharged Army Ranger Cameron Poe (Nicolas Cage) is given a ten-year prison sentence on charges for using excessive force on a drunk man who attempted to attack his pregnant wife Tricia (Monica Potter), leading to killing the man. Finally Poe is paroled eight years later, and is to be released after being flown to Alabama on the Jailbird, a C-123K transport prison aircraft. Along with Poe are several other prisoners including his diabetic cellmate and friend Mike \"Baby-O\" O'Dell (Mykelti Williamson), who is being transferred (but not yet paroled) with Poe. The transfer is being overseen by U.S. Marshal Vince Larkin (John Cusack), as the transfer includes notorious criminal mastermind Cyrus \"Cyrus The Virus\" Grissom (John Malkovich), gangster and Black Guerrilla member Nathan \"Diamond Dog\" Jones (Ving Rhames), serial rapist John \"Johnny 23\" Baca (Danny Trejo), and mass murderer William \"Billy Bedlam\" Bedford (Nick Chinlund) for their transfer to a new Supermax prison. Larkin is approached at the last minute by DEA agents Duncan Malloy (Colm Meaney) and Willie Sims (Jose Zuniga), who ask for Sims to be brought aboard undercover as a prisoner so that he can extract more information from drug kingpin Francisco Cindino (Jesse Borrego), a prisoner that is to be picked up at Carson City, Nevada en route. Larkin agrees, unaware that Malloy has hidden a gun on Sims' body.\nAs the Jailbird takes off, another prisoner Joe \"Pinball\" Parker (Dave Chappelle) incites a riot, allowing him to set free Diamond Dog and Grissom. Grissom quickly rushes to the cockpit, killing the first officer and forcing the captain to continue to fly the aircraft. Grissom then announces the prisoners' takeover of the Jailbird and takes the prison guards hostage. Sims attempts to control the situation only to be killed by Grissom. Poe feigns cooperation with the other prisoners as they prepare to offload guards and the captain disguised as prisoners at Carson City; Poe is able to sneak a recording device Sims had onto one of the now tied up guards. The transfer proceeds, among the new prisoners are Cindino, pilot \"Swamp Thing\" Williams (M. C. Gainey), transvestite drug dealer Ramon \"Sally Can't Dance\" Martinez (Renoly Santiago), and serial killer Garland Greene (Steve Buscemi), AKA \"the Marietta Mangler,\" whose murders make \"The Manson family look like the Partridge family\". Pinball takes the aircraft's transponder and plants it on a small sightseeing aircraft. Just as Larkin discovers information in Grissom's cell that indicates this escape attempt has been planned with Cindino, the recording device is found and the other prison guards recognize the tied up guards. Once noticing the police cars headed their way, the Jailbird immediately takes off.\nMalloy berates Larkin for assigning incompetent guards to the transport aircraft and then chases off after the transponder. On the Jailbird, Grissom reveals that they will be landing at Lerner Airfield, a former air base where Cindino has arranged passage for them all to a non-extradition country. Poe finds Pinball's body stuck in the landing gear, the convict not having made it back in time, and secretly writes a message to Larkin about Lerner Airfield before pushing it out of the aircraft. The body lands in the middle of Fresno, California, and Larkin is alerted, ordering the National Guard to head there while he drives to the airfield himself in Malloy's sports car.\nBilly Bedlam discovers Poe's true identity after going through his personal possessions, identifying him as a parolee and former Ranger, and Poe is forced to kill Bedlam when he charges at Poe. At Lerner, the aircraft overruns the small runway and grounds itself. There is no immediate sign of Cindino's aircraft and Grissom orders the prisoners to start to dig out the plane. Poe uses the time to locate insulin shots for Baby-O, and happens upon Larkin. The two quickly brief each other on the situation as Poe has to return before suspicion is raised. Larkin encounters Cindino with his agents preparing a small jet for departure and is able to sabotage it on takeoff. Grissom realizes Cindino's deception on planning on leaving the prisoners behind and kills him by burning him with the aircraft as it explodes.\nMeanwhile, Johnny 23, assigned to watch for trouble, spots the approaching National Guard and alerts the others. The prisoners equip themselves with assault rifles in the aircraft that were originally intended for corrections officers and prepare to massacre the troops in an aircraft graveyard. However, Larkin is able to save most of the troops using a bulldozer as a bullet shield, forcing the prisoners to retreat to the Jailbird and prepare for take off. Poe, after giving Baby-O his shots, tries to escape with him and a female guard who had been protecting herself from Johnny 23 aboard, but the aircraft has taken off by the time they are ready.\nPoe's identity and true intent is revealed to the prisoners when Diamond Dog discovers Billy Bedlam's corpse and Poe's possessions. As Grissom wounds Baby-O and is about to kill Poe, Larkin and Malloy arrives with Bell AH-1 Cobra assault helicopters and fire upon the Jailbird, damaging its engines and draining its fuel tank. After being persuaded by Poe not to fire and Larkin revealing his identity as a parolee, Malloy joins forces. When the two order the plane to land at McCarran International Airport, Swamp Thing is forced to crash-land the plane in the only open paved surface nearby, the Las Vegas Strip. The aircraft causes a great deal of destruction as it skids to a stop in front of a casino. The ensuing chaos allows Grissom, Diamond Dog, and Swamp Thing to escape on a fire truck while Las Vegas police secure the area and apprehend the other prisoners. Poe and Larkin team up to chase down the trio, eventually killing all three. Poe thanks Larkin and tells him he is now someone whom he can trust, and then goes to reunite with Tricia and his daughter whom he has never met.\nGarland Greene's fate after the crash is revealed: he is now a free man, gambling and drinking while on a winning streak at a casino, seemingly giving up his life of crime, although it is not known whether the police later apprehend him."}