{"mid": "ConductUnbecoming", "IMDB_id": "tt0072812", "title": "Conduct Unbecoming", "plot": "Around 1880, two young British officers arrive to join a regiment in India. One, Lieutenant Drake (Michael York), from a middle-class background, is extremely eager to make the right impression while the other, Lieutenant Millington (James Faulkner), the son of a General, is keen to get out as soon as possible and deliberately antagonises his fellow-officers. The two newcomers learn the traditions of the regiment, one of which is a mess game in which they chase a wooden pig on wheels, attempting to pierce its anus with their swords.\nMrs Scarlett (Susannah York), the young and attractive widow of a captain who was awarded a posthumous Victoria Cross, is a constant presence in the regiment. She does not behave in the manner expected of a hero's widow, flirting openly with soldiers she finds attractive. One night at a mess dance Millington gets drunk and in the garden tries to seduce Mrs Scarlett. She repels him, but moments later runs back into the mess wounded and in shock, claiming the culprit was Millington. An informal court martial is convened in secret, with Drake ordered to be Millington's defending officer. Millington sees the proceedings as a convenient charade, allowing him to be sent home quietly. Drake is torn between putting on the best defence he can and advancing his own career by abiding with the wishes of the regiment's commanders to quickly and quietly have Millington found guilty.\nUltimately, instead of the immediate guilty plea which is expected of him, Drake begins to challenge the evidence and to confront witnesses, including Mrs Scarlett. Despite repeated browbeating and threats from his superiors, he probes into the exact nature of the attack on her and its resulting injuries. It becomes increasingly clear that somebody else had attacked Mrs Scarlett with a sword, in the same manner in which the pig on wheels is attacked in the mess game, after she had repulsed the unarmed Millington.\nHowever, to clear Millington completely the real assailant must be found. Drake learns from an Indian servant that another widow suffered a similar attack with a sword six months earlier, before he and Millington joined. Mrs Scarlett, who to date has not told the truth, admits to the enquiry that her harrowing experience was very like that of the other widow. But she still will not say who is to blame. One officer knows who the culprit is and, hiding Drake in the shadows so he may witness what is to take place, confronts the guilty man privately. After confessing his crimes and their motivation, the guilty man shoots himself. Millington, now indisputably proved innocent, is welcomed back by his brother officers; but Drake, who has antagonised everybody and is disgusted by the truth he uncovered, resigns."}