{"mid": "Coneheads", "IMDB_id": "tt0106598", "title": "Coneheads", "plot": "Upon discovering a UFO in American airspace, the National Guard sends fighter jets to investigate, and they fire on the craft when it doesn't respond. Activating a cloaking device too late, the spaceship crashes into the Atlantic Ocean, near Manhattan. The aliens aboard, Beldar Clorhone and his life-mate Prymaat, survive and quickly adapt to our human way of life, despite standing out with their conical shaped heads. Beldar was assigned by the Highmaster to conquer earth as a Protoid Re-fueling Station under the title of 'Fuel Survey Underlord of the Wilderness Planet at the end of the Noctolium Solar Chain'. Beldar gets work as an appliance repairman, and when his grateful boss Otto discovers that Beldar has no documentation, he arranges for a false identity, which sends up a red flag that quickly alerts the INS. Meanwhile, after communicating with their world (Remulak) and discovering that a rescue vessel will not arrive for seven \"Zurls\" (many years), Prymaat informs Beldar that she is pregnant. They now need to completely adapt and safely blend in in order to raise their child among humans. Ambitious INS agent Gorman Seedling and his assistant Eli attempt to capture Beldar and Prymaat, but they are able to elude the two agents.\nMonths later, Beldar has become a respected taxi driver, and the couple live in his boss's basement. After the birth of their daughter Connie, they buy a home and move to suburban Paramus, New Jersey, adopting the surname Conehead. Beldar begins a new career, this time as a driving instructor. Meanwhile, Gorman gets a promotion and decides to leave the Coneheads' case to the agent replacing him. His promotion, however, is soon held-up by the case's extreme expense, forcing Gorman to continue until it's closed.\nNow a teenager, all Connie Conehead wants to do is fit in with her peers, much to the objections of her father, especially when she begins seeing Ronnie, an auto mechanic. This caused tension between Connie and Beldar, who strongly disapproves of Ronnie, with Beldar going so far as tearing the roof off Ronnie's car and threatening him after he tries to sleep with her (an act that angers Connie greatly). Beldar is also preoccupied with winning a golfing trophy at his country club, while Prymaat becomes concerned about her attractiveness to Beldar due to one of Beldar's driving students making a pass at him.\nGorman and Eli track the Coneheads down to their home and pose as Jehovah's Witnesses to gain entry to the Conehead home. During the conversation, Prymaat discovers their communication device to Remulak is beeping, and she promptly tells Beldar that he has a phone call from 'the Big Phone'. This cause Beldar to promptly eject Gorman and Eli from their home. Beldar then receives word that their rescue vessel is on its way.\nAt a costume party that night, Connie is told that they will be rescued soon. She disobeys her \"parental units\" by returning home with Ronnie. Once there Connie consummates their relationship using her parents \"senso-rings\". Beldar and Prymaat walk in on them, just as the INS shows up to take the Coneheads into custody. Their rescue vessel arrives just in time, and Gorman and Eli are taken aboard with Beldar, Prymaat, and Connie.\nOn Remulak, Beldar is welcomed home, presenting Highmaster Mintot with a variety of 'gifts' from earth, including Gorman and Eli as slaves. Mintot is at first satisfied with what Beldar has accomplished during his time on Earth, until he notices that Beldar got his teeth capped (something Beldar had done as a part of blending in). He accuses Beldar of treason and sentences him to fight the ferocious Garthok (\"narful the Garthok\"), much to Prymaat's distress.\nAfter the Garthok easily and gruesomely kills others who were sentenced to fight it, Beldar uses his Earthly golfing skills to save himself, killing the creature. For his victory, he is then granted a request: Beldar wishes to return to Earth to oversee its conquest, taking Gorman back with him as a minion. Mintot agrees, and Eli is left behind, becoming the Highmaster's personal lackey, acclimating to his new role rather quickly. Beldar leaves for Earth with Prymaat, Connie, and Gorman in tow. He soon demonstrates that Connie's feelings are more important to him than planetary conquest by quickly faking an Earth attack. Beldar orders his invasion force to retreat to Remulak, while making it look like his spaceship has been destroyed by a superior weapon. For sparing his life, Gorman agrees to give the Coneheads Green Cards in exchange for Beldar proving he has a marketable talent no other American citizen possesses, to which Beldar confidently agrees.\nSome time later, Ronnie arrives to take Connie to the prom. Beldar gives Ronnie 55 words of advice, and then uses a massive flash bulb arrangement on his home-built Polaroid camera to document the happy event. As Connie and a now-sunburned Ronnie depart, Beldar and Prymaat look at the oversized photo, saying, \"Memories, we will enjoy them\"."}