{"mid": "Confetti", "IMDB_id": "tt0427089", "title": "Confetti", "plot": "The prestigious bridal magazine Confetti, owned by the arrogant, suave Antoni Clarke (Jimmy Carr) and managed by the long-suffering, uptight chief editor Vivienne (Felicity Montagu) is holding a competition to see who can hold the most original wedding, with the winners being presented with a new house and a cover shoot for the magazine. Three couples and their proposals are selected to participate: Sam and Matt (Jessica Stevenson and Martin Freeman), a middle class couple of old-fashioned romantics who have elected to hold their wedding in the style of Busby Berkeley musicals of the 1930s and 1940s, despite the fact that Sam can barely hold a tune; Isabelle and Josef (Meredith MacNeill and Stephen Mangan), a pair of hyper-competitive professional tennis players holding a tennis-themed wedding; and Joanna and Michael (Olivia Colman and Robert Webb), a naturist couple who intend to hold their wedding entirely naked. All three weddings are planned using the services of Gregory and Archie (Vincent Franklin and Jason Watkins), wedding planners and partners in both business and love.\nThe film follows their planning, and the various crises that each couple faces over the three-month planning period. As well as learning to sing and dance, Sam and Matt must contend with Sam's dominating mother (Alison Steadman) and attention-seeking sister (Sarah Hadland), who appear intent on hijacking the proceedings and constantly browbeat and undermine the shy and easily cowed Sam (such as preventing her from inviting her beloved but estranged father), much to Matt's growing irritation. The couple must also deal with Matt's oldest friend and best man Snoopy (Marc Wootton), a musician who nurses a bitter resentment towards Sam for coming between him and Matt that he expresses in not-so-subtle lyrics that he intends to sing at the wedding. Despite the constant support and encouragement the couple receive from Archie and Gregory, the gradual tension eventually builds to a bitter argument between Matt and Sam's mother and sister which sees him kicked out of the house where he is staying with them; this prompts Sam, however, to finally stand up for herself and put her mother and sister in place.\nIsabelle and Josef, meanwhile, are intensely determined to win, owing to unexplained financial difficulties. Suspicious and competitive, they become increasingly paranoid that the competition is being 'fixed' against them in favour of Matt and Sam, eventually resorting to the extreme measure of having Isabelle's nose – and her extremely large nostrils – altered by plastic surgery (with the result being that the nose she ends up with is much longer than her original one). In the process, however, they find themselves combatting their own anxieties; Josef, in particular, finds himself confronting his jealousy over Isabelle's friendship with their tennis coach, Jesus, and insecurity over his largely finished tennis career and that he will not be able to be a worthy husband to Isabelle. Joanna and Michael, however, find their plans challenged at every turn by Vivienne, who has no intention of putting a naked couple on the front of the magazine should they win. Michael, an experienced naturist, angrily resists Vivienne's efforts to make him dress up for the wedding, but Joanna, a recent convert and still insecure about revealing her body to strangers, finds herself of mixed minds about the issue. The pressure of the magazine and the tension between the two becomes so great that it briefly looks like the marriage will not even take place at all.\nThe big day finally arrives, amid much jitters and anxiety on all sides. All three weddings go off largely without a hitch, although Michael and Joanna raise eyebrows when, in defiance of Vivienne's rulings, they bare all (literally) in their wedding service. The winners are soon decided – Matt and Sam, which prompts a display of sour grapes on part of Josef and Isabelle. The movie then briefly glimpses at the three couples a few months later, all of whom are adjusting to married life relatively happily."}