{"mid": "ConquestOfThePlanetOfTheApes", "IMDB_id": "tt0068408", "title": "Conquest of the Planet of the Apes", "plot": "The opening titles set the film in \"North America – 1991.\" Armando (Ricardo Montalbán) explains that in 1983 (ten years after the end of Escape from the Planet of the Apes, which was set two years ahead of its theatrical release date), a disease killed the world's cats and dogs, leaving humans with no pets. To replace them, humans began keeping apes as household pets. Realizing the apes' capacity to learn and adapt, humans train them to perform household tasks. By 1991, American culture is based on ape slave labor (just as Cornelius described would happen in the previous film). It is also suggested that the North America of the 1990s is at least partly a police state, as apes and humans are being watched at all times.\nArmando and Caesar (Roddy McDowall), a young chimpanzee horseback rider in Armando's circus, distribute flyers around a large city to advertise the circus' arrival. Armando warns the chimpanzee to be careful....should anyone learn his identity as the son of Cornelius and Zira, it would mean their deaths. They see apes performing various menial tasks, and are shocked at the harsh discipline on disobedient apes. Seeing an ape being beaten and drugged, Caesar shouts \"Lousy human bastards!\" Quickly, Armando takes responsibility for the exclamation, explaining to the policemen that it was he who shouted, not his chimpanzee. The surrounding crowd becomes agitated, and Caesar flees.\nHiding in a stairway, Armando tells Caesar he will go to the authorities and bluff his way out of the situation. Meantime, Caesar has to hide among his own kind (in a cage of orangutans) and soon finds himself being trained for slavery through violent conditioning. He is then sold at auction to Governor Breck (Don Murray). Breck allows the ape to name himself by randomly pointing to a word in a book handed to him and the chimpanzee's finger rests upon the name \"Caesar\", feigning coincidence. Caesar is then put to work by Breck's chief aide MacDonald (Hari Rhodes) who sympathizes with the apes to the thinly veiled disgust of his boss.\nMeanwhile, Armando is being interrogated by Inspector Kolp (Severn Darden), who suspects his \"circus ape\" is the child of the two talking apes from the future. Kolp's assistant puts Armando under a machine, \"The Authenticator,\" that psychologically forces people to be truthful. After admitting he had heard the name Cornelius before, Armando realizes he cannot fight the machine. A guard comes in to force him to continue the interrogation, but Armando struggles and jumps through a window falling to his death. Learning of the death of his foster father, the only human that cared for him, Caesar loses faith in human kindness and begins plotting a rebellion.\nSecretly, Caesar teaches combat to the other apes and has them gather weapons. While doing an errand with Caesar, MacDonald expresses concern for the rising problems and wished he could communicate with Caesar. Caesar exposes himself as the lost circus ape and tells MacDonald of his plans to depose Breck. MacDonald, while understanding of Caesar's intent, has his doubts about the effectiveness of revolution, as well as Caesar being dismissive of all humans. Meanwhile, Breck learns from Kolp that the vessel which supposedly delivered Caesar is from a region with no native chimpanzees. Suspecting Caesar is the ape the police are hunting, Breck's men arrest Caesar and electrically torture him until he speaks. Hearing him speak, Breck orders Caesar's immediate death. Caesar survives his execution because MacDonald lowers the machine's electrical output well below lethal levels. Once Breck leaves, Caesar kills his torturer and escapes.\nCaesar begins his revolution with the first objective to capture Ape Management. The apes are victorious after killing most of the riot police. After bursting into Breck's command post and killing most of the personnel, Caesar has Breck marched out to be executed. MacDonald, whose ancestors had been slaves, begs Caesar not to succumb to brutality and show mercy to one's former masters. Caesar ignores him and in a rage declares:\nWhere there is fire, there is smoke. And in that smoke, from this day forward, my people will crouch, and conspire, and plot, and plan for the inevitable day of Man's downfall. The day when he finally and self-destructively turns his weapons against his own kind. The day of the writing in the sky, when your cities lie buried under radioactive rubble! When the sea is a dead sea, and the land is a wasteland out of which I will lead my people from their captivity! And we shall build our own cities, in which there will be no place for humans except to serve our ends! And we shall found our own armies, our own religion, our own dynasty! And that day is upon you NOW!\nAs the apes raise their rifles to beat Breck to death, Caesar's love interest Lisa (Natalie Trundy) voices her objection, \"NO!\" She is the first ape to speak other than Caesar. Caesar reconsiders and orders the apes to lower their weapons, saying:\nBut now... now we will put away our hatred. Now we will put down our weapons. We have passed through the night of the fires, and those who were our masters are now our servants. And we, who are not human, can afford to be humane. Destiny is the will of God, and if it is Man’s destiny to be dominated, it is God’s will that he be dominated with compassion, and understanding. So, cast out your vengeance. Tonight, we have seen the birth of the Planet of the Apes!"}