{"mid": "Convoy", "IMDB_id": "tt0077369", "title": "Convoy", "plot": "In the Arizona desert, truck driver Martin \"Rubber Duck\" Penwald is passed by a woman in a Jaguar E-Type, which leads to an encounter with a sheriff's deputy. Proceeding on his way, Rubber Duck runs into fellow truck drivers Pig Pen/Love Machine and Spider Mike, when another \"trucker\" informs them over the C.B. that they are okay to increase their speed. The \"trucker\" turns out to be Sheriff \"Dirty Lyle\" Wallace, a long-time nemesis of the Duck, who extorts them for $50 each.\nThe truckers head on to Rafael's Glide-In where the Duck's sometime girlfriend, Violet, works as a waitress. Melissa, the driver of the Jaguar, is also there; the car broke down and she had to sell it and some of her belongings in an effort to leave Arizona, as she's due in Dallas for a job. The Duck offers Melissa a ride; Violet is unimpressed and ushers him away to give him a special birthday present. While away, Wallace shows up at the Glide-In checking plates. Pig Pen and Spider Mike start making fun of Wallace over the diner's base-station CB radio, leading to Wallace attempting to arrest Spider Mike for \"vagrancy\".\nThe Duck, having been warned by Widow Woman, enters and tries to smooth things over. But Lyle is determined, insulting Mike who is desperate to get home to his pregnant wife. Mike punches Wallace, leading to a brawl in the diner when some deputies arrive to assist Wallace. The assorted truckers prevail, and the Duck handcuffs Wallace to a bar stool. After pulling the spark plug wires and distributor caps out of the police cars, they all decide to head for the state line to avoid prosecution.\nThe truckers drive across Arizona and New Mexico, with Wallace in belated pursuit. The initial police pursuit is foiled when Duck leads the truckers off the main highway and down a rough dusty desert trail, causing several of the police cars to crash. Wallace commandeers the vehicle of one of the state troopers, but is also thwarted when Pig Pen and Spider Mike crush his vehicle between their rigs while in motion. Additional independent truckers join them to form a mile-long convoy in support of the Rubber Duck's vendetta against the abusive Wallace. The truckers communicate with each other via CB radio, and much CB jargon is sprinkled throughout the film. As the rebellious truckers evade and confront the police, Rubber Duck becomes a reluctant folk hero.\nIt becomes apparent the truckers have a great deal of political support and the Governor of New Mexico, Jerry Haskins, meets Rubber Duck. At about the same time, Wallace and a brutal Alvarez, Texas, sheriff, arrest Spider Mike, who left the convoy to be with his wife after giving birth to their son. Wallace's plan is to use Mike as \"bait\" to trap Rubber Duck. A janitor at the jail, aware of the plan, messages by CB radio that Spider Mike has been arrested and beaten. Various truckers relay the message to New Mexico.\nRubber Duck ends the meeting with Haskins and leaves to rescue Spider Mike. Several other truckers join him and head east to Texas. The truckers eventually destroy half of the town and the jail and rescue Spider Mike. Knowing they will now be hunted by the authorities, the truckers head for the border of Mexico. On the way, Rubber Duck gets separated from the rest of the convoy when the others get stopped by a traffic accident. The film culminates with a showdown near the United States-Mexico border where Rubber Duck is forced to face Wallace and a National Guard unit stationed on a bridge. Firing a machine gun, Wallace and the Guardsmen cause the truck's tanker trailer to explode, while Rubber Duck deliberately steers the tractor unit over the side of the bridge, plummeting into the churning river below, sending Duck presumably to his death.\nA public funeral is held for Rubber Duck, in which Haskins promises to work for the truckers by taking their case to Washington, D.C. Disgusted with the politics of the situation, Pig Pen abruptly leaves the funeral. A distraught Melissa is led to a school bus with several \"long-haired friends of Jesus\" inside. There she finds Rubber Duck in disguise sitting in the back. He asks, \"You ever seen a duck that couldn't swim?\" The convoy takes to the road with the coffin in tow, abruptly ending the politicians' speeches. As the bus passes Wallace, he spies the Duck and bursts into laughter."}