{"mid": "Coonskin", "IMDB_id": "tt0071361", "title": "Coonskin", "plot": "In the South, Sampson and the local Preacherman plan to bust out their friend Randy from prison. As they rush to the prison, the two are stopped by a roadblock and have a shootout with the police. Meanwhile, Randy and another cellmate named Pappy escape from inside the prison and wait for Sampson and the Preacherman to help them get out. While waiting for them, Randy unwillingly listens to Pappy tell a story about three guys that resemble Randy and his friends. Pappy's story is told in animation set against live-action background photos and footage.\nBrother Rabbit, Brother Bear, and Preacher Fox are forced to pack up and leave their Southern settings after the bank mortgages their home and sells it to a man who turns it into a brothel. The trio moves to Harlem, \"home to every black man\". When they arrive, Rabbit, Bear, and Fox find that it is not all that it is made out to be. They encounter a con man named Simple Savior, a phony revolutionary leader who claims to be the cousin of \"Black Jesus\", and that he gives his followers \"the strength to kill whites\". In a flashy stage performance in his \"church\", Savior acts out being brutalized by symbols of black oppression—represented by images of John Wayne, Elvis Presley, and Richard Nixon, before asking his parishioners for \"donations\". Rabbit and his friends quickly realize Savior's \"revolution\" is merely a money making scam. Rabbit openly steals a large portion of the donation money, prompting Savior to try to have him killed. After Rabbit tricks his would-be murderers (in a paraphrasing of the story of Br'er Rabbit and the briar patch), he and Bear kill Savior. This allows Rabbit to take over Savior's racket, putting him in line to become the head of all organized crime in Harlem. Rabbit lays out his plan to keep all organized crime money in Harlem. But first, he has to get rid of a few other opponents. Savior's former partners tell Rabbit they will join him but only if he can kill his opponents, otherwise they will kill him instead.\nRabbit first goes up against Madigan, a virulently racist and homophobic white police officer and bagman for the Mafia, who demonstrates his contempt for African Americans in various ways, including a refusal to bathe before an anticipated encounter with them (he believes they're not worth it). When Madigan finds out that Rabbit has been taking his payoffs, he and his cohorts, Ruby and Bobby, are led to a nightclub called \"The Cottontail\". A black stripper distracts him while an LSD sugar cube is dropped into his drink. Madigan, while under the influence of his spiked drink, is then maneuvered into a sexual liaison with a stereotypically effeminate gay man, and then shoved into women's clothing representative of the mammy archetype, adorned in blackface, and shoved out the back of the club where he discovers that Ruby and Bobby are dead. While recovering from being drugged, he fires his gun randomly, and is shot to death by the police after shooting one of them.\nRabbit's final target is the Godfather who lives in the subway with his wife and his cross-dressing, gay (and possibly incestuous) sons. The contract for killing Rabbit is given to his only straight son Sonny. Arriving outside Rabbit's nightclub in blackface and clothing representative of minstrel show stereotypes, Sonny is shot multiple times by Rabbit before dying in an explosion caused by a car crash. His body is cremated and taken back home, where his mother weeps over his ashes. Also during the shootout with Sonny, Bear defends Rabbit and is shot several times. Rabbit helps an injured Bear to safety. During his recovery, Bear becomes torn between staying with Rabbit or starting a new crime-free life. Bear decides to look for Fox in order to seek his advice. Upon arriving at Fox's newly acquired brothel, Bear is \"married\" to a girl he, Fox, and Rabbit met during the fight with Savior's men. Under the advisement of Fox, Bear becomes a boxer for the Mafia. During one of Bear's fights, Rabbit sets up a melting imitation of himself made out of tar. As the Mafiosos take turns stabbing at the \"tar rabbit\", they become stuck together. Rabbit leaves a bomb next to them and then he, Bear, Fox, and the opponent boxer rush out of the boxing arena as it blows up.\nThe live-action story ends with Randy and Pappy escaping from the prison while being shot at by various white cops, but managing to make it out alive.\nThe main plot of the film is interspersed with animated vignettes depicting a white, blond, large-breasted Miss America who serves as a personification of the United States. In each of these short scenes, she seduces a black man (meant to depict the African-American populace), only to instead beat or kill him."}