{"mid": "Cooties", "IMDB_id": "tt2490326", "title": "Cooties", "plot": "In the township of Ft. Chicken, Illinois, a fourth grade student at Ft. Chicken Elementary, Shelly Linker (Sunny May Allison), consumes a tainted mutant black-dotted chicken nugget. Elsewhere, wannabe horror writer Clint Hadson (Elijah Wood) substitutes at Ft. Chicken Elementary, where he reunites with his former high school crush, Lucy McCormick, (Alison Pill), but discovers she is dating Wade Johnson (Rainn Wilson), the PE teacher.\nDuring class, Shelly, who had been experiencing numerous symptoms, brutally attacks her classmate, Patriot (Cooper Roth) after he tugs on one of her pigtails only to have it torn out of her scalp. She bites his cheek, infecting him with the virus; she also claws Clint, but he appears to show no symptoms. Though she tries to escape the school ground before she fully turns, Shelly turns feral and passes the virus to Dink (Miles Elliot), another bully, who spreads the virus throughout the playground by scraching the rest of the children, resulting in the other children becoming infected and attacking the school staff; Mr. Pederson, Miss Nash, Mrs. Gordon, Nurse Rhonda, Vice Principal Simms and Mr. Henderson are all killed by the children. The few surviving staff members, consisting of Clint, Lucy, Wade, Tracy Lacey (Jack McBrayer), Rebbekah Halverson (Nasim Pedrad), Doug (Leigh Whannell), and Mrs. Birk (Tammie Baird), hide in the faculty lounge but are attacked by Patriot who tackles Mrs. Birk into a cupboard and mauls her to death (Tracy, apparently unaware of her real name, screams \"Who is that lady?!\" when this happens).\nAfter escaping with an uninfected student, Calvin which they find him in the library studying for his test, the staff barricade themselves in the music room, but are discovered by Shelly. A police officer (Matt Jones) arrives at the scene to calm down the children, not realizing that they are beyond help, but has two fingers bitten off and is then mauled by Shelly as she escapes the playground and hides in his car. Wade notices Clint has been infected by Shelly and quarantines him and they see that Clint is severely vomiting , but Doug deduces that the virus doesn't affect him like it does the children. The staff decide to wait until the parents arrive to pick up the children, but this plan fails when Racer Dopkins, son of the local PTA president, infects his baby brother and the zombified baby attacks and kills his oblivious mother. They manage to rescue another child, Tamra (Morgan Lily) by pulling on Tracey on the leg to escape the zombified kids, but discover she has also been infected.\nThe staff are attacked by the children again, and Wade kills Dink by beating him to death with a fire extinguisher. Doug analyzes his brain, which has turned black and rotten due to decomposition, and realizes that the virus is only dangerous to the prepubescent (not going through puberty), which is why Clint and Tamra didn't turn feral as they had passed that stage. The staff and uninfected children unite with the janitor Mr. Hitachi (Peter Kwong), but Calvin passes out due to diabetic shock. The group opts to send Clint through the ventilation system to gather a chocolate bar for Calvin, Wade's truck keys, and their cellphones. Lucy joins Clint and the two confess their feelings to each other while trapped in the library. Wade also apologizes for his behavior over a walky-talky. Though they discover the cellphones to have been destroyed by Patriot, they manage to secure a chocolate bar and revive Calvin. The group then reunites after Clint knocks out several children with drugs and, utilizing various tools in the school as weapons, battles the children on the playground and manages to escape. However, Mr. Hitachi and Wade are seemingly killed by the children.\nAfter killing a stowaway Patriot by crushing him against a tree, the group arrive in the nearby town of Danville, only to discover it has been similarly overrun by the infected children. The group realizes that the infection has spread across the United States, with schools burning to the ground and reports of violence and destruction caused by children, and they are attacked by a horde of infected children. They barricade themselves inside a funhouse and manage to retrieve a chicken nugget contaminated with the virus, which Doug will use to possibly make a vaccination for the virus, but discover that the infected children, including Shelly, are inside the funhouse. However, Wade and Mr. Hitachi arrive and rescue the group, setting the infected children on fire with gasoline. They then escape in crossing guard Rick's (Jorge Garcia) van, driving out of the town to \"someplace kids don't wanna go\". They are briefly pursued by a flaming Shelly, but she falls down and burns to death.\nIn the post-credits scene, the janitor is shown sitting down, wielding a machete and finishes the frog and caterpillar story.\nAlternate Ending\nAfter killing Patriot, they realize they are out of gas. They venture on foot and eventually find a deserted campsite. They enjoy themselves. Clint throws his novel in the fire and tells Lucy that he is not a writer and says he is actually a teacher, living in Fort Chicken. Clint has a strong feeling of dread and tells the others to join him. They find the leader's dead body, and the other infected children find them. Then you see infected Boy Scouts, led by Shelly, looking even worse than ever; her eyes are hollow black with more blisters. It's unknown what happened to everyone after the encounter.\nCarnival music begins playing as three managers from an amusement park, a theater and a family fun center, respectively, get the chicken nugget boxes out of a truck carrying them. Because this ending was never shown, it is possible that the nuggets were also infected with the virus and is responsible for the outbreak."}