{"mid": "CopCar", "IMDB_id": "tt3813310", "title": "Cop Car", "plot": "Two young boys, Travis and Harrison, are walking through a field. Cursing as they walk, they come to a barbed wire fence and take turns climbing through it. While continuing their walk they come across a cop car in a lightly wooded area. Travis dares Harrison to touch the cop car. He refuses, so Travis touches it first, saying that if he does it so does Harrison. After realizing that there’s nobody around, the boys try opening the doors. Harrison finds that the driver's side door is open and Travis hops in. The boys play around in the car until Travis hits the visor and the car keys fall into his lap. He starts the car and the boys both hop out and hide behind some bushes. After a few seconds Travis gets back in the car and puts it into drive. Harrison hops in and they take off, driving wildly through the open field.\nThe next scene takes place earlier: a cop car pulls up and we see Sheriff Kretzer (Kevin Bacon) get out of the car. He takes a sip of root beer before placing it on the hood of his car. He removes some of his uniform and grabs a bag from the back seat. We see him lay a tarp on the ground and he pulls a body from the trunk. Kretzer struggles to drag the body deeper into the wooded area and stops when he realizes that one of the shoes fell off the foot of the corpse. After finding the shoe again, he drops the body into a hole before emptying a bag of quicklime into the hole. He starts walking back towards his car only to realize it is no longer there. Kretzer makes a call to the police station, telling the dispatcher his radio is down and he can be reached on his cell.\nHarrison starts playing with the radio before asking Travis for a chance to drive. They come to a locked gate that Harrison uses the car to break through. Travis tries to get Harrison to go as fast as they can before he jumps into the driver's seat himself. They drive off, just missing a woman driving in an oncoming lane.\nKretzer runs towards a trailer park where he steals a car. After driving through town he gets pulled over by a cop on a motorcycle. He calls in a fake robbery nearby and the motorcycle cop responds to the call, leaving him free to leave. He gets a call from dispatch informing him of a report of a stolen sheriff's car and tells dispatch to ignore the report. After getting the other officers to switch their radio to a different channel, he uses the old channel to call the boys, but they do not answer. They are running in a field playing with Kretzer's weapons and gear found in the back seat. The boys hear someone screaming from the trunk of the car and open it to see a man covered in blood. He pleads with them to help him saying the cop is the bad guy. After being unable to talk with the boys, Kretzer dumps bags of cocaine in the toilet. He hears a voice on the radio and runs out to talk to one of the boys to find out where they are.\nThe man from the trunk has put the boys in the back seat and tries to find a hiding spot before jumping back in the cop car and driving up the road. He threatens the boys, telling them not to tell the man who owns the car where he is hiding. Kretzer shows up in his truck and slowly walks towards the car. While talking to the boys he senses something is not right and ducks behind the car.\nThe woman that the boys almost hit shows up and walks towards the car, screaming at the boys. She sees Kretzer, who claims to be injured and asks her to look for his keys (in the direction where he suspects the man is hiding). The woman spots the man from the trunk and a gun fight erupts after he shoots the woman. Both the sheriff and the man from the trunk shoot each other. After several tries, the boys manage to escape the car by shooting out the window. Travis has been hit by one of the earlier ricochets, so Harrison gets in the driver's seat and drives away with Travis in the back.\nThe sheriff awakens and enters his truck. He taunts the boys on the radio while chasing them and tries to run them off the road. Harrison sees a cow and swerves to avoid it, while the sheriff drives straight into it. Having finally stopped the sheriff, Harrison continues driving toward town with a possibly dying Travis, when Harrison receives a radio call from dispatch and replies, leaving their fates ambiguous."}