{"mid": "Coriolanus", "IMDB_id": "tt1372686", "title": "Coriolanus", "plot": "The play opens in Rome shortly after the expulsion of the Tarquin kings. There are riots in progress, after stores of grain were withheld from ordinary citizens. The rioters are particularly angry at Caius Marcius, a brilliant Roman general whom they blame for the grain being taken away. The rioters encounter a patrician named Menenius Agrippa, as well as Caius Marcius himself. Menenius tries to calm the rioters, while Marcius is openly contemptuous, and says that the plebeians were not worthy of the grain because of their lack of military service. Two of the tribunes of Rome, Brutus and Sicinius, privately denounce Marcius. He leaves Rome after news arrives that a Volscian army is in the field.\nThe commander of the Volscian army, Tullus Aufidius, has fought Marcius on several occasions and considers him a blood enemy. The Roman army is commanded by Cominius, with Marcius as his deputy. While Cominius takes his soldiers to meet Aufidius' army, Marcius leads a rally against the Volscian city of Corioli. The siege of Corioli is initially unsuccessful, but Marcius is able to force open the gates of the city, and the Romans conquer it. Even though he is exhausted from the fighting, Marcius marches quickly to join Cominius and fight the other Volscian force. Marcius and Aufidius meet in single combat, which only ends when Aufidius' own soldiers drag him away from the battle.\nIn recognition of his great courage, Cominius gives Caius Marcius the agnomen, or \"official nickname\", of Coriolanus. When they return to Rome, Coriolanus's mother Volumnia encourages her son to run for consul. Coriolanus is hesitant to do this, but he bows to his mother's wishes. He effortlessly wins the support of the Roman Senate, and seems at first to have won over the commoners as well. However, Brutus and Sicinius scheme to undo Coriolanus and whip up another riot in opposition to his becoming consul. Faced with this opposition, Coriolanus flies into a rage and rails against the concept of popular rule. He compares allowing plebeians to have power over the patricians to allowing \"crows to peck the eagles\". The two tribunes condemn Coriolanus as a traitor for his words, and order him to be banished. Coriolanus retorts that it is he who banishes Rome from his presence.\nAfter being exiled from Rome, Coriolanus seeks out Aufidius in the Volscian capital of Antium, and offers to let Aufidius kill him in order to spite the country that banished him. Moved by his plight and honoured to fight alongside the great general, Aufidius and his superiors embrace Coriolanus, and allow him to lead a new assault on Rome.\nRome, in its panic, tries desperately to persuade Coriolanus to halt his crusade for vengeance, but both Cominius and Menenius fail. Finally, Volumnia is sent to meet her son, along with Coriolanus's wife Virgilia and child, and a chaste gentlewoman Valeria. Volumnia succeeds in dissuading her son from destroying Rome, and Coriolanus instead concludes a peace treaty between the Volscians and the Romans. When Coriolanus returns to the Volscian capital, conspirators, organised by Aufidius, kill him for his betrayal."}