{"mid": "Cornered", "IMDB_id": "tt1323592", "title": "Cornered", "plot": "Death works in mysterious ways.Some reach their end peacefully.Others die horribly, in a frantic fight for survival.  Cornered is a suspense driven thriller set in present day Los Angeles.The pace of the film is swift. The plot is drenched in tension.It is fueled by witty dialogue, and hip connotations.  THE PLAYERS  ALEX BRANT...is a LAPD homicide detective. He is mindful and aggressive. His assertive nature allows him to easily navigate thru the darkness of murder in Los Angeles.  DAVE CARLIN...is an arson investigator, and forensics specialist.  THE STRANGER...is our killer. The man is a military trained, special operative, who has gone rogue. His style and motivation are steeped is psychosis. He is a killer of both premeditation and impulse. Plain old murder is a bore to him. The Stranger is addicted to combat and violence. His favorite kill is an elaborate game where he and his prey fight to the death.JANETTE...is a music industry entrepreneur. She runs her own record label and manages many bands. She is the strangers next opponent in the game.  COMMANDER BAKER...is with a special branch of Military Internal Affairs. He is investigating the theft of a highly classified explosive compound.  THE RUNDOWN...Inspector Carlin is investigating a crime scene containing a dead girl, a gun, and a burnt down house. He calls Brant for a second opinion on a potential link to another case of the same definition. Carlin, and Brant agree to keep certain evidence to themselves until they can make the connection. Baker knows they're up to something, and in an attempt to cover the source of this whole mess up, tries to shake them off the case. A fist fight starts a chain reaction which brings these characters together, and plunges Janette into the game THE GAME - Janette vs. The Stranger -Location...Janettes house -All exits are rigged with explosives, there is only one safe way out. -The Stranger will give clues to the correct exit as the fight goes on -The power to the house has been cut -He has given her  a gun with two rounds in it, a low powered flashlight, and a knife -The entire house will explode in 45 minutes -the stranger can only try to kill her in the last ten minutes...before that he may only defend himself. -He has only a knife   To survive, Janette must kill the Stranger, but not before she decodes his clues to find the exit. Brant, Carlin and Baker will jockey for position and jurisdiction, as they race to find the Stranger, and save Jannette,"}