{"mid": "Cosmopolis", "IMDB_id": "tt1480656", "title": "Cosmopolis", "plot": "Twenty-eight-year-old billionaire currency speculator/asset manager Eric Packer rides slowly across Manhattan amid traffic jams, in his state-of-the-art luxury stretch limousine office, to his preferred barber. Various visitors discuss the meaning of life and inconsequential trivia. The traffic jams are caused by a visit of the President of the United States and the funeral of Eric's favorite musician, a rap artist whose music he plays in one of his two private elevators. Despite devastating currency speculation losses over the course of the day, Packer fantasizes about buying the Rothko Chapel.\nHe meets his wife, Elise, in her taxi, for coffee, in a bookstore, as well as outside a theater. She declines sex with him. Packer has sex with two other women. When after a day of poor trading he destroys a large part of his wealth, his wife takes this as a reason to dissolve their union.\nAnti-capitalist activists demonstrate on the street. They wave rats and declare \"A spectre is haunting the world: the spectre of capitalism\". They spray-paint Packer's limo and later one subjects him to a pieing. Packer learns that an assassin is out to kill him, but seems curiously uninterested in who the person might be.\nIn his car, his doctor performs his daily medical checkup. Eric worries about the doctor's finding that he has an asymmetrical prostate. As the currency speculation wipes out most of his fortune, Eric's world begins to disintegrate. Eventually he kills his bodyguard. At the destination, the barber, who knew his father, cuts Eric's hair on one side. The barber and limo driver discuss their respective careers driving cabs. The barber gives Eric his gun because he had thrown away the bodyguard's gun.\nEric follows a path of further self-destruction, visiting his potential murderer, former employee Richard Sheets a.k.a. Benno Levin. Eric seems ready to commit suicide, but instead deliberately shoots himself in the hand. Sheets/Levin, who feels adrift in the capitalist system, explains that Eric's mistake in speculating was looking for perfect symmetry and patterns in the currency market: he should have looked for the lopsided—his body with its asymmetrical prostate was telling him this. The film ends with the potential murderer holding a gun to Eric's head threatening to kill him, but does not show a final shot. As Sheets points the gun to Eric's head, Eric seems to have overcome the fear of death and waiting for it."}