{"mid": "CountDuckula", "IMDB_id": "tt0088500", "title": "Count Duckula", "plot": "Several episodes explore the theme that each resurrection creates a new incarnation with little to no memory of its past life, the immediate past incarnation referred to as the current's \"father\". Thus, every incarnation is free to develop its own personality and pursue its own personal interests. The vampire is able to pose as a \"dreadful dynasty, the counts of Duckula\". The preceding generations included knights, sorcerers, scientists, artists, Egyptologists and even professional gamblers, all of whom are also secretly \"vicious vampire ducks\".\nHowever, as the title sequence puts it, \"the latest reincarnation did not run according to plan\". The successful conclusion of the ritual requires blood (a send-up of the Hammer Dracula films), the source of sustenance for any vampire, but Nanny accidentally substitutes tomato ketchup. Consequently, the newest version is not a blood-sucking vampire, but a vegetarian one. He is more interested in juicy carrots than hunting for victims. Igor is appalled. Even worse, his \"new\" master is obsessed with pursuing wealth and fame as an entertainer.\nThe stories often centre around Duckula's adventures in search of riches and fame, assisted by the castle's ability to teleport around the world, in one episode, to the deserts of Arabia. Another regularly occurring theme is the repeated attempt by Igor to turn Duckula into a proper vampire. Some episodes feature Duckula's nemesis Doctor Von Goosewing (based on Dr. Abraham Van Helsing, the nemesis of Dracula), a vampire hunter who blindly refuses to believe the current incarnation of Duckula is harmless. There is also an array of bizarre, often supernatural foes, from zombies to mechanical werewolves. Another feature of the show is a cuckoo clock whose bat-like Russian-accented characters come out and make jokes about the current situation (or corny jokes in general). The clock is also a vital part of the castle's travelling mechanism, and even has the ability to turn back time.\nA series of annuals and monthly comics further detailing the adventures of Count Duckula and associated characters were released throughout the time that the series originally aired and for a short time afterwards."}