{"mid": "CourageUnderFire", "IMDB_id": "tt0115956", "title": "Courage Under Fire", "plot": "While serving in the Gulf War, Lieutenant Colonel Serling (Denzel Washington) accidentally destroys one of his own tanks during a confusing night-time battle, killing his friend, Captain Boylar. The US Army covers up the details and transfers Serling to a desk job.\nLater, Serling is assigned to determine if Captain Karen Emma Walden (Meg Ryan) should be the first woman to receive a (posthumous) Medal of Honor. She was the commander of a Medevac Huey that was sent to rescue the crew of a shot-down Black Hawk. When she encountered a T-54, her crew destroyed it by dropping a fuel bladder onto the tank and igniting it with a flare gun. However, her own helicopter was shot down soon after. The two crews were unable to join forces, and when the survivors were rescued the next day, Walden was reported dead.\nSerling notices inconsistencies between the testimonies of Walden's crew. Specialist Andrew Ilario (Matt Damon), the medic, praises Walden strongly. However, Staff Sergeant John Monfriez (Lou Diamond Phillips) claims that Walden was a coward and that he led the crew in combat and improvised the fuel bladder weapon. Sergeant Altameyer, who is dying in a hospital, complains about a fire. Warrant Officer One Rady, the co-pilot, was injured early on and unconscious throughout. Furthermore, the crew of the Black Hawk claim that they heard firing from an M16, but Ilario and Monfriez deny they had one.\nUnder pressure from the White House and his commander, Brigadier General Hershberg (Michael Moriarty), to wrap things up quickly, Serling leaks the story to newspaper reporter Tony Gartner (Scott Glenn) to prevent another cover-up. When Serling grills Monfriez during a car ride, Monfriez forces him to get out of the vehicle at gunpoint, then commits suicide by driving into an oncoming train.\nSerling tracks Ilario down, and Ilario finally tells him the truth. Monfriez wanted to flee, which would mean abandoning Rady. When Walden refused, he pulled a gun on her. Walden then shot an enemy who appeared behind Monfriez, but Monfriez thought Walden was firing at him and shot her in the stomach, before backing off. The next morning, the enemy attacked again as a rescue party approached. Walden covered her men's retreat, firing an M16. However, Monfriez told the rescuers that Walden was dead, so they left without her. Napalm was then dropped on the entire area. Altameyer tried to expose Monfriez's lie at the time, but was too injured to speak, and Ilario was too scared of the court-martial Walden had threatened them with and remained silent.\nSerling presents his final report to Hershberg. Walden's young daughter receives the Medal of Honor at a White House ceremony. Later, Serling tells the truth to the Boylars about the manner of their son's death and says he cannot ask for forgiveness. The Boylars tell Serling he must put down the burden at some point and grant him their forgiveness.\nIn the last moments, Serling has a flashback of when he was standing by Boylar's destroyed tank and a medevac Huey was lifting off with his friend's body. Serling suddenly realises Walden was the Huey pilot."}