{"mid": "CrimesAndMisdemeanors", "IMDB_id": "tt0097123", "title": "Crimes and Misdemeanors", "plot": "The story follows two main characters: Judah Rosenthal (Martin Landau), a successful ophthalmologist, and Clifford Stern (Woody Allen), a small-time documentary filmmaker.\nJudah, a respectable family man, is having an affair with flight attendant Dolores Paley (Anjelica Huston). After it becomes clear to her that Judah will not end his marriage, Dolores, scorned, threatens to inform his wife of their affair. Dolores's letter to Miriam is intercepted and destroyed by Judah, but she sustains the pressure on him with threats of revelation. She is also aware of some questionable financial deals Judah has made, which adds to his stress. He confides in a patient, Ben (Sam Waterston), a rabbi who is rapidly losing his eyesight. Ben advises openness and honesty between Judah and his wife, but Judah does not wish to imperil his marriage. Desperate, Judah turns to his brother, Jack (Jerry Orbach), who hires a hitman to kill Dolores. Before her corpse is discovered, Judah retrieves letters and other items from her apartment (where he sees her bloody corpse) in order to cover his tracks. Stricken with guilt, Judah turns to the religious teachings he had rejected, believing for the first time that a just God is watching him and passing judgment.\nCliff, meanwhile, has been hired by his pompous brother-in-law, Lester (Alan Alda), a successful television producer, to make a documentary celebrating Lester's life and work. Cliff grows to despise him. While filming and mocking the subject, Cliff falls in love with Lester's associate producer, Halley Reed (Mia Farrow). Despondent over his failing marriage to Lester's sister Wendy (Joanna Gleason), he woos Halley, showing her footage from his ongoing documentary about Prof. Louis Levy (psychologist Martin S. Bergmann), a renowned philosopher. He makes sure Halley is aware that he is shooting Lester's documentary merely for the money so he can finish his more meaningful project with Levy.\nCliff's dislike for Lester becomes evident during the first screening of the film. It juxtaposes footage of Lester with clownish poses of Benito Mussolini addressing a throng of supporters from a balcony. It also shows Lester yelling at his employees and clumsily making a pass at an attractive young actress. Cliff learns that Professor Levy, whom he had been profiling on the strength of his celebration of life, has committed suicide, leaving a curt note, \"I've gone out the window.\" When Halley visits to comfort him, he makes a pass at her, which she gently rebuffs, telling him she isn't ready for another romance.\nAdding to Cliff's burdens, Halley leaves for London, where Lester is offering her a producing job; when she returns several months later, Cliff is astounded to discover that she and Lester are engaged. Hearing that Lester sent Halley white roses \"round the clock, for days\" while they were in London, Cliff is crestfallen as he realizes he is incapable of that kind of ostentatious display. His last romantic gesture to Halley had been a love letter which, he admits with humor, he had mostly plagiarized from James Joyce.\nIn the final scene, Judah and Cliff meet by happenstance at the wedding of the daughter of rabbi Ben, who is Cliff's brother-in-law and Judah's patient. Judah has worked through his guilt and is enjoying life once more; the murder had been blamed on a drifter with a criminal record. He draws Cliff into a supposedly hypothetical discussion that draws upon his moral quandary. Judah says that with time, any crisis will pass; but Cliff morosely claims instead that one is forever fated to bear one's burdens for \"crimes and misdemeanors\". Judah cheerfully leaves the wedding party with his wife, and Cliff is left sitting alone, dejected. Ben the rabbi, who is now blind, shares a dance with his daughter while the voice of Prof. Levy is heard, saying that the universe is a dark and indifferent place which human beings fill with love, in the hope that it will give the void a meaning."}