{"mid": "CriminallyInsane", "IMDB_id": "tt0072831", "title": "Criminally Insane", "plot": "The morbidly obese Ethel Janowski (institutionalized due to her bouts of paranoia, depression, and violence) is released into the care of her grandmother, despite Doctor Gerard's unease regarding Ethel's discharge. Upon moving into her grandmother's San Francisco home, Ethel begins consuming massive amounts of food, and repeatedly claims that the employees of the institution were trying to starve her to death. In an attempt to stop Ethel's gorging, Mrs. Janowski empties the refrigerator, and locks the cupboards. Ethel and her grandmother argue, and when the elder Janowski threatens to call the sanitarium, Ethel impales her with a knife, then mutilates the old woman's hand to get the cabinet key she was holding in a death grip.\nEthel locks her grandmother's corpse in a bedroom, and places an order for more food. When the delivery boy arrives with the groceries, Ethel is unable to pay for them, and stabs the deliverer with a broken bottle when he tries to leave with the order. After Ethel moves the boy's body, her prostitute sister, Rosalie, arrives, and announces that she will staying for a while. Ethel ignores calls from her doctor, and attempts to cover up the odor of her decaying victims when Rosalie complains about the smell coming from the locked bedroom.\nWhile at a bar one night, Rosalie runs into John, her unfaithful and abusive ex-boyfriend, and pimp. John follows Rosalie home, and manages to get on her good side, despite at one point proclaiming, \"Rosalie, I'm gonna tell you the truth for once, okay? You need a good beating every once in a while. All women do. And you especially. Okay?\" When John and Rosalie fall asleep after having sex, Doctor Gerard visits, wanting to know why Ethel has been missing her appointments with him. Ethel bludgeons the doctor with a candlestick holder, and puts his body with the others.\nThree days after the murder of the delivery boy, Detective McDonough visits to question Ethel about his disappearance, and leaves after Ethel gives a few evasive statements. That night, Rosalie and John, unable to tolerate the stink coming from Mrs. Janowski's sealed room any longer, decide to break down the door in the morning. After her sister and John go back to bed, Ethel murders them with a cleaver, laughing maniacally while doing so. Ethel sleeps with John's body (possibly having sex with it) and is then shown doing things like destroying a mannequin, and frolicking near a cemetery in garish clothing. An alcoholic client of Rosalie drops by unexpectedly, and stumbles onto his Rosalie's remains, so Ethel strangles him.\nDetective McDonough returns to re-interview Ethel, and even though Ethel gives contradictory information, the detective leaves without incident. Ethel proceeds to dismember her victims, stuff the pieces in sacks, and drive them out to a seaside area with the intent of dumping them in the ocean. Since there are too many witnesses present, Ethel is forced to return home with the bags, which she drags back into the house, forgetting to close the trunk of her car on the way in. A suspicious neighbor peers into the trunk, and calls the police after finding a severed hand in it. The film ends with Detective McDonough walking in on Ethel eating one of her grandmother's arms."}