{"mid": "CrossOfIron", "IMDB_id": "tt0074695", "title": "Cross of Iron", "plot": "The movie opens with a German children's song, \"Hänschen klein\", mixed with black-and-white footage of prewar and war scenes. It then segues to color and a German platoon raid on a Russian forward outpost led by Sergeant Rolf Steiner (James Coburn), during which his men capture a Russian boy-soldier (Slavko Štimac).\nAn aristocratic Prussian officer, Captain Stransky (Maximilian Schell), is posted as a new battalion commander in the Kuban bridgehead on the Eastern Front in 1943. Stransky proudly tells the regimental commander, Colonel Brandt (James Mason), and his adjutant, Captain Kiesel (David Warner), that he applied for transfer from occupied France to front line duty in Russia so that he can win the Iron Cross.\nWhen Stransky meets Steiner for the first time, he orders Steiner to shoot the boy prisoner in strict observance of a standing order. When Steiner refuses, Stransky prepares to shoot the boy himself, but at the last moment, Corporal Schnurrbart (Fred Stillkrauth) saves the boy by volunteering to do it. Later, Stransky informs Steiner that he has been promoted to Senior Sergeant, and is puzzled by Steiner's nonchalant response. Stransky also discovers that his adjutant, Lieutenant Triebig (Roger Fritz), is a closet homosexual after Stransky surreptitiously sees Triebig stroking the cheek of an enlisted orderly, Josef Keppler.\nWhile waiting for an anticipated attack, Steiner releases the young Russian, only to see the boy killed by advancing Soviet troops. As Stransky cowers in his bunker, Lieutenant Meyer (Igor Galo), the respected leader of Steiner's company, is killed while leading a successful counterattack. Steiner is wounded in the same battle trying to rescue a German soldier and is sent to a military hospital to recover. There, he is haunted by the faces of the dead men and the boy (in a dream sequence prior to waking from a coma), and has a romantic liaison with his nurse (Senta Berger).\nAfter he has recovered, Steiner is offered a home leave but decides instead to return to his men. When he arrives, Steiner is informed that Stransky has claimed that he, not Meyer, led the successful counterattack, and has been nominated for the Iron Cross. Stransky named as witnesses Triebig (blackmailing him with his homosexuality), and Steiner. Stransky tries to persuade Steiner to corroborate his claim by promising to look after him after the war. Brandt questions Steiner in the hope that he will expose Stransky's lies, but Steiner only states that he hates all officers, even those as \"enlightened\" as Brandt and Kiesel, and requests a few days to ponder his answer.\nWhen his battalion is ordered to retreat, Stransky does not notify Steiner's platoon, abandoning them. Making their way back through now enemy territory, the men capture an all-female Russian detachment. While Steiner is busy, Zoll (Arthur Brauss), a despised Nazi Party member, takes one of the women into the barn to rape her. She bites off his genitals and he kills her. Meanwhile, young Dietz, left to guard the rest of the women alone, is distracted and killed as well. Disgusted, Steiner locks Zoll up with the vengeful Russian women, taking their uniforms to use as a disguise.\nAs the men near the German lines, they radio ahead to avoid friendly fire. Stransky suggests to Triebig that Steiner and his men be 'mistaken' for Russians. Triebig orders his men to shoot the incoming Germans; only Steiner, Krüger and Anselm survive. Triebig denies responsibility, but Steiner kills him and goes looking for Stransky.\nAt this moment, the Soviets launch a major assault. Brandt orders Kiesel to be evacuated, telling him that men like him will be needed to rebuild Germany after the war. Brandt then rallies the fleeing troops for a counterattack. The same children's song plays again, until the final credits.\nSteiner confronts Stransky and, instead of killing him, offers him a weapon in order to see \"where the crosses of iron grow\". Stransky accepts Steiner's \"challenge\", and they head off together for the battle. The film closes with Stransky trying to figure out how to reload his MP40, while being shot at by an adolescent Russian soldier who resembles the boy-soldier released by Steiner. When Stransky asks Steiner for help, Steiner begins to laugh. The laughter continues through the credits and pictures of civilian victims from World War II and later conflicts."}