{"mid": "CrossFire", "IMDB_id": "tt0023921", "title": "Cross Fire", "plot": "Psychotic former FBI agent and serial killer Kyle Craig, who escaped from ADX Florence Supermax Prison in Double Cross after killing several people in that book, as well as Roses Are Red and Violets Are Blue, awaits FBI agent Max Siegel. After questioning him, he reveals he plans to get plastic surgery and thus become Max Siegel by gaining his physical features; he then kills Siegel. Meanwhile, back in Washington, D.C., psychologist and Metro police detective Alex Cross has proposed to his girlfriend, Brianna 'Bree' Stone, and the two are currently planning their wedding. However, they must pause the planning for another time as Alex is called in to a sniper case. At the crime scene, two infamous people (known to be political) are murdered. Alex instantly recognizes it as a sniper when all others are oblivious to this at first - that is, until agent Max Siegel/Kyle Craig comes and meets Cross, who is instantly annoyed by – and dislikes – Siegel. Craig wants Alex dead for sending Kyle into prison years earlier, as well as a few novels back. Meanwhile, Alex's best and closest friend, John Sampson, asks for Alex's assistance in a series of murders with numbers on the victims' faces.\nMitch and Denny, the murderers in the sniper case, strike again. Unknown to Mitch, they work for a rich man, who will pay Denny and Mitch. The two live in a suburban or alternatively live in a homeless shelter. After two other sniper murders, Alex figures out the killers use a white suburban and starts a search on it. Kyle Craig/Max Siegel has sex with a hooker and kills her; he later murders a woman from the FBI that Alex knew from the DCAK case (in Double Cross) and deposits her body with random murders, implying he is the number-serial-killer. However, he is later revealed to not be. Denny and Mitch later steal a computer from two teenagers, and write a message via email to the Washington newspaper. The newspaper company soon learns of and reads it, but the cops come to investigate. Cross questions the chief in staff, and reads the e-mail, and later learns of the murderers' names from the woman/head in staff. Meanwhile, Mitch and Denny visit Mitch's ex-wife, who does not let see their child/daughter see their father. Mitch gives her a thousand dollars to make up for child care. They then go visit Mitch's mother; her husband (Mitch's father) died two years ago, at which time Mitch left. The two eat dinner at Mitch's mother's house, and flee. However, before leaving, Denny kills Mitch's mom, unbeknownst to Mitch.\nMeanwhile, coming back to see the chief in staff at her office at the newspaper building, she reveals that Denny and Mitch live at a few shelters. Max Siegel, Sampson, and Alex go and look for the two at numerous shelters, and find a homeless suspicious man, who flees after they question him. Sampson and Alex chase him, and discover that the man may be involved in the numerical numbers case. Alex finds a knife in the Man's jacket and tells Sampson to chase after him. Sampson follows him, but loses him. Meanwhile, at a computer base system Alex finds out the Man's name is Sajiwa, that he has a criminal record, that he used to teach math and other things like the numbers on the victim's faces. When looking for him later, Alex and Sampson learn that Sajiwa has been killed by Kyle.\nDenny and Mitch dump the Suburban in water, because earlier they had been seemingly 'suspicious' to police officers at a border and escape in another vehicle. Later, they commit their final sniper murder, from afar at a museum, on a political famous person who messed up. The mess-up caused his company to get closed down and caused thousands of people to be out of work and into unemployment . When leaving, Denny kills Mitch, citing it as \"just business\". The next day, Alex is at the scene and tries to figure out where the sniper shot. He goes to the museum, and finds Mitch's body. When looking for Denny, Alex finds Denny, who corners Alex, and forces Alex to throw away his Glock. Before Denny can kill Alex, Siegel shoots and kills Denny, who earlier killed his former (sniper-hit-list) employer. Alex and Siegel finally become actual friends, with Alex thanking Siegel.\nWith the sniper case having come to an end, Bree and Alex finally get married. Upon arriving at their hotel room - with the Cross family. Bree and Alex spend the night alone together, and make love. However, the next day Siegel comes for a visit, unbeknownst to Alex, who receives a phone call from Kyle Craig. Craig - without saying it - implies that he is Max Siegel. Alex and Bree soon figure it out, and upon trying to stop Craig, Alex chases Kyle and they start fighting. Alex overpowers him, and shoots him in both the legs, making Craig handicapped. Paramedics and two cops come. While Craig is being taken away, he grabs a cop's gun and shoots his oxygen tank in the paramedics' vehicle, blowing up the vehicle, killing the paramedics, Craig, and the two cops. Alex is sort of glad that Kyle is dead, deciding he may write a novel based on his and Craig's adventures in friendship into enemies, and Craig's final stand (which ultimately led to his death). Alex and Bree then go on and continue their honeymoon, finally at peace.\nnotes:\nfor their first part of their honeymoon, Bree and Alex go to stay at a hotel seen in the James Bond film Casino Royale; this is probably because Alex likes the British character James Bond.\nKyle Craig is believed to be completely psychotic, and near the end of the novel, when they are taking him to a gurney in a paramedics' vehicle (of whom, Alex will inevitably go back to the ADX Florence Supermax prison that he hates), he possibly decides to kill himself.\n=== Plot summary ===\nThis book has two intertwined plots. The primary one involves a series of sniper murders of high-profile persons. Detective Alex Cross and Bree Stone are planning their wedding, but must put their wedding plans on hold to investigate the few clues of the first set of murders and then try to find the perpetrators as more murders are committed. The second plot involves Kyle Craig, a former FBI agent turned into a psychopathic killer (The Mastermind: see previous novels Roses are Red and Violets are Blue). The readers at the novel's start are shown how Craig kills a person, so he can, through plastic surgery, assume his identity and move undetected to Cross. Since Cross helped put Craig into Federal Prison, Craig wants to kill Cross. Craig had escaped from Florence Supermax prison in a previous Cross novel, Double Cross. Meanwhile, the FBI is involved with the sniper case and agent Max Siegel has been assigned to the case. Cross and Siegel do not mix well. Siegel makes amends with Cross, even saving Cross's life. However, Siegel has some very shocking surprises for Alex Cross and Bree Stone."}