{"mid": "CruelIntentions2", "IMDB_id": "tt0196267", "title": "Cruel Intentions 2", "plot": "Meet Sebastian Valmont (Robin Dunne), who just got kicked out of his old high school from his Principal. His Principal, Mr. Freeman vows to Sebastian, with a file like that he will never get into a new school. Sebastian comments on Mr. Freeman's wife, and asks him how she is doing. Mr. Freeman tells Sebastian, she is fine, and sends him off. Mr. Freeman immediately gets a phone call from Mrs. Freeman and tells him to turn to one of the pages in the year book. Apparently Sebastian's goodbye present was a naked photo of Mrs. Freeman published in the yearbook. Mr. Freeman yells at Sebastian at the window, as he catches a taxi to New York. Sebastian is ready to get a new start.Sebastian arrives in New York City and meets his new rich life, as he finds out his step mother owns a whole building. He meets up with his father, who introduces Sebastian to his step mother, Tiffany Merteuil-Valmont (Mimi Rogers). Tiffany makes a great impression after Sebastian tries to be naughty around her.Sebastian then meets Kathryn (Amy Adams), his step sister. After outdoing her with their Steinway piano, and correcting her SAT words at dinner, Sebastian has yet to see what she is capable of. While showering, Kathryn interrupts Sebastian, and makes a demand, to stay out of her way.The next morning, Sebastian and Kathryn take a limo to their exclusive prep school, Manchester Prep. Outside the Headmaster's office, Sebastian calls a girl, who is just doing some work, beautiful. She is shocked at first, but says thank you. Sebastian comments on how the Headmaster is a joke, before being called his office.Sebastian meets Headmaster Sherman who calls Sebastian's files impressive after having high marks (a 4.0 G.P.A., honor clubs, etc.) but maybe too impressive. Then the girl from the office walks in and kisses the Headmaster. Sebastian is shocked at first but he finds out that the girl is actually the Headmaster's daughter, Danielle.Meanwhile, Kathryn she finds out she has gym and ballet, the two classes she hates. She hunts down the Assistant Headmaster, Muller, and threatens to expose their love affair. He tells her he will change her schedule and she walks away like an innocent angel. Kathryn is clearly a sociopath seductress who'll do ANYTHING to get what she wants.Sebastian meets Danielle for a second time in one of his classes. When Danielle and Sebastian have a heated argument on Dr. Jekyll, and Mr. Hyde, the teacher sides with Sebastian (in a good way). After school, Sebastian catches Danielle working at a used book store and charms the owner to let Danielle off for a cup of coffee.Kathryn's activities after school do not include a job, but a club called the \"Manchester Prep Tribunal\". A secret society/social club of students where Kathryn is the leader, and they meet every afternoon after school in the attic of one of the administrations buildings where we find out that the Tribunal basically destroys lives of other students and runs the school. It's a new school year, so the Tribunal goes over all the new students. They review a girl named Cherie Clayman, and find out she is really naive and stupid, but extremely rich. Kathryn takes Cherie as her own project to turn her into the school's slut.That evening, Kathryn takes Cherie to a nightclub, and gives her Iced Teas... which are from Long Island (sound familiar?). A guy who Kathryn knows, Court Reynolds, approaches Cherie and Kathryn. Kathryn forces Cherie into the bathroom and tells Cherie that Court has an interest in her. Cherie asks what to do, and Kathryn tells her to let Court have sex with her. Cherie reveals she hasn't even kissed a guy before, but Kathryn has another idea.Back into the club, Kathryn explains to Cherie, how to kiss using Court as an example. Cherie and Court kiss, and Kathryn explains how to french kiss. Just when Cherie's lips are about to press onto Courts, the drunk Cherie vomits onto his pants. He storms off, and Cherie hugs Kathryn in disappointment.Back at their home, Sebastian talks to Danielle on the phone, surprising her, since she didn't give him her number. They talk for about an hour before he hangs up after she asks him to take it slow. Kathryn shows up and just caught the minutes before the act ended. But he reveals to Kathryn he is smarter than her, and tells her she needs to throw up after having that huge salad and kicks her out.The next morning, Sebastian is asleep when the Asian housekeeper, Min Lin leaves him a breakfast tray while he's still asleep and he knocks over the tray, spilling food all over the floor. Min Lin enters and panics, telling Sebastian not to tell anyone what happened. Apparently Min Lin is terrified her employers. While taking a shower again, Sebastian is interrupted by two brunette girls, \"kissing cousins\", who Kathryn has sent in. They reveal to him how bad the school actually is (\"If you don't snort it, SUCK it\").Back at school, we find out Kathryn isn't actually excused from ballet class from a teacher. She tries to hit on him, but it doesn't work. She storms off and the teacher notices a MALE student walking by. He starts to fix his tie...Angered by this personal setback, Kathryn goes back to the Assistant Headmaster Muller. She gives him sex, in return to take her off the gym/ballet classes for good. Of course, the Assistant Headmaster chooses to have sex with Kathryn.Meanwhile, Cherie asks Danielle to tutor her after failing a test in French. Cherie notices Danielle's and Sebastian's tension between them after he tries to be romantic with her. Sebastian gives Danielle a cell phone and kisses her when she is off guard. She gets upset and throws the cell phone at Sebastian, then storms off. Kathryn who happened to be nearby laughs at Sebastian's attempt to be romantic.That evening, Kathryn busts the servants when they are caught playing cards with Sebastian. She threatens to tell Tiffany, but Sebastian tells her no one will find out. Sebastian tells her, no wonder the servants don't get their respect because she treats them so badly. Kathryn tells him that they pay the staff for their services not for their respect. Sebastian then tells Kathryn, they are human beings. Kathryn goes off crying (after she made a remark on being a human being earlier, in a deleted scene). In a rare emotional tone, Kathryn tells Sebastian that it's hard living there, under Tiffany's standards. He asks her why she would do bad things when Tiffany is bad. They get interrupted by a phone call. Sebastian answers the phone and it's Cherie. She tells Sebastian how Danielle is crazy about him by making her \"moist\"... making her eyes moist that is. Sebastian hangs up on Cherie, and goes to Danielle who is walking off somewhere.At the Brooklyn Bridge waterfront, Danielle hears a torrid violin noise that just happened to be played by Sebastian. He asks her about why she got so upset about the kiss. Danielle tells him to be himself, and be honest. He tells her, he can't because he's scared. He's in a new city, new friends, etc. He asks her, what she is scared about. She tells him she is scared about missing her train to go home, and rushes off in a taxi.At home, Kathryn promises not to tell Tiffany about the card game to Min Lin, who accepts. Kathryn then tries to get to know Min Lin better to try to open up, and she tries to compare each other. Kathryn thinks they have a lot in common, but Min Lin brushes it off.The next day, Kathryn gloats with the rest of the Manchester Prep Tribunal about her success the night before of humiliated Cherie, she gets a loud clear message from Cherie, saying that their sleep over will work out over the weekend, after Cherie's mother wanting to talk to Kathryn's mother.After sixth period, Danielle tells Sebastian why she was upset when he kissed her. She reveals it was her first kiss. She wanted everything to be right, but was afraid to know that Sebastian had probably been with lots of girls she couldn't compare to. The bell rings and Sebastian and Danielle share a kiss before she leaves. Kathryn appears behind Sebastian and threatens him about being bored that he'll ruin the whole romance. When he threatens her back, Kathryn declares war and walks away. Sebastian agrees to war and pushes Kathryn in the mud of the school's garden.A few days later, while getting massages, Tiffany tells Kathryn about a new student, who will be her new best friend... Cherie Clayman. Kathryn hates the idea, and tells her plan about making Cherie the school slut. Tiffany tells Kathryn that she is trying to \"break them\" in for 20 million, for the new school \"Merteuil Library.\" Sebastian walks in, and tells them about his problem, failing gym because of fencing. Tiffany notices how tense Sebastian is and offers a massage. Sebastian excitedly says \"yes\", being that it's his first professional massage. Kathryn suddenly lost her urge for a massage, and offers Sebastian her spot. She says something to the blond masseuses, incorrectly saying \"tack sa mycket\" (thank you very much in Swedish), but Tiffany corrects her. Tiffany tells Kathryn, \"Don't say it, if you're not going to say it right. It only makes you look foolish.\" Kathryn leaves, and the two gorgeous women work on Sebastian's thighs as he stands close to them. To avoid getting aroused, Sebastian says \"Dead Puppies\" over and over.While lying down after his massage, Sebastian is relaxing on the table and feels someone massaging his back. He asks if it's Sonia, or Ingrid. To his surprise it's Tiffany. He starts to freak but she pushes him down. Tiffany then talks about getting to know each other better. She wants to get along with Edward, and him but it's hard for her because Edward is always working on his yacht. Tiffany is happy about Edward working on his yacht, but hints to Sebastian if he is cheating on her in any way, they will be on the street. Before leaving him, she hits Sebastian's behind.Sebastian decides to pay a visit to his father on his yacht. He walks quietly to the bedroom on the yacht but hears a couple of noises in there. He calls for his father before stepping into the room. Edward is lying on the bed, only in his underwear, with his hands above his hand, under a pillow. Sebastian starts to open the first door, saying he is looking for \"the cat.\" Edward is appalled, to think that he was cheating on Tiffany. Sebastian then opens the second door before moving towards his father. He removes the pillow and not to his surprise, Edward is hand cuffed... and behind door number three it's Lilly, Edward's \"first mate\" who is dressed in a skimpy Victoria Secret like underwear.Sebastian then tells Lilly that didn't his father promised him to sail her around the world? She tells him \"yes\", but Sebastian tells her one thing. Edward is married. Edward tries to reason with Lilly saying that his wife is old and is about to die, but Lilly doesn't buy it. She calls him a jerk and leaves. Edward asks Sebastian to hand him the keys to the hand cuffs, but Sebastian warns him, \"Don't mess it up, because it's my life too.\" (Edward took him in remember?) Sebastian teaches his father a lesson, as he throws the keys out of a window (straight in the bay) and leaves his father.On the docks, Sebastian tries to comfort Lilly, but she takes it the wrong way and kisses him after he gives her advice. He turns her down, and tells her about having a girlfriend. She understands, and he tells her about having a test in the morning and leaves.Meanwhile, Cherie and her mother, Bunny, are having a little get together in the Merteuil home. Kathryn presses on with Tiffany's charity for the school library and Tiffany explains in the rich society to get in the high standing is you need to do some charity work. While Tiffany has her head down, Edward walks in with the hand cuffs. Only Kathryn sees this, and he runs away to the kitchen. She excuses herself, and explains to Edward that they are just getting started as a family. So she gives Edward a list to make Tiffany happy (dinner, music, a ring, making love, etc.) Edward is shocked at this, but Kathryn asks, \"Who's your favorite daughter?\" He tells her, she is, and she leaves.The next day, Kathryn takes Cherie out for horse riding lessons. After great pleasure with the saddle, Cherie has an orgasm on the horse, and tells Kathryn now she knows why girls like horse riding.Meanwhile with Sebastian is out on a little date with Danielle. She teases him a bit, after saying she is tired of being the good girl. She massages his crotch, and just when she is about to go down on him (In a public park!) her phone rings. It's her father. She has to go. She leaves Sebastian, with his hard on still raging in his pants.While shopping, Kathryn gets a visit from Blaine, who apparently got Sebastian's original file back. Fast-forward to night, just when Sebastian is about to see Danielle, Kathryn walks into his room. She has almost dominatrix/leather/blackish underwear on. She asks to have him. He gives in for a moment, but resists temptation and leaves to see Danielle. Kathryn then calls Danielle...Sebastian arrives at Danielle's home, and tries to confess his love to her. She tells him no, then Kathryn walks out of Danielle's closet. We find out the good Danielle is just an act, and she is actually a bad girl all this time. Danielle and Kathryn proceeds to kiss and Danielle tells him \"If you can't beat 'em, join 'em.\" And so he does! They all have a threesome together.It's a bright new day, while riding in their limo, Sebastian opens a gift from Danielle. It's a journal... for something to write about. We then see the limo almost running over Cherie. The driver apologizes about her broken bike, and Sebastian (To our surprise, whom she forgot!) offers her a ride. The driver tosses the bike aside, and Sebastian fiddles with his new camera. He tells Cherie it's too bad she can't be sexy so he can take her picture. She replies \"I can be sexy!\" and starts to take off her coat and starts to pose for him.The limo moves on, and in the front seat, we hear Sebastian and Cherie having sex, while the creepy-looking Kathryn and Danielle sit in the front seat and listen in on them... satisfied with their evil results of corrupting him and Cherie.THE END!"}