{"mid": "CsaTheConfederateStatesOfAmerica", "IMDB_id": "tt0389828", "title": "C.S.A.: The Confederate States of America", "plot": "=== War and Rebellion ===\nIn an alternate United States history, the \"Confederate States of America\" (C.S.A.) is formed after Republican Abraham Lincoln is elected president in the 1860 election, due to fears over the dissolution of the ownership of Negroes. They engage with the Union in \"The War of Northern Aggression.\" Following the Union victory in the Battle of Antietam, President Lincoln issued a revolutionary proclamation entitled the \"Emancipation Proclamation,\" but—within this fictionalized reality—the proclamation failed.\nConfederate President Jefferson Davis took this opportunity to counteract the proclamation and send politician Judah P. Benjamin to persuade the military and financial aid of the United Kingdom and France to the Confederacy in their fight against the Union. Benjamin also promoted the \"Southern Cause of States' Rights\" which proclaims Southerners have the right to have private property, the abolition of slavery remaining unaddressed. Eventually after the success of Benjamin's gambit, the Confederates—with the aid of British and French forces—were able to win the Battle of Gettysburg, capture Washington, D.C. and take over the White House a few months later, but Lincoln escapes.\nUnion General Ulysses S. Grant surrenders to Confederate General Robert E. Lee on April 9, 1864 (exactly a year before the date of Lee's actual surrender to Grant at Appomattox), effectively ending the Civil War.\nThe hunt for the now-deposed President Lincoln (now disguised in blackface) and abolitionist Harriet Tubman is undertaken, and both are eventually captured, which became the prime subject of D. W. Griffith's fictional 1915 silent film The Hunt for Dishonest Abe, and shows a humorous reenactment of Lincoln and Tubman's failed escape attempt. Lincoln was quickly tried for war crimes against the Confederacy and was imprisoned in Fortress Monroe, Virginia, where he watched the execution of Tubman from his cell. In 1866, Lincoln—frail and gaunt from his two-year sentence—is fully pardoned by President Davis and exiled to Canada, where he remains until he dies in June 1905 at the age of 96, almost entirely forgotten in history.\nShortly before his death, Lincoln laments, in an interview, not having made the Civil War a battle to end slavery, and blames himself for it. He also hopes that the colored people of the C.S.A. will gain independence, but regrets he will not live long enough to see it happen.\n=== Reconstruction ===\nAfter the war ended, the victory of the South was the cause of immense celebration, with many plantations welcoming back the troops to a now \"blessed and triumphant\" lifestyle. After Confederate soldiers moved further east, raiding New York City and Boston, the Confederacy—with the stroke of a pen—annexes the remainder of the United States, renames the nation the \"Confederate States of America\" (C.S.A.), and abolishes all of the old American symbols and replaces them with their own: the national flag is changed from the traditional U.S. Flag to the Confederate Naval Jack flag; the Confederate States of America dollar becomes the dominant currency of the C.S.A.; and the national anthem is changed from \"The Star-Spangled Banner\" to \"Dixie\", ironically, written by a northerner named Dan Emmett.\nAfter leaving Richmond, Virginia and moving into the White House, President Davis faces difficulty in inducing the North to accept the institution of slavery, until John Ambrose Fauntroy I introduces a tax that is alleviated by the purchase of slaves, and Samuel A. Cartwright, whose theories dominate Confederate medical science, \"discovers\" a fictional disease that causes slaves to run away, and declares slaves livestock. Following the success of the new slave tax, 20,000 former U.S. citizens—most of them being Northerners (e.g., Wendell Phillips, Mark Twain, Susan B. Anthony, Henry David Thoreau, Ralph Waldo Emerson and William Lloyd Garrison, among others)—lead an exodus from the C.S.A. to Canada. Canada, along with the Russian colony of Alaska, was able to remain free from the C.S.A. and soon became home to refugee abolitionists, runaway slaves, and former citizens of the United States and, thanks to the efforts of both Garrison and Frederick Douglass in convincing the Canadian Parliament and Canadian Prime Minister John A. Macdonald to not repatriate escaped slaves, together formed an organization known as the \"National Association for the Advancement of Chattel People\" (N.A.A.C.P.). The strong hatred of the N.A.A.C.P., Canada, and the \"Red Canadian Injustice\" within the C.S.A. dates back to the end of the War of Northern Aggression and the beginning of Reconstruction for the massive loss of their slaves, who sought Canada as both freedom and asylum from the C.S.A.\nAlong with the Red Canadian Injustice, Reconstruction efforts for the C.S.A. prove to be a challenge with pioneers, gold-prospectors, the Plain Indians—which a war against them lasted almost 30 years—and the railroad expanding from the South into the Great Plains. In the 1890s, a decision is taken to enslave the West Coast Chinese migrant workers, too. In 1895, the government of the C.S.A., which does not separate the Church from the State out of fear for more foreign slaves and their religious beliefs in contrast to the C.S.A., outlaws all non-Christian religions. After much debate, the Roman Catholic Church is classified as a Christian religion. Originally, Judaism, too, is outlawed, but a dying Jefferson Davis, citing the crucial contribution of the Jewish Judah P. Benjamin, persuades Congress to allow some Jews to remain on a reservation (similar to a Native American reservation) on Long Island.\n=== A \"Splendid Little War\" ===\nBy the beginning of the 20th century, the Confederate States of America finished Reconstruction and began an expansionist campaign to claim the Western Hemisphere as part of their \"Golden Circle\", with only Alaska and Canada remaining free from being client states of the CSA. They began with Cuba, Haiti, the Dominican Republic, and the rest of the Caribbean islands during the fictionalized version of the Spanish–American War, then move on to completely annex Mexico and Central America. Following the annexation of Mexico the Confederates adopted the \"Jim Crow\" system to divide the Confederates—who now rule the country—and the Mexicans. Confederates saw that the conquest of South America would be the nation's \"prized piece\", but it would prove difficult due to the intensity of the will of the South Americans to stay independent from the invading Confederates. The Confederates believed in an ordained and divine quest, reminiscent of Manifest Destiny, for world domination.\n=== The Great Depression and World War II ===\nIn 1929, with Mexico, Central, and South America, Haiti, Cuba, the Dominican Republic, and the Caribbean all part of their \"growing empire\" from their expansionist campaign, the C.S.A. was hit by 1929 economic crash, forcing them to retreat into isolationism, but extricates itself by reviving the trans-Atlantic slave trade with new African slaves provided by collaborationist African leaders who enslave members of other tribes and sell at the Confederate state of Liberia.\nDuring the Second World War, the C.S.A. became friendly with Nazi Germany and their ideologies calling them \"biologically correct\", but disagreed with Adolf Hitler's \"Final Solution\" for a pure Aryan continent, hoping to exploit non-white races as a slave labor force instead of murdering them. The C.S.A. agrees to remain neutral in any German war. However, the C.S.A. becomes hostile with Japan, seeing its expansionism as a threat to the entire Pacific Coast Region. On the morning of December 7, 1941 (the date of the actual attack on Pearl Harbor), the C.S.A. strikes two Japanese naval bases and bombs the city of Kyoto as the opening blow in a war against the \"Yellow Peril\". Confederate leaders assume that the C.S.A. will easily win the war, judging the Japanese as small and weak in physical stature, as well as not being white, but—just like their campaign in South America—the Japanese proved to be an intense challenge to defeat.\nDuring the war, the C.S.A. military suffers massive losses and tries to solve its manpower shortages by recruiting a black regiment by promising slaves their freedom if they would fight (which is later revealed to be a lie with no explanation). This regiment receives the most dangerous missions and suffers high casualties, but earns the respect of white officers. The war is won by using the atomic bomb. The European war still ends in the Nazis' defeat, albeit with many more Soviet casualties. Stalin expands control over all Continental Europe and supports the holding of their colonies with exception to the British Empire (thanks to Canada).\n=== Cold war with Canada ===\nDuring the 1950s, the C.S.A. suffers the effects of \"Abolitionism\" (analogous to Communism and the Red Scare) and violent attacks from a splinter group of the N.A.A.C.P. called the \"John Brown Underground\" (J.B.U.). To safeguard and counter the fears of Abolitionism and the Red Canadian Injustice, the C.S.A. erects a border barrier wall along the entire Canada–US border called the \"Cotton Curtain\" (lampooning the real-life Iron Curtain) to divide the C.S.A. from Canada. After a series of abolitionist attacks and the C.S.A.'s neutrality in the Second World War and being friendly with Nazi Germany, Mainland Europe and their overseas colonies—now under Soviet control—impose international trade sanctions and embargoes on the C.S.A., forcing the nation into isolation once again leaving South Africa the only country maintaining diplomatic relations with the C.S.A. The success of the embargo on the C.S.A. leads some to question the need for slavery.\n=== A New Frontier ===\nIn the 1960 election, when only 29 percent of voters approve of slavery, Roman Catholic Republican John F. Kennedy is elected C.S.A. president over Democrat Richard Nixon. However, foreign policy such as the Newfoundland Missile Crisis distracts him, and he is unable to implement his domestic agenda. Also throughout the 1960s, the Vietnam War is briefly mentioned as an \"expansionist campaign\" of the C.S.A., also women demanded the right to have a voice and Canada became the pop cultural capital of the world with the contributions of African Americans and other exiles (Elvis Presley, after being jailed for some time, flees there), whereas the C.S.A.'s culture never evolves beyond its propaganda. Canada also continuously defeats the C.S.A. in the Olympic Games, which brought the Confederate congress to include slaves in sports, forming their very first Confederate States Football League championship games. This illustrated the time to break the color barrier and support Kennedy's movement to emancipate. But before this movement was set into motion, President Kennedy was assassinated. Kennedy's assassination completely dismantled the hopes of emancipation and for women to get the vote. Slaves throughout the country rebelled in fury and retaliation, including the Watts Riots, as a direct result of Kennedy's assassination. In the 1970s, the Social Revolution was crushed and many feared that the \"Golden Age\" of the Confederate States of America was over.\n=== Modern day ===\nBy the start of the 1980s and the 1990s, the Confederacy has largely put away such self-doubt of the years beginning with the death of President Kennedy and continued throughout the 1970s. Democratic Senator John Ambrose Fauntroy V presents programs returning the Confederacy to its former Southern Protestant Biblical values, such as husbands beating their wives and intolerance of homosexuals. The documentarians ask Senator (and presidential candidate) Fauntroy V to arrange an interview with some slaves, but it becomes clear that the slaves have been coached. However, they are clandestinely passed a note instructing them to meet a black man named Big Sam (earlier identified as the fugitive leader of the J.B.U.—John Brown Underground). Big Sam, in turn, leads them to Horace, a lifelong slave of Fauntroy's, who alleges Fauntroy V is part black, sharing a common slave ancestor. The racial accusations cost Fauntroy V the presidential election; a month later, the senator commits suicide on December 12, 2002. Narration then states DNA tests were \"negative\".\n=== Expanded timeline ===\nThe film's official website contains an expanded timeline of the history of the C.S.A., which features events not covered in the documentary. The timeline identifies President William McKinley's assassin as an abolitionist rather than Leon Czolgosz, an anarchist. The C.S.A. manages to advance in space technology by smuggling Nazi scientists out of Germany before its annexation by the Soviet Union. Rosa Parks is identified as a Canadian terrorist and a member of the J.B.U.. The failed assassination attempt on Pope John Paul II occurs in New York City instead of St. Peter's Square, with the assailant being a Southern Baptist who is subsequently executed for the crime. The Gulf War has Kuwait as C.S.A. territory. In 1995, Tim McVeigh blows up the Jefferson Memorial instead of the Murrah Building in Oklahoma City; his execution is broadcast on pay-per-view. The War in Afghanistan and subsequent American interventions in the Middle East are known as the \"1st and 2nd Crusades\", with the goal of eradicating the \"Muslim Menace\" by overthrowing the Islamic governments, taking over their oil production, and converting their entire populace to Christianity."}