{"mid": "Cube2Hypercube", "IMDB_id": "tt0285492", "title": "Cube 2: Hypercube", "plot": "The film starts with a young woman named Becky (Greer Kent), shown to be trapped in the Cube. She enters another room, but unknown to her, the room has reversed gravity, as she is pulled up, and it is implied that she is killed.\nSome time later, a woman named Kate (Kari Matchett), detective Simon (Geraint Wyn Davies), a blind girl named Sasha (Grace Lynn Kung), engineer Jerry (Neil Crone), game developer Max (Matthew Ferguson), lawyer Julia (Lindsey Connell), and an elderly woman named Mrs. Paley (Barbara Gordon) find themselves trapped in brightly lit cubes, each with a panel on each of the six sides, which are doors to other rooms. They come across Colonel Thomas Maguire (Bruce Gray), who says that they have to solve the code in order to leave the mysterious place. Just as he finishes, a wall begins to close in on the group. The group escapes while Thomas stays behind, while Kate and Simon watch in horror as Thomas is disintegrated by the wall. Later experiences around the cube reveal that gravity can operate in different directions in each room, while Mrs. Paley, who is revealed to be a retired theoretical mathematician, and Jerry, realize that they may be in a tesseract, or a hypercube. Kate notices the numbers \"60659\" everywhere they go.\nThe group soon realizes they are connected to Izon, a defense contractor. While in conversation, Mrs. Paley opens a panel to reveal her being killed by Simon, who is decapitated soon after by crystal beams. Jerry thinks that it is a parallel universe, while Max and Julia think it is an optical illusion. Later, while the group is sleeping, Simon realizes that he is in the tesseract to look for Becky, a missing Izon worker and the first person revealed in the film. Meanwhile, Sasha hears a noise and awakens everyone, due to her acute hearing. The group finds a floating square in the middle of the room, which grows into shifting variations of a tesseract, before expanding into a lethal and rapidly spinning frame. The group flees into another room, but Jerry is injured by the tesseract. Trying to call Jerry, the rest of the group watches as Jerry is shredded by the tesseract, which grows rapidly. Kate remains to save Sasha, who is still trapped in the room, narrowly avoiding death as they group in one of the corners of the room where the tesseract can't reach, as the tesseract conforms back to a cube and disappears. Sasha and Kate are separated from the group, as a result.\nSimon starts to suspect that Mrs. Paley is an undercover spy, so he gags and ties her up, but crystal beams start protruding from the walls. Simon tries to save Mrs. Paley, but when he sees that there isn't enough time, as the clinging Mrs. Paley refuses to release him, he stabs her with his knife. Max and Julia, disturbed that Simon killed Mrs. Paley, leave and abandon him. Julia tells Max she must be dreaming, and then kisses him, because she says she would never kiss him in the real world. They begin to have sex, but unbeknownst to them, they are in a room that is zero-gravity and time dilated, and age prematurely and die, as Kate finds the corpses floating in the air later, still in mid-coitus. Simon, alone and hungry, goes insane. He encounters a parallel Jerry and the missing Becky, killing both of them.\nMeanwhile, Kate finds grisly alternate realities of her death in other rooms, and is horrified. Sasha tells Kate that time and space are distorted where they are, that the tesseract will implode and reality is collapsing. She reveals that she is Alex Trusk, a computer hacker who is responsible for the creation of the tesseract, who also reveals that when she discovered that Izon was putting people inside the tesseract, she tried to stop their operation, but was pursued so she \"fled into the only place they wouldn't follow;\" the tesseract. Kate, however, still believes that there is a way out. Kate then finds Simon and stabs him in the eye after he grabs her in another room, as Simon appears behind Alex, old and blind in one eye, proving Alex's space-time theory. Alex claims that they \"are all dead\", which causes Simon to snap her neck, believing that if they are all dead that it won't really matter if he kills her now.\nKate finds that the tesseract is shrinking, and kills Simon with the knife. She looks at the numerous duplicates of Jerry's watch and realizes that \"60659\" is the time that the tesseract will implode; 6:06:59. and that she is there to take back Alex's necklace which was filled with confidential information on Izon. The hypercube starts to wear away, and Kate opens a panel in the bottom, revealing a black void. At 6:06:59, she jumps in just when the Hypercube implodes.\nKate wakes up in the hands of Izon authorities in an unknown factory. She gives them the necklace, but because of their confidentiality, she is shot in the head and killed by one of the Izon operatives. An Izon authority reports to an anonymous and unidentified source that \"Phase 2 is terminated\", as the operatives leave the facility, and the film ends."}