{"mid": "CubeZero", "IMDB_id": "tt0377713", "title": "Cube Zero", "plot": "The film starts with a man, Ryjkin, trying to escape from the Cube. He enters a room and is sprayed with liquid that he thinks is only water. However, when he rubs the back of his hand due to itchiness, his flesh liquifies and falls off. This soon happens all over his body, as he then melts on the floor and dies as a result.\nA man named Eric is watching a video feed of this in an observation room with a co-worker named Dodd. Afterwards, Eric is shown to be sketching a portrait of Dodd in the form of a superhero called Chessman, while playing chess with him at the same time. Dodd has the chess board in front of him, but Eric is at another table, simply drawing and naming his moves. Eric seems to be vastly intelligent, calculating all of Dodd's moves. After Eric wins, he asks Dodd questions about their missing colleagues. Dodd tells him not to ask too many questions or get involved with the occupants of the Cube because it wouldn't make \"those upstairs\" happy.\nBoth Eric and Dodd get an order from \"upstairs\" that asks them to record the dream of a subject, Cassandra Rains. In her dream, Eric sees that she was captured while walking in a pleasant forest with her daughter named Anna. After waking, Cassandra meets the other occupants of the Cube. One of the men, Robert Haskell, has a tattoo on his forehead like the soldier who captured Cassandra. However, Haskell, like everyone else, has no recollection of his former life or how he got there - he only knows his name. According to what Eric and Dodd know, everyone in the Cube faced a death sentence and was presented with a choice: Go into the Cube with their memory completely erased, or take the death sentence. For this process, a unique consent form must be signed for someone to be placed in the Cube. Eric discovers that there is no consent form in Cassandra's file and argues with Dodd that they should inform the people \"upstairs\" about this. Meanwhile, Eric and Dodd get \"lunch\", in the form of a flavored pill, from \"upstairs\" via the elevator.\nJust when Eric is about to make a call to the superiors, the phone rings. They are instructed to perform the \"exit procedure\" for a subject who has reached one of the exits of the Cube; one of their former colleagues, Owen. During the exit procedure, Owen is asked if he remembers his name, which he answers correctly. Owen is then asked if he believes in God, to which he says no, which prompts Eric to press the \"no\" button, which immediately incinerates Owen. Eric argues with Dodd over the fate of Owen, on which he says that he said \"no\", and that no one said yes. Eric realizes that the Cube is inhumane and that those \"upstairs\" are planning to place people in the Cube randomly without consent. He decides to enter the Cube to help Cassandra escape it. He distracts Dodd and enters the elevator, which contain only three buttons: \"UP\", to the \"upstairs\" room; \"MIDDLE\", pointing to their office; and \"DOWN\", to one of the entrances into the Cube, which he selects.\nJax, one of the Cube's supervisors who monitors the employees, and two of his analysts arrive from \"upstairs\" to stop Eric from helping Cassandra, but despite their efforts to stop them, Eric and Cassandra make it to the exit room with the help of Dodd, who sabotages the control panels servicing the Cube. He then swallows the main power coupler for the cameras inside the Cube in an act of defiance. Jax paralyzes him and guts him open alive, retrieving the coupler. The sabotage incapacitates the Cube, causing every trap to shut down like Eric planned. He informs Cassandra that they only have 10 minutes to escape before the Cube enters \"Reset Mode,\" which sterilizes the rooms by vaporizing everything inside.\nOnce Eric and Cassandra reach an \"exit room,\" Haskell catches them. They escape using a secret auxiliary exit just as the Cube enters \"Reset Mode,\" which vaporizes Haskell. They escape into a lake and end up in a forest; however, soldiers searching for them have already arrived. Cassandra manages to escape, but Eric is shot by a dart and passes out.\nEric wakes up in a surgery room and confronts Jax, who reveals that Cassandra may have gotten away. He claims that Eric has been found guilty of \"high treason\" and \"sabotage\" against \"country and some mystical God\", and also tells him that \"your sentence has been extended for two more lifetimes\". Jax claims Eric has already been convicted in a trial and shows him his consent form, saying he agreed to become a test subject many years ago but does not remember. Against his will, his brain is surgically altered, as Eric dreams about Cassandra reuniting with her daughter and praising Eric as a superhero. Eric is then lobotomized and put back in the Cube. After his brain was altered, Eric is left mentally handicapped. He repeatedly mentions the color of the room and has a repetitive twitch in his right hand. He is found by new captives of the Cube who wonder how he could have possibly survived, mirroring Kazan's initial appearance in the first film, hinting that he and Kazan may have been given the same condition, or even be the same person."}