{"mid": "Cujo", "IMDB_id": "tt0085382", "title": "Cujo", "plot": "The story takes place in the setting of numerous King works: the fictional town of Castle Rock, Maine. Revolving around two local families, the narrative is interspersed with vignettes from the seemingly mundane lives of various other residents. There are no chapter headings but breaks in between passages to indicate when the narration switches to a different point of view.\nThe principal characters are the Trenton and the Camber families. The middle-class Trentons have recently moved to Castle Rock from New York City, bringing with them their four-year-old son, Tad. Father, Vic, discovers that his wife, Donna, has recently concluded an affair. In the midst of this household tension, Vic's advertising agency is failing, and he is forced to travel out of town, leaving Tad and Donna at home. The blue-collar Cambers are longtime residents; Joe is a mechanic who dominates and abuses his wife, Charity, and their ten-year-old son, Brett. Charity wins a $5,000 lottery prize and uses the proceeds to trick Joe into allowing her to take Brett on a trip to visit Charity's sister, Holly, in Connecticut. Joe acquiesces, secretly planning to use the time to take a pleasure trip to Boston.\nCujo, the Camber's large, good-natured St. Bernard, chases a wild rabbit in the fields around their house and inserts his head in the entrance to a small limestone cave, where a rabid bat bites him on the nose and infects him. A short incubation period follows. Soon after Charity and Brett leave town, Cujo goes mad and kills their alcoholic neighbor, Gary Pervier. When Joe calls on Gary, Cujo kills him, as well.\nDonna, home alone with Tad, takes their failing Ford Pinto to the Cambers' for repairs. The car breaks down in Camber's dooryard, and as Donna attempts to find Joe, Cujo appears, ready to pounce. She climbs back in the car as Cujo starts to attack. Donna and Tad are trapped in their vehicle, the interior of which becomes increasingly hot in the sun. During one escape attempt, Donna is bitten in the stomach and leg but manages to survive and escape back into the car. She plans to run for the Cambers' home but abandons the idea due to her fears that the door will be locked, and that she will be subsequently killed by Cujo, leaving her son alone.\nVic returns to Castle Rock after several failed attempts to contact Donna and learns from the police that Steve Kemp, the man with whom Donna was having an affair, is suspected of ransacking his home and possibly kidnapping Donna and Tad. To explore all leads, the state police send Castle Rock Sheriff George Bannerman out to the Cambers' house, but Cujo attacks and kills him. Donna, after witnessing the attack and realizing Tad is in danger of dying of dehydration, battles Cujo and kills him. Vic arrives on the scene with the authorities soon after, but Tad has already died from exposure. Donna is rushed to the hospital, and Cujo's head is removed for a biopsy prior to cremation of his remains.\nThe novel ends several months later with both the Trenton and Camber families trying to go on with their lives: Donna has completed her treatment for rabies, her marriage with Vic has survived, and Charity gives Brett a new, vaccinated puppy named Willie. A postscript reminds the reader that Cujo was a good dog who always tried to keep his owners happy, but the ravage of rabies drove him to violence."}