{"mid": "Curfew", "IMDB_id": "tt0097135", "title": "Curfew", "plot": "The Movieweb website provides a terse synopsis: \"Two escaped brothers track down the people who sentenced them to death row, including a doctor and the judge. But when they get to the D.A. and his family they have an especially lengthy revenge plot in mind for them.\"\nJohn Bush of Rovi also provides a recap in The New York Times: \"After late-night carousing on too many weekends and having her parents impose a curfew upon her, a teen-age girl (Kyle Richards) speeds home to keep from winding up in hot water again but finds when she gets home that two escaped convicts (Wendell Wellman, John Putch) have taken her family hostage.\"\nKeith Bailey of the Unknown Movies website provides a lengthier synopsis:\nThe movie concerns what happens one night to a family called the Davenports. Man of the house Walter (Frank Miller) is the town's successful district attorney, and he is married to a woman named Megan (Jean Brooks). Both are parents to a teenage girl named Stephanie (Richards, Halloween). One night, Stephanie leaves the house in order to go on a date with the high school quarterback, and is told by her parents that she must follow a curfew and be home by 10:00 PM. While she is out, her parents get a rude reminder from the past. Some time earlier, Walter had successfully prosecuted the Perkins brothers, Ray Don (Wellman, The Klansman) and Bobby Joe (Putch, Chain Of Command), and got the judge to sentence them to death. But both brothers have escaped from prison, and are dead set on getting even with the people responsible for sending them to death row. After first dealing with other people at the trial (including the judge), they now set their sights on district attorney Walter and his family. While Stephanie is out, the Perkins brothers make their way into the Davenport home and quickly take Walter and Megan captive, and start their long and torture-filled plan of revenge. Of course, when Stephanie eventually has to come home, she too is taken hostage, and soon the question that comes up is if the Perkins will kill Stephanie and her parents before help arrives - if ever, that is."}