{"mid": "CurseOfChucky", "IMDB_id": "tt2230358", "title": "Curse of Chucky", "plot": "Set four years after the conclusion of the previous film. Chucky (voiced by Brad Dourif), arrives mysteriously in the mail to the family home of paraplegic Nica (Fiona Dourif) and her mother, Sarah. Sarah, not knowing who sent Chucky, throws him in the garbage. Later that night, Nica hears Sarah screaming in pain and finds her dead from a self-inflicted stab wound as Chucky watches from a nearby chair.The next day, Nica is grieving over the gruesome suicide of her mother when her domineering older sister Barb (Danielle Bisutti) arrives in town, with her family: husband, Ian; daughter, Alice; and live-in nanny, Jill, to help settle their mothers affairs. Also present is Father Frank, a priest that came to counsel the family. Alice finds Chucky in the bathroom and develops a friendship with him.After Nica and Alice cook chili for dinner, they leave the kitchen to set the dinner table. In their absence, Chucky pours rat poison into one of the bowls. As night falls, Father Frank and the family sit down and eat. Father Frank leaves as a thunderstorm starts. Emergency personnel arrive at the scene of a car accident and find Father Frank, disoriented from the rat poison, pinned at the throat by the roof of his car. Firefighters remove the car's roof, unintentionally severing his head.Back at the house, Nica, Barb, Jill, and a half-asleep Ian are watching old home movies. Nica notices a human Charles Lee \"Chucky\" Ray in one of the movies. Alice comes downstairs and notifies everyone that Chucky is gone. Nica finds the return address from the package Chucky arrived in. She tries to call the number, but the storm is causing on and off blackouts and blocking cellphone signals. Jill puts Alice to bed and starts looking for Chucky. While in the kitchen, Barb comes in and passionately kisses Jill, indicating an affair. Nica returns to the living room and finds Chucky sitting on the sofa next to a sleeping Ian. Nica uses the house elevator to take Chucky to Alice, but a blackout occurs and Chucky cuts her leg with a knife. The power returns and the elevator takes Nica to the second floor where Alice takes Chucky and goes to bed.After everyone else goes to their rooms, Nica goes downstairs and looks up \"Chucky Doll Evidence\" on the internet, where she reads the stories of his murders and realizes that Chucky is alive. Jill goes to Alice's room, strips down to her underwear, and starts video chatting with Barb in another bedroom next to Ian. While talking in video chat Barb tries to warn Jill that Alice is up (not knowing that is Chucky). Jill looks down and sees Chucky holding a knife. Chucky kicks a bucket of rain water over. The water touches Jill's feet and a power outlet, electrocuting her to death and causing another blackout. Barb goes to check on Alice. A now awake Ian questions who Barb is really checking on, indicating that he put a nanny cam on Chucky and knows about the affair. Barb leaves the room after Ian puts in earplugs to tune her out.Barb finds Chucky sitting on stairs that lead to the attic. Thinking that Alice is in the attic, Barb picks up Chucky and goes up to look for her. Meanwhile,with the elevator unusable due to the blackout, Nica crawls up the stairs to the second floor. In the attic, Barb notices the knife in Chucky's overalls. She sets Chucky down on a trunk and continues her search for Alice. Barb turns around and sees Chucky sitting on a shelf. She notices that parts of Chucky's face is peeling. Barb peels off the plastic coating on Chucky's face, exposing his stitches and scars from the previous film. Chucky comes alive and gouges out one of Barb's eyes with his knife.\nNica makes it to the attic's stairs. Chucky throws Barb's eyeball down the stairs. Barb then falls down the stairs dead. Chucky makes his way down the stairs towards Nica. Nica gets a wheelchair from the hallway closet and rolls away with Chucky in pursuit. Nica stops at Alice's room and sees that she has disappeared. Nica makes it to Ian and alerts him of the situation. A skeptical Ian wheels Nica to the garage, then goes back to the house to find Alice, instead finding Jill's and Barb's dead bodies. Chucky locks himself in a car in the garage, starts it, and tries to kill Nica with carbon monoxide poisoning. Nica finds a hatchet and smashes a car window to attack Chucky. Ian returns to the garage and sees Nica with the hatchet. Ian, now suspecting Nica of the murders, disarms her. The stress of the entire situation causes Nica to suffer a heart attack and lose consciousness.\nNica regains consciousness. Ian has tied her to her wheelchair and looks at footage from the nanny cam that Chucky is not responsible for the murders. The footage shows that Chucky is alive and hid Alice in a closet and the affair between Barb and Jill. Chucky comes in and uses Nica's wheelchair to run Ian over. Chucky then uses the hatchet to chop off Ian's lower jaw, killing him. Chucky attacks Nica lodging the hatchet into her knee, but she manages to break out of her restraints and knock out Chucky. Chucky gets back up and Nica uses the hatchet to decapitate him.Nica turns her back to tend to her wounds. Chucky gets up and reattaches his head. Chucky then grabs Nica's wheelchair, pushes her down the hall and through the balcony. Nica falls to the ground floor. Chucky walks downstairs and taunts Nica. Nica asks why Chucky is doing this. Through flashbacks, Chucky explains that he was a friend of the family. He was in love with Sarah, but she was married and pregnant with Nica. Chucky killed Sarah's husband and kidnapped her some time after the funeral. After Sarah rejects him, Chucky stabs her in the stomach before fleeing from the police. The stab to Sarah's stomach is what caused Nica to be born a paraplegic. The kidnapping led to Chucky's death as a human, setting off the chain of events of the franchise.\nThe electricity returns long enough for Nica to make it into the elevator. Chucky cuts Nica's fingers before dropping the knife into the elevator. Nica, now holding the knife, urges Chucky to attack her. Chucky lunges at Nica and is stabbed in the back. Nica attempts to leave the elevator, but Chucky springs back to life. A police officer arrives at the house and hears Nica scream. He enters the house and sees Nica in the elevator still holding the bloody knife. He looks around and sees Barb's body upstairs while Chucky watches from a nearby chair.Some time later, Nica is found guilty of the murders and sent to an asylum. As Nica is being wheeled out of court, she taunts Chucky (a piece of evidence) that she is still alive. The arresting officer takes Chucky and prepares to take it to an unknown person, and tells the unknown person at the other end of the phone to have his money ready. The officer sees the plastic bag Chucky is in moving because of his breathing. Before he looks inside, Tiffany (Jennifer Tilly) pops up in the backseat and slits his throat. Tiffany then mails Chucky to his next target.Alice, now living with her grandmother, comes home from school. Alice looks for her grandmother, but finds Chucky instead. She asks where her grandmother is and Chucky replies \"in the cellar\". Chucky persuades Alice to play \"Hide The Soul\". The camera pans away as Chucky says the chant that will transfer his soul to Alice's body. Before the screen cuts to black, Alice's screaming grandmother pops up on the screen with a plastic bag over her head.After the credits, Chucky is delivered to the now adult Andy Barclay (Alex Vincent). When Andy turns his back to answer a phone call from his mother, Chucky cuts his way out of the package. Chucky looks at an old photo of Andy and his mother from when he was a kid, before turning his attention to Andy. Andy, anticipating Chucky coming after him, holds a shotgun to Chucky's head. Chucky is surprised when Andy remarks, \"Play with this\", before pulling the trigger."}