{"mid": "DaffyTheCommando", "IMDB_id": "tt0035774", "title": "Daffy - The Commando", "plot": "A German commander – Von Vultur – is tempestuously pacing back and forth while fuming and spluttering furiously about how many American commandos have managed to slip into Germany undetected, while a snippet from Wagner's Das Rheingold plays on the soundtrack. He gets a telegram from the \"Gestinko Gestapo\", threatening him with his ‘ka-rear’ if he lets ‘vun’ more ‘kommando’ through (the letter is signed \"The Apes Of Wrath\" and shows three apes' heads; if you look closely, the apes are caricatures of Hitler, Hirohito and Mussolini, the last of whom is crossed out). The settings recalls World War I trenches more than any actual scene of World War II. Hearing an American warplane overhead, he calls in his servant – Schultz – whom he abuses by knocking him regularly over his helmet with a mallet. They run outside and use a searchlight to search for any more landing commandos and eventually spot one, who just happens to be Daffy floating down on a parachute, whilst singing Billy Bennet's \"She was Poor But She Was Honest\" in a Cockney accent.\nAfter a quick shout of \"Put out those lights!\" gets the searchlight turned off temporarily and allows him to land unseen, Daffy uses his fingers on the searchlight’s lens to make shadows of animated puppets and dancing chorus girls on the clouds to distract the Germans. When Von Vultur chases Daffy behind a curtain that says \"asbestos\", Daffy makes a face similar to the stereotypical Japanese faces used in cartoons at the time (see, for example, Bugs Bunny Nips the Nips), causing Von Vultur to run off frightened.\nBack at his bunker, Von Vultur is presented with a ticking time bomb from Daffy \"as a little token of our esteem\". Just realizing its imminent danger, he hands the bomb off to Schultz, who is literally blown through the roof. When Schultz falls back, Daffy (who was hiding underneath Shultz's helmet) stops Von Vultur from hitting Schultz over the head with a mallet, and instead hits him. Von Vultur (pausing briefly to salute a skunk with \"Heil Hitler!\") chases Daffy to a telephone booth, where Daffy continues to make fun of him, such as nicknaming him \"Von Limburger\" (after the infamously foul-smelling cheese).\nDaffy then jumps in a plane, narrowly avoiding being shot by \"a whole mess of Messerschmitts\". When Daffy is shot down by Von Vultur, his plane is literally blown to pieces (its entire body progressively disintegrating and disappearing from back to front, eventually leaving just the engine and propeller), with Daffy still clinging to the controls. Daffy then runs into what he believes is a tunnel where he can hide, but it turns out to be the barrel of a huge howitzer cannon, and he’s then shot out by Von Vultur. However, Daffy flies unharmed (as a ‘human cannonball’) into Berlin, where (a largely rotoscoped) Adolf Hitler is making one of his infamous emotionally-inflamed furiously-ranting public speeches (although he's actually speaking in mock German and saying humorous phrases such as \"Mein Heineken\"). Daffy jumps up and whacks Hitler on the head with a mallet, causing Hitler to yell for Schultz, similar to Von Vultur."}