{"mid": "DamienOmenII", "IMDB_id": "tt0077394", "title": "Damien: Omen II", "plot": "A week after the burial of Robert and Katherine Thorn, archaeologist Carl Bugenhagen (Leo McKern) learns of the survival of their adopted son Damien. Confiding to his friend Michael Morgan (Ian Hendry) that Damien is the Antichrist, Bugenhagen attempts to convince him to give Damien's guardian a box containing the means to kill Damien. As Morgan is unconvinced, Bugenhagen takes him to some local ruins to see the mural of Yigael's Wall, which was said to have been drawn by one who saw the Devil and had visions of the Antichrist as he would appear from birth to death. Though Morgan believes him upon seeing an ancient depiction of the Antichrist with Damien's face, both he and Bugenhagen are buried alive as the tunnel collapses on them.\nSeven years later, the 12-year old Damien (Jonathan Scott-Taylor) is living with his uncle, industrialist Richard Thorn (William Holden) and his wife, Ann (Lee Grant). Damien gets along well with his cousin Mark (Lucas Donat), Richard's son from his first marriage, with whom he is enrolled in a military academy. However, Damien is despised by Richard's aunt, Marion (Sylvia Sidney), who sees him as a bad influence on Mark. Though Marion threatens to cut Richard out of her will if he does not separate the two boys, she dies of a heart attack while visited by a raven in the dead of night. Soon after, through his friend and curator of the Thorn Museum, Dr. Charles Warren (Nicholas Pryor), Richard is introduced to journalist Joan Hart (Elizabeth Shephard). Hart was a colleague of Keith Jennings, the journalist decapitated seven years previously after befriending Robert Thorn to investigate the circumstances surrounding Damien's birth and adoption by the Thorns. Hart has pieced together the circumstances of Jennings' death after seeing Yigael's Wall. Though no one believes her, Joan believes she may have been mistaken about Damien until she sees his face at his school and drives off in a panic. On the road, after her car's engine mysteriously dies, Joan is attacked by the raven as it pecks out her eyes and then watches her get run over by a passing truck.\nAt Thorn Industries, manager Paul Buher (Robert Foxworth) suggests expanding the company's operations into agriculture; however, the project is shelved by senior manager Bill Atherton (Lew Ayres), who calls Buher's intention of buying up land in the process immoral. At Mark's birthday, Buher introduces himself to Damien, invites him to see the plant, and also speaks of his approaching initiation. Buher seemingly makes up with Atherton, who drowns after falling through the ice at a hockey game on a frozen lake the following day. A shocked Richard leaves on vacation, leaving Buher to oversee the agriculture project in principle and returning to find that he initiated land purchases on his own.\nMeanwhile, at the academy, Damien's new commander, Sgt. Neff (Lance Henriksen), is revealed to be a secret Satanist like Buher as he takes the boy under his wing while advising him not to draw any attention to himself until the right moment. He also points him to the Biblical Revelation, chapter 13, telling Damien that, for him, the book is precisely that; a revelation. Damien reads the passage, discovering the 666 Mark of the Beast on his scalp. Learning his true nature he flees the Academy grounds in a terrified panic. Later, alerting Buher that he intends to tell Richard that some of the land they obtained was taken from people who were murdered after having refused to sell their land, Dr. David Pasarian (Allan Arbus) is killed when he and his assistant suffocate from toxic fumes during an industrial 'accident'. The incident injures Damien's class, who were visiting the plant at the time. When Damien alone is found to be unharmed by the fumes, a doctor (Meshach Taylor) suggests keeping him in the hospital as a precaution. The doctor discovers that Damien's marrow cells resemble that of a jackal; before he can investigate any further or report his findings, however, he is bifurcated by a falling elevator cable.\nMeanwhile, Bugenhagen's box has been found during an excavation of the ruins and delivered to the Thorn Museum. Dr. Warren opens it and finds the Seven Daggers of Megiddo, the only weapons able to kill Damien, along with a letter by Bugenhagen explaining that Damien is the Antichrist. Warren rushes to inform Richard, who angrily refuses to believe it as Warren leaves to see Yigael's Wall for himself. The next day, Richard confronts Ann with the letter, but she convinces him that it is preposterous. But matters worsen when Mark, who overheard Richard's altercation with Warren, confronts Damien. Reluctantly, and then proudly, admitting to being the Devil's son, Damien pleads with Mark to join him on his rise to power. But Mark's steadfast refusal forces Damien to kill Mark by causing an aneurysm in his cousin's brain. Shaken by his son's death, Richard goes to New York City to see a half-crazed Warren before being taken to the train station where Yigael's Wall is being stored in a cargo carrier. As a horrified Richard sees Damien's image, a switching locomotive impales Charles and crushes him against the carriage, destroying the wall and convincing Richard beyond doubt that Damien is the Antichrist. Upon his return, Richard has Damien picked up from his graduation at the academy while taking Ann to the museum. When they find the daggers in Warren's office in the Thorn Museum, Ann uses them to kill Richard, revealing herself to be a Satanist who \"always belonged to him\". Having heard the altercation from an outside corridor, Damien wills a nearby boiler room to explode, setting fire to the building, with Ann consumed in the flames. Damien then exits the burning museum and is picked up by the family driver, Murray, as the fire department arrives."}