{"mid": "DamnationAlley", "IMDB_id": "tt0075909", "title": "Damnation Alley", "plot": "First Lieutenant Jake Tanner (Jan-Michael Vincent) shares ICBM silo duty at an American air force missile base in the Californian desert with Major Eugene \"Sam\" Denton (George Peppard), who is requesting not to work with him. On their way to duty, Denton talks to Airman Tom Keegan (Paul Winfield), an aspiring artist. When the United States detects incoming nuclear missiles from the Soviet Union, Tanner and Denton launch part of the retaliatory strike. The United States is hit hard, although it manages to intercept 40% of Soviet missiles.\nTwo years later, the Earth has been tilted off its axis by nuclear detonations of World War III; radiation has mutated giant scorpions, the planet is wracked by massive storms, and the sky is in a perpetual aurora borealis-like state. Tanner has resigned his commission and has been scouting Barstow while Keegan, who has also left the Air Force, has been painting as an artist in one of the base's out-buildings. Mutated giant scorpions menace the area. Later an airman falls asleep in a bunk and drops a lit cigarette onto a pile of Playboy magazines, which causes the entire base to catch fire and explode, killing most of its inhabitants including the base commander, General Lander (Murray Hamilton). Keegan and Tanner are unscathed, as are Denton and Lieutenant Tom Perry (Kip Niven), who were in an underground garage bunker.\nDenton has been considering going to Albany, New York to find the source of a lone radio transmission. He and the remaining others set out in two Air Force \"Landmasters,\" giant 12-wheeled armored personnel carriers capable of climbing 60-degree inclines and operating in water. They must cross \"Damnation Alley,\" considered \"the path of least resistance\" between intense radiation areas thus named by Denton. Along their journey one of the Landmasters becomes disabled in a storm (which also kills Perry) and they encounter mutated \"flesh stripping cockroaches\" in the ruins of Salt Lake City which eat Keegan alive. Denton and Tanner also pick up two survivors: a woman in Las Vegas, Janice (Dominique Sanda), and a teenage boy, Billy (Jackie Earle Haley), discovered in an abandoned house. Later they fight off a band of crazed gun-toting mountain men they encounter in the ruins of a gas station. Denton uses a rocket launcher to destroy the gas station.\nAs they continue their journey, the Landmaster develops a problem with its drivetrain and they head to Detroit. Denton comments that it was \"designed to use spare truck parts\", semi-trucks in particular. In Detroit they enter a large wrecking yard in search of the needed parts. A large storm comes upon the group and they take shelter in their vehicle just as a tidal wave washes them away. After the storm passes, they are adrift in a large body of water and it appears that the Earth has returned to its normal axis as the sky is clear. Using the Landmaster's amphibious capability, they reach land. As they are making repairs, they hear a radio broadcast of music and an attempt to reach survivors. After making contact, Tanner and Billy set out on to locate the source of the broadcast. In the final scene, they reach a surprisingly intact Albany and are greeted by its inhabitants."}