{"mid": "DangerousMen", "IMDB_id": "tt0489015", "title": "Dangerous Men", "plot": "The plot of Dangerous Men is somewhat unclear, and changes abruptly towards the middle of the film.\nMina (Melody Wiggins) and her fiancé, Daniel (Coti Cook) are walking on a beach when two bikers, named Tiger and Leo, set upon them. They kill the fiancé and attempt to rape Mina. In the struggle, Leo is killed and Tiger goes to leave the beach. Mina insists that he take her along, secretly plotting his murder.\nAfter taking Mina for a steak dinner at a motel, Tiger retires with her to their room. Mina distracts Tiger by having him rub her knees and lick her bellybutton before producing a knife hidden in her buttocks and stabbing him to death, taking revenge for her fiancé.\nMina flees into the desert, where she is picked up by a British man driving a pickup truck. The driver pulls over and attempts to rape Mina at gunpoint. She threatens to castrate him with her knife and sends him off, nude, to wander the desert. The film follows him for approximately 5 minutes as he narrates his own misfortune, occasionally addressing his own penis. He is seen singing and dancing as he wanders about. Eventually a van passes him by and he is pelted with garbage.\nMina visits a prostitute and asks her to teach her to be \"one of the girls of the night\"- a ruse which she uses to kill several potential Johns with her knife. Mina's campaign of murders is reported on the news and comes to the attention of the police.\nA police detective (who is the brother of Mina's fiancé) begins investigating a biker gang (led by the as-yet unseen Black Pepper, played by Bryan Jenkins), despite nominally being on vacation. He pays a bartender $300 for information about the bikers. Later, the detective tails one biker onto the beach where he is attempting to rape a young woman (Annali Aeristos). The detective chokes him into unconsciousness.\nIn the next scene, the biker gang is driving in a convoy. The biker from the previous scene is distracted by the young woman he failed to rape- who is sunning herself on the hood of a car by the roadside. Unbeknownst to him, the detective is concealed in the car, wearing a bulletproof vest and motorcycle helmet. When the biker pulls over to once again attempt to rape the young woman, the police detective attempts to intervene. However, he spends several minutes attempting to extricate his foot which is stuck under a seat. Eventually he frees himself and chokes the biker into unconsciousness.\nThe detective drives away with the biker bound in his back seat. He learns Black Pepper's location and drives to the foot of the hill where his house is located.\nIn an unrelated scene, Mina is arrested by several other police officers in a public park.\nIn the house, Black Pepper and a young woman watch a belly dancer perform. They then retire to Black Pepper's bedroom. They are interrupted in an amorous moment by one of Black Pepper's subordinates who tells him the police have arrived. After a fight in the house, Black Pepper flees into the brush and is pursued by the police chief.\nThe chief chases Black Pepper through a small cave and into a neighboring house. Black Pepper is poised to rape the young blind woman who lives in the house. However, she produces a pistol from under her sewing and starts firing at Black Pepper. Shortly after, the chief arrives and arrests Black Pepper. The film abruptly ends on a freeze frame."}