{"mid": "DangerousLiaisons", "IMDB_id": "tt0094947", "title": "Dangerous Liaisons", "plot": "In pre-Revolution Paris, the Marquise de Merteuil (Glenn Close) plots revenge against her ex-lover, the Comte de Gercourt, who has recently ended their relationship. An amoral, sexually ravenous schemer, Merteuil amuses herself by manipulating men out of boredom, and her resentment of the subservient status of women in 18th-century French aristocratic society. To soothe her wounded pride and embarrass Gercourt, she seeks to arrange the seduction and disgrace of his young 18-year-old virgin fiancée, Cécile de Volanges (Uma Thurman), who has only recently been presented to society after spending her formative years in the shelter of a convent.Merteuil calls on her old friend, the rakish and similarly unprincipled Vicomte de Valmont (John Malkovich) to do the deed, offering him her own sexual favors as the reward for a successful conquest. Valmont declines, claiming that it is too easy, plus he has a seduction of his own in progress: Madame de Tourvel (Michelle Pfeiffer), the virtuous wife of a member of Parliament. Merteuil is amused and incredulous at Valmont's hubris. She asks him how can he ever hope to bed a chaste, devoutly religious woman like Madame Tourvel. Never one to refuse a challenge, Valmont modifies the proposal: If he succeeds in sleeping with Tourvel, Merteuil must sleep with him as well. Merteuil accepts, on the condition that he furnish written proof of the liaison.At the estate of Valmont's aunt in the countryside, Madame de Rosemonde (Mildred Natwick), where Tourvel is living as a guest while her husband is away on state business, Valmont employs every trick in his considerable repertoire in a vain attempt to attract Tourvel's attention. His first attempt to proposition to Tourvel fails when she refuses his advances. She reveals that she knows all about him and his reputation; that he seduces and corrupts young women for his own twisted enjoyment. Tourvel claims that a friend has been writing her letters which explains all about Valmont's seduction tactics.Searching for leverage, Valmont instructs his page Azolan (Peter Capaldi) to seduce Tourvel's maid Julie (Valerie Gogan) so that Valmont can intimidate her to gain access to Tourvel's private correspondence. Later, Julie gives one of the letters and it is from Madame de Volanges (Swoosie Kurtz), Cécile's mother and Merteuil's cousin, warning Tourvel that Valmont is a cad, and a generally nefarious and untrustworthy individual. On reading this, Valmont returns to Paris and resolves to do Merteuil's dirty work after all, seducing Cécile as revenge for her mother's only-too-accurate denunciation of him.Meanwhile, Cécile meets the charming Chevalier Raphael Danceny (Keanu Reeves) at a local opera house where she frequents. Danceny becomes Cécile's music teacher and slowly, with a little coaxing from Merteuil (who knows that Danceny, a poor commoner, can never qualify as a bona fide suitor), they fall in love.Valmont's connived seduction of Cécile is rapid and unsubtle. After gaining access to her bedchamber on a false pretense, he forces himself upon her as she pleads with him to leave. The following night he attempts to enter her room again, but she has barred her door. On the pretext of illness she remains locked in her chambers, refusing all visitors. A concerned Madame de Volanges calls upon Merteuil to speak to her. Cécile, naively assuming that Merteuil has her best interests at heart, confides in her. Merteuil advises Cécile to welcome Valmont's advances; young women should take advantage of all the lovers they can acquire, she says, in a society so repressive and contemptuous of women. The result is a perverse \"student-teacher\" relationship between Cécile and Valmont; by day she is courted by Danceny, and each night she receives a sexual \"lesson\" from Valmont. In the meantime, Merteuil seduces Danceny and begins an affair with him.Ever mindful of Merteuil's challenge, Valmont's principal target remains Madame de Tourvel, and during his time as Cécile's \"teacher\" he somehow manages to win Tourvel's heart..... but at a cost: Valmont, the lifelong bachelor playboy, falls in love, after spending his first night with Tourvel. In a fit of jealousy, Merteuil mocks Valmont for having succumbed to Tourvel's charms. She also refuses to honor her end of their agreement, since Valmont has no written proof that the relationship has been consummated. Valmont, faced with Merteuil's threat to trash his reputation by revealing himself as a carefree gigolo, abruptly dismisses Tourvel with a terse excuse: \"It is beyond my control\". Cécile, meanwhile, after a particularly rough night in Valmont's bed, miscarries his child.Tourvel, overwhelmed with grief and shame, retires to a convent where her health deteriorates inexorably, and she eventually dies from cholora. The Valmont-Merteuil toxicity/war escalates. Valmont learns of Merteuil's seduction of Danceny and warns him of her perfidy. Merteuil retaliates by informing Danceny that Valmont has been sleeping with Cécile. Danceny challenges Valmont to a duel, and mortally wounds him. On his deathbed, Valmont asks Danceny to communicate to Tourvel.... by now also at death's door.... his genuine love for her. He then gives Danceny his collection of intimate letters from MerteuilA few days later, all of Paris learns the entire, grisly range of her schemes and depredations. Booed and humiliated at the opéra by her former friends and sycophants, Merteuil flees the city in disgrace for places unknown. Cécile, guilt-ridden, returns to the convent whence she came to become a nun."}