{"mid": "Daredevil", "IMDB_id": "tt3322312", "title": "Daredevil", "plot": "Season 1Criminals, including the Russian mafia, Yakuza, and Chinese, have taken advantage of Hell's Kitchen's circumstances since \"the incident\". Blinded as a boy in an accident that gave him heightened senses, Matt Murdock begins fighting this rising criminal element by night as a costumed vigilante while opening a law firm with his friend, Foggy Nelson. Their first client is Karen Page, a secretary for construction company Union Allied, who has been framed for the murder of her co-worker, Daniel Fisher, after accidentally uncovering a pension embezzlement scheme. Murdock prevents Karen from being prosecuted and protects her from an assassin, before exposing the scandal through Ben Urich at The New York Bulletin. Grateful for their help, Page offers to work for Murdock and Nelson. James Wesley covers up the involvement of his employer in the scandal, and orders Anatoly and Vladamir Ranskahov, the Russians' leaders, to deal with Murdock (\"the man in black\"): they kidnap a young boy to lure him into a trap.When Murdock was a boy, his father was murdered for winning a match he was told to throw. Now, after failing to rescue the kidnapped boy, a severely injured Murdock is found in a dumpster by nurse Claire Temple. Nelson meanwhile attempts to comfort Page following her recent traumatic experiences. Temple takes Murdock to her apartment, tends to his wounds, and removes his mask, discovering his blindness. He refuses to reveal his name, but does reveal his heightened senses when they alert him to a Russian who is searching the apartment building, giving Temple time to hide Murdock and convince the man that she knows nothing. Murdock realizes that the man did not believe her, and overpowers him, taking him to the roof. Murdock and Temple torture him into revealing the boy's location, before Murdock pushes him off the roof and into the same dumpster. He barely survives. Murdock enters the building where they are keeping the boy, defeats the guards, and rescues him.Wesley, having become aware of Nelson and Murdock because of their involvement with Page during the Union Allied scandal, hires them to defend John Healy, an assassin. Though Nelson wishes not to get involved with an obvious criminal element, Murdock wishes to use the case to discover who Wesley's employer is, and so accepts Wesley's offer, which includes a substantial sum to ensure their silence. Page receives a similar offer from Union Allied, who do not want her to talk to anyone else about the scandal, and threaten to sue her for leaking company secrets to the press if she does not agree. Despite this, Page goes to Urich, whose editor Ellison is forcing him to write superfluous stories rather than the major crime breaks of his youth, and offers to tell him more about the Union Allied scandal. After successfully defending Healy, Murdock confronts him in costume and forces him to reveal Wesley's employer, Wilson Fisk. Healy then commits suicide rather than face the consequences of this.Murdock is unable to find any record of Fisk, and so continues to interrogate criminals, searching for answers. Wesley informs the Ranskahovs of an offer Fisk has made to help with their operations, given their recent failures. Angered at this apparent slight, they attempt to stop the man in black once and for all by visiting in hospital the Russian whom Murdock threw from the roof. After the Russian tells them of Temple, they send men to kidnap her, but she manages to call Murdock in time to alert him of her kidnapping. The Russians attempt to torture Murdock's name out of Temple, but Murdock arrives and defeats the gangsters. Seeing the aftermath of this, the Ranskahovs decide to agree to Fisk's offer, with Anatoly going to tell Fisk personally, by barging into the restaurant where Fisk is having dinner with an art gallery curator named Vanessa Marianna. Fisk takes a confused Marianna home, and angered at this intrusion and embarrassment, Fisk beheads Anatoly and orders Wesley to send the body to Vladimir.Fisk explains the situation to his allies, including Chinese leader Madame Gao, of whom he asks a special favor. Elena Cardenas, a renter of powerful businessman Armand Tulley, comes to Nelson and Murdock after Tulley, who wants to convert her apartment building, sends men to wreck her home. Nelson goes to Tulley's lawyers at Landman and Zack (where he and Murdock once interned), represented by Marci Stahl, Nelson's ex-girlfriend. She explains that Cardenas and her neighbors can either take a large settlement or be evicted. While looking for complaints against Tulley at the police station, Murdock realizes Detectives Carl Hoffman and Blake are corrupt when he hears them kill a Russian. Murdock later incapacitates Blake and uses his cell phone to find Vladimir. Fisk pays Turk Barrett to reveal to Vladimir that Fisk killed Anatoly, and as they prepare for a war against Fisk, their forces are destroyed in a suicide attack by Gao's workers. Vladimir survives, but Murdock finds him, as they are surrounded by police.Murdock takes out the police when they try to kill Vladimir on Fisk's orders, and he takes Vladimir to an abandoned warehouse, hoping for answers about Fisk, while Nelson and Cardenas are injured in the bombings. With Temple's help, Murdock cauterizes Vladimir's wounds, alerting a non-corrupt police officer to their presence. The officer calls in Murdock and Vladimir's location, and the warehouse is soon surrounded. Blake and Hoffman take control of the situation, and await Fisk's orders. Fisk talks to Murdock via police radio, telling him of his admiration for what Murdock is trying to do, even though it clashes with Fisk's own plans to save the city. Fisk then frames the vigilante by having a police sniper fire on other officers from the roof of the warehouse, including Blake, as Urich and the media look on. Vladimir, in return for Murdock avenging Anatoly's death, gives him information on Leland Owlsley the accountant for all of Fisk's operations before giving his life so that Murdock can escape.Murdock tracks down Owlsley, but is distracted by the arrival of an elderly man: Murdock's mentor, Stick, who taught him to master his abilities as a child, but abandoned him when Murdock developed an attachment to him. Now, he enlists Murdock's help in destroying Black Sky, a weapon that the Japanese, led by Nobu, are bringing to New York. Stick agrees to refrain from killing, but breaks his promise when he kills Black Sky, who is actually a young boy. After fighting in Murdock's apartment, Murdock defeats Stick, who agrees to leave the city. Urich, having agreed to help Page expose the further scandal and corruption surrounding Hell's Kitchen and Union Allied, explains that they need proof before they can publish anything. While searching for a connection between Tulley's men and Union Allied, Page is confronted by them. Nelson helps her escape them, so she and Urich explain their investigation to him. Stick later converses with a heavily scarred man about Murdock's role in events to come.Page and Nelson bring Murdock in on their plan, and he agrees as long as they stop putting themselves in harm's way, and use the legal system rather than underhanded tactics. Owlsley and Nobu, angry at being confronted by the vigilante and losing Black Sky, respectively, express their displeasure with Fisk, while he is also dealing with Blake, who wakes up in hospital. Fisk convinces Hoffman to kill Blake before he can speak out against Fisk, but Hoffman is incapacitated by Murdock, who gets information on Fisk from Blake before he dies. Gao visits Fisk, warning him that he will have to get everything under control if he does not want her, Nobu, and Owlsley to side-step him. An angry Fisk is later consoled by Marianna, and he tells her of how, as a child, he murdered his father when he was beating Fisk's mother. She convinces him to stand up and go public with his intentions to save the city. This negates all of Murdock's information from Blake, which Urich was going to publish.In the wake of Fisk's public revelation, Murdock, Page, Nelson, and Urich begin searching for something from Fisk's past that they can use against him. Murdock visits Marianna at her art gallery, hoping to gain insight into Fisk by speaking with her, and encounters Fisk himself. Nobu demands a promised city block from Fisk, who agrees on the condition Nobu provide him with a \"specialist\" in return to deal with the vigilante. The block, which Fisk has bought from Tulley, is where Cardenas lives, and she is one of the few tenants who stands in the way of Fisk gifting it to Nobu. When Cardenas is killed by a junkie, Murdock realizes that Fisk is behind it, and tracks him to an abandoned warehouse, where he is confronted by the specialist: Nobu. Murdock eventually defeats Nobu, accidentally causing him to burn alive, but sustains serious injuries. Fisk then confronts Murdock, beating him nearly to death. Murdock barely escapes, only to collapse at his home in front of Nelson.After Temple tends to Murdock's wounds, Nelson confronts him about his \"blindness\" and vigilante activities. Murdock explains that after experiencing the twisted morals of Landman and Zack, Murdock took it upon himself to confront a paedophilic and incestuous rapist with no legal evidence against him, but who Murdock had discovered through his heightened senses. Since then, he had been doing everything he could to make the city a better place whenever the law could not. Nelson, unable to look past Murdock's lies, leaves their firm. Urich, after the extension on his sick wife's hospital stay is denied and he is offered a better paying job as an editor rather than a reporter, decides to give up the investigation. Page, in an attempt to change his mind, takes him to a rest home she just discovered, where they meet Marlene Vistain, Fisk's mother, who tells them that Fisk killed his father. Fisk, meanwhile, is throwing a charity gala to publicly raise money for victims of the bombings. There, many of the guests, including Marianna, are poisoned.Still recovering from his injuries, Murdock says goodbye to Temple, who is leaving for a time. Before she goes, Temple suggests that he get better protection if he is going to continue his crusade. With the help of Barrett, Murdock finds Melvin Potter, a mentally unbalanced engineer who has been coerced into creating armored clothing for Fisk, and asks him to make a suit of body armor in exchange for stopping Fisk from hurting anyone else. Page wishes to reveal the story of how Vistain is alive, and says that Fisk killed his father, but Urich explains that it is unreliable, given her state of mind. While Fisk will not leave Marianna's side as she recovers in hospital, Wesley receives a phone call from Vistain and learns that Page and Urich visited her. He confronts Page and attempts to blackmail her into not exposing Fisk, threatening to hurt her friends. When Fisk calls Wesley to find out where he is, the ringing distracts him long enough for Page to take his gun, and kill him.Using information from Urich, Murdock finds the base of Gao's heroin operation and dismantles it, with Gao, who can hold her own against Murdock, escaping and deciding to return to her homeland to think about the future. Fisk's men find Wesley, and the grieving Fisk realizes that the last person he talked to was Vistain. Wanting to keep those he loves safe by sending them out of the country, Fisk is unable to convince Marianna to leave him, but does get Vistain away, with the sick Vistain unable to tell him what her call to Wesley was about. Nelson continues his work without Murdock, and takes what they know to Stahl. Page, struggling to get over killing Wesley, convinces Urich to write the story, but it is rejected by Ellison. When Urich accuses Ellison of being paid off by Fisk, he gets fired. Urich decides to start his own blog to get Fisk's story out there, but Fisk's actual informant in the Bulletin tells him that Urich visited Vistain, angering him to the point that he breaks into Urich's apartment and kills him.Murdock and Page attend Urich's funeral, while Fisk learns that Owlsley and Gao conspired to poison Marianna, whom they deemed a distraction, and that Owlsley has been hiding Hoffman as an insurance policy. When Owlsley tries to blackmail him, an infuriated Fisk kills Owlsley by throwing him into an open elevator shaft. Murdock and Nelson reconcile their differences, and begin building their case against Fisk. As the vigilante, Murdock finds Hoffman with information from Stahl and convinces him to testify against Fisk. Acting on this testimony, federal agents arrest Fisk and his co-conspirators, but Fisk manages to escape custody. Before he can flee the city, Murdock intercepts him, wearing the new armor made for him by Potter. After a brutal fight, Murdock defeats Fisk and leaves him to the police. With Fisk arrested, Marianna leaves the city. Murdock, Page, and Nelson celebrate their success and resume their work. The vigilante is named \"Daredevil\" by the media.Season 2In the aftermath of Wilson Fisk's arrest, the firm of Nelson & Murdock enjoys newfound fame within Hell's Kitchen, but only attracts few new clients who can afford to pay their legal fees. While Karen Page manages their financial troubles, Foggy and Matt struggle with Daredevil's surge in popularity and the increased danger to their partnership, firm, and loved ones. Meanwhile, a new assailant arrives in Hell's Kitchen, systematically eliminating rival gangs in their home territory. After the only survivor, Grotto, hires Nelson & Murdock to represent him, Daredevil finds himself in a deadly confrontation with the vigilante and is shot off a building at point blank range.After being severely injured during his fight with the unknown assailant, Foggy insists that Matt recovers before trying to track him down again. Matt enlists the help of an old ally to rebuild the broken pieces of his suit while Foggy and Karen tend to Grotto, who is targeted by the assailant who wants to finish the job. In a deal with District Attorney Reyes, Foggy and Karen secure a witness protection deal in exchange for Grotto procuring incriminating information on a higher-level drug lord, but are double-crossed when Reyes instead uses him as bait for the newly-dubbed \"Punisher.\" During an intense battle between Daredevil and the Punisher, Law Enforcent begin firing recklessly at both of them under Reyes' orders and in the aftermath the two are nowhere to be found.Now captured by the Punisher, Matt engages him in a debate about their vigilante methods while trying to plan an escape. Foggy and Karen deal with the aftermath of Reyes' trap, with Foggy searching for Matt and Karen pursuing their missing client. As the Punisher (now identified as \"Frank\") prepares to intensify his attacks on local gangs, Matt engages him in a series of heated arguments about the morality of their actions, culminating in each questioning and reaffirming their motives. Their debate culminates in Frank strapping a gun with a single bullet to Matt's hand and offering Daredevil a choice: kill him before he kills Grotto, or do nothing so that he can get on with his \"job.\" Matt escapes but cannot save Grotto; at the same time, Frank executes his next attack on a local gang, with the members coming to kill them both. Matt captures Frank but he loses him when he is forced to fight off a swarm of attackers.Finn Cooley, a high-profile member of the Irish mafia whose son was killed by the Punisher, sends his remaining associates in search of him and the money he stole from the mafia. Elsewhere, Karen learns from case files provided by Reyes subordinate, Blake Tower, that the Punisher's real name is Frank Castle, and locates a disgraced surgeon who points her to the Castle household. That night, Castle is captured by the Irish and taken off to be brutally tortured by Cooley who drills through his foot. He gives up the location of the money when Cooley threatens to kill Castle's dog, but the case containing the money is armed with a detonated bomb that kills some of Cooley's men. Cooley prepares to kill Castle, who escapes and kills Cooley and several henchmen. At the same time, Matt arrives at the site and assists a wounded Castle in incapacitating Cooley's remaining henchmen, before weakly carrying him to a nearby cemetery. There, Castle tells Matt about his family, which he reveals was murdered by the mafia. The police arrive and apprehend Castle, and Matt tells Sergeant Mahoney to take credit for the arrest to reinforce the city's hope in the police force. Matt, Foggy and Karen celebrate at Josie's Bar, and Matt and Karen share a kiss in the rain before parting ways. When Matt returns home, he is surprised by the appearance of an old friend, Elektra Natchios.10 years ago, Matt meets Elektra at a ballroom party. The two bond over their shared observational skills and thrill seeking before heading off into the night in a stolen car. They visit the boxing ring used by Matt's late father, where Matt discloses details about his father's death before the two spar and begin having sex midway. Sometime later, they break into the home of Roscoe Sweeney, the man responsible for ordering the death of Matt's father. Sweeney is restrained, and Matt beats him unconscious. Elektra urges Matt to kill Sweeney, but Matt is unable to, which prompts Elektra to abandon him. In the present day, Elektra requests Matt's help on her dealings with her father's company Roxxon Energy Corporation, which Matt refuses, though he spies on a business meeting. That night, he and Karen go on their first date together. Matt visits Elektra's penthouse, where Yakuza members begin to converge on the building. Elektra, who has stolen Matt's costume, advises him to prepare to fight.Matt and Elektra subdue Yakuza assailants that attack Elektra's apartment. Afterwards, they talk in a diner and Matt reluctantly agrees to continue helping her. Matt, Foggy and Karen meet with the public defender on the Punisher case, who reveals that Castle could be facing the death penalty for links to crimes outside New York. This prompts Matt to consider defending Castle himself. Their meeting at the hospital is interrupted by Reyes, who is insisting on giving Castle the death penalty. She is told off by Matt, but his involvement in the case is cut short when Elektra recruits him to steal a valuable Yakuza ledger from the Roxxon building. While the two succeed in their heist and narrowly escape, Karen reveals to Castle that she broke into his home and discovered private details about his family. The two quietly converse over this until Foggy comes in and informs Castle that he's managed to shorten the latter's charges to one life sentence, as long as he pleads guilty. Castle agrees, but when stating his plea to Reyes and the judge, he suddenly pleads not guilty and threatens Reyes. When Matt returns to the firm, Foggy informs him The People v. Frank Castle has begun.Castle's trial begins. Matt neglects his work on Castle's case to continue moonlighting with Elektra. The two then raid a train car and get into an extended fight with the Yakuza, only for Elektra to be wounded. After, Matt tends to her wounds and asks why she left him, only to be told he \"deserves better\". The next morning, Matt is late to make his opening statement at Castle's trial and a reluctant Foggy is forced to take over for him. Matt's relationship with Karen and Foggy now continues to deteriorate. Matt reveals his work with Elektra to Foggy and Foggy, who he assumes is having an affair with her, suggest Matt leaves the case. That night, Matt and Elektra force a local corrupt professor to decrypt the yakuza's ledger and it leads them to an abandoned warehouse where they discover the Yakuza are digging a giant hole.Matt and Elektra are attacked by ninjas and saved by Stick. Elektra is cut by a poisoned sword and rushed back to Matt's apartment so Stick can save her. Stick reveals that Elektra works for him, then tells Matt about The Hand and their purpose in New York. In court, Foggy begins to sway the jury in Castle's favor. Matt offers to take Elektra back if she'll leave Stick and swear not to kill anymore. Karen comes by and is devastated to see a recovering Elektra in Matt's bed. In court the next day, Frank takes the stand and purposefully wrecks his own defense. Karen and Foggy berate Matt for allowing them to lose. Elektra tells Stick that she's leaving him to be with Matt; Matt and her share a close moment before they're attacked by an assassin. They subdue him and discover that he's just a kid, only Elektra impulsively slits his throat much to Matt's horror. Castle enters prison and is led by a guard into a meeting with Wilson Fisk.Fisk arranges a meeting with Castle, who reluctantly agrees to a deal which involves killing Fisk's rival in the prison who is able to provide information on the massacre of his family. Betrayed by Fisk, Castle single highhandedly slaughters a swarm of henchmen of the man he had just killed and is placed in solitary. After an intense brawl with Fisk, he is smuggled out of prison, now able to find the mastermind behind his family's massacre named the Blacksmith, while promising Fisk that he will kill him the next time they see each other. Matt and Elektra fall out for good over Elektra's indifference to killing. Foggy and Matt reluctantly agree to part ways after Nelson & Murdock collapses. Karen confirms the John Doe at the carousel was really an undercover cop, knowledge Castle learned from his cell block victim. Matt as Daredevil learns the accountant's son is one of several children held for a medical experiment by Nobu, the now resurrected Yakuza leader. Nobu manages to escape with a device to which the children were hooked. Matt wonders whether Stick's claim that the Hand has discovered immortality can be true.Matt as Daredevil arranges hospital treatment for the children who'd been hooked up to Nobu's blood extractor. Reyes brings Foggy & Matt to her office to get information on Castle that may keep her family alive. Foggy & Matt won't break attorney-client privilege, forcing Reyes to tell the whole story of the carousel massacre---a major drug deal gone awry as Blacksmith, its mastermind, failed to show when learning of the undercover cop, and tensions spilling into the gun fight that killed the cop and Castle's family. Reyes admits to covering the entire matter up for fear of career ruin---including threatening the medical examiner and approving Castle's do-not-resuscitate. Before she can divulge more details, a firestorm of bullets riddles the office. Reyes is killed and Foggy is injured. Matt learns Castle was taken to Fisk's cellblock and visits Fisk, a visit ending in a fight when Matt unsuccessfully blackmails Fisk into revealing his involvement by assuring he will never see Vanessa again. Karen learns the hard way that Castle may not have been involved in the attack on Reyes's office---a similar attack happens at her apartment while Castle himself visits and saves her. Elektra kills a charming assassin sent to kill her---by Stick. Matt on the hospital roof prepares to confront a horde of the Hand who might attack either Foggy or the recovering children.Daredevil takes on the ninjas assaulting the hospital. He's shocked that the children want to return to them. As Matt, he explains to Claire Temple about the ninjas. An attempted autopsy on one of the slain Ninjas shows the scars of a prior autopsy. The hospital board chief is just as shocked---and bent on covering everything up, compelling Claire to quit after Foggy's release. Foggy ponders an offer from his occasional girlfriend involving joining her law firm. Karen lies to a detective about the attack on her apartment but accepts police protection. Matt confronts her and she tells him she doesn't think Castle was behind the D.A.'s and medical examiner's deaths. Karen slips her police protection to meet Castle at a greasy spoon. Castle admits he used her as bait to lure those he thinks are following her. Matt thinks Madame Gao is Blacksmith's competitor and she reluctantly sends him to the pier. He talks Castle out of killing a man claiming to be Blacksmith. Stick learns Elektra survived the hit. Blacksmith's men arrive and shoot up the boat, detonating gunpowder and exploding the ship.Matt stops Elektra from killing Stick as ninjas descend on them and they must fight together, but Matt and Elektra can't stop the Hand from taking Stick. Matt vows to find him, while Elektra vows to kill him. Police clean up the pier mess and Karen insists Castle isn't dead. She tracks down Castle's commander in Afghanistan, Ray Schoonover, then discovers Schoonover's involvement in the drug ring that led to the slaughter of Castle's family. Castle shows up to keep Schoonover from killing Karen. Daredevil and Elektra track the Hand and find Stick bound and tortured. Nobu is also present. The Hand's true motive is disclosed, as is the missing link in Elektra's haunted past. Elektra finally saves Stick. Daredevil escapes the Hand with Nobu determined to stop him.Foggy meets with Jeri Hogarth to discuss joining her firm. With Stick safe at Matt's apartment, the Hand raids a police station for information on people Daredevil has helped. When Matt learns of it, he fears especially for Karen. Matt and Elektra use a police transmission to find the beneficiaries the Hand rounded up. The hostages are freed, exposing a trap intended for Daredevil. Matt and Elektra make a pact to stay together after defeating the Hand, even leaving New York. Nobu arrives and attacks Daredevil, but Elektra sacrifices herself for him. An enraged Daredevil takes on the remaining ninjas with unexpected help---from Castle. Stick returns to finish off Nobu, then mourns Elektra with Matt. Foggy accepts the offer from Hogarth's firm, formally ending Nelson & Murdock, and has a final drink with Karen before a final talk with Matt. Castle burns down his family's home, after taking a CD labelled \"Micro\". Matt reveals to Karen that he is Daredevil. The Hand recovers Elektra's body."}