{"mid": "DarkmanIITheReturnOfDurant", "IMDB_id": "tt0109552", "title": "Darkman II: The Return of Durant", "plot": "Scientist Peyton Westlake (Arnold Vosloo) has re-located to an abandoned building connected to an abandoned subway track, and continues to work on his synthetic skin cell formula, funding his research by \"taking donations\" from criminals he has thwarted. His synthetic skin still has a 99-minute timeframe before light cells cause it to break down, and he continues to search for a way to solve the problem.\nRobert G. Durant, who appeared to die in the first film, (how exactly he survived the crashing of the helicopter and subsequent explosion is never revealed) managed to escape alive, and awakens from a coma. Durant and his men plot to break out a prison inmate named Alfred Hathaway and use his knowledge to build futuristic particle-beam weaponry in order to gain power in the criminal underworld of the city.\nWestlake meets and befriends a scientist named David Brinkman (Jesse Collins), who is also working on a synthetic skin formula. Brinkman manages to break past the 99 minute photosensitivity reaction that causes Westlake's skin to break down in the light. However, after refusing an offer from Durant's men to buy his building (which they want for their particle-weapon scheme), Durant orders Brinkman killed. Durant's men torture Brinkman before killing him. Westlake discovers his body, and upon observing Brinkman's body missing a finger (Durant's calling card), is able to deduce that Durant is alive and responsible for Brinkman's death.\nA reporter named Jill Randall (Kim Delaney) discovers that Peyton Westlake is still alive while investigating Durant. She befriends Westlake but is later killed in a car bombing by Durant after broadcasting a story on him and his criminal operations.\nWestlake then learns that Durant is trying to again purchase Brinkman's building, this time from his sister Laurie (Renee O'Connor). He sets out to protect her from Durant. After she is captured, Westlake uses his synthetic skin to make masks and disguise himself as Durant's men. He infiltrates Durant's lair. In an ensuing battle, Durant's men, Dr. Hathaway, and a group of men who were intending to buy his particle weapons are all killed. Durant attempts to flee in his car, however, Westlake has equipped it with an explosive charge. Durant is ironically killed much in the same way that he had earlier murdered Jill Randall, and Laurie is saved.\nPeyton Westlake later sees a news report on Jill Randall's death, and Durant, who is publicly revealed alive and deceased once more. Tipping his hat to the departed Jill Randall, Darkman silently vows to continue working on his synthetic skin cell formula and his fight against crime and injustice."}