{"mid": "DarkestHour", "IMDB_id": "tt0475247", "title": "Darkest Hour", "plot": "Firestar is now the leader of ThunderClan, following the death of Bluestar and he receives his nine lives at the Moonstone. During the ceremony StarClan tells him the prophecy \"Four will become two, Lion and Tiger will meet in battle, and blood will rule the forest\". He chooses as his deputy Whitestorm, an experienced warrior who is old, but well-respected in the Clan. At the next Gathering, Tigerstar attempts to unify all four Clans claiming that it would help the Clans survive. While Leopardstar agrees, Tallstar and Firestar both refuse to join this alliance, which Tigerstar has called \"TigerClan\". Accompanied by Ravenpaw, who is on a visit to ThunderClan, Graystripe and Firestar go to RiverClan and find that Graystripe's kits, Stormpaw and Featherpaw, and Bluestar's kits, Mistyfoot and Stonefur, are being held prisoner because of their half-Clan heritage. Since they are all half-ThunderClan and half-RiverClan, Tigerstar accuses them of being half-Clan cats and therefore, in his opinion, traitors. Firestar, Graystripe, and Ravenpaw manage to rescue Mistyfoot, Stormpaw, and Featherpaw, but Stonefur is killed by Darkstripe and Blackfoot when he refuses to kill Stormpaw, who is also his apprentice.\nIn an attempt to convince Tallstar and Firestar to join his alliance, Tigerstar reveals to them about the BloodClan, a vicious group of rogues that lives in the alleys of a nearby twolegplace (human town). When both leaders still refuse, Tigerstar then orders BloodClan to fight for him, but they do not do so, as they only listen to the commands of their leader, Scourge. Scourge tells Tigerstar that he is the only cat in charge of BloodClan, and after Firestar tells everyone Tigerstar's bloodthirsty history and that he cannot be trusted to divide power, Scourge decides that there will be no battle. Tigerstar attacks Scourge, but Scrouge then kills him easily with his claws, which are reinforced with dead cats' and dogs' claws, ending all nine of Tigerstar's lives with one blow, by cutting him open from chin to tail. Scourge then gives all of the forest Clans three days to leave; otherwise, they will have to fight BloodClan for the forest. To face this danger, the four Clans unite, forming an alliance which is known as \"LionClan\". During the battle, Whitestorm is killed by Bone, the BloodClan deputy, but Bone is killed soon afterwards when a group of apprentices avenge Whitestorm's death. The apprentices were Featherpaw, Stormpaw, Tawnypaw, and Bramblepaw. The battle is won when Firestar kills Scourge, though he loses one of his own nine lives in the process. Without its leader, BloodClan scatters. With the forest returned to normal, the four Clans become independent once more."}