{"mid": "DarkShadows", "IMDB_id": "tt1077368", "title": "Dark Shadows", "plot": "In 1760, the Collins family moves from Liverpool, England to Maine and establishes the fishing town Collinsport, where they built their estate, Collinwood.\nWhen he first arrives, the young son Barnabas (Johnny Depp), meets the young Angelique Bouchard (Eva Green) who instantly falls in love with him. Angelique's witch mother who was with her at that time warned her of socializing with people of noble birth. This, however, did not stop Angelique from following the family for many years, hoping to be noticed by Barnabas.\nIn 1776 (that is, 16 years later), Barnabas, now a grown man, falls in love with a young woman named Josette du Pres (Bella Heathcote), scorning Angelique who was now working as a maid in his household. Turning to black magic, Angelique curses the Collins family, first killing Barnabas's parents (Ivan Kaye and Susanna Cappellaro) in an assumed accident, then by enchanting Josette to leap to her death off a cliff. In a fit of grief, Barnabas attempts to leap to his own death but that fails as well, as Angelique has cursed him to the immortal life of a vampire. When he still rejects her advances, she turns the town against him, and he is buried alive in a coffin.\nIn 1972 (that is, 196 years later), the young Maggie Evans (also Bella Heathcote), under the assumed identity of \"Victoria Winters\", applies for a job as a governess at Collinwood and meets with the current reclusive matriarch Elizabeth Collins Stoddard (Michelle Pfeiffer). Her nephew David (Gulliver McGrath), for whom Victoria will be caring, believes his mother, who drowned in a boating accident, still visits him. Victoria does not divulge that since her young age she, too, can see ghosts.\nAfter meeting with David, his live-in psychiatrist Julia Hoffman (Helena Bonham Carter), his father Roger (Jonny Lee Miller), and Elizabeth's rebellious daughter Carolyn (Chloë Grace Moretz), Victoria is hired by Elizabeth. That night, Victoria sees the ghost of Josette who warns that \"He's coming\" before disappearing after falling from a chandelier.\nElsewhere, a group of construction workers dig up Barnabas's coffin and inadvertently free him. After sating his blood thirst of 196 years, and shocked by the modern times he finds himself in, Barnabas returns to Collinwood, and hypnotizes the groundskeeper Willie Loomis (Jackie Earle Haley) as his personal Renfield, and introduces himself to the family as a \"distant relative\". Elizabeth believes him to be a con man until he reveals hidden riches buried in a secret room within the house, when Elizabeth thought the family to be destitute. After realizing who and what Barnabas is, she asks to keep it a secret, barely passing him off as a distant cousin.\nBarnabas is instantly smitten with Victoria when he meets her as she resembles Josette. He seeks out Carolyn's advice on courting her. Angelique, now an immortal witch herself, visits Barnabas and threatens him not to go into business competition against her. Nevertheless, Barnabas reopens the Collins family cannery business and uses hypnosis to steal several of the fisherman crews who work for Angelique. She tries to buy him off. Even after an episode of supernatural lust between the two of them, he rejects her offer. Julia discovers his identity by hypnotizing him and offers to cure his vampiric condition via blood transfusions.\nBarnabas wants to hold a ball to reintroduce the family to the townsfolk. Carolyn suggests they make it a happening with musician Alice Cooper as the headliner. At the ball, Barnabas catches Roger stealing from guest's coats. Victoria reveals to Barnabas that she's actually an escapee from the mental asylum where her parents had her confined since she was a child due to her powers.\nAngelique makes a grand appearance in order to seduce Barnabas. When she catches him kissing Victoria, she becomes even more embittered. Barnabas, on his part, wishes even more desperately to be mortal again. Barnabus finds out Julia has been using his blood to make herself immortal, so he kills her and dumps her body into the bay with Willie's help. After catching Roger trying to break into the secret room, Barnabas gives him a choice: to stay and be an exemplary father to David or leave with enough money to live his life alone. Roger chooses the latter, to David's heartbreak. Barnabas's true identity is finally revealed to the rest of the family and Victoria when he saves David from a falling disco ball. Victoria is scared by the revelation and runs away.\nAngelique summons Barnabas again to her office, but when he rejects her offer of partnership once again, she traps him into another coffin, this time burying him in a mausoleum. Shortly after, he is found and freed by David, alerted by his mother's ghost. Meanwhile, Angelique destroys the Collins's factory and implicates Barnabas in the murders of Julia and all the people he had to feed on, turning the townsfolk against the family.\nAt the mansion, Elizabeth and Barnabus see the police, Angelique, and the angry mob approaching as Caroyln withdraws into the mansion. Barnabas reveals his and Angelique's true nature in front of an angry mob and a fight ensues. During the fight following the mob's departure upon these revelations, Carolyn reveals she is a werewolf, a massive fire breaks out in the house. Ultimately, the ghost of David's mother (Josephine Butler) manages to hurl Angelique against the chandelier, which then falls to the ground, mortally wounding her as she starts to shatter. She literally offers her heart to Barnabas again, but he refuses it and it turns to dust and she dies. David learns from his mother that Victoria is headed toward the cliffs where Josette committed suicide. David asks Elizabeth what the Collins family will do now, and Elizabeth says they will do what they've always done: \"endure.\"\nAfter catching up to Victoria at the cliffs, Barnabas refuses to turn her into a vampire. Victoria throws herself from the cliffs; he leaps after her, biting her so she can survive the fall as a vampire. She awakens, asking him to call her Josette, and the two kiss passionately on the rocky shore.\nMeanwhile, at the bottom of the bay, Julia, who had been assumed dead, suddenly opens her eyes to her new immortal life as well."}