{"mid": "DarkwingDuck", "IMDB_id": "tt0101076", "title": "Darkwing Duck", "plot": "Darkwing Duck starts out as the resident superhero of the city of St. Canard. He is a loner with seemingly no personal life or dual identity. He has a big ego but fame eludes him. His first big case involves facing crime boss Taurus Bulba and rescuing his intended victim Gosalyn Waddlemeyer, an orphan girl. During the case, Darkwing meets pilot Launchpad McQuack. Launchpad is his biggest fanboy and introduces Darkwing to a special flying vehicle: the Thunderquack. Darkwing gets almost killed during the case but succeeds.Following this success, Darkwing adopts Gosalyn and moves in with her and Launchpad. The trio live in a suburban residence. Darkwing now has a civilian identity, Drake Mallard. The trio leads normal lives by day and fight crime by night. Gosalyn herself tries out different superhero identities to follow in her father's footsteps. Her recurring identity is the alias \"Quiverwing Quack\".The Mallards live next door to the fellow suburbanite family, the Muddlefoots. Father Herb is a Quackerware salesman (Quackerware being a local version of Tupperware). He is dim-witted and overly friendly, getting on Drake's nerves. He is obsessed with the sitcom \"Pelican's Island\" (a version of \"Gilligan's Island\"). Mother Binkie is a stereotypical 1950s housewife. She is ladylike, cooks, cleans, and tries to be active in the local community. Their older son Tank is a stereotypical bully. Their younger son Honker is a child prodigy and aspiring scientist, but timid and socially awkward. He serves as best friend and reluctant crime-fighting partner to Gosalyn.Darkwing and his group face several villains, both super-powered and mundane. The most prominent are Darkwing's evil doppelgänger Negaduck, half-duck/half-plant scientist Dr. Reginald Bushroot, liquid-controlling Liquidator, electricity-controlling Megavolt, insane jester and toymaker Quackerjack, international terrorist Steelbeak, ego-maniac film director Tuskernini, and super-powered artist Splatter Phoenix.Darkwing also gains further allies throughout the series. The most prominent are Duckburg's superhero Gizmoduck (who tends to overshadow Darkwing), sorceress and reformed criminal Morgana MacCawber (Darkwing' main love interest), self-proclaimed protector of the sea Neptunia, and humanoid-stegosaurus Stegmutt."}