{"mid": "DaydreamNation", "IMDB_id": "tt1581835", "title": "Daydream Nation", "plot": "Seventeen-year-old Caroline Wexler (Kat Dennings) and her father move from a large city to a small town where an industrial fire burns endlessly and many of the students in her new high school seems to be permanently stoned. One of Caroline's classmates, Thurston Goldberg (Reece Thompson), quickly falls for her after they first meet at a party. Caroline is attracted to her high school English teacher Mr. Anderson (Josh Lucas) and the two begin to have sex.\nOn Halloween, Thurston and his best friends Paul (Landon Liboiron), Charles (Jesse Reid) and Craig (Calum Worthy) spend most of the day getting stoned and inhaling cleaning products which later causes Craig to have a violent seizure during health class. Afterwards, Mr. Anderson cancels his plans with Caroline in order to help the health teacher Ms. Budge (Rachel Blanchard). Mr. Anderson tells Caroline that they should probably go out with other people to avoid looking suspicious, and blows Caroline off on the phone. Feeling upset, Caroline goes out with Thurston where they end up having sex in her car. He admits to her that he was a virgin until that night.\nThe next day, Mr. Anderson apologizes to her, but says that their relationship must be as discreet. They make up and Caroline spends the night after reading Mr. Anderson's draft of his new novel. Thurston continues to try to pursue Caroline, coming to her home with cupcakes. After he is rejected at the door by Caroline's father (Ted Whittall), Thurston's mother (Andie MacDowell) intercedes on his behalf, which leads to her and Caroline's father sharing intimate moments over drinks. Caroline eventually realizes that Mr. Anderson is deeply dysfunctional, and breaks off the relationship in favor of Thurston. In return, Mr. Anderson does everything to sabotage the budding romance, and Caroline's life descends into chaos. Meanwhile, the local TV station, KCRR reports that there is a serial killer who killed a high school cheerleader.\nAs Caroline and Thurston's relationship develops, Mr. Anderson becomes even more unstable. He tells Thurston that he was just a cover, and on a rampage, Thurston breaks up with Caroline. Caroline leaves and goes to confront Mr. Anderson, who is on the verge of a mental breakdown. After Caroline leaves, he tries to commit suicide but shoots himself in the leg instead. Caroline goes to try to find Thurston and calls him while driving, leaving a message telling him to stay at the Christmas party where she will go to find him and that she loves him.\nIn the meantime, Thurston goes to the Christmas party and almost has sex with another girl, Jenny (Katie Boland) who is obsessed with him. Caroline inadvertently crashes her car into the serial killer, who dies from his injuries. She is thought to be a hero and gets back together with Thurston. Ms. Budge shows up at Mr. Anderson's home to tell him the serial killer is dead and takes him to the hospital to treat his injured leg."}