{"mid": "DaysOfWineAndRoses", "IMDB_id": "tt0055895", "title": "Days of Wine and Roses", "plot": "San Francisco public relations executive Joe Clay (Jack Lemmon) meets and falls in love with Kirsten Arnesen (Lee Remick), a secretary. Kirsten is a teetotaler until Joe introduces her to social drinking. She is reluctant at first, but after her first few Brandy Alexanders, she admits that having a drink \"made me feel good.\" Despite the misgivings of Kirsten's father (Charles Bickford), who runs a San Mateo landscaping business, they marry and have a daughter named Debbie.\nJoe and Kirsten slowly go from the \"two-martini lunch\" to full-blown alcoholism. Joe is demoted due to poor performance, and is sent out of town to work on a minor account. Kirsten is alone all day, and finds the best way to pass the time is to drink. While drunk one afternoon, she causes a fire in their apartment and almost kills herself and their child. Joe eventually gets fired, and goes from job to job over the next several years.\nOne day, Joe walks by a bar and looks at his reflection in the window, and finds to his horror that he barely knows his own face. He goes home and tells Kirsten that they have to stop drinking, and she reluctantly agrees. Seeking escape from their addiction, Joe and Kirsten work together in Mr. Arnesen's business and succeed in staying sober for two months. However, the urges are too strong, and after a late-night drinking binge, Joe destroys his father-in-law's greenhouse and plants while looking for a stashed bottle of liquor.\nJoe is committed to a sanitarium, where he suffers from delirium tremens while confined in a straitjacket. After his release, Joe finally gets sober for a while, with the help of Alcoholics Anonymous, a dedicated sponsor named Jim Hungerford (Jack Klugman) and regular AA meetings. He explains to Joe how alcoholics often demonstrate obsessive behavior, pointing out that Kirsten's previous love of chocolate may have been the first sign of an addictive personality, and counsels him that most drinkers hate to drink alone in the company of sober people.\nMeanwhile, Kirsten's drinking persists, and she disappears for several days without alerting Joe. Kirsten is eventually located at a nearby motel, drunk, but when Joe tries to help her, he instead ends up drinking again. When their supply runs out, Joe happens upon a liquor store that closed for the night, breaks in, and steals a bottle, resulting in another trip to the sanitarium stripped down and tied to a treatment table. Hungerford appears at his side and warns him that he must keep sober no matter what, even if that means staying away from Kirsten.\nJoe finally gets sober, becomes a responsible father to Debbie and holds down a steady job. He tries to make amends with his father-in-law by offering him a payment for past debts and wrongs, but Mr. Arnesen accuses him of being indirectly responsible for Kirsten's alcoholism. After calming down, Arnesen says that Kirsten has been disappearing for long stretches of time and picking up strangers in bars.\nOne night, after Debbie is asleep, Kirsten, shakily sober for two days, comes to Joe's apartment to attempt a reconciliation. Joe replies that she is welcome back anytime, but only if she stops drinking. Kirsten refuses to admit she's an alcoholic, but does acknowledge that without alcohol, she \"can't get over how dirty everything looks.\" Kirsten sadly advises Joe to give up on her, and leaves. Joe fights the urge to go after her, and looks down the street as she walks away. When Debbie asks \"Daddy, will Mommy ever get well?\" he replies gently, \"I did, didn't I?\" Again Joe looks down the street, the bar's flashing sign reflecting in his window."}