{"mid": "DazedAndConfused", "IMDB_id": "tt0106677", "title": "Dazed and Confused", "plot": "It is May 28, 1976, the last day of school at Lee High School in the suburbs of Austin, Texas. The next year's group of seniors are preparing for the annual hazing of incoming freshmen. Randall \"Pink\" Floyd (Jason London), the school's star football player, is asked to sign a pledge promising not to take drugs during the summer or do anything that would, \"jeopardize the goal of a championship season\". When classes end, the incoming freshman boys are hunted down by the seniors and paddled. The incoming freshman girls are also hazed; they are rounded up in the school parking lot by senior girls, covered in mustard, ketchup, flour and raw eggs, and forced to propose to senior boys.\nFreshman Mitch Kramer (Wiley Wiggins) escapes the initial hazing with his best friend Carl Burnett (Esteban Powell), but is later cornered after a baseball game and violently paddled. Fred O'Bannion (Ben Affleck), a senior participating in the hazing tradition for a second year after failing to graduate, delights in punishing Mitch. Pink gives the injured Mitch a ride home and offers to take him cruising with friends that night. Plans for the evening are ruined when Kevin Pickford's (Shawn Andrews) parents discover he planned to host a keg party. Elsewhere, the intellectual trio of Cynthia Dunn (Marissa Ribisi), Tony Olson (Anthony Rapp), and Mike Newhouse (Adam Goldberg) decide to participate in the evening's activities. Pink and his friend David Wooderson (Matthew McConaughey), a man in his early 20s who still socializes with high school students, pick up Mitch and head for the Emporium, a pool hall frequented by teenagers.\nAs the evening progresses, students loiter around the Emporium, listen to rock music, cruise the neighborhood and stop at the hamburger drive-in. Mitch is introduced to sophomore Julie Simms (Catherine Avril Morris), with whom he shares a mutual attraction. While cruising again with Pink, Pickford, and Don Dawson (Sasha Jenson), Mitch drinks beer and smokes marijuana for the first time. After a game of mailbox baseball, a neighborhood resident brandishing a gun threatens to call the police. They barely escape after the resident fires at their car. After returning to the Emporium, Mitch runs into his middle school friends. They hatch a plan to get revenge on O'Bannion. The plan culminates with them dumping paint on O'Bannion, who leaves in a fit of rage.\nAfter the Emporium closes, an impromptu keg party is planned in a field under a moonlight tower. Cynthia, Tony and Mike arrive at their first keg party, where Mike is threatened by tough guy, Clint Bruno (Nicky Katt). Tony runs into freshman Sabrina Davis (Christin Hinojosa), whom he met earlier during the hazing, and they begin hanging out together. Cynthia likes Wooderson and exchanges phone numbers with him. Mike, suffering from the humiliation of his confrontation with Clint, decides to make a stand, punches him, and gets tackled. The fight is broken up by Pink and Wooderson. Football player Benny O'Donnell (Cole Hauser) confronts Pink about his refusal to sign the pledge. Pink, the only player not to have signed, believes it violates his individuality and beliefs. Mitch leaves the keg party with Julie. They drive to a nearby hill overlooking town to make out. Tony gives Sabrina a ride home and they kiss good night.\nAs night turns to dawn, Pink, Wooderson, Don, Ron Slater (Rory Cochrane) and several other friends decide to smoke marijuana on the 50-yard line of the football field. The police arrive, so they ditch the drugs. Recognizing Pink, the police call Coach Conrad, his football coach. Conrad lectures Pink about hanging out with \"losers\" and insists that he sign the pledge. Pink says that he might play football, but he is not going to sign the pledge. Pink leaves with his friends to get tickets to an Aerosmith concert. Mitch arrives home after sunrise to find his mother has waited up for him. She decides against punishment but warns him about coming home late again. Mitch goes to his bedroom, puts on headphones and listens to \"Slow Ride\" by Foghat as Pink, Wooderson, Slater and Simone Kerr (Joey Lauren Adams) travel down a highway to purchase their tickets."}