{"mid": "DeadAndDeader", "IMDB_id": "tt0770739", "title": "Dead & Deader", "plot": "After communications to a small medical outpost in Cambodia was cut off, a U.S. special-forces squad was sent to investigate. After they failed to report back, a second squad is sent. As they approach the outpost, they are attacked by zombies. After killing the zombies, they are attacked by an infected researcher who commits suicide with a grenade. Second-in-command Lieutenant Bobby Quinn survives with heavy injuries. He radios for a medivac airlift, then falls unconscious.\nQuinn wakes up on an exam table at Ft. Preston Army Base. The shocked coroner, Dr, Flutie, explains that he arrived in a body-bag the previous evening and had been pronounced DOA, as he has no vital signs. Quinn learns that the rest of his squad is dead. Suddenly feeling a pain in his right arm, Quinn grabs a scalpel and cut it open. Gushing out of the wound is green blood and a strange scorpion, which he crushes. The incision then rapidly heals. Quinn and Flutie relate their findings to Dr. Boyce, who keeps Quinn quarantined. Quinn, determined to find out what happened to himself and his squad, resists her directives. Boyce fails to sedate Quinn, and finds that he now possesses superhuman strength. She eventually reveals that another members of his squad, Sergeant Cruz, is in the morgue scheduled for cremation, and the other bodies were being taken elsewhere. Quinn demands to see Cruz, and Boyce takes him to Dr. Langdon's office, where they learn that Cruz is missing. The three tracks Cruz to the kitchen, where he is attacking the cook, Judson. As they try to intervene, Cruz infects Boyce and Langdon, forcing Quinn and Judson to destroy all three. Quinn begins feeling intense hunger that can only be dulled by ingesting raw, red meat. Quinn and Judson are then taken into custody by Major Bascom, who refuses to believe Quinn's story.\nQuinn and Judson escape, determined to track down the remaining squad-members. They locate the truck used to transport the bodies, but find it wrecked and covered in blood. While following the trail, they stop at a small road-side bar, where they meet Holly, a part-time bartender. The local news has already aired a report about the killings at Fort Preston, labeling Quinn and Judson suspects. The bar patrons lock them inside the cooler. Afterwards, Quinn's infected squadmates attack the bar and infect the patrons. Holly free the two soldiers, and the three fight their way out. They hijack a police vehicle (having arrived to arrest Quinn and Judson) and drive away. Quinn realizes that one member of his squad, Bill Sanderson, hasn't shown up. After changing their clothes, the trio go to his house in Los Angeles. At the house, Quinn is stricken by another wave of hunger and eats some food from the fridge. The neighbor next door, Mrs. Wisteria, enters the house. They learn from her that Sanderson was taken to a funeral home. She then drives them to the place, but the funeral director tells them the body had already been claimed the previous evening. Frustrated, the group prepares to leave, but a van pulls up and the occupants stop them at gunpoint.\nTheir captors are mercenaries hired by a Dr. Scott and his partner Dr. Adams. In their lab, Quinn sees Sanderson chained up. Scott reveals that he learned of the \"jindu\", the Cambodian scorpion-like creatures and how their venom can revive dead tissues. He plans to use it for profit, and to cure his own cancer. Scott brings Mrs. Wisteria closer to Sanderson, who bites her and she soon transforms into a zombie. Scott confirms that the \"second-generation\" zombies are mindless killers. Only those stung by the jindu can retain their personalities, as long as the creature does not reach their hearts. A mercenary kills Wisteria, and an enraged Quinn kills Sanderson before being knocked out.\nWhen Quinn awakens, Scott and Adams prepare to leave for Fort Preston. They lock him up with Holly and take Judson with them. Quinn, overcome by hunger, attacks Holly. He leaps at her and misses, shattering the two-way mirror that leads into Adams' lab. Inside, he finds a mini-fridge, devours the raw meat inside and comes back to his senses. Scott's group reaches Fort Preston, now overrun with zombies (presumably from a body of the first squad's member). Scott plans to capture this zombie and acquire the jindu inside. They fight their way in, unaware that Quinn and Holly have caught up with them. Scott takes Judson's security keycard and leaves him to the zombies. They enter the morgue containing the original zombie, and lock themselves inside while a mass of undead hammer at the door. Scott cuts into the zombie's chest. As he extracts the jindu, the zombies breaks down the morgue's door. The two mercenaries with Scott are killed and Adams is wounded. As Quinn and Holly burst inside the morgue, Scott drops the jindu and Quinn crushes it. Two zombie soldiers rip off Scott's arms before Quinn and Holly shoot them down. After killing all the zombies in the morgue, Holly shoots Adams before she transforms. Quin and Holly then leave.\nOutside, they find that Judson is still alive by hiding in a trash chute. Quinn takes explosives from the armory, and set it up near the ammunition storage to destroy the entire base. As Quinn looks for an escape vehicle, Judson and Holly lure the zombie to approach the ammunition storage. They narrowly escape as the base goes up in flames. After making sure no zombies survive, they walk away together."}