{"mid": "DeadEndDriveIn", "IMDB_id": "tt0090915", "title": "Dead End Drive-In", "plot": "In the near future, the economy has collapsed and massive crime waves sweep the inner cities. The manufacturing industry has shrunk to the point where cars are a commodity and parts are fought over between salvage companies and roving gangs. In an attempt to control the crime-wave, a chain of drive-in theatres are turned into concentration camps for the undesirable and unemployed youth. The dirty, graffiti-laden drive-ins are surrounded by high fences, and the roads leading to them are Security Roads (\"S-Roads\") that do not allow walking under any circumstances. Police collaborate with the owner to sabotage cars of unsuspecting visitors; however, some who know the true nature of the drive-ins come voluntarily for the shelter and food. Broken cars are continuously collected at these facilities. The prisoners are allowed easy access to a wide variety of drugs, alcohol, junk food, exploitation films, and new wave music. This, coupled with the awful conditions on the outside, engineers an atmosphere of complacency and hopelessness so the inmates will accept their fate and not attempt escape.\nJimmy, a young health nut who is nicknamed Crabs, sneaks off with his brother's vintage 1956 Chevy to take his girlfriend, Carmen, to the local Star Drive-In. He tells the owner they are unemployed to get a discounted rate. While Crabs is intimate with Carmen, the back tires of his car are stolen, and Crabs soon discovers the police are responsible. Crabs complains to the owner, but he refuses to help until morning. The next morning, Crabs and Carmen are amazed at the number of cars still there, many of which have turned into hovels. The owner, Thompson, pretends to fill out a report and enters them both into the system. He lets them know they will be there for a while, as there are no buses or cabs, and gives them a stack of meal tickets to use at the run-down cafe. Time drags on, and Crabs makes several attempts at escape that are thwarted.\nForegoing an attempt to climb a fence he discovers is electrified, he locates the tires he needs but learns his gas has been drained. He steals gas from a police vehicle, but then finds his engine stripped. Suspecting that Thompson, who receives a stipend for each prisoner, is behind the sabotage, Crabs warns him not interfere again. Further complicating matters are the verbal and physical fights Crabs continues to have with one of the racist gangs. During this time, Carmen makes no attempt to avoid the unhealthy eating and drug culture at the camp. She becomes friends with several of the female inmates, who are successful at indoctrinating her to the encampment's bizarre racist mentality that Asians are to somehow blame for their problems, a situation exacerbated by the arrival of foreigners trucked into the camp. All attempts to talk sense into her fail, and Crabs soon realizes that she has succumbed to the hopelessness that pervades the encampment.\nCrabs attempts one more spectacular effort at escape: while the majority of the encampment, including Carmen, attends a racist meeting, he hijacks a tow truck. He attempts to sneak out peacefully, but is recognized by Thompson. This leads to a car chase inside the encampment; the police fire automatic weapons at the tow truck, which frightens the prisoners who are hiding in the cafe. Eventually, Crabs crashes but manages to elude the police on foot. He finds Carmen and unsuccessfully attempts to reason with her; he kisses her and wishes her well. Crabs disarms Thompson and forces him to delete his profile, but his escape attempt ends in a violent confrontation with the police; Thompson is accidentally killed, and the remaining policeman hunts down Crabs. Using a ramp near the entrance, Crabs launches his tow truck over the fence and lands on the S-Road."}