{"mid": "Deadpool", "IMDB_id": "tt1431045", "title": "Deadpool", "plot": "The opening scene shows Wade Wilson, the superhero Deadpool (Ryan Reynolds) in a cab, bored in the backseat. He slides up front to chat with the cabbie, Dopinder (Karan Soni). Deadpool asks Dopinder about a picture of a girl he has in his car, and Dopinder says she was his girlfriend until he lost her to his cousin. Dopinder then takes Deadpool to the middle of a bridge, and Deadpool stiffs the man for cab fare.Deadpool waits on top of a bridge for his targets, but first addresses the audience and jokes about fondling Wolverine's balls to get his own movie. He then spots a group of vans arriving, and he jumps into one of the men before beating up of all the thugs in the van, causing an accident that kills other villains. Deadpool's main target is Ajax (Ed Skrein), the man that gave him his powers and also horribly disfigured him. The vans all come crashing to the end of the bridge, where one thug's head is slice off with a chain, and another one gets gorily splattered against a sign on the highway.At Xavier's School For Gifted Youngsters, Colossus (Stefan Kapicic) sees the chaos unfolding on the news and calls Negasonic Teenage Warhead (Brianna Hildebrand) to join him in getting Deadpool.Deadpool is upset because he forgot his bag of weapons and only has 12 rounds in his gun. He counts off how many rounds with each thug he kills, accidentally missing a few shots, but he manages to kill three men with one bullet. One last thug comes at Deadpool with two knives, but Deadpool quickly skewers him. Deadpool then points out that this is a different kind of superhero movie, and that we need to go back for him to tell it properly.Flashback to one year earlier....Wade Wilson was a mercenary-for-hire living in New York City. He takes a job getting a pizza delivery boy to stop stalking a girl by threatening him. Once his job is done, the girl thanks him and calls him her hero, to which Wade quickly points out that that is something he is not.Wade goes to the bar where his friend Weasel (TJ Miller) works. Wade orders a drink called a Blowjob and has the bartender bring it to a big thug and to say it came from another man, leading to a bar fight where people bet on others to die, which is called the \"dead pool\". At this bar, Wade meets a prostitute named Vanessa (Morena Baccarin). They bond over their weird, messed up lives before starting a sexual relationship, which eventually evolves into a romantic one.Wade is genuinely happy until he is diagnosed with cancer in his liver, lungs, prostate and brain. He fears more for what will happen to Vanessa than to him. At the bar, Weasel tells him that a man sitting in the corner is looking for him. He is The Recruiter (Jed Rees), and he tells Wade that he works for a facility that will not only cure him of his cancer, but also give him incredible powers. Wade is hesitant, but he takes the card that The Recruiter gives him.Back in the present, Deadpool finds Ajax headed to him on a motorcycle and he throws his kitana at the bike, causing Ajax to crash. Deadpool impales Ajax with the other blade, but since Ajax is a mutant, the blade doesn't kill him. Deadpool lifts up his mask for to show his scars so that Ajax can recognize him as Wade Wilson. Colossus and Negasonic then arrive. Colossus is displeased with Deadpool causing so much mayhem and tries to get him to join the X-Men, to which Deadpool refuses. With his back turned, Ajax escapes. Enraged, Deadpool tries to hit Colossus, but he ends up breaking both hands and his foot. Colossus cuffs Deadpool to his wrist, but Deadpool chooses to cut his hand off and hop into a garbage van, leaving his hand to give Colossus the finger.In another flashback, Wade made the choice to be cured for Vanessa, leaving her alone in the middle of the night and never returning. He goes to the facility where he meets Ajax for the first time, along with his cohort Angel Dust (Gina Carano). Ajax says that in order for Wade's cells to heal, they have to subject him to extreme stress for the mutant cells to activate.Wade undergoes torture techniques until Ajax tells him that they are making him into a super slave to be auctioned off somewhere. Wade makes fun of Ajax after learning his real name is Francis. Ajax straps Wade to a chamber where his oxygen is cut off. His skin and face start to blotch up, making him disfigured. Ajax opens the chamber and tells Wade his cancer is gone. Wade headbutts Angel and takes a match that she kept in her mouth. He lights it and throws it near the oxygen vent, causing an explosion in the laboratory. Ajax goes down to see what happened, and Wade starts to fight him. He has gotten increased strength, but Ajax gets the upper hand and impales Wade with a bar, which he leaves bent. Ajax leaves as the facility crumbles around Wade.Wade wakes up alive, but horrified by his complexion. He walks through the streets with a hood over his head, but the people that see him are creeped out by his appearance. This makes him worry about what Vanessa will think if she sees him, so he stays away from her completely.Wade visits Weasel, who is also disgusted by his appearance and makes a few quips at his expense. Weasel encourages Wade to make a suit and mask to disguise himself as he goes back to hunt for Ajax so that he can fix his face. Wade decides to call himself \"Deadpool\" and begins his crusade to find Ajax by plowing through his goons until he can find him. He finds The Recruiter, who says what he knows about Ajax's whereabouts before Deadpool kills him. In this time, Wade has decided to stay with a blind woman named Al (Leslie Uggams).Back in the present day, Deadpool rides the garbage truck back to his and Al's place, and his hand starts to slowly grow back.Ajax and Angel go to Weasel's bar to locate Deadpool. Angel grabs Weasel by the throat, but the other bar patrons turn their guns on her and Ajax. They find a picture of Wade and Vanessa together before leaving.After being told to just face Vanessa himself, Wade goes to the strip club where she works (where we see Stan Lee as a DJ), but is still scared to face her. Vanessa's co-worker tells her that an ex-boyfriend is out back looking for her. She goes outside and thinks it's Wade, but it's Ajax. He and Angel take her. Wade goes out back to look for her but only finds her handbag, letting him know that she's been taken.Infuriated, Wade grabs all the guns he owns and goes to the X-Mansion to get Colossus and Negasonic to help him get back Vanessa and stop Ajax. He then quips that the mansion is so big, yet it looks like the studio couldn't afford more than two X-Men.The mutants take a cab driven by Dopinder to Ajax's location. They hit a bump and Deadpool hears a scream from the trunk. Dopinder admits he kidnapped his cousin. Deadpool pretends to be horrified but quietly congratulates Dopinder. The three then track Ajax down to a scrapyard. Deadpool charges toward the goons while Colossus and Negasonic fight Angel. She slams Colossus away, but Negasonic charges at Angel with great power.Deadpool rips through the goons and uses their corpses to spell out Francis's name to mock him. He runs up to the aircraft carrier where Ajax is keeping Vanessa. He puts her in the same chamber where he put Wade. Deadpool duels with Ajax with their blades. Meanwhile, Angel almost strangles Colossus with a bar, but Negasonic creates a powerful blast that throws Angel off and destroys the carrier. It starts to collapse, sending numerous freight containers down. Colossus carries Negasonic and Angel to safety while Deadpool makes sure Vanessa safely lands. The carrier then completely crashes down.Ajax attacks Deadpool once again until the latter has him pinned down. Deadpool holds his gun at Ajax's head and demands that he fix his face, but Ajax laughs and says there was never a cure for that. Deadpool is ready to kill Ajax until Colossus steps in and starts to make a big speech on making the hero's decision to spare his enemy's life. Deadpool gets tired of the speech and he just shoots Ajax in the head, making Colossus puke. Afterwards, Deadpool finally confronts Vanessa and apologizes for abandoning her. She removes his mask to see his face, but he is wearing a cut-out of Hugh Jackman's face. She sees his real face and says she will eventually get used to it. They kiss, and Deadpool signs off as the movie ends.After the end credits, Deadpool appears in his bathrobe telling the audience to leave for the movie is over (a homage to the final shot of 'Ferris Bueller's Day Off'). However, he comes back and says that the studio is trying to get Cable to be in a sequel. Deadpool walks away, but then pops his head out to go \"Chicka-chicka!\""}