{"mid": "DeadAgain", "IMDB_id": "tt0101669", "title": "Dead Again", "plot": "Newspapers detail the 1949 murder of Margaret Strauss (Emma Thompson), who was stabbed during a robbery; her anklet is missing. Her husband, composer Roman Strauss (Kenneth Branagh), is found guilty of the crime and condemned to death. Before his execution, Roman is visited by reporter Gray Baker (Andy Garcia). Asked if he killed Margaret, Roman whispers in Gray’s ear; Baker does not disclose Roman's answer.\nForty years later, private detective Mike Church (Branagh) investigates the identity of a woman who has appeared at the orphanage where he grew up. She has amnesia, cannot speak and has nightmares. Mike takes her in and asks his friend, Pete Dugan (Wayne Knight), to publish her picture and his contact information. Antiques dealer and hypnotist Franklyn Madson (Derek Jacobi) approaches Mike, suggesting that hypnosis may help her recover her memory. When the session is unsuccessful, Madson suggests that they experiment with past life regression. Mike is skeptical, but the woman details Margaret and Roman's lives in third person, from courtship to their wedding. When the session ends, she can speak but still has amnesia. Madson shows them copies of Life from the murder; Mike and the woman bear a striking resemblance to Roman and Margaret. Mike visits disgraced psychiatrist Cozy Carlisle (Robin Williams), who insists that they continue to see Madson; delving into the problems between Margaret and Roman may resolve her amnesia.\nMike nicknames the woman \"Grace\", and falls in love with her. Doug (Campbell Scott) appears and claims that Grace is his fiancée Katherine, but Mike discovers he is lying and chases him away. Hypnotized, Grace remembers that Roman suffers from writer's block and is broke. He believes that Margaret is flirting with Baker, whom she met on their wedding day. Margaret cannot convince Roman that she is faithful and catches Frankie, the son of their housekeeper Inga, looking through her jewelry box. She asks Roman to dismiss them but Roman refuses, saying that they saved his life in Germany.\nGrace sees Mike standing over Margaret with scissors, and is convinced he intends to kill her. Mike insists that he would never hurt her, but when he accidentally calls her \"Margaret\", he agrees to let Madson regress him.\nDugan tells Mike that he has identified Grace as artist Amanda Sharp. Amanda, still afraid of Mike, accompanies Pete and Madson to her apartment; her artwork focuses on scissors. Madson gives her a gun to protect herself from Mike. Mike visits Baker in a nursing home and asks him about Roman's secret, but Baker insists that Roman said nothing to him. Baker is convinced that Roman did not kill his wife and urges Mike to find Inga, who would know what happened.\nMike realizes that Madson is Frankie; he questions Inga, who explains that she declared her love for Roman, but he rebuffed her advances. Frankie blamed Margaret for his mother's unhappiness and killed her with scissors; he then stole her anklet. Roman stumbled in, and was found covered in his wife's blood and holding the murder weapon. After Roman's execution, Inga brought Frankie to London; he learned about hypnotherapy and past-life regression. After returning to Los Angeles, Frankie was convinced that Margaret’s spirit would seek revenge. When he saw Amanda’s picture in the paper, he knew she has returned. He hired Doug, an actor, to separate Mike and Amanda and distract Amanda while he waited to kill her. Inga apologizes for her role in Margaret's death, and gives Mike the anklet. After Mike leaves to find Amanda, Madson smothers Inga with a pillow.\nMike tells Amanda the truth; terrified, she shoots him. Madson arrives, revealing his true identity; Amanda tries to shoot him, but the gun jams and he knocks her out. He puts the scissors he used to kill Margaret in Mike's hand and tries to make it look like Amanda killed him and committed suicide. Mike wakes up and stabs Madson in the leg with the scissors. Madson falls onto a scissors sculpture, which impales and kills him. Mike and Amanda then embrace."}