{"mid": "DeadPresidents", "IMDB_id": "tt0112819", "title": "Dead Presidents", "plot": "(this first appeared on www.realmoviereview.com)\nThis action drama was the second film by the movie-making twins, Albert and Allen Hughes. The two started their careers with the urban drama, Menace II Society, and this effort has a 70s urban setting. The style and skill of these talented filmmakers is immediately apparent and the script which they co-wrote with Michael Henry Brown\nhas well-developed characters and great tension along with explosive action scenes framed with an engrossing small scale story. The acting is excellent, but the real star here is the Hughes direction which is cool and inspired.Larenz Tate is Anthony Curtis, a good-natured high school kid in 60s New York who is enjoying life with his girlfriend, Delilah and good friends, Skip (Chris Tucker in an early role) and Jose (Freddy Rodriguez) and running numbers for a local tough guy, Kirby (Keith David). Those days are not to last, however, as all three of the young friends end up in Vietnam. Following a fairly lengthy and well-done segment in the Nam, all three end up back in the old neighbourhood, where Anthony finds adjusting to civilian life difficult. Soon (and rather suddenly), the whole bunch of them are planning an armoured car heist, and ohhhh boy, what a heist it turns out to be.n the spring of 1969, Anthony Curtis (Larenz Tate) is about to graduate from high school. However, Anthony is not going to college, but needing to get away from home to find himself, he enlists in the U.S. Marine Corps shortly after graduating high school. He is sent to Vietnam, leaving behind a middle-class family, a pregnant girlfriend (Rose Jackson), and a small time crook, Kirby (Keith David), who is like a second father.Anthony voluntarily joined the military in 1969; his close friend Skip (Chris Tucker) later joined Curtis's squad after flunking out of college, and Jose (Freddy Rodriguez), got drafted into the Army also in 1969. Once in the Marines, Curtis meets the gung-ho lieutenant, Dugan (Jaimz Woolvett), and his wartime friend, Cleon (Bokeem Woodbine), a religious yet deadly staff sergeant. During their tour in Vietnam as members of a Force Recon unit, they experience the horror of war, losing several fellow Marines during combat. The Marines (specifically, Cleon) also commit atrocities, including executing enemy prisoners and beheading corpses for war trophies. One of their squad is the victim of terror tactics of the North Vietnamese: D'ambrosio (Michael Imperioli), who is disemboweled and castrated alive. While waiting for medevac, Anthony, succumbing to the request of the dying D'ambrosio, gives the man a fatal dose of morphine. One of their squad is killed by stepping on a land mine and a night ambush ensues, with NVA troops and half of Anthony's team killed; Dugan is killed after Skip \"freezes up\" during the gunfight when he is ordered to cover him. Cleon manages to hold off the enemy long enough for Anthony and the last of the crew to escape.When Anthony returns to The Bronx in 1973, after four years of service and presumably multiple combat tours in Vietnam, i.e. multiple tours of duty, and attaining the rank of sergeant, he discovers that returning to \"normal\" life isn't easy or pleasant. He finds his friend Skip, who used drugs during the war, is now a heroin addict. Jose, after serving as a demolitions expert, during which he lost his hand, has become a pyromaniac. Cleon is now a devoted minister. And Kirby has since become legitimate due to police cracking down on his criminal business. Anthony is laid off from his job in a butcher shop and finds himself unable to support his daughter. During a pool game at Kirby's Cowboy ( Terrence Howard ) makes fun of Anthony and informs him that Cutty ( Clifton Powell ) was having sex with his girlfriend Juanita while he was deployed in Vietnam, he beats up Cowboy with a pool stick out of anger. Anthony pesters Juanita into admitting to sleeping with Cutty to provide for their daughter (who may not even be Anthony's). Anthony meets his girlfriend's sister Delilah (a member of the \"Nat Turner Cadre\", a fictional group similar to black revolutionaries), who has always had a crush on him and decides to help him with a plot he devises. Anthony, Kirby, Skip, Jose, Delilah and Cleon plan to rob an armored car making a stop at the Noble Street Federal Reserve Bank of the Bronx.Skip and Cleon act as lookouts, Kirby is the getaway driver, Delilah waits in a dumpster across the street and Anthony and Jose hide under the loading docks, all armed. Though they plan the heist very carefully, it goes horribly wrong when a policeman stumbles on the scene. The policeman interferes, resulting in Kirby's attacking him, only to be shot in the arm, and Skip's shooting the policeman in the head. The security guards engage the robbers in a gunfight, ending with Anthony and Delilah's killing most and Delilah's dying while saving Anthony as the truck leaves. After Kirby tries to block the truck with his car, Jose makes use of an excessive amount of explosives, destroying the armored car and burning most of the cash. They escape with what money is left, but Jose has been killed after being struck by a police car.The surviving four try to lie low after the robbery. Cleon however begins handing out cash to members of his congregation, also buying a new Cadillac car which he obviously cannot afford. Anthony and Skip give out presents to poor children on Christmas. Cleon is finally arrested at his church and gives up the other thieves. NYPD officers storm Skip's apartment to find that he has died of a heroin overdose. As Kirby and Anthony prepare to leave the country, they are ambushed at Kirby's pool hall by the police and arrested. In court, Anthony is tried, convicted, and sent to prison for 15 years with an L. Anthony berates the judge (Martin Sheen), a war veteran himself, who also goes so far as to call him a disgrace to any person who put on uniform and served his country. Upon receiving his sentence, Anthony gets angry and throws the chair at the judge. After the court, Anthony on a police bus and goes to jail."}