{"mid": "DeathRace2000", "IMDB_id": "tt0072856", "title": "Death Race 2000", "plot": "In 1979, the United States collapsed, resulting in massive civil unrest and economic collapse. The government restructured into a totalitarian regime under martial law. To pacify the population, the government has organized the Transcontinental Road Race, where a group of drivers is driving across the country in their high-powered cars, infamous for violence, gore, and innocent pedestrians being struck for bonus points.\nIn the year 2000, the five drivers in the 20th annual race, who all adhere to professional wrestling-style personas and drive appropriately themed cars, include Frankenstein, the mysterious black-garbed champion and national hero; Machine Gun Joe, a Chicago tough-guy gangster; Calamity Jane, a cowgirl; Matilda The Hun, a neo-Nazi; and Nero The Hero, a Roman gladiator. Each drives with a navigator of the opposite sex, who also implicitly functions as a love interest. The race is covered on national TV by a news team headed by the boisterous and comical Junior Bruce, seductive matron Grace Pander, and laconic commentator Harold (a parody of Howard Cosell). The game has sadistic rules, where killing babies and physically challenged people will give the player extra points. Machine Gun Joe is the main opposition to Frankenstein.\nA resistance group led by Thomasina Paine, a descendant of 1770s American Revolutionary Thomas Paine, plans to rebel against Mr. President's regime by sabotaging the race, killing most of the drivers, and taking Frankenstein hostage as leverage against the President. The group is assisted by Paine's great granddaughter Annie, Frankenstein's latest navigator. She plans to lure him into an ambush to be replaced by a double. Despite a pirated national broadcast made by Ms. Paine herself, the resistance's disruption of the race is covered up by the government and instead blamed on the French, who are also blamed for ruining the country's economy and telephone system.\nAt first, the Resistance's plan works. Nero is killed when he runs over a booby-trapped doll planted by the Resistance, which he mistakes for a real baby and proceeds to run it over to gain points. Matilda drives off a cliff while following a fake detour set up by the Resistance. Calamity Jane inadvertently drives over a land mine. This leaves only Frankenstein and Machine Gun Joe in the race.\nAs Frankenstein nonchalantly survives every attempt made on his life during the race, Annie comes to discover that the Frankenstein she knows is anything but a willing government stooge, nor is he the original man. The current Frankenstein is, in fact, one of a number of random wards of the state trained exclusively to race in the identity. \"When one is used up, they bring in another,\" he tells Annie. The current Frankenstein also reveals that he has his own plans: when he wins the race and shakes hands with Mr. President, he will detonate a grenade which has been implanted in his prosthetic right hand (he calls it his \"hand grenade\"), which he has kept concealed by keeping his glove on at all times (even while undressed). His plan goes awry, however, when Machine Gun Joe attacks and Annie kills him using Frankenstein's \"hand\" grenade.\nHaving successfully outmaneuvered both the rival drivers and the Resistance, Frankenstein is declared the winner, although he is wounded and unable to carry out his original grenade attack plan. Annie instead dons Frankenstein's disguise and plans to stab Mr. President while standing in for him on the podium. As the president congratulates \"Frankenstein\" for his victory, in the process declaring war on the French and appointing Frankenstein leader of the war, Annie is mistakenly shot and wounded by her own grandmother, who is desperate for revenge against Frankenstein for having supposedly killed her during the race (he'd actually just drugged her). The real Frankenstein takes advantage of the confusion and rams the President's stage with his car, finally fulfilling his lifelong desire to kill him.\nIn the epilogue, Annie and Frankenstein marry. Frankenstein, now President, abolishes the race and plans to rebuild the country. However, Junior Bruce starts to protest against it. When unable to find a moral reason to continue the race, he starts shouting that it is a way of life, to keep America satisfied, to entertain and give the people what they want, now desperate to have the race perpetuate. Frankenstein, annoyed, runs him over with his car and drives off with Annie to the cheers and applause of the crowd."}