{"mid": "DeathMachine", "IMDB_id": "tt0109575", "title": "Death Machine", "plot": "In the near future, the controversial megacorporation Chaank Armament is the world's leading manufacturer of cutting-edge weapons and military hardware. Death Machine is set in the near future of 2003. A cybernetically-enhanced supersoldier codenamed Hard Man malfunctions and massacres the patrons of a roadside diner before being deactivated by Chaank security operatives led by John Carpenter. Public outcry ensues following the incident, the majority of it directed at the company's new Chief Executive Hayden Cale.\nChairman of the Board Scott Ridley, fearful of the potential termination of Chaank's contracts due to the bad publicity, tries to cover up the incident and the numerous issues with Hard Man project itself. Cale demands immediate and full public disclosure, having purposely leaked a number of Chaank documents to the press in defiance of Ridley's attempts to suppress knowledge about the company's shadier activities. She also demands that Jack Dante, Chaank's deranged weapons' designer and the developer of Project Hard Man, be fired. Despite Carpenter's acknowledgement of the project's numerous fatal flaws, the board ignores Cale's requests, no one seeming to care about her interests except for Dante himself. Cale is warned by a junior executive about Dante's unstable behavior and about Nicholson, the former's late predecessor. Cale goes to confront Dante, demanding to know about Dante's secret project in Vault 10, for which he never submits progress reports. Far from cooperative, Dante instead threatens Cale, makes unsettling advances towards her and displays detailed knowledge of her living situation, place of residence, and personal information. Cale asks Ridley for help, but he refuses while telling her that Nicholson took a similar interest in Dante's work and was killed in a mysterious accident resembling an animal mauling. During their confrontation, Cale manages to lift Ridley's access card so she can investigate on her own. Dante learns that Cale has the card and confronts Ridley, subsequently killing him with a mysterious weapon.\nMeanwhile, a trio of eco-warriors, Raimi, Weyland, and Yutani infiltrate the Chaank headquarters in order to destroy its digitally stored assets and send the company into bankruptcy. Carpenter calls Cale after finding Ridley's mutilated body which had an implanted life-sign transmitter. She investigates and finds out that whatever killed him came from Vault 10. Taking matters into her own hands, she terminates Dante's employment and seals the vault. Dante is about to shoot her when the eco-warriors show up and take everyone hostage. They demand access to the building's secure area in order to destroy the company's digital bonds, but Cale refuses to cooperate. Raimi goes to their alternate plan to cut through the bulkhead leading to the containment area. Dante, sensing his chance, \"helps\" them by suggesting they cut through one of the vaults surrounding the containment instead, suggesting they start at vault 10.\nOnce the vault is open, Dante jumps in and activates his invention, called Frontline Morale Destroyer (aka 'Warbeast'), which promptly kills Weyland. Raimi flees, meeting up with Yutani and the subdued Cale and Carpenter. Dante broadcasts his demands over the monitor system, demanding that his employment be reinstated, and that Cale \"interface with him on a regular basis\".\nRaimi and Yutani cancel the operation and attempt to get out of the building, along with Carpenter and Cale. Carpenter is killed by the Warbeast inside of a lift. Later on, Raimi, Yutani and Cale get into the top floor of the building, which holds classified items, whose existence even Cale is unaware of. Among the classified items are the primary components of Project Hard Man, including advanced weaponry and armour. Raimi suits up and downloads the Hard Man data into his brain. Fighting off the Warbeast, he manages to it slow down enough to allow an escape via an outdoor service elevator. Yutani, however, is killed by the Warbeast after tripping and falling in front of it. Once Raimi and Cale make it back to the surface, they have an altercation with a police officer who is quickly killed by the Warbeast as it falls from the rooftop. It chases Cale and Raimi back into the building, and the former use to partially incapacitate the Warbeast; however the explosion knocks out Raimi. The machine takes Cale back to Dante. During their conversation, Raimi regains consciousness and subdues Dante. The two escape, and Hayden seals Dante inside of the vault with the Warbeast."}