{"mid": "DeathWish3", "IMDB_id": "tt0089003", "title": "Death Wish 3", "plot": "Paul Kersey (Charles Bronson) has come back to New York City after being banned since the events of the first film to visit his Korean War buddy Charley (Francis Drake), who is attacked by a gang in his East New York apartment. The neighbors hear the commotion and call the police. Paul arrives and Charley collapses dead in his arms. The police arrest Paul for the murder. At the police station, Inspector Richard Shriker (Ed Lauter) recognizes Paul as \"Mr. Vigilante\". Shriker lays down the law before Paul is taken to a holding cell. In the same cell is Manny Fraker (Gavan O'Herlihy), leader of the gang who killed Charley. He and Paul fight. When he is released, Manny threatens Paul. The police receive daily reports about the increased rate of crime. Shriker offers a deal to Paul: he can kill all the punks he wants, as long as he informs Shriker of any gang activity he hears about so the police can get a bust and make news.\nPaul moves into Charley's apartment in a gang-turf war zone. The building is populated by elderly tenants terrified of Manny's gang. They include Bennett Cross (Martin Balsam), a World War II veteran and Charley’s buddy; Mr. and Mrs. Kaprov, an elderly Jewish couple; and a young Hispanic couple, Rodriguez (Joseph Gonzalez) and his wife Maria (Marina Sirtis). After a few violent muggings, Paul buys a used car as bait. When two gang members try to break into the car, Paul shoots them with a Colt Cobra. Paul twice protects Maria from the gang, but is unable to save her a third time. She is assaulted and raped, later dying in hospital from her injuries.\nKersey orders a new gun, a Wildey hunting pistol. He spends the afternoon with Bennett handloading ammunition for it. He then tests the gun when The Giggler (Kirk Taylor) steals his Nikon camera. Paul is applauded by the neighborhood as Shriker and the police take the credit. Kersey also throws a gang member off a roof. Public defender Kathryn Davis (Deborah Raffin) is moving out of the city and Kersey offers to take her to dinner. While waiting in his car, Kathryn is knocked unconscious by Manny and the car is pushed into oncoming traffic. It slams into another car and explodes, killing Kathryn.\nShriker places Kersey under protective custody, fearing he is in too deep. After Bennett's taxi shop is blown up, he tries to get even but his gun jams. The gang cripples Bennett. Kersey is taken by Shriker to the hospital, where he escapes after Bennett tells him where to find a machine gun. Kersey and Rodriguez collect weapons. They proceed to mow down many of the criminals before running out of ammo. Other neighbors begin fighting back as Manny sends in reinforcements.\nShriker decides to help and he and Kersey take down much of the gang together. Kersey goes back to the apartment to collect more ammo, but Manny finds him there. Shriker arrives and shoots Manny, who falls to the floor, apparently dead. Shriker is wounded in the arm. As Kersey calls for an ambulance, Manny rises (he was wearing a bulletproof vest) and turns his gun on the two men. As Shriker distracts him, Kersey uses a mail-ordered M72 LAW rocket launcher to obliterate Manny. What remains of the gang rush to the scene and see Manny's smoldering remains. One of the other gang members attempts to retaliate, but Manny's girlfriend stops him. Surrounded by the angry crowds of neighbors, the gang realizes they've lost and flee the scene. As the neighbors cheer in celebration and with police sirens in the distance, Shriker gives Kersey a head start. Kersey gives a look of appreciation and takes off."}