{"mid": "DeathScreams", "IMDB_id": "tt0085415", "title": "Death Screams", "plot": "Ted and Angie are out kissing on a motorcycle, waiting for the train, which apparently arguments their dual orgasm, Unfortunately someone unseen shows up, kills the couple and kicks their bodies into the river.The next day, Sheriff Avery is at the general store looking for Ted, who has not shown up for work. Bob and Kathy are at the ball field, assisting baseball coach Neil Marshall. They see the slow and weird Casey watching them and he runs away when he realizes that he has been spotted. Neil takes the assistant out for a pitcher of beer, and Bob walks Kathy home. Bob asks her to the river, but Kathy says she has to work at the carnival tomorrow and she asks him along to help.The bodies of Ted and Angie continue to float down the river.The timid blond waitress Lily leaves work and heads home, continually looking around for anyone following her. She gets home to her grandmother.The next day at the carnival, Tom and Ramon hang around with Sheila, Walker, Sandy and the irrigating Diddle. At the booth, Bob tells Kathy that he think that he is in love with her and the two kiss.\nNearby, Lily is rolling her grandmother in her wheelchair; they speak with Agnes. Sheriff Avery asks the six friends if they have seen Ted or Angie recently. The group later tells Bob and Kathy about their bonfire party that night. Lily walks out with Neil, and he tells her that his mother used to live in the town when he was younger. Bob and Kathy tell Neil about the party, and Neil asks Lily to accompany him. She politely declines, but accepts his invitation to a potential movie in the future.Sara, upset that Neil seems more interest in Lily then her, covers his car in shaving cream, which Casey evidently witnesses. Later Sara, sitting by a fountain, is shot with an arrow. She runs to an abandoned merry-go-round and the ride starts moving. A plastic bag is thrown over her head and she is suffocated to death.At home, Casey's mother Agnes tells her son that it is wrong to steal things like ball field equipment (which Casey has been accused of).Bob is dropping Kathy off and they both tell Lily she should go to the party. At her house, Lily's grandmother expresses her skepticism of Neil and she calls his mother a common whore.Neil is in the shower when Ramona walks in and kisses him. Neil carries her to the shower and turns it on. He tells her to go home, and he lets her know that he does not like \"cheap thrills\" because he had a lifetime to that with his mother. Ramona storms out. The sheriff sees her outside and he mocks her for her flirty ways. Ramona says something about Avery's son and he becomes irate, but Ramona tells him that Casey was driving.Agnes cannot find her son, and she calls the police station to talk to the sheriff.Out in his garage, Neil sees a soccer ball fall from the upper level. He climbs the steps, and a machete is swung at him.Out at the bonfire, Ramona is upset and she tells Tom to leave her alone for a while, but she later hugs him and apologizes. Diddle is seen dancing with Sandy, but he passed out drunk right when Sandy wants to go for a swim.At Neil's house, Sheriff Avery sees something on the windshield of Neil's car, and something falls from above.At the lake, no one wants to swim with Sandy, so she goes off alone out in the water. She bumps into the floating corpses of Ted and Angie. She screams and gets to shore and gets chopped to death by the machete.A little later, Diddle want to go looking for Sandy so he, Tom and Walker look around. They meet Bob, Kathy and Lily and they all sit around the bonfire, deciding that is the time to go to the cemetery. Lily is reluctant, but Bob suggests laving a note by the fire in case Neil arrives afterwords.At the Sunset Cemetery, the group arrives and sits in a circle, each holding a lit candle, and Lily is chosen to tell a ghost story. She tells of a frightened girl staying alone during a storm and her dog constantly reassuring her by licking her hand in the dark. The girl hears a dripping sound and she checks her shower and find her dog hanging, bloody and dead and a message written on the mirror in the dog's blood saying \"maniacs lick hands too.\"The group runs to an old house when it begins to rain. Diddle goes back out to occupy the outhouse. Tom suggests scaring Diddle, and after giving him some time, the group heads out tot he outhouse to find Diddle hanging, bloody and dead. Tom exclaims \"somebody slit him from ear to ear\". They carry his body inside. Walker heads for the truck followed by Sheila. When Sheila reaches the truck, Walker is there but his head falls off his body and Sheila is grabbed. Tom finds both of them in the truck dead and headless. He runs from the still-unseen killer but falls into an open grave. When he tries to climb out, the killer chops off both of his hands.Kathy hears someone approaching. Bob opens the front door in time to see a raised machete and quickly slams the door shut. The killer breaks the window, and Ramona heads for the stairs and falls through the unstable steps. Bob tries to pull her up, but Ramona's body gets sliced in half at the waist. The three remaining survivors of Bob, Lily and Kathy run upstairs with the killer close behind. They run into a room and barricade the door, and Bob it hit when leaning against it. Neil then bursts into the room and yells to Lily that he never wanted to hurt her but she is just like all the others.A flashback is shown with Neil's mother having sex with a stranger as a young Neil watches her.With Neil distracted by this flashback, Lily picks up a glass shard from the broken window and slices Neil's throat. Neil attacks again. Lily moves out of the way and Neil flies out of the window. Sheriff Avery arrives, sees Neil laying on the ground still alive, and shoots him several times until he is finally dead. Avery walks Lily to his squad car and lets her inside."}