{"mid": "DeepCover", "IMDB_id": "tt0104073", "title": "Deep Cover", "plot": "In Cleveland, 1972, Russell Stevens Jr. is the son of a drug addicted, alcoholic man, who tells his son never to be like him. Stevens then witnesses his father getting shot and killed while robbing a liquor store. He swears that he will never end up like him.\nIn 1991, Stevens is a police officer. He is recruited by DEA Special Agent Gerald Carver to go undercover on a major sting operation in Los Angeles, claiming that his criminal-like character traits will be more of a benefit undercover than they would serve him as a uniformed policeman. Stevens poses as drug dealer \"John Hull\" in order to infiltrate and work his way up the network of the west coast's largest drug importer, Anton Gallegos and his uncle Hector Gúzman, a South American politician. Stevens relocates to a cheap hotel in LA and begins dealing cocaine.\nOne day, Stevens is arrested by the devoutly religious L.A.P.D. Narcotics Detective Taft and his secretly corrupt partner Hernández, when he buys a kilogram in a set-up by Gallegos' low-level street supplier Eddie Dudley. At his arraignment, Stevens discovers that he bought \"baby laxative\" (mannitol) instead of cocaine and his case is dismissed. Stevens' self-appointed attorney David Jason, who is also a drug trafficker in Gallegos' network, rewards Stevens' silence with more cocaine and introduces Stevens to Felix Barbossa, the underboss to Gallegos. Felix kills Eddie when his finds out he's working with the LAPD and enlists Stevens as Eddie's replacement.\nStevens develops a romance with Betty McCutcheon, the manager of an art dealership which serves as a front to launder Jason's drug money profits. When one of Stevens' dealers is murdered by a rival dealer, Stevens kills him and is awarded a partnership in Jason's new business venture; distribution of a synthetic chemical variant of cocaine.\nIt turns out that Felix is a police informant working with Detective Hernández. Felix immediately gives up Stevens, Jason and Betty, and wants Jason killed during the arrest because of his business venture. Carver knows about this, but refuses to interfere forcing Stevens to violate orders and stop it himself by exposing Felix, which results in a vengeful Jason killing him, while Betty reneges the drug business because of it with Stevens´protection.\nGallegos comes to meet with Jason and Stevens and informs them that they have inherited Felix's debts to him. Later that day, Stevens meets with Carver to tell him about his meeting with Gallegos. Instead Carver pulls a gun on Stevens and orders him to surrender his weapon and get in his car. Angrily, Stevens disarms Carver and forces him to admit that the State Department has decided to leave Gallegos alone because Guzman may some day be useful as a political asset to them and Carver has decided to play along in exchange for career advancement. Stevens' disillusionment reaches its conclusion and he abandons his undercover status vowing to take down Gallegos and Guzman alone.\nStevens and Jason learn that Gallegos is going to kill them anyway, so they kill him first and steal a van storing over a $100 million of Gallegos' cash. Jason and Stevens invite Guzman to a shipyard and offer to return 80% of Gallegos' money if he agrees to invest the remaining 20% in their synthetic cocaine operation. Detective Taft, who has been tailing Stevens, interrupts the deal but is unable to arrest Guzman because of his diplomatic status. Guzman leaves the scene. Taft orders Stevens to surrender, but is shot and killed by Jason. Stevens reveals himself as a police officer and attempts to arrest Jason, but is forced to kill him in self-defence.\nAfterwards, Carver coerces Stevens into testifying in favour of him and the DEA in return for not charging Betty for money laundering, but Stevens produces a videotape of the incriminating conversation with Guzman at the shipyard during his testimony to the House Judiciary Subcommittee, ruining the State Department´s intentions along with Guzman and Carver´s careers. Later he contemplates what to do with the $11 million of Gallegos' money he secretly kept."}