{"mid": "DeepEnd", "IMDB_id": "tt0066122", "title": "Deep End", "plot": "Mike (John Moulder Brown), a 15-year-old dropout, finds a job in a public bath. There he is trained by his co-worker Susan (Jane Asher), a woman ten years his senior. Susan is a tease who plays with Mike's and other men's feelings, acting sometimes warm and affectionate and other times cold and distant. Working in the bathhouse turns out to involve providing services to clients of a more or less sexual nature, in exchange for a tip. For example, an older woman (Diana Dors) is sexually stimulated by pushing Mike's head into her bosom and talking suggestively about football. Mike is confused by this and at first does not want to accept the tip he gets, but Susan tells him that these services are a normal practice, including exchange of her female clients for his male clients whenever a client prefers the opposite sex.\nMike fantasizes about Susan and falls in love with her, even though she has a wealthy and handsome young fiancé, Chris (Chris Sandford). Mike also discovers that Susan is cheating on her fiancé with an older, married man (Karl Michael Vogler) who was Mike's physical education teacher and works at the baths as a swimming instructor for teenage girls, touching them inappropriately. Mike begins following Susan on her dates with Chris and the instructor and trying to disrupt them. Although Susan often gets angry at Mike for this, she provides just enough encouragement to cause him to continue the behavior. Mike's infatuation with Susan continues despite his friends mocking him, his mother being treated rudely by Susan, his bicycle being destroyed by Susan, and his activities drawing the ire of Susan's boyfriends, local police, and Mike's boss at work. Obsessed with Susan, Mike refuses other outlets for sex, such as his former girlfriend and a prostitute who offers him a discount. While following Susan on a date, Mike sees and steals a life-size advertising photo cutout of a naked girl who resembles Susan. He confronts Susan with it on the London Underground, flying into a violent tantrum in front of other passengers when Susan teasingly refuses to tell him whether she posed for the nude photo. Mike then takes the cutout to the deserted baths after hours and swims naked with it, embracing it.\nThe next morning, Mike disrupts the instructor's foot race and punctures the tyres of the instructor's car while Susan is driving it. Susan gets mad and hits Mike, in the process losing the diamond from her new engagement ring in the snow. Anxious to find the lost diamond, Mike and Susan collect the surrounding snow in plastic bags and take it back to the closed baths to melt it, using a lowered ceiling lamp outlet to heat an electric kettle in the empty pool. While Susan is briefly out of the room, Mike finds the diamond in the melted snow, and lies down naked in the dry pool with the diamond on his tongue. He teases Susan by refusing to give her the diamond until she undresses. She does so, he gives her the diamond and she is about to leave, but she reconsiders and lies down next to him. They have a sexual encounter, although it is not clear whether Mike is able to perform.\nChris then telephones and Susan rushes around the empty pool hurriedly gathering her clothes to go and meet him. Mike begs her to stay and talk to him, but Susan insists she has to leave. Meanwhile an attendant has arrived, who, unaware of the presence of Mike and Susan, opens the valve to start filling the dry pool with water. Mike becomes more insistent, chasing Susan around the rapidly filling pool, and finally hitting her in the head with the ceiling lamp, severely injuring her. She falls (along with a tin of red paint that resembles blood) into the water of the pool. Mike embraces the dying, nude Susan underwater, just as he embraced the photo cutout."}