{"mid": "DeepRising", "IMDB_id": "tt0118956", "title": "Deep Rising", "plot": "Amidst a storm, Finnegan (Treat Williams) and his crew, Joey (Kevin J. O'Connor) and Leila, are hired by a group of mercenaries led by Hanover (Wes Studi) to pilot their boat across the South China Sea to an undisclosed location in the middle of the ocean. Meanwhile, the luxury cruise ship Argonautica, the brainchild of Simon Canton (Anthony Heald), is undertaking its maiden voyage, when a saboteur disables the ship's navigation and communication systems. A large object rises from beneath and collides with the vessel, leaving it dead in the water, while the panicking passengers are attacked by unseen creatures.\nFinnegan's boat collides with a speedboat shaken loose during he collision, at which point the mercenaries take over and reveal they intend to rob the ship's vault and passengers, before sinking it with torpedoes. The crew transfer over to the ship, leaving Leila and a mercenary behind to repair the boat, where they are both killed. The boarding party find only blood and no sign of any of the passengers. Finnegan and Joey are forced down into the engine room to scavenge parts to repair their vessel’s engines, under guard of two mercenaries who are both killed; as they are escaping, they run into Trillian (Famke Janssen), a passenger who was imprisoned for stealing. Hanover's group opens the vault to find Canton, Captain Atherton and three other passengers hiding and they explain that the ship was attacked by unknown creatures that killed everyone else on board.\nAfter questioning, Canton is found to be responsible for the ship's sabotage after having realised he created an unprofitable vessel, and hired the mercenaries to sink the ship so that he could collect on the insurance. The group is attacked by the creatures, revealed to be giant spike-covered tentacles, which eat Captain Atherton. Canton theorises that the creatures are an extreme evolution of the Ottoia which liquefy their victims and then eject the carcass. With the rest of the mercenaries being killed, the survivors are herded towards the bow, where they find a \"feeding room\" full of skeletal remains. The creatures break through the hull, flooding the lower decks and separating the survivors. Hanover tries to sacrifice Joey to save himself, but is instead eaten himself.\nFinnegan and Joey spot an island in the distance and make it back to Finnegan's boat, but they have lost their engine parts, rendering it useless as a means of escape. They instead set the boat's autopilot to crash into the Argonautica and detonate the mercenaries' torpedoes. As Finnegan and Trillian find jet skis they can use to reach the island, the tentacles smash through the main deck, revealed to be part of a single giant creature. Finnegan discovers Joey has gone missing, leaving him and Trillian to escape while being pursued by the creature. Canton jumps onto Finnegan's boat, but is unable to disable the autopilot, causing it to crash into the Argonautica, destroying both ships and killing Canton and the creature. Finnegan and Trillian reach the nearby jungle-filled island where they are reunited with Joey, who survived the ordeal and paddled ashore using Finnegan's surfboard. As the three relax, a loud roar echoes from the forest and something huge crashes toward them through the trees. As the camera pulls back, the island is revealed to be primordial, with an erupting volcano, and Finnegan is heard saying his movie catch phrase, \"Now what?!\", as the film ends."}