{"mid": "DeepBlueSea", "IMDB_id": "tt0149261", "title": "Deep Blue Sea", "plot": "At Aquatica, a former submarine refueling facility converted into a laboratory, a team of scientists searches for a cure for Alzheimer's disease. Fluids from the brain tissue of three Mako sharks are harvested. Unknown to the other scientists, Drs. Susan McAlester and Jim Whitlock have violated the code of ethics and have genetically engineered the sharks to increase their brain size; this has the side effect of making the sharks smarter and more dangerous.\nAfter one of the sharks escapes and attacks a boat full of teenagers, Aquatica's financial backers send corporate executive Russell Franklin to investigate the facility. To prove that the research is working, the team removes fluid from the brain tissue of the largest shark. While examining it, Jim is attacked by the shark and his arm is bitten off. Brenda Kerns, the tower's operator, calls a helicopter to evacuate Jim, but as he is being lifted, the stormy condition cause the cable winch to jam, and Jim falls into the shark pen. The shark grabs the gurney and pulls the chopper into the tower, killing Brenda and the pilots. As the others try to figure out what caused the explosion, one of the sharks uses Jim's gurney, with him still strapped to it, as a battering ram to smash an underwater window, drowning him, flooding the facility and freeing the other sharks. Upon being confronted, Susan confesses to the others that she and Jim genetically altered the sharks.\nSusan, Russell, wrangler Carter Blake, marine biologist Janice Higgins, and engineer Tom Scoggins make their way to the top of the center. While delivering a dramatic speech emphasizing the need for group unity, Russell is dragged into the water by the largest shark and killed. Later, while climbing up the industrial elevator, the ladder falls and gets wedged between the walls of the shaft, leaving them dangling over the water and the second shark. Janice loses her grip and falls; despite Carter's attempts to save her, the shark kills her. The cook, Sherman \"Preacher\" Dudley, is attacked by the first shark, but kills it by throwing a lighter into the kitchen's oven that had been turned on. He then encounters Carter, Tom and Susan.\nTraumatized by Janice and Russell's deaths, Tom goes with Carter to the flooded lab to activate controls to open a door to the surface. The largest shark attacks them, killing Tom. Meanwhile, Susan heads into her room to collect her research material, but while there, she is ambushed by the second shark. She narrowly escapes by climbing onto a metal table, disconnecting a nearby power cable, taking off her wetsuit and using it as a conduit, and using the cable to electrocute the shark in her underwear, destroying her research in the process. Carter, Susan and Preacher go to the top of the research center through a decompression chamber and swim to the surface. Preacher is caught by the third shark and dragged through the water, but swims to safety after stabbing the shark in the eye with his crucifix, causing it to release him.\nCarter realizes that the third shark is trying to escape to the open sea, and that the sharks made them flood the facility so they could escape through the weaker mesh fences at the surface. In an effort to distract the final shark, Susan cuts herself and dives into the water. When she attempts to climb out, the ladder breaks and she is killed by the shark. Carter dives in to try to save her, but is too late. Grabbing hold of the shark's fin, he is pulled through the water. Preacher grabs hold of the harpoon and shoots the shark through its dorsal fin, but the spear also goes through Carter's thigh. As the shark breaks through the fence, Carter is attached to the shark by the harpoon. He tells Preacher to connect the trailing wire to a car battery, sending an electric current through the wire and to an explosive charge in the harpoon, killing the shark. Carter managed to free himself in time, and he swims to the wreckage of the facility, joining Preacher in time to see the workers' boat en-route on the horizon."}