{"mid": "Defendor", "IMDB_id": "tt1303828", "title": "Defendor", "plot": "Dr. Park (Sandra Oh), a psychiatrist, is interviewing Arthur Poppington (Woody Harrelson), a vigilante known as \"Defendor\", who tells about assaulting a police officer who claims to be working undercover. Dooney (Elias Koteas) is a corrupt detective who Defendor believes is in the employ of his nemesis, \"Captain Industry,\" who Arthur blames for his mother leaving him as a child, dying of drug abuse later; his grandfather ended up raising him, teaching him how to read through comics.\nArthur is arrested for assaulting Dooney, but Fairbanks (Clark Johnson), the police captain in charge, connects with Arthur because their grandfathers both served in World War I. After Arthur is released, he takes his trench club and disappears. Arthur is living in the government construction depot where he works during the day. His life is very solitary, but after another confrontation with Dooney, he meets Angel (Kat Dennings), a prostitute who was smoking crack with Dooney. After he is brutally beaten by Dooney's friends, she helps him recover. She also informs him of Captain Industry's whereabouts and that his real name is Radovan Kristic (A. C. Peterson). He lets her move in with him, and enlists her help in apprehending Kristic. Angel reveals her real name is Katerina Debrofkowitz.\nArthur's boss and close friend Paul (Michael Kelly) becomes concerned for Arthur after he finds that Arthur is living at the construction depot with Kat. Paul tries to help, offering Arthur the opportunity to come and live with him, which Arthur rejects. Paul gives Arthur a cell phone to use in case he is ever needed. That night, Arthur ventures out to spy on \"Captain Industry\" and Dooney, but he reveals himself. After a short chase, Arthur is beaten and shot. Paul gets Kat to take him to Arthur, and they call paramedics. While Arthur is in surgery, Paul tells Kat to leave Arthur alone. They are relieved when they find out that Arthur was shot with training bullets. Kat visits an unconscious Arthur and reveals that she ran away from home because her father was physically abusing her. After she leaves, Arthur opens his eyes, having heard everything. Angered at how Kat was treated, Arthur walks down to the mall and beats up Mr. Debrofkowitz.\nAfter Park absorbs all this, she admits his honesty is admirable. At the hearing, Arthur is defended by Paul; Paul explains that Arthur is mentally underdeveloped and its best not too harsh with him. The judge agrees on the condition Arthur doesn't don his Defendor gear again. A reporter approaches Paul and convinces him to let her run a story about Arthur as Defendor, and he agrees. People are inspired by Defendor's attempts to save lives and fight crime.\nDepressed about having to leave Arthur, Kat becomes desperate for a fix and tries reuniting with Dooney. However, knowing about her affiliation with Defendor, he takes her hostage and threatens Arthur against revealing anything he had learned to the police. Arthur decides to save Kat and once again assumes his Defendor persona. Kat manages to escape from Dooney and the pair reunites. Kat is devastated when Arthur reveals he still plans to go after Kristic, and she tells him that she lied about the identity of Captain Industry and that he exists only in Arthur's delusion. It's then revealed in a flashback that Arthur's grandfather, in order to spare him pain as a child, metaphorically blamed his mother's death on the \"captains of industry,\" but Arthur's mental incapacity led him to believe it was a singular person.\nDefendor manages to subdue the henchmen, but is shot repeatedly by Kristic. Arthur accuses him of killing his mother, and Kristic recognizes her name, implying he truly was responsible for her death. As Arthur lies dying, Kat runs to help him. She promises to stop smoking crack and get a job. In an earlier conversation, Kat had revealed she had always had a talent in writing, which Arthur had described as being \"like Lois Lane\". She promises to be like her as Arthur dies in her arms.\nDooney and Kristic are arrested. Dooney is sentenced to 26 years in prison and Kristic is extradited to his home country. A memorial service is held for Defendor under a spray paint mural that was drawn in his honor, which is attended by Park and her daughter. The film ends with Kat sitting at her typewriter, writing stories about Arthur for a newspaper."}