{"mid": "Delirious", "IMDB_id": "tt0412637", "title": "Delirious", "plot": "Jack Gable is the lead writer and producer of the soap opera Beyond Our Dreams. Consumed by his work, he harbors an unspoken attraction to Laura Claybourne, the selfish actress playing the lead character, Rachel Hedison.\nJack crosses paths with Louise, who is there to audition for the part of Janet DuBois, a character Jack did not want introduced. Jack then has a contentious meeting with his co-producers, the Sherwoods. The Sherwoods reveal that they are displeased with several elements of Jack's outline for the upcoming season and wish to kill off Rachel, due to Laura's outrageous contract demands. Feigning compromise, the Sherwoods immediately hire Arnie Federman, a rival of Jack's, to make the changes they desire. At the same time, Jack has suggested a new character, Jack Gates, a ruthless tycoon. The Sherwoods make no promise of writing Gates into the show, despite Jack's interest.\nPlanning a trip to Vermont for the weekend, Jack is contacted by Laura. She has just broken up with her boyfriend Dennis, the actor who plays Dr. Paul Kirkwood on the show, and wishes to accompany Jack. As Jack loads their luggage into the trunk, Dennis suddenly calls out to Rachel. Jack looks up to see them kissing just as the trunk lid hits him in the head. Upon awakening, he leaves for Vermont alone. Not far out of New York, he crashes his car.\nUpon waking, Jack finds himself in Ashford Falls Community Hospital, one of the settings of his show. Thinking himself the victim of a prank by the actors, he goes to the window to confirm his suspicions, only to see a real town. Incredulous, he manages to convince Dr. Kirkwood of his good health and checks out of the hospital. He is immediately intercepted by Janet DuBois. She believes him to be Jack Gates, who is seeking to buy a miracle weight-loss formula developed by her late father. Jack rebuffs her, denies he is Gates and says that he is only a writer. As she leaves in frustration, she angrily tells him to \"write his way out\". On a whim, Jack gets out his typewriter and writes a scene of the local mechanic calling to say that his damaged car is fixed. Immediately after, the mechanic calls and confirms the repairs are finished. Jack realizes that he can control events by writing them.\nJack seizes his new found power to pursue Rachel, saving her from the death arranged for her by Federman. Despite his writing skills, she ignores him. His efforts are redeemed by the attentions of Janet. He assists her in her efforts to avoid the machinations of the Hedisons, including patriarch Carter and his sons, Blake and Ty. The Hedisons own a large pharmaceutical company, and wish to acquire her formula at any cost. The Federman version of Jack Gates appears, but Jack sends him on a business trip to Cleveland.\nAs Jack works to ingratiate himself to Rachel, he continues to run into Janet. The episodes culminate in a party at the Hedison mansion, where Jack accidentally breaks his typewriter. Helen Caldwell, a nurse at the hospital reveals that Rachel and Janet were switched at birth, with Janet being Carter's actual daughter. Rachel is confronted by a gun-wielding Blake, who has been experiencing side effects of an overdose of medication prescribed by Kirkwood, a scheme orchestrated by Rachel. Blake shoots Janet and she is rushed to the hospital, where Rachel convinces Kirkwood to kill her in surgery. Jack must race against time to repair his typewriter and write Janet back to health. As Jack begins to write, he is confronted by Gates, who is furious at having been sent to Cleveland and shoots at Jack with a shotgun, hitting the typewriter.\nJack wakes up back in New York, on the set of his own show, tended to by Laura and Dennis. He immediately confronts Laura about her behavior, revealing to her that she will be fired from the show. He confronts the Sherwoods about their plans for the show, and ensures that they will do things his way. He finds Louise in a delicatessen, gets her the part of Janet, and begins a relationship with her."}