{"mid": "DemolitionMan", "IMDB_id": "tt0106697", "title": "Demolition Man", "plot": "In 1996, psychopathic career criminal Simon Phoenix kidnaps a number of hostages and takes refuge with his gang in an abandoned building. LAPD Sgt. John Spartan uses a thermal scan of the building and finds no trace of the hostages, and leads an unauthorized assault to capture Phoenix. When he is captured, Phoenix sets off a series of explosives that bring down the building. The corpses of the hostages are found in the rubble, leading to the arrest of Spartan for manslaughter. He is incarcerated along with Phoenix in the city's new \"California Cryo-Penitentiary\", where they are cryogenically frozen and exposed to subconscious rehabilitation techniques.\nDuring their incarceration, the \"Great Earthquake\" of 2010 leads the cities of Los Angeles, San Diego, and Santa Barbara to merge into a single metropolis under the name San Angeles. The city becomes a utopia run under the pseudo-pacifist guidance and control of the evangelistic Dr. Raymond Cocteau, where human behavior is tightly controlled. In 2032, Phoenix is thawed for a parole hearing. He inexplicably knows and uses the access codes to the security systems, and escapes the prison. The police, having not dealt with violent crime for many years, are unable to handle Phoenix; Cocteau verbally authorizes the police to employ all means at their disposal to contain Phoenix. Lt. Lenina Huxley suggests that Spartan - the police officer who caught Phoenix - be revived and reinstated to the force to help them stop him again. Spartan, having spent 36 years in cryo-stasis until now, is thawed, reinstated, and assigned to Lieutenant Lenina Huxley to help with acclimation to the future, which he finds depressing and oppressive. Others on the police force find his behavior brutish and uncivilized, and Huxley, though fascinated by the lifestyles of the late 20th century, is disgusted when Spartan suggests kissing and sexual intercourse, acts which are taboo in the future due to their unsanitary exchange of bodily fluids and risk of transmitting diseases.\nEven after six officers fail to apprehend and subdue Phoenix, the police chief remains confident of success and predicts, with the help of a computer algorithm, that Phoenix will attempt to establish a crime syndicate, which Spartan finds ludicrous. Spartan instead correctly anticipates that Phoenix will attempt to secure firearms, which by 2032 are only in museum exhibits - Spartan and Phoenix have their first face-to-face confrontation in 2032 at the local museum when Phoenix breaks into a museum's weapon exhibition to arm himself. Phoenix escapes and encounters Dr. Cocteau but finds he is unable to shoot Cocteau. Dr. Cocteau reminds Phoenix to assassinate Edgar Friendly, the leader of the resistance group called the Scraps that fight against Cocteau's rule, and allows Phoenix to bring other criminals out of cryo-sleep to help at his request. After seeing the exchange on security cameras, Spartan and Huxley review the cryo-prison records and find that instead of an appropriate criminal rehabilitation program, Phoenix had been given the information necessary for his escape by Cocteau directly. They also discover information directing Phoenix towards Friendly, and go off to warn him.\nAt the Scraps' underground base, Spartan convinces Friendly of the threat and takes sympathy in their cause given what he has seen above ground. Spartan and the Scraps ward off an attack by Phoenix's gang, leading to a car chase between Spartan and Phoenix. Phoenix taunts Spartan by revealing that he had killed the hostages before Spartan had arrived in 1996, so Spartan spent 36 years in prison unnecessarily. Phoenix escapes, and Spartan arms himself with help from the Scraps as they emerge in force to get food.\nPhoenix returns to Dr. Cocteau with his gang, and as the rehabilitation programming prevents him from killing Cocteau, orders one of his gang to do so. They go back to the CryoPrison and begin to thaw out the most dangerous convicts. Spartan enters the prison alone to fight Phoenix, heavily damaging the facility in the process, and eventually uses the cryogenic chemical to freeze Phoenix solid. Spartan escapes the prison before it explodes and regroups with the police and the Scraps. The police fear the loss of Cocteau and the CryoPrison will send their society into a downward spiral, but Spartan suggests that they and the Scraps work together to create a society which combines the best aspects of order and personal freedom. He then kisses Huxley (which she finds enjoyable) and the two go off together."}