{"mid": "DemonicToys", "IMDB_id": "tt0104083", "title": "Demonic Toys", "plot": "Judith Gray (Tracy Scoggins) and Matt Cable (Jeff Weston)—two police officers who are dating—wait at the Toyland Warehouse to arrest illegal gun dealers Lincoln (Michael Russo) and Hesse (Barry Lynch). Judith tells Matt about a strange dream she has been having: Two boys—one good, one bad—playing war. She also reveals that she is pregnant. The confrontation with the gun dealers ends with Matt shooting Hesse, and Lincoln killing Matt. Lincoln and Hesse hide inside the Toyland Warehouse and split up; Judith goes after Lincoln.\nIn the security office, security guard Charneski places an order at a chicken delivery service run by his friend Mark Wayne (Bentley Mitchum). Mark arrives at the warehouse with Charneski's order. Meanwhile, the toys that surround a dying Hesse come to life and brutally murder him. Judith and Lincoln become locked inside the storage closet but are freed by Mark and Charneski. Charneski goes to call the police but is also graphically murdered by the toys, with Mark and Judith watching in horror. A toy named Baby Oopsy Daisy draws a pentagram around Charneski's corpse.\nA runaway named Anne who had been hiding in the air-conditioner shafts, joins the group. Mark explains that the doors don't open till morning but can be opened up from the office. Judith can't leave Lincoln as she has to bring him in, so Mark and Anne head to the office together. They are attacked by Mr. Static and Baby Oopsy Daisy. Mark fights back but Baby Oopsy Daisy kills Anne. Mark finally shoots Jack Attack's head off with Charneski's shotgun. Judith enters a dollhouse and is transported to the lair of a kid who reveals that he is a spirit of a demon who wants to become human. In order to do that, he has to impregnate a woman so that his soul can transfer into the woman's egg, where he has to eat the baby's soul and take over its shell. If the baby doesn't make it through the birth, he has to be buried like a seed, and once grown, he will start the process over again. The last time he was born was 66 years ago. The baby didn't make it through the birth so he was buried underneath the warehouse, unable to get out until Hesse bled onto the area.\nLincoln escapes while Judith is in the dollhouse. He catches up to Mark and is about to kill him when Judith appears and shoots Lincoln. Suddenly, all of the toys around them come to life. The pair begin shooting them to death, including Baby Oopsy Daisy. Grizzly Teddy turns into a man-sized monster and chases after Judith. Judith becomes trapped and is about to shoot herself when a toy soldier helps her escape. However, Judith is caught by the demon, who ties her up on the pentagram. Mark is attacked by Grizzly Teddy but manages to kill the monster. The demon, now in the form of a man, is about to rape Judith but the toy soldier shoots it, cuts Judith free, and turns into a boy (William Thorne). The demon transforms back into his own kid form and the two kids begin fighting, explaining the war card game from Judith's dream. As the demon is about to kill the boy soldier, Judith stabs him with the boy soldier's sword and the demon is sent back to Hell. Before heading back to Heaven, the boy soldier reveals that he's the spirit of the son she's going to have. Judith reunites with Mark and the two wait for the doors of the warehouse to open and let them go."}