{"mid": "DennisTheMenace", "IMDB_id": "tt0106701", "title": "Dennis the Menace", "plot": "Dennis Mitchell (Mason Gamble) is a five-year-old boy who lives with his parents in Evanston, Illinois. Henry (Robert Stanton) and Alice (Lea Thompson), and is the bane of next door neighbor, George Wilson (Walter Matthau). One morning, Mr. Wilson pretends to be asleep in order to avoid dealing with Dennis. Dennis enters his bedroom, only to find him asleep with by his prescription medication on his night stand, and assumes he's sick. To make him feel better, Dennis flings an aspirin into his mouth with a slingshot which causes him to gag and spit it out, as Dennis flees home.\nWhen Dennis arrives home, his parents learn of the incident he had caused to Mr. Wilson and are both angered, but because they are both working, Alice has to take him to stay at Margaret Wade's house for the day. He isn't too happy about this, because she is mean to him. When he arrives, he and Margaret, along with his best friend, Joey, venture into the woods to an abandoned tree house and intend to fix it up. Later, while getting paint from a high shelf in the garage, Dennis tries to grab his slingshot, which was taken away from him by Henry, and accidentally spills the paint on the floor. He then fervently attempts to vacuum it up, but ends up spilling a glob of it which splinters onto Mr. Wilson's barbecue grill, while he's cooking chicken, and he tastes the paint and wood splinters as he eats it. That night, Dennis has a set of babysitters; Polly and her boyfriend, Mickey. He plays doorbell pranks on them and they retaliate by sticking a thumbtack on the doorbell and preparing water and flour to dump on the prankster. However, Mr. Wilson goes over there to prove that Dennis was responsible for the paint on his chicken, against the wishes of his wife, Martha (Joan Plowright), only to ring the doorbell, stick his thumb, and get water and flour dumped on him, much to Martha's amusement. The next morning, Dennis goes over to the Wilsons' house to apologize for the events of the previous evening, but finds himself playing with Mr. Wilson's dentures, losing the two front teeth down the drain, and replacing them with Chiclets in the process. This gets noticed when Mr. Wilson gets his picture taken for the newspaper. Meanwhile, a burglar named Switchblade Sam (Christopher Lloyd) arrives in town and begins robbing people's houses, as well as stealing things outdoors and striking fear into children he meets.\nUnfortunately for Henry and Alice, they have a difficult time getting people to watch Dennis while they both work. Unfortunately for Mr. Wilson, he and Martha are being charged with the task of doing so, as both Henry and Alice are being called away on business trips on the same weekend. Martha loves him as if he were her own grandson, as she and Mr. Wilson never had children, and she enjoys telling Dennis a bedtime poem that her mother told her. Alternatively, Mr. Wilson is further irritated by him for spilling bath water on the bathroom floor, replacing his nasal spray with mouthwash, and his mouthwash with toilet cleanser, and even bringing his pet dog, Ruff, into the house for a while.\nFortunately for Mr. Wilson he's been selected to host the Summer Floraganza, a long awaited summer event. He has been growing and nurturing a rare night-blooming orchid for about forty years especially for it. Despite the investment, the flower dies shortly after it blooms. Alice’s flight is delayed due to a thunderstorm forcing Dennis to stay at the Wilsons for the night of the party. Martha is understanding, but Mr. Wilson is deeply dismayed about this. But, at her insistence, he eventually agrees to let Dennis stay outside for the party only with a firm warning to behave himself. He does not enjoy it much because the guests pinch his cheeks, and distances himself from them. However, in his curiosity, he finds himself pushing the garage door button, causing it to open, knock over the dessert table, and make a huge mess. Mr. Wilson sees it and angrily bans Dennis from the party. From inside, he hears Switchblade Sam robbing the house, goes downstairs, and finds Mr. Wilson's gold coins missing from the safe. Just as the flower is about to bloom, he alerts Mr. Wilson of the robbery, distracting everyone just long enough to miss the flower's brief blooming span. Furious about his forty year investment gone to waste and the constant mishaps Dennis has caused (as well as not believing that he was robbed), Mr. Wilson uproots the plant and severely scolds Dennis by saying that he has no use for him, that he does not want to see or know him anymore, and to get out of his way before telling the guests to leave. Heartbroken, Dennis flees on his bike, and rides off into the night. He then heads into the park, where he eventually bumps into Sam, who abducts him, intending to use him as a hostage.\nHenry and Alice arrive home soon after only to learn of Dennis' disappearance. They then contact the authorities and his friends to begin searching for him. Mr. Wilson, now feeling intense guilt and remorse about what he had said, especially since he really had been robbed, joins in the search in his car, and everyone ends up searching for him all night. Meanwhile, Dennis unintentionally but effectively defeats Sam by tying him up with a rope, setting him on fire twice, accidentally bludgeoning him several times, handcuffing him, and losing the key in a pot of baked beans amongst other things. He then returns to the Wilsons' house the next morning with an injured Sam in the wagon attached to his bike, having also recovered Mr. Wilson's gold coins. Sam is then taken into police custody by an amused sheriff who had advised him earlier to leave town. Dennis and Mr. Wilson make amends, and both the Mitchells and the Wilsons become close friends on better terms. That night, Alice told the Wilsons that she does not have to travel out of town anymore and will stay to work on local projects and Dennis can come to work with her since they have a day care center. Mr. Wilson scoffs at this saying he and Martha will be happy to continue watching him, explaining that he's learned some things about children by saying to both Henry and Alice that kids are kids and they have to play by their rules, roll with the punches, and expect the unexpected. Around the same time, just as Dennis is still trying to get the flame out of his marshmallow, it lands on Mr. Wilson's forehead.\nAs the closing credits begin to roll, Andrea, Alice's egotistical coworker, finds Dennis sitting near the copy machine as she comes in to use it. He asks to push the button on it, but she arrogantly tells him that he doesn't know what one to push. Sure enough, he pushes the \"PRINT\" one and runs off with other workers, including Alice, looking on. The paper feeder sucks up Andrea's scarf, her head gets pinned face down on the scanner bed, and the machine relentlessly flashes its blinding light in her eyes, repeatedly copies her face, and spews out page after page of black and white photos showing her various agonized facial expressions as she screams and cries on the scanner bed, eventually getting herself free."}