{"mid": "DerFuehrersFace", "IMDB_id": "tt0035794", "title": "Der Fuehrer's Face", "plot": "A German oom-pah band—composed of Axis leaders Joseph Goebbels on trombone, Heinrich Himmler on snare drum, Hideki Tōjō on sousaphone, Hermann Göring on piccolo and Benito Mussolini on bass drum—marches noisily at four o'clock in the morning through a small town where everything is shaped like swastika, singing the virtues of the Nazi doctrine. Passing by Donald Duck's house (the features of which depict Adolf Hitler), they poke him out of bed with a bayonet to get ready for work. Here Donald then faces and \"Heils\" the portraits of the Führer (Adolf Hitler), the Emperor (Hirohito), and Il Duce (Mussolini), respectively.\nBecause of wartime rationing, his breakfast consists of a piece of wooden bread, coffee brewed from a single hoarded coffee bean, and an aromatic spray that smells like bacon and eggs. The band shoves a copy of Mein Kampf in front of him for a moment of reading, then marches into his house and escorts him to a factory with Donald now carrying the bass drum and Göring kicking him.\nUpon arriving at the factory (at bayonet-point), Donald starts his 48-hour daily shift screwing caps onto artillery shells in an assembly line. Mixed in with the shells are portraits of the Führer, so he must perform the Hitler salute every time a portrait appears, all the while screwing the caps onto shells, much to Donald's disgust. Each new batch of shells is of a different size, ranging from minute shells to massive shells, as large as Donald if not larger. The pace of the assembly line intensifies (as in the Charlie Chaplin comedy Modern Times), and Donald finds it increasingly hard to complete all the tasks. At the same time, he is bombarded with propaganda messages about the superiority of the Aryan race and the glory of working for the Führer.\nAfter a \"paid vacation\" that consists of making swastika shapes with his body for a few seconds in front of a painted backdrop of the Alps as exercise, Donald is ordered to work overtime. He has a nervous breakdown with hallucinations of artillery shells everywhere, some of which are snakes and birds, some sing and are the same shape of the marching band from the start, music and all (some of the animation from this sequence is recycled from the \"Pink Elephants on Parade\" sequence from Dumbo).\nWhen the hallucinations clear, he finds himself in his bed, and realizes that the whole experience was a nightmare, but he sees the shadow of a figure holding its right hand up in the form of a Nazi salute. He begins to do so himself until he realizes that it is the shadow of a miniature Statue of Liberty, holding her torch high in her right hand. Remembering he is in the United States, he embraces the statue, grateful of his United States citizenship.\nThe short ends with a caricature of Hitler's angry face, and a tomato is thrown at Hitler's face and forms the words The End."}