{"mid": "DesertHearts", "IMDB_id": "tt0089015", "title": "Desert Hearts", "plot": "In 1959, Vivian Bell, a 35-year-old English professor at Columbia University in New York City, travels to Reno to establish residency in Nevada (a process that takes six weeks), in order to obtain a quickie divorce. She stays at a guest house ranch for women who are waiting for their divorces to be finalized. The guest ranch is owned by Frances Parker.\nVivian meets Cay Rivvers, a younger, free-spirited sculptor whom Frances loves as if she were her mother. Cay works at a casino as a change operator in Reno, and is ending a relationship with Darrell, her boss, because as she put it, she \"allowed (her)self to be attracted to his attraction\" for her. When Vivian arrives, Cay notices her immediately, and the tightly controlled and elegant Vivian, in turn, is taken aback by Cay's boldness and lack of concern of what others think of her (and her romantic/sexual preferences). Cay reveals that she has had relationships with women in the past. Frances jealously notices that Vivian is becoming a bigger and bigger part of Cay's life, and resents her for it, afraid that Cay will leave her and the ranch, and she will be left alone. Frances sees Cay as her only \"family,\" even though Cay is not her actual child, but rather the daughter of Frances' \"man\" Glenn who has been dead several years.\nWhen everyone attends an engagement party for Cay's best friend and co-worker, Silver, Cay drives a drunken Vivian to see Lake Tahoe afterwards and kisses her. Vivian returns the kiss passionately and is so surprised by her response to Cay's advance that she begs Cay to take her home. When they return to the ranch in the early morning, Frances has Vivian's bags and a taxi waiting for her, furious that (Frances presumed) she has seduced Cay. Cay leaves the ranch immediately, and Vivian transfers to a hotel room at the Riverside Casino for the rest of her stay.\nAfter some days apart, both Cay and Vivian are clearly confused and hurt. Cay goes to visit Vivian at the hotel and overcomes Vivian's resistance to making love with her, and they start a relationship. With the impending finalization of Vivian's divorce, the two must sort out the future of their relationship. Vivian is afraid of what people in her academic circle will think of her being in a relationship with another woman, and Cay is unsure of what she would ever do in New York City. At Silver's wedding, Vivian and Cay are in attendance, Frances and Cay are brought back together, and Cay admits to Frances that Vivian has \"reached in and put a string of lights around my heart.\"\nIn the final scene, after Vivian's divorce has become finalized, she packs up and goes to the train station to return to New York. Cay accompanies her to the station, and as the train is pulling out, Vivian convinces Cay to come with her, at least as far as the next station."}