{"mid": "DesignForLiving", "IMDB_id": "tt0023940", "title": "Design for Living", "plot": "=== Act I ===\nOtto's \"rather shabby\" studio in Paris, 1932\nGilda is an interior designer who lives with the painter Otto, who was previously attached to Leo, an author. She is visited by Ernest Friedman, an art dealer and friend of all three. He is excited about his newly acquired Matisse and wants to show it to Otto. Gilda says that Otto is in bed, ill, and cannot be disturbed. Ernest tells her that Leo is back in Paris after making a success in New York. Otto enters from the street, carrying luggage, and very clearly not bedridden as Gilda has told Ernest. Ernest prudently takes his leave. After he and Otto have gone out to find Leo, supposedly at the George V Hotel, Leo enters from Gilda's bedroom where he has spent the night with her. They discuss what they should say to Otto, whom they both love. On his return they tell him that they have slept together in his absence, and after a furious row he renounces both of them and storms out of the room.\n=== Act II ===\nLeo's flat in London eighteen months later\nScene 1\nLeo and Gilda are now living together. His plays are now immensely successful. A journalist and press photographer call to do a feature on him. During the interview Leo makes several remarks that show how shallow he finds success.\nScene 2\nA few days later, Leo is away, and Otto turns up. He too has now become successful. Otto and Gilda dine together and their old love is rekindled. They embrace passionately.\nScene 3\nThe next morning, Otto is still asleep when Ernest calls on Gilda. She tells him she is leaving Leo, and they exit together. Leo returns to discover Otto, who at once acknowledges that he has spent the night with Gilda. Before the ensuing row develops too far they spot the notes Gilda has left for them both. They are both horrified that she has gone, and they drown their sorrows in brandy and then sherry. They embrace, sobbing helplessly.\n=== Act III ===\nErnest's penthouse in New York, two years later.\nScene 1\nGilda has married Ernest and become a commercially successful designer. Ernest is away, and Gilda is giving a reception for some important clients. It is gatecrashed by Otto and Leo, in impeccable evening dress, determined to reclaim her. They frighten her guests into leaving, and Gilda pretends to bid them goodnight along with her other guests, but secretly gives them a key and tells them to return later.\nScene 2\nErnest returns the next morning to find Otto and Leo in his apartment, wearing his pyjamas. Gilda, however, has not been there. She has been to a hotel overnight to allow herself time to think. When she returns Otto and Leo explain to an incredulous and incandescent Ernest that Gilda's formal status as his wife is irrelevant. She slowly realises that the attraction the two exert for her is irresistible. As Ernest rushes out denouncing their \"disgusting three-sided erotic hotch-potch,\" Gilda, Otto and Leo fall together on a sofa in gales of laughter."}