{"mid": "DestryRidesAgain", "IMDB_id": "tt0031225", "title": "Destry Rides Again", "plot": "Destry rides again! Thomas Jefferson Destry, Jr. (Jimmy Stewart) is the deputy sheriff without a gun. He believes the law and public opinion is the answer to outlaws and gunfights. Bottleneck is a lawless town run by bad guys and gunslingers. Kent (Brian Donlevy), a host of gunslingers, the corrupt Judge Slade (Samuel S. Hinds), crooked gamblers and dishonest saloon gal Frenchy (Marlene Dietrich) were cheating, stealing, and forcing farmers to sell them their land against their will in order to have control of all the land when the railroad comes through the territory. The outlaws kill the old sheriff because he is wise to their game. In order to keep law and order out of Bottleneck, Judge Slade appoints the town drunk and apparently incompetent Washington Dimsdale (Charles Winninger) to be the new sheriff. Charles sobers up and is shocked by the news, but steps up to the challenge. Before he was a drunk he had been deputy for Sheriff Tom Destry Sr., who was the roughest, toughest sheriff of all time. Destry Sr. used his fists and his guns to clean up the lawless town, and was Sheriff there until gutless outlaws shot him in the back. Sheriff Dimsdale wires for the younger Destry, the most crack-shot Sheriff of Bottleneck since Destry, Sr. The towns villains hear about Destrys reputation and decide to meet his stagecoach in Bottleneck, and give him a not-quite-warm welcome. When the stage arrives, to everyones surprise, Destry is carrying a birdcage and parasol because he is helping a female passenger - a sweet Bottleneck girl he fancies - debark from the stage. The entire town roars with laughter at the sight of the new deputy who appears to fall short of the lawman ideal. The new sheriff is agreeable and unconcerned about the mocking. Later, he goes to the saloon and attends unarmed: I dont believe in guns, he tells the astounded locals. This prompts more ridiculing from the outlaws. Destry then meets Frenchy, who has a cat fight with a Russians wife who has come to claim her husbands pants after Frenchy won them in a fixed poker game earlier. Destry stops the fight, pouring a bucket of water on Frenchy. Naturally, this enrages the theatrical lady, but her scrap with the new sheriff sparks a romantic interest between Destry and Frenchy. Destry then makes the Russian a deputy; Bottlenecks new triumvirate then decide to trick the outlaws to find out who killed the previous sheriff and why. They make an arrest. The outlaws and people of Bottleneck soon learn that there is more to their laughable deputy sheriff than friendly talk, especially after his friend Dimsdale gets shot in the back while guarding the new prisoner. It is revealed that Frenchy was implicit in Dimsdales death, and she deliberately distracted Destry whilst Dimsdale is murdered and the imprisoned outlaw is freed. Destry straps on his guns and goes looking for those responsible. A large brawl erupts, and Frenchy changes her allegiances once more, catching a bullet for the otherwise doomed deputy. Destry, as formidable as his father, vanquishes the outlaws and cleans up Bottleneck. The Russian finally gets his pants, Destry falls in love with a girl from the stage, Bottleneck is saved, and Destry rides again!"}