{"mid": "DevilsPrey", "IMDB_id": "tt0245866", "title": "Devil's Prey", "plot": "The movie opens with a young woman being sacrificed by members of a Satanic cult. The focus then switches to five college kids: Eric, David, Samantha, Joe and Susan. Sam gets given a flyer for a rave and the gang decide to go. The rave is held in a barn and Eric starts selling drugs to people there despite being on parole. David gets into a fight with one of the other guys there and the gang are thrown out. As they leave, the man throwing the rave remarks that they may have found some candidates. While driving home, David nearly runs over a woman called Fawn who is covered in blood and has been running from a group of Satan worshippers called the Shadows. The gang are soon ambushed by the Shadows who run their car off the road. While trying to escape, Joe is caught by the Shadows and taken away. The others hide out in a cabin and Fawn tells them they have been trying to sacrifice her to Satan. The gang are divided on what to do next as Sam and Eric think they should leave Fawn since it's her the Shadows want while Susan and Eric think they should help her because they nearly killed her. They are soon attacked by members of the Shadows while Joe is being sacrificed elsewhere. They manage to fight them off and escape from the cabin. While out walking they are attacked by a girl that Eric recognises from the rave. The five of them follow the river and eventually come to a small town. They find Seth, the minister who knows about the Shadows and he takes them to the local sheriff. Sam and Eric stay behind at the diner while David, Susan and Fawn go with the sheriff. They go to the crash site and find that their car has been taken away but they find Joe's glasses to prove their story. Back in the diner, Eric goes outside to make a phone call but the pay phone is broken. The people in the diner knock Sam out and kidnap her. Meanwhile the others run into Seth on the road and he shoots the sheriff and Fawn reveals that she is in league with him and the Shadows. She knocks David out but Susan gets away. David and Sam are taken to the barn where the rave was held and Sam is tortured and eventually killed by Fawn. Back in the town Eric and Susan sneak in the back of a pick-up truck to get to the barn. When they get there Eric is hit in the back with an axe and Susan is drugged. When she comes around she has been chained up, ready to be sacrificed in the hopes that the Shadows will get immortality. Seth prepares the ritual to sacrifice Susan but Eric drives the car into the barn. Susan kills Fawn and her and David escape while Eric blows up the truck, killing everyone else. Seth gets out and goes after Susan and David but they crash the truck into him and he is impaled on a stake. The ending flashes forward six months later to David and Susan living in an apartment of their own. David leaves for class and Susan has a nightmare of Fawn in the apartment. As she closes the door we see Seth standing inside and he says \"hello, Susan\" as the movie ends."}