{"mid": "DevilInABlueDress", "IMDB_id": "tt0112857", "title": "Devil in a Blue Dress", "plot": "Set in 1948, in the Watts area of Los Angeles, the story begins with Easy out-of-work and unable to pay his mortgage. He is sitting in a bar run by Joppy, a friend from Texas, when a man named DeWitt Albright walks into the bar and offers him a job finding a young woman named Daphne Monet. Monet, a young white woman, is rumored to be hanging out in bars frequented mostly by African Americans, although white women are allowed inside.\nAt the bar Easy meets two old friends, Coretta and Dupree from Texas, among many other people that he knew from his former life in the South. Coretta says that she knows Daphne, but gives an incorrect address to Easy. He goes home with them and has sex with Coretta, although Dupree is asleep next room, and then leaves her in the early morning only to be arrested by the LAPD shortly thereafter and, after some questioning, he is told that Coretta is dead and that he is a suspect in Coretta's murder.\nWhen he finally does find Monet, he figures out that she has stolen a large amount of money from a man named Todd Carter, who is a local wealthy businessman. Albright wanted to claim it for himself. Eventually, Albright finds Monet through Easy, who is trying to shield the thieving woman.\nWith the help of his friend Mouse (who shows up mid-way through the story, due to a half-hearted invitation from Easy and domestic strife back home in Texas) he finds Monet with Albright and Joppy. They rescue her, kill Joppy and Albright, and then Mouse reveals that Monet is actually Ruby, an African-American woman passing as white, and the sister of a local gangster named Green. Mouse and Easy blackmail Ruby, taking her money and dividing it into thirds for each of them. Daphne/Ruby leaves shortly thereafter and Easy has to clean up the mess with the police and Todd Carter, who had initially hired Albright to find her as he really did love her and not his money.\nEasy approaches Carter and requests his help with the police. He blackmails him by saying that he will leak the information about his love for a black woman unless he is protected from the law. Carter does so. At the conclusion, Mouse goes back to Texas, Easy takes up detective work, and Ruby disappears."}