{"mid": "DiaryOfAWimpyKidDogDays", "IMDB_id": "tt2023453", "title": "Diary of a Wimpy Kid: Dog Days", "plot": "The Heffley family attends a pool party at the local pool, where the family meets a former trouble-making friend of Rodrick who is now a model student after attending a military school known as Spag Union, into which Greg's dad Frank (Steve Zahn) thinks about enrolling Greg.\nGreg's summer starts off roughly, with his video games confiscated due to Frank's vision of Greg's laziness, and his mother Susan starting a book club. Frank is also getting jealous of the neighbor's athletic kids. Frank and Greg are forced to bond with each other; however, their bonding activities are causing one disaster after another. Greg's best friend, Rowley Jefferson (Robert Capron), takes Greg to the local country club, where Greg enjoys the lifestyle, and the fact that his crush, Holly Hills (Peyton List), teaches tennis there. When Greg returns home, he finds out that Frank had signed him up for an unpaid internship at Frank's job, without his consent; however, Greg evades it by lying about already having a job at the country club.\nRowley invites Greg on a family trip to their beach house near the Boardwalk. Before leaving, Greg's parents give him a starter cell phone called a Ladybug, which only allows him to call home or 911. Greg eventually dislikes the lifestyle there and attempts to escape. However, when he tries to call home using his Ladybug phone, the phone rejects his call. Then he inadvertently calls 911 and the police arrive, almost leading to the arrest of Rowley's father; Greg is then exposed and sent home. Rowley doesn't allow Greg to tag along with him to the country club because of the beach house incident, but Greg sneaks in. He meets with Holly and her sister Heather and manages to get Löded Diper a gig at Heather's sweet sixteen, much to Rodrick's delight. Rowley and Greg quickly make up; however, one morning, Greg is finally exposed when Rowley's father becomes infuriated that Greg has built up a massive fruit smoothie bill from his time at the country club, and Frank realizes Greg doesn't have a job. As a result, Greg receives a Spag Union disc, and he fears he will be sent there.\nRodrick informs Greg that the \"Wilderness Weekend\" could be a way to avoid Spag Union, and Greg goes there along with Rowley, Chirag (Karan Brar), and Fregley (Grayson Russel). Their troop proves weak compared to Frank's boss Stan's troop. Greg continues to mess things up, and Frank tells Greg that everyone messes up. One day, the boys overhear Stan and his troop insulting Frank, and Greg attempts to set up a plan for revenge by using traps, in which Greg finds out that Stan's troop has been using electric and other conveniences (pre-cooked meals and portable TVs), rather than actual camping. Stan arrives at the tent, and in Greg's effort to escape Stan, throws the tent into the campfire; after which, Greg decides to tell the truth, impressing Frank. Frank, having lost his respect for Stan, confronts him with the electronic conveniences. Stan eventually falls in Greg's trap. Frank reveals that he never liked camping, and decides not to send Greg to Spag Union, much to Greg's surprise and delight. Frank gives Greg advice about learning from mistakes and taking responsibilities. The two discover they are much alike than they realize.\nAt Heather's Sweet 16 birthday party a few days later, Löded Diper performs a rock version of \"Baby\" by Justin Bieber, during an attempt to win over Heather. However, Rodrick accidentally knocks over an ice sculpture, which results in Heather losing her temper, and the party ends in disaster. Holly then implies that she likes Greg by holding his hand, and in the final scene, Greg describes that his summer did not go the way he expected, but had positive circumstances."}