{"mid": "DiaryOfAWimpyKid", "IMDB_id": "tt1196141", "title": "Diary of a Wimpy Kid", "plot": "As a prank, Rodrick (Devon Bostick) wakes up Greg (Zachary Gordon) claiming that it was time for school. It is found that Rodrick tricked Greg and the title sequence begins.The first day of Greg Heffley's middle school ends negatively; in the gym, he plays Gladiator with other wimps, he learns about the Cheese Touch which is a rotten piece of cheese on the basketball court that one day Darren Walsh touched and the Cheese Touch begins. It all ends when Dieter Muller takes the Cheese Touch with him, discovers the ups and downs to the school, such as no stall doors in the boys' bathroom, and Greg and his best friend Rowley Jefferson (Robert Capron) eat on the floor. This is also when Greg meets Angie (Chloe Grace Moretz), a girl who isolates herself from the other girls to survive.\nAt the end of the day, Rowley unintentionally embarrasses both boys by asking Greg if he wants to come over and \"play\". Greg looks through Rodrick's yearbook at home and Rodrick catches them, intending to \"kill\" Greg. The next day, Greg signs up for wrestling to become extremely popular, which results in two humiliating defeats joining the wrestling team by a weird, unpopular kid named Fregley (Grayson Russell) and his arch-enemy Patty Farrell (Laine MacNeil). On Halloween, the two boys encounter teenagers while trick or treating, and they are drenched with water. Rowley's shield (part of his Halloween costume) blocks assumed 95% of the water. Nevertheless, Greg says he will call the cops. This causes the teenagers to chase them to his Grandma's house. The teens further chase them to the Devil Worshipper Woods, which Rodrick warned them about before the duo left to trick or treat. Some time later on, Greg makes it an effort to make Rowley popular by changing his style of clothing and looks, and how he wears a backpack.\nThe boys join Safety Patrol in an effort to become popular, and they try out for a contest that offers a student a chance to become the new cartoonist for the school paper. Rowley fractures his arm during winter due to a game the boys played, and Rowley gets extremely popular, and wins the contest, causing Greg to become more jealous. At Safety Patrol, Rowley is unable to serve due to his injury; and Greg serves by himself but discovers a truck identical to the teenagers' from Halloween. In a panic, he hides the kids in a construction zone and the neighbor spots Greg, mistaking him as Rowley due to the coat Greg's wearing; and the truck belongs to someone else. Rowley is soon banned inadvertently, but Greg decides to expose himself; causing an argument between them, in which Rowley accuses Greg of being a selfish terrible friend for not exposing himself sooner, hating Rowley's comics, mocking his favorite pop star Joshie, and breaking his hand and didn't act like he was sorry, then Rowley states they aren't friends anymore. One of the kindergartners told the whole story, further parting Greg and Rowley, Rowley makes friends with Collin who replaces Greg as Rowley's new best friend.\nGreg decides to pursue popularity without Rowley by joining the school play. At tryouts, Greg uses a wonderful soprano, prompting the music teacher to cast him as Dorothy Gale; however, Patty threatens the teacher into casting her as Dorothy. Chirag, (Karan Brar) tells him he could sign up as a tree to bean Patty with apples. During rehearsal, Greg is told he doesn't throw apples and sings instead. He doesn't sing due to Rodrick videotaping him, and Greg throws apples at Patty; causing the play to end. Getting upset about the circumstances the year has become for Greg, he gets his brother Rodrick grounded, but fails to reconcile with Rowley.\nOne day at school, Rowley and Greg confront each other, and catches attention to the rest of the school. Patty and the kids force Greg and Rowley to fight each other; however, neither of them are good at fighting. The Halloween teenagers arrive at the scene and force the school to flee, but catch Rowley and Greg. They force Rowley to eat the cheese, giving him the Cheese Touch; but as Greg is about to eat it, the gym teacher and the school comes out and forces them to flee. Greg with a change of heart covers up for Rowley by saying he ate the Cheese, which mends their friendship. However, the school then thinks that Greg has the Cheese Touch.\nYearbooks eventually come, Patty touches Rowley, unaware she now has the Cheese Touch. Greg's popularity didn't succeed the way he planned, but that he and Rowley had some sort of representation; as they make the Class Favorites page as \"Cutest Friends.\""}