{"mid": "DieHard", "IMDB_id": "tt0095016", "title": "Die Hard", "plot": "On Christmas Eve, NYPD Detective John McClane arrives in Los Angeles. He aims to reconcile with his estranged wife, Holly, at the Christmas party of her employer, the fictional Nakatomi corporation. McClane is driven to the party by Argyle, an airport limousine driver. While McClane changes clothes, the party is disrupted by the arrival of a German terrorist named Hans Gruber and his heavily armed team: Karl, Tony, Franco, Theo, Alexander, Marco, Kristoff, Eddie, Uli, Heinrich, Fritz, and James. The group seizes the tower and secures those inside as hostages, except for McClane, who manages to slip away.\nGruber singles out Nakatomi executive Joseph Takagi, and says he intends to teach the corporation a lesson for its greed. Isolated from the hostages, Gruber interrogates Takagi for the code to the building's vault and reveals that his endgame is to attempt to steal $640 million in bearer bonds in the vault, with terrorism merely being used as a distraction. Takagi refuses to cooperate and is murdered by Gruber. McClane, who had been secretly watching, accidentally gives himself away and is pursued by Tony. McClane manages to kill Tony, pocketing his weapon and radio, which he uses to contact the Los Angeles Police Department (LAPD). As Sgt. Al Powell is sent to investigate, Gruber sends Heinrich and Marco to stop McClane, who kills them both. Powell arrives and is greeted by Eddie, who is posing as a concierge; he finds nothing strange about the building. As Powell turns to leave, McClane drops Marco's corpse onto his patrol car to get his attention. Powell summons the LAPD, who lays siege to the building. McClane steals Heinrich's bag containing C-4 explosives and detonators.\nJames and Alexander use anti-tank missiles to knock out a SWAT Greyhound armored car, but before they can finish its destruction, they are killed when their building floor is blown up by C-4 that McClane dropped. Holly's coworker Harry Ellis attempts to mediate between Hans and McClane for the return of the detonators. McClane refuses to return them, causing Gruber to murder Ellis. While checking explosives attached to the roof, Gruber is confronted by McClane. Gruber passes himself off as an escaped hostage and is given a gun by McClane. Gruber attempts to shoot McClane but finds that the gun is empty. Before McClane can act, Karl, Franco, and Fritz arrive. McClane kills Fritz and Franco, but is forced to flee, leaving the detonators behind.\nFBI agents arrive and take command of the police situation outside, ordering the building's power be shut off. The loss of power—as Gruber had anticipated—disables the vault's final lock. Gruber demands that a helicopter arrive on the roof for transport, and the FBI prepare to double-cross him by sending helicopter gunships to take down the terrorists. However, McClane discovers that Gruber's true intention is to detonate the explosives on the roof, thus faking the deaths of his men and himself so they can escape with the bearer bonds, a plan that would also kill the hostages. Meanwhile, Gruber sees a news report by intrusive reporter Richard Thornburg that features McClane's children, and deduces that McClane is Holly's husband. The criminals order the hostages to the roof, but Gruber takes Holly with him to use against McClane. McClane defeats Karl in a fight, kills Uli, and sends the hostages back downstairs before the explosives detonate, destroying the roof and the FBI helicopter.\nTheo goes to the parking garage to retrieve their getaway vehicle but is knocked unconscious by Argyle, who had been trapped in the garage throughout the siege. A weary McClane finds Holly with Gruber and his remaining men, and knocks Kristoff unconscious. McClane surrenders his machine gun to spare Holly, but then distracts Gruber and Eddie by laughing, allowing him to grab a concealed pistol (still with two bullets) taped to his back. McClane shoots Gruber in the shoulder and then kills Eddie with his final shot. Gruber crashes through a window, and while he momentarily saves himself by grabbing Holly's watch, McClane removes it and Gruber falls to his death.\nMcClane and Holly are escorted from the building and meet Powell in person. Karl emerges from the building disguised as a hostage and attempts to shoot McClane, but is gunned down by Powell. Argyle crashes through the parking garage door in the limo. Thornburg arrives and attempts to interview McClane, but is punched by Holly. McClane and Holly are then driven away by Argyle."}