{"mid": "Diggstown", "IMDB_id": "tt0104107", "title": "Diggstown", "plot": "Gabriel Caine (James Woods), a con man, is released from prison in Winfield, Georgia and immediately gets to work on his next scam. Caine and his partner, Fitz (Oliver Platt), travel to a small town not far from the prison: Diggstown, a city obsessed with boxing.\nA mean-spirited man named John Gillon (Bruce Dern) owns almost all of Diggstown. He is feared by many but also respected because he was the former manager of Diggstown’s pride and joy, the once-famous boxer Charles Macom Diggs, the man for whom the town is named.\nUpon hearing a remark that Diggs once knocked out five fighters in one day, Fitz “drunkenly” says he knows of a fighter who could knock out any 10 in one day: Honey Roy Palmer. Gillon tries to take advantage of the situation and bets Fitz $100,000 that no one man can best ten Diggstown boxers in one day. Caine quickly volunteers to finance Fitz's bet and the con is on.\nCaine seeks out an old buddy, Palmer (Louis Gossett Jr.), who is now a 48-year-old YMCA supervisor. After some initial reluctance, Palmer agrees to participate and starts to train for the fight. Caine and Gillon agree to various conditions of the bet, with “one day” being 24 full hours and “Diggstown fighters” being able to come from any surrounding area of Olivair County. A loan shark backs Caine's bet, with the understanding that his health and welfare will be riding on the outcome.\nCaine discovers that Gillon’s treachery (and his bank account) goes deeper than Diggstown people know. As his manager, Gillon drugged Diggs during a fight so that Gillon could collect on the opponent’s long odds. Diggs suffered irreversible brain damage as a result. With help from his prison buddy Wolf's sister (Heather Graham), it is learned that Gillon has more than $1.5 million in assets. Caine tricks him into risking all of it. Now it is up to Honey Roy Palmer to defeat all 10 of Diggstown's men.\nThey begin with:\nBuck Holland, who is played by former Heavyweight Boxing Contender Rocky Pepeli who puts up a good fight, Palmer barely beats him.\nSlim Busby, who like his brother, Hambone, has been bribed by Caine to take a dive.\nBilly Hargrove (a young James Caviezel), who is easily beat.\nSam Lester (played by Roger Hewlett), who is secretly given a laxative before the fight and eventually runs from the ring.\nHambone Busby, who, like his brother, has been bribed to take a dive. Gillon, however, threatens to kill Hambone’s brother, Slim, unless he is victorious in the ring. Hambone fights a vicious fight, but is ultimately defeated. Slim is indeed found murdered.\nPalmer is enraged. His next fight is with Sonny Hawkins, who is easily dispatched. Robby Gillon, the son of John Gillon, approaches the ring next, but then backs out under instructions from his father. His cowardice is regarded as a forfeit. Frank Mangrum officially loses to disqualification after kicking Palmer in the groin, then hitting the referee then gets knocked out by Palmer. Tank Miller, a gargantuan fighter, is next. He puts up a good fight, but a tiring Palmer eventually beats him.\nThat brings up Diggstown's best man, Hammerhead Hagan, the only fighter ever to actually beat Palmer during their professional careers. He is brought in as a surprise ringer. Gillon moved him in as a county resident just before the bet rules were established, meaning that Hagan can legally fight.\nThe bout is one-sided. Palmer looks done for, but he gets new motivation after seeing Diggs, who is sitting courtside, move his hand slightly (which he interprets as a show of support). Caine, not wanting to see his friend die, attempts to throw in the towel, but Palmer catches it and throws it back. Palmer rallies to knock out his opponent.\nPalmer, Caine and Fitz begin their celebration of this miraculous feat. They are cut short by Gillon, who notes that his son never entered the ring -– therefore, only nine fights have transpired. The true tenth fighter is then introduced: Minoso Torres, a tough-as-nails boxer who ruled the boxing underground in the prison from which Caine was recently released. No one has ever defeated him. Gillon admonishes Caine with: \"Never try to hustle a hustler.\"\nAn exhausted Palmer is no match for Torres. But just when all looks lost, Caine whistles at Torres, gets his attention, straightens his tie and does a thumbs-down gesture (copying a move Gillon did earlier). Torres drops his gloves and invites Palmer to hit him, hitting the canvas, knocked out. Caine was expecting such a trick from Gillon and bribed Torres long ago for a moment like this.\nGillon has lost everything, leading Caine to correct him with an admonishment: \"Actually, I believe it goes: Never con a con-man, especially one who's better than you are.\" Calm at first, he snaps and pulls a gun. His son, Robby, tries to intervene and Gillon smacks him. Palmer then grabs Gillon and prepares to deck him. Instead, he turns to Hambone, claiming, \"My hands hurt.\" Hambone gladly obliges and delivers Gillon a powerful knockout blow.\nCaine congratulates Palmer: \"What you did,\" he says, \"couldn't be done.\" To which Palmer replies, \"Now, you motivate me\"."}