{"mid": "DinnerAtEight", "IMDB_id": "tt0023948", "title": "Dinner at Eight", "plot": "One week before her next society dinner, Millicent Jordan (Billie Burke) receives word that Lord and Lady Ferncliffe, whom she and her husband Oliver (Lionel Barrymore), a New York shipping magnate, had met in England the previous year, have accepted her invitation. Overjoyed by this social coup, Millicent is oblivious to Oliver's lack of enthusiasm about the dinner and her daughter Paula's (Madge Evans) preoccupation about the impending return of her fiancé, Ernest DeGraff (Phillips Holmes), from Europe. Millicent fusses about finding an \"extra man\" for her single female guest, former stage star Carlotta Vance (Marie Dressler), who resides in Europe.\nMeanwhile, Oliver faces distressing news about his shipping business, which has been struck hard by the Depression. Carlotta, an aging retired actress and former lover of Oliver, visits Oliver at his office and asks him to buy her stock in the company, but he does not have the money. Dan Packard (Wallace Beery), a mining magnate, stops by long enough for Oliver to ask him to buy some company stock. Dan agrees only to consider the proposition, he then brags to his wife Kitty (Jean Harlow) that he will take the shipping business through deceit.\nUnknown to Dan, Oliver has convinced Millicent to invite the Packards to her dinner with the hopes that it will increase Dan's wish to buy the stock. Dan's young trophy-wife, the ill-mannered but socially ambitious Kitty (Jean Harlow), eagerly has accepted. Although he at first refuses to go, Dan, who believes that he will soon be appointed to a Cabinet post, changes his mind about the dinner when he finds out that the Ferncliffes, the richest couple in England, are also invited. Also unknown to Dan, one of Millicent's other guests, Dr. Wayne Talbot (Edmund Lowe), has been having an affair with Kitty while pretending to be tending to her feigned illnesses.\nOn the eve of her dinner, Millicent, still short an extra man, telephones Larry Renault (John Barrymore), a washed-up silent movie star, and extends him a last-minute invitation, completely unaware that Paula is having a clandestine love affair with him. At Paula's urging, Larry, a three-time divorcé and hardened alcoholic, accepts the invitation, but advises the much younger Paula to forget about him and return to Ernest. After Paula stubbornly refuses to take Larry's admonitions seriously, she is seen leaving his room by Carlotta, who is residing at the same hotel.\nLater that evening, Larry is visited by his agent, Max Kane (Lee Tracy), who tells him that the stage play he was planning to star in has lost its original producer. Max breaks the news to Larry that the play's new producer, Jo Stengel (Jean Hersholt), wants another actor in the lead but is willing to consider him in a bit part. Crushed, Larry takes to drink.\nThe next day, Talbot is discovered by his wife Lucy (Karen Morley) in a compromising telephone call with Kitty and confesses that, in spite of his love for her, he is addicted to women and needs help to overcome his weakness. Talbot then is rushed to see Oliver, who has come to the doctor's office with severe chest pains.\nAlthough Talbot tries to hide his prognosis of terminal thrombosis of the heart, Oliver wisely deduces the seriousness of his illness. When he returns home, the weakened Oliver tries to explain to Millicent his need for rest, but she is too hysterical to hear because, among other minor disasters, the Ferncliffes have cancelled and are on their way to Florida. Although anxious to tell Millicent about Larry, Paula, too, is turned away by her upset mother and faces the prospect of facing Ernest alone.\nAt the Packards', meanwhile, Kitty reveals to Dan in a fit of anger that she is having an affair. When threatened with divorce, however, Kitty tells her husband that, if he wants his Cabinet appointment instead of a career-stopping revelation from her about his crooked dealings, he must back down from his takeover of Oliver's line and treat her with more respect.\nJust before he is to leave for the dinner, Larry is visited by Max and Jo Stengel and drunkenly berates Stengel for insulting him with his paltry offer. After a frustrated Max denounces him for ruining his last career chance and the hotel management asks him to leave, Larry quietly turns on his gas fireplace and commits suicide.\nAt the ill-fated dinner, Carlotta confides in private with Paula, who is just about to break her engagement with Ernest, about Larry's demise and counsels the young woman to stay with her fiancé. At the same time, Millicent learns from Talbot about Oliver's illness. Finally awakened to her selfishness, Millicent announces to Oliver that she is ready to make sacrifices for the family and be a more attentive wife. Then, as the beleaguered guests are about to go in to dinner, Dan, with prodding from Kitty, tells Oliver that he has put a stop to the takeover of the Jordan shipping line."}