{"mid": "Dinocroc", "IMDB_id": "tt0365653", "title": "Dinocroc", "plot": "A North African dinosaur, related to the crocodile, is found which could grow up to fifty feet long. Dr. Campbell (Bruce Weitz) uses its DNA to create two hybrids of it with a modern-day crocodile at Paula Kennedy's Genetic Research Co. (Gereco) lab. One creature kills Dr. Campbell's assistant and the other creature before escaping. This information is kept from Sheriff Harper (Napier) by Kennedy, stating the dead creature killed Campbell's assistant. His daughter, county dog catcher Diane Harper, helps her ex welding artist, Tom Banning, and his 12-year-old brother Michael (Jake Thomas) find their three legged dog, Lucky, who was lost a few days earlier.\nMeanwhile, Kennedy sends a trapper to feed Dinocroc (the animal still being on Gereco Property). The trapper uses Lucky as bait, but Lucky runs away and Dinocroc quickly devours the trapper soon after. Later in the morning Diane and Tom find Lucky running around in the woods and try to catch him unaware that Dinocroc is lurking nearby, but Dr. Campbell saves them by shooting at it. Kennedy then hires an Australian crocodile hunter, Dick Sydney (Costas Mandylor), to help kill the Dinocroc. Later that night, Michael sneaks out to look for Lucky when he comes face to face with the creature. Dinocroc chases Michael through the forest into a tool shed sitting above water. The Dinocroc then gets under the shed and engulfs Michael from below, leaving only his head.\nThe next day, not having noticed that Michael has gone, Tom, Diane, Dick, and Campbell find that the creature is headed toward the town's lakeside beach. It kills 3 people, the last one being Campbell. In a press conference after the incident Kennedy lies that Campbell was not part of Gereco. Sheriff Harper then plans to kill the creature with his police force and Diane. While looking for it, they stumble upon Michael's damaged bike and Michael's remains in the shed. Tom, who knows Michael is missing, appears on his motorbike, then speeds away after seeing what is left of his dead brother. After trying to get drunk, Tom cries loudly over his brother and Diane comes to comfort him along with Lucky. Meanwhile, 5 of Sheriff Harper's officers are killed by the Dinocroc.\nThe next day, Tom, Diane and others devise a plan to trap Dinocroc in a tunnel and gas him to death. Sheriff Harper uses some dogs for bait, which Diane and Tom object to, so Harper has them handcuffed and put in the police car. The two escape and use a blowtorch to release the chained dogs, while the creature chases them. They trap Dinocroc in the tunnel and gas it, seemingly killing it.\nWhile a local news crew is taping Kennedy (who arrived after the creature's death) inside the tunnel, telling the reporter false stories about the events, Dinocroc awakens, eats her whole and comes after Tom and Diane, who are left after the news crew drives away quickly. After hiding under a truck they hear a train and lure Dinocroc across the tracks. It is rammed by a passing train, followed by Tom stabbing it in the eye with a small pipe as revenge for Michael's death. As the sun rises the next day, Diane and Tom drive away, contemplating leaving for a vacation together. Then the camera pans slowly back as their truck passes and Dinocroc is seen walking weakly across the road still alive."}