{"mid": "DisturbingBehavior", "IMDB_id": "tt0134619", "title": "Disturbing Behavior", "plot": "Steve Clark (James Marsden) is a high school senior whose family moves to Cradle Bay, a picturesque island community in Washington state's Puget Sound. It has been nearly one year since Steve's older brother, Allen (Ethan Embry), committed suicide, which traumatized the family.\nDuring Steve's first day at his new high school, he meets and befriends three outcast students, Gavin Strick (Nick Stahl), U.V. (Chad E. Donella), and Rachel \"Rae\" Wagner (Katie Holmes). Gavin tries to tell Steve that he believes there is something evil about the \"Blue Ribbons\"—a clique of students taking part in a \"special program\" led by the school psychologist, Dr. Caldicott (Bruce Greenwood). Later that day Steve witnesses a fight in class between a rebellious student, Dickey, and one of the Blue Ribbons. Dickey is later accosted at a secluded marina by the Blue Ribbons. He reappears at school as a clean-cut Blue Ribbon and assists in smashing his once-prized muscle car up in front of the students.\nSteve goes to a local yogurt shoppe to meet Gavin, but the Blue Ribbons, keen to befriend him, invite him to sit with them. Gavin arrives to meet Steve, and takes him outside after a tense exchange with the group. Gavin shows a photograph of himself and several Blue Ribbons, who were until recently outcast/misfit types like him. The two eavesdrop on a parents meeting, where Gavin learns his parents have signed him up for Caldicott's program. Steve remains skeptical of Gavin's fears of the Blue Ribbons and the program, and wrestles a gun Gavin produces, which he planned to use against his expected abductors. Steve heads home.\nThe following day at lunch, Gavin walks in looking like a Blue Ribbon. When Steve tries to confront Gavin, he gets punched in the stomach for his impertinence. Later, after being chased home, Steve finds Blue Ribbon member Lorna Longley in his living room, ostensibly waiting up after tutoring Steve's younger sister Lindsay. She goes to use the bathroom, then emerges, partially undressed, and forcefully kisses Steve. Her heightened arousal causes her eye to glow red, startling Steve. Lorna starts saying \"wrong, bad\" then smashes her head into a mirror, attacks Steve with a mirror shard, then obliviously leaves the house. She is later seen undergoing treatment at a medical facility under Dr. Caldicott's direction.\nDuring this time, Steve also befriends Dorian (William Sadler), the school janitor, who appears to be mentally disabled and hunts rats for the city for some extra cash. Dorian demonstrates a device called an E-Rat-icator which emits a soft, high pitched whine that is supposed to be innocuous but annoying to rats. Dorian tells Steve that he suspects that the entire community of Cradle Bay is part of a massive conspiracy made up of nearly all of the parents, the local police chief, the school principal and entire school faculty, who hired Dr. Caldicott to \"re-program\" their own children to become the perfect people that they want them to be and not free-thinkers. Rachel finds a CD-R disc that Gavin hid in the school's boiler room, containing a video he made of himself before his \"transformation\", telling about the history of the club and Caldicott's background. A Blue Ribbon known as \"Chug\" (A.J. Buckley) assaults Rachel in the basement, when Dorian's E-Rat-icator goes off, and immediately sends Chug into an agonized frenzy, during which Rachel slips away. Chug smashes the E-Rat-cator and walks out, apparently oblivious to what has just occurred.\nDuring their personal investigation, Steve and Rachel try to find out what exactly has been happening to the Blue Ribbon kids, which leads them to a mental hospital called Bishop Flats following a lead on the disc. They find out that mind control is being used to make depressed, awkward and unruly teens become perfect so they can function properly in life, but the programming has some glitches that lead to momentary relapses and violent fits. Also at Bishop Flats, they find Caldicott's daughter, Betty (Julie Patzwald), a failed project who appears to have been lobotomized by her father's experiment.\nAfter escaping from the hospital, Steve and Rachel return to Cradle Bay to plan to rescue Lindsay before fleeing town. They have a run-in with the town's police chief Cox (Steve Railsback) who is also involved in the conspiracy. He tries to arrest them for being out after curfew, but Dorian shows up under the pretense that he is disposing of dead rats, then knocks out the police chief and frees Steve and Rachel, telling them to leave town and go public with what they know. When Rachel and Steve return to Steve's home to get Lindsay, Steve's parents reveal that they have signed him up for the program. A group of Blue Ribbons ambush them and drag Steve and Rachel to the programming center. Steve grabs a scalpel before being strapped into a chair. Before the reprogramming can start, Steve uses the scalpel to cut his bonds and escape to rescue Rachel, killing the medical techs. On the way out, they fight and kill Chug, who has been left behind to guard them.\nExiting what turns out to be the town hospital's basement, Steve and Rachel are met by Lindsay and U.V. in Rachel's truck. Rushing to catch the early ferry, they meet with a roadblock made of Blue Ribbons and Caldicott on the road. When hope seems lost, Dorian drives up, striking Caldicott, and activating multiple E-Rat-icators that scramble the mind control tech inside the Blue Ribbons' heads. They chase after Dorian and try to destroy the E-Rat-icators. Dorian, having been fatally wounded by a gunshot from Caldicott, and believing the Blue Ribbons to be beyond help, drives his car off a cliff with most of the Blue Ribbons hanging onto it. A final battle ensues between Steve and Caldicott, which Steve wins by kicking Caldicott off the cliff. Steve and Rachel then leave town on the ferry with Lindsay and U.V. to begin a new life elsewhere without their parents.\nThe final scene shows a classroom in an urban high school with kids playing loud music, cursing, and acting up. They are informed that they have a new student teacher. The well-groomed teacher turns around after writing on the board and is revealed to be Gavin, with the Blue Ribbon \"red twinkle\" still active in his eye."}