{"mid": "DoctorSleep", "IMDB_id": "tt0286594", "title": "Doctor Sleep", "plot": "Following the events of The Shining, after receiving a settlement from the owners of the Overlook Hotel, Danny Torrance remains psychologically traumatized as his mother Wendy slowly recovers from her injuries. Angry ghosts from the Overlook still want to consume Danny to inherit his phenomenal \"shining\" power and eventually find him, including the woman from Room 217. Dick Hallorann, the Overlook's chef, teaches Danny to create lockboxes in his mind to contain the ghosts, including that of former Overlook owner Horace Derwent.\nAs an adult, Danny (now going by Dan) takes up his father's legacy of anger and alcoholism. Dan spends years drifting across the country, but eventually makes his way to New Hampshire and decides to give up drinking. He settles in the small town of Frazier, working first at a tourist attraction and then at a hospice, and attending Alcoholics Anonymous meetings. His psychic abilities, long suppressed by his drinking, re-emerge and allow him to provide comfort to dying patients. Aided by a cat who can sense when someone is about to die, Dan acquires the nickname Doctor Sleep.\nIn the meantime, Abra Stone, a baby girl born in 2001, begins to manifest psychic powers of her own when she seemingly predicts the September 11 terrorist attacks. She slowly and unintentionally establishes a telepathic bond with Dan; as she grows, the contact becomes more conscious and voluntary and her shining grows stronger than his. One night, Abra psychically witnesses the ritual torture and murder of a boy by the True Knot, a group of quasi-immortals (many of which possesses their own Shine abilities) who wander across America and periodically feed on steam, a psychic essence produced when the people who possess the shining die in pain. The True Knot's leader, Rose the Hat, becomes aware of Abra's existence and formulates a plan to kidnap Abra and keep her alive so she can produce a limitless supply of steam.\nThe True Knot begin to die off from measles contracted from their last victim; they believe that Abra's steam can cure them. Abra asks for Dan's help, and he reveals his connection with Abra to her father David and their family doctor, John Dalton. Angry and skeptical at first, David starts to believe Dan and agrees to go along with his plan to save Abra. With the help of Billy Freeman, one of Dan's friends, they foil and kill a raiding party sent by Rose, led by Rose's lover Crow Daddy; however, Dan realizes that Rose will relentlessly hunt Abra for revenge. He visits Abra's great-grandmother Concetta, who is dying of cancer, and telepathically learns from her that he and Abra's mother Lucy are half-siblings with the same father. As Concetta dies, Dan takes her diseased steam into himself. Meanwhile, dissention in the ranks of The True Knot, along with Rose's obsession with Abra, leads to the group splitting up, leaving Rose with even fewer followers.\nFollowing another kidnapping attempt that Abra foils with Dan's telepathic help, she baits Rose into confronting her at the location where the Overlook Hotel once stood in the Rocky Mountains in Colorado, now home to a campsite owned by the True Knot. Dan and Billy travel to the site, while Abra helps them by using her astral projection. Dan releases the steam collected from Concetta to the remaining group of True Knot members lying in wait, killing all of them. He frees the ghost of Horace Derwent to kill the last member, Silent Sarey, waiting to ambush him and Abra, and the two fight Rose in a long psychic struggle. With help from Billy and the ghost of Dan's father, Jack Torrance, they push Rose off an observation platform to her death. Before leaving the campsite, Dan makes peace with his father.\nIn the epilogue, Dan celebrates fifteen years of sobriety and attends Abra's fifteenth birthday party. He tells her about the patterns of alcoholism and violent behavior that run in his family, and warns her not to repeat them by starting to drink or submitting to rage. Abra agrees that she will behave, but before they can finish the conversation, Dan is called back to his hospice, where he comforts a dying colleague who had antagonized him in the past."}