{"mid": "DodgeCity", "IMDB_id": "tt0031235", "title": "Dodge City", "plot": "The action of the film starts with Colonel Dodge (Henry O'Neill) arriving on the first train and subsequently opening the new railroad line that links Dodge City with the rest of the world. A few years later, Dodge City has turned into the \"longhorn cattle center of the world and wide-open Babylon of the American frontier, packed with settlers, thieves and gunmen—the town that knew no ethics but cash and killing\". In particular, it is Jeff Surrett (Bruce Cabot) and his gang who kill, steal, cheat and, generally, control life in Dodge City without ever being brought to justice. Any new sheriff, sworn into office in Dodge, is quickly driven out of town by Surrett and his cronies.\nColonel Dodge's friend Wade Hatton (Errol Flynn), a lone Irish cowboy who was instrumental in bringing the railroad to Dodge City, is now on his way to the town leading a trek of settlers from the East coast. At Hatton's side are his old companions Rusty (Alan Hale) and Tex (Guinn 'Big Boy' Williams), who are prepared to stay with him through thick and thin. Among the settlers are beautiful Abbie Irving (Olivia de Havilland) and her irresponsible brother Lee (William Lundigan), who, drunk, causes a stampede (which eventually kills him) and is shot by Hatton in self-defense. When the group arrive in Dodge City, Hatton is confronted with the full extent of the anarchy which is dictating everyday life there. Asked by anxious citizens—Abbie's uncle, Dr. Irving (Henry Travers) among them—to be the new sheriff, Hatton politely declines, saying he is not cut out for this kind of job.\nHatton changes his mind when, during a school outing, a young boy, Harry Cole is inadvertently killed by Surrett and his men. The new sheriff and his deputies—Rusty and Tex among them of course—have a hard time not just fighting the criminals but also convincing all the farmers who have been wronged by Surrett that mob rule (\"Come on, boys, let's take 'em out to the plaza\") is out of the question. Regardless, all in all, Hatton was quite capable of his new job and was off to a good start cleaning up the town. Meanwhile, Hatton, Abbie and the likable newspaperman Joe Clemens (Frank McHugh) uncover evidence of Surrett's shady dealings enough to stand a chance in court. Before Joe could publish a story, one of Surrett's thugs, Yancey (Victor Jory) shoots the editor in the back. The only witness who can put Surrett behind bars now is Abbie whom Hatton, out of love for her, arranges to leave town for safety until further notice.\nWhen Yancey is in jail for Joe's killing, Hatton has to protect him against the furious men outside who, not caring for Yancey's right to a fair trial, want to take the law into their own hands and lynch him right then and there. Intending to ensure that Yancey deserves a fair trial, Hatton and Rusty were able to manage to smuggle him out of town in a hearse to the train station whereas a train (which Abbie happens to be on) for Wichita was just about to leave. However, Surrett and his gang were waiting and sneak board to try and spring Yancey. A gunfight then ensues and inadvertently causes a fire in the baggage car. Fearing for Hatton's life, Abbie rushes to the baggage car to warn him of the danger. Using her as a shield, Surrett orders Hatton and Rusty to release Yancey immediately. Afterwards, Surrett locks Hatton, Abbie and Rusty in the burning car. After the three manage to escape from the car, Hatton and Rusty kill Surrett and his gang who were trying to make a getaway.\nIn the end, Hatton succeeds in both overwhelming and catching the baddies and winning Abbie's heart. Everything has been prepared for a quiet family life in newly civilized Dodge City, but Hatton is asked by Colonel Dodge to clean up Virginia City, Nevada, another railroad town more dangerous than Dodge City had ever been. Understanding how much Hatton is needed to settle the West, a loving Abbie heartily suggests she and her new husband join the next wagon train for their new life together."}