{"mid": "DonaldInMathmagicLand", "IMDB_id": "tt0052751", "title": "Donald in Mathmagic Land", "plot": "=== Entrance ===\nDonald Duck, holding a hunting rifle, passes through a doorway to find that he has entered Mathmagic Land. This \"mighty strange\" fantasy land contains trees with square roots, a stream flowing with numbers, and a walking pencil that plays tic-tac-toe. A geometric bird recites (almost perfectly) the first 15 digits of pi. Donald soon hears the voice of the \"True Spirit of Adventure\" (Paul Frees), who will guide him on his journey through \"the wonderland of mathematics\".\n=== Pythagoras and music ===\nDonald is initially not interested in exploring Mathmagic Land, believing that math is for \"eggheads\". When \"Mr. Spirit\" suggests a connection between math and music, Donald is intrigued. First, Donald discovers the relationships between octaves and string length which develop the musical scale of today. Next, Donald finds himself in ancient Greece, where Pythagoras and his contemporaries are discovering these same relationships. Pythagoras (on the harp), a flute player, and a double bass player hold a \"jam session\" which Donald joins after a few moments using a vase as a bongo drum. Pythagoras' music is, as the Spirit explains, the basis of today's music, and that music would not exist without \"eggheads\". The segment ends with a sequence of live action musicians playing both jazz and classical music and Pythagoras' pals fading away.\n=== Pentagram, golden section, and golden rectangle ===\nAfter shaking hands with Pythagoras, who then vanishes, Donald finds on his hand a pentagram, the symbol of the secret Pythagorean society. The Spirit then shows Donald how the mysterious golden section appears in the pentagram. Next, the pentagram is shown to contain the pattern for constructing golden rectangles many times over. According to the Spirit, the golden rectangle has influenced both ancient and modern cultures in many ways. Many have speculated that the pentagram used by the Pythagoreanism society is allegory to the secret society commonly known as the Illuminati while the pentagram has been compared to either an Eye of Providence or a satanic symbol, this symbol has questioned Disney's motives in child programs.\n=== Architecture and art ===\nDonald learns how the golden rectangle appears in many ancient buildings, such as the Parthenon and the Notre Dame cathedral. Paintings such as the Mona Lisa and various sculptures such as the Venus de Milo contain several golden rectangles. The use of the golden rectangle is found in modern architecture, such as the United Nations building in New York City. Modern painters have also rediscovered the magic of the golden rectangles.\n=== Human body and nature ===\nThe Spirit shows Donald how the golden rectangle and pentagram are related to the human body and nature, respectively. The human body contains the \"ideal proportions\" of the golden section; Donald, overinterpreting the Spirit's advice, tries to make his own body fit such a proportion, but his efforts are to no avail; he ends up \"all pent up in a pentagon\". The pentagram and pentagon are then shown to be found in many flowers and animals, such as the petunia, the star jasmine, the starfish, the waxflower, and with the help of the inside of a nautilus shell, the Spirit explains that the magic proportions of the golden section are often found in the spirals of nature's designs, quoting Pythagoras: \"Everything is arranged according to number and mathematical shape\".\n=== Games ===\nDonald learns that mathematics applies not only to nature, architecture, and music, but also to games that are played on geometrical surfaces, including chess, baseball, football, basketball, hopscotch, and three-cushion billiards. Donald even volunteers the game Tiddlywinks, but the Spirit does not pursue this option. Themes of Lewis Carroll's Through the Looking-Glass are scattered throughout the chess scene; Carroll himself was both a writer and a mathematician. The extended billiards scene, which features a non-speaking live actor, shows the calculations involved in the game's \"diamond system\", and Donald finally learns how to do the calculations, spectacularly hitting ten cushions in a single shot.\n=== Mental exercises ===\nThe Spirit then asks Donald to play a mental game, but he finds Donald's mind to be too cluttered with \"Antiquated Ideas\", \"Bungling\", \"False Concepts\", \"Superstitions\", and \"Confusion\". After some mental house-cleaning, Donald plays with a circle and a triangle in his mind, he spins them to make them respectively into a sphere and a cone, and then he discovers useful inventions such as the wheel, train, magnifying glass, drill, spring, propeller, and telescope.\n=== Infinity and the future ===\nDonald discovers that pentagrams can be drawn inside each other indefinitely. Therefore, numbers provide an avenue to consider the infinite. The Spirit states that scientific knowledge and technological advances are unlimited, and the key to unlocking the doors of the future is mathematics. By the end of the film, Donald understands and appreciates the value of mathematics. The film closes with a quote from Galileo: \"Mathematics is the alphabet with which God has written the universe\"."}