{"mid": "DontLookUnderTheBed", "IMDB_id": "tt0208101", "title": "Don't Look Under the Bed", "plot": "Frances McCausland (Erin Chambers), an intelligent and level-headed girl, is starting high school a year early. Strange things have been going on in her town of Middleberg: dogs appearing on people's roofs, alarm clocks going off hours early, eggs all over a teacher's car, gelatin in the school swimming pool, and B's spray-painted all over town. The B's also appear on the school lockers—except for Frances', which has a B on the inside. These pranks seem to point to Frances, who does not understand what is happening or why. An older boy named Larry Houdini (Eric \"Ty\" Hodges II) offers to help Frances, telling her that he is an imaginary friend, which is proven true as children are the only other people who can see him. Larry tells Frances that she is being framed by the Boogeyman. Frances has a difficult time believing this, because she has tried to look at the world like an adult, using logic and facts to explain everything, since her little brother, Darwin, almost died from leukemia a few years before.\nThe Boogeyman causes a blackout, foreshadowed by the B's he spray-painted; however, the McCausland home is unaffected, with all its Christmas lights remaining on. Frances then loses her friendship with her best friend Joanne, makes a fool out of herself trying to convince others that Larry exists, and causes her family to question her sanity. At her wits end, Frances checks out \"The Boogey Book\" from the library for Larry, who decides to build a tetra-fuse detailed in the book which will age the Boogeyman into a harmless old geezer. Frances later learns Larry was Darwin's imaginary friend, who still cares about him, but Frances convinced Darwin to grow up and stop believing in him. Larry also cooks up Boogey Goo to use as bait and finds it delicious, which scares Frances. She looks for Boogeyman origins in the book, learning that a Boogeyman is created when the creator of an imaginary friend stops believing too soon.\nHaving accidentally stepped in Boogey Goo, Darwin attracts the Boogeyman and gets kidnapped while sitting in Frances' room. Frances and Larry follow him to the Boogeyworld dimension, which exists underneath Frances' bed. During the skirmish, Larry turns into a Boogeyman due to Darwin's lack of belief in him, while the other Boogeyman drags Darwin towards a cliff. However, Frances convinces Darwin to believe in Larry again, reverting him to normal. After using the tetra-fuse on the Boogeyman, Frances realizes it is her old imaginary friend, Zoe. Frances stopped believing in her when Darwin fell ill, deciding it was time to grow up. Frances proves she still cares about Zoe, holding her hand and causing her to revert to normal. Frances and Darwin return to the real world, where her parents reveal the same antics that occurred in Middleburg are occurring in another city. Larry reveals that \"the guy in his head\" just ordered him to go take care of the other Boogeyman; Zoe offers to assist as she was rather inexperienced as a Boogeyman and was thus easy to fight.\nFrances is distraught as it was not easy for her to believe in them again. Before Larry and Zoe leave, Larry kisses Frances as a way of showing her that childhood was great, but so is adulthood if she keeps a sense of wonder. He then turns on the Christmas lights outside, allowing him and Zoe to leave. That night, Darwin is scared and is sent to Frances by Larry; she allows him to sleep with her. Larry and Zoe watch this with smiles."}