{"mid": "DontGoInTheHouse", "IMDB_id": "tt0080646", "title": "Don't Go in the House", "plot": "Donald \"Donny\" Kohler is obsessed with fire and human combustion, an obsession that stems from the severe abuse he suffered at the hands of his mother, who would hold his bare arms over a gas stove in an effort to \"burn the evil out of him\". When his mother dies, he sets out to avenge himself on every woman who bears a resemblance to her with the aid of steel chains, a flamethrower, and a steel-paneled bedroom crematorium.\nDonny's first victim is florist Kathy Jordan (Johanna Brushay). Befriending the harmless-looking man, Kathy escorts Donny back to his mother's house, where he knocks her unconscious, strips her naked, and chains her arms and legs to the ceiling and floor of the steel room. Ignoring Kathy's screaming pleas for mercy, he burns her to death with his flamethrower. Over the next few days, Donny murders two other women by immolating them. Donny also burns his mother's corpse, and dresses it up in her bedroom along with the other three dead women.\nDuring his killing spree, Donny hears voices in his mind which call him \"the master of the flame\" and urge him to punish \"evil\". Donny's only friend is Bobby Tuttle (Robert Osth) a co-worker who phones the house one day asking why Donny has been absent from work for nearly a week. Donny lies and claims that his mother is sick and needs attention. When Donny attempts to pick up another victim, he cannot go through with it, and begins to feel remorse for his actions. Donny goes to a church, where he tells Father Gerritty (Ralph D. Bowman) about the abuse his mother inflicted upon him, and about his urges to kill. Father Gerritty persuades Donny to try to move on with his life, and put the past to rest.\nIn an attempt to stop killing, Donny decides to accept an invitation by Bobby to accompany him on a double-date to a disco club, despite Donny's lack of social skills. After traveling to a men's clothing store and purchasing a new outfit, Donny shows up at the disco as expected, but is shy and awkward with his date. When the woman attempts to take Donny to the dance floor and inadvertently holds his arm over a table's lighted candle, the memories of the childhood abuse come back, and Donny sets her hair on fire.\nFleeing from the disco, Donny runs into two drunken girls on the street, and he invites them back to his house. Bobby attempts to find Donny, and runs into Father Gerritty on his way to Donny's house. When no one answers the front door, Bobby and Father Gerrity break it down and rescue the two women. Donny dons his incinerator outfit and sets Father Gerrity ablaze with his flamethrower, but Bobby manages to smother the flames and rescue the priest.\nDonny takes refuge inside his mother's bedroom with the burned corpses. The voices in his head express their disappointment with him. Donny hallucinates the charred corpses coming to life. He tries to fight them with the flamethrower but sets the house on fire. He dies in the fire.\nThe final scene portrays a young boy being beaten by his mother. The boy hears the same whispering voices that Donny did, and they tell him that they are here to \"help\" him."}