{"mid": "DoraTheExplorer", "IMDB_id": "tt0235917", "title": "Dora the Explorer", "plot": "The series centers around Dora, a 7 (Later 8) year old American girl of Indigenous Mexican heritage, with a love of embarking on quests related to an activity that she wants to partake of or a place that she wants to go to, accompanied by her talking purple backpack and anthropomorphic monkey companion named Boots (named for his beloved pair of red boots). Each episode is based around a series of cyclical events that occur along the way during Dora's travels, along with obstacles that she and Boots are forced to overcome or puzzles that they have to solve (with \"assistance\" from the viewing audience) relating to riddles, the Spanish language, or counting. Common rituals may involve Dora's encounters with Swiper, a bipedal, anthropomorphic masked thieving fox whose theft of the possessions of others must be prevented through fourth wall-breaking interaction with the viewer. To stop Swiper, Dora must say \"Swiper no swiping\" three times. However, on occasions where Swiper steals the belongings of other people, the viewer is presented with the challenge of helping Boots and Dora locate the stolen items. Another obstacle involves encounters with another one of the program's antagonists; the \"Grumpy Old Troll\" dwelling beneath a bridge that Dora and Boots must cross, who challenges them with a riddle before permitting them the past that needs to be solved with the viewer's help. Known for the constant breaking of the fourth-wall depicted in every episode, the audience is usually presented to two primary landmarks that must be passed before Dora can reach her destination, normally being challenged with games or puzzles along the way. The episode always ends with Dora successfully reaching the locale, singing the \"We Did It!\" song with Boots in triumph.\nOn numerous occasions, television specials have been aired for the series in which the usual events of regular episodes are altered, threatened, or replaced. Usually said specials will present Dora with a bigger, more whimsical adventure than usual or with a magical task that must be fulfilled, or perhaps even offer a series of different adventures for Boots and Dora to travel through. They might be presented with an unusual, difficult task (such as assisting Swiper in his attempts to be erased from Santa Claus's Naughty List) that normally is not featured in average episodes, or challenge Dora with a goal that must be achieved (such as the emancipation of a trapped mermaid). Sometimes, the specials have involved the debut of new characters, such as the birth of Dora's superpowered twin baby siblings and the introduction of the enchanted anthropomorphic stars that accompany Dora on many of her quests."}