{"mid": "DoTheRightThing", "IMDB_id": "tt0097216", "title": "Do the Right Thing", "plot": "Mookie (Spike Lee) is a 25-year-old delivery man living in Bedford-Stuyvesant, Brooklyn with his sister, Jade (Joie Lee). He and his girlfriend, Tina (Rosie Perez), have a son. He works at the local pizzeria, but lacks ambition. Sal (Danny Aiello), the pizzeria's Italian-American owner, has been in the neighborhood for 25 years. His older son Pino (John Turturro) intensely dislikes blacks, and does not get along with Mookie. Pino is at odds with his younger brother Vito (Richard Edson), who is friendly with Mookie.\nThe neighborhood is full of distinct personalities, including Da Mayor (Ossie Davis), a friendly local drunk; Mother Sister (Ruby Dee), who watches the neighborhood from her brownstone; Radio Raheem (Bill Nunn), who blasts Public Enemy on his boombox wherever he goes; and Smiley (Roger Guenveur Smith), a mentally disabled man, who meanders around the neighborhood trying to sell hand-colored pictures of Malcolm X and Martin Luther King, Jr.\nWhile at Sal's, Mookie's trouble-making b-boyish friend, Buggin' Out (Giancarlo Esposito), questions Sal about his \"Wall of Fame\", a wall decorated with photos of famous Italian-Americans. Buggin' Out demands that Sal put up pictures of black celebrities since Sal's pizzeria is in a black neighborhood. Sal replies that it is his business, and that he can have whomever he wants on \"The Wall of Fame\". Buggin' Out attempts to start a protest over the Wall of Fame. Only Radio Raheem and Smiley support him.\nDuring the day, the heat and tensions begin to rise. The local teenagers open a fire hydrant and douse the street, before police officers intervene. Mookie and Pino begin arguing over race, which leads to a series of scenes in which the characters spew racial insults into the camera. Pino and Sal talk about the neighborhood, with Pino expressing his hatred, and Sal insisting that he is not leaving. Sal almost fires Mookie, but Jade intervenes, before Mookie confronts her for being too close to Sal.\nThat night, Buggin' Out, Radio Raheem, and Smiley march into Sal's and demand that Sal change the Wall of Fame. Raheem's boombox is blaring and Sal demands that they turn the radio off, but they refuse. Buggin' Out calls Sal and sons guineas while saying that they're closing down the pizzeria for good until they change the Wall of Fame. Sal, in a fit of frustration, tells him he will \"tear his nigger ass,\" then destroys the boombox with a baseball bat. Raheem attacks Sal, leading to a huge violent fight that spills out into the street, attracting a crowd. While Radio Raheem is choking Sal, the police arrive. They break up the fight and apprehend Radio Raheem and Buggin' Out. Despite the pleas of his fellow officers and the onlookers, one officer refuses to release his chokehold on Raheem, killing him. Realizing that Raheem has been killed in front of onlookers, the officers place his body in the back of a squad car, and drive off, leaving Sal, Pino, and Vito unprotected.\nThe onlookers, enraged about Radio Raheem's death, blame Sal and his sons. Mookie grabs a trash can and throws it through the window of Sal's pizzeria, sparking the crowd to rush into the restaurant and destroy it, with Smiley finally setting it on fire. Da Mayor pulls Sal, Pino, and Vito out of the mob's way. Firemen and riot patrols arrive to put out the fire and disperse the crowd. After police issue a warning, the firefighters turn their hoses on the rioters, leading to more fighting and arrests. Mookie and Jade sit on the curb, watching in disbelief. Smiley wanders back into the smoldering building and hangs one of his pictures on what is left of Sal's Wall of Fame.\nThe next day, after having an argument with Tina, Mookie returns to Sal, who feels that Mookie betrayed him. Mookie demands his weekly pay, leading to an argument. They cautiously reconcile, and Sal finally pays him. Mister Señor Love Daddy (Samuel L. Jackson), a local DJ, dedicates a song to Raheem.\nThe film ends with two quotations expressing different views about violence, one from Martin Luther King and one from Malcolm X, before fading to a photograph of them shaking hands."}