{"mid": "DoubleJeopardy", "IMDB_id": "tt0150377", "title": "Double Jeopardy", "plot": "Libby Parsons seems to have it all. Her husband, Nick, is devoted to her and their four-year-old son Matty. The family live in a beautiful home on the Pacific Northwest waterfront. When Nick scores yet another business triumph, he buys a yacht to celebrate. Leaving Matty with their friend Angie, who is a teacher at Matty's preschool, the couple set sail for a romantic weekend. But Libby drinks too much wine and passes out. When she wakes, she is covered in blood and Nick is gone. Dizzy and disoriented, she follows a trail of blood to the upper deck. Nick is not there but Libby sees a knife and picks it up. The lights of a Coast Guard boat flash and a voice orders Libby to drop the knife. A mayday was received from the Parsons' yacht. Libby is taken into custody but Nick has seemingly vanished. Tests reveal that the blood found on the yacht was the same type as Nick's. It is presumed that the couple had an argument and Libby attacked Nick. He managed to send a mayday alert before falling or being pushed overboard.Despite the fact that no body is found, Libby is charged with murder. No one believes her story, not even the sheriff who is a family friend. Frantic over what will happen to Matty if she is found guilty, Libby signs over custody to Angie. Nick had a large life insurance policy -- which police believe was the motive for his murder -- and Libby has the money put in Matty's name.The trial is swift and a jury finds Libby guilty. She is taken to a women's prison several hours away. At first Angie regularly brings Matty to visit. When they stop coming, Libby telephones Angie but the number is disconnected. She is inconsolable until a fellow prisoner tells her to use her brain. It is not that easy to disappear and Angie must have left a forwarding address with someone. Libby calls the preschool pretending to be Angie and says she hasn't received her final paycheck. She asks to confirm the forwarding address and phone number, and surprisingly the secretary provides the information. Angie and Matty are in San Francisco.Angie answers the phone and Libby angrily confronts her. Obviously startled that Libby has managed to track her down, Angie stammers that she was intending to bring Matty for a visit. Libby spends a few minutes talking to her son. Suddenly Nick, alive and well, enters the room. Matty shouts \"Daddy!\" while Angie tries to shush him. Nick yanks the phone away and hangs up, but Libby hears enough to realize what has happened. Nick and Angie were having an affair and he staged his own murder so he could disappear, setting Libby up to take the blame.Libby contacts her lawyer, the sheriff, and the insurance company but no one believes her. The San Francisco phone number is at first endlessly busy and then no longer in service. There is nothing else Libby can do and she resigns herself to never seeing her son again.A fellow prisoner, who was once a lawyer, comes to her aid. Libby cannot be tried twice for the same crime. It is called double jeopardy. Once she is paroled, Libby can track Nick down, kill him, and get away with it. Libby's hatred of Nick fuels her and she begins exercising to strengthen her body. After a few years, she is eligible for parole. Her friend warns her that in order to be released, she must admit to killing Nick and show great remorse to the parole board. It works and Libby is sent to a halfway house for three years.Upon arrival, she is apprised of the rules by the home's director, an embittered man named Travis. Curfew, finding employment, not associating with criminals, no drugs or alcohol. Any violation of these rules and she will be returned to prison to serve out her sentence. But Libby's only goal is to find Nick and she has no intention of waiting three years.Instead of looking for a job, she goes to the preschool that once employed Angie. While on the ferry she catches a glimpse of her former home. The school's director is sympathetic but refuses to tell her where Angie is now living. She reminds Libby that Matty has been with Angie for several years now and there is no need to disrupt his life. That night, Libby returns to the preschool and breaks in, triggering a silent alarm. The police arrive as she locates Angie's file and writes down her current address, which is in Texas. She runs down the beach but is caught and taken to the local jail. Travis arrives the next morning to escort her back to prison. He is disgusted that she deliberately violated parole. The scrap of paper with Angie's address is in his possession.He drives them onto the ferry and handcuffs Libby's wrist to the outside door handle. When he goes topside for a cup of coffee, to which he adds whiskey from a flask, Libby seizes her chance. Travis left the keys in the car and Libby manages to start it. Then she inches it back and forth, trying to smash the handcuffs against a post. The car in front of her is bumped and rolls into the ocean. Travis realizes what is going on and races to the lower level. Libby manages to lock the door. With Travis hanging on, the car goes overboard.An alarm is sounded and life preservers are tossed. Underwater, Travis unlocks Libby's handcuffs and she grabs his gun. He tries to retrieve it and she hits him on the head before swimming away. His wound requires stitches. When he tells his boss what happened, he is reprimanded for letting a prisoner escape with his gun. A blood sample is taken which Travis knows will reveal that he was drinking. Having the address to where Libby is likely headed, he sets off after her.Libby hitches rides until she arrives at her mother's farm. After borrowing money, she purchases an old green truck and drives to Texas. She has no trouble finding Nick's address but he and Angie are not there. Another family owns the house. As a despondent Libby turns to leave, an old lady working in the yard next door tells her what happened to Nick and Angie, who she knew by different names. Several years earlier there was a gas explosion in the kitchen and Angie was killed. Nick and Matty -- who was obviously allowed to keep his real name -- moved away but the old lady doesn't know where.Libby goes to the public library and finds a newspaper account of the fire on microfiche. Apparently it was accidental, although Libby thinks that Nick murdered Angie because she was a threat. In the newspaper picture of Angie taken at her home, Libby sees a Kandinsky painting in the background. Nick had a collection of these rare paintings and that might be a way to trace him. She drives to an art gallery and poses as a Kandinsky collector. The employee looks on the internet and finds a painting recently sold by a Jonathan Devereaux of New Orleans. Libby feels sure this is really Nick. Then Travis enters the gallery. He was given a description of her truck by the elderly neighbor. While the employee excuses himself and goes to see what Travis wants, Libby finds Jonathan's address. She tries to close out the website but Travis is heading in her direction. She runs out the back door and escapes, smashing into Travis's car that he used to block her vehicle. He gives chase on foot, but she eludes him. Later, she ditches the truck and gets on a plane to New Orleans. She doesn't know that the website at the gallery did not close out and Travis knows where she is headed.Jonathan Devereaux is a well-respected hotel owner in New Orleans. Libby inquires for him at the desk but he is not there. When she asks about Matty, the receptionist becomes wary and refuses to provide any information. Overhearing an elderly guest give her name, Libby uses it to purchase a designer evening gown from the hotel shop. She intends to be at the Bachelor's Auction that night to confront Jonathan.Travis arrives in New Orleans and checks in with the local police. They aren't much interested but agree to issue a be-on-the-lookout alert for Libby, complete with photo. Since it is Mardi Gras, the crowds are heavy and finding her won't be easy.Libby attends the auction and bids on Jonathan. He is startled to hear her voice but cannot find her in the crowd. Another woman bids on him too but Libby wins. She walks up to her husband and calls him Nick. He is eager to find out what she wants before she exposes him. When she asks why he did all that to her, he said he had been on the verge of bankruptcy and thought if he faked his death, the life insurance money would take care of her and Matty. He never dreamed she would be found guilty and swore the affair with Angie had started later on. Libby asks if he murdered Angie to keep her quiet and he denies it. Libby agrees to leave him alone if he will give her Matty. Jonathan says he is away at school. Libby says she will call the next day and he had better have the boy there. Just then two of Jonathan's friends come up and ask who Libby is. She says she is Jonathan's wife and is in town to pick up their son. They are visibly startled to hear that the city's most eligible bachelor is really married.Later that evening, Travis arrives at the hotel. Jonathan swears he has no idea who this crazy woman is, pretending to be his wife. Travis warns him that she has a gun. Secretly he is not impressed with Jonathan and wonders if Libby's story could possibly be true.Now in jeans and a tee-shirt, Libby is recognized by the owner of the diner where she is eating. He warns her to watch out for the police, who frequently patrol that area. Since it is pouring rain, he loans her an umbrella. Libby disappears into the crowds but not fast enough. Travis, who is riding in a patrol car, spots her. He gives chase and grabs the wrong woman. Once again Libby escapes.The next day, Libby orders Jonathan to bring Matty to a nearby cemetery. It is a public place in case Jonathan tries anything. A funeral is taking place when they meet. Libby asks where Matty is and Jonathan points to a young boy some distance off. He says Matty is shy about seeing her again. Libby starts toward the boy and he runs away. She calls his name and chases him. Suddenly Jonathan steps out from behind a mausoleum and hits Libby on the head. He drags her into the mausoleum and puts her inside a coffin. The boy is waiting outside and Jonathan hands him some money. Obviously he is not Matty. Satisfied that his wife will trouble him no longer, Jonathan returns to his hotel.Travis pays him another visit and once again Jonathan insists that he knows nothing about a woman named Libby Parsons. Although he is now very suspicious, Travis has no choice but to leave.Libby awakes inside the coffin and screams when she sees a mummified body lying next to her. But there is no one to hear. The funeral is over and the cemetery is deserted. She remembers the gun and shoots the lock. By pushing on the lid with her feet, she manages to free herself. But she is still locked inside the mausoleum. She escapes by throwing a vase of dead flowers through the stained glass window. On her way back to the hotel, she comes face to face with Travis. Realizing that she can't get away this time, she bursts into tears and he embraces her.Jonathan is less than welcoming when Travis returns to his office. But the game is up. Travis asked the Department of Motor Vehicles in the state of Washington to fax him copies of all drivers' licenses issued to a Nicholas Parsons. The third one was a picture of the man now known as Jonathan Devereaux. Jonathan tries to bluff and says it isn't a crime to change one's name. But there is the matter of insurance fraud. Travis pretends to call the police, then reconsiders and asks for one million dollars to keep quiet. Jonathan doesn't have that kind of money on hand but offers Travis several hundred thousand in cash. Suddenly Libby bursts into the room, gun drawn. Jonathan reminds her that Louisiana is a death penalty state. Libby is happy to fill him in on what double jeopardy means. But all she wants is Matty. Jonathan says he is at St. Alban's school in Georgia. Then Jonathan draws his own gun. A brief scuffle ensures. Travis is wounded but Jonathan/Nick is killed by Libby.As Travis is treated by paramedics, the police chief says that Mrs. Parsons has inherited herself a hotel. Libby doesn't want it and prepares to take off. But Travis stops her. She is still wanted by the police and must return to prison. But he will testify on her behalf. Since he had secretly recorded the conversation with Jonathan on his cell phone, which positively identified Jonathan as Nick Parsons, the charges against Libby are dropped.Some days later, Libby and Travis drive to St. Alban's school. Travis was fired from his job at the halfway house because of drinking while escorting a prisoner. It is unclear if he and Libby are romantically involved. Matty is waiting for her and they are at last reunited. His father and Angie had told him his mother was dead."}