{"mid": "DownPeriscope", "IMDB_id": "tt0116130", "title": "Down Periscope", "plot": "Lt. Commander Thomas Dodge (Kelsey Grammer) is about to be passed over a third time for his own nuclear submarine. The reasons given are (1) his unorthodox command methods, (2) an unfortunate \"brushing\" incident with a Russian submarine, and (3) after the incident, the rumor of a genital tattoo (\"Welcome Aboard!\") received after getting blind drunk while on shore leave. Failure to secure a submarine will result in Dodge being dropped from the navy's command program, and that means he will resign his commission.\nDuring his career, Tom Dodge has made an enemy of Rear Admiral Yancy Graham (Bruce Dern), who strongly speaks out against Dodge's promotion. Vice-Admiral Dean Winslow, ComSubLant (Rip Torn), on the other hand, likes Dodge and his unorthodox methods. A war game is planned to test the navy's defenses against possible attack from older Soviet diesel-powered submarines in the hands of America's enemies. Among the defenses being tested is Dodge's prior billet, the Los Angeles-class submarine USS Orlando. Dodge is selected to put the World War II-era Balao-class diesel sub USS Stingray (SS-161) back in commission as the war game's Opposing Force. Winslow tells him to \"think like a pirate,\" promising Dodge that if he can sink a target ship placed in Norfolk Harbor, Dodge will be considered for a permanent command.\nMotivated by his dislike for Dodge and his own ambition for promotion, Graham handpicks a \"crew from hell\" for Stingray: hot-tempered, uptight Lt. Martin Pascal (Rob Schneider) as the Executive Officer; crusty Chief Engineer Howard (Harry Dean Stanton), a civilian contractor familiar with the obsolete Balao-class's diesel-electric engine system; rebellious Engineman 1st Class Brad Stepanek (Bradford Tatum); sharp-eared Sonarman 2nd Class E.T. \"Sonar\" Lovacelli (Harland Williams); compulsive gambler Seaman Stanley \"Spots\" Sylvesterson (Jonathan Penner); former college basketball player Seaman Jefferson \"R.J.\" Jackson (Duane Martin), who has dreams of playing in the NBA; shock-prone (and shock-addled) Electrician's Mate Nitro (Toby Huss); and not-so-Culinary Specialist Second Class Buckman (Ken Hudson Campbell) as Stingray's cook. Graham also uses Stingray as a Navy pilot program to evaluate women serving on submarines, knowing the cramped diesel boat is unsuitable for mixed-gender living, and Surface Warfare Officer Lt. Emily Lake (Lauren Holly) joins the crew as Diving Officer.\nUsing unorthodox tactics and a major storm to offset their huge technological disadvantage, Dodge and his crew achieve their first objective by sneaking in to Charleston Harbor and setting off signal flares. Now desperate to defeat Dodge, Graham cuts the war game containment area in half without Winslow's authorization. Failing in their first attempt at Norfolk Harbor, Dodge leaves the reduced containment area and heads out to sea. Irate at this lapse in protocol, the always strident and by-the-book Pascal (for whom the crew has no respect) attempts to take command of the Stingray; the crew does not supports his action. Dodge then charges Pascal with mutiny and, in mock-pirate fashion (and to the delight of the crew), forces his blindfolded XO to \"walk the plank\" into the raised fishing net of a waiting trawler that will take him ashore.\nDuring Stingray's second attempt at Norfolk, Graham assumes personal control of Orlando. Dodge employs an incredibly dangerous maneuver to sneak past the ships and aircraft protecting Norfolk. Orlando is eventually able to locate and chase her down. Before the Orlando's shooting solution is obtained, Dodge is able to fire two live torpedoes at long range into the anchored target ship at Norfolk, winning the war game for Stingray.\nUpon his return to port, Admiral Winslow chastises Graham and denies his promotion. He welcomes Dodge back and informs him that he will not get his own Los Angeles-class submarine, as the two had previously discussed, but a new Seawolf-class submarine (the US Navy's most advanced attack submarines), plus a proper crew to man her. Dodge respectfully requests that his entire Stingray crew be transferred with him to his new command, and then dismisses his crew to begin a well-earned shore leave. As Dodge and Lake leave the dock, she poses a query to him now that they better know each other, \"What exactly is this 'tattoo' I keep hearing about?\"."}