{"mid": "DraculaIIAscension", "IMDB_id": "tt0336325", "title": "Dracula II: Ascension", "plot": "NOTE: Sequel to Dracula 2000. It is not crucial, but it helps to have first seen Dracula 2000, if\nonly to know Dracula's lineage and how he was left burned and hanging from a lighted crucifix.Father Uffizi [Jason Scott Lee] hunts vampires. He travels the world to behead them\nwith his bullwhip, but his ultimate goal is to find the first vampire, Dracula (revealed as Judas Iscariot in Dracula 2000), absolve Dracula's\nsins against Jesus, set his soul free, and end his unholy existence.\nSo, when Dracula's charred body turns up in the New Orleans morgue,\nUffizi heads there. Medical students, Liz Blaine [Diane Neal] and Luke [Jason London] are charged with\nautopsying the body. When they open the abdominal cavity, they find that\nthe liver and other organs are white, suggesting to Luke that the person\ndid not produce his own blood but got it elsewhere, i.e., a vampire. Not\nbelieving, Liz searches the mouth for fangs, which suddenly erupt and stab\nher finger. Then comes a phone call offering them $30 million for the\nbody. They decide to switch the vampire with another burn victim, keep the\n$30 million, and hide the vampire's body in order to study it. Liz and\nLuke, accompanied by two other med students, Kenny [Khary Payton] and Tanya [Brande Roderick], transport\nthe vampire's body to the abandoned home of Professor Lowell [Craig Sheffer], who\nis also Liz's lover and who is confined to a wheelchair because of\ncerebral palsy.They're not quite sure how they're going to research this vampire,\nbut the first thing on the agenda is to immerse him in 350 pints of blood\nto allow his body to heal. After two hours without a ripple, they decide\nto fish out the body to see if anything is happening. Just then, the\nvampire [Stephen Billington] sits up, busts his way out of the tub, and kills Tanya in the\nprocess. As Luke prepares to stake the very angry vampire, Eric [John Light] enters\nwith a 'sungun' and subdues the vampire. Eric introduces himself as \"the\nmoney.\" After the vampire is secured and Tanya is buried, they move the\nvampire to an abandoned gym where a testing room has been set up with\nultraviolet lights and a table to which the vampire can be secured with\nchains coated in liquid silver. The plan is to find the vampire's essence\nand make from it a vaccine that can be used to cure diseased cells.The first experiment involves placing a drop of human blood on a\nsample of skin taken from the vampire. The skin quickly grows \"like a\ncancer but without the chaos.\" Next, a syringeful of blood is drawn from\nthe vampire's neck, and a drop of the vampire's blood is placed on a\ntissue sample from Lowell's wasted muscle. The vampire blood cells\nimmediately begin killing off the human cells. \"If it's replacing the\ncells that it has killed, when do you stop being you?\" Liz wonders. Luke squirts\nthe changing tissue with holy water, and it immediately begins to sizzle\nas though acid had been poured on it. Now, \"the trick is to separate the\ndiseased vector--the evil, if you will--from the cure,\" says Lowell.But Kenny can't wait. He injects the remainder of the vampire's blood\ninto himself. Of course, he turns into a vampire. Eric, Liz, and Luke go\nlooking for him. In their absence, the vampire mesmerizes Lowell into\ndriving his wheelchair off a ledge. When Liz and Luke return, they find\nLowell badly injured. Meanwhile, Liz has been noticing that her vampire\nbite is infected and that the infection is spreading throughout her body.\nYet, she is still committed to the research because of her love for\nLowell. Finding a cure for him is of tantamount importance. Liz reveals to\nLuke the extent of her infection and pleads with him to help.But the vampire's blood supply has been depleted. Liz decides to\ntransfuse some of her own blood into the vampire so that she can get more\nblood from him. She injects this blood into Lowell, who immediately begins\nto heal. Lowell then laughs at Liz and tells her that he was only using\nher, along with four others, to find a vampire. He says that he never\nloved Liz and that he is \"the money\" behind the whole project. In a fit of\n\"jilted bitch,\" Liz tosses holy water on him.To protect themselves, Luke has sprinkled seeds around the vampire\nand placed a knotted net on his chest. In the melee that ensues, Lowell\nbecomes a vampire and Dracula breaks free from his bindings. First,\nDracula bites off Eric's face. Then he turns on Luke and Liz. Luke reminds him that he must untie all the knots, but\nDracula tosses down a knotfree net. [Already done!] Luke reminds him that\nhe must count all the seeds, and Dracula replies, \"47,812.\" Luke tosses a\nbucket of seeds at him and challenges, \"Count these!\" Before the seeds\neven hit the ground, Dracula says, \"737,818.\" When one more seed falls\nfrom the basket, Dracula amends his count to \"...19.\"Fortunately, Father Uffizi has managed to destroy Tanya, Kenny, and\nall the other vampires left in the wake. He now catches up with Dracula.\nLiz is turning, too. Uffizi tells Luke to take her out into the sun, but\nLiz is too far gone. In an attempt to kill Dracula, Uffizi smashes all the\nwindows to let in the sunlight. He wraps his whip around Dracula's neck\nand is just about to behead him when Dracula forces upon him a vision of\nChrist, blinding Uffizi for a moment. In that moment, Liz shoots Uffizi.\nAs Dracula escapes with Liz, Uffizi promises, \"I'll find you.\" Dracula replies, \"I'm counting on it.\" [Original synopsis by bj_kuehl]"}