{"mid": "DraculaIIILegacy", "IMDB_id": "tt0303929", "title": "Dracula III: Legacy", "plot": "NOTE: Sequel to Dracula II: Ascensiion (2003). Dracula III: Legacy can be viewed alone, without having seen I & II, but it helps to know the history of how Uffizi, Luke, and Elizabeth got involved with the hunt for Dracula, to know that Uffizi was \"tainted\" at the end of Dracula II, and to know what Dracula is referring to when he says stuff like Luke made him suffer at the hands of the experimenters.It is five years after the events of \"Dracula II\". Dracula [Rutger Hauer] has\nreturned to Romania, taking Liz Blaine [Diane Neal] with him. Father Uffizi [Jason Scott Lee]\nwishes to pursue, but the church has withdrawn its support. They are\nworried that he has become \"tainted\" following his last encounter with\nDracula, and they want Uffizi to get out of the vampire business and take\na position as pastor at a church of his choice. Uffizi's choice is to hand\nin his collar and pursue Dracula on his own. Armed with his weapons of\nchoice -- a scythe and a bullwhip -- Uffizi heads for Bucharest, Luke [Jason London] in\ntow. Uffizi hopes to destroy and absolve Dracula; Luke hopes to find and\nrescue Liz, with whom he is in love.Romania is in the throes of a civil war. TV news reporter Julia Hughes\n[Alexandra Westcourt] announces that the list of demands submitted to the Geneva Council\nby the rebels includes the curious requirement that all present and\nprospective government officials make at least one public appearance\nduring the daylight. Because of the war, no one may pass outside Bucharest\nwithout military approval. While Uffizi and Luke wait at a checkpoint to\nobtain permission, a jeep drives up bearing two French soldiers and a\nbloody body. The driver says that they were attacked 51 kilometers outside\nthe city, not by rebels but by people with big teeth.Finally out of the city, Uffizi and Luke drive all night. The next\nmorning, they run into some rebels who are taking people prisoner. Uffizi\nlearns that they are not rebels but \"procurers\" who kidnap people to sell\nfor food to the nosferatu. Luke won't have it and forces Uffizi to stop\nthe car. Luke succeeds in freeing the prisoners, but the procurers blow up\ntheir car. Now, Uffizi and Luke have to proceed on foot. In the first town\nthey come to [filmed in Sigisoara], all the inhabitants are dead. Later\nthat evening, after they have burned all the bodies, they come across a\nvery scared man and woman near a downed helicopter. The woman turns out to\nbe reporter Julia Hughes, and the man is her cameraman Tommy [Gary J. Tunnicliffe]. Julia and\nTommy say they were attacked by rebels and shot some camera footage to\nprove it, but when Tommy runs back the film, there is no one on it except\nthemselves. Suddenly, a vampire on stilts swoops down and carries off Tommy.\nUffizi tries to follow, while Luke and Julia head back to a church for\nrefuge. Uffizi finds the vampire sucking Tommy's blood and cracks one of\nthe stilts with his whip. The vampire tumbles to the ground and impales\nhimself on his own stilt. But now where is Tommy? Tommy has gone back to\nthe church. Julia opens the door to him, but it soon becomes apparent that\nTommy is now a vampire, so Luke shoots him with his speargun.The next morning, Luke and Julia are joined by Uffizi, who has\ncommandeered a military jeep. Now that they have transportation again,\nthey find a car for Julia. Before they part ways, however, Julia asks to\nsee Uffizi's eyes (he always wears sunglasses). It's obvious that Julia\nand Uffizi are attracted to each other. She tilts down his glasses for a\nlast soulful look and notices that his irises are reddish.\nJulia goes her way and Luke and Uffizi go theirs. After driving for a\nwhile, Luke notices a woman on the side of the road holding a baby and\ncrying. Against Uffizi's better judgement, Luke stops to help. As he tries\nto convince her that he is a friend, she suddenly tosses the \"baby\" into\nhis arms. It's a bomb. Uffizi grabs it and tosses it away just in time.\nThey have been captured by rebels and are taken to their headquarters in\nan old army bunker. Uffizi tells leader Gabriel [Serban Celea] that they share the\nsame enemy - Dracula. Gabriel guffaws. \"Dracula is a fiction, gypsy myth,\ntourist prattle, bedtime story.\" He takes off Uffizi's glasses and sees\nhis red eyes. \"I'm fighting the infection,\" Uffizi explains, referring to\nthe vampirism he caught from Dracula five years ago. Just then, more\nrebels come in along with Julia, who seems to be friends with them.\nGabriel orders that Uffizi and Luke be put in the stockade. \"You're either\na hero or a demon,\" he says to Uffizi, \"but we can't take any chances.\nCome dawn, you are free to go.\"During the night, the bunker is attacked by vampires. Julia lets\nUffizi and Luke out of the stockade, but Uffizi pushes them both back\ninside, locks the door, gives them the key, and tells them to stay inside\nuntil he finds the way out. They wait till morning then let themselves\nout. Julia goes outside and finds Uffizi standing in the rising sun, his\nshirt off and screaming in obvious pain, Uffizi's way of purging himself\nof the infection. Julia covers his shoulders with his coat.\nLuke notices the procurers driving their trucks down the road.\nUffizi, Luke, and Julia follow in their jeep until they come upon a\ngruesome scene. About a dozen priests have been impaled on stakes along\nthe road. Uffizi orders Luke and Julia to go back, but they refuse, so\nthey all go on together, arriving at Dracula's castle. As they watch from\na safe distance, they are suddenly ambushed by the procurers. They\nshoot Uffizi, knocking him over a cliff. Then they knock out Luke and\ntake Julia prisoner.\nLuke is tossed into a large courtyard with a dozen or more prisoners,\nall awaiting slaughter. Luke climbs up the wall and finds his way to a\nroom filled with at least a dozen televisions. He is greeted by an old,\nunkempt, bored-looking Dracula who remembers him (from Dracula II) as the\ncoroner who stole his body and made him suffer at the hands of the\nexperimenters. When Luke asks to see Liz, Dracula tosses him into a\npit of bloody, writhing, half-naked vampiresses, all feeding off each\nother. \"Be careful,\" says Dracula. \"They WILL bite.\"Meanwhile, Uffizi has climbed to the top of the cliff. He is in bad\nshape and coughing up blood, but he is healing. He makes his way back to\nthe castle and goes looking for Julia.\nJulia has awakened to find that she is clothed in the dress of Dracula's\nfavorite bride. Dracula recognizes Julia from the TV and seems excited to\nhave her in his chambers, but when Uffizi arrives, he finds Julia lying on\nthe floor, bleeding from a stake in her abdomen. He pulls out the stake as\nDracula shows up to taunt him. Just as Dracula is about to plunge a sword\nthrough Uffizi's heart, Liz cries, \"Enough!\" and shoots a flaming\nstake into Dracula's stomach. As Dracula looks at the stake in awe and\npulls it out, Uffizi jumps him from behind and viciously bites his neck.\nHe then takes the sword and beheads Dracula, who almost seems to be\noffering his neck for the final blow. As he swings, Uffizi says, \"Consider\nyourself forgiven.\" Dracula destroyed, Liz silently takes the sword\nand walks over to Luke. Uffizi asks a dying Julia whether there is\nanything she wants to confess. \"I've had impure thoughts about you,\" she\nadmits. \"As I have about you,\" Uffizi replies.\n\"Please...\" says Liz to Luke.\n\"...don't...\" says Julia to Uffizi.\n\"...let me...\" says Liz to Luke.\n\"...die.\" say Julia and Liz together.\nLuke beheads Liz as Julia dies in Uffizi's arms.Epilogue: It is morning. Luke stumbles out of the castle and looks\nback for Uffizi. He does not come. Back in the castle, Uffizi sits on\nDracula's throne, holding Julia in his arms. There is a bite on her neck,\nand she is \"alive\" again. A postscript appears, saying THE KING IS DEAD! LONG LIVE THE KING! [Original synopsis by bj_kuehl]"}