{"mid": "Dracula2000", "IMDB_id": "tt0219653", "title": "Dracula 2000", "plot": "1897 England: The schooner Demeter is nearing England. The crew is dead,\nand the captain is lashed to the wheel. Dracula has arrived.2000 London: Matthew Van Helsing [Christopher Plummer], an aging collector of antiques, and his\nprotegee Simon Sheppard [Jonny Lee Miller] are discussing the purchase of a medieval crossbow\nthat Matthew means to add to his personal collection in the Carfax Museum.\nAmong the artifacts on public display, Carfax Museum also houses a\nheavily-protected vault, and no one knows what it contains. It must be\npretty valuable, though, so another employee, Solina [Jennifer Esposito], has arranged to\nbreak into the vault and steal whatever is in there.\nWhile Matthew sits in his office at the end of the day, Solina and\nher companions (Marcus, Trick, Nightshade, Dax, Charlie, and J.T) break\nthe computer codes and make their way to the main vault, passing numerous\nvampire skulls and crosses along the way, only to find...a coffin. No one\nwould think to look for treasure in a coffin, they reason, so this must be\nit. In searching for a way to open it,Eddie and Dax are impaled by spikes causing an alarm to go off in in Matthew's office. \"It's not possible!\" Matthew whispers to himself, arms himself with a gun that\nshoots silver bullets, and goes down to the vault to find that the coffin\nis gone, the thieves having removed it through a hole they've blasted in\nthe vault's wall. \"God help us all!\" Matthew exclaims.\nWhen Simon comes into work the next day, he finds Matthew preparing\nto travel. But Matthew won't reveal where he is going, so Simon follows\nhim...all the way to New Orleans.New Orleans: Mary Heller [Justine Waddell] is awakened by a dream in which a vampire is\nattacking her. Mary has been having this dream for all her life and finds\nthem troubling enough that she is receiving counseling from her family\nfriend, Father David [Nathan Fillion]. She thinks the dreams have to do with something that\nhappened to her mother before she died, and she thinks Fr David might know\nwhat it is. But Fr David isn't talking. On the other hand, Mary's\nroommate, Lucy Westerman [Colleen Fitzpatrick] thinks that all Mary needs is a real man in her\nbed. But it's Mardi Gras, and Mary vows not to let it bother her.Meanwhile, the thieves are transporting the coffin on a cargo plane.\nStill trying to open it, Nightshade cuts himself. His blood is sucked into\nthe coffin and the lid opens to reveal a body, a bunch of leeches, and a\ncrucifix set with a ruby. As Nightshade searches the coffin for more treasure,\nDracula [Gerard Butler] awakens. One by one, the thieves are drained of their blood, and\nthe plane ultimately crashes in a swamp near New Orleans, the pilot lashed\nto his seat. While newscaster Valerie Sharpe [Jeri Ryan] is covering the crash,\nDracula emerges from the swamp and makes her his second vampiress (Solina\nbeing first).Matthew and Simon go to the townhall where the bodies from the plane\ncrash have been taken. By now, they're all vampires. Matthew and Simon\nmanage to destroy some of them, but Solina and Marcus escape. As Matthew\nand Simon drive away, Matthew finally fills Simon in on what's happening.\nStoker's Dracula is real, he says, and Matthew Van Helsing is really\nAbraham Van Helsing, kept alive by injections of Dracula's blood, which he\nhas been filtering through leeches. Van Helsing has been keeping Dracula's\nbody ever since he bested him in 1897. Unlike other vampires, who can be\ndestroyed by piercing their hearts or cutting off their heads, Dracula\ncannot die, and Van Helsing intends to remain alive until such time as he\ncan learn the secret to Dracula's origin and find the way to end him. So\nfar, all he has managed to learn is that Dracula hates God and is repulsed\nby all things Christian. He also reveals that he (Van Helsing) has\nfathered a daughter, Mary Heller, and that Dracula has come to New Orleans\nto find her. The two decide to go looking for Mary, Van Helsing to her\nhouse and Simon to the Virgin Megastore where she and Lucy both work.Dracula is apparently following the same plan. He comes to Virgin\nlooking for Mary, but Lucy tells him that she isn't there. Lucy takes\nDracula home to wait for Mary. Dracula seduces Lucy and turns her into\nvampiress #3. When Simon arrives at Virgin, Mary has returned. Simon tries\nto tell her about her father. As they leave the shop, Simon is attacked by\nMarcus. \"Never ever fuck with an antiques dealer,\" Simon warns Marcus just\nbefore beheading him. Meanwhile, Van Helsing arrives at Mary's house, only\nto find Dracula waiting for him. \"You can't have her!\" Van Helsing\nexclaims, but Dracula refuses to listen. \"You stole life from my blood and\npassed it to another,\" he hisses. \"She's MY Mary now.\" With that, Dracula\nkills Van Helsing by tossing him into a mirror.Mary goes home to find her father dead and the three vampiresses and\nDracula awaiting her. She escapes into Simon's arms. Looking for a sacred\nplace to spend the night, they go to a church. While in the parish\nlibrary, they research Dracula's background, learning only what they\nalready know about his despise of all things Christian--holy water, the\ncross, the Bible. Only his dislike of silver remains unexplained.\nSuddenly, Dracula appears. Mary flees into the church cemetery while Simon\nattempts to divert Dracula with an open Bible. Dracula *is*\ndiverted...right into the cemetery where he explains to Mary, \"I have\nwalked the earth for centuries in search of a soul not bitten but born.\nEverything I am is yours, and all that you are is mine.\"Dracula takes Mary to the church roof where he reveals to her the\nsecret of his long existence. He is Judas Iscariot, the disciple who sold\nout Christ to the Romans for 30 pieces of silver (hence, Dracula's dislike\nof silver). In atonement, Judas hung himself, but the rope broke and God\nscourged him with eternal life as a vampire. In a soliloquy in front of a\nlighted crucifix, Dracula cries out to God, \"Now I drink the blood of\n*your* children. You made the world in your image. Now I make it in mine.\"Meanwhile, Simon sees the three vampiresses feasting on Mardi Gras\nrevelers. He stakes Valerie, but the remaining two capture him. Dracula\ntakes Mary to Simon and tells her to feed from him. \"I'd like his head,\"\nMary says while unsheathing a sword. Just as she prepares to swing the\nsword, Lucy cries out, \"She's faking!\" In the melee that follows, Mary\nbeheads Lucy instead of Simon, Simon beheads Solina, and Dracula winds up\nhanging by his neck from the lighted crucifix...just as the sun comes up.\nDracula bursts into flames. Mary vows to take over her father's job of keeping Dracula's ashes, lest Dracula find a way to return to life.\n[Original Synopsis by bj_kuehl.]"}