{"mid": "DragonTheBruceLeeStory", "IMDB_id": "tt0106770", "title": "Dragon: The Bruce Lee Story", "plot": "The film begins with a nightmare of Bruce Lee's father (Ric Young), who sees a terrifying phantom known as the Demon (Sven-Ole Thorsen) in black samurai armor that haunts the young Bruce Lee (Sam Hau). In a montage that passes quickly through his teenage years in Hong Kong, Bruce is shown receiving instruction in traditional Chinese martial arts. As a young adult, Bruce (Jason Scott Lee) fights with British sailors harassing a young Chinese woman, and this results in him having to leave Hong Kong. His father suggests that Bruce go to the US — Bruce was actually born in San Francisco, California when his father was a performer touring there and so Bruce has a US birth certificate. His father asks Bruce to become a success, so big a success that his name will be famous even back in Hong Kong.\nIn the US, Bruce works as a dishwasher at a Chinese restaurant, until a violent brawl with four of the cooks. The restaurant owner (Nancy Kwan) arrives and fires Bruce. As well as severance, she gives him an \"all-purpose loan\" and exhorts him to invest in an education. While studying philosophy in college, he begins to teach martial arts classes, where he meets Linda Emery (Lauren Holly). They marry in defiance of Linda's racist mother (Michael Learned). Linda suggests that Bruce open a martial arts school, but his Chinese peers demand he not train \"blacks or Americans\" and challenge him to settle the matter via combat. Bruce defeats Johnny Sun (John Cheung) in an secretive, illegal, no-holds-barred honor match, but an embittered Sun attacks Bruce after having already admitted defeat. Sun's cowardly, vengeful attack results in a seriously debilitating back injury for Lee.\nLinda is upset that Bruce did not tell her about the match. However, she nurtures him through his recovery, despite his despair and assumption that she will abandon him. She convinces him to examine his flaws and weaknesses and thus develop the fighting philosophy of Jeet Kune Do, which is published in The Tao of Jeet Kune Do. During this period Linda gives birth to their first child, Brandon, which helps to assuage a reconciliation with Linda's mother.\nSome months later, during Ed Parker's martial arts tournament, Bruce faces Johnny Sun again, in a 60-second demonstration of his new fighting style. Johnny Sun appears to have the upper hand in the first half minute, but then Bruce dominates Sun, finishing by kicking him over the top rope into the crowd. Bruce is subsequently praised by the crowd.\nAfter the match, Bruce meets Bill Krieger (Robert Wagner) and is hired for The Green Hornet television series. Bruce and Bill work together and create the idea for the Kung Fu television series. At a cast party, Linda says she is now pregnant with their second child. Shortly afterwards, there is an announcement for the cancellation of The Green Hornet. Kung Fu makes it to television, but much to Bruce's frustration, it stars David Carradine, a Caucasian. Bruce believes that Krieger has betrayed him.\nBruce returns to Hong Kong for his father's funeral, where Philip Tan (Kay Tong Lim), a Hong Kong film producer, informs Bruce of his fame there, where the The Green Hornet show is called The Kato Show. Bruce begins work on the feature film The Big Boss. In the filming of the final scene, set in an ice factory, Johnny Sun's brother Luke attacks Bruce, wanting revenge.\nThe Big Boss is a success. Bruce makes several more films, working as actor, director and editor. This causes a rift between Bruce and Linda, as she wishes to return to the US. Bill Krieger shows up, and although he knows that Bruce is still angry with him, he offers him a chance to work on a big-budget Hollywood movie, particularly as Linda wishes to return to the States.\nOn the 32nd day of shooting Enter the Dragon, during the climactic \"room of mirrors\" sequence, Bruce has a terrifying vision of the phantom samurai that has haunted his dreams since childhood. However, this time, being shown and beaten against his own grave, he saves his son Brandon and breaks the dark warrior's neck. The film ends during a shot of the final scene of Enter the Dragon. The film that would make Lee an international film star. Linda informs the audience that Bruce died before the movie's release; she states that she has preferred to discuss his life, not his death."}