{"mid": "DragonBooster", "IMDB_id": "tt0433286", "title": "Dragon Booster", "plot": "=== 10,000 years ago ===\nTen-thousand years ago, on the planet of Draconis there existed a breed of Gold-Boned animals called dragons. These Dragons had star-shaped marks on their foreheads (called bone-marks) and were known to all as Star Dragons (they were later renamed as Gold Dragons when the other colours emerged). Humans and Dragons lived side by side and together they built an almost atlantean world.\n=== 5000 years ago ===\nFive-thousand years ago, humans and dragons spread across the planet and settled in places far off. To better adapt to the new challenges faced by them, the humans bred the pure Gold Draconium STAR-CLASS star dragons into specialised sub-breeds:\nBlack Draconium PSI-CLASS Dragons\nRed Draconium MAGMA-CLASS Dragons\nGreen Draconium BULL-CLASS Dragons\nBlue Draconium ENERGY-CLASS Dragons\nPurple Draconium PACK-CLASS Dragons\nOrange Draconium CONTROL-CLASS Dragons\nLight Green Draconium SCAVENGER-CLASS Dragons\nLight Blue Draconium NAUTILUS-CLASS Dragons\nTurqouise Draconium SONIC-CLASS Dragons\nBrown Draconium EARTH-CLASS Dragons\nGrey Draconium BONE-CLASS Dragons\nWhite Draconium SKY-CLASS Dragons\nAs the colors of Draconium changed, the Dragons did not only change in appearance, but they also changed in their emotional states. The shape of their bone-marks as well as the color and frequency of their Mag-energy also changed shape. Their human riders also suffered similar behavioral changes due to the direct bond between human and dragon. Great Draconium Empires formed across the planet based on these Draconium Colors. They battled against each other and vied for supremacy. The Order of the Dragon Priests, who had dedicated themselves to the preservation of the last of the Pure Gold Draconium STAR-CLASS Dragons, warned the people that there would be a time when the dragons would rise against them if the dragons were not respected and freed. The people did not believe them, so the Dragon Priests continued their work of keeping the Gold Dragons preserved.\n=== 3000 years ago ===\nTwo-thousand years later, the Prophecy of the Dragon Priests came true. Dragons, realising that they had been tricked, rose up against their masters and began the Great Dragon-Human War. Led by the legendary Armeggadon (human leader of the Black Draconium Empire) and the Dragon League of Eight (Eight Pure Black Draconium Dragons), the Dragons fought against humans, and the ensuing war threatened to rip apart the planet. At this time, a single Gold Dragon, the last of his kind at the time, chose a human to be his hero, a Dragon Booster, in order to prove that unity was still possible. Seeing this, many dragons joined their side. Enough gold draconium was mined to make the Armour of the Dragon Booster, and they fought together against the forces of Armeggadon and the League of Eight. However, it was not enough that they had a gold dragon, and the Dragon Booster had to win the four primary colors of draconium over to their side. The Draconium colors of Green, Red, Blue and Black each produced a booster who joined with the Dragon Booster: the Power Booster from the Green Draconium Empire, the Fire Booster from the Red Draconium Empire, the Energy Booster from the Blue Draconium Empire, and the Shadow Booster from the Black Draconium Empire. Along with their followers, these Five Boosters slowly managed to halt the advancement of Armeggadon and the League of Eight. During this time, the Grey Draconium Dragons constructed the Horn of Libris and gave it to the Dragon Booster, telling him to use it when the time was right; the Dragon Booster entrusted the Horn to the Energy Booster. Soon afterwards, Armeggadon was sealed in the Shadow Track by the Shadow Booster. The time being right, the Dragon Booster and the four primary colors of draconium, along with the fringe elements of the other Draconium Empires that had joined their side, combined their powers and powered up the ancient gold draconium structures present underneath the planet and released a burst of balanced power that reverted all the dragons on Draconis back to gold. However, the Bone-Marks of the reverted dragons were not changed and were instead severed off. Dragons went into the new world with a small nub in the place of the Bone-Mark.\n=== After the Dragon-Human War ===\nThe war was over, but the danger was not. The severed Bone-Marks were found to possess the spirits of the warrior dragons and were capable of possessing dragons. The Dragon Priests took upon themselves to guard the dangerous Bone-Marks. The world of Draconis was in shambles and uncertain as how to rebuild. At this time, the Dragon Priests helped to write the Academy Charter and began construction on the Dragon City Academy. This Academy and the Elite Track was originally intended to be a means of preventing another Dragon Human War to take place. However, the Dragon Priests soon realised that the Academy and the Elite Track was merely another way of starting another Dragon-Human War, so they retreated from the world. The Dragon Priests hid and guarded the Bone-Marks as well as various other powerful artifacts from the Dragon Human War, such as the Gauntlets of the Booster. They also produced another prophecy that foretold another Dragon-Human War and the return of the Black-and-Gold Dragon who would choose another Dragon Booster. They foretold that only the new Dragon Booster and the new Dragon of Legend would be able to stop the new Dragon-Human War. Eons passed, and the Dragon Priests once again wait for the One."}