{"mid": "Dredd", "IMDB_id": "tt1343727", "title": "Dredd", "plot": "The future United States is a dystopic irradiated wasteland known as the Cursed Earth. On the east coast lies Mega-City One, a violent metropolis with 800 million residents and 17,000 crimes reported daily. The only force for order are the Judges, who act as judge, jury and executioner. Judge Dredd is tasked by the Chief Judge with evaluating new recruit Cassandra Anderson, a powerful psychic who failed the aptitude tests to become a Judge.\nIn Peach Trees, a 200-storey slum tower block, drug lord Madeline Madrigal, also known as \"Ma-Ma\", executes three rogue drug dealers by having them skinned alive, infused with Slo-Mo (an addictive new drug which reduces the user's perception of time to 1% of normal) and thrown down the atrium from the top floor. Dredd and Anderson are sent in to investigate and learn of a drug den, which they raid. They arrest a thug named Kay, whom Anderson's mind probe reveals to be the one who carried out the drug dealers' executions. Dredd decides to take him in for questioning. In response, Ma-Ma's forces seize the tower's security control room and seal the building, using its blast shields under the pretence of a security test, preventing the Judges from leaving or summoning help.\nMa-Ma orders Dredd and Anderson killed, forcing the Judges to fight their way through dozens of armed thugs. Arriving at the 76th floor, the Judges are assaulted by Ma-Ma and her men with Vulcan cannons that rip through the walls, killing numerous residents. The Judges breach an outer wall and call for backup. Meanwhile, Ma-Ma sends her henchman Caleb to search for the Judges. When they meet, Dredd throws Caleb off the tower in full view of Ma-Ma.\nDredd suspects Ma-Ma is desperate to keep Kay quiet and beats him for information. Anderson reads Kay's mind and learns that Peach Trees is the centre of Slo-Mo production and distribution. Anderson suggests they hide while awaiting assistance but Dredd insists they move up the tower and pursue Ma-Ma. Judges Volt and Guthrie respond to Dredd's call, but Ma-Ma's computer expert denies them entry by persuading them the security system is malfunctioning. A pair of armed teens confront Dredd and Anderson, allowing Kay to disarm and overpower Anderson. Kay then escapes with her as hostage, and takes her to Ma-Ma's base on the top floor.\nWhile Dredd works his way towards Ma-Ma, she calls in the corrupt Judges Lex, Kaplan, Chan and Alvarez. The four relieve Volt and Guthrie from duty and are allowed into the building. Dredd encounters Chan and is suspicious that he does not ask about Anderson's status. Seeing his cover blown, Chan attacks Dredd, but is killed. Meanwhile, Kay tries to execute Anderson with her own weapon, but the pistol's DNA scanner does not recognise him and explodes, taking his arm off. She escapes and later encounters Kaplan, whom she promptly kills after reading Kaplan's mind. Elsewhere, Dredd kills Alvarez but runs out of ammunition, and is shot by Lex in the abdomen. Lex moves in to execute Dredd, but Dredd stalls him long enough for Anderson to arrive and kill Lex.\nAnderson and Dredd obtain the code to Ma-Ma's apartment from her computer expert and confront her. Ma-Ma tells Dredd that, in the case of her death, a device on her wrist will detonate explosives on the top floors, destroying the building. Dredd reasons that the detonator's signal will not reach the explosives from the ground floor, so he forces Ma-Ma to inhale Slo-Mo and throws her down the atrium to her death.\nIn the aftermath, Anderson accepts that she has failed her evaluation by getting disarmed, and leaves. The Chief Judge asks Dredd about Anderson's performance; he responds that she has passed."}