{"mid": "DripAlongDaffy", "IMDB_id": "tt0043479", "title": "Drip-Along Daffy", "plot": "Daffy, introduced as a \"Western-Type Hero\" and Porky (billed as \"Comedy Relief\") ride along the desert until they come across the small \"Lawless Western Town\" of Snake-Bite Center, which is so full of violence that the population sign changes immediately when someone is shot. Daffy notices that the last sheriff had been shot, so the town needs a new sheriff. Daffy picks a sheriff badge out of his collection of badges and rides into town on his horse, Tinfoil, with Porky following behind on his donkey. In a recorded commentary on the Looney Tunes Golden Collection, the commentator warns the viewer that \"this film is literally stuffed with every western cliché ever done.\" That is illustrated and spoofed in such scenes as when a man is firing guns chasing another man; both stop at a traffic light so a second pair can cross, then their chase resumes, while two riders on horseback casually approach one another when the horses recoil in anger and begin shooting at each other. Other scenes include a holdup at \"Custard's Last Stand\" and a masked horse stealing horseshoes from a smithy at gunpoint.\nIn the town, Daffy is about to take a drink at the bar when Nasty Canasta walks in past his 'Wanted' poster (which states \"$5,000,000 REWARD (DEAD)\" and \"RUSTLER, BANDIT, SQUARE DANCE CALLER\"). Daffy tries to intimidate Canasta with his gun (\"Stick 'em up, hombre! You're under arrest\"), but Canasta just bites off most of the gun and eats it (\"Hmm. Probably didn't have his iron today!\"). Canasta then threateningly orders Daffy \"two of his usual\", a drink made of various poisons and toxic materials like cobra fang juice, hydrogen bitters and old panther (so hot that when two ice cubes are put in it, the ice cubes jump out, yelping and bouncing into a fire bucket to cool off). Canasta downs the drink with no side effects (other than his hat flipping), and when Daffy gets Porky to take the second drink with seemingly no side-effects, Daffy downs a third as well. A few seconds later, Daffy and Porky exhibit wild side effects, including reciting \"Mary had a Little Lamb\" in Elmer Fudd-ese, turning green, and acting like they're both motorized and Daffy's bullets shooting a hole in the floor which he falls into, then rockets out of before coming back to earth. Daffy sternly says to Canasta \"I hate you.\" Eventually, Daffy challenges Canasta to a showdown in the street.\nDaffy and Canasta start walking towards each other, the street deserted (with camera angles designed to parody the showdown camera angles common in Western films of that era), when Porky takes matters into his hands by winding up a small British soldier doll and letting it go towards Canasta, accompanied by Raymond Scott's The Toy Trumpet. Canasta picks up the doll, chuckling, until the doll points its gun at Canasta and fires, sending Canasta to the ground. With Canasta defeated, the rest of the town rush over to Porky, while Daffy is still pacing his way to the middle of the street. Daffy finally notices the adoration given to Porky, and in vain tries to get their attention (\"Gimme the cheers! Give me … Give me one dozen roses.\"). Porky is now the town sheriff, and Daffy reiterates his claim that he'd \"clean up this one-horse town\" to the camera — except now he's a sanitation worker. Porky remarks: \"Lucky for him [Daffy] it is a one-horse town.\""}