{"mid": "DrNo", "IMDB_id": "tt0055928", "title": "Dr. No", "plot": "Strangways, the British Intelligence (SIS) Station Chief in Jamaica, is ambushed and killed, and his body is taken by a trio of assassins known as the \"Three Blind Mice\". They also break into Strangeways' home/office, kill his secretary, and steal documents related to \"Crab Key\" and \"Dr. No\". In response, MI6 agent James Bond is summoned to the office of his superior, M, in London. Bond is briefed to investigate Strangways' disappearance and to determine whether it is related to his co-operation with the American Central Intelligence Agency (CIA) on a case involving the disruption of rocket launches from Cape Canaveral by radio jamming. Bond leaves for Kingston, but not before spending a night with a woman named Sylvia Trench.\nUpon his arrival at Kingston Airport, a female photographer tries to take Bond's picture and he is shadowed from the airport by two men. He is picked up by a chauffeur claiming to have been sent to take him to Government House, whom Bond determines to be an enemy agent. Bond instructs him to leave the main road and, after a brief fight, Bond starts to interrogate the driver, who then kills himself with a cyanide-laced cigarette.\nDuring his investigation in Strangways' house, Bond sees a photograph of a boatman with Strangways. Bond locates the boatman, named Quarrel, but finds him to be uncooperative. Bond also recognises Quarrel to have been the driver of the car that followed him from the airport. Bond follows Quarrel and manages to overpower both him and a friend when the fight is interrupted by the second man who followed Bond from the airport: he reveals himself to be CIA agent Felix Leiter and explains that not only are the two agents on the same mission but also that Quarrel is helping Leiter. The CIA has traced the mysterious radio jamming of American rockets to the vicinity of Jamaica, but aerial photography cannot determine the exact location of its origin. Quarrel reveals that he has been guiding Strangways around the nearby islands to collect mineral samples. He also talks about the reclusive Dr. No, who owns the island of Crab Key, on which there is a bauxite mine: the island and mine are rigorously protected against trespassers by an armed security force and radar.\nDuring a search of Strangways' house, Bond finds a receipt, signed by Professor R.J. Dent, concerning rock samples. Bond meets with Dent who says he assayed the samples for Strangways and determined them to be ordinary rocks. This visit makes Dent wary and he takes a boat to Crab Key where Dr. No expresses displeasure at Dent's visiting Crab Key in daylight and his failure to kill Bond, ordering him to try again, this time with a tarantula. Bond survives and after a final attempt on his life, sets a trap for Dent, whom he captures, interrogates and then kills.\nHaving detected radioactive traces in Quarrel's boat, where Strangways' mineral samples had been, Bond convinces a reluctant Quarrel to take him to Crab Key. There Bond meets the beautiful Honey Ryder, dressed only in a white bikini, who is collecting shells. At first she is suspicious of Bond but soon decides to help him, leading them all inland to an open swamp. Unbenownst to the three, they have entered an area contaminated by radiation. After nightfall they are attacked by the legendary \"dragon\" of Crab Key, which turns out to be an armoured tractor equipped with a flamethrower. In the resulting gun battle, Quarrel is incinerated by the flame-thrower whilst Bond and Ryder are taken prisoner. They are decontaminated, quartered in Dr. No's lair, and given drugged coffee to render them unconscious.\nUpon waking, they are escorted to dine with Dr. No, a Chinese/German criminal scientist with metal hands. He reveals that he is a former member of a Chinese crime Tong, from whom he stole 10 million dollars. He also reveals that he is not working for the Eastern Bloc, as Bond previously thought, but a secret organization called SPECTRE (SPecial Executive for Counter-intelligence, Terrorism, Revenge, and Extortion). He plans to disrupt the Project Mercury space launch from Cape Canaveral with his atomic-powered radio beam. After dinner, Ryder is taken away and Bond is beaten by the guards.\nBond is imprisoned in a holding cell but escapes by crawling through an obstacle-filled air vent. Disguising himself as a worker, he finds his way to Dr. No's control centre, which contains a nuclear reactor submerged in a pool of water. As the American rocket lifts off, Bond overloads the reactor and fights Dr. No, knocking him into the pool so that he boils to death. Bond finds and frees Ryder, and the two escape the island in a boat as the entire lair explodes. After the boat runs out of gasoline, they are rescued by Felix, who has arrived in a Royal Navy patrol boat with reinforcements. Bond and Honey begin to kiss, and Bond lets go of the tow rope."}