{"mid": "DrPhibesRisesAgain", "IMDB_id": "tt0068503", "title": "Dr. Phibes Rises Again", "plot": "The story begins by recapping the events of the previous film, following Dr. Anton Phibes' murderous quest for vengeance against the doctors he blamed for the death of his wife, Victoria. Phibes eluded capture by placing himself in suspended animation in a sarcophagus he shares with the body of his wife, where he would remain until the moon had entered into a specific alignment with the planets. Three years later, the conjunction occurs, and Phibes rises from his sarcophagus. Summoning his silent assistant Vulnavia (Valli Kemp, replacing Virginia North), Phibes prepares to take Victoria to Egypt; there, in a hidden temple, flows the River of Life, promising resurrection for Victoria and eternal life for the two of them. Rising from his basement, Phibes discovers that his house has been demolished, and a safe containing a papyrus scroll, showing the way to the River of Life, is now empty.\nPhibes knows of only one person who could be seeking the same goal: Darius Biederbeck (Robert Quarry), a man who has lived for centuries through the use of a special elixir. After translating the papyrus, Biederbeck prepares to travel to Egypt to find the River of Life for himself and his lover Diana (Fiona Lewis). Phibes and Vulnavia enter Biederbeck's house, kill his manservant and reclaim the papyrus, then leave for Southampton to take a boat to Egypt. Biederbeck travels with Diana and his assistant Ambrose (Hugh Griffith) on the same boat; Ambrose is killed by Phibes when he discovers Victoria's body in the hold, and his body is stuffed in a giant bottle and thrown overboard. Inspector Trout (Peter Jeffrey) discovers Ambrose's body when the bottle washes ashore near Southampton. He and Superintendent Waverley (John Cater) question Lombardo (Terry-Thomas), the shipping agent for the boat; upon hearing the descriptions of the tall woman (Vulnavia) and a clockwork band being brought aboard, they realize that Phibes has returned.\nTrout and Waverley pursue Phibes to Egypt, catching up to Biederbeck's archaeological party near a mountain with the hidden temple. Phibes, having set up residence inside the temple, hides Victoria's body in the hidden compartment of an empty sarcophagus. He also finds the silver key that opens the gates to the river. Phibes kills each of Biederbeck's men using methods inspired by Egyptian mythology: one man is killed by a hawk, another is stung to death by scorpions. Biederbeck's team eventually breaks into the temple and takes the sarcophagus, and Biederbeck discovers the key. Phibes uses a giant fan to simulate a wind storm, while Vulnavia enters the tent with the sarcophagus and crushes the man watching over it in a giant screw press. Though the sarcophagus is retaken and Victoria's body is safe, Phibes discovers the key is gone.\nBiederbeck is unmoved by the murders and insists on finding the River of Life. He sends Diana with the last remaining team member, Hackett (Gerald Sim), back to England. Hackett leaves his truck to investigate a battalion of British troops, but finds they are really more of Phibes' clockwork men. When he returns to the truck, Diana is gone and he is sand-blasted to death, his truck crashing into Biederbeck's tent. Realizing Phibes must have taken Diana, Biederbeck confronts him. Phibes demands the key in exchange for Diana's life. Unable to break her free of Phibes' trap, Biederbeck surrenders the key and apparently gives up his quest. Phibes unlocks the gates to the river and takes Victoria's coffin through. And in through apparent secret passage way, he summons Vulnavia to join them.\nBiederbeck instantly changes his mind and begs Phibes to take him. His pleas are ignored, all unbeknownst to Diana and the officers who see this. She attempts to comfort her lover, who unknown to her, begins to age rapidly. Its unknown if Biederbeck dies or just looks down in defeat as Phibes sings \"Over the Rainbow\" as he fades from sight."}