{"mid": "DrugstoreCowboy", "IMDB_id": "tt0097240", "title": "Drugstore Cowboy", "plot": "\"Bob\" Hughes (Matt Dillon) is the leader of a crew of drug addicts consisting of him, his best friend Rick (James LeGros), his wife Dianne (Kelly Lynch), and an underage girl with no family named Nadine (Heather Graham). Together, they travel across the U.S. Pacific Northwest in 1971, supporting their drug habits by robbing pharmacies and hospitals.\nAfter successfully robbing a Portland pharmacy, they go straight home to use the drugs they just stole. During the process of getting high, a local low-life named David (Max Perlich) visits the group in search of hard-to-find dilaudid. Bob lies and says they have none, but offers to trade him morphine for speed instead. David declines, but Bob talks him into trading anyways. After David leaves, the police bust down their door. The lead detective Gentry (James Remar) correctly assumes it was their group that had just committed the pharmacy robbery he's investigating. The police are unable to find the drugs because the group wisely buried them outside. However, in the process of searching, the police completely trash their house.\nThe group then move into an apartment. Bob plans to get back at the police by setting up an elaborate scheme. The scheme succeeds and one of the policemen is shot by a neighbor who thought the cop was a peeper thanks to Bob's scheme. The next day, Gentry (knowing that Bob was the architect of the scheme) assaults Bob outside his apartment. Seeing the assault as a sign of a hex Rick and Nadine had previously brought upon the group by speaking about dogs, they leave their apartment to go \"road-tripping\". One night on the road, they come across a drugstore with an open transom. They proceed to sneak in and rob the pharmacy. They are extremely pleased to find their haul includes vials of pure powdered dilaudid worth thousands of dollars each.\nBob, using the logic \"when you're hot, you're hot\", convinces his wife that he should finally rob the hospital he's always wanted to. During the robbery, Bob is almost captured and the robbery is a complete failure. Upon arriving back at the motel, the group discover that Nadine is dead from an overdose. She had overdosed by sneaking a bottle of dilaudid during their last score. To make matters worst, she had also put the \"worst of all hexes\" on them by leaving a hat on the bed. After temporarily storing the body in the motel's attic, they are alerted by the motel manager that their room was previously booked for a police convention and that they must check out immediately. Bob, under tremendous anxiety and stress while having visions of handcuffs and prison, manages to sneak the body out of the motel in a large duffelbag.\nRight before burying Nadine in a remote forest, Bob alerts his wife that he is going to get clean and begin a 28-day methadone program. She is shocked and confused with Bob's sudden dramatic decision. He asks her to get clean with him, but she declines telling him \"you know I can't\". Going their separate ways, Bob moves back to the city into a long-stay motel and gets a low-level manufacturing job \"drilling holes\". One day at the methadone clinic, he sees an elderly drug addict priest named Tom (William S. Burroughs). They reconnect and reminisce about the old days when drugs weren't so demonized. Another day, on the street, Bob runs into David who is bullying a kid who supposedly owes David money. Bob stops David from hurting the kid any further and the kid runs away, much to David's disgust.\nAfter adjusting into his new life, Bob is visited by both Dianne and the police detective Gentry on separate occasions. Gentry warns Bob that the policeman Bob got shot has been making threats and might act on them. Dianne reveals that Rick is now \"her old man\" and is in charge of their new group. Dianne then asks Bob what happened out on the road to make him suddenly change his life so drastically and wonders if it was something she did. He answers that Nadine's death, the hex she put on them with the hat, and the possibility of serious jail time all contributed to his eventual decision. He then reveals to her a deal he made with a higher power that if he could safely get Nadine's body out of the motel, past the cops, and into the ground without being caught, he would then straighten his life out in return. After explaining this to Dianne, he begs her to stay the night with him but she declines. Before she leaves, she gives Bob a package of drugs as a gift. Bob, instead of using them and relapsing, gives the drugs to the priest Tom who is very pleased. \"Bless you my son,\" he says.\nUpon re-entering his room, he is attacked by two masked figures. The leader turns out to be David. They think that Bob is still an addict and has drugs on him. Bob tells them the truth that he is clean and doesn't have any drugs. But David doesn't believe him and ends up shooting him. A neighbor lady hears the shot and calls 911. While Bob is getting loaded onto an ambulance, Gentry asks him numerous times who shot him and if it was the policeman. Bob tells Gentry it was \"the hat\" and \"the TV baby\". During the ambulance ride, Bob thinks out loud how he got in his situation. He comes to the realization that no matter how hard he tried, he could never fully escape the drug life. He also jokes about how he now has a free ticket to the \"fattest pharmacy in town\". The film ends with him saying \"I'm alive\" and \"I hope they can keep me alive.\""}