{"mid": "DrWhoAndTheDaleks", "IMDB_id": "tt0059126", "title": "Dr. Who and the Daleks", "plot": "It's an ackward moment at Dr. Who (Peter Cushing)'s home, as he is about to meet Ian (Ron Castle), who happens to be the boyfriend of his daughter Barbara (Jennie Linden). She tells her younger sister, Susan \"Susy\" (Roberta Tovey) to tend to the door up. This is no ordinary family, as Susy had been reading a huge book, by Physics for the Enquiring Mind by Eric M. Roberts, highly advanced for somebody of such a young age - alike the bigger sister, who was reading Science Is Science, and it's grandfather who's reading a science-fiction comic. Ian is clumsy and stubles on entering... again. Ian has brought a present, but Dr. Who insists in showing him his last invention. Susy thinks that Ian is so stupid, he won't understand it, but they three go out to the street to check of the red phone booth. Ian is amazed about how big it's on the inside. The machine will transport everything in time and place.Barbara appears and jumps to Ian's arms. He steps back and sets the machine onto motion with the four of them inside. The scenery immediately changes: they are on a place of jungle twigs and burnt soil called Skaro. It's another planet. Susan is excited to have the opportunity to go around and investigate. She find a kind of alien flower. Barbara screams at the small statue of a crocrodile. On the mayhem, Ian falls onto the thing and breaks it.Susan find the lights of empty buildings. Barbara starts thinking that something terrible happened in that place, and that it's dangerous. Ian tells Dr. Who that he's expected at home, so that they must return. Finally, who obliges. Susan gets lost because she finds another of those beautiful flowers. She runs away because a hand has touched her, but nobody seems to believe her.Back at the phone booth, they cannot see anyone with their surveillance cameras, but Susy insists that she was touched on the shoulder. There are knocks on the door, which startle Ian, but there isn't anybody around. They try to leave, but can't, and when they step aside, Susan courageously picks up a small blue container - it's has four small tubes with a liquid inside.They go to the city, which looks empty. Dr. Who gets tired easily. They enter an empty home with different rooms. Ian's door is the only one which doesn't open automatically, as he needs to touch something. Barbara walks a long corridor, and it looks as though she's being watched. She ends up being trapped and screams. Susan sits on the spot to open up the door. Susy, Ian and Who follow a noise to a communication room. Dr. Who looks tired. When they turn around, the three of them find themselves surrounded by Daleks. Ian is left dizzy by the Daleks, who also took the object which they found. They reunite with Barbara in a room/cell.Temmosus (Geoffrey Toone), Antodus (John Bown), Dyoni (Yvonne Antrobus) and Elyon (Mark Petersen). Some of them believe the letter offering to be their friends - supposedly written by Susan. Who devises a plan to escape using Susan's cape as an insulator. At that moment, a Dalek appears to bring them food, they put food in their periscope and attack it by blinding its eye with the disgusting food. Ian gets into the blue Dalek. There is also the image of a kind of green claw, a proof of the mutations which have taken place in the . Susan leads the way, and pretends to be the blue Dale's prisoner. They are soon found out anyway, so they have to break the lift, but the blue Dalek with Ian inside can't get into it. Now we realise that finally, Ian unstuck the head and was able to leave it in time.The four humans arrive in time to tell the Thals that they cannot hide in the forst forever. In fact, the Daleks are planning to bomb all the planet. However, the Thals have become peaceful, too peaceful. It was war which destroyed the planet and caused all the destruction and polution in Skaro. The Thals insist, and even the death of one of them was not convincing. Dr. Who tells Ian to take Dyoni to the Daleks. The leader won't allow it, so that settles the matter: they will have to fightSusan and Ian with cross a mutant-infested swamp with some Thals. On their way, they find the tubes which are polluting the water. Elyon stays behind to take some samples of the water, when he is eaten by something from the river.The Daleks are reuniting: they want to destroy the Thals forever. The other four follow the pipes to some caves. There is a fight between the two remaining Thals, because one of them wants to go back and forget the city.Who was supposed te watch some cakes, but they get burnt, to Susan's disappointment. Two female ladies are looking at themselves in the mirror, which gives Who an idea. Ian has to jump over a cliff, which he does, but then one of the Thals seems to have second thoughts over the whole ordeal. With plenty of mirrors, Who and the thals will make the detectors useless. The Daleks start to move on. Dr Who and Susan are captured again. The Daleks start the countdown for the bomb.Finally, one of the Daleks decides that they must fight. Dr. Who offers his time machine if the Daleks don't explode the bomb, but the Daleks will figure it out how it works after having exploded the bomb. Susan, Ian and the two Thals enter the Dalek's castle and run away using another lift. Finally, the rest of the Daleks fight.They reach control room. Two Daleks destroy one another. The Daleks destroy the computer when trying to kill Ian. All the Daleks are dead - three seconds left, which Ian alleges it's his lucky number.Why fills up the energy of the time machine. The Thals appreciate what they have done for them. They give Ian the purple coat - which Ian uses. Ian panics because they appear in the middle of a battle during the Roman Empire.They leave immediately."}