{"mid": "DuckAmuck", "IMDB_id": "tt0045708", "title": "Duck Amuck", "plot": "The cartoon's title sequence and opening scene suggest Daffy Duck is to star as a musketeer, who boldly acts out an action scene with a fencing foil. As he thrusts the foil and advances, the background abruptly disappears, leaving a plain white screen. Confused by this, Daffy turns to the animator and asks him to complete the scenery. However, instead of a castle from the original scene, the animator paints a farm scene. Daffy returns and starts to repeat his musketeer opening, but quickly notices the different background. He walks off screen and returns dressed as a farmer while singing a version of \"Old MacDonald Had a Farm\", but a few seconds later, the scene segues into a winter backdrop; Daffy changes into winter clothes and skies through the snow (to \"Jingle Bells\") and into a Hawaiian setting. Still dutifully, but impatiently, going through the changes, Daffy comes back in Hawaiian garb. After a couple of bars of \"Aloha 'Oe (Farewell To Three)\" on ukulele, Daffy ends up back in the plain white background.\nWhile Daffy tries to reason with the animator that cartoons should have scenery, he becomes completely erased and upon asking where he was, is redrawn as a cowboy with a guitar. Daffy tries to play it but there is nothing but silence. He requests sound with a sign and is granted with various non-guitar sound effects. Daffy also finds himself generating random sound effects when he tries to speak, and finally regains his voice when he blows his top and shouts angrily at the animator.\nRegaining his composure, Daffy demands some new scenery and is given an amateurish line-art cityscape background in pencil. Daffy asks for color, prompting the animator to slap various colors and patterns all over him (\"NOT ME, YOU SLOP ARTIST!!\"). All but Daffy's face is erased and upon asking where the rest of him was, he is redrawn as a bizarre mismatched animal with a \"screwball\" flag on its tail. As Daffy walks off (wondering to himself if he wasn't living up to his contract and if he hadn't been keeping himself trim), he becomes suspicious of his new form until the animator creates a mirror and Daffy scolds the animator upon seeing his hideous self (\"EEK! You know better than that!\"). Everything is erased and Daffy is redrawn again, this time as a sailor. He begins to sing \"The Song of the Marines\" as the animator draws an ocean scene with an island in the background, but he does not draw anything under Daffy, resulting in him falling into the ocean and surfacing on the distant island where he asks for a closeup, only to have the screen frame contract around him (to which he says \"A CLOSEUP, YA JERK! A CLOSEUP!!\"), as the camera then zooms up uncomfortably close to his eyes before he walks away, saying to the animator \"Thanks for the sour persimmons, cousin.\"\nAs Daffy tries once again to negotiate with the animator to have an understanding, the screen frame falls on him. After failing to keep the frame up with a stick, Daffy goes ballistic and rips apart the black background. Now at the end of his rope, Daffy demands \"Let's get this picture started\", so the camera does an iris-out to black, followed by \"The End\" slide which Daffy frustratingly pushes off camera, screaming \"NO, NO!\" as he does so. Daffy suggests that he and the animator go their separate ways and (hoping, against hope, that nothing further will happen) begins a dance routine which is quickly interrupted when the film runs out of alignment, resulting in two Daffys on the screen. They argue with each other and almost start a fight, but one Daffy is erased just as the other throws a punch.\nThe animator then turns Daffy into a pilot and draws him into an airplane. The duck excitedly flies around until a mountain is drawn in his path. The plane crashes off-screen, leaving Daffy with nothing but the plane's steering wheel and windshield. He \"bails\" out of the plane's remains and floats downward with his parachute which is replaced with an anvil. Crashing to the ground, a disoriented Daffy hammers the anvil while dizzily reciting \"The Village Blacksmith\". The animator changes the anvil into an artillery shell which explodes after a few more hammer strikes. Daffy finally snaps and angrily demands that the animator reveal themselves. The animator does, but not before they draw a door around Daffy and close it on him. The camera draws back and reveals the guilty party to be Bugs Bunny at a drawing table, who turns around and says to the audience: \"Ain't I a stinker?\""}