{"mid": "DuckSoup", "IMDB_id": "tt0023969", "title": "Duck Soup", "plot": "The wealthy Mrs. Teasdale (Margaret Dumont) insists that Rufus T. Firefly (Groucho) be appointed leader of the small, bankrupt country of Freedonia before she will continue to provide much-needed financial aid. Meanwhile, neighboring Sylvania is attempting to annex the country. Sylvanian ambassador Trentino (Louis Calhern) tries to foment a revolution and to woo Mrs. Teasdale, and he tries to dig up dirt on Firefly by sending in spies Chicolini (Chico) and Pinky (Harpo).\nAfter failing to collect useful information against Firefly, Chicolini and Pinky are able to infiltrate the government when Chicolini is appointed Secretary of War after Firefly sees him selling peanuts outside his window. Meanwhile, Firefly's secretary, Bob Roland (Zeppo), suspects Trentino's motives, and advises Firefly to get rid of Trentino by insulting him. Firefly agrees to the plan, but after a series of personal insults exchanged between Firefly and Trentino, the plan backfires when Firefly slaps Trentino instead of being slapped by him. As a result, the two countries come to the brink of war. Adding to the international friction is the fact that Firefly is also courting Mrs. Teasdale, and, like Trentino, hoping to get his hands on her late husband's wealth.\nTrentino learns that Freedonia's war plans are in Mrs. Teasdale's safe and orders Chicolini and Pinky to steal them. Chicolini is caught by Firefly and put on trial, during which war is officially declared, and everyone is overcome by war frenzy, breaking into song and dance. The trial put aside, Chicolini and Pinky join Firefly and Bob Roland in anarchic battle, resulting in general mayhem.\nThe end of the film finds Trentino caught in makeshift stocks, with the Brothers pelting him with fruit. Trentino surrenders, but Firefly tells him to wait until they run out of fruit. Mrs. Teasdale begins singing the Freedonia national anthem in her operatic voice and the Brothers begin hurling fruit at her instead.\n=== Mirror scene ===\nIn the \"mirror scene,\" Pinky, dressed as Firefly, pretends to be Firefly's reflection in a missing mirror, matching his every move—including absurd ones that begin out of sight—to near perfection. In one particularly surreal moment, the two men swap positions, and thus the idea of which is a reflection of the other. Eventually, and to their misfortune, Chicolini, also disguised as Firefly, enters the frame and collides with both of them.\nAlthough its appearance in Duck Soup is the best known instance, the concept of the mirror scene did not originate in this film. Max Linder included it in Seven Years Bad Luck (1921), where a man's servants have accidentally broken a mirror and attempt to hide the fact by imitating his actions in the mirror's frame. Charlie Chaplin used a similar joke in The Floorwalker (1916), though it did not involve a mirror.\nThis scene has been imitated many times; for instance, in the Bugs Bunny cartoon Hare Tonic, the Mickey Mouse cartoon Lonesome Ghosts, The Square Peg (1959), The Pink Panther (1963), and Big Business (1988). Harpo himself did a reprise of this scene, dressed in his usual costume, with Lucille Ball also donning the fright wig and trench coat, in the I Love Lucy episode \"Lucy and Harpo Marx\".\n=== Other scenes and jokes ===\nThe climactic production number ridicules war by comparing nationalism to a minstrel show. One segment is a variant on the old Negro spiritual \"All God's Chillun Got Wings\" (and was reportedly considered for deletion for the film's DVD release, for fear of offending African Americans):\nShortly after, during the final battle scenes, \"rightfully [...] called the funniest of all of cinema\", Firefly can be seen wearing a different costume in almost every sequence until the end of the film, including American Civil War uniforms (first Union and then Confederate), a British palace guard uniform, a Boy Scout Scoutmaster's uniform, and even a Davy Crockett coonskin cap. Meanwhile, the exterior view of the building they are occupying changes appearance from a bunker to an old fort, etc. Firefly assures his generals that he has \"a man out combing the countryside for volunteers.\" Sure enough, Pinky is wandering out on the front lines wearing a sandwich board sign reading, \"Join the Army and see the Navy.\" Later, Chicolini volunteers Pinky to carry a message through enemy lines; Firefly tells him, \"[...] and remember, while you're out there risking life and limb through shot and shell, we'll be in here thinking what a sucker you are.\" Thomas Doherty has described this line as \"sum[ming] up the Great War cynicism towards all things patriotic\".\nThe melodramatic exclamation \"This means war!\" certainly did not originate with Duck Soup, but it is used several times in the film—at least twice by Trentino and once by Firefly—and would be repeated by Groucho in A Night at the Opera and A Day at the Races. Variations of this phrase would later become a frequently used catch-phrase for Daffy Duck and Bugs Bunny in Warner Bros. cartoons.\nIn another scene, the film pokes fun at the Hays Code. Due to the code, a man and woman could not be shown in bed together. The camera begins the scene in a woman's bedroom, panning across the foot of the bed. A pair of men's shoes are shown on the floor, then a pair of women's shoes and then four horseshoes. The camera cuts to a shot of the entire room: Pinky is sleeping in one bed with the horse, while the woman is in another bed.\nThe film's writers recycled a joke used in Horse Feathers in this dialogue with Chico:\nProsecutor: Chicolini, isn't it true you sold Freedonia's secret war code and plans?\nChicolini: Sure! I sold a code and two pairs o' plans!\nThe street vendor confrontations are also well-remembered pieces of physical comedy: Chico and Harpo harass a lemonade seller (comedy film veteran Edgar Kennedy), egged on by his irritation that they have stolen his pitch.\nFirst, there is a scene involving the knocking off, dropping, picking up and exchanging of hats. Later, Kennedy (a much larger man) steals bags of Harpo's peanuts, and Harpo responds by burning Kennedy's new straw boater hat; in return, Kennedy pushes over their peanut wagon. Harpo responds by stepping knee-deep into Kennedy's lemonade tank, where he imitates a stereotypical Italian grape-crushing peasant; this drives off Kennedy's waiting line of customers.\nJust before the Mirror Scene is the Radio Scene. Harpo tries the combination to the safe on a box which proves to be a radio, and it starts blaring the break-up strain of John Philip Sousa's \"Stars and Stripes Forever\". The music continues despite frantic efforts to silence, and finally destroy, the radio.\nHarpo often doffed his hat on-screen, but Chico very rarely removed his Tyrolean hat, even when indoors. For a few seconds on-screen in the earlier scene, Chico's head is uncovered, revealing a wavy wig. Chico had already started going bald when the brothers appeared in their first Broadway production, I'll Say She Is, in 1924. All of the Brothers' natural receding-hairline patterns were similar, but Harpo and Chico covered theirs with wigs (Groucho would later sport an obvious toupee in the films At The Circus and Go West)."}