{"mid": "DuckDodgers", "IMDB_id": "tt0376390", "title": "Duck Dodgers", "plot": "The storyline involves Duck Dodgers (Daffy) in his search for the rare element Illudium Phosdex, \"the shaving cream atom\". In the future, the only remaining supply of the element is on the mysterious \"Planet X\". After Dodgers plots an enormously complicated course to Planet X by way of rocket, his assistant, the \"Eager Young Space Cadet\" (Porky) points out that they can simply follow a path of planets bearing the letters of the alphabet; leading from Planet A, through Planets B, C, D, and so on (each planet features a single landmass in the shape of the letter itself). Dodgers takes credit for this idea and the two soon arrive on Planet X.\nJust as Dodgers claims the planet in the name of the Earth, Marvin the Martian lands in his Martian Maggot rocket and claims it in the name of Mars, setting the stage for a battle of wits (or lack thereof) between the two. Dodgers explains he already claimed the planet for Earth and that there isn't enough room for the two of them. Marvin replies by pulling out his disintegrating pistol saying, \"I do believe you are right\". Dodgers tells the audience that this isn't a problem as he is wearing a \"disintegration-proof vest\", and indeed when Marvin fires on Dodgers' command, the vest survives as Dodgers disintegrates. The Cadet brings Dodgers back to normal with an \"integrating pistol\" but Dodgers accuses him of interference (\"Oh, you, huh?! Just when I had him going, you had to butt in\"!) and orders him back to the ship. Dodgers then tries to get the drop on Marvin with a disintegrating pistol of his own, but it literally disintegrates when he pulls the trigger. He runs into the ship after avoiding another shot from Marvin. The Cadet comes out and gives a stick of dynamite to Marvin, claiming it is a birthday present. The dynamite blows up in Marvin's hand, causing him to hide in his helmet and retreat to his ship.\nNext, believing Marvin has had enough, Dodgers sends him an ultimatum with an \"Ultimatum Dispatcher\". The ultimatum is delivered in the form of a bullet that opens up to reveal a message telling Marvin to \"Surrender or be blown into 17,670,002 micro-cells\". Marvin responds by using his own \"Ultimatum Answerer\" to send a similar bullet to Dodgers and when this bullet opens up, it shoots Dodgers in the face. Dodgers sends another ultimatum in reply, this time saying, \"OUCH\"! Later, Dodgers tries to see what Marvin is up to with a \"Super Video-Detecto set\" but when Marvin materializes on the screen, he simply shoots Dodgers in the face again, the shot reaching out through the screen.\nDodgers finally snaps and deploys his \"secret weapon\" in attempt to destroy Marvin, not knowing Marvin is preparing to do the same with one of his own. Both detonate their weapons at the same time, destroying Planet X. Dodgers dramatically claims the last remaining tiny chunk of the planet (from which he pushes Marvin) for Earth, with the Cadet and Marvin hanging helplessly beneath from a cluster of roots, the former delivering the final punchline (relating to Dodgers' Pyrrhic victory), \"Eh, b-b-b-b-big deal\"."}