{"mid": "DyingBreed", "IMDB_id": "tt1064744", "title": "Dying Breed", "plot": "Tasmania, 1800s. Alexander Pearce, a convict known as \"the Pieman\", has escaped into the wilderness and he is being hunted by policemen with dogs. He is faced by a policeman who attempts to shoot Pearce, but his gun does not fire. Pearce then bites the policeman's neck, taking a large chunk from his throat, killing him, allowing Pearce to escape.\nPresent Day. Nina plans a trip with her boyfriend Matt to Tasmania to find the supposedly extinct Tasmanian tiger. Her endeavor is encouraged by a paw print that was discovered by her older sister in a remote area of the island before her body was mysteriously found in the Pieman River several years before. Matt's friend, Jack, and his girlfriend, Rebecca, help pay for the trip and accompany the fellow couple. When they arrive, Matt sees a small girl on the boat playing a game with yellow-tinted teeth. When Matt asks what she is doing, she recites a rhyme, then bites Matt's hand. They spend a night in a dingy motel located next to a meat-pie factory, meeting the eccentric and creepy locals.\nThe next day, the group goes out on a boat in the river along the forest. They decide to camp in a cave out in the woods, and later that evening Matt and Nina discover one of the Tasmanian tigers creeping through the bush. Nina rushes to get her camera to take a picture of the tiger, but it has run into the woods. The group goes into the dark after the tiger using their cell phones as light because capturing proof of its existence is critical to Nina's research. Unbeknownst to the rest of the group, Rebecca is captured and eaten by a cannibal. When the other three re-group, they realize that Rebecca is missing and that Nina has blood on her pant legs.\nDesperate to find Rebecca, the group searches through the forest. The local ferryman tries to help them but is murdered by one of the cannibals. Reaching an old mining site, they find Rebecca's remains strung up on meat-hooks and Jack is killed by an animal trap. Matt flees underground and find grisly evidence of the cannibal's past exploits. Nina reaches a railway bridge over a fast-flowing river but is cornered by a pair of cannibals. She deliberately throws herself off the high bridge. The ferryman's wife then kills one of the cannibals. That night, the police arrive at the hotel but there is no sign of any of the missing people. As the police depart, a sad and weary Matt prepares to leave but is suddenly attacked.\nHe is later seen paralyzed in a chair while one of the cannibals explains that their settlement, much like the tiger, must stay hidden to survive. The cannibal then opens a door exposing a still-living Nina tied to a table, about to be raped for breeding purposes. While Matt watches, the young girl who was actually Nina's niece approaches him, removes a set of dentures, thus exposing a set of sharp deformed teeth. As the police drive away, Nina's mobile phone (which Matt had given them) displays a photo of the Tasmanian Tiger."}