{"mid": "EasyRider", "IMDB_id": "tt0064276", "title": "Easy Rider", "plot": "The protagonists are two freewheeling bikers: Wyatt (Fonda), nicknamed \"Captain America\", and Billy (Hopper). Wyatt dresses in American flag-adorned leather (with an Office of the Secretary of Defense Identification Badge affixed to it), while Billy dresses in Native American-style buckskin pants and shirts and a bushman hat. The former is quite open to people they meet on their journey and accepting of help while the latter is more hostile and suspicious.\nAfter smuggling cocaine from Mexico to Los Angeles, Wyatt and Billy sell their haul to \"Connection\", a man (played by Phil Spector) in a Rolls-Royce, and receive a large sum in return. With the money stuffed into a plastic tube hidden inside the Stars & Stripes-painted fuel tank of Wyatt's California-style chopper, they ride eastward aiming to reach New Orleans, Louisiana, in time for the Mardi Gras festival.\nDuring their trip Wyatt and Billy stop to repair one of the bikes at a farmstead, and have a meal with the farmer (Warren Finnerty) and his family. Wyatt seems to appreciate the simple, traditional lifestyle presented here. Later Wyatt stops to pick up a hippyish hitch-hiker (Luke Askew) and he invites them to visit his commune, where they stay for the rest of the day. Life in the commune appears to be hard, with young hippies from the city struggling to grow their own crops in a dry climate with poor soil and little rainfall. At one point, the bikers witness a prayer for blessing of the new crop, as put by a commune-member (Robert Walker Jr.): A chance \"to make a stand\", and to plant \"simple food, for our simple taste\". The commune is also hosting a traveling theater group that \"sings for its supper\" (performs for food). The notion of \"free love\" appears to be practised, with two of the women, Lisa (Luana Anders) and Sarah (Sabrina Scharf), seemingly sharing the affections of the hitch-hiking commune-member before turning their attention to Wyatt and Billy. The hitch-hiker asks the two bikers to stay at the commune, saying, \"the time is now\", to which Wyatt replies \"I'm hip about time...but I just gotta go.\" As the bikers leave, the hitch-hiker (known only as \"Stranger on highway\" in the credits) gives Wyatt some LSD for him to share with \"the right people\".\nLater, while naughtily riding along with a parade in a small town, the pair are arrested by the local authorities for \"parading without a permit\" and thrown in jail. There, they befriend American Civil Liberties Union lawyer and local drunk George Hanson (Jack Nicholson), who has spent the night in jail after overindulging in alcohol. George helps them get out of jail and decides to travel with Wyatt and Billy to New Orleans. As they camp that night, Wyatt and Billy introduce George to marijuana. As an alcoholic and a \"square\", George is reluctant to try the marijuana (\"It leads to harder stuff\", and \"I don't want to get hooked\"), but he quickly relents.\nStopping to eat at a smalltown Louisiana diner, the trio's appearance attracts the attention of the locals. The girls in the restaurant think they're exciting but the local men and a police officer begin making loud and denigrating comments and taunts. One of the men menacingly states, \"I don't believe they'll make the parish line.\" The waitress does not take their order and Wyatt, Billy and George, feeling the hostility, decide to leave without any fuss. They make camp outside town. The events of the day cause George to comment: \"This used to be a hell of a good country. I can't understand what's gone wrong with it.\" He observes that Americans talk a lot about the value of freedom but are actually afraid of anyone who truly exhibits it.\nIn the middle of the night a group of locals attack the sleeping trio, beating them with clubs. Billy screams and brandishes a knife and the attackers leave. Wyatt and Billy suffer minor injuries but George has been bludgeoned to death. Wyatt and Billy wrap George's body up in his sleeping bag, gather his belongings, and vow to return the items to his parents.\nThey continue to New Orleans and find a brothel George had told them about. Taking prostitutes Karen (Karen Black) and Mary (Toni Basil) with them, Wyatt and Billy decide to go outside and wander the parade-filled street of the Mardi Gras celebration. They end up in a cemetery, where all four ingest the LSD which the hitch-hiker had given to Wyatt. They experience a bad trip.\nMaking camp afterward, Billy declares that their trek has been a success. Wyatt disagrees, declaring, \"We blew it.\" The next morning, the two are continuing their trip eastward to Florida (where they hope to retire wealthy) when two rednecks in an old pickup truck spot them and decide to \"scare the hell out of them\" with their shotgun. As they pull alongside Billy, one of the men lazily aims the shotgun at him and threatens and insults him by saying, \"Want me to blow your brains out?\" and \"Why don't you get a haircut?\" When Billy casually flips his middle finger up at them, the hillbilly fires the shotgun and the shot hits Billy. His motorcycle goes down and he lands near the edge of the road, seriously wounded in the side. As the truck then takes off past Wyatt down the road, Wyatt turns around and races back to put his American flag-emblazoned jacket over his critically injured friend, who is already drenched in blood, before riding off for help. Seeing the injured biker, the old pickup truck turns around and closes in on Wyatt. The hillbilly fires at Wyatt as he speeds by, killing Wyatt instantly, his motorcycle goes flying in flames. As the murderous rednecks drive away, the film ends with an aerial shot from a helicopter of the flaming bike in the middle of the deserted road and two bikers lying there, as the camera recedes into the sky."}