{"mid": "EasyVirtue", "IMDB_id": "tt0808244", "title": "Easy Virtue", "plot": "Larita (Jessica Biel), a glamorous American widow and successful racecar driver, meets young John Whittaker (Ben Barnes) in Monaco. They marry, and he takes his bride home to meet his family at their dauntingly large rural mansion, where seven generations of Whittakers have been gentleman farmers. There she meets her icy cold mother-in-law, Veronica (Kristin Scott Thomas) and disheveled, sad-eyed father-in-law, Major Jim Whittaker (Colin Firth).\nVeronica, already predisposed to dislike her new daughter-in-law (\"John's floozy\") is further disappointed to find that she is a brash American who, like the Major, speaks fluent French. Larita also meets John's former girlfriend and neighbour Sarah Hurst (Charlotte Riley), who is gracious about the marriage. Larita remains calm in the face of her new mother-in-law's disdain, even being so bold as to reveal having been previously married.\nTime passes, and to Larita's disappointment, John is not eager to leave the estate (portrayed by Flintham Hall, Nottinghamshire) so that they can find a home of their own. Larita is bored and miserable in the countryside and hates blood sports like hunting, and indeed any of the entertainment country English people seem to enjoy. She reads Lady Chatterley's Lover, by D.H. Lawrence, which shocks her husband's female relatives, and she doesn't want to play tennis. She also dislikes Veronica's stuffy decor, her constant entertaining of her friends and the overcooked food. Worse still, she suffers from hay fever. She tries to get along with her mother-in-law, but Veronica refuses to accept her and naturally resents her attempts to bring some American traditions into the situation.\nLarita makes some inadvertent gaffes, accidentally killing the family chihuahua and giving some joking advice to the younger daughter, Hilda (Kimberley Nixon), that unfortunately results in embarrassment to, and enmity from, the daughters. Sarah comes to the Whittakers' parties, and to play tennis, accompanied by her brother Philip (Christian Brassington), on whom Hilda has a crush. Philip, however, is infatuated with Larita, which further angers Hilda. To Veronica's horror, she and her hunting party discover John and Larita making love in an outbuilding. Larita finds herself increasingly isolated and demoralized by her mother-in-law's derision, verbal attacks and dirty tricks. Larita's only sympathetic friends are the Major and the servants, whom she treats better than Veronica does. Larita retreats to the Major's workshop to help him work on his motorcycle. Still troubled from having lost all his men in the war, Jim Whittaker has lost interest in his home, and any love between him and his wife has long since gone.\nThe Whittaker estate has fallen on hard times. John, once in the shadow of his dragon-lady mother, loses his independence and seems immature to her as he is drawn into family life. In addition, John's affection for Larita seems to be waning, as he complains about his wife to Sarah, who finds his overture inappropriate.\nFinally, Hilda obtains a newspaper cutting revealing scandalous secrets about Larita's first marriage to a much older man who was dying of cancer: she had helped him die using poison. John withdraws from Larita, while the Major scolds his daughters for their cruelty. At Veronica's next big party, John refuses to dance with Larita, so the Major dances a tango with her. She determines to leave the marriage, and on her way out of the mansion, she apologizes to Sarah for having interrupted her relationship with John. She hopes that Sarah will take John back. Veronica and her daughters confront Larita one last time, and an argument ensues in which Veronica and Larita trade barbs, and Larita advises the daughters to leave and see the world while they still can. Larita finally leaves after casually destroying a priceless bust, but the Major goes with her. Furber (Kris Marshall), the family butler, wishes them well."}