{"mid": "EddieAndTheCruisers", "IMDB_id": "tt0085475", "title": "Eddie and the Cruisers", "plot": "A television reporter named Maggie Foley (Ellen Barkin) investigates the mysterious disappearance of legendary rock star Eddie Wilson (Michael Paré). Flashbacks dramatize Eddie's life and the rise and fall of his rock and roll band, Eddie and the Cruisers.\nThe band gets its start at a Somers Point, New Jersey club called Tony Mart's. Not adept at writing lyrics, Eddie hires Frank Ridgeway (Tom Berenger) aka \"Wordman\" to be the band's keyboard player and lyricist, over the protests of band manager Doc Robbins (Joe Pantoliano) and bassist Sal Amato (Matthew Laurance). Rounding out the Cruisers are saxophonist Wendell Newton (Michael \"Tunes\" Antunes), background singer and Eddie's girlfriend Joann Carlino (Helen Schneider), and drummer Kenny Hopkins (David Wilson).\nThe band's first album, Tender Years, became a major hit album. But recording their next album, A Season in Hell, turns out to be a nightmare. Inspired by the bleak, fatalistic poetry of Arthur Rimbaud, Eddie pushes his bandmates beyond their limits, musically and personally. Eddie wants to be great, but bassist Sal replies, \"We ain't great. We're just some guys from Jersey.\" Eddie makes this clear that if the band cannot be great, there is no reason to ever play music again. A Season in Hell is ultimately rejected by Satin Records on the grounds that it is \"dark and strange\". In the early morning hours, Eddie's car crashes through the railing and over the Stainton Memorial Causeway. Eddie vanishes without a trace, his body never found.\nAlmost 20 years later, Satin re-releases the band's first album, which charts even higher than it did originally. A television documentary is soon in the works, exploring the mystery of the band's second album, which had disappeared from the vaults of Satin Records the day after Eddie's disappearance. All of the original Cruisers are set to participate in it except Eddie and Wendell Newton, who had died of an overdose in August 1963 at age 37. The others are now living ordinary lives: Sal Amato fronts a Cruisers tribute band. Ridgeway is a high school English teacher in Vineland. Doc works as a radio disc jockey in Asbury Park. Joann is a stage choreographer in Wildwood, and Hopkins works in an Atlantic City casino.\nDuring the documentary interviews, the band expresses a desire to relive the past, even though many of their memories are humiliating. For example, during a concert at Benton College, where Frank was once a student, Eddie ridicules Frank repeatedly by referring to him as \"Toby Tyler\". The other Cruisers members share similar stories.\nJoann is able to complete the one piece of the puzzle that Frank could not: revealing what happened to the band's second album. After storming from the studio, Eddie brought her to the Palace of Depression, a makeshift castle made of garbage and junk that he visited often as a child. She reveals it was in fact she who took the master tapes for the album from Satin Records, hiding them in the Palace of Depression, where she felt they belonged.\nFrank and Joann go back to the Palace of Depression to retrieve the master tapes. A mystery man driving a blue '57 Chevy Bel Air convertible identical to Eddie's arrives at the house and calls to Joann. But before she can reach the car, Frank unmasks the impostor, revealing him to be Doc, who was after the master tapes all these years. Moved by his story, Frank and Joann give him the master tapes. Doc drives off into the night vowing that the Cruisers will finally conquer the world this time.\nIn a surprise reveal near the ending, a bearded, much older looking Eddie is shown alive, watching the ending credits roll of a documentary tribute to him and the band. He smiles serenely, proud to know that his work is finally being heard, and then disappears into the night."}