{"mid": "EdgeOfTomorrow", "IMDB_id": "tt1631867", "title": "Edge of Tomorrow", "plot": "A series of fragmented news broadcasts describes how an asteroid carrying an alien race called the Mimics has crashed in Europe and devastated the continent in a deadly war. Losing battle after battle over five years, the NATO-led United Defense Forces finally win a victory at Verdun, France, utilizing new mechanized \"jacket\" combat suits. UK Special Forces soldier Sgt. Rita Vrataski (Emily Blunt) is hailed as \"The Angel of Verdun\" after killing hundreds of Mimics single-handedly. She becomes an instant icon and a recruiting boon for the human military as the united human armies prepare to use the momentum at Verdun to commit all their forces in a multi-pronged final assault on Europe. One of the talking heads on the newsreels telling Vrataski's story and boosting the war effort is Major William Cage (Tom Cruise) of the US Army.Cage awakens from a doze on a helicopter trip to London the morning before the invasion of France is set to take place. He meets with the Commander of the Western allies, General Brigham (Brendan Gleeson), assuming the General wants Cage to help him boost his public image or prepare for a post-war political career. Instead, the General orders Cage to accompany the first wave of Allied troops to land in France and provide ground coverage for the media. Cage, who was a college ROTC Cadet and majoring in advertising and has no experience in combat, tries all of the tricks he can think of to avoid the order to embed with combat units and avoid deployment, ending with an effort to blackmail the General using his media skills. The General agrees that Cage won't film the invasion, but orders Cage arrested. Cage attempts to escape but the guards Taser him, rendering him unconscious.Cage wakes up on a pile of duffel bags in the afternoon at Heathrow Airport, which has become a huge military base and the jump-off point for the invasion of the Continent. A Sergeant kicks him and calls him 'maggot' before Sergeant Farrell (Bill Paxton) takes over. Sgt. Farrell has orders received from General Brigham that describe Private Cage as a deserter who has impersonated a Major. Cage is assigned to a band of odd-ball soldiers, J-Squad, who are caught gambling while playing poker by Farrell when Cage is introduced to them. Farrell forces J-Squad to eat the cards they are gambling with and then instructs them to get Cage ready to deploy with them tomorrow. Cage is immediately taken by the squad for Physical Training (PT).The next day Cage is a nervous wreck. He is given a battle suit but the members of J-Squad won't teach him how to use it, including how to disable his weapon' safe mode, because they believe he will just die quickly. As they are about to drop from aircraft onto the French coast, the back of their aircraft is struck by an enemy weapon and the squad drops prematurely. Although the operation to retake Europe was meant to be a surprise attack, the Mimics are completely prepared, and slaughter the humans. Sgt. Vrataski also lands on the beach but is killed within minutes. The surviving members of J-Squad are all killed rapidly. Still shell-shocked and about to die, Cage grabs a Claymore mine as a giant blue Mimic, an Alpha, jumps on him. The ensuing blast kills the Alpha Mimic, and just before Cage dies, the Alpha's blue blood covers Cage's wounds.Cage immediately awakes in a panic in the same spot he was the day before, on top of the duffel bags. The same sergeant calls him a 'maggot' and Farrell again takes him to J-squad. Despite his desperate attempt to explain that the Mimics will ambush the entire invasion, nobody believes him. Stuck in a time loop, he is repeatedly deployed and dies in a variety of ways, only to wake up again and again on the duffel bags. With each time loop, he becomes slightly more adept at killing Mimics and saving members of J-Squad and Vrataski, but the Mimics are too numerous and eventually kill everyone. In one loop, he survives long enough to tell Vrataski that he is stuck in a time loop. Recognizing his situation, Vrataski tells Cage to \"Find me when you wake up,\" before they are both killed again.Cage awakens on the duffel bags again, but cooperates with Sgt. Farrell and J-Squad to buy himself time to find Vrataski. After several fatal attempts in the base at slipping away, Cage finally manages to get away during PT and finds Vrataski in a training bay surrounded by training drones. The special forces soldiers are all hostile towards him and Vrataski greets him rudely, but when he explains that Vrataski asked for him, she whisks him away to a weapons building bay where her acquaintance, Dr. Carter (Noah Taylor) works. There they go to a back room and Vrataski and Carter explain the time loop. Carter was formerly a researcher in General Brigham's HQ, and devised a theory that all Mimics are just neural manifestations of one overmind 'Omega' alien creature.He tells Carter that the aliens posses the ability to turn time back, so each time an Alpha Mimic is killed, they cycle time backwards, enabling them to precisely anticipate the invasion forces' next actions. Vrataski explains she got into the loop when the blood of a large blue 'Alpha' Mimic was spilled on her, just as Cage experienced. She was stuck in a time loop at Verdun, allowing her to kill hundreds of Mimics single-handedly in what became her final loop.She explains that she was wounded and received a human blood transfusion, causing the alien blood to lose its effectiveness, and breaking the time loop. Vrataski tells Cage to always make sure he dies on the battlefield or in training or she'll have to kill him to start over.Carter created a device that could locate the Omega if it is stabbed into an Alpha Mimic but no one believed his theory and he was demoted and relegated to a mechanical repair unit. Cage tries to understand what he is saying but Vrataski says that to find the Omega they must first survive the invasion tomorrow. Through a large number of loops, she trains Cage, in some instances killing him over his protests when he is seriously injured so that he will resume the loop. Cage and Vrataski improved their combat skills and progress on the beach during the invasion, but despite everything, they both keep dying and Cage remains stuck in his loop. Cage becomes attracted to Vrataski and watching her die in repeated loops starts to take an emotional toll on him.Cage experiences a vision showing the Omega deep inside a dam in Germany. Vrataski and Carter believe the visions are due to Cage being exposed to an Alpha Mimic's blood. They believe the Omega can manipulate time and perception. Cage and Vrataski focus their efforts on surviving the invasion beach and getting inland to Germany.After multiple failures and deaths, Cage and Vrataski finally make it inland. During the repeated attempts Cage develops an attraction to Vrataski, and he slowly gathers details about Vrataski. In one loop, Vrataski tells Cage that she had a boyfriend at Verdun who she watched die three hundred times until she could no longer loop and he was dead for good. After they find a helicopter at a farmhouse, Vrataski realizes Cage is trying to coax her to stay in the farmhouse while he goes alone and confronts Omega. Cage admits they have looped to the farmhouse multiple times already, but every single time Vrataski dies, so he is trying to prevent her from dying again by going alone. Shocked and offended, she intentionally gets them killed.During one loop, believing the fight is pointless, Cage decides not to meet Vrataski and instead goes to London and stops in a pub. There, Cage sees the Mimic's next step in its attack: a large-scale amphibious assault on London while Operation Downfall forces are destroyed. Cage is killed in London, and Vrataski and Cage work on a plan to get off the beach. After numerous loops, they make their way inland towards the Omega.Cage eventually succeeds in making it to the German dam alone, but finds nothing and is almost captured by the Mimics before he manages to drown himself. In the next loop, Cage, Vrataski, and Carter put the pieces together and figure out the visions: Vrataski's success in Verdun was all a ruse by the Omega Mimic. The Omega had let the humans win at Verdun in order to lure the humans into invading Europe, where all the human armies would be ambushed and annihilated. With no other leads, the device Carter made which got him fired is their last chance. Vrataski and Cage switch focus to getting the device, which is at Whitehall in a safe in General Brigham's office. They infiltrate the Ministry of Defense and, after numerous loops, persuade Brigham to give them the transponder. Brigham relents and gives them the transponder before sending troops after them as they attempt to escape by car.As they escape, Vrataski stabs the transponder into Cage's leg. Cage sees the true location of the Omega: deep under the Louvre Museum in Paris. As they attempt to escape from the Allied headquarters, their car is stopped by a soldier in a mechanical jacket, and the airbag knocks out Vrataski before she can kill Cage.Cage awakens strapped to a hospital gurney, under arrest. He sees that he is receiving a blood transfusion and realizes that he can no longer loop in time. Vrataski helps Cage escape, but without the ability to loop in time again and only several hours before the doomed invasion, Cage decides to recruit the misfit J-Squad to help them get to Paris. Cage's now-intimate knowledge of J-Squad and Vrataski's credibility convinces J-Squad to accompany them. They steal an aircraft and fly to Paris.Once in the vicinity of the Louvre, the Mimics attack their aircraft. They must avoid killing the Alpha Mimic guarding the Omega, because that will cause the Omega to reset time, so all the team members are told to \"take one for the team\" - that is, to accept death - and not try to kill any Alpha Mimic in case they find themselves with one face-to-face. In the ensuing firefight half of J-Squad are killed. Cage, Vrataski, and three remaining J-Squad members decide to use the remaining engine power to slide the aircraft into the Louvre. Once inside, they plan to use grenades to destroy the Omega. The rest of J-Squad sacrifice themselves in the slide, and Cage and Vrataski make it into the museum. Once there, Vrataski tells Cage she will distract the Alpha Mimic while he attempts to drop a belt of grenades onto the Omega, which is under water deep under the Louvre. Vrataski tells him that neither one of them will survive the ordeal and kisses him, telling him that she wishes she had more time to get to know Cage better.Vrataski leaves to distract the Alpha Mimic and Cage dives underwater to find the Omega. After a brief chase, the Alpha catches and kills Vrataski. The Omega senses Cage and dispatches the Alpha to kill Cage. The Alpha dives after Cage and stabs him, but before he dies, Cage pulls the grenade pins and drops the grenade belt into the Omega. The Omega explodes and dies, and all the Mimics die with it. After Cage dies, the Omega's blood washes over and seeps into him, like the Alpha's blood did on the first day of the loop, and his eyes open.Cage wakens suddenly, confused, and finds himself on the helicopter en route to London on the morning before the invasion and his meeting with General Brigham. He disembarks and hears the celebratory pealing of bells. He watches a news conference during which the General announces that a huge mysterious energy blast was detected in Paris. The General says that the Mimics have died and the human forces will commence sweeping through Europe the next day. He sees J-Squad engaging in PT at the base. Cage looks for Vrataski and everyone treats him with respect due an officer. He finds Vrataski and she greets him with the same rudeness she has every time they meet in every loop. Cage smiles broadly."}