{"mid": "EdwardScissorhands", "IMDB_id": "tt0099487", "title": "Edward Scissorhands", "plot": "An elderly woman tells her granddaughter the story of a young man named Edward who has scissor blades for hands. As the creation of an old Inventor, Edward is an artificially created human who is almost completed. The Inventor homeschools Edward, but suffers a fatal heart attack before he can fasten hands on Edward.\nSome years later, Peg Boggs, a local Avon door-to-door saleswoman, visits the decrepit Gothic mansion where Edward lives. She finds Edward alone and offers to take him to her home when she realizes he is virtually harmless. Peg introduces Edward to her family: her husband Bill, their young son Kevin, and their teenage daughter Kim. They are initially fearful of Edward but come to see him as a kind person.\nThe Boggs' neighbors are curious about their new house guest, and the Boggs throw a neighborhood barbecue welcoming Edward. Most of the neighbors are fascinated by Edward and befriend him, except for the eccentric religious fanatic Esmeralda and Kim's boyfriend Jim. Edward repays the neighborhood for their kindness by trimming their hedges into topiaries. This leads him to discover he can groom dogs' hair, and later he styles the hair of the neighborhood women. One of the neighbors, Joyce, suggests that she can help Edward open a hair salon. While scouting for a location, Joyce attempts to seduce him, but scares Edward. Joyce tells the neighborhood women that he attempted to seduce her, reducing their trust in him. The bank refuses to give Edward a loan for the salon as he does not have a background or financial history.\nJim, jealous of Kim's attraction to Edward, suggests Edward pick the lock on his parents' home to obtain a van for Jim and Kim. Edward agrees, but when he picks the lock, a burglar alarm is triggered. Jim flees and Edward is caught by the police. The police discover through psychological examination that his period of isolation has left Edward without any sense of reality or common sense. Edward takes responsibility for the robbery, telling a surprised Kim he did it because she asked him to. Edward is shunned by the neighborhood except for the Boggs.\nDuring Christmas, Edward carves an angelic ice sculpture modeled after Kim, the ice shavings being thrown into the air and falling like snow, a rarity for the neighborhood. Kim dances in the snowfall. Jim arrives and calls out to Edward, which surprises him, accidentally cutting Kim's hand in the process. Jim accuses Edward of intentionally harming Kim, but Kim, fed up with Jim's jealousy, says she is breaking up with him. Edward runs off in a fit of rage, destroying his works until he is calmed down by a stray dog. Kim tells her parents what happened, and they set out to find Edward. Edward returns to the Boggs home to find Kim and Kevin there. Kim tries to apologize for Jim's behavior and asks him to hold her, but Edward is afraid he will hurt her again. Jim returns in a drunken rage and nearly runs over Kevin, but Edward pushes Kevin to safety, inadvertently scratching him. Jim tells those witnessing the event that Edward is attacking Kevin, and he tries attacking Edward. Edward defends himself, cutting Jim's arm, and then flees to the mansion.\nKim races after Edward, while Jim obtains a handgun and follows Kim. In the mansion, Jim corners Edward and fights him; Edward refuses to fight back until Jim slaps Kim as she attempts to intervene. Enraged, Edward stabs Jim in the stomach and pushes him from a high window, killing him. Kim confesses her love to Edward and kisses him before she departs. As the police and neighbors gather, Kim states that Jim and Edward both fell to their deaths, and brandishes one of the spare scissor blades as proof of Edward's death.\nThe elderly woman finishes telling her granddaughter the story, revealing that she is Kim and saying that she never saw Edward again. She prefers not to visit him because decades have passed and she wants him to remember her as she was in her youth. She thinks that Edward is still alive, immortal because he is artificial, and because of the \"snow\" which Edward creates by carving ice sculptures that scatter shavings over the neighborhood."}