{"mid": "ElCid", "IMDB_id": "tt0054847", "title": "El Cid", "plot": "General Ibn (pronounced Ben) Yusuf (Herbert Lom) of the Almoravid dynasty has summoned all the Emirs of Al-Andalus to North Africa and chastises them for their complacency in dealing with the infidels and reveals his plan for Islamic world domination.\nDon Rodrigo Díaz de Vivar (Charlton Heston), on the way to his wedding with Doña Ximena (Sophia Loren), rescues a Spanish town from an invading Moorish army. Two of the Emirs, Al-Mu'tamin (Douglas Wilmer) of Zaragoza and Al-Kadir (Frank Thring) of Valencia, are captured. After escorting his prisoners to Vivar and seeing that peace will not come from others' bloodthirsty desire for revenge, Rodrigo releases the Moors on condition that they pledge never again to attack King Ferdinand of Castile's (Ralph Truman) lands. The Emirs proclaim him \"El Cid\" (the Castillian Spanish pronunciation of the Arabic for Lord: \"Al Sidi\") and swear allegiance to him.\nFor this act of mercy, Don Rodrigo is accused of treason by Count Ordóñez (Raf Vallone). When the charge is repeated in court, they are supported by Ximena's father, Count Gormaz (Andrew Cruickshank), the king's champion. Rodrigo's aged father, Don Diego (Michael Hordern), once himself the champion, angrily calls Gormaz a liar. Gormaz strikes Don Diego with a glove, challenging him to a duel. Rodrigo asks Gormaz to come meet privately, begging him several times to \"have pity\" and instead ask the aged but proud Diego for forgiveness (for accusing Rodrigo of treason). Gormaz refuses, and Rodrigo kills him in a duel. Ximena swears revenge, wishing she were a son rather than a daughter.\nWhen a rival king demands the city of Calahorra, Rodrigo takes up the mantle of the Ferdinand's champion, to win the city based on single combat. Rodrigo is victorious and then is sent on a mission to collect tribute from Moorish vassals of the Castillian crown. He asks that if he returns, Ximena is given to him as wife, so that he can protect and provide for her. Count Ordóñez, conspiring with Ximena to win her as he's wanted, plots to kill Rodrigo. Rodrigo and his men are ambushed but are saved by Al-Mu'tamin, one of the pair to whom he showed mercy at the beginning of the story. Returning home, he and Ximena are wed, but the marriage is not consummated: Rodrigo will not take her if she does not give herself out of love, Ximena spends the night crying, and she soon removes herself to a convent.\nOn the death of King Ferdinand, his younger son, Prince Alfonso (John Fraser), tells the elder son Prince Sancho (Gary Raymond), that Ferdinand divided the kingdom: Castile to Sancho, Asturias and León to Alfonso, and Calahorra to their sister, Princess Urraca (Geneviève Page). Sancho refuses to accept anything but an undivided kingdom as his birthright, knowing Ferdinand would have been manipulated by the treacherous Urraca. After Alfonso instigates a knife fight, Sancho overpowers his brother and sends him to the dungeon Zamora. Rodrigo chases down the group, telling Alfonso's guards they are violating God's law, defeats them all and escorts Alfonto to Calahorra. When Sancho arrives to demand Alfonso, Urraca refuses to hand him over. She and Alfonso beg Rodrigo to join them, but he refuses, because his oath was to all of them equally. He could not help one without breaking his oath to the others.\nIbn Yusuf arrives at Valencia, planning to land his armada on Spanish shores, and hiring Dolfos to kill one of Ferdinand's sons, making it look like the other's order, thus weakening their part of Spain. Because Ferdinand had trusted Dolfos, Urraca suspects nothing when Dolfos offers to assassinate Sancho. At Alfonso's coronation, El Cid has him swear upon the Bible that he had no part in the death of his brother, including \"by counsel\" or \"by design.\" Since he had no part in it or any knowledge (as it was Urraca's doing), Alfonso swears truthfully, and banishes Rodrigo for the impudence. Ximena secretly listens to the edict, and her love is rekindled. Well into his way out of Spain, Rodrigo finds that Ximena followed, choosing exile with him.\nRodrigo is called into service by other exiled Spanish fighters and eventually into the service of the king to protect Castille from Yusuf's North African army. Rodrigo does not join the king, but allies himself with the Emirs who fight at Valencia, where Rodrigo relieves the city from the wicked Emir Al-Kadir, who betrayed him.\nCount Ordóñez brings Ximena from where the king had imprisoned her and her children after his defeat by the Moors. After patching things up with Rodrigo, Ordóñez joins him in his cause. Valencia falls and Emir Al-Mu'tamin, Rodrigo's army and the Valencians offer the crown to Rodrigo, \"The Cid,\" but he refuses and sends the crown to King Alfonso. Rodrigo then repels the invading army of Ben Yusuf, but is wounded in battle by an arrow before the final victory. Yusuf and his men see that Rodrigo has been badly wounded. If the arrow is removed, he would be unable to lead his army, but he would have a chance of recovery. El Cid obtains a promise from Ximena to leave the arrow, choosing to ride out, dying or dead. King Alfonso comes to his bedside and asks for his forgiveness.\nRodrigo, El Cid, dies, and his body is secured in a heroic pose, wearing his armor and cape, to an iron frame fitted to his saddle. With the sounding battle cry of \"For God, the Cid, and Spain\" his body is sent out at the head of his army, with King Alfonso and Emir Al-Mu'tamin riding on either side to guide his horse. When Yusuf's soldiers see El Cid with his eyes still open, they believe that he has risen from the dead. The Cid's horse, Babieca, followed by the column of mounted knights, trample Ben Yusuf, who is too terrified to fight. The invading North African army is routed and smashed. King Alfonso leads Christians and Moors alike in a prayer for God to receive the soul \"of the purest knight of all\"."}