{"mid": "ElClan", "IMDB_id": "tt4411504", "title": "El Clan", "plot": "The story is based on the case of the Puccio family from Buenos Aires, that kidnapped four people -three of whom they murdered- in the 1980s.\nThe Puccios appear to be a typical middle-class family from the affluent district of San Isidro, with aspirations of moving up into upper class. The family comprises Arquímedes Puccio, the family patriarch; Epifanía Puccio, his wife; Alejandro, their eldest son and a star rugby player; Daniel \"Maguila\", their middle child, who'd left the country years ago and hadn't kept in touch; Silvia, their eldest daughter, a school teacher; Guillermo, their youngest son, who is still in high school; and Adriana, their youngest daughter, who is in middle school.\nAt the end of the Falklands War in 1982, Arquímedes, who had been working for the state's intelligence services in operations to capture communist guerrilla fighters, becomes the owner of a small shop, a deli. In order to maintain his financial status, he decides to turn to crime and start kidnapping people for ransom, targeting wealthy families. Alejandro starts to collaborate with his father, by identifying potential hostages, taking advantage of his popularity among friends and acquaintances to not raise suspicion.\nThe first victim is Ricardo Manoukian, a friend and teammate of Alejandro's. Though the kidnapping is successful, Arquímedes kills Ricardo anyway, to avoid any chances of being identified as the kidnapper. After discovering Ricardo has been killed, Alejandro has a bout of conscience, but his father convinces him to keep the secret by assuring him that if Ricardo had been left alive, he would have identified them as the culprits and gotten them all arrested.\nThe ransom improves the Puccios' economic situation and, by early 1983, they replace their family deli with a successful store selling sporting equipment. Alejandro meets a girl called Monica at the store, and, after a few dates, she becomes his girlfriend. Meanwhile, Gustavo Contenpomi, a friend of Arquímedes' who is furious after being deceived in a business deal with entrepreneur Florencio Aulet, contacts the Puccios and suggests they make Florencio their next victim. Instead, Arquímedes and his cronies kidnap Florencio's son, Eduardo; since he is one of Alejandro's friends, and thus he's easier to lure into a trap. The Aulets pay the ransom, but Eduardo has already been murdered, and his body buried in a shallow grave, on an empty construction lot.\nIn December 1983, after the return to democracy in Argentina, Arquímedes goes to visit imprisoned military officer Aníbal Gordon - who had participated with Puccio in the kidnapping of a businessman in 1973 - and asks for advice on how to continue with the Clan's activities in the new political landscape. Gordon advises him to lie low, since the military will have more difficulty protecting him now that they've lost control of the country, but Arquímedes does not heed the warning.\nAlejandro accompanies his youngest brother, Guillermo, to the airport, since Guillermo is going abroad on a sports trip. At the gate, Guillermo confesses that he knows what Alejandro and their father had been up to, and says he will not be returning after the tour is over, since he is afraid of what will happen if the family's crimes are discovered. Before leaving, Guillermo begs his brother to get out while he still can. Listening to his brother's plea, Alejandro decides not to join his father in the next kidnapping: that of another businessman acquainted with the family, Emilio Naum. Due to Alejandro's absence, the plot fails, and Naum is murdered after refusing to stop his car when Arquímedes and his goons begin the abduction. Angered, Arquímedes returns home and beats Alejandro, blaming him for the failed kidnapping and accusing him of being ungrateful for all that Arquímedes sacrificed to get him a cushy lifestyle.\nTo reconcile with his father, Alejandro travels abroad to convince his other brother, Maguila, to return to Argentina and join the Clan in their operations. Now, in 1985, the group kidnaps businesswoman Nélida Bollini Prado and keep her prisoner in their home's basement. However, things do not go according to plan: the ransom negotiations fail; Adriana hears the woman's screams coming from the basement and realizes what had been going on; and Arquímedes gets a call from his former military superiors warning him that his stunts have garnered too much public attention, so he no longer has their protection.\nIn August 1985, when Arquímedes and Maguila collect the ransom in a service station, they are arrested by the police, who then break into the Puccio house, free the kidnapped victim, and arrest the family, with the exception of Adriana. The case causes a frenzy among the media, who dub the family the \"Puccio Clan\".\nThe prosecuting attorney shows Arquímedes the overwhelming evidence against him and tries to broker a deal: if Arquímedes confesses to being the mastermind behind the kidnappings, his family will not be indicted as accomplices. Arquímedes, however, insists that he'd been compelled to carry out the crimes by his military superiors and refuses to sacrifice himself for his family.\nWhile his rugby team and Monica believe in his innocence, Alejandro can not withstand the pressure. After violently arguing with his father in their jail cell (during which Arquímedes goads Alejandro to punch him, so Arquímedes can falsely claim the guards beat him), Alejandro tries to commit suicide by throwing himself off the fifth floor of the Tribunal building while he's being taken to testify.\nThe film ends with a text detailing the family's fate:\nAlejandro survived his fall and was sentenced to life in prison. While serving his sentence, he tried to commit suicide four more times. Monica kept visiting him for years, until he asked her to stop doing so and instead move on with her life. Alejandro died [of pneumonia, aged 49] in 2008, a few months after being released on probation.\nMaguila never served his sentence, since he fled the country - presumably to Australia, Brazil, or New Zealand - before he could be tried. In 2013, he returned to Argentina after the charges were dropped due to the statute of limitations.\nGuillermo was never indicted for his family's crimes. He never returned to the country nor contacted his family, and his whereabouts are unknown.\nEpifanía and Silvia were freed from prison for lack of evidence. [Silvia succumbed to cancer in 2011.]\nAdriana was also never indicted and, after the trial began, her surname was changed, and she moved in with her maternal uncles. After many years, she returned to live with her mother [in the very house where the kidnapping victims had been held].\nArquímedes was sentenced to life imprisonment but was eventually released on parole in 2008. His family never made contact with him after he regained his freedom. He died [from a stroke] in 2013, in La Pampa, and nobody claimed his body, so he was buried in an unmarked, communal grave."}