{"mid": "ElCrimenDelPadreAmaro", "IMDB_id": "tt0313196", "title": "El crimen del Padre Amaro", "plot": "El Crimen Del Padre Amaro is a film based off the 19th century Portuguese novel O Crime do Padre Amaro, recreated with a modern touch. Although critics have scolded this movie for not precisely recreating the novel, director Carlos Carrera does a great job at bringing the novel into a modern context and highlighting issues to which current audiences around the world can relate. Carrera created a film that reaches international audiences by establishing a Hollywood texture with continuity editing and a smooth, polished finish. Yet by focusing the film on sociopolitical corruption and prevalent issues in Mexico, Carrera also catches the attention of the national audience. In a primarily Catholic country, the clear themes of corruption and hypocrisy within the Church resounded and created undisputable tensions throughout the nation, which even inspired the Church to advocate against viewing of the film. Padre Amaro serves as a symbol of hypocrisy in the context of Catholicism and the issues of the class system in Mexico. He begins as young priest inspired to do right under the laws of the Church; however, throughout the film he is continuously challenged by pressures of money, society, and issues of celibacy. This film consists of most indoor scenes creating a sense of discretion throughout the film, highlighting the theme of scandals, secrets, and hypocrisy. The film creates an impactful sense of realism of the difference in lifestyles and class systems. Poverty in rural towns is contrasted with the wealth of the church through the mise-en-scene as portrayed in costumes, barren houses in poor conditions, shots of the underdeveloped town in the country side, and amongst all of these there lies a beautiful and ornate church. While in most Latin American films the country side is portrayed as fostering a happy, rooted, soul-fulfilling lifestyle, Carlos Carrera shows the audience a realistic view of how rural life can contain the same corruption and scandals that are normally seen to take place in urban environments.\nAll in all, this film does a terrific job at leaving the viewer with a clear message. Many distinct concepts can be pulled from this film, from corruption and injustice of politics and religious bodies, to personal struggles with human passions and the effects of society on a persons life."}