{"mid": "ElectricDreams", "IMDB_id": "tt0087197", "title": "Electric Dreams", "plot": "Miles Harding is an architect who envisions a brick shaped like a jigsaw puzzle piece that could enable buildings to withstand earthquakes. Seeking a way to get organized, he buys a personal computer to help him develop his ideas. Although he is initially unsure that he will even be able to correctly operate the computer, he later buys numerous extra gadgets that were not necessary for his work, such as switches to control household appliances like the blender, a speech synthesizer, and a microphone. The computer addresses Miles as \"Moles\", because Miles had incorrectly typed his name during the initial set-up. When Miles attempts to download the entire database from a mainframe computer at work, his computer begins to overheat. In a state of panic, Miles uses a nearby bottle of champagne to douse the overheating machine, which then becomes sentient.\nA love triangle soon develops between Miles, his computer (who later identifies himself as \"Edgar\"), and Miles' neighbor, an attractive cellist named Madeline Robistat. Upon hearing her practicing a piece from Notebook for Anna Magdalena Bach on her cello through an air vent connecting both apartments, Edgar promptly elaborates a parallel variation of the piece, leading to an improvised duet. Believing it was Miles who had engaged her in the duet, Madeline begins to fall in love with him in spite of her ongoing relationship with fellow musician Bill.\nAt Miles' request, Edgar composes a piece of music for Madeline. When their mutual love becomes evident, however, Edgar responds with jealousy, canceling Miles' credit cards and registering him as an \"armed and dangerous\" criminal. Miles shoves the computer and tries to unplug it, getting an electric shock. Then the computer retaliates by harassing him with household electronics.\nEventually, Edgar accepts Madeline and Miles' love for each other, and appears to commit suicide by sending a large electric current through his acoustic coupler, around the world, and back to himself.\nUltimately, a pop song, \"Together in Electric Dreams,\" written by Edgar as a tribute to Miles and Madeline, plays on radio stations across California."}