{"mid": "Eliminators", "IMDB_id": "tt0091003", "title": "Eliminators", "plot": "There's a time travelling 1-eyed mad scientist that created a cyborg with a laser on his arm. Said cyborg attempts escape certain dismantlement, which ends up killing some Asian assistant scientist that tried to help him. After escaping using tank treads as legs and shooting lasers at hired goons, he goes to another scientist for help... played by Lt Yar from Star Trek. Yar has a little flying robot that seems to be a mix of that owl from Clash of the Titans, and R2-D2.\nYar, Owl2-D2, and \"Mandroid\" then hire a river ruffian to pilot a boat to go up-stream. They find traces of Mandroid's human past with a picture of his wife and child. He can't yet remember who they are just yet..\nThat boat eventually crashes, and they end up being captured by some Neanderthals... presumably brought to the present by the time-travelling 1-eyed mad scientist. After escaping the poorly costumed cavemen, they come across a ninja who is out for revenge since he was the son of that random dead scientist at the beginning. He can manipulate time and space with his mind (done by playing recorded video in reverse or slo-mo)... but only sometimes, and for no reason.\nThe River Ruffian, Lt. Yar, Mandroid, Owl2-D2, and the ninja find those old tank treads and uses them to attack the time travelling 1-eyed mad scientist's lair. Owl2-D2 and the tank treads bite the dust, and they carry on inside the compound.\nThe time travelling 1-eyed mad scientist then shows up now also a cyborg (but red), yet wearing gold armour he took from Ancient Rome since he wants to go back and be the Caesar of the time. Looking like Iron Man on acid, he then shoots Force Lightning (a la the Emperor of the Sith) from his Roman shield, and traps the crew in a shrinking net of electricity. Mandroid then sacrifices himself (with minimal protest from the others) to save them. He dies. (Yes.. the main character dies and never finds out who he was and what happened to his family who should be still alive since it was only a year ago he was changed into a cyborg)\nThe Ninja, Ruffian, and Yar then go inside and send the time travelling 1-eyed mad Roman Iron Man scientist back to 430,000,000BC, where he yells and shakes his cyborg hands to the sky in anger. They all just smile and then.. credits.\nThe End. Awesome."}