{"mid": "ElizabethTheGoldenAge", "IMDB_id": "tt0414055", "title": "Elizabeth: The Golden Age", "plot": "In 1585, Catholic Spain ruled by King Philip II of Spain (Jordi Molla) is the most powerful country in the world. Seeing Protestant England as a threat, and in retaliation for English piracy of Spanish ships, Philip plots war. He plans to take over England and make his daughter, Isabella, the Queen of England in Elizabeth's place. Meanwhile, Elizabeth I of England (Cate Blanchett) is being pressured by her advisor, Francis Walsingham (Geoffrey Rush), to marry, for if she dies without an heir, the throne will pass to her cousin, Mary, Queen of Scots (Samantha Morton), who is Catholic. Therefore, the Queen is presented with portraits of appropriate suitors, particularly the very youthful Charles II, Archduke of Austria (Christian Brassington), but she refuses to marry any of them.\nEnglish explorer Walter Raleigh (Clive Owen) is presented at Elizabeth's court, having returned from the New World, and he offers her potatoes, tobacco, two Native Americans, and gold from a Spanish ship that he claims was \"unable to continue its journey\". Elizabeth is attracted to Raleigh, enthralled by his tales of exploration, and asks Bess Throckmorton (Abbie Cornish), her most favored lady-in-waiting, to observe him. Bess also finds Raleigh attractive and secretly begins an affair with him. With tensions strained between England and Spain, Elizabeth seeks guidance from her astrologer, Dr. John Dee (David Threlfall), who predicts that two empires will go to war. However, he cannot predict which will triumph over the other, leaving Elizabeth to ponder her and England's fate.\nJesuits in London conspire with Philip to assassinate Elizabeth and replace her with Mary, in what Philip calls \"The English Enterprise\", historically known as the Babington Plot. From her imprisonment, Mary sends secret correspondence to the Jesuits, who recruit Anthony Babington (Eddie Redmayne) to assassinate Elizabeth. Walsingham continues to warn Elizabeth of Spain's rising power and of the Catholics' plots against her. However she, unlike her predecessor and half-sister Mary I of England, refuses to force her people to share her religious beliefs. Even so, those conspiring against Elizabeth are being hunted and murdered, including Bess's cousin, Sir Francis Throckmorton and his father, whom Bess had failed to protect.\nWalsingham's brother, a Papist, who knows of the plot against Elizabeth is jailed and Walsingham reveals Spain's plot to Elizabeth, who angrily confronts the Spanish diplomats. The Spanish ambassador feigns ignorance, accuses Elizabeth of receiving Spanish gold from pirates, and insinuates that she has a sexual relationship with Raleigh. Enraged, Elizabeth throws the Spaniards out of court. Meanwhile, Philip is cutting down the forests of Spain to build the Spanish Armada, to invade England. Mary writes letters condoning the plot.\nBabington storms into a cathedral where Elizabeth is praying and fires a pistol at her, though Elizabeth is unharmed as it is revealed that there was no bullet in the gun. The conspirators of The English Enterprise are imprisoned and interrogated by Walsingham but do not answer why the pistol was unloaded. As Elizabeth learns of Mary's involvement in the plot, Walsingham insists Mary be executed to quell any possible revolt. Elizabeth is reluctant, but nevertheless agrees. Mary is tried for high treason and is beheaded, after ascending the block in a blood-red dress (red being the Catholic liturgical color for martyrs). Walsingham sees that this was part of the Jesuits' plan all along. Philip had never intended Mary to become queen, but since the Pope and other Catholic leaders regarded Mary as the true Queen of England, Philip uses Mary's death to obtain papal approval for war. The \"murder\" of the last legitimate Catholic in the line of succession gives Philip the pretext he needs to invade England and he oversees the departure of the Armada from Cádiz.\nRaleigh asks to leave for the New World, which an emotional Elizabeth forbids, instead knighting him and making him Captain of the Royal Guard. Bess reveals to Raleigh in private that she is pregnant with his child, and pleads with him to leave. Instead, the couple marries in secret. When Elizabeth confronts Bess later, she confesses that she is indeed pregnant with Raleigh's child, and that Raleigh is her husband. An infuriated Elizabeth berates Bess, reminding her that she cannot marry without royal consent. She then banishes Bess from court and has Raleigh imprisoned for the crime of seducing a ward of the Queen.\nAs the Spanish Armada begins its approach up the English Channel, Elizabeth forgives Bess and sets Raleigh free to join Sir Francis Drake in the battle. Elizabeth gives her Speech to the Troops at Tilbury, while seated on a war horse and wearing full plate armour. The ships of the Armada vastly outnumber England's, but a major storm blows the Armada toward the beaches, endangering its formation and ships. The ships of the Armada drop anchor, and the Armada becomes vulnerable for English fire ships. Elizabeth, back at her coastal headquarters, walks out to the cliffs and watches the Spanish Armada sink in flames as the English prevail over Spain.\nElizabeth visits Walsingham on his deathbed and tells her old friend to rest. She then visits Raleigh and Bess and blesses their child. Elizabeth seemingly triumphs personally through her ordeal, again resigned to her role as the Virgin Queen and mother to the English people."}