{"mid": "Elizabeth", "IMDB_id": "tt0127536", "title": "Elizabeth", "plot": "In 1558, Catholic Queen Mary dies of a uterine tumour. Mary's Protestant half-sister, Elizabeth, under house arrest for conspiracy charges, is freed and crowned the Queen of England.\nAs briefed by her adviser William Cecil, Elizabeth inherits a distressed England besieged by debts, crumbling infrastructure, hostile neighbours and treasonous nobles within her administration, chief among them the Duke of Norfolk. Cecil advises Elizabeth to marry, produce an heir, and secure her rule. Unimpressed with her suitors, Elizabeth delays her decision and continues her secret affair with Lord Robert Dudley while Cecil appoints Francis Walsingham, a Protestant exile returned from France, to act as Elizabeth's bodyguard and adviser.\nMary of Guise lands an additional 4,000 French troops in neighbouring Scotland. Unfamiliar with military strategy and browbeaten by Norfolk at the war council, Elizabeth orders a military response, which proves disastrous when the younger, ill-trained English forces are defeated by the professional French soldiers. Walsingham tells Elizabeth that Catholic lords and priests intentionally deprived Elizabeth's army of proper soldiers and used their defeat to argue for Elizabeth's removal. Realizing the depth of the conspiracy against her and her dwindling options, Elizabeth accepts Mary of Guise's conditions, to consider marrying her nephew Henry of France.\nTo stabilize her rule and heal England's religious divisions, Elizabeth proposes the Act of Uniformity, which unites English Christians under the Church of England and severs their connection to the Vatican. In response to the Act's passage, the Vatican sends a priest to England to aid Norfolk and his cohorts in their growing plot to overthrow Elizabeth. Unaware of the plot, Elizabeth meets Henry of France but ignores his advances in favour of Lord Robert. William Cecil confronts Elizabeth over her indecisiveness about marrying and reveals Lord Robert is married to another woman. Elizabeth rejects Henry's marriage proposal when she discovers he is a cross-dresser and confronts Lord Robert about his secrets, fracturing their idyllic affair and banishing him from her private residence.\nElizabeth survives an assassination attempt, whose evidence implicates Mary of Guise. Elizabeth sends Walsingham to secretly meet with Mary in Scotland, under the guise of once again planning to marry Henry. Instead, Walsingham assassinates Guise, inciting French enmity against Elizabeth. When William Cecil orders her to solidify relations with the Spanish, Elizabeth dismisses him from her service, choosing instead to follow her own counsel.\nWalsingham warns of another plot to kill Elizabeth, spearheaded by the priest from Rome carrying letters of conspiracy. Under Elizabeth's orders, Walsingham apprehends the priest, from whom he learns the names of the conspirators and a Vatican agreement to elevate Norfolk to the English crown if he weds Mary, Queen of Scots. Walsingham arrests Norfolk, and executes him and every conspirator except Lord Robert, whom Elizabeth allows to live, as a reminder to never be blinded by romance again.\nDrawing inspiration from the divine, Elizabeth cuts her hair and models her appearance after the Virgin Mary. Proclaiming herself married to England, she ascends the throne as \"the Virgin Queen\"."}