{"mid": "ElMariachi", "IMDB_id": "tt0104815", "title": "El mariachi", "plot": "After breaking out of jail in a small Mexican town, a ruthless criminal, nicknamed Azul, ventures off with a guitar case full of weapons and vows revenge on the local drug lord, Moco, who had had him arrested in the first place. Meanwhile, a young musician arrives in town carrying his own guitar case which contains his signature guitar. He hopes to find work in the town in order to pursue his dream of becoming a mariachi like his father.\nFrom the confines of his heavily guarded villa on the outskirts of town, Moco sends a large group of hitmen to kill Azul. They are told to look for a man who is wearing black and carrying a guitar case, but because the Mariachi also matches this description, the hitmen mistake him for Azul and begin to pursue him. Only Moco, however, knows Azul's actual face. The Mariachi is then forced to kill four of the attackers in self-defense after being chased through the streets. As the Mariachi seeks refuge in a bar owned by a beautiful woman named Dominó, he quickly falls in love with her. Unfortunately, Moco is not only financing the bar, but also has his own romantic interest in Dominó.\nWhen Azul visits the bar for a beer and information about Moco, he accidentally leaves with the Mariachi's guitar case. Moco's thugs capture Azul on the street but let him go when they learn that the case he is carrying contains only a guitar. A short time later, the Mariachi is captured and taken to Moco, who identifies him as the wrong man and sets him free.\nMeanwhile, Azul, who has no directions to Moco's home, takes Dominó with him and orders her to take him to Moco's, or Moco will kill the mariachi. Dominó agrees in order to save the Mariachi's life. When they arrive at Moco's gated compound, Azul pretends to take Dominó hostage in order to gain entry. Moco soon realizes that Dominó has fallen for the Mariachi and, in a rage, shoots both her and Azul. Suddenly, the Mariachi arrives to find the woman he loves gunned down. Moco then shoots the Mariachi's left hand, rendering him useless as a guitar player, and proceeds to taunt and laugh at the Mariachi. Overcome with grief and rage, the Mariachi picks up Azul's gun with his right hand and kills Moco, taking revenge for Dominó's death. Moco's surviving henchmen, seeing their leader dead, walk off and leave Moco's body and the wounded Mariachi behind.\nThe Mariachi leaves the town on Dominó's motorbike, taking her pit bull and her letter-opener by which to remember her. His dreams to become a mariachi have been shattered, and his only protection for his future are Azul's former weapons which he takes along in the guitar case."}