{"mid": "Emma", "IMDB_id": "tt0118308", "title": "Emma", "plot": "Miss Emma Woodhouse is sophisticated, clever, rich and beautiful - and just a little bit spoiled. After her governess Miss Taylor marries kind Widower Mr. Weston, she is left to her own devices and the company of her hypochondriac father in the country estate of Hartfield. Since she fancies herself a matchmaker, a quality defied by old family friend George Knightley, she decides to provide the charming young vicar Mr. Elton with a wife. The chosen one is Harriet Smith, a pretty but simple Parlour Boarder of unknown heritage. Emma takes the young woman under her wings and introduces her to society - especially Mr. Elton, who soon shows first signs of interest. In her enthusiasm Miss Woodhouse goes so far as to manipulate Harriet into refusing a marriage proposal from farmer Robert Martin, ignoring a mutual attraction between the two. This infuriates Knightley, who is appalled by Emma's meddling. Even though the friends soon reconcile, things go badly awry on Christmas Eve, when Elton proposes to a shocked Emma, having misunderstood her encouragement. Emma rejects him, suddenly seeing his real character as shallow and selfish and is relieved when the Vicar leaves town for a visit to Bath. Having to deal with Harriet's disappointment and her own embarrassment and guilt, she decides to give up on her hobby. Things make a turn for the worse, when Jane Fairfax, the niece of the kind but chatty Miss Bates returns to Highbury. Even though Jane is orphaned and poor and will soon have to find a place as a governess, Emma can't help but dislike her, mainly due to her aunts endless praise.A second arrival meets her approval much more - Mr. Westons son Frank Churchill, who grew up at his aunts house finally visits his father and the new Mrs. Weston. Emma, who secretly always believed him to be her destiny, is quickly attracted to the charming young man, who flirts openly with her. He shares his cheeky sense of humour with her and seems to find special pleasure in teasing the highly talented and beautiful, but reserved Jane Fairfax. Knightley takes it upon himself to save Jane from this and Emma reacts jealous to a rumour that he might be her secret admirer. Frank however is soon forced to return back to his sick aunt and Emma realises that she doesn't miss him all that much.Mr. Elton arrives from Bath with his new wife Augusta, an arrogant and overbearing but rather rich woman, who instantly enters rivalry with Miss Woodhouse. During a ball initiated by the also returned Frank, Elton flat out refuses to dance with Harriet. Mr. Knightley witnesses this and asks for her hand instead which she happily accepts. Emma is grateful for his kindness and finally admits that he was right all along. They dance together. After Harriet is saved by Frank from an attack in brought daylight, Emma imagines that he could be the right man for her friend. And to her surprise Harriet confesses that she indeed has a new crush, for a man who had done her a great service. Convinced her wish has come true, Emma encourages her in the pursuit of Churchill. During a garden party at Knightleys home estate of Donwell Abbey, emotions seem to boil over when Jane Fairfax flees from the overbearing Mrs. Elton trying to find her a governess position. Little later Frank arrives also in a bad mood. Emma reminds him of a picnic they have planned for Box Hill. The next day Emma, Frank, Miss Bates, Jane, the Eltons and Mr. Knightley arrive at their destination. Churchill, seemingly trying to make up for his behaviour the previous day, flirts shamelessly with Emma and teases Jane, which gets Knightley to warn Emma of connections she might not understand. Finally the tensions escalate, when Emma unwittingly insults Miss Bates. A furious Knightley scolds her on the way to the carriage and leaves her in tears. The next morning an ashamed Emma visits the Bates house where she is informed that Jane has taken ill, but has finally accepted a position as a governess. On her return to Hartfield, she finds Mr. Knightley with her father, who is on his way to London. His attitude towards her softens when he hears of her visit, but he still leaves.News spread that Mrs. Churchill died and little later Emma is called to the Westons, who try to gently break it to her that Frank is engaged to Miss Fairfax. They had been secretly a couple all along, but had to wait for his aunts death to make it official. Though Emma can assure them that she was not in love with Mr. Churchill, she is angry about his deceit and fears that the news will break Harriet's heart all over. Her friend however is confused as the man she referred to wasn't Frank Churchill but George Knightley and states that she believes him to returns her feelings. Shocked Emma realises that there had been some rather gentle gestures between the two and also that she is jealous as she is in love with Knightley herself.While walking in the garden the next day Miss Woodhouse is surprised to find Mr. Knightley approaching her, who has returned after hearing the news of the engagement. He believes her to be heartbroken and tries to console her but she informs him that she was only flattered by Franks attention rather than attached to him. After Knightley airs his anger about Churchill he admits that he envies him. Emma resolves broken hearted that she owes their friendship to listen to him even in announcing his engagement to Harriet, but what she hears is a confession of love for her, Emma. She admits that she returns his feelings and they kiss.When Emma tries to break the news of her own engagement to her friend she finds that Harriet has finally followed her heart and gotten engaged to Mr. Martin, who she had been in love with all along. Knightley decides to move to Hartfield as to not inconvenience Mr. Woodhouse, who under this light gives his approval. The society of Highbury celebrates their various marriages and engagements together with a successful harvest at Donwell Abbey."}