{"mid": "EnemyAtTheGates", "IMDB_id": "tt0215750", "title": "Enemy at the Gates", "plot": "In 1942, following the invasion of the Soviet Union the year before, Vasily Zaitsev (Jude Law), a shepherd from the Ural Mountains who is now a soldier in the Red Army, finds himself on the front lines of the Battle of Stalingrad. Forced into a suicidal charge by barrier troops against the invading Germans, he uses impressive marksmanship skills—taught to him at a young age by his grandfather—to save himself and commissar Danilov (Joseph Fiennes).\nNikita Khrushchev (Bob Hoskins) arrives in Stalingrad to coordinate the city's defences and demands ideas to improve morale. Danilov, now a senior lieutenant, suggests that the people need figures to idolise and give them hope, and publishes tales of Vasily's exploits in the army's newspaper that paint him as a national hero and propaganda icon. Vasily is transferred to the sniper division, and he and Danilov become friends. They also both become romantically interested in Tania Chernova (Rachel Weisz), a citizen of Stalingrad who has become a private in the local militia. Danilov has her transferred to an intelligence unit away from the battlefield.\nWith the Soviet snipers taking an increasing toll on the German forces, German Major Erwin König (Ed Harris) is deployed to Stalingrad to take out Vasily and thus crush Soviet morale. A renowned marksman and head of the German Army sniper school at Zossen, he lures Vasily into a trap and kills two of his fellow snipers, but Vasily manages to escape. When the Red Army command learns of König's mission, they dispatch König's former student Koulikov (Ron Perlman) to help Vasily kill him. König, however, outmaneuvers Koulikov and kills him with a very skillful shot, shaking Vasily's spirits considerably. Khrushchev pressures Danilov to bring the sniper standoff to a conclusion.\nSacha, a young Soviet boy, volunteers to act as a double agent by passing König false information about Vasily's whereabouts, thus giving Vasily a chance to ambush the major. Vasily sets a trap for König and manages to wound him, but during a second attempt Vasily falls asleep after many sleepless hours and his sniper log is stolen by a looting German soldier. The German command takes the log as evidence of Vasily's death and plans to send König home, but König does not believe Vasily is dead. The commanding German general takes König's dog tags to prevent Russian propaganda from profiting if König is killed. König also gives the general a War Merit Cross that was posthumously awarded to König's son, who as a lieutenant in the 116th infantry division was killed in the early days of the Battle for Stalingrad. König tells Sasha where König will be next, suspecting that the boy will tell Vasily. Tania and Vasily have meanwhile fallen in love and have sex in the Russian barracks at night. The jealous Danilov disparages Vasily in a letter to his superiors.\nKönig spots Tania and Vasily waiting for him at his next ambush spot, confirming his suspicions about Sasha. He then kills the boy and hangs his body off a pole to bait Vasily. Vasily vows to kill König, and sends Tania and Danilov to evacuate Sasha's mother (Eva Mattes) from the city, but Tania is wounded by shrapnel en route to the evacuation boats. Thinking she is dead, Danilov regrets his jealousy of Vasily and expresses disenchantment for his previous ardency of the Communist cause. Finding Vasily waiting to ambush König, Danilov intentionally exposes himself in order to provoke König into shooting him and revealing his hidden position. Thinking that he has killed Vasily, König goes to inspect the body, but realizes too late that he has fallen into a trap and is in Vasily's sights. He turns to face Vasily and takes off his hat, after which Vasily kills him. Two months later, after Stalingrad has been liberated and the German forces have surrendered, Vasily finds Tania recovering in a field hospital."}