{"mid": "Enemy", "IMDB_id": "tt2316411", "title": "Enemy", "plot": "We hear in voice-over the main character's mother leaving a voice-mail message. She says that shes worried about him and doesn't like the look of his apartment.Jake Gyllenhaal's character (we don't know which one, but find out later it is likely the actor: Anthony Claire), opens a small package and removes a key. He opens a locked door and escorts another gentleman inside.The room is filled with men silently watching a girl on a stage, masturbating. The men are transfixed. Soon two women come on stage wearing nothing but high-heeled shoes. One sets down a covered silver tray. The lid is lifted to reveal a tarantula. One of the women raises her foot over the creature, as if to step on it.Adam Bell is teaching a college history class, his main subject matter revolves around topics of Dictatorship control and how history has a tendency to repeat itself. Later that night his girlfriend comes over and they engage in casual sex. A few scenes occur in which to suggest his life is a series of repetitive patterns. The next day after teaching class, while in the teachers lounge a colleague has a suggestion for a movie he might find interesting. Adam rents the movie on the way home. His girlfriend, Mary, is tired and goes to bed. Adam stays up late and watches the movie. Adam goes to bed, and has rough sex with Mary. She gets mad, and storms out of the apartment. He wakes up realizing that he saw his doppelganger in the film.Adam researches the movie and after searching on-line he finds that the actor works through an agency in his city. When he goes to the agency, the security guard greets him as \"Anthony Claire\" and gives him an envelope addressed to the actor's home.Adam goes to the apartment where the actor lives, but he doesn't go inside. He calls from a pay phone and the person who answers the phone is Anthony's wife; Helen. She assumes it's her husband but she doesn't understand why he's acting so strange. A few hours later Adam calls again and Anthony answers the phone. Anthony tells Helen it was just a strange fan. Helen doesn't believe him and accuses him of cheating on her.Helen looks up Adam Bell and sees he's a teacher. She goes to the college hoping to find Adam and is shocked when she meets him and he doesn't show any recognition of who she is.Anthony has agreed to meet Adam and they meet at a hotel. Standing in the same room, they are identical - right down to the same birthmark. Adam is reserved, nervous and bookish while Anthony is hot-headed and sexually confident. Before Adam leaves, he gives Anthony the letter, but its remains unopened.Anthony follows Mary around town; he becomes frustrated because of his strong sexual desire for Mary.Anthony goes to have a talk with his mother, thinking he has a twin brother that she never told him about. She denounces the idea of a twin brother and wants to not hear any more about it. She tells him that shes proud that he has a respectable job and a nice apartment and that it was a good idea for him to stop being a third rate movie actor. In the following scene, a giant tarantula lurks among the skyscrapers of Toronto.At another meeting, Anthony accuses Adam of fucking his wife!\" Even though Adam denies it, Anthony demands they swap identities for a night, so that Anthony can have a fling with Mary. Once this occurs they will be even and Anthony will disappear from Adam's life forever.While Anthony is with Mary, Adam heads over to Anthony's apartment. He is let in by a security guard, who is eager for another trip to the \"club\". Adam isn't quite sure what hes talking about but he plays along. After being inside the apartment, Adam takes off his clothes and switches to something Anthony would wear.At a hotel, Mary is with Anthony (thinking it's Adam). Mary panics when she sees the mark where Anthony's wedding ring usually sits and demands to know who he is, as her boyfriend doesn't wear a ring. She demands Anthony drive her home.Helen suspects it's Adam and not Anthony, but she doesn't care. All she really wants is the husband of her baby to be with her. Slowly they bond with each other and make love.While driving, Anthony and Mary get into a heated argument. The car swerves and wrecks violently against the curb, killing them both.Adam wakes up the next morning looking very content. He leaves the bedroom and opens the letter with the key inside. He knows it's a symbol of his cheating nature and he is unable to resist. He calls to \"his\" wife telling her he plans to go out for the night. When she doesn't answer, he goes to her room but Helen is not there, it's a giant tarantula. The movie ends with a shot of him; his expression isn't that of someone who is scared, rather someone who knows he must come to terms with the fact that he is no longer free to give into temptation.Roll Credits"}