{"mid": "EnglishVinglish", "IMDB_id": "tt2181931", "title": "English Vinglish", "plot": "Shashi Godbole (Sridevi) is a housewife who makes and sells laddoos as a home-run business. Her husband Satish (Adil Hussain) and daughter Sapna (Navika Kotia) take her for granted, mock her poor English skills and generally treat her with disrespect, making Shashi feel negative and insecure. However, her young son, Sagar (Shivansh Kotia) loves her as she is, and her mother-in-law (Sulabha Deshpande) offers her words of sympathy.\nShashi's older sister Manu (Sujatha Kumar), who lives in New York, invites Shashi's family to her daughter Meera's (Neeju Sodhi) wedding to Kevin (Ross Nathan). It is decided that Shashi will go to New York alone to help Manu organize the wedding, and her husband and children will join her as the wedding approaches. During her flight to New York, Shashi is given inspirational advice by a fellow passenger (Amitabh Bachchan in Hindi/Ajith Kumar in Tamil). While Shashi is in New York, she has a traumatic experience at a coffee shop due to her inability to communicate in English, but is comforted by the shop's French chef Laurent (Mehdi Nebbou). Using the money she made from selling laddoos, she secretly enrolls in a conversational English class that offers to teach the language in four weeks, showing her resourcefulness at navigating an unfamiliar city alone. The class comprises: David Fischer, the instructor (Cory Hibbs); Eva, a Mexican nanny (Ruth Aguilar); Salman Khan, a Pakistani cab driver (Sumeet Vyas); Yu Son, a Chinese hairstylist (Maria Romano); Ramamurthy, a Tamil software engineer (Rajeev Ravindranathan); Udumbke, a young African-Caribbean man (Damian Thompson); and Laurent. Shashi quickly becomes a promising and committed student, earns everyone's respect with her charming behavior and her cuisine, and gains self-confidence. Laurent becomes attracted to Shashi. When he tries to kiss her at the rooftop of a building, Shashi rejects him and runs off, but fails to explain that she is married.\nMeanwhile, Shashi's niece Radha (Priya Anand) who is Meera's younger sister finds out about her secret English classes and is supportive of her pursuit. Shashi starts watching English films at night and does her homework assiduously. To complete the English-speaking course and get a certificate, each student must write and deliver a 5-minute speech. Shashi's family joins her in New York earlier than planned, to surprise Shashi. Shashi tries to continue attending class, but decides to quit because of scheduling conflicts, and asks Radha to inform Fischer. The test date coincides with that of the wedding, and Shashi is forced to miss the test.\nRadha invites Fischer and the entire class to the wedding, where Satish is taken aback at being introduced to a diverse group of people by his wife. Shashi gives a touching and enlightening toast to the married couple in English, surprising everyone who knew her as a typical, conservative, Indian housewife. In her speech, Shashi extols the virtues being married and having a family, describing the family as a safe space of love and respect where weaknesses are not mocked. Satish and Sapna regret treating her with disrespect. Fischer declares that she has passed the course with distinction and issues her the certificate. Shashi thanks Laurent for \"making her feel better about herself\". Shashi's family return to India; during their flight home, Shashi asks the flight attendant in fluent English whether she has any Hindi newspapers."}