{"mid": "EnterTheDragon", "IMDB_id": "tt0070034", "title": "Enter the Dragon", "plot": "Lee (Bruce Lee), a highly skilled Shaolin martial artist from Hong Kong is approached by Braithwaite, a British intelligence agent investigating suspected crime lord Han (Shih Kien). Lee is persuaded to attend a high-profile martial arts competition on Han's private island in order to gather evidence that will prove his involvement in drug trafficking and prostitution. Shortly before his departure, Lee also learns that his sister's killer, O'Hara (Robert Wall), is working as Han's bodyguard on the island. Also fighting in the competition are indebted gambling addict Roper (John Saxon) and fellow Vietnam war veteran Williams (Jim Kelly).\nAt the end of the first day, Han gives strict orders that the competitors do not leave their rooms. Lee makes contact with undercover operative Mei Ling (Betty Chung), and sneaks into Han's compound looking for evidence. He is discovered by several guards, but manages to escape. The next morning, Han has the guards publicly killed by chief guard Bolo (Bolo Yeung) for failing him. After the execution, Lee faces O'Hara in the competition and after an emotional battle ends up killing him. With the day's competition over, Han confronts Williams – who had also left his room the previous night to exercise – about the identity of the intruder, and beats him to death when he refuses to cooperate. Han then reveals the scale of his drug operation to Roper in the hope that he will join his organization. He also implicitly threatens to imprison Roper, along with all the other martial artists who competed in Han's tournament in the past, if Roper refuses. Despite being initially convinced, Roper refuses after learning Williams' fate.\nLee sneaks out again that night and manages to send a message to Braithwaite, but is finally captured after a protracted battle with the guards. The next morning Han arranges for Roper to fight Lee, but Roper refuses. As punishment, he is forced to fight Bolo instead but manages to overpower and kill him after a grueling encounter. Enraged by the unexpected victory, Han commands his remaining men to kill Lee and Roper. Facing insurmountable odds, they are soon aided by the island's prisoners, who had been freed by Mei Ling. Han escapes, pursued by Lee, who finally corners him in a hidden mirror room. The mirrors give Han an advantage, but Lee breaks all the room's mirrors to reveal Han's location, and eventually kills him. Lee returns to the main battle, which is now over. A bruised and bloodied Roper sits victorious while the military finally arrive to take control of the island."}