{"mid": "EnterTheVoid", "IMDB_id": "tt1191111", "title": "Enter the Void", "plot": "Oscar (Nathaniel Brown) lives in Tokyo with his younger sister Linda (Paz de la Huerta) and supports himself by dealing drugs, against the advice of his friend Alex (Cyril Roy), who attempts to turn Oscar's interest toward The Tibetan Book of the Dead, a Buddhist book about the afterlife. The first segment begins with Linda leaving for work (at a local strip club) and then follows Oscar's nightly routine through strict point-of-view shots, including momentary blackouts that represent blinking, private internal thoughts, and extended sequences of a DMT-induced hallucination.\nNext, Alex meets Oscar at the apartment and they leave so that Oscar can deliver drugs to his friend Victor (Olly Alexander). On the way, Alex explains parts of The Tibetan Book of the Dead to Oscar: how the spirit of a dead person sometimes stays among the living until it begins to experience nightmares, after which it attempts to reincarnate. They arrive at a bar called The Void. Oscar enters alone and sits down with a distressed Victor, who mutters \"I'm sorry\" before they are swarmed by police officers. Oscar seals himself in a bathroom stall and attempts to flush his drugs. When the flush does not work, he yells through the door that he has a gun and will shoot. In response, a police officer opens fire and hits Oscar, who falls to the floor.\nOscar's viewpoint rises and looks at his body from above, and then we begin to witness his life in a roughly chronological order. His loving parents were killed in a violent car crash; Oscar and Linda, devoted to each other, were sent to different foster homes; Oscar moved to Tokyo and earned money through drug dealing until he could afford to bring Linda to live with him; Oscar sleeps with his friend Victor's mother in return for extra money to help bring his sister over; Linda found work as a stripper for the nightclub owner Mario, to Oscar's distress; Oscar increased the scope of his dealing operations and started using potent psychedelics—in particular, DMT—more frequently; Alex discovered that Oscar slept with Victor's mother; and finally, we again see Oscar meet Victor at The Void to sell him drugs, only to be shot in the bathroom.\nAfterwards, a disembodied Oscar floats over Tokyo and witnesses the aftermath of his death. Linda becomes withdrawn and despondent, especially after getting an abortion; Oscar's dealer, Bruno, destroys his stash; Alex lives in hiding on the streets; and Linda wishes she would have been with Alex instead of Mario, as Oscar had wanted. On one occasion, Linda wishes that Oscar would come back to life; Oscar then enters Linda's head, and experiences her dream in which he wakes up at the morgue, from which his body is taken to be cremated.\nMeanwhile, Victor and his mother scream at each other because she had had sex with Oscar, and because of that Victor had informed the police about Oscar's drug dealing; Victor is then thrown out of his parents' home. He shows up at Linda's apartment and apologizes for having had her brother killed, but says Linda is partially to blame since she hung around with creeps. This angers Linda, who repeatedly screams that Victor should just go kill himself.\nThe perspective now hovers high above Tokyo and enters an airplane, where Oscar's mother breast-feeds a baby to whom she whispers Oscar's name. The view then drops to Linda and Alex, who take a taxi to a Tokyo love hotel and have sex. The perspective moves among hotel rooms and observes several other couples having sex in various positions. Each couple emanates a pulsating electric-like pink glow from their genitals. Oscar enters Alex's head and witnesses the sex with Linda from Alex's point of view. He then travels inside Linda's vagina to witness Alex's thrusting, then observes his ejaculation and follows the semen into the fertilization of his sister's ovum. The final scene is shot from the perspective of a baby being born to Oscar's mother. (According to the director, this is a flashback to Oscar's own birth in the form of a false memory)."}