{"mid": "EscapeFromSobibor", "IMDB_id": "tt0092978", "title": "Escape from Sobibor", "plot": "The film begins with a new trainload of Polish Jews arriving for processing at Sobibor. The German Commandant gives them a welcoming speech, assuring the new arrivals that the place is a work camp. Other SS officers move along the assembled lines of prisoners, selecting a small number who have trade skills (such as goldsmiths, seamstresses, shoemakers, and tailors). The remaining prisoners are sent away to a different part of the camp from which a pillar of smoke rises day and night. It is some time before the new prisoners realize Sobibor is a death camp, all of the other Jews are exterminated in gas chambers, and their corpses are cremated in large ovens. The small number of prisoners who are kept alive in the other part of the camp are charged with sorting the belongings taken from those who are murdered and then repairing the shoes, recycling the clothing, and melting down any silver or gold to make jewelry for the SS officers. Despite their usefulness, these surviving prisoners' existence is precarious, and beatings and executions can occur at any time.\nGustav Wagner is the most clever and sadistic of the German officers. When two prisoners escape from a work detail in the nearby forest, Wagner forces the remaining 13 prisoners of the work gang to each select one other prisoner to die with them and then executes all 26.\nThe leader of the prisoners, Leon Feldhendler, realizes when the trains eventually stop coming, the camp will have outlived its usefulness, and all the remaining Jews will be executed. He devises a plan for every prisoner to escape, by luring the SS officers and NCOs into the prisoners' barracks and work huts one by one and killing them as quietly as possible. Once all of the Germans are dead, the prisoners will assemble into columns and simply march out of the camp as if they have been ordered to, and it is hoped the Ukrainian Guards, not knowing what is going on and with no Germans left alive to give orders or raise the alarm, will not interfere. A new group of prisoners arrives, Russian Jews who were soldiers with the Soviet army. Their leader, Perchersky, and his men willingly join the revolt, their military skills proving invaluable.\nThe Camp Commandant leaves for several days, taking Wagner with him, which proves an advantage as the most cunning of the SS officers will be absent from Sobibor. On 14 October 1943, the plan goes into action. One by one, SS officers and NCOs are lured into traps set by groups of prisoners armed with knives and clubs. Eleven Germans are killed, but one officer, Karl Frenzel, unwittingly evades his killers, discovers the corpse of one of his colleagues, and raises the alarm. By now, the prisoners have assembled on the parade ground and, realizing the plan has been discovered, Perchersky and Feldhendler urge the prisoners to revolt and flee the camp. Most of the 600 prisoners stampede for the perimeter fences, some of the Jews using captured rifles to shoot their way through the Ukrainian guards. Other guards open fire with heavy machine guns from observation towers, cutting many of the fleeing prisoners down, and other would-be escapees are killed on the minefield surrounding the camp. But over 300 Jews reach the forest and escape.\nAs the survivors flee deeper into the forest, a voiceover narrator tells of the experiences and fates that befell some of the survivors whose accounts the film was based on. Of the 300 prisoners who escaped, only approximately 50 survived to see the end of the war in 1945. For example, Perchersky makes it back to Soviet lines and rejoins the Red Army, surviving the war, and Feldhendler lives to see the end of the war but is killed shortly afterwards in a clash with anti-Semitic Poles. After the uprising, the largest escape from a prison camp of any kind in Europe during World War II, Sobibor was bulldozed to the ground, and trees were planted on the site to remove any sign of its existence."}