{"mid": "EscapeFromAlcatraz", "IMDB_id": "tt0079116", "title": "Escape from Alcatraz", "plot": "On January 18, 1960, Frank Morris (Clint Eastwood) arrives at the maximum security prison Alcatraz. Soon after arriving, he is sent in to meet the warden (Patrick McGoohan), who curtly informs him that no inmate has ever successfully escaped from Alcatraz. Among the inmates, Morris makes acquaintances with the eccentric Litmus, (Frank Ronzio) who is fond of desserts, English (Paul Benjamin), a black inmate serving two life sentences for killing two white men in self-defense and the elderly artist and chrysanthemum grower Doc (Roberts Blossom).\nMorris also makes an enemy of the rapist Wolf (Bruce M. Fischer), who harasses him in the showers and later attacks him in the prison yard with a knife; both men spend time in the hole. When the warden discovers that Doc has painted an ungainly caricature of him, as well as other policemen on the island itself, he permanently removes Doc's painting privileges; in response, a depressed Doc hacks off his own fingers with a hatchet from the prison workshop and is led away. Later, Morris meets bank robber brothers John and Clarence Anglin (Fred Ward and Jack Thibeau), who are his old friends from another prison sentence, and he makes the acquaintance of the prisoner in the cell next to his, car thief Charley Butts (Larry Hankin). Later, during mealtime, Morris places one of Doc's chrysanthemums at the table in honor of Doc, but the warden stops by and crushes it. Litmus is enraged, but as he reaches out to grab the warden, he suffers a fatal heart attack. The warden coldly reminds Morris that \"some men are destined never to leave Alcatraz—alive.\"\nMorris notices that the concrete around the grille in his cell is weak and can be chipped away, which evolves into an escape plan. Over the next few months Morris, the Anglins and Butts dig through the walls of their cells with spoons (which have been soldered into makeshift shovels), make papier-mâché dummies to act as decoys, and construct a raft out of raincoats. On June 11, 1962, the inmates decide to leave. Wolf has been released from solitary confinement and prepares to stab Frank with a knife, but English is able to intercept him. That night, Frank, John, Clarence and Charley plan to meet in the passageway and escape. Charley panics and fails to rendezvous with them. Carrying the flotation gear, Frank and the brothers access the roof and avoid the searchlights. From there, they scramble down the side of the building into the prison yard, climb over a barbed-wire fence and make their way to the shoreline of the island where they inflate the raft. The three men enter the water; partially submerged, they cling to the raft and use their legs as the primary propelling force and kicking. When their escape is discovered the following morning, a massive manhunt ensues. The warden does not want to blemish his perfect record and insists that the men drowned, despite no bodies being found. On a rock on the shore of Angel Island, he finds a chrysanthemum and throws it in the water after being told that they do not grow there."}