{"mid": "EscapeFromThePlanetOfTheApes", "IMDB_id": "tt0067065", "title": "Escape from the Planet of the Apes", "plot": "The preceding film, Beneath the Planet of the Apes, ends with the apes' future Earth being destroyed by a nuclear weapon.\nEscape from the Planet of the Apes begins by establishing that three apes—Cornelius (Roddy McDowall), Zira (Kim Hunter), and Dr. Milo (Sal Mineo)—escaped the Earth's destruction by salvaging and repairing Taylor's spaceship and piloting it through the shock wave of Earth's destruction, sending the ship through a time warp. The salvage, repair and launch all happen off-camera during the final act of the previous film.\nThe apes arrive on Earth in 1973, splashing down off the Pacific coast of the United States. They are transported to a secluded ward of the Los Angeles Zoo, under the observation of scientists Dr. Stephanie Branton (Natalie Trundy) and Dr. Lewis Dixon (Bradford Dillman). The apes decide not to let the humans know that they can speak. They also agree not to let them know that Earth will be destroyed because of the Ape War. Later, the apes' power of speech is revealed when Zira becomes impatient during an experiment. Soon after, Dr. Milo is killed by a zoo gorilla who becomes agitated during an argument amongst the three chimpanzees. Lewis tries to communicate with the apes that he is peaceful and he wishes to treat them as equals, and Cornelius and Zira form a friendship with him and Dr. Branton.\nA Presidential Commission is formed to investigate the return of Taylor's spaceship and determine how atypically intelligent apes came to be aboard it. The apes are brought before the Commission, where they publicly reveal their ability to speak. The council asks them about Taylor, but Cornelius and Zira tell them that they know nothing about him. They reveal that they came from the future and escaped Earth when war broke out. They are welcomed as guests of the government. Cornelius and Zira secretly tell Stephanie and Lewis that they did know about Taylor, explain how humans are treated in the ape-dominated future, and about the Earth's destruction. Stephanie and Lewis are shocked but still sympathetic. They tell Cornelius and Zira to keep this information secret until they can gauge the potential reaction of their hosts.\nThe apes become celebrities, and are lavished with gifts and media attention. They come to the attention of the President's Science Advisor Dr. Otto Hasslein (Eric Braeden), who discovers Zira is pregnant. Fearing for the future of the human race, he offers her champagne (which she has developed a taste for) to loosen her inhibitions and questions her further. Her candid responses enable him to convince the Commission that Cornelius and Zira must be subjected to more rigorous questioning.\nHasslein insists that he simply wants to know how apes became dominant over men. Cornelius reveals that the human race will cause its own downfall and become dominated by simians, and that simian aggression against humans will lead to Earth's destruction by a weapon made by humans. Zira explains that the gorillas started the war, and the orangutans supported the gorillas, but the chimpanzees had nothing to do with it. Hasslein suspects that the apes are not speaking the whole truth.\nDuring the original hearing, Zira had accidentally revealed that she dissected humans in the course of her work. Hasslein orders Lewis to administer a truth serum to her while Cornelius is confined elsewhere. Lewis assures Zira that the serum will have the same effect as champagne. As a result of the serum, Hasslein learns details about Zira's examination and experimentation on humans.\nZira joins Cornelius in confinement while Hasslein takes his findings to the President (William Windom). Cornelius labels Hasslein and the others savages for their treatment of Zira. Zira reminds Cornelius that she did the same thing to humans and Taylor called them savages. Zira is relieved to have revealed the truth because she was tired of lying. Cornelius fears that the truth will get them killed. An orderly refers to their unborn child as a \"little monkey\"; Cornelius, having previously expressed his disgust at that term, loses his temper and knocks a food tray out of the orderly's hands. The orderly falls to the floor; Cornelius believes that the man is only unconscious, but he is actually dead. Hasslein uses the tragedy in support of his claim that the apes are dangerous to humanity, and he calls for their execution. The President reluctantly orders that Zira's pregnancy be terminated and that both apes be sterilized, but will not endorse punishment for the orderly's death until due process has been served. Branton and Dixon help the apes to escape, and find them shelter in a circus run by Señor Armando (Ricardo Montalbán), where an ape named Heloise has just given birth. Zira gives birth to a son, whom she names Milo, in honor of their deceased friend.\nHasslein, knowing that Zira's labor was imminent, orders a search of all circuses and zoos. Armando insists that for their own safety the apes must not stay. Lewis gives Cornelius a pistol. Cornelius, formerly a pacifist, accepts the pistol knowing he may have to use it as a last resort. The apes take refuge on an abandoned ship in Los Angeles Harbor. Hasslein tracks them there, and finds Zira resting with an infant. Hasslein shoots Zira after she refuses to hand over the infant, and then fires several shots into the infant. Cornelius returns fire and kills Hasslein. Cornelius is shot by an unseen sniper and falls. Zira tosses the dead baby over the side and crawls to die with her husband, witnessed by a grieving Lewis and Stephanie.\nArmando reveals that Zira and Cornelius switched babies with the common ape Heloise before their escape, and also assures the infant Milo that he will take care of him forever. When Armando leaves him alone, Milo plaintively asks for his mother."}