{"mid": "EscapeFromTomorrow", "IMDB_id": "tt2187884", "title": "Escape from Tomorrow", "plot": "A montage shows visitors on the rides at Walt Disney World Resort and the many visuals and animatronics that accompany the rides. It ends with a man losing his head while riding Big Thunder Mountain Railroad. On the last day of a family vacation at Walt Disney World, Jim White gets fired by his boss during a phone call on the balcony of the Contemporary Resort Hotel with his family. He keeps the news to himself to avoid spoiling their vacation. The family leaves their room and takes the monorail to the park, alongside two French teenagers, Isabelle and Sophie.\nThe chance encounters with the girls increase interests and Jim begins to pursue them, he has disturbing visions during the rides, such as the evil faces of audio-animatronic characters and his family talking badly. After fighting with Emily, Jim decides to not to take Elliot to Space Mountain (which gives Elliot motion sickness) in order to keep chasing after the French girls, Jim takes his daughter Sara to the Magic Kingdom and keeps tracking the girls, while Emily and Elliot return to the hotel. Later, the son of a wheelchair-bound man, whom Jim spotted earlier, shoves Sara, who scrapes her knee. Jim takes her to the park nurse to have Sara's knee recovered. Jim and Sara meet a mysterious woman with a glimmering amulet necklace which hypnotizes Jim. He blacks out and regains consciousness mid-coitus with the woman in her room. Afterwards, she claims that the parks' wholesome, costumed princesses are actually part of a secret prostitution ring that services \"Rich Asian Businessmen\". Increasingly unnerved, Jim and Sara joins his wife and son at the pool, where Jim sees the French girls. He swims closer to converse with them, but Emily sees and berates him.\nHis family returns to Epcot, where the tension between Jim and Emily comes to a head after a drunk Jim vomits while on the Gran Fiesta Tour. Spotting the French girls, Emily argues with Jim about his obvious interest in them and slaps Sara. Embarrassed, she returns to the hotel with Elliot, leaving Jim and Sara to ride on the Soarin' attraction at Spaceship Earth, where Jim imagines a beautiful topless woman superimposed over the ride's video footage of landscapes, who promises they will be together soon. After the ride, Sophie approaches and invites Jim to come with them. When Jim refuses, Sophie spits on his face and she walks off, Jim notices that Sara disappeared and searches frantically for her, but the park guards use a taser to knock him unconscious.\nJim awakes in a secret detention facility under Epcot's Spaceship Earth, where he sees video screens displaying pictures of the woman he imagined on the Soarin' ride and other images of events that happened earlier. A scientist enters and activates a Spaceship Earth resembling helmet, which covers Jim's head and scans him while images of what the scientist refers to as \"the real Jim\" appear on the screens, being himself dressed differently and apparently part of another family. The scientist discusses Jim's flights of fantasy and imagination and reveals that he is part of the experiment by the Siemens Corporation ever since he first went to the theme park as a child with his father. His boss is in on the conspiracy and his firing was all part of the plan, and so was the closure of the Buzz Lightyear ride just as he and Elliot approached the boarding area, much to Elliot's distress. The scientist also tells Jim that he had turned in Elliot to them, like Jim's father had done to him as a child.\nAfter damaging the instrument panel with a medical ointment and decapitating the scientist, who turns out to be an android, Jim escapes from the laboratory through the sewer. While searching for Sara, Jim trips next to the wheelchair-bound man, suspects and attacks him. After realizing that he caused a scene and doubts the man's involvement, he returns to the room of the woman, where he discovers she has captured Sara, now wearing a Snow White costume. The woman rambles about her time as a character princess and tells him how bad things happen everywhere, including the decapitation at the park. She again hypnotizes Jim with the necklace, but Sara pulls it off and smashes it, freeing Jim from her spell. He returns to his hotel room and puts his family to bed. Jim suffers with digestive distress, vomits up a large amount of blood and hairballs, which he recognizes as symptoms of the cat flu and realizes that Sophie infected him. He begins to panic and bleed uncontrollably in the bathroom. Elliot enters and Jim begs him for help, but he closes the door on him.\nThe next morning, Emily finds Jim's corpse, which now has cat eyes and a grinning face. Disney cleaning staff arrive to remove proof of death and fill Elliot's head with false memories of riding the Buzz Lightyear attraction. They take Jim's body to the unmarked white van from the opening. Meanwhile, the valet from the video screens greets the \"real Jim\", accompanied by the fantasy woman and a young girl, before they check into the hotel as the valet watches the van drive away."}