{"mid": "EuropaEuropa", "IMDB_id": "tt0099776", "title": "Europa Europa", "plot": "=== Nazi Germany ===\nSolek (a nickname for Solomon, also called \"Solly\") and his family live in Nazi Germany. On the eve of Solek's bar mitzvah, Kristallnacht occurs. He escapes, naked, then hiding in a barrel. At night, he calls his acquaintance to bring him clothes from his house. She refuses, but throws him a leather jacket with a swastika band on its arm. He comes back home. His family is together at home, but his sister is killed by Nazis. The father, who was born in Łódź, Poland, decides to go back there.\n=== Poland ===\nThe Perel family (Solek, his parents, his two brothers, David and Isaak) decides to move to Łódź, central Poland, where the family believes it will be safe. Solly causes criminal damage and the police are called. Living in Łódź, Solly meets Kasia, a cashier working in a cinema. Thanks to her, Solly can go to the cinema without paying for tickets. Later, they establish a romantic relationship. However, less than a year later, World War II begins with Germany invading the western Polish borders. Solly is happy that the criminal case will be forgotten, since the police will have more important issues to solve. Solek's family decides he and his brother should leave for the European East. Solek meets hysterically upset Kasia, but his brother separates them. Isaak and Solek flee, towards the eastern border of Poland, which soon has been invaded by the Soviet Union. (In an ironic scene, as Solek and other Jewish refugees cross a river in a small boat, while a boat carrying Polish refugees fleeing the Soviets passes in the opposite direction, Solomon explains in an internal monologue that the Jews, fearing Nazi persecution, fled toward the Soviets, while the Poles, who feared the Soviets more, fled toward the Germans.) The brothers are separated and Solek is placed in a Soviet orphanage in Grodno with other Polish refugee children.\n=== Soviet Union ===\nSolek lives in the orphanage for two years, where he joins the Komsomol and receives Communist education. Being a teenager, he has a romantic interest in Inna, a young and attractive instructor who defends him when the authorities at school discover that his class origin is bourgeois. He even climbs outside the building to watch her in her bedroom. One scene features a Russian version of the German Communist song Dem Morgenrot Entgegen (\"Towards The Dawn\") before mail call, where Solek receives a letter from his parents who have been re-settled in a ghetto.\n=== Nazi-occupied Soviet Union ===\nThen, with the crash of a bomb, Germany invades the Soviet Union. The orphanage is evacuated, but Solek is left behind, to be found by German soldiers. Solek gets rid of his identity papers, and tells the Germans he is \"Josef Peters\", a Volksdeutscher (ethnic German) from a Baltic German family in Latvia. Although he does not respond to his made up name, the soldiers deduce that he was in the orphanage because his parents were killed by the Soviets, and promise him vengeance. When the unit captures Yakov Dzhugashvili, the son of Joseph Stalin, with Solly's help translating Russian, they declare \"Jupp\" to be their \"good-luck charm\", and adopt him as an auxiliary. Thanks to his fluent German and Russian, he becomes their cultural guide and interpreter. He accompanies the unit for several weeks, and sees all the horrors of war, including murdered civilians, as the Germans seek to crush Soviet resistance.\nNonetheless, Solek is still in danger. He cannot let anyone see him bathing, because his circumcised penis would expose \"Jupp\" as a Jew. Robert, one of the soldiers who is homosexual, sneaks in on \"Jupp\" when he finally manages a private bath. Solek rejects Robert's advances but knowing that both of them have secrets the Nazis would kill them for, they become close friends.\nThen a bizarre combat incident occurs. Robert is killed and Solek, left alone, tries to get to the Soviet lines. As he crosses a bridge, the unit charges across behind him, and the Soviet troops there surrender. \"Jupp\" is hailed as a hero.\nThe company commander decides that \"such a fine young German\" should be properly educated. He is childless himself, so he tells \"Jupp\" that he will adopt him and that \"Jupp\" will be sent to the elite Hitler Youth Academy in Berlin where he is to receive Nazi education. (This is much to Solek's consternation but of course he cannot refuse.)\nHe is escorted for much of the trip by Rosemarie, a middle-aged female Nazi official. Rosemarie thinks \"Jupp\" resembles Hitler and observes that he even has the same birthday. On the train, she makes \"Jupp\" have sex with her, crying out \"Mein Führer!\" as they have intercourse.\n=== Nazi Germany ===\nAt the school, \"Peters\" is introduced to the other boys as a heroic combat veteran. The problem of concealing his circumcision continues, and Solek uses string and rubber bands in various painful ways to simulate a foreskin. He evades a medical examination by pretending to have a violent toothache, and then must endure having the dentist pull it without anesthetic.\nGirls from the Bund Deutscher Mädel (League of German Girls, the female equivalent of the Hitler Youth) serve meals at the Academy. Leni, one of these girls, becomes infatuated with \"Jupp\", but he dares not take advantage - Leni is a fervent Nazi and even speaks of wanting to kill Jews. Leni strongly hints that she would happily bear \"Jupp\"'s child, but after a particularly venomous anti-Jewish remark he refuses any intimacy. She calls him a Schlappschwanz (\"limp-dick\"), and they break off.\nA less serious threat is the visit to the Academy of a Nazi \"expert\" in \"racial science\", who claims particular skill in detecting Jews. The Nazi selects \"Jupp\" as his subject for a demonstration, and carefully measures his head and face. He then calculates \"Jupp\"'s anthropometric indexes, and pronounces him mixed but \"pure Aryan stock\", to Jupp's relieved surprise. Soon after, while working in a factory for the war effort, Jupp and his classmates learn that the Sixth Army has fallen at Stalingrad.\nAfter several months without seeing Leni, Solek visits Leni's mother, who does not sympathize with the Nazis. She tells him Leni is pregnant and intends to \"give the child to the Führer\", in the Lebensborn program. Solek realizes that the child's father is his best friend and classmate Gerd. When Leni's mother presses Josef on his identity, he breaks down and confesses that he is a Jew; she tells him that she suspected that and promises not to betray him. Leni never finds out.\nSolek's pretense is nearly exposed when the Gestapo investigates \"Jupp\"'s supposed parentage. He is summoned to Gestapo offices, but cannot show a Certificate of Racial Purity, which he claims is in Grodno. The Gestapo official says he will send for it, and then rants about how the war will be won by Hitler's Wunderwaffen (\"wonder weapons\"). As Solek leaves, the building is destroyed by Allied bombs. Solek's relief is tempered by Gerd's death in the bombing.\n=== Soviet-occupied Nazi Germany ===\nAs Soviet troops close in on Berlin, the Hitler Youth at the school are sent to the front. There Solek manages to surrender. His captors refuse to believe that he is a Jew. \"If you're a Jew, why don't you look like this? Look!\" demands a Soviet officer as he shows Solek photos of murdered Jews from the death camps they had liberated. Jupp had not been aware this was going on. They are about to have Solek shot by an elderly Communist political prisoner (wearing a red triangle on his camp uniform) when Solek's brother Isaak, just released from a concentration camp, identifies Solek and saves him. Before leaving the camp, Isaak tells Solek to never reveal his story to anyone, saying it would never be believed. He is released shortly thereafter and emigrates to the British Mandate of Palestine, the future state of Israel, where he embraces his Jewish heritage. The films ends with the real Solomon Perel, as an old man, singing a Jewish folk song taken from the Book of Psalms (\"Hine Ma Tov,\" Psalm 133:1)."}