{"mid": "Everafter", "IMDB_id": "tt0120631", "title": "EverAfter", "plot": "In 19th century France, a Grande Dame (Jeanne Moreau) summons The Brothers Grimm (Joerg Stadler and Andy Henderson) to correct their interpretation of the Cinderella story. The Grande Dame reveals a glass slipper and tells them the \"true\" story of Danielle de Barbarac.\nHer story begins in the 16th-century. Danielle is eight years old when her father, Auguste de Barbarac (Jeroen Krabbé), marries the widow Baroness Rodmilla de Ghent (Anjelica Huston). He dies shortly after, leaving Danielle at the mercy of her step-mother. For the next ten years, Danielle (Drew Barrymore) acts as a household servant as the Baroness mismanages the estate into disrepair.\nWhile working outside early one morning, Danielle attempts to stop a man from stealing one of her family's horses. This man turns out to be Prince Henry (Dougray Scott), attempting to flee his royal responsibilities and an arranged marriage. He buys Danielle's silence with gold and continues to flee only to have his escape foiled when he chooses to assist a caravan being robbed by gypsies. The Royal Guard arrives, helps the caravan, and returns Henry to the Palace.\nDanielle uses the gold from the prince to disguise herself as nobility and buy back a long-term family servant sold by the Baroness to pay her debts. While at the palace, Danielle encounters the Prince again. He does not recognize her from earlier and is instantly intrigued by her. Henry and Danielle-in-disguise have several other chance encounters, during which they fall in love.\nThe King decrees that Prince Henry must choose a bride before a masquerade ball or follow through with his arranged marriage. Rodmilla discovers Danielle and Henry's romance and attempts to destroy it by informing the queen that Danielle is engaged and leaving the country. She then locks Danielle up to prevent her from attending the ball. Danielle manages to escape with the help of her friends and attends the ball anyway. While there, Rodmilla exposes Danielle's identity as a servant to Henry. Shocked and angry, Henry rejects Danielle.\nAfter the ball, the Baroness sells Danielle to their landowner. Henry chooses to go through with his arranged marriage. During the wedding, Henry realizes his fiancee is incredibly unhappy and calls off the wedding. He then learns of Danielle's situation and goes to rescue her, only to find out she has rescued herself. He then proposes using the glass shoe she lost when fleeing from the ball.\nIn the end, the Baroness and her daughters are summond to the Royal Court and punished accordingly for their treatment of Danielle and for lying to the Queen. Henry and Danielle live happily ever after according to the Grand Dame, who then informs the Brothers Grimm that Danielle was her great-great-grandmother."}