{"mid": "Evita", "IMDB_id": "tt0116250", "title": "Evita", "plot": "In a cinema in Buenos Aires on July 26, 1952, a film is interrupted when news breaks of the death of Eva Perón, Argentina's First Lady, at the age of 33. As the nation goes into public mourning, Ché, a member of the public, marvels at the spectacle and promises to show how Eva did \"nothing, for years\". The rest of the film follows Eva (born Eva Duarte) from her beginnings as an illegitimate child of a lower-class family to her rise to become First Lady and Spiritual Leader of the Nation of Argentina; Ché assumes many different guises throughout Eva's story.\nAt the age of 15, Eva lives in the provincial town of Junín, and longs for a better life in Buenos Aires. She persuades a tango singer, Agustín Magaldi, with whom she is having an affair, to take her to the city. After Magaldi leaves her, she goes through several relationships with increasingly influential men, becoming a model, actress and radio personality. She meets Colonel Juan Perón at a fundraiser following the 1944 San Juan earthquake. Perón's connection with Eva adds to his populist image, since they are both from the working class. Eva has a radio show during Perón's rise and uses all of her skills to promote him, even when the controlling administration has him jailed in an attempt to stunt his political momentum. The groundswell of support that Eva generates forces the government to release Perón, and he finds the people enamored of him and Eva. Perón wins election to the presidency and marries Eva, who promises that the new government will serve the descamisados.\nAt the start of the Perón government, Eva dresses glamorously, enjoying the privileges of being the First Lady. Soon after, she embarks on what is called her \"Rainbow Tour\" to Europe. While there, she receives a mixed reception. The people of Spain adore her, the people of Italy call her a whore and throw things at her, and Pope Pius XII gives her a small, meager gift. Upon returning to Argentina, Eva establishes a foundation and distributes aid. The film suggests the Perónists otherwise plunder the public treasury.\nEva is hospitalized and learns that she has cancer. She declines the position of Vice President due to her failing health, and makes one final broadcast to the people of Argentina. She understands that her life was short because she shone like the \"brightest fire\", and helps Perón prepare to go on without her. A large crowd surrounds the Casa Rosada in a candlelight vigil praying for her recovery when the light of her room goes out, signifying her death. At Eva's funeral, Ché is seen at her coffin, marveling at the influence of her brief life. He walks up to her glass coffin, kisses it, and joins the crowd of passing mourners."}