{"mid": "Evolver", "IMDB_id": "tt0112993", "title": "Evolver", "plot": "Teenage computer whiz Kyle Baxter (Ethan Randall) participates in a virtual reality version of laser tag and is about to win a nationwide tournament, only to be disrupted by another player, a girl named Jamie. Despite his loss, he hacks into the company's system to make himself the winner of the prize: \"Evolver\" (voiced by William H. Macy), a robotic opponent armed with a compressed air gun, to compete against in a real-world version of laser tag. Whenever Evolver is defeated, he \"evolves\", becomes smarter, quicker and harder to beat (to simulate rising game difficulty). Kyle, his friend Zach, Jamie and his sister, Ali begin playing with Evolver, and easily pass the first level. As Evolver evolves, he develops a human-like competitiveness and obsession with winning. He replaces his \"ineffective\" default ammo - soft foam balls - with ball bearings from Kyle's room.\nAfter learning Evolver has recording capabilities, Kyle and Zach send Evolver into the girls locker room at their school. Discovering the robot, the girls push Evolver into the boys locker room. He switches to game mode and enters the boys locker room and sees the only occupant - Dwight, a bullying jock - and makes Dwight another opponent. Dwight throws Evolver against a wall, to which the robot reacts by shooting out one of Dwight's eyes and knocking him down a flight of stairs, killing him.\nAfter getting home, Evolver continues to absorb negativity from his surroundings, for example swearing and hostage-taking from TV. Evolver is defeated again in the second game and \"evolves\" up to the third round. Zach, wanting to get the disc recording Evolver's adventures in the locker room, takes Evolver to his house and tries to manually remove the disc. Evolver turns on after the disc is removed and begins to attack Zach. Trapping him in his garage, Evolver chases after Zach with a saw blade and ultimately crushes him while Zach hides under a car (raised on a jack). While making his way back to Kyle's house, Evolver wanders into an arcade where two marijuana smoking teens are playing the Evolver virtual game. He electrocutes and kills them both.\nKyle comes to see Zach being loaded into an ambulance. Worried about Evolver's increasing lethality, Kyle looks through its programming and sees a program titled S.W.O.R.D. (acronym for Strategic War-Oriented Robotic Device). He goes to Cybertronix, the company that built Evolver and the virtual reality game, and the creator, Russell Bennett (John de Lancie), promises to look through the disc Evolver recorded. The disc shows Evolver killing Dwight and the danger becomes clear to Bennett. Meanwhile, Kyle and Jamie sneak into a lab at Cybertronix. Looking into Evolver's past, they learn that he was originally meant to be an AI military robot designed to infiltrate enemy encampments, adapt to the situation and eliminate targets, but the project was terminated.\nAt home, Ali puts back in Evolver's battery (which was removed by Kyle after learning of Zach's accident) and starts playing with him alone. Evolver loads steak knives into his shooting arm and chases Ali into the backyard swimming pool, attempting to electrocute her while she is trapped. Kyle and Jamie return home and save Ali and Kyle defeats Evolver, only to kick him into the pool, shorting him out. Bennett and two other Cybertronix employees come to Kyle's house and take Evolver back to be dismantled. On the way though, Evolver kills Bennett and the Cybertronix technicians and escapes. He evolves one last time for the final level, charges up at a nearby power plant, and heads back to Kyle's house for one last battle.\nEvolver takes Kyle's mother and sister hostage, trapping them inside of a Laser-crafted Cage using a laser-gun, a kaleidoscope, and a super-charged battery. Seeing the wrecked Cybertronix van, Kyle and Jamie return home to find Evolver, now armed with a destructive new laser gun. Evolver plans to execute his hostages if Kyle does not win within 3 minutes. Kyle places a metal pan on his chest, confronts Evolver and feigns death when he is shot by Evolver. Jamie distracts Evolver and Kyle shoots it in the remaining targeting sensor. Defeated, Evolver becomes extremely confused and malfunctions allowing Kyle to beat Evolver with a baseball bat until it shuts down.\nAfter Kyle frees his mother and sister, Evolver re-activates again, now armed with only its arm and brute strength. As he prepares to kill Kyle to avoid losing, Kyle grabs the laser gun with the super-charged battery and shoots Evolver until it explodes. The family and Jamie go to the hospital as Cybertronix's CEO faces the press. The camera pans over to Ali's bedroom, to show Evolver's remains and a single glowing eye. The last scene shows Evolver's HUD screen reading out \"KILL NOT CONFIRMED\" before fading to static and blacking out."}