{"mid": "ExecutiveDecision", "IMDB_id": "tt0116253", "title": "Executive Decision", "plot": "Lieutenant Colonel Austin Travis leads an unsuccessful raid on a Chechen mafia safe house in Italy by a U.S. Army Special Forces team to recover a stolen Soviet nerve agent, DZ-5. One of his men is killed during the raid. Dr. David Grant, a United States Naval Academy graduate and now a consultant for the U.S. Army's intelligence community, learns that terrorist El Sayed Jaffa has been arrested. Shortly after, Oceanic Airlines Flight 343 a Boeing 747-200 leaves Athens, Greece, bound for Washington, D.C, with U.S. Senator Mavros onboard. Jaffa's lieutenant, Nagi Hassan, and his men hijack the flight.\nGrant joins a team led by Travis to intercept the plane. After listening to Hassan's demands, Grant disbelieves that Hassan wants Jaffa released. Instead, he thinks Hassan engineered Jaffa's capture and plans to use the plane to detonate a bomb loaded with the nerve gas over U.S. airspace in a suicide mission. The Pentagon authorizes a mid-air transfer of an Army special operations team onto the hijacked airliner using an experimental version of the F-117 stealth aircraft. Grant and DARPA engineer Dennis Cahill accompany the team.\nThe boarding is only partially successful. When an operator, \"Cappy,\" is seriously injured with a broken neck, Grant boards to assist Cappy. The Oceanic Airlines 747 pulls up, though, putting too much stress on the boarding sleeve. Unable to board, Travis sacrifices himself when he closes the 747's hatch. The survivors enter the 747's lower deck, but with half their equipment and no communication. The Pentagon assumes the team failed to board. With limited options, the operators search for the supposed bomb. Grant makes contact with a flight attendant, Jean, despite Hassan's suspicions, and recruits her.\nU.S. officials release Jaffa to resolve the situation. Meanwhile, the team locates and begins dismantling the bomb. Despite his injuries, Cappy aids Cahill in disarming the bomb. The remaining team readies to take control of the aircraft, when the Cappy shortly discovers that the bomb's arming device is barometrically activated. They have seemingly disarmed the bomb, but another trigger is revealed. The team's attack is aborted while they determine the next move. Jaffa calls Hassan from a private jet, telling him he is free and on his way to Algeria, but Hassan will not be swayed from his plan. Grant realizes Hassan's men don't know about the bomb and his true intentions, which means that one of the passengers is a sleeper (the trigger man to the bomb).\nJean spots a man with an electronic device and informs Grant. Mavros is called to speak to the President of the United States, only to realize he is to be sacrificed as a warning that Hassan is serious. Hassan points a gun to Mavros' head as he tries in vain to get the President to listen, but is shot in the head. Meanwhile, the soldiers use the plane's taillights via Morse code to signal U.S. Navy F-14 Tomcat fighter jets that they are on board and not to shoot them down.\nGrant and Jean enter the passenger cabin and take the suspected individual by surprise, but what Jean thought was an electronic device was merely a case of diamonds carried by a smuggler. However, Grant spots the real sleeper: Jean-Paul Demou, the man who built the bomb. Hassan attempts to fire at Grant, but is shot from behind by the onboard federal air marshal, who is then shot by another terrorist. The operators kill the lights, make entry, and storm the cabin, where a firefight ensues. Stray bullets strike and break passenger windows, causing explosive decompression which sucks three passengers and Demou out of the plane. The remaining terrorists (other than Hassan) are killed during the exchange, the bomb is finally disarmed, and the plane regains its stability. In a last act of desperation, a seriously wounded Hassan kills both pilots, hoping the bomb will detonate if the plane crashes. Wounded operator \"Rat\" kills Hassan.\nGrant assumes control of the 747 and attempts to land it at Washington Dulles International Airport despite his limited piloting experience. He misses the approach, forcing him to pull the plane back up to circle around and try again. As the plane begins to climb, Grant recognizes the area surrounding Frederick Field, which is where he normally practices flying. Deciding to land the 747 there, with Jean's assistance, Grant makes a sloppy and fiery but safe landing. The 747 is slowed to a stop by ramming into a sand berm at the runway's overrun area, where emergency workers are able to safely evacuate the remaining passengers.\nGrant is saluted by Rat and the team for saving the passengers, he is then wanted by the Pentagon, not before inviting Jean along with him."}