{"mid": "ExorcistIITheHeretic", "IMDB_id": "tt0076009", "title": "Exorcist II: The Heretic", "plot": "Philip Lamont, a priest struggling with his faith, attempts to exorcise a possessed South American girl who claims to \"heal the sick\". However, the exorcism goes wrong and a lit candle sets fire to the girl's dress, killing her. Afterwards, Lamont is assigned by the Cardinal to investigate the death of Father Lankester Merrin, who had been killed four years earlier in the course of exorcising the Assyrian demon Pazuzu from Regan MacNeil. The Cardinal informs Lamont (who has had some experience at exorcism, and has been exposed to Merrin's teachings) that Merrin is facing posthumous heresy charges because of his controversial writings. Apparently, Church authorities are trying to modernize and do not want to acknowledge that Satan actually exists.\nRegan, although now seemingly normal and staying with her guardian Sharon Spencer in New York, N.Y., continues to be monitored at a psychiatric institute by Dr. Gene Tuskin. Regan claims she remembers nothing about her ordeal in Washington, D.C., but Tuskin believes her memories are only repressed. Father Lamont visits the institute but his attempts to question Regan about the circumstances of Father Merrin's death are rebuffed by Dr. Tuskin, who believes that Lamont's approach would do Regan more harm than good. In an attempt to plumb her memories of the exorcism and specifically the circumstances in which Merrin died, Dr. Tuskin hypnotizes the girl, to whom she is linked by a \"synchronizer\"—a revolutionary biofeedback device used by two people to synchronize their brainwaves. After a guided tour by Sharon of the Georgetown house where the exorcism took place, Lamont returns to be coupled with Regan by the synchronizer. The priest is spirited to the past by Pazuzu to observe Father Merrin exorcising a young boy, Kokumo, in Africa. Learning that the boy developed special powers to fight Pazuzu, who appears as a swarm of locusts, Lamont journeys to Africa, defying his superior, to seek help from the adult Kokumo.\nKokumo has become a scientist, studying how to prevent locust swarms. Lamont learns that Pazuzu attacks people who have psychic healing ability. Regan is able to reach telepathically inside the minds of others; she uses this to help an autistic girl to speak, for instance. Father Merrin, who belonged to a group of theologians that believed psychic powers were a spiritual gift which would one day be shared by all people, thought people like Kokumo and Regan were forerunners of this new type of humanity. In a vision, Merrin asks Lamont to watch over Regan.\nLamont and Regan return to the old house in Georgetown. The pair are followed in a taxi by Tuskin and Sharon, who are concerned about Regan's safety. En route, Pazuzu tempts Lamont by offering him unlimited power, appearing as a succubus who is a doppelgänger of Regan. The taxi crashes into the Georgetown house, killing the driver, but his passengers survive and enter the house, where Sharon sets herself on fire. Although Lamont initially succumbs to the succubus, he is brought back by Regan and attacks her doppelgänger while a swarm of locusts deluge the house, which begins to crumble around them. However, Lamont manages to kill the doppelgänger by beating open its chest and pulling out its heart. In the end, Regan banishes the locusts (and Pazuzu) by enacting the same ritual attempted by Kokumo to get rid of locusts in Africa (although he failed and was himself possessed). Outside the house, Sharon dies from her injuries and Tuskin tells Lamont to watch over Regan. Regan and Lamont leave while Tuskin stays to answer police questions."}