{"mid": "Exosquad", "IMDB_id": "tt0106842", "title": "Exosquad", "plot": "The series is set in the years 2119–2121 AD, several decades after humanity (\"Terrans\") has expanded its presence beyond Earth, terraforming and colonizing Venus and Mars. These three planets are \"the Homeworlds\", the core first of the Terran interplanetary state and later of Neosapien Commonwealth. Not all Terrans are affiliated with the Homeworlds, however: the Pirate Clans, descendants of Terran criminals exiled to the Outer Planets who live off looted Homeworlds' space freighters, are a major independent faction in the show. The first episode opens with the Earth Congress dispatching the entire Exofleet, humanity's space-based military, to counter the Pirate threat.\nWith war with the Pirate Clans looming, an uprising begins among the Neosapiens, an artificial humanoid race coexisting with Terrans. In the back-story, the Neosapiens were used primarily as slaves during the colonization of Mars and Venus and therefore have been engineered to be physically stronger and better adapted to hostile environments than humans. Their mistreatment by Terrans led to the First Neosapien Revolt fifty years before the series' begin, which was mercilessly crushed but had brought some positive changes into their lives. Still not content with his fate, the Neosapien Governor of Mars, Phaeton, sets a new insurrection, codenamed \"Operation [Neosapien] Destiny\", in motion as soon as the Exofleet leaves to chase after the Pirate Clans. The absence of the Exofleet is also a part of Phaeton's plan as it enables the Neosapiens' capture of the Homeworlds without much effort.\nThe two seasons that the series was on the air follow the progress of the Neosapien War, as seen through the eyes of Able Squad, an elite E-frame unit, composed of J.T. Marsh, Nara Burns, Maggie Weston, Kaz Takagi, Alec DeLeon, Rita Torres, Wolf Bronsky, and Marsala. Their exploits unfold against the backdrop of the ongoing war, as the squad participates in events often crucial to turning its tide. The show features a realistic outlook on war: many characters die in combat, military operations are carefully planned and reconnoitered in advance, and psychological effects of warfare are explored. For example, separate episodes detail Exofleet's reconnaissance of Venus prior to its recapture, the actual liberation, and the repulse of the first Neosapien reconquest attempt. Moreover, even after Venus is retaken by Terrans, several episodes deal with the remaining Venusian resistance and Neosapien forces who hid across Venus, refusing to surrender and awaiting reinforcements.\nThe second season draws to a close with the defeat of the Neosapiens and the liberation of Earth, but it ends with a cliffhanger suggesting that a third season would describe a war against a new alien race, and that the Terrans and the Neosapiens would be forced to ally with each other. However, the series was cancelled soon after the end of the second season so a third season was never made."}