{"mid": "EyeInTheSky", "IMDB_id": "tt2057392", "title": "Eye in the Sky", "plot": "While on a visit to the (fictional) Belmont Bevatron in the 1957 novel's near-future year of 1959, eight people become stuck in a series of subtly and not-so-subtly unreal worlds. The instigating incident is a malfunction of the particle accelerator which places all of the injured parties in states of total or partial unconsciousness. These ersatz universes are later revealed to be solipsistic manifestations of each individual's innermost fears and prejudices, bringing the story in line with Dick's penchant for subjective realities. As well as his future discussions of theology and fears about McCarthy-era authoritarianism, the novel skewers several human foibles.\nJack Hamilton, the central protagonist, is dismissed from his job at the California Maintenance Labs due to McCarthy-era paranoia about his wife Marsha's left-wing political sympathies. Other affected members of the injured touring party include Bill Laws, a Negro possessing a PhD Degree in Physics who is nonetheless employed as a lowly tour guide within the plant. The above-mentioned Arthur Silvester is an elderly political conservative and believer in an obsolete geocentric cosmology, derived from a schismatic Bábí offshoot. Joan Reiss is a pathologically paranoid woman. Edith Pritchet is a maternal but censorious elderly woman. In succession, the group moves through solipsistic personalized alternate realities related to the beliefs and opinions of Arthur Silvester, Pritchet, Reiss and a hard line Marxist caricature of contemporary US society. Marsha Hamilton's subconscious perceptions, however, did not create this alternate reality, as most of their companions and even her own husband, originally thought. It originates instead from an unexpected source, revealed as Charles McFeyffe, a revealed hard-line Communist who has craftily and diabolically insinuated himself into an overtly wholesome and patriotic American lifestyle that includes, unbelievably, a position as chief security officer in the California Maintenance Labs plant. So much for the good old infallible vetting process we were led to believe was in place for Government-level positions of trust and responsibility.\nAt story's end Jack Hamilton and Bill Laws form a small business that seeks advances in stereophonic technology. The disclosure of McFeyffe's Marxist allegiances is dismissed as completely unprovable. There is just a playful hint of a suggestion that the world they finally end up in may or just may not be their original base reality."}