{"mid": "FallingHare", "IMDB_id": "tt0035861", "title": "Falling Hare", "plot": "This cartoon opens with the title credits over the strains of “Down by the Riverside”, then into an extended series of establishing shots of an Army Air Force base, to the brassy strains of “We’re in to Win” (a World War II song also sung by Daffy Duck in Scrap Happy Daffy two months before). The sign at the base reads \"U.S. Army Air Field\", and below that is shown the location, the number of planes and number of men, all marked \"Censored\" as a reference to military secrecy. Beneath those categories, the sign reads \"What men think of top sergeant\", which is shown with a large white-on-black \"CENSORED!!\", as the language implied would not pass scrutiny by the Hays Office.\nBugs is found reclining on a piece of ordnance next to a bomber plane, idly reading Victory Thru Hare Power (a spoof of the 1942 book) and laughing uproariously at the book’s claim that gremlins wreck American planes through \"di-a-bo-lick-al saa-boh-tay-jee.\" He immediately encounters one of the creatures, who is experimentally striking the unfused nose of a bomb Bugs is sitting on with an oversized mallet to the tune of “I've Been Working on the Railroad”. Bugs casually asks the gremlin what he’s doing. The gremlin replies that blockbuster bombs like the one in question do not detonate unless they’re struck with perfect precision. Noticing the gremlin’s lack of success, Bugs offers to help him. But after taking the mallet and raising it in preparation to strike the bomb, Bugs suddenly comes to his senses and refrains from following through milliseconds from striking it, screaming \"WHAT AM I DOING?!\" as he does so. He then ponders if the creature in question was a gremlin. The gremlin replies as loud as he could: \"It ain’t Vendell Villkie!\"\nThe Gremlin ties up Bugs’s ears leaving him confused and hits his foot with a monkey wrench, further taunting Bugs by \"laughing\" the first seven notes of Yankee Doodle once aboard the aircraft. Bugs recovers and gives chase, repeatedly getting slighted by the gremlin, which includes repeated strikes with a monkey wrench and the \"laughed\" musical taunt. Bugs chases the gremlin inside a bomber, and finds himself locked from the outside. Then the gremlin takes the plane to the air, unbeknownst to Bugs. Bugs manages to burst out of the plane’s exit door, narrowly escaping plunging to his death when he realizes the plane is airborne. He manages to get back in, only to slide right out the other door due to strategically placed banana skins; when the gremlin opens the door again, he finds Bugs (who has apparently and humorously aged several years through sheer terror) clinging to it with his heart beating \"4F\" (Army code for drastically limiting medical condition, hospitalization required). His cat-and-mouse game with the gremlin continues, until Bugs realizes that the Gremlin is flying the plane toward a pair of skyscrapers. Bugs rushes into the cockpit, takes control of the airplane, rolls it vertically and flies through an extremely narrow slot between the towers to avoid what seemed to be an inevitable impact.\nThe plane goes into a tailspin, its wings ripping off during its descent, with only the fuselage remaining, making Bugs both airsick and terrified. However, the plane sputters to a halt, half a short distance above the ground and hanging in mid-air, defying gravity. Both Bugs and the Gremlin then casually address the audience: the gremlin apologizes for the plane's fuel depletion, while Bugs points to a wartime gas rationing sticker on the plane's windshield and remarks: \"Yeah. You know how it is with these A cards!\""}