{"mid": "FamilyPlot", "IMDB_id": "tt0074512", "title": "Family Plot", "plot": "A fake psychic, Blanche Tyler (Barbara Harris), and her boyfriend, George Lumley (Bruce Dern), attempt to locate the nephew of a wealthy and guilt-ridden elderly woman, Julia Rainbird (Cathleen Nesbitt). Julia's recently deceased sister gave the baby boy up for adoption, but Julia now wants to make him her heir, and will pay Blanche $10,000 if the man, Edward Shoebridge, can be found. During his investigation, George Lumley discovers that Shoebridge is thought to be dead, but he tracks down another criminal, Joseph Maloney (Ed Lauter), who paid for the tombstone over an empty grave.\nMeanwhile, it is revealed to the viewers that Shoebridge murdered his adoptive parents, faked his own death and is now a successful jeweler in San Francisco known as Arthur Adamson (William Devane). He and his live-in girlfriend, Fran (Karen Black), kidnap millionaires and dignitaries, returning them in exchange for ransoms in the form of valuable gemstones. The duo conceal an enormous diamond in plain sight in a crystal chandelier.\nWhen Adamson learns that George is investigating him, he enlists Maloney (the two had murdered Adamson's adoptive parents long ago), to kill Blanche and George. Maloney initially refuses to help, but then contacts Blanche and George, telling them to meet him at a café on a mountain road. He cuts the brake line of Blanche's car while the couple are in the café, but they manage to survive their dangerous high-speed descent. Maloney tries to run them over, but dies in a fiery explosion when he swerves to avoid an oncoming car and tumbles down the cliff.\nAt Maloney's funeral, his wife (Katherine Helmond) tearfully confesses to George that Shoebridge's name is now Arthur Adamson. George has to go to work driving his taxi for an evening shift, so Blanche tracks down various A. Adamsons in San Francisco, eventually reaching the jewelry store as it closes for the day. Arthur's assistant Mrs. Clay (Edith Atwater) offers to let Blanche leave a note. Blanche lies that she is a friend of Arthur and convinces Mrs. Clay to give her his address, instead.\nArthur and Fran are bundling a kidnapped Bishop Wood (William Prince) into their car when Blanche rings their doorbell. They attempt to drive out of their garage, but Blanche's car is blocking their way. She tells Arthur that his aunt wants to make him her heir. Blanche sees the unconscious bishop, and swears she will not tell, but Arthur drugs her, leaving her in the cellar while they drop the bishop off for ransom.\nSearching for Blanche, George finds her car outside Arthur and Fran's house, but no-one answers the door. He breaks in and searches for her. Arthur and Fran return home; George hides upstairs. He overhears Arthur's decision to kill Blanche and frame her death as a suicide. George manages to talk to Blanche, who is faking unconsciousness in the open cellar. Arthur and Fran enter to carry Blanche out to the car, but she darts out and George locks the kidnappers in.\nBlanche then goes into a \"trance\", climbs the stairs into the house and halfway up the next stairs, where she points at the huge diamond hidden in the chandelier. Blanche then \"wakes\" and asks George what she is doing there. He excitedly tells her that she is indeed a real psychic. He calls the police to collect the reward for capturing the kidnappers and finding the jewels. A smiling Blanche looks at the camera and winks."}