{"mid": "FarCry", "IMDB_id": "tt0400426", "title": "Far Cry", "plot": "Jason Brody is on vacation with a group of friends in the Rook Islands, celebrating his younger brother Riley getting a pilot license. However, on a skydiving trip, they land on a pirate-infested island and are kidnapped by a pirate lord named Vaas, who plans to extort ransom money from their parents, and then sell them into slavery. With the help of his older brother Grant, Jason breaks out of captivity, but Grant is killed by Vaas in the escape. Jason is rescued by Dennis, who is part of the Rakyat (the island natives who suffer due to the activities of the pirates). Dennis recognizes Jason's potential as a warrior, and gives him the Tatau, the tattoos of a Rakyat warrior. Jason then helps the Rakyat in a number of missions and ends up finding one of his friends, Daisy, at the house of Dr. Earnhardt. Impressed with Jason's prowess, the Rakyat allow him to be the second outsider to enter their sacred temple (Dennis was the first being born in Liberia) and their leader Citra initiates him into the tribe, after Jason finds and returns the Silver Dragon knife, a Rakyat relic, having seen it in a previous dream. He runs a series of missions during which he rescues his captive friends Keith, Oliver and Jason's girlfriend Liza while simultaneously helping the Rakyat retake their island, helped at times by Dr. Earnhardt and Willis Huntley, a CIA agent. After a few run-ins with Vaas, Jason discovers that he is employed by Hoyt Volker, a slave trader and drug lord, and that Vaas is Citra's brother. Throughout the adventure, Jason matures into a fearsome warrior and is revered by the Rakyat, begins to enjoy all the killing, and grows more distant from his friends, especially after receiving information that Riley is dead. After Citra asks him to stay in the island, Jason returns to Dr. Earnhardt's house (where his friends are hiding and preparing their escape by boat), and tells them that he is staying, completely distant from his friends and family, leaving them disturbed. Meanwhile, Jason has an affair with Citra after she drugs him and has sex with him while he is in a hallucination.\nAfter bidding goodbye to his friends, Jason goes to the pirates base where Vaas is. Believing that Jason was dead after a confrontation between the two, Vaas is celebrating Jason's death, although it transpires he was actually waiting for him. After Jason kills numerous pirates and reaches a warehouse, he and Vaas fight, but Jason enters a delusional state, fighting multiple duplicates of Vaas in his dream. He reaches a final Vaas, and after a brief struggle, he impales him through the chest with the Dragon Knife and collapses right besides him. He wakes up to Citra in the Rakyat's temple, and promises her that he will kill Hoyt for her. After Huntley helps him get into Hoyt's island, Jason infiltrates Hoyt's personal army with the help of Sam Becker, Huntley's fellow operative. During this time, Jason discovers that Riley is alive, but a prisoner of Hoyt. Jason works his way into Hoyt's confidence, until Hoyt eventually invites him and Sam to a poker night. After making a plan to kill Hoyt, Sam and Jason sit down at the poker game, but Hoyt stabs Sam in the throat and kills him, knowing the two are traitors. After Jason gets one of his fingers cut by Hoyt, the two have a knife fight, with Jason emerging victorious and killing Hoyt. Jason then goes to rescue Riley; he receives a call from Liza, but the signal is cut before she can say anything. Jason rescues Riley and the two escape by helicopter.\nThe two then fly to Earnhardt's house, but find it burning and the doctor dying on the ground. With his last words, he tells them that the house was attacked by the Rakyat, and that they have captured Jason's friends. Jason and Riley arrive at the Rakyat Temple. Jason asks Citra why his friends were captured, but she sprays him unconscious with a sleep powder and captures Riley. Citra has fallen in love with Jason, believing him to be a powerful warrior of Rakyat legend, and that she will free him. He starts dreaming of walking a fiery path with the Dragon Knife, and having Liza as a monster in his dream. He wakes up holding Liza at knife point with the Dragon Knife, and is given the choice either to kill his friends or to spare them.\n=== Endings ===\nIf Jason kills his friends, he stays on the island and has sex with Citra in a ritual. However, Citra then stabs Jason in the chest. As he dies, Citra tells him that his child will lead the Rakyat to glory and that he \"won\".\nIf Jason spares his friends, he prepares to leave the island, telling the Rakyat and Citra that he is done with killing. As Citra begs him to stay and proclaims her love for him, Dennis is outraged for what he considers a betrayal by Jason and tries to stab him, but Citra jumps in front of Jason and is stabbed. Citra once again proclaims her love for Jason before dying in his arms, as a horrified Dennis breaks down over what he has done. Jason and his friends then leave the island by boat, with Jason narrating that despite becoming a monster from all the killing, he still believes that in some place in his heart he is still better than this. The game ends with a still image of the boat and the Dragon Knife in the beach while the credits roll."}