{"mid": "FasterPussycatKillKill", "IMDB_id": "tt0059170", "title": "Faster, Pussycat! Kill! Kill!", "plot": "Three wild, uninhibited go-go dancers—Billie, Rosie, and Varla, dance at a club before racing their sports cars across the California desert. They play a high-speed game of chicken on the salt flats and encounter a young couple, Tommy and Linda, out to run a time trial. After breaking Tommy's neck in a fight, Varla kidnaps and drugs Linda.\nIn a small desert town, they stop at a gas station where they see a wheelchair-bound old man and his muscular, dim-witted son. The gas station attendant tells the women that the old man was crippled in a railway accident, “going nuts\" as a result, and that he received a large settlement of money that is hidden somewhere around his decrepit house in the desert. Intrigued, Varla hatches a scheme to rob the old man, and the three women follow him back to the ranch, with their captive in tow.\nAt the ranch they encounter the old man, his younger son (who they learn is called \"The Vegetable\" due to his feeblemindedness) and his elder son, Kirk. The group all have lunch together, and Billie taunts Rosie when Varla leaves with Kirk, hoping to seduce him into revealing the location of the money. Linda subsequently escapes the drunken Billie and runs away into the desert. The old man and the younger son pursue in their truck. The younger son catches Linda and seems about to assault her, but he collapses in tears as Varla and Kirk arrive. Kirk finally acknowledges his father’s lecherous nature and the old man’s hold over his younger brother, and he vows to have his younger brother institutionalized. He tries to take the hysterical Linda into town in the truck, but the old man says that he has thrown away the keys, and Kirk and Linda set out across the desert on foot.\nVarla drives back to the house and tells Billie and Rosie that they should kill the men and the girl to cover up Linda’s kidnapping and the murder of her boyfriend. Billie refuses, but as she walks away, Varla throws a knife into her back just as the old man and his younger son arrive. Rosie and Varla hit the old man with their car, killing him and knocking over his wheelchair to reveal the money hidden inside. Rosie is stabbed and killed by the younger son while trying to retrieve the knife from Billie's body. Varla tries to ram him into a wall with her car, injuring him. She drives off in the truck and overtakes Kirk and Linda, chasing them into a gully. Varla and Kirk fight hand-to-hand. She gets the better of him until Linda hits her with the truck, and she dies. Kirk and Linda drive off together in the truck."}