{"mid": "Fatherland", "IMDB_id": "tt0109779", "title": "Fatherland", "plot": "In the prologue, the failure of the D-Day invasion causes the United States to withdraw from the war in Europe and Dwight D. Eisenhower to retire in disgrace. The US continues the Pacific War against Japan and wins by using atomic bombs. In Europe, Germany invades the United Kingdom, resulting in King George VI and the rest of the Royal family fleeing to Canada in exile with Edward VIII regaining the throne while Wallis Simpson becomes queen. Winston Churchill also goes into exile in Canada and lives there until his death in 1953. Germany corrals the rest of Europe into the Greater German Reich, known as \"Germania\" for short. German society is largely clean and orderly - at least on the surface - with the SS reorganized into a peacetime police force.\nGermania is embroiled in an endless guerrilla war with the USSR, still led by the 85 year-old Joseph Stalin, which lasts well into the 1960s. The 1960 election of US President Joseph Kennedy gives the Nazi leadership a chance to secure a better understanding with the U.S. In 1964, as Adolf Hitler's 75th birthday on 20 April approaches and President Kennedy heads to Germania for a summit meeting, the nation opens its borders to U.S. media.\nA body is found floating in a lake near Berlin. SS Major Xavier March (Rutger Hauer) starts investigating the body and the witness (Rupert Penry-Jones) who saw it being dumped. The dead person is revealed to be Josef Bühler, a retired Nazi Party official who managed the Jewish \"resettlement\" in the east during the war. However, the Gestapo takes over the case for \"state security\" reasons. The witness is killed in an \"accident\" that seems to have been arranged by the Gestapo.\nMeanwhile, Charlotte Charlie Maguire (Miranda Richardson), a member of a visiting US press entourage, runs into an old man who slips her an envelope. A note on a photograph in the envelope leads her to Wilhelm Stuckart, another retired Nazi Party official, but she finds him dead at his apartment. March is assigned to the Stuckart case, but when he takes Charlie to where she found the body, the Gestapo shows up, and March is again taken off the case. Following up on the photo, Charlie and March visit Wannsee to learn the names of those in the photo, all of whom attended the Wannsee Conference, and discover they’ve all been murdered except for Franz Luther, the man who gave her the picture.\nMarch tells Charlie to get out of Germania, as he now realizes there is a plot at the very highest levels. Luther contacts Charlie and asks her to meet him in a train, where he requests that she communicate his desire for safe passage to the US so that he can reveal what he knows about \"the biggest secret of the war.\" SS troops corner Luther and kill him, but March rescues Charlie. March later blackmails a colleague to get Luther’s file and learns that he had a mistress, former stage actress Anna von Hagen.\nPosing as a US Embassy official sent to process Luther's safe passage, Charlie visits von Hagen and gets Luther's papers. Von Hagen reveals that the Jews were not resettled, but were actually killed en masse by the Germans during the war. March is shocked at seeing the photos and documents, and agrees to join Charlie in escaping Germania with his son. However, the Gestapo has already persuaded his son to betray his father to them. When March goes to pick up his boy, Gestapo chief General Globus appears with his men. March kills one agent and flees, stopping at a nearby phone booth to call his son one more time before he dies from his wounds. As Kennedy arrives at the Great Hall, a member of the press entourage helps Charlie slip the documents to the president via the US ambassador. Kennedy looks at the materials and decides to fly back to the US immediately.\nIn the epilogue, it is revealed that the narrator is actually March's now-grown son. He says Charlie was eventually arrested by the Gestapo. The revelation of the mass slaughter of the Jews derailed any prospect of a strategic alliance with the US, resulting in the Nazi regime's collapse."}