{"mid": "Faults", "IMDB_id": "tt3021360", "title": "Faults", "plot": "Ansel Roth, a writer and cult specialist, fraudulently uses an expired voucher to pay for a meal at a hotel restaurant and is forcibly removed after refusing to pay. The manager of the hotel tells Roth that his speaking engagement is almost ready, and Roth steals towels and batteries as he checks out. His presentation on cults is interrupted by a heckler, who proceeds to beat him up for his involvement in the suicide of a troubled woman, the man's sister, who had been involved with a cult. Evelyn and Paul approach Roth and request an autographed copy of his book for their daughter, Claire, who they explain has become involved in a mysterious cult. Roth declines to become involved.\nMick, an employee of Roth's manager Terry, approaches Roth in the hotel's parking lot and delivers a letter. Terry has dropped Roth as a client and wants Roth's debts paid back within a week. Evelyn and Paul again request his help, and he agrees to listen to their story when they offer to buy him breakfast. Roth offers to deprogram Claire, a risky process that involves abducting her and confronting her with the truth about the cult. Roth hires two men to help him abduct Claire; one of them strikes her during the abduction. They take her to an isolated motel and prevent her from sleeping.\nAfter paying the men, Roth begins the process of deprogramming. Excited that she is being cooperative, he lets Claire momentarily see her parents, who are in an adjoining room. Paul becomes increasingly demanding and controlling of both the situation and his daughter, and Paul becomes enraged when Roth meditates. The deprogramming is interrupted when Mick locates Roth and again demands payment. Roth awkwardly requests half of his fee from Paul, who reluctantly agrees. Roth advises Paul and Evelyn to lock Claire in the bathroom overnight (he has moved the lock to the outside) to prevent her from escaping while he is gone.\nWhen Roth delivers partial payment to Terry, Terry berates him for letting people walk over him, strikes him with a paperweight, and demands the rest of the money in two days. Roth is surprised to find Claire unconscious outside the hotel room. When he brings her back inside, her parents say she was locked in the bathroom; Claire claims to have teleported herself using meditation techniques learned from the cult. As pressure mounts on Roth, he suffers from lack of sleep, physical abuse, and threats from everyone but Claire, who seduces him as he experiences a nervous breakdown. Afterward, Roth watches a videotape of his failed television show while Claire has sex with Paul in the background as Evelyn watches.\nRoth wakes in his car. He rushes to the hotel room, where he finds Claire alone. She explains that her parents have left and seems puzzled when Roth confusedly questions her about the videotape and her sexual encounters. Roth and Claire become accidentally trapped in the bathroom when the door closes and locks from the outside. As the phone rings, Roth becomes hysterical, knowing that it must be Terry. Claire takes control of the situation, and forces him to face his many failures, including his divorce and guilt over the young cult member's suicide. Roth tearfully admits that he exploited the girl for his short-lived television series. As Claire leads him in meditation, she breaks him completely and convinces him that he has unlocked the bathroom door using his mind.\nAs they exit the bathroom, Mick enters the hotel room. Terry follows him there after he becomes impatient and is horrified to find Mick dead. Terry explains that Mick was just an actor hired to intimidate Roth. Roth kills Terry as Claire silently observes. Claire, now in complete control, tells Roth to wait in the car while she takes care of something. Paul and Evelyn, hidden in the next room, say they have murdered the man who struck her during her abduction. They identify her as Ira and she thanks them for their help, kisses them, and hands each a pill, which they swallow before lying down. When she joins Roth in the car, he apologizes to her for the car door being broken. She tells Roth to not apologize for anything because they have each other and they are strong. When he asks where he is going, she replies, \"Home.\""}