{"mid": "Fear", "IMDB_id": "tt0116287", "title": "Fear", "plot": "Nicole (Reese Witherspoon) is a fairly innocent teenager but with a rebellious side, particularly directed at her father, Steven Walker (William Peterson). At a rave, Nicole meets David McCall (Mark Wahlberg), and is swept off her feet by his sweet, polite nature. Steve, seemingly overprotective, doesn't trust David from the moment he meets him. Steve also gets angry when Nicole violates her curfews to spend more time with David. The closer Nicole and David become, the more Steven objects. One day, David scares Nicole when he sees her hugging her friend, Gary. He physically assaults Gary and shoves Nicole to the ground when she tries to stop him, leaving her with a black eye. Nicole ends things with David, leaving him crushed. The next day, he talks to Nicole, apologizes, and things are smoothed over for the couple.Nicole clings to David and he uses that to his advantage since he knows from their conversations about the tension between her and her father. He is more than happy to comfort her in every way. Steven is still suspicious so he does some checking into David's background and finds out that David is not who he appears to be. Steven confronts David on a street corner and orders him to stop seeing Nicole. David is still polite and says he has no intentions of hurting Nicole. Then he taunts Steven about wanting to keep his daughter a little girl forever and that he was scared David will take her away from him. He also says that Steven's wife isn't satisfied sexually and implies that she has been coming on to David. Steven is only interested in protecting his family and drives off. David doesn't take orders very well. David beats himself in the chest repeatedly until he is bruised, and Nicole accuses Steven of assaulting David. She leaves in an angry rage with David, who was waiting in the car outside. Later, David drops Nicole off, asking if she'd rather come home with him. Nicole declines but then changes her mind and drives to his house where she discovers Margo giving David's friend a lap dance. David then interferes and grabs Margo from behind and takes her to his room, proceeding to rape her, but Nicole believes Margo goes willingly. Nicole is devastated and completely breaks it off with David, wanting nothing more to do with him. She also doesn't want anything more to do with Margo. Later that week, David follows Nicole into a ladies' room in the mall and molests her.In a final, desperate attempt to get evidence to use against David, Steven breaks into David's house and discovers a shrine to Nicole in his bedroom. In a rage, Steven vandalizes the house, especially David's room. David and his friends make their way into Steven's house in revenge using scare tactics to gain access. David ties up Steven and brings him up to Nicole's room to \"say goodbye\" to his daughter. While David tells Nicole, \"It has to be this way,\" he asks her if she wants to go with him. She fakes affection for him and says \"yes.\" Laura frees Steven and he and David fight violently. Steven then throws David out the second-story window to his death."}