{"mid": "FeedingFrenzy", "IMDB_id": "tt1706365", "title": "Feeding Frenzy", "plot": "The film begins with Mr. Plinkett, a strange old cripple who owns a hardware store, meeting a hooker in a motel. The hooker strips for him, but he murders her with a secret blade in his cane. He then drags her to the basement of his hardware store leaving a trail of blood behind him.We then cut to our main character, Jesse Camp, a down on his luck employee of Plinkett's hardware store. He is desperately attracted to Kaitlin, a girl who he's liked since second grade. However, she has a boyfriend named Kyle, who everybody seems to think is amazing. Jesse is bothered by Plinkett, who forces him to clean up the trail of blood left by the hooker in the first scene, his coworker Carl, and his roommate Martin, both of whom make fun of him for not being able to get with Kaitlin. After the trail of blood and Plinkett forcing Jesse to break a VHS tape of him on a Monday, Jesse begins to grow suspicious when Kaitlin says her friend has gone missing. He believes the answer lies in Plinkett's basement, so Jesse, Kaitlin, and Kyle go to the store at night and discover that Plinkett is housing tiny ravenous creatures in a box. (They were referred to as Globkins on set, however this is never used in the film.) Just then, Plinkett shows up and feeds Kyle to the creatures, but Jesse and Kaitlin escape. They meet up with Carl and figure out that the creatures are tracking the scent of the people who came in the store that day, so they track them down. Plinkett finds them however, and reveals that the creatures were all being put together to form a reanimation of his dead wife, after capturing Jesse and Kaitlin, but letting Carl go. The wife escapes however, and kills Plinkett, but Jesse and Kaitlin get away. Jesse asks Kaitlin to sleep with him, but she says no, so he leaves her to die with Plinkett's wife. Martin tells him he should go back, though, so he has a change of heart and saves her, and the two make love on top of Plinkett's dead wife's rotting zombie corpse as the credits roll."}