{"mid": "FelixTheCatTheMovie", "IMDB_id": "tt0259308", "title": "Felix the Cat: The Movie", "plot": "In the Kingdom of Oriana, Princess Oriana, ruler of the kingdom, has been informed by a local fortune teller Pearl that her evil uncle, the Duke of Zill, is invading the kingdom. To counter the threat of the Duke, Oriana and Pearl descend into the cavern underneath the castle and attempt to use an ancient device called the \"Dimensporter\" in order to escape to another dimension and find a hero to save the kingdom. However, they are caught by the Duke's robotic army and imprisoned, while the Duke himself seizes control of the kingdom. As the princess is taken away by the Duke's \"Cylinder\" robots, she sheds a magical tear, which flies into the Dimensporter in her place and is transported to Felix's dimension, where the eponymous feline is taking a nap underneath a palm tree when the tear finds him. The tear wakes and guides him to an abandoned gold mine, where the Dimensporter is located. Felix, with his magical bag of tricks, is soon transported to the Kingdom of Oriana.\nMeanwhile, Felix's nemesis, The Professor, and his nephew Poindexter, who had been spying him, follow Felix to Oriana in the hopes of catching Felix and stealing his magic bag. Once in Oriana, the tear tells Felix that it cannot guide him any further and vanishes. Felix gets lost and subsequently ends up in a swamp in the Land of Zill. There, he meets Pim, who offers to guide him, but Pim later betrays Felix and hands him over to Wack Lizardi, the owner of a local circus and a lackey of the Duke. At Pim's suggestion, Wack confiscates Felix's bag and puts him to work as a performer, locking Felix in a cell before and after every show.\nEventually, Felix manages to sneak out of his cell and meets with the princess, who is being held in an adjacent cell. She explains to Felix about the Duke's conquest of her kingdom, whom she reveals is actually her uncle. In the past the Duke was a scientist who disagreed with the pacifistic views the kingdom held. After a laboratory accident left him disfigured, he rebuilt his body into a mechanical shell. For attempting to seize the royal secrets of their ancestors' high technology, he was banished to the Land of Zill. He plotted revenge, meanwhile gaining allegiance of the strange creatures of Zill, built a robotic army and stormed Oriana by force. Not content with simply ruling Oriana, he continued his efforts to find the royal secrets contained in the \"Book of Ultimate Power\", which the princess has refused to reveal the location of. Felix escapes with the princess using his magic bag to fly away in the middle of a stage performance. Felix, Oriana, and a reformed Pim set off toward the kingdom of Oriana, eventually joined by the Professor and Poindexter after they fail to steal Felix's bag.\nThe heroes infiltrate the castle, but are quickly subdued and captured by the Duke's army. The Duke forces Oriana to reveal the location of the Book of Ultimate Power to him by threatening to kill Felix and the others, but upon obtaining it, he discovers its contents are of no use to him. Enraged, the Duke unleashes his ultimate creation, Master Cylinder, to destroy the heroes. However, Felix throws the book at Master Cylinder, causing it to short circuit and break down, which in turn shuts down the rest of the Cylinders. With his army gone, the Duke flees, swearing to return. The kingdom saved, Oriana transports Felix, The Professor, and Poindexter home with the Dimensporter."}