{"mid": "Felidae", "IMDB_id": "tt0109791", "title": "Felidae", "plot": "Francis, an intelligent and cynical cat, is moved to a gloomy, dilapidated house with his owner Gustav Löbel, an architect and erotic novelist. During Francis's exploratory tour of the house, he discovers a cat's corpse. At the crime scene, he meets and befriends Bluebeard, a foul-mouthed, one-eyed Maine Coon.\nSoon, Francis discovers another body and the fact that his house's top floor is the meeting site of a sect of cats led by Joker; the members of the sect worship an entity named Claudandus and perform ritualistic suicide by throwing themselves in an electric current. When Francis's cover is blown, he is chased through the city's rooftops. He escapes through a skylight and meets a blind cat named Felicity, who supplies Francis with information on the Claudandus sect. The next day, Bluebeard takes Francis to Pascal, an elderly and tech-savvy cat who has taken to meticulously maintaining a list of feline deaths in the area, though which Francis learns that Felicity is the latest victim. That night, Francis is haunted by a nightmare in which Gregor Mendel leaves him with riddles.\nDuring a rodent hunt, Francis discovers a video recording that documents the top floor's previous use as an experimental laboratory that was devoted to the research and development of a tissue adhesive that would close wounds in an instant. The test subjects largely consisted of stray cats. However, the serums usually failed, causing the animals to suffer painful deaths. The one cat who survived the experiments was christened by the lab's technicians as \"Claudandus\", Latin for \"He who should or must be sealed\". However, Claudandus eventually murdered the project's lead technician, leading to the escape of the other strays and the closure of the lab. Claudandus subsequently became a martyr figure.\nFrancis gradually traces the neighborhood cats who descended from the strays involved in the experiments and is confronted by Pascal, who reveals himself to be Claudandus. In his pursuits, he saw an opportunity to create a breed of cat that would correspond to the primal ancestor of all domestic cats and be capable of wiping out humanity. The murdered cats, now including Joker, were deemed unworthy of breeding with the pure females that Claudandus had engineered. An additional obstacle in Claudandus's plot is the fact that he is terminally ill with stomach cancer. Although Claudandus deems Francis an ideal successor, Francis defies Claudandus's ambition and attempts to delete the data that Claudandus had gathered. The ensuing fight between the two results in a fire. Francis kills Claudandus in the struggle and flees the scene with an injured Bluebeard."}