{"mid": "FerdinandTheBull", "IMDB_id": "tt0030128", "title": "Ferdinand the Bull", "plot": "In the beginning, there are a lot of bulls, romping around together and butting their heads. There was only one bull who wasn't doing that, and that was Ferdinand. All he wanted to do was go under a shady cork tree and smell the flowers all day. Then one day his mother noticed that he wasn't playing with the other bulls. His mom asked him why he wasn't butting his head with the other bulls. He replied that all he wanted to do was to sit and smell the flowers. Luckily, his mother was very understanding.\nOver the years, Ferdinand grew and grew until he was as big as the tree. The other bulls wanted to accomplish one goal in life: to be in the bullfights in Madrid, Spain, but not Ferdinand. Then one day, five strange-looking men were here to see the bulls. When the bulls noticed them, they fought as rough as possible, hoping that they would get picked, but not Ferdinand, who just went back to smell the flowers. Just as Ferdinand was sitting, he accidentally sat on a bumblebee. It made him go crazy and on a rampage, knocking the other bulls out and crashed into a tree, making it fall down. The five men cheered as they took Ferdinand to Madrid.\nThere was a lot of excitement when the day of the bullfight came. On posters, they called him Ferdinand the Fierce. At the ring came out banderilleros, picadors and the matador who was being cheered on. When he was bowing, a woman in the audience gave him a bouquet of flowers which landed in his hand. Then the moment came where Ferdinand came out. He was wondering what was he doing there. The banderilleros and picadors were scared and hid, but the matador was scared stiff because Ferdinand was so big and strong. But Ferdinand looked and saw the bouquet of flowers, he walked over, scared the matador away, but just started smelling the flowers The matador was very angry that Ferdinand wasn't charging at him. But Ferdinand was not interested in fighting; he was only interested in smelling the beautiful flowers. Eventually, he was led out of the arena smelling the flowers and taken back home where he continued to sit under the tree and smell the flowers."}