{"mid": "FerrisBuellersDayOff", "IMDB_id": "tt0091042", "title": "Ferris Bueller's Day Off", "plot": "In suburban Chicago, near the end of the high school year, senior Ferris Bueller fakes sickness to stay home. Throughout the film, Ferris frequently breaks the fourth wall to talk about his friends and give the audience advice on how to skip school. His parents believe him, though his sister Jeannie is not convinced. Dean of Students Edward R. Rooney suspects Ferris is being truant again and commits to catching him. Ferris convinces his friend Cameron Frye, who really is absent due to illness, to help get Ferris' girlfriend Sloane Peterson out of school by reporting that her grandmother has died. To trick Rooney, Ferris sways Cameron to let them use his father's prized 1961 Ferrari 250 GT California Spyder to collect Sloane. Cameron is dismayed when Ferris continues to use the car to drive them into downtown Chicago to spend the day, but Ferris promises they will return it as it was.\nThey leave the car with parking garage attendants who immediately take the car for a joy ride after they leave. Ferris, Cameron, and Sloane sightsee around the city, including the Art Institute of Chicago, Sears Tower, Chicago Mercantile Exchange, and Wrigley Field, while narrowly dodging sight by Mr. Bueller. Cameron remains disinterested, and Ferris attempts to cheer him up by impromptu joining a parade float during the Von Steuben Day parade and lip-syncing Wayne Newton's cover of \"Danke Schoen\", as well as a rendition of The Beatles' \"Twist and Shout\" that excites the gathered crowds.\nMeanwhile, Rooney investigates Ferris' home to try to prove Ferris' truancy, getting into several pratfalls. At the same time, Jeannie, frustrated that the entire school believes Ferris has come down with a deathly illness, skips class and returns home to confront Ferris, only to hear someone outside trying to break in. Rooney flees while she calls the police; when they arrive, they arrest her for false reporting, and contact her mother to collect her. While waiting, she meets a juvenile delinquent, who advises her not to worry so much about Ferris. Mrs. Bueller arrives at the station, upset about having to forgo a house sale, only to find Jeannie kissing the delinquent, infuriating her more.\nFerris and his friends collect the Ferrari and start returning home, but shortly discover many miles have been added to the odometer, and Cameron becomes catatonic, realizing his life has been controlled by his father. Back at Cameron's garage, Ferris sets the car on blocks and runs it in reverse to try to take miles off the odometer without success. Cameron finally snaps, and lets out his anger against his father on the car, causing it to fall off the blocks and race in reverse through the back of the garage and into the ravine below. Ferris offers to take the blame, but Cameron asserts he will stand up against his father.\nFerris returns Sloane home and realizes his parents are due home soon. As he races on foot through the suburbs, he is nearly hit by Jeannie driving their mother home. She speeds off trying to beat Ferris home. Ferris makes it home first to find Rooney waiting for him inside. Outside, Jeannie races into the house as their mother talks to their father about her behavior today. Jeannie discovers Rooney threatening Ferris, and has a change of heart; she tells him that she was just helping to return Ferris from the hospital, and shows Rooney his wallet that she had found from his earlier break-in attempts. Rooney flees while Ferris thanks Jeannie and rushes back to his bedroom to greet his parents while feigning his waning illness. As they leave, Ferris reminds the audience, \"Life moves pretty fast. If you don't stop and look around once in a while, you could miss it.\"\nAs the credits roll, the defeated Rooney heads home and is picked up by a school bus, further humiliated by the students. In a post-credits scene, Ferris emerges from his room, telling the audience that \"It's over\" and to \"go home\"."}