{"mid": "FForFake", "IMDB_id": "tt0072962", "title": "F for Fake", "plot": "The film opens with Welles performing magic tricks for some children while Kodar watches nearby. Welles quotes Robert-Houdin to the effect that a magician is just an actor. Welles promises that for the next hour everything in the film will be based on solid fact. Kodar is then shown strolling around a street in a miniskirt while being ogled by the men on the street. Welles reveals the footage is taken from another experiment about girl-watching, where Kodar deliberately drew attention to herself and the men were unaware they were being filmed. Welles says her story will continue later in the film, and then narrates the story of Elmyr de Hory, an art forger who sold many fake paintings to museums and collectors all over the world. Elmyr is shown throwing a dinner party at his home in Ibiza and being feted by European society, although he dances around the question of whether he is guilty or not. One of those filmed is Clifford Irving, who had published a biography of Elmyr called Fake, and later in a notorious scandal was revealed to have been the forger of Howard Hughes's diary. Welles discusses the irony of Irving commenting on Elmyr's forgery while having committed a version of it himself. Irving and Elmyr tell about the art dealers who were fooled by the forgeries, and Welles considers the question whether this means art dealers and appraisers are fake also.\nWelles presents more of Irving's story of having had secret contact with Hughes, and the odd stories of Hughes's behavior that may or may not have been true. He wonders if believing such stories makes a person credulous or not, and questions the true wisdom of so-called experts, who verified Irving's forgery as authentic. Reichenbach is shown telling how Elmyr provided him with several paintings of questionable authenticity, but the art dealers he gave them to were willfully blind to it. Welles notes that Elmyr doesn't even own the house he lives in; it's provided for him by an art dealer. Welles recounts his own past use of fakery: how he got a job in Ireland by falsely claiming to be a famous New York actor, and how his broadcast of War of the Worlds made deliberate use of fake news to enhance the story. He also notes the coincidence that his first film Citizen Kane was originally going to be a fictionalized version of Howard Hughes.\nIrving describes how Elmyr was nearly destitute when younger and subsisted in America by making and selling forgeries that were indistinguishable from the real works, while remaining one step ahead of the law through frequent relocations. He finally moved to Ibiza, but was not prosecuted for lack of witnesses to the actual forging, as well as the scandal that might be aroused by revealing the depth of the art market's complicity in the deception. Elmyr insists he never signed any forgery, and Welles wonders whether, given the fact that all art eventually falls away to ruin, a signature truly matters to any art work. He illustrates the point by shots of the cathedral of Chartres, pointing out that the names of the men who created the magnificent building and the sculptures which adorn it are unknown. They did not sign their work, but it has endured.\nWelles finally presents Kodar's story: she holidayed in the same village as Picasso, who noticed her and painted 22 pieces with her as the model. She insisted she be allowed to keep the paintings, but later when Picasso read about an acclaimed exhibit of 22 new pieces of his, he flew there in a rage, only to discover the pieces were all forgeries. Kodar took Picasso to her grandfather, the forger, who defended his work with pride while Picasso angrily demanded the paintings back. This dialogue is presented by Welles and Kodar re-enacting the parts of the grandfather and Picasso respectively. Welles then confesses that he had promised everything in the \"next hour\" was true, and that hour had already passed. He admits the entire story of Kodar, her grandfather, and Picasso was made up. He apologizes, quotes Picasso's statement that art is a lie that makes us see the truth, and bids the audience good night."}