{"mid": "FiddlerOnTheRoof", "IMDB_id": "tt0067093", "title": "Fiddler on the Roof", "plot": "=== Act I ===\nTevye, a poor Jewish milkman with five daughters, explains the customs of the Jews in the Russian shtetl of Anatevka in 1905, where their lives are as precarious as the perch of a fiddler on a roof (\"Tradition\"). At Tevye's home, everyone is busy preparing for the Sabbath meal. His sharp-tongued wife, Golde, orders their daughters, Tzeitel, Hodel, Chava, Shprintze and Bielke, about their tasks. Yente, the village matchmaker, arrives to tell Golde that Lazar Wolf, the wealthy butcher, a widower older than Tevye, wants to wed Tzeitel, the eldest daughter. The next two daughters, Hodel and Chava, are excited about Yente's visit, but Tzeitel is unenthusiastic (\"Matchmaker, Matchmaker\"). A girl from a poor family must take whatever husband Yente brings, but Tzeitel wants to marry her childhood friend, Motel the tailor.\nTevye is delivering milk, pulling the cart himself, as his horse is lame. He asks God: Whom would it hurt \"If I Were a Rich Man\"? Avram, the bookseller, has news from the outside world about pogroms and expulsions. A stranger, Perchik, hears their conversation and scolds them for doing nothing more than talk. The men dismiss Perchik as a radical, but Tevye invites him home for the Sabbath meal and offers him food and a room in exchange for tutoring his two youngest daughters. Golde tells Tevye to meet Lazar after the Sabbath but does not tell him why, knowing that Tevye does not like Lazar. Tzeitel is afraid that Yente will find her a husband before Motel asks Tevye for her hand. But Motel resists: he is afraid of Tevye's temper, and tradition says that a matchmaker arranges marriages. Motel is also very poor and is saving up to buy a sewing machine before he approaches Tevye, to show that he can support a wife. The family gathers for the \"Sabbath Prayer.\"\nAfter the Sabbath, Tevye meets Lazar at Mordcha's inn, assuming mistakenly that Lazar wants to buy his cow. Once the misunderstanding is cleared up, Tevye agrees to let Lazar marry Tzeitel – with a rich butcher, his daughter will never want for anything. All join in the celebration of Lazar's good fortune; even the Russian youths at the inn join in the celebration and show off their dancing skills (\"To Life\"). Outside the inn, Tevye happens upon the Russian Constable, who has jurisdiction over the Jews in the town. The Constable warns him that there is going to be a \"little unofficial demonstration\" in the coming weeks (a euphemism for a minor pogrom). The Constable has sympathy for the Jewish community but is powerless to prevent the violence.\nThe next morning, after Perchik's lessons with her young sisters, Tevye's second daughter Hodel mocks Perchik's Marxist interpretation of a Bible story. He, in turn, criticizes her for hanging on to the old traditions of Judaism, noting that the world is changing. To illustrate this, he dances with her, defying the prohibition against opposite sexes dancing together. The two begin to fall in love. Later, a hungover Tevye announces that he has agreed that Tzeitel will marry Lazar Wolf. Golde is overjoyed, but Tzeitel is devastated and begs Tevye not to force her. Motel arrives and tells Tevye that he is the perfect match for Tzeitel and that he and Tzeitel gave each other a pledge to marry. He promises that Tzeitel will not starve as his wife. Tevye is stunned and outraged at this breach of tradition, but impressed at the timid tailor's display of backbone. After some soul-searching (\"Tevye's Monologue\"), Tevye agrees to let them marry, but he worries about how to break the news to Golde. An overjoyed Motel celebrates with Tzeitel (\"Miracle of Miracles\").\nIn bed with Golde, Tevye pretends to be waking from a nightmare. Golde offers to interpret his dream, and Tevye \"describes\" it (\"Tevye's Dream\"). Golde's grandmother Tzeitel returns from the grave to bless the marriage of her namesake, but to Motel, not to Lazar Wolf. Lazar's formidable late wife, Fruma-Sarah, rises from her grave to warn, in graphic terms, of severe retribution if Tzeitel marries Lazar. The superstitious Golde is terrified, and she quickly counsels that Tzeitel must marry Motel. While returning from town, Tevye's third daughter, the bookish Chava, is teased and intimidated by some gentile youths. One, Fyedka, protects her, dismissing the others. He offers Chava the loan of a book, and a secret relationship begins.\nThe wedding day of Tzeitel and Motel arrives, and all the Jews join the ceremony (\"Sunrise, Sunset\") and the celebration (\"The Wedding Dance\"). Lazar gives a fine gift, but an argument arises with Tevye over the broken agreement. Perchik ends the tiff by breaking another tradition: he crosses the barrier between the men and women to dance with Tevye's daughter Hodel. The celebration ends abruptly when a group of Russians rides into the village to perform the \"demonstration\". They disrupt the party, damaging the wedding gifts and wounding Perchik, who attempts to fight back, and wreak more destruction in the village. Tevye instructs his family to clean up the mess.\n=== Act II ===\nMonths later, Perchik tells Hodel he must return to Kiev to work for the revolution. He proposes marriage, admitting that he loves her, and says that he will send for her. She agrees (\"Now I Have Everything\"). They tell Tevye that they are engaged, and he is appalled that they are flouting tradition by making their own match, especially as Perchik is leaving. When he forbids the marriage, Perchik and Hodel inform him that they do not seek his permission, only his blessing. After more soul searching, Tevye relents – the world is changing, and he must change with it (\"Tevye's Rebuttal\"). He informs the young couple that he gives them his blessing and his permission.\nTevye explains these events to an astonished Golde. \"Love,\" he says, \"it's the new style.\" Tevye asks Golde, despite their own arranged marriage, \"Do You Love Me?\" After dismissing Tevye's question as foolish, she eventually admits that, after 25 years of living and struggling together and raising five daughters, she does. Meanwhile, Yente tells Tzeitel that she saw Chava with Fyedka. News spreads quickly in Anatevka that Perchik has been arrested and exiled to Siberia (\"The Rumor/I Just Heard\"), and Hodel is determined to join him there. At the railway station, she explains to her father that her home is with her beloved, wherever he may be, although she will always love her family (\"Far From the Home I Love\").\nTime passes. Motel has purchased a used sewing machine, and he and Tzeitel have had a baby. Chava finally gathers the courage to ask Tevye to allow her marriage to Fyedka. Again Tevye reaches deep into his soul, but marriage outside the Jewish faith is a line he will not cross. He forbids Chava to speak to Fyedka again. When Golde brings news that Chava has eloped with Fyedka, Tevye wonders where he went wrong (\"Chavaleh Sequence\"). Chava returns and tries to reason with him, but he refuses to speak to her and tells the rest of the family to consider her dead. Meanwhile, rumors are spreading of the Russians expelling Jews from their villages. While the villagers are gathered, the Constable arrives to tell everyone that they have three days to pack up and leave the town. In shock, they reminisce about \"Anatevka\" and how hard it will be to leave what has been their home for so long.\nAs the Jews leave Anatevka, Chava and Fyedka stop to tell her family that they are also leaving for Kraków, unwilling to remain among the people who could do such things to others. Tevye still will not talk to her, but when Tzeitel says goodbye to Chava, Tevye prompts her to add \"God be with you.\" Motel and Tzeitel go to Poland as well but will join the rest of the family when they have saved up enough money. As Tevye, Golde and their two youngest daughters leave the village for America, the fiddler begins to play. Tevye beckons with a nod, and the fiddler follows them out of the village."}