{"mid": "FierceCreatures", "IMDB_id": "tt0119115", "title": "Fierce Creatures", "plot": "The film opens with Willa Weston (Jamie Lee Curtis) arriving in Atlanta to take a high ranking position in a company recently acquired by Octopus Inc.'s owner, Rod McCain (Kevin Kline). But Rod informs her that he has already sold the company where she was to work. Willa then agrees to run another recent acquisition, Marwood Zoo, in an attempt to create a business model that can be used for multiple zoos in the future. Rod McCain's son Vincent (Kevin Kline), who feels an unreciprocated attraction to Willa, announces that he will join her at the zoo.\nThe newly appointed director of the zoo is a retired Hong Kong Police Force officer and former Octopus Television employee, Rollo Lee (John Cleese). In order to meet Octopus's revenue target of 20% from all assets, Rollo institutes a \"fierce creatures\" theme on the assumption that dangerous and violent animals will attract more visitors. All animals not meeting those requirements must go. All the animal keepers, including spider-handler Bugsy (Michael Palin), make various attempts to get Rollo to change his mind. One of which is getting Rollo to exterminate five cute animals himself. But Rollo, seeing through their prank, fakes the animals' extermination. Rolls keeps the animals in his bedroom which later caused Willa and Vincent to misunderstand that Rollo is having sex orgy with female staff.\nRollo discovers that several staffs are faking horrific animal attack injuries. Rollo fires several warning shots at those responsible and Reggae (Ronnie Corbett) rushed in, mistook one of them is shot. Rollo then finds a visitor who has had a genuine accident but, not believing it is real, tastes the blood of the visitor whilst loudly proclaiming that it is fake. Just then Willa and Vincent arrive and this fiasco sees Rollo demoted to middle management. Vince even threatens to fire him if his apparent activities with female staff do not cease.\nVince covers zoo and animals alike with advertisements after secretly garnering sponsors; dresses the staff in ridiculous outfits and installs an artificial panda in one the enclosures. His continued attempts to seduce Willa fail, while she comes to enjoy working at the zoo, after having a close encounter with a silver-back gorilla. She finds herself attracted to Rollo after becoming fascinated by his apparent ability to attract multiple women. When Rollo attempts to have a discussion about Vince's marketing plan, she suggests they have dinner. But she is forced to postpone when she remembers Rod is coming from Atlanta to discuss the running of the zoo.\nWorried that the visit may be part of a plan to close the zoo, Rollo and the zookeepers quickly bug Rod's hotel room to find out. Although the plan goes awry, they learn that Rod wants to turn over the zoo to the Japanese to make a golf-course and is not intending to die.\nUpon discovering that Vince has stolen sponsorship money he raised, Willa warns him to return it, or else, she will tell Rod. When Rollo attempts to work out how the theft can be traced,he and Willa finally kiss, just as Vince arrives to return the money. A confrontation takes place first at the zoo office, and then outside as Willa, Rollo, Bugsy and several others attempt to stop Vince from running off with the money. Bugsy refuses to shut up, so Vince loses his temper and grabs a pistol from the management office. Rod arrives just as Vince is being subdued and announces the police are on their way to arrest Vince for stealing. Vince tries and fails to shoot his father, but then Bugsy takes the pistol and accidentally shoots Rod between the eyes.\nIn the panic that follows, a plan emerges to fool Neville (Bille Brown) and the arriving police. The keepers work together to dress Vince up as Rod, since he can imitate his father's accent fairly well. When the police and Neville arrive, Vince (as Rod) tells them that he has re-written Rod's will, specifying that the zoo will become a trust of the caretakers while Vince will inherit everything else, and he wants all of them to be witnesses. After signing the new will, Vince locks himself in a caretaker hut where he feigns Rod's suicide. Although Neville becomes suspicious, he is left dumbstruck when he discovers the dead body of his boss in the hut (and Vince promptly fires him before he can recover).\nNow free, the zookeepers destroy the evidence of McCain's ownership. Vince becomes the new CEO of Octopus, while Willa and Rollo happily begin a new life together continuing to run the zoo."}