{"mid": "FiftyShadesOfGrey", "IMDB_id": "tt2322441", "title": "Fifty Shades of Grey", "plot": "Anastasia Steele (Dakota Johnson) is a business major at Vancouver University in Washington state. She goes to the Grey House building to interview the mysterious CEO of Grey Enterprises, Christian Grey (Jamie Dornan) in place of her sick roommate Kate Kavanagh (Eloise Mumford). Christian also happens to be a benefactor of the university. Ana asks Christian several questions prepared by Kate, including his being adopted at the age of 4 and if he is gay. Christian says he is definitely not gay. Ana is intimidated and clearly interested in him. After the interview, Christian escorts her to the elevator. He simply says, \"Anastasia,\" to which she replies, \"Christian.\"At school, Ana is approached by her friend Jose (Victor Rasuk), who is a photography major who announces his pictures are going to be part of an exhibit at school. Ana congratulates him, it is obvious that Jose harbors feelings for Ana.Ana works at a hardware store, Clayton's. She talks on the phone with her mother Carla (Jennifer Ehle), who informs Ana that she can't make it to her graduation because her boyfriend Bob (Dylan Neal) has broken his foot. Her manager Paul (Anthony Konechny) calls her over to help her in the back. Ana walks by an aisle and is startled to find Christian there. He requests several materials like duct tape and rope. Ana tries to keep her cool with him but she is very much enchanted by him.Christian poses for a photoshoot shot by Jose, with Ana and Kate in attendance. Kate notes that Christian is unable to take his eyes off Ana. Later, the two get coffee together. Christian discusses his family, as does Ana. She asks him if he has a girlfriend, to which he states that he doesn't \"do the girlfriend thing\". He asks her if she is interested in Jose or Paul, but Ana says no. As they walk down the street, Ana is almost hit by a biker until Christian pulls her out of the way. Before parting, he hands her a business card and states that he's staying at the Heathman Hotel.Following the end of their finals, Ana and Kate go to celebrate at a bar with Jose and a couple other friends. Ana gets pretty drunk and calls Christian while in line for the ladies room. Christian heads over to the bar to pick Ana up. Ana goes outside, and Jose follows her. He admits he likes her and tries to kiss her. Christian runs in and pushes Jose away from her. Ana then pukes and Christian holds her hair back before she passes out. He takes her back to his hotel room while leaving Kate with his brother Elliot (Luke Grimes).Ana wakes up in Christian's room wearing different clothes since he says her other ones were covered in vomit. Christian takes his shirt off and reveals what appear to be cigarette burns on his chest. He brings Ana some toast and gets his chauffeur Taylor (Max Martini) to fetch Ana some new clothes. There is some flirtation going on between the Christian and Ana, but he says he won't touch her until she gives him written consent. They walk to the elevator, but Christian decides, \"Fuck the paperwork\" and they kiss passionately. He takes her home, where they find Elliot and Kate having sex on the couch.Later on, Christian takes Ana on his private helicopter to his condo in the Escala Building in Seattle. There, he shows her his \"playroom\", which is filled with BDSM (Bondage Dominance Submission Masochism) materials like ropes, chains, whips, and floggers. Christian explains that he is a \"dominant\" and enjoys doing certain things with the consent of other women. Ana asks if it is love-making, but Christian says he doesn't make love, he \"fucks hard\". Ana is taken aback by this, but it doesn't push her away. She admits to Christian that she is still a virgin, a fact that surprises him. He decides to rectify this, and he takes her to the bedroom. He slowly undresses her and kisses her thighs. He lays her on the bed and proceeds to have sex with Ana, which she greatly enjoys. After the sex, Christian is in another room playing piano. A very naked Ana walks over to him, and they start kissing. He picks her up and takes her back to the bedroom.The next morning, Ana and Christian take a bath after she fixes up some breakfast. They are about to have sex again when Christian's adoptive mother Grace (Marcia Gay Harden) shows up. Ana meets Grace, who is delighted to get to know Ana. Grace hasn't seen Christian in a while, and he leaves to take a business call.Ana and Christian walk through the woods. He tells her that his first sexual experience was at the age of 15 with his mother's friend, who was also a dominant. Ana finds this fact to be disturbing, but Christian doesn't see it as such.Before Ana goes home, Christian gives her a folder with a contract and certain guidelines/explanations for their BDSM arrangement. When she gets home, Ana finds that Christian has sent her a laptop for them to keep in touch and for her to do research on the subject. Ana looks over the list of explanations for the dominant and submissive, including certain sex acts and codes during the actual acts. Ana is both curious and a bit mortified upon learning some of these things. She sends Christian a message saying it was nice knowing him.None too happy with this statement, Christian shows up in Ana's room. He gets her to lay in bed and he ties her wrists together with his necktie. He blindfolds her with her t-shirt and gets the rest of her clothes off. He kisses her body and runs an ice cube across her bare chest and stomach with his mouth. He then turns her around and starts to have sex with her doggie-style.The next day, Ana decides to meet with Christian privately in a business meeting of sorts to discuss the contract. Ana rules out any form of fisting (to Christian's disappointment) as well as the use of genital clamps. For the most part, she seems okay with some of the requests listed.The day of Ana and Kate's graduation arrives. Ana's father Ray (Callum Keith Rennie) shows up and sits with Kate's parents. Christian shows up and gives a speech. Two girls comment on how hot he is, and Ana leans over to them and says he's gay, to their dismay. After the ceremony, Ana introduces Christian to Ray after Kate refers to him as Ana's boyfriend. She and Christian get their picture taken for the newspaper. He also gives Ana a new red Audi as a gift, saying that he got Taylor to sell her old Beetle (something that she isn't happy with).On several other occasions, Christian continues to try and show Ana what she can expect if she is his submissive. He bends her over his lap and takes off her pants, spanking her a few times, which she sort of enjoys. He brings her back into the playroom, ties her hands, blindfolds her, and strips her nude. He whips her butt a few times with a riding crop, which seems to excite her.Ana joins Christian at his mother's house since his sister Mia (Rita Ora) has returned from her visit in Paris. Kate is also there as Elliot's date. During the dinner, Ana mentions that she is going to Georgia to visit her mother. Christian and Ana walk around the garden, and Christian is mad at learning that Ana is leaving.At night, as Ana lies in bed, Christian mentions his birth mother being a drug addict who died when he was four. He barely remembers her but he claims to sometimes dream about her.Ana heads to Georgia to be with Carla. At night she texts Christian and finds out he is going out for dinner with a friend. Asking, \" with Mrs. Robinson?\", Christian doesn't confirm or deny. The next day Ana and her mom discuss her new relationship over Cosmos at a hotel lounge. Ana gets a text from Christian saying, \"Not ANOTHER Cosmo,\" which startles her. He walks into the bar and introduces himself to Carla before ordering himself a drink. Later, Christian takes Ana up in a glider and thrills her with loops and rolls. On landing he gets a call and has to return to Washington immediately.Sometime later Ana returns to Washington with Taylor picking her up and dropping her off at the Escala Condo.Things get heated since Ana still hasn't officially signed the contract. She doesn't feel comfortable with the thought of Christian trying to punish her for his pleasure. He tells her that he doesn't want to hurt her nor does he want to do anything that she wouldn't want him to do. She asks him why he wants to do this, to which he responds that he is \"fifty shades of fucked up\". Christian takes Ana into the playroom and pulls her pants down to show her how extreme their BDSM relationship can be. He says he will whip her butt six times with his belt, and he makes her count. After the sixth hard whip, Ana is mortified and she retreats to the bedroom to lie in bed and cry. Christian is sweating and breathing hard, She doesn't want to see Christian right now. She tells him she's fallen in love with him, but she knows that she can't be what he wants her to be.Ana gets dressed and heads for the elevator, she leaves the laptop and asks for her VW Beetle back, Christian says it's too late but he'll send a cheque. Christian follows her and tries to stop her from leaving, but her mind is made up. As she steps into the elevator, he calls out to her, \"Ana...\" She only says, \"Christian\" as the elevator doors shut."}