{"mid": "FinalExam", "IMDB_id": "tt0082378", "title": "Final Exam", "plot": "Late at night, two college students are kissing in a parked convertible. Ignoring the girl's frequent objections, her boyfriend pushes on. Outside, an unknown killer attacks and cuts through the car's roof with a kitchen knife. Soon, the boyfriend is grabbed by the killer and is stabbed on the car's hood while the girlfriend screams hysterically.\nLanier College is nearing the end of a final exam week. To assist certain members pass a chemistry final, a fraternity fakes a mass shooting as a distraction. The students prepare for their tests as well as the coming vacation break, while unbeknownst that the killer is stalking them. Courtney (Cecile Bagdadi) is completing her exams and is studying hard; averse to hitting the books, her roommate Lisa (DeAnna Robbins) is busy packing and getting back to the city. Meanwhile, Gamma Delta fraternity pledge Gary (Terry W. Farren) is suffered from a prank where he is tied up against a tree until nightfall, but the killer soon murders him after untying him. His girlfriend Janet (Sherry Willis-Burch) comes to find Gary before she is attacked and killed off-screen by the murderer.\nGamma brother Wildman (Ralph Brown) is looking for pain pills for his frat to sell on the open market, where he is then led into the darkened campus gym. After finding pills, he is then attacked by the killer where he is cornered into the weight room and is garroted from a weight machine. Soon after, Mark (John Fallon) discovers Wildman's body in the locker room, before chased by the killer into the college's electrical building where he is stabbed from the killer emerging out of a barrel. Meanwhile, fellow nerd Radish (Joel S. Rice) finds Mark's body in a locker and immediately calls the police, but the authorities are disbelieving due to ongoing pranks from the Gamma house. Running to Courtney's room, the killer breaks through the door and grabs him to his demise. Shortly thereafter, Courtney returns to her dorm where she finds Radish's body hanging through her broken door. Frightened, Courtney tries to rouse help from a now abandoned dorm, but the campus is now desolate.\nMeanwhile, Lisa is awaiting her boyfriend Charlie in the conservatory, where the killer enters the room and stabs her. While in the conservatory, Courtney hears music from the piano room and is confronted by the killer; she flees into the cafeteria where she arms herself with a knife. After a chase throughout the school, she frantically wanders outside in the quad before seeking refuge in the campus tower. Screaming for help inside the tower, the college's coach (Jerry Rushing) arrives and shoots at the killer with an arrow. Brazenly, the killer catches the arrow and stabs it into the coach, killing him. During the struggle, Courtney succeeds as the killer is fallen down the two-story tower. On the bottom floor, the killer grabs Courtney's ankle, before she repeatedly stabs the killer to his death 12 times. Still night time, Courtney walks out of the tower now alone and the film ends with her sitting out on the steps."}