{"mid": "FinalGirl", "IMDB_id": "tt2124787", "title": "Final Girl", "plot": "A seven-year-old Veronica meets with a man named William after her parents have died. He asks her how she feels about it, and she responds that people die all the time. After she demonstrates total memory recall, he offers to take her in and train her for a job that is only for \"special\" people. After he explains that his wife and child were killed by \"a very bad man\", she accepts.\nTwelve years later in the 1960s America, a now blonde-haired Veronica prepares to finish training. She and William enter the woods so she can acclimate to running through the woods barefoot. William explains she cannot use a gun since they are useless after running out of bullets. William teaches her how to put someone in a choke-hold. For the last piece of her training, she is given a combination of truth serum and a hallucinatory drug to confront her greatest fear. This is so she can understand what her victims will be experiencing. Despite believing herself fearless, Veronica confronts her fear of failure.\nFour seventeen-year-old boys named Jameson, Daniel, Nelson, and Shane meet at a diner. Jameson, their leader, chooses blonde women to hunt and kill. Their latest prey is a waitress named Gwen. The boys take her to the woods, where they shoot her dead. On a recon mission, Veronica meets Shane's girlfriend, Jennifer, at the diner. They bond over their boy issues, revealing Veronica's romantic feelings for William despite their age difference and her realization that he is emotionally unavailable. Jennifer tells her the boys are on the verge of falling apart. Next, using herself as bait, Veronica meets Jameson at the diner and accepts a date and is told to come with clean hair and red lipstick.\nBefore leaving, Veronica writes \"I Love You\" in lipstick on her mirror. The boys pick her up at the diner and take her to the woods, where they play truth or dare. Offering a whiskey flask to the boys from her purse, she tricks all except Jameson into drinking the hallucinogen. She draws the dare 'Die' and asks to go home, but they refuse to take her. Jameson assures her that they will not rape her because women do not run so well following sexual assault. He gives her five minutes to run, which she takes before getting rid of her heels so she can fight. The boys do not wait and go after her immediately.\nThe first boy, Daniel, hallucinates two panda heads in suits coming after him, who is actually Veronica, who then kills him with his own axe. Next, Veronica goes after Nelson. He sees a group of gray figures circling around him whom he tries to fight. His mother appears and they kiss deeply before he dies as Veronica crushes his head with a rock. Jameson discovers his friends' bodies and is intrigued.\nA car drives up to the front of the woods, and Jennifer gets out. She finds Jameson and asks for Shane; however, Jameson comes onto her. Before she started dating Shane, she lost her virginity to Jameson. She gives into his advances just as they start kissing Shane appears. Betrayed, he punches Jameson, who taunts him by saying people like them cannot love. Jameson explains to Jennifer what they do in the woods, despite Shane's protests. Shane punches out Jameson and, while saying he loves her, chokes Jennifer. It turns out to be a hallucination, as Jennifer is revealed to actually be Veronica before she strangles him.\nJameson and Veronica come face to face and talk before fighting. They play a game of asking questions where one has answer correctly whatever being asked. Jameson says he has killed 21 women, counting her. When Veronica reveals she enjoyed killing his friends, he proposes they work together, but she refuses. They fight until he passes out from a choke-hold that William taught Veronica earlier. She forces him to drink the drugged alcohol and, when he awakens, finds himself hanging from a tree. Crying, he begs for his life, swearing that he will never kill again but Veronica doesn't believe him. As the drugs take effect, his victims, including Gwen, come out of the trees and move toward him. In his haste to get away, Jameson steps off a tree stump and hangs himself. William appears and congratulates Veronica, and they go to the diner to eat pancakes."}