{"mid": "FistOfTheNorthStar", "IMDB_id": "tt0113074", "title": "Fist of the North Star", "plot": "In the 1990s, civilization was ruined as a result of a worldwide nuclear war and many creatures died out. In spite of these events, 30% of mankind survived and entered an age where the strong ruled over the weak, as the few survivors fought over whatever supply of food and uncontaminated water remained in the wasteland of the world.\nKenshiro, successor to the ancient assassination art of \"Hokuto Shinken\", wanders into a village in search of water when he is caught in a trap and imprisoned by the local defense force. In prison, he befriends a young orphaned girl named Rin who nursed him back to health. When the village is attacked by a biker gang and Rin is taken hostage by their leader, Ken breaks free from his cell and rescues Rin, defeating the gang leader with his deadly martial art technique. Kenshiro leaves the village and continues his journey, now accompanied by a young thief named Bat. He becomes involved against the King organization after witnessing the many atrocities they have committed. As he infiltrates the gang's stronghold in the city of Southern Cross, he finds out that the leader of King is his old nemesis, the Nanto Seiken master Shin, the man who engraved the seven scars on Kenshiro's chest and kidnapped his fiancée Yuria. Kenshiro emerges victorious in his rematch with Shin, only to find out from Shin that Yuria killed herself in despair. Shin, not wanting to die by Kenshiro's hand, kills himself in the same manner.\nKenshiro continues his journey, fighting against the Golan army, Jackal's gang and the Fang Clan. After being reunited with Rin and meeting new allies such as the woman warrior Mamiya and the Nanto Suichōken successor Rei, Kenshiro learns that Jagi, a violent thug who sought to torment Kenshiro after losing the Hokuto Shinken succession to him, is still alive. Jagi seeks vengeance against Kenshiro by committing heinous crimes while impersonating him, seeking to defame Kenshiro, but is quickly exposed and eliminated. Just before dying, however, Jagi discloses to Kenshiro that their other two brothers-in-training are still alive. Kenshiro goes on to search for the second brother, a gentle healer named Toki, and learns that he is being kept prisoner in the dungeon city of Cassandra. After rescuing Toki, Kenshiro learns that Raoh, the eldest of the four brothers, has become a ruthless warlord known as \"Ken-Oh\" (King of the Fist) and is now seeking to conquer the post-apocalyptic world. Kenshiro goes on to challenge Raoh, but the long grueling battle ends in a stalemate and the two warriors are forced to settle their differences another day. Rei is fatally wounded as a result of a previous battle with Raoh and he spends the last few days of his life tracking down his nemesis Juda, successor of Nanto Kōkakuken, who once tormented Mamiya in the past. After defeating Juda, Rei goes on to die, at peace with himself.\nWith Raoh still recovering from his wounds, another warlord, the Nanto Hōōken successor Thouzer, proclaims himself as the Holy Emperor. Kenshiro joins a resistance movement led by an old benefactor, the Nanto Hakuroken successor Shew. When Shew is captured and executed by Thouzer, Kenshiro confronts Thouzer and foils his ambitions. With Thouzer now gone, Raoh recovers from his wounds and goes on to resume his reign of conquest. Toki, who is on the verge of dying as a result of intense radiation poisoning, challenges Raoh as part of a childhood promise they made to each other, but is ultimately no match for him. Raoh can't bring himself to land a killing blow on his own brother, and leaves after defeating Toki. After Toki dies in a battle against the freelance warrior (and Yuria's brother) Ryuga, Kenshiro is left as the only one who can defeat Raoh.\nThe Last General of Nanto appears and decides to side with Kenshiro in order to defeat Raoh, sending out her five guardians, the Goshasei, after Raoh. Kenshiro and Raoh both learn that the General's true identity is Yuria, Kenshiro's missing fiancee, who had been saved by the Goshasei after her suicide attempt early on in the story. After a series of numerous events and battles, Kenshiro emerges victorious over Raoh and he is finally reunited with Yuria. However, the victory is bittersweet, as Yuria, having affected by radiation sickness, has only a few years left to live. Kenshiro leaves his friends and spends the final few years of Yuria's life with her.\nThe peace that follows Raoh's downfall does not last long and the world returns to turmoil several years later. Kenshiro rejoins his former traveling companions, Bat and Rin, in their battle against an oppressive Empire, fighting under the banner of the Hokuto Army. The Hokuto Army rescues the rightful Empress Rui, who is also Rin's estranged twin sister, foiling the plot of the usurper Jakoh, who was blackmailing Rui's guardian, the Gento Kōken successor Falco, to do his evil bidding.\nHowever, Rin is taken captive by the remnant of Jakoh's forces and is sent off to the mysterious Kingdom of Shura, a brutal land of warriors ruled by three overlords who have all mastered the ways of Hokuto Ryūken, a martial art which branched off from the same clan alongside Hokuto Shinken into the ways of darkness. Kenshiro defeats Han, the third-ranking overlord, who reveals that the Kingdom of Shura was Kenshiro's birthplace. Moreover, Kenshiro also learns that Hyou, the second overlord, is his biological older brother. After a grueling battle, Hyou and Ken reconcile their differences and Kenshiro seeks out the highest-ranking and most powerful of the three overlords, Kaioh, who is Raoh's biological older brother, and plans a conquest to rule the post apocalyptic world in the name of evil after wiping out the followers of Hokuto Shinken. However, Kenshiro is ultimately helpless against Kaioh's evil powers, and the man known as Shachi, a feared righteous warrior throughout Shura, helps him nearly escape death. After having recovered from the harrowing fight, Hyou reveals to Kenshiro that the homeland of the progenitor clan of all Hokuto style martial arts, the Hokuto Soke, lies in Shura, and holds the secrets of overcoming Kaioh's overwhelming power. Upon gaining the favor of the spirits of the Hokuto Soke, and rightfully bestowed the ancestral techniques in a race against Kaioh, Kenshiro goes to confront the conqueror. When Kenshiro and Kaioh meet up again, the latter hits a pressure point on Rin that renders her unconscious and amnesiac and will force her to fall in love with the first person she sees; Kaioh then sends her away on a horse before rematching Kenshiro. The final battle concludes with Kenshiro defeating Kaioh, who makes his peace with Hyou as both of them pass away.\nAfterward, Kenshiro rescues Rin and leaves her under Bat's care as he goes on an adventure with Raoh's orphaned son Ryu. Meanwhile, a villain named Bolge appears, seeking revenge against Kenshiro for blinding him in a fight a long time ago. Bat brands himself with Kenshiro's seven scars and fights in his place, only to be crucified by Bolge and tortured to near-death. Kenshiro rescues Bat, then fights and kills Bolge, while Rin regains her memories and professes her love to a recovering Bat. Afterwards, Kenshiro leaves and continues his role as the Post-Apocalyptic Savior, defending the weak and fighting off the greedy and violent, as the world finally begins to recover from the nuclear war."}