{"mid": "Fitzcarraldo", "IMDB_id": "tt0083946", "title": "Fitzcarraldo", "plot": "Brian Sweeney \"Fitzcarraldo\" Fitzgerald (Klaus Kinski) is an Irishman living in Iquitos, a small city east of the Andes in the Amazon Basin in Peru in the early part of the 20th century, when the city grew exponentially during the rubber boom. He has an indomitable spirit, but is little more than a dreamer with one major failure already behind him – the bankrupted and incomplete Trans-Andean railways. A lover of opera and a great fan of the internationally known Italian tenor Enrico Caruso, he dreams of building an opera house in Iquitos. Numerous Europeans and North African Sephardic Jewish immigrants have settled in the city at this time, bringing their cultures with them. The opera house will require considerable amounts of money, which the booming rubber industry in Peru should yield in profits. The areas in the Amazon Basin known to contain rubber trees have been parceled up by the Peruvian government and are leased to private companies for exploitation.\nFitzcarraldo explores entering the rubber business. A helpful rubber baron points out on a map the only remaining unclaimed parcel in the area. He explains that while it is located on the Ucayali River, a major tributary of the Amazon, it is cut off from the Amazon (and access to Atlantic ports) by a lengthy section of rapids. Fitzcarraldo sees that the Pachitea River, another Amazon tributary, comes within several hundred meters of the Ucayali upstream of the parcel. He plans to investigate that.\nHe leases the inaccessible parcel from the government. His paramour, Molly (Claudia Cardinale), a successful brothel owner, funds his purchase of an old steamship (which he christens the SS Molly Aida). After recruiting a crew, he takes off up the Pachitea, the parallel river. This river has dangerous interior areas because of its indigenous people hostile to outsiders. Fitzcarraldo plans to go to the closest point between the two rivers and, with the manpower of impressed natives (who are nearly enslaved by many rubber companies), physically pull his three-story, 320-ton steamer over the muddy 40° hillside across a portage from one river to the next. Using the steamer, he will collect rubber produced on the upper Ucayali and bring it down the Pachitea and the Amazon to market at Atlantic ports.\nThe majority of the ship's crew, at first unaware of Fitzcarraldo's plan, abandon the expedition soon after entering indigenous territory, leaving only the captain, engineer, and cook. Impressed by Fitzcarraldo and his ship, the natives start working for him without fully understanding his goals. After great struggles, they successfully pull the ship over the mountain with a complex system of pulleys, worked by the natives and aided by the ship's engine. When the crew falls asleep after a drunken celebration, the chief of the natives severs the rope securing the ship to the shore. It floats down the river. The chief wanted to appease the river gods, who would otherwise be angered that Fitzcarraldo defied nature by circumventing them.\nThough the ship traverses the Ucayali rapids without major damage, Fitzcarraldo and his crew are forced to return to Iquitos without any rubber. Despondent, Fitzcarraldo sells the ship back to the rubber baron, but first sends the captain on a last voyage. He returns with the entire cast for the first opera production, including Caruso. The entire city of Iquitos comes to the shore as Fitzcarraldo, standing atop the ship, proudly displays the cast."}