{"mid": "FiveEasyPieces", "IMDB_id": "tt0065724", "title": "Five Easy Pieces", "plot": "Bobby Dupea (Jack Nicholson) works in a California oil field (shot in and around the city of Taft in the San Joaquin Valley) with his friend Elton (Billy \"Green\" Bush), who has a wife and baby son. Bobby spends most of his time with his waitress girlfriend, Rayette (Karen Black), who has dreams of singing country music, or in the company of Elton, with whom he bowls, gets drunk, and has sex with other women. Bobby has evidently not told Elton that he is a former classical pianist who comes from an upper-class family of musicians.\nRayette gets pregnant and Elton is arrested for having robbed a gas station a year earlier. Bobby quits his job and leaves for Los Angeles where his sister, Partita (Lois Smith), also a pianist, is making a recording. Partita informs him that their father, from whom Bobby is estranged, has suffered two strokes. She urges Bobby to return to the family home in Washington state, to visit their father.\nRayette threatens to kill herself if Bobby leaves her, so he reluctantly asks her along. Driving north, they pick up two women headed for Alaska, one of whom is obsessed with \"filth\". The four of them are thrown out of a restaurant when Bobby gets into an argument with a waitress who refuses to accommodate his special order. Reaching his destination, Bobby, embarrassed by Rayette's lack of polish, registers her in a motel before proceeding to his family home on an island in Puget Sound.\nHe finds Partita giving their father a haircut, but the old man seems completely oblivious to him. At dinner, Bobby meets Catherine Van Oost (Susan Anspach), a young pianist engaged to his brother, Carl (Ralph Waite), a violinist. Despite personality differences, Catherine and Bobby are immediately attracted to one another and make love in her room.\nRayette runs out of money at the motel and comes to the Dupea estate unannounced. Her presence creates an awkward situation, but when Samia, a pompous family friend, ridicules her, Bobby comes to her defense. Storming from the room in search of Catherine, he discovers his father's male nurse giving Partita a massage. Now more agitated, he picks a senseless fight with the nurse, who knocks him to the floor.\nBobby tries to persuade Catherine to go away with him, but she declines, believing he does not love himself, or indeed anything at all. After trying to talk to his unresponsive father, Bobby leaves with Rayette, who makes a playful sexual advance that he angrily rejects. When Rayette goes in for some coffee at a gas station, he gives her his wallet and then abandons her, hitching a ride on a truck headed north."}