{"mid": "Flesheater", "IMDB_id": "tt0109809", "title": "FleshEater", "plot": "A group of teenage kids are taking a hayride in the countryside on Halloween. They pay the local farmer to take them to a secluded area of the forest. The kids arrive and begin drinking, telling the farmer to come back after dark to pick them up. As the party wears on the group separates to find their own little love nests.Meanwhile, another farmer has stumbled across a large tree stump which he proceeds to remove with the help of his tractor. Under the stump is a large wooden box with an ancient seal telling not to break open the box. The farmer breaks the seal and opens the box. Inside is the \"Flesheater\", a zombie who precedes to eat the farmer making him a zombie in the process. Both zombies head towards where the kids are.Two of the kids who retreated to the barn for some alone time are killed by the Flesheater. As the ghoul is killing the kids, two of their friends walk in and see what's happening then they run outside back to the woods to warn the group at the party. Inside the barn, the kids who were attacked become zombies and head out of the barn to look for for fresh victims. One of the girls is attacked in the woods by the Fleasheader. It tears a chunk of shoulder away but the girl is saved by her boyfriend who hears her screams and tackles the ghoul.The remaining kids retreat to the old \"Spencers Farm\" a dis-used farmhouse in the woods. They proceed to nail up the windows and doors. They manage to phone the police but the call is cut short when a zombie outside rips the phone line out.Meanwhile, the two kids who escaped from the barn have caught up with the group (who refuse to open the doors in case of an attack) so the two kids hide in the basement and lock the door. Upstairs, the girl bitten on the shoulder dies and returns as a zombie. Just as she gets up the Fleasheader and the rest of the zombies outside break in and all of the remaining group are slaughtered, each becoming a zombie and heading into the woods for more victims.A little later at nightfall, a police car then turns up at Spencer's farm responding to the cut-short phone call. The police officer is attacked by a group of zombies, and despite killing two of them by shooting them in the head, he is attacked and eaten alive. The two kids in the basement open the door and see the body of the policeman. They take his gun and kill his half remaining zombie corpse and escape into the night.The Fleasheater and some of the zombies find their way to a residential street where they proceed to eat a local family inside their home turning them into zombies in the process.Meanwhile, the two kids find a local stable where they try to warn the owner about the coming attack. He goes inside the house to find that his wife has become a zombie. More zombies appear and the man is cornered and eaten alive and the kids flee again.They find a large barn where a Halloween party is being held. The kids try to warn the group about the undead but they laugh it off as Halloween nonsense. Soon the zombies arrive and slaughter all of the party-goers. The two kids who survived the basement find a hiding spot inside the framework of the barn.Back in town, the police department is assembling a posse after hearing of the officer who was killed at Spencer's farm. As daylight approaches, the posse have arrived at the woods. They find zombies emerging from the woods and proceed to kill the creatures. They proceed through the woodland killing zombies as they go. The posse arrive at the barn and find the party-goers are all zombies. The posse kill them as the zombie group come out of the barn. The two kids hiding in the barn hear the gunshots and think they are saved. They exit the barn and are shot on site by sniper rifle (by the same actor who shoots Ben in Night of the living dead).The posse throws all the bodies inside the barn and barricade it shut. They set it on fire burning the remaining few zombies inside. The posse thinking they destroyed all the zombies head home.A few days later, a police officer is checking out the remains of the barn when he is attacked by the original Flesheater, who kills him by biting his neck out... and the zombie outbreak begins all over over again.***********************************************************************************************************\nAddition to synopsis by movewtcher:WARNING: Adult Language\nThe movie starts out with a quote This evil which will take flesh and blood from thee and turn all ye unto evil. Kids on a hayride. We see a farmer putting a strap around a stump of a tree. The hayride continues down the road and one of the kids asks Where is he taking us? There are 10 teens and they jump off the trailer. One of the teens says Sammy Perkins and his girlfriend came up to the woods a year or so ago to go parking and no one saw them again. One of the girls said that Sammy joined the army and Janie got pregnant and went to Virginia to her aunts to have the baby. He said that a good source says they were murdered up there. Old man Spences dog came home one day with a hand in his mouth with a ring that had the initials SHP on it. One of the teens start smoking a joint. Two teens are sucking face by a tree when Eddie <James J. Rutan> is shaking a beer, opens it and sprays the lovers. The girl calls Eddie an asshole. We go back to Farmer Dave <DavidA. Sogergren> who tears the tree trunk out of the ground with a John Deere tractor #2630. The farmer starts clearing leaves and dirt from the ground and finds a slab of cement with a circle carved into ithe thinks it was college kids on his property again. As he is clearing the area he finds a seal with the words This eviletc. carved on it. The farmer pries the saying off the coffin and opens it. The body comes to life and tears the farmers throat out and sucks his blood. Back to the kids: they are dancing and laughing. One of the girls starts stripping and shows her bare breasts to her boyfriend. (The farmer gets up and growls.) A couple goes off and spreads a blanket on the hay in the barn. Carrie <DeniseMorrone> tells Bill <Mark Strycula> that she just wants to have fun and has liked him since Julies party. They are kissing in the barn and the Carrie puts Bills hand on her breast. The shirt comes off and you see her bare right breast. The girl hears something and it happens to be the Flesheater <S. William Hinzman>. Bill grabs a pitchfork and shoves it at Flesheater. Flesheater takes the pitchfork off Bill and rams it into the boys chest. Flesheater grabs Carrie, strangles her and shoves his hand through her stomach. He digs out her liver and guts and blood and gore everywhere. The rest of the group is sitting around drinking beer. The hayride driver <Tom Madden> suggests a fire. The driver says if they want to stay the night in the woods that it gets real cold there. One of the teens says that Carrie and Bill can stay warm in a snow storm but the rest of them couldnt . The driver says he will come back at midnight and the teens could tell him then if they want to say in the woods all night. The teens go to collect firewood. Eddie scares Lisa <Charis Kirkpatrik Acuff>. The hayride driver tries to start his rig and one of the teens comes up behind him and asks him to get some beer for them. The zombie farmer <David A. Sogergren> grabs the hayride driver by the neck, chokes him, and eats him. Lisa finds the zombie with a big hunk of flesh between his teeth and runs. The Flesheater grabs her and takes a huge chunk of flesh out of her neck. The teens take Lisa to a farmhouse. Bill and Carrie arise as zombies. The teens try to find weapons and board up the windows and door. Eddie turns away Bob <John Mowod> and Sally <Leslie Ann Wick>. They hide in the storm cellar. Ralph <Kevin Kindlin> uses a phone and calls the sheriffs office. They are staying in Spences farm off Route 5. He tells the dispatcher <Terrie Godfrey> that they were attacked by a monster and the dispatcher wants to know if it was a Godzilla type of monster or a Frankenstein type of monster. Flesheater rips the phone wire off the side of the house and the phone goes dead. Ralph shot the hayride driver in the head with a shotgun. Flesheater breaks into the farm and puts a hatchet through Tonys <Matther C. Danilko> head. Everyone upstairs is now living dead. Blood runs from the ceiling in the storm cellar and splatters on Sallys face. The dispatcher calls Harv <David Ashby> and tells him to go to Spences farm. Cut to a nice house: Susan <Susan Marie Spier> takes off her clothes. Full frontal nudity. A shower scene. Caramel apples are being made by Chris <Chris Bross>. Susan is still showering. More nudity as Susan showers in a glass shower stall. Susan comes out and blow dries her hair. Heidi <Heidi Hinzman> answers a knock at the door and theres Flesheater to trick-or-treat. Flesheater grabs Heidi and eats her as blood splatters all over a Krunch bar. Zombies attack the house and eat. Flesheater rips Susans towel off and eats her. Harv arrives at the farm and sees a zombie with his head blown off. The sheriff is bitten by a zombie. They surround his car and eat him but he manages to shoot one zombie first. Bob and Sally come out of the storm cellar and find the sheriff laying in his car with his guts hanging out of his body and his face torn off. His arm lies on the ground. The mass that was once the sheriff, rises and Bob shoots him. Farmer Ned <Rik Billock> and Farmer Neds wife <Jackie Sodergren>. The wife asks Ned if he is going to feed the horses. Ned puts on his red cap and goes out to his barn. Bob and Sally find Ned. They ask for a phone. Cut to the news about a prostitution operation. The Water Authority increases rates 18% next year and the tax payers will pay $48.00 per year. A fire at 181 South something street. Damages were 80k, no injuries. Zombies eat Ned. A Halloween party in a barn where teens are drinking Iron City Beer. Bob and Sally warn the party attendees. The vampire <Andrew Sands> tells Bob and Sally that they have watched too many cheesy zombie movies. A zombie bites off the vampires nose and blood gushes out of his face. A Posse forms. The sheriff (a different one) tells the crowd to shoot em dead! Bob and Sally are still hiding. Bob and Sally have been dating for almost two years. Blah, blah, talk, talk. Sally suggests they go away to Tampa. Her sorority motto is The future lies ahead. Bob and Sally come out of hidingthe posse shoots them in the head (ala Night of the Living Dead.) The sheriff torches the barn. There are sounds of zombies screaming. A sheriff walks around the burnt out barn and finds burnt zombies. Flesheater gets the sheriff. The End."}