{"mid": "Fletch", "IMDB_id": "tt0089155", "title": "Fletch", "plot": "Los Angeles Times reporter Irwin \"Fletch\" Fletcher (Chase) is writing an article exposing drug trafficking on the beaches of Los Angeles. Posing as an addict during his investigation, he is approached by Boyd Aviation executive vice president Alan Stanwyk (Matheson) who mistakenly assumes Fletch is a junkie. Stanwyk claims to have bone cancer, with only months left to live, and wishes to avoid the pain and suffering. Stanwyk offers $50,000 for Fletch to come to his mansion in a few days time, kill him, and then escape to Rio de Janeiro, staging the murder to look like a burglary.\nFletch, while not completely convinced on the truth of Stanwyk's story, reluctantly agrees to the plan. Along with his colleague Larry (Davis), he begins investigating Stanwyk instead of completing his drug trafficking exposé, much to the disapproval of his overbearing editor Frank Walker (Libertini). Disguised as a doctor, Fletch accesses Stanwyk's file at the hospital and learns Stanwyk lied about having cancer.\nFletch visits Stanwyk's wife Gail (Wheeler-Nicholson) at her tennis club. Pretending to be a tennis instructor and friend of Alan's, he flirts with her during an impromptu tennis lesson. Looking into Stanwyk's finances, Fletch finds that Gail recently converted $3 million of her personal stock in Boyd Aviation into cash for her husband, to buy a ranch in Provo, Utah. Fletch breaks into the realtor's office and discovers the deed lists the sale price as only $3,000.\nMeanwhile, LAPD Chief Jerry Karlin (Baker) learns of Fletch's drug article. He warns Fletch that the article will jeopardize his undercover operation on the beach. Karlin threatens to kill Fletch unless he agrees to drop the investigation. At the tennis club, Fletch overhears an arrogant club member, Mr. Underhill, insulting a waiter and decides to use Underhill's tab to treat Gail to an expensive lunch in her private cabana. Fletch reveals Alan's murder scheme to her and tells her the true price of the ranch.\nFletch watches Stanwyk making a suspicious briefcase exchange with Chief Karlin, but is unable to determine the nature of their relationship. He returns home to find LAPD officers lying in wait at his apartment. He flees, but is pursued in a harrowing car chase. Forced to go into hiding, Fletch returns to Provo. Posing as an insurance investigator, he interviews Stanwyk's parents. Fletch discovers Stanwyk has been secretly married to another woman for eight years; his bigamous marriage to Gail allowed him access to her personal wealth.\nFletch arrives at Stanwyk's mansion on the night of the planned murder, but finds Stanwyk prepared to kill him instead. Fletch reveals his discovery of Stanwyk's real plan: to fake his own death by killing Fletch and burning his body beyond recognition, then escape to Brazil with his first wife and Gail's $3 million. Stanwyk was also using his private jet to smuggle cocaine from South America to supply Chief Karlin, who blackmailed ex-convicts to peddle it on the beaches. Karlin arrives unexpectedly; learning of Stanwyk's intention to flee with $800,000 of the Chief's drug money, he kills Stanwyk. Karlin and Fletch fight over the gun until Gail strikes Karlin from behind, rendering him unconscious.\nKarlin is indicted with Fletch's testimony. Fletch begins dating Gail and, in the final scene, takes her on a vacation to Rio, again using Mr. Underhill's tab."}