{"mid": "Flight", "IMDB_id": "tt1907668", "title": "Flight", "plot": "In the opening scene in a hotel room, Whip Whitaker (Denzel Washington) wakes up before it's time to take off on a new flight, after an evening of drinking, drugs and sex with one of his plane's flight attendants, Katerina Marquez (Nadine Velazquez) who crawls out of his bed to get dressed. Still trying to rouse himself from his hangover, his phone rings, and he answers a call from his ex-wife Deana (Garcelle Beauvais). Deana wants to discuss putting their son through a private school, but Whip doesn't want to discuss it at the moment, claiming he'll talk to her about it when he gets back to Atlanta.While Katerina quickly heads off to the airport to prepare, Whip is unable to collect himself until he snorts a line of cocaine. This wakes him up, and he is next headed to the airport, where rain pounds the building and the airplanes. Whip does a quick inspection of the airplane and then boards it speaking with a flight attendant named Margaret (Tamara Tunie), and meeting his co-pilot Ken Evans (Brian Geraghty).Ken seems a little apprehensive of Whip (who is wearing sunglasses and takes a hit from his oxygen mask), but goes along with his story that he's alright to fly. The plane takes off through rain, and Whip pushes it higher and faster, attempting to find a break in the clouds, causing the ride to be turbulent. However, once Whip finds a break in the storm, the plane stabilizes, and the passengers applaud.Shortly after takeoff, Whip addresses the passengers personally, while secretly pouring three mini-vodka bottles into a bottle of orange juice. After disposing of the bottles, Whip returns to the cockpit, and naps after turning control of the plane over to Ken.On the ground, in a small town in Georgia, a prostitute, Nicole (Kelly Reilly), leaves a hotel after a night with a client and calls her drug connection from her cell phone. She shows up at the guy's place, where a porno film is being shot and buys a small quantity of heroin from him; he warns her not to shoot too much because it hasn't been cut properly. He also asks her to play a part in the movie but she refuses and leaves. At home she finds her sleazy complex manager in her apartment. The two argue over her unpaid rent and he propositions her sexually. She coaxes him out the door and slams it in his face. Spotting a hypodermic needle in her things, she takes a hit of the drugs she bought from her connection and passes out from an overdose.Meanwhile, a sudden jolt stirs Whip as the plane suddenly pitches into an uncontrolled dive. Steering mechanisms don't respond, and numerous houses can be seen out the window. Staying relatively calm, Whip has the plane's fuel ditched, before proposing a crazy maneuver: roll the airplane so they're flying inverted. One of the stewardesses, Camila, leaves her seat to aid some of the passengers and is pitched onto the ceiling of the cabin when the plane rolls. A young boy falls out of his seat when the plane rolls over and Katerina unbuckles herself, lifts the boy back into his seat and buckles him in.With Ken and Margaret's help, Whip inverts the plane, leveling it out, before rolling it to crash-land on its belly in a field near a small church -- the plane's wing collides with the church's tower, shearing it off. The ground impact slams Whip's head against the steering yoke, knocking him out. Whip regains consciousness long enough to see himself being dragged out of the plane by the local parishioners and long enough to see Ken is slumped over in his seat, bleeding from his head. Margaret is also bleeding and screaming. Katerina's body also lies near Margaret, presumably dead.Just before the plane crashes into the church, it flies directly over Nicole's apartment complex where we see her being taken out on a stretcher.Whip wakes up in a hospital where he finds his friend Charlie Anderson (Bruce Greenwood) in the room. Though Charlie claims Whip saved a lot of lives with his maneuver, he tells Whip (off-the-record) that there were six deaths, including Katerina and Camila as well as four passengers.Shortly afterwards, Whip is visited by an acquaintance of his, Harling Mays (John Goodman). Harling brings Whip some cigarettes and some extra things, and fields Whip's request for some clothing and items from his house. Harling is jovial about the treatment Whip is receiving, saying Whip should demand better medications. Harling also tells Whip that his heroics during the crash have called the media out to his home and the hospital.Looking for a place to smoke one evening, Whip goes into a stairwell, where he encounters Nicole. They are soon joined by a cancer patient named Mark (James Badge Dale). The cancer patient soon realizes who Whip is, and steers the conversation towards God and if disasters can be prevented or not. In Mark's mind, there's no way to stop things from happening. To him, he was meant to get cancer, just as much as the three were meant to meet in the stairwell, and Whip was meant to land that plane. After Mark leaves, Whip tells Nicole that he would like to see her after they are released from the hospital, and she gives him her address.Eventually, Whip is released, and Harling sneaks him out a back way to avoid the press at the front of the hospital. Whip has Harling take him to his father's old farmhouse out in the country, where a small Cessna resides in a nearby garage. Going through the house, Whip finds all the alcohol stored around the place, and empties it all out. He also disposes of a small supply of marijuana.Whip refuses to respond to any of the messages on his phone, but is surprised when Charlie calls him at the farmhouse, leaving a message to meet him after a medical check-up in a few days. Whip gives into the request, and sits down with Charlie, and Hugh Lang (Don Cheadle), a lawyer from Chicago who has been sent by the pilots union. Hugh explains that at the crash site, blood was drawn from Whip, indicating he had an elevated blood alcohol level, and cocaine in his system. The two indicate to Whip that Hugh is going to fight the findings, but that Whip could face charges of manslaughter, and jail time.Whip does not handle the news well, and heads off to a liquor store afterwards. He then attempts to find Nicole's address, and finds her being kicked out of her apartment by the landlord. Whip manages to help her pay her rent, and seeing as she has nowhere to go (and her car won't start), offers to let her stay with him.Over the next few days, Whip continues to avoid the press, but soon realizes that his reputation could be plagued by the others who were around him. At Katerina's funeral, he meets Margaret, who claims she could tell that Whip was drunk when she encountered him that morning. Whip then starts to get personal, claiming that if not for him, she could have ended up dead as well.In the hospital, his co-pilot Ken explains he hasn't told the National Transportation Safety Board (NTSB), who have been investigating the crash, about his suspicions about Whip's condition at the time. Even though he may never walk again, Ken and his wife believe that his surviving was a miracle. The couple is strictly religious and insist that Whip pray with them, which he does reluctantly.Meanwhile, Nicole has been turning her life around, getting a job, and attending an Alcoholics Anonymous meeting. She suggests Whip come along with her, but he is unable to stomach much of the meeting. Shortly afterwards, Nicole finds Whip working on the Cessna in his father's garage. Whip claims that they can fly away and start over, but Nicole refuses his advancements, and Whip (who has been drinking) angrily yells after her as she leaves.Eventually, Nicole leaves Whip and he grows even more out-of-control with his drinking. When the press finally find the farmhouse, he drives off and ends up in the neighborhood of his ex-wife and son. Both demand that he leave, but Whip refuses to listen, causing them to call the police on him.Needless to say, Charlie and Hugh are incensed at Whip's behavior, claiming that this does not bode well for their upcoming case with the NTSB. Even though Hugh has managed to have Whip's alcohol test thrown out, they still need to have Whip present his side of the story to Ellen Block (Melissa Leo), the investigator for the NTSB.Whip gives in to their requests to clean up his act, and the evening before the hearing, he is escorted to a hotel room. A security guard is stationed at the door, and all traces of alcohol have been cleaned out of the mini-fridge in the room. Whip attempts to relax, but finds himself unable to sleep or even go over the documents that Hugh has prepared for him.Later on, he hears a thumping sound. He soon finds it leads to the room adjoining his, where the door has been left unlocked. In the room he finds a fully-stocked mini-fridge with alcohol. Whip looks over the contents of the fridge for a short time and even uncaps a bottle of vodka. He hesitates before downing the bottle, places it on the counter and leaves. A few moments later, he snatches the bottle.The next day, Charlie and Hugh show up, but when Whip doesn't answer the door, they find him passed out in the bathroom with a cut on his head, and empty mini-bottles littering the room. With the hearing's time coming closer, they hatch a bold plan. They call in Harling Mays, who provides Whip with the cocaine he needs to get himself woken up. After paying off Harling, Whip, Charlie, and Hugh head to the hearing.During the hearing (with Ellen Block presiding), it is determined that the cause of the plane's locked dive, was a damaged screw in the tail-section that had not been repaired a few years prior. This seems to exonerate Whip, but Ellen then brings up the findings of two empty mini-liquor bottles in one of the trash cans near the pilot's cabin. Given the blood-test findings (of which Whip's has been thrown out due to outdated equipment and procedure in drawing his blood), only one other member of the flight crew could have potentially stolen the vodka: Katerina, who has a documented history of alcohol and drug abuse.When Ellen asks Whip if it's possible that Katerina drank the vodka, he hesitates before confessing that he drank the vodka. Charlie and Hugh attempt to quell Whip's words, but he confesses to his alcohol problems, claiming that he is drunk at the moment, and has taken cocaine.After the hearing, we segue into a small group in a prison, with Whip among the prisoners. Whip explains to the others about his confession, and that how it seemed that that moment at the NTSB hearing was his breaking point: he couldn't tell another lie.Epilogue. 13 months later.In his time in prison, Whip has become clean of alcohol, and has gained the trust of his ex-wife and son again. His son Will soon after comes to visit him, asking to interview him for a report, to find out more about his father, whom it seems has been absent through much of his life."}