{"mid": "FlirtationWalk", "IMDB_id": "tt0025124", "title": "Flirtation Walk", "plot": "Richard Palmer Grant Dorcy Jr. (Powell), a.k.a. \"the Canary\" and \"the singing bird of the tropics,\" is an enlisted man in the United States Army. Stationed in the Hawaiian Islands, he has a contentious but friendly relationship with his sergeant, Scrapper Thornhill (Pat O'Brien). When General Fitts (Henry O'Neill) visits the post with his daughter Kit (Keeler) on their way to Manila, Dick is assigned to drive her to a reception that evening. Falling victim to the moonlit night, Kit and Dick attend a luau instead. They are discovered in each other's arms by Scrapper and Lieutenant Biddle (John Eldredge), who is also in love with Kit. Biddle accuses Dick of ruining Kit's reputation and forcing her to accompany him off post. Dick decides to desert. Scrapper begs Kit to straighten things out with Biddle.\nTo prevent Dick from deserting, Kit tells him that she was responding to a crazy impulse and he means nothing to her. Stung by her words, and Biddle's condescending statement that \"if you were an officer and a gentleman, you'd understand,\" Dick decides to compete with Biddle as an equal and applies for West Point. He is accepted and does very well, to Scrapper's delight. In his First Class year, Dick becomes First Captain and General Fitts is appointed Academy superintendent, with Biddle present as his aide. While most of his classmates are infatuated with Kit, Dick is cold to her. Consequently, he is not very happy when the rest of the men insist that she participate in the traditional \"Hundredth Night\" theatrical performance that he is to direct.\nDick writes a comedy about a female general with a message directed at Kit. After the first rehearsal, Kit walks with Dick on Flirtation Walk and tries to explain why she told him she was not in love with him. Dick is too angry to listen to Kit, but during their on-stage love scene kisses her, and she admits she loves him. When, near graduation, General Fitts announces Kit's engagement to Biddle, Dick naturally is confused, and visits her after lights out to talk her out of marrying Biddle. He is caught by Biddle and, at Biddle's suggestion, agrees to resign from the Academy to protect Kit's name. Scrapper arrives at the Academy to see Dick graduate and is disappointed to learn of his resignation. The day is saved when Biddle tells Dick that his resignation was not accepted and that Kit returned his ring, wishing him good luck. Dick graduates a happy man."}