{"mid": "Flubber", "IMDB_id": "tt0119137", "title": "Flubber", "plot": "Professor Philip Brainard (Robin Williams) of Medfield College is developing a new energy source, in an attempt to raise enough money to save the college from closure. His preoccupancy with his research distracts him from his fiancée and the college president Sara Jean Reynolds (Marcia Gay Harden); he has missed two weddings in the past as a result of this, much to the anger of Sara. On the day of the third attempted wedding, Philip is approached by his former partner Wilson Croft (Christopher McDonald), who has profited from ideas he has stolen from the chemist and now desires to steal Sara from Philip and make her his wife, which he declares directly to Philip. Before he can make it to the wedding, his latest experiment shows fast development, forcing him to miss another wedding. The resulting substance created from the experiment is a green goo that increases in speed as it bounces and proves to be difficult to control, wreaking havoc on the neighborhood before the professor finally manages to capture it. Weebo (voiced by Jodi Benson), Philip's hovering robot assistant, classifies the substance as \"flying rubber\", leading Philip to christen it as \"Flubber\".\nPhilip continues to work on Flubber into the early morning, looking to stabilize the rubber's movement as opposed to stimulation. Philip's watch alarm goes off at 6 a.m. (set wrong) and Weebo informs him that he has missed the third wedding. Philip goes to Sara's office and unsuccessfully attempts to explain the situation to her. Meanwhile, Medfield College sponsor Chester Hoenicker (Raymond J. Barry) is unhappy that Philip failed his son Bennett (Wil Wheaton) in chemistry class. That night, Hoenicker sends his two security guards Smith (Clancy Brown) and Wesson (Ted Levine) to Philip's house in an attempt to persuade Philip into giving Bennett a better grade. However, Philip is too busy testing the Flubber to even notice them and suddenly knocks them out unconscious with a Flubber-coated golf ball and bowling ball. He uses Flubber to give his vintage Ford Thunderbird flight. During a test run, he discovers Wilson making the moves on Sara. Afterward, Weebo attempts to confess her love of Philip, only to be shrugged off as a computer. In response, she secretly creates a holographic human version of herself named Sylvia (Leslie Stefanson) in hopes of winning him over. Before Weebo can make out with Philip in this form as he sleeps, Philip awakens with another idea for Flubber. He enters an empty basketball arena and tests the effects of Flubber on a basketball. Later, he gives Flubber-padded shoes to the unskilled Medfield basketball team to increase their abilities.\nBack in Philip's home, a spiteful Weebo unleashes Flubber from his case, allowing him to dance around the house and cause general mayhem. After the close but successful basketball game, Philip's attempt to win Sara back into his favor fails. Philip dumps all of his emotional baggage onto Weebo, saying his absent-mindedness is due to his love of Sara. Weebo records Philip's ramblings and shows the footage to Sara, who then reconciles with Philip. Philip demonstrates Flubber's abilities to Sara and they discuss how it can be used for profit. However, Hoenicker discovers Flubber's existence and sends Smith and Wesson to infiltrate Philip's house and steal Flubber. Weebo attempts to fend off the henchmen, only to be struck down by Wesson with a baseball bat. Philip and Sara return home and find Weber (Philip's house-robot) cleaning up, Flubber gone and Weebo destroyed. Later, Philip discovers that Weebo had downloaded backup data of herself onto his computer in the event of her destruction, as well as a video recording of Weebo's hologram professing her love for him.\nPhilip and Sara confront Hoenicker and try to retrieve Flubber, only to discover that Wilson is allied with the millionaire. After a battle, Philip and Sara defeat Wilson, Bennett, Hoenicker and his henchmen, get Flubber back, raise enough money to save the college and finally have a successful marriage, along with Flubber and the \"daughter\" of Weebo, called Weebette. The film ends with the family heading to Hawaii in the Thunderbird."}