{"mid": "ForcedVengeance", "IMDB_id": "tt0083960", "title": "Forced Vengeance", "plot": "Josh Randall is the head of security for the Lucky Dragon casino in Hong Kong. As the movie begins, Randall is visiting Los Angeles to collect $114,000 owed by a rich gambler to his employer, David Pascal (Liu). After a few threats and some fighting he collects the debt. He dozes during a jet flight back to Hong Kong and the viewer sees in flash back how he got in a fight in the Casino when he was on leave from the US Army and ended up befriending David’s father, Sam (Opatoshu).\nJosh goes to the casino upon his arrival in Hong Kong and checks in the money. While he’s there David asks him to help terminate one of the Dragon’s dealers who is skimming money. David fires the dealer, telling him he’s lucky he doesn’t have his hands broken for what he’s done. The dealer is humiliated by being forced to walk out of the casino without his pants. Josh isn’t very happy with how David handled the situation, telling him he was too hard on the dealer.\nAfter work Josh visits his friend Sam Pascal, David’s father and the Dragon’s original founder. The two share some reminiscences about the old days, and Sam asks Josh what is going on with David and the casino, saying his gut tells him that something is wrong. However, Josh has not been taken into David’s confidence and doesn’t know what to say. Sam invites Josh back later to visit and watch some soccer with himself and David.\nPicking up some food, Josh heads home to his houseboat out in Hong Kong bay, where he spends a pleasant interlude with his beautiful blonde girlfriend Claire (Weller). A couple hours later he returns to the Dragon, just in time to foil an attempted robbery.\nThat evening the 3 men are relaxing at the Pascal home with some beers and watching a soccer game. David tells Sam that a competitor, Stan Ramondi (Cavanaugh), has an interesting business proposition for a “merger” the elder Pascal should hear. He suggests that the men go to Ramondi’s restaurant and casino after the game. Ramondi is widely known as a mobster and runs a syndicate called Osiris which extorts “protection” money from Hong Kong businesses, but with some misgivings Sam agrees to go.\nUpon arrival the Pascals and Randall are escorted into Ramondi’s office. Ramondi has much praise for Randall, saying he has heard many good things, and even offers Josh a job. When Randall turns him down Ramondi asks him to wait outside in the casino. Ramondi then gets right down to business, telling Sam Pascal that times are changing and he should bring his business in under the umbrella of Osris. Sam gets angry at this, saying he doesn’t need to procure “protection” from Osiris and that Ramondi’s offer is a joke and “bullshit”. Sam storms out. Out in the casino Randall has run afoul of 2 of Ramondi’s men, including the hulking Cam (Judo and Sumo wrestler Seiji Sakaguchi). They nearly come to blows until Ramondi calls off his goons.\nOn the way home, David tells Sam that they are almost broke due to David’s gambling losses, and that they have no choice but to take Ramondi’s offer. Sam is furious to hear this, telling David that he’d better straighten up and if he doesn’t even though he is Sam’s son he will be “out” of the business. As they return to the Pascal household, David asks Josh to return later, fearing that there may be trouble. Soon after Randall leaves, the mobster’s assassins show up at Sam’s home and wipe out everyone in the family except for Joy (Griggs), Sam’s wild child daughter.\nWhen Randall returns to the Pascal home he finds David and Sam murdered. Knowing that both he and Joy are in deadly danger, he shows up at the “swing” condo where she lives, and almost coerces her into accompanying him, much to her annoyance.\nRandall decides to go to the police and drops Joy off with Claire at his houseboat. Two police inspectors, Keck and Chen intercept Randall on his way to the station and arrest him. As Keck takes Josh into custody he brutalizes Randall. The police attempt to pin the murder of the David and Sam Pascal on Josh and Keck has him strip searched. Finally due to lack of evidence the cops are forced to let him go.\nRandall visits the place of business and warehouse of his old Vietnam buddy Leroy Nicely (Minor), and obtains a .45 automatic and a Gerber combat knife. Leroy tells him that he has a $100,000 price on his head, to which Josh jokingly replies “Hong Kong or American?” Leroy volunteers to go with Randall like in the old days when they were part of the A teams in Vietnam, but Josh tells him to stay and protect the girls.\nOn the way back to his houseboat Josh sees Keck staking him out and sneaks up on him, returning the beating he had taken earlier. Rounding up Joy and Claire, Josh attempts to run and hide out from the mobster’s men throughout Hong Kong, but this turns out to be difficult for a big blonde American with 2 beautiful women in tow. After a number of Karate battles and shots fired, he drops the girls back off at Leroy’s.\nRealizing that Ramondi must be a figurehead as there is no way he has the authority and influence to be at the top of Osris, Josh resolves to track down who the real leader is, as that person is the one who ordered the killings. After following some leads Randall finds out that aging and supposedly retired crime lord Simon Koo is the actual head of the Osiris syndicate and also that Koo is secretly Ramondi’s father.\nRandall returns to the warehouse to find Ramondi’s thugs broke into the warehouse and mortally injured Leroy, kidnapped Joy, and raped Claire to death. Seriously going on the warpath, Josh dresses up in military uniform to get into Ramondi’s restaurant without being recognized. Once inside he waylays one of Ramodi’s goons and wrings Ramondi’s location out of him, discovering that Joy is being held captive on Ramondi’s private yacht.\nAt the shipyard Randall takes on more of Ramondi’s men and has his life saved by the timely intervention of Inspector Chen who it turns out is part of an international task force against organized crime in Hong Kong. Chen informs Randall that Inspector Keck was arrested and he confessed that he worked for Ramondi. Randall decides to go onto Ramondi’s yacht and rescue Joy and Chen says he can’t let Randall go alone. While overcoming Ramondi’s bodyguards aboard the yacht Chen is wounded, then Randall gets into a savage and difficult battle with Ramondi himself, who like Randall is very skilled in the martial arts. Finally he wins the fight after Ramondi’s neck is accidentally caught in a rope and snapped when he falls.\nRandall leaves Joy in the care of the Inspector and goes after Koo. Arriving at Koo’s compound, Randall fights his way in. Once inside, he confronts Koo, telling him, “You killed a lot of good people, old man.” Koo replies that he has a place for Randall in his organization, asking Josh if his son Ramondi told him this. Randall tells Koo, “Yes, that’s why I came here… to tell you your son made me an offer… before he died…” Enraged, Koo orders Cam to kill Randall. As the fight begins Cam taunts Randall that he was the one who raped and killed Claire. Randall is nearly beaten in the terrific battle which follows. Finally, after much furniture is broken and many walls smashed, a wooden window frame with a large dagger of broken glass falls on the bodyguard’s neck, cutting his throat. Randall then takes Koo into custody.\nIn the aftermath, Inspector Chen drops off Randall and Joy near the harbor. Chen thanks the two of them for all they did and informs Randall that the key remaining people in the syndicate will be deported, which will finish it. He adds that Simon Koo will be committed to an institution for the insane, the shock of his son’s death apparently being too much for him. He also remarks that he wishes Randall would consider taking a job on the police force. As the Inspector leaves, Joy tells Randall that she would like to get the Lucky Dragon up and running again, and asks him if he thinks she can. Smiling, Randall rhetorically says, “You’re a Pascal aren’t you?”\nIn a voice over as the movie ends, Randall states that the city of Hong Kong lives on borrowed time, the lease is running out and the city will be reverting to the Chinese “landlords” in 17 years, but as he further muses, Hong Kong’s residents are survivors and whatever happens… Hong Kong will always be - “The place”."}