{"mid": "ForeignCorrespondent", "IMDB_id": "tt0032484", "title": "Foreign Correspondent", "plot": "In mid-August 1939, just before the outbreak of World War II, the editor of the New York Globe, Mr. Powers (Harry Davenport), is concerned about the crisis in Europe, the growing power of Adolf Hitler and Nazi Germany, and the inability of celebrated foreign correspondents to get answers about whether war will ensue. After searching for a good, tough crime reporter for a fresh viewpoint, he appoints Johnny Jones (Joel McCrea) as a foreign correspondent, under the pen name Huntley Haverstock.\nThe reporter's first assignment is Stephen Fisher (Herbert Marshall), leader of the Universal Peace Party, at an event held by Fisher in honour of a Dutch diplomat named Van Meer (Albert Bassermann). On the way to the party, Haverstock sees Van Meer entering the car that is to take him to the party, and runs to interview him; Van Meer invites him to ride along, but diplomatically evades his questioning. At the party, Haverstock meets Fisher's daughter, Carol (Laraine Day). Van Meer disappears mysteriously. Later, Fisher informs the guests that Van Meer, who was supposed to be the guest of honor, will not be attending the party; instead he will be at a political conference in Amsterdam.\nAt the conference, Van Meer is shot in front of a large crowd by a man disguised as a photographer. Haverstock commandeers a car to follow the assassin's getaway car. The car he jumps into happens to have in it Carol and another reporter, Scott ffolliott (George Sanders), who explains that the capital letter in his surname was dropped in memory of an executed ancestor. The group follows the assassin to the countryside, where they see a windmill begin turning backwards: obviously a signal.\nWhile Carol and ffolliott go for help, Haverstock searches the windmill and finds a live Van Meer; the man who was killed was an impostor substituted to make everyone believe Van Meer was killed. The old man has been drugged and is unable to tell Haverstock anything. Haverstock is forced to flee when the kidnappers become aware of him. They escape with Van Meer in an aircraft before the police arrive.\nLater, back at Haverstock's hotel room, two spies dressed as policemen arrive to kidnap him. When he suspects who they really are, he escapes out the window and into Carol Fisher's room.\nHaverstock and Carol board a British boat to England, and while a furious storm thunders overhead, he proposes marriage to her which she accepts. In England, they go to Carol's father's house, where Haverstock sees a man whom he recognizes as one of the men at the windmill. He informs Fisher and Fisher promises that he will send a bodyguard to protect him. The bodyguard, Rowley (Edmund Gwenn), repeatedly tries to kill Haverstock. When the assassin tries to push him off the top of the Westminster Cathedral tower, Haverstock steps aside and Rowley plunges to his death.\nHaverstock and ffolliott are convinced that Fisher is a traitor, so they come up with a plan: Haverstock will take Carol to the countryside, and ffolliott will pretend she has been kidnapped to force Fisher to divulge Van Meer's location. After a misunderstanding with Haverstock, Carol returns to London. Just as Fisher is about to fall for ffolliott's bluff, he hears her car pull up.\nFisher heads to a hotel where Van Meer is being held with ffolliott on his tail. Van Meer is being interrogated using sleep deprivation to discover a secret clause in a treaty he signed. Just as he is being forced to divulge the information the organization wants, ffolliott distracts the interrogators. When Haverstock arrives, Fisher and his bodyguards escape, leaving Van Meer behind. Van Meer is rushed to the hospital in a coma.\nEngland and France declare war on Germany. While Haverstock, ffolliott and the Fishers are on a Short S.30 Empire aircraft to America, Fisher confesses his misdeeds to his daughter. Carol believes Haverstock does not really love her but only used her to pursue her father. Haverstock protests that he was just doing his job as a reporter. Seconds later, the aircraft is shelled by a German destroyer and crashes into the ocean. The survivors perch on the floating wing of the downed aircraft. Realizing that it cannot support everyone, Fisher sacrifices himself by allowing himself to drown. Jones and ffolliott attempt to save him, but are unsuccessful. They are rescued by an American ship, the Mohican. The captain refuses to allow the reporters to file their story using the ship's communications citing American neutrality, but Jones, ffolliott, and Carol surreptitiously communicate the story by radio-telephone to Mr. Powers. Later, back in London and now a successful war correspondent, Haverstock, with Carol at his side, describes London being bombed in a live radio broadcast to the United States, urging Americans to fortify their country and \"keep the lights burning\" as they go dark in the studio."}