{"mid": "ForrestGump", "IMDB_id": "tt0109830", "title": "Forrest Gump", "plot": "In 1982, Forrest Gump recounts his life story to strangers who sit next to him on a bench in Savannah, Georgia.\nOn his first day of school, in Greenbow, Alabama, Forrest meets a girl named Jenny Curran. Despite his low intelligence quotient, his running ability wins him a football scholarship. After his college graduation, he enlists in the army, where he befriends a fellow soldier named Bubba, who convinces Gump to go into the shrimping business with him when the war is over. They are sent to Vietnam, and during an ambush, Bubba is killed in action. Gump saves many of his platoon, including his Lieutenant, Dan Taylor, who loses both his legs. Gump is awarded the Medal of Honor for his heroism.\nWhile Gump is in recovery for a shot to his buttocks, he discovers a talent for ping pong. He becomes a ping pong celebrity and plays competitively against Chinese teams in ping pong diplomacy. At an anti-war rally in Washington, D.C., Gump reunites with Curran, who has been living a hippie lifestyle.\nReturning home, Gump endorses a company that makes ping pong paddles. He uses the earnings to buy a shrimping boat, fulfilling his promise to Bubba. Dan joins Gump, and although they initially have little success, after their boat becomes the only one to survive Hurricane Carmen, they pull in huge amounts of shrimp. They use their income to buy a fleet of shrimp boats. Dan invests the money in Apple Computer (which Gump naively thinks is a fruit company) and Gump is financially secure for the rest of his life. He returns home to see his mother's last days.\nJenny returns to visit Gump and he proposes to her. She declines, but feels obliged to prove her love to him by having sex with him. She leaves early the next morning. On a whim, Gump elects to go for a run. He decides to keep running across the country several times, over three and a half years, becoming famous in the process.\nIn the present, Gump reveals that he is waiting at the bus stop because he received a letter from Jenny who, having seen him run on television, asked him to visit her. Reunited with Jenny, she introduces him to his son, also named Forrest. Jenny tells Gump she is sick. The three move back to Greenbow, Alabama. Jenny and Gump finally marry but she dies soon afterward. Forrest and his son await the school bus on Forrest Jr's first day of school."}