{"mid": "ForScentImentalReasons", "IMDB_id": "tt0041380", "title": "For Scent-imental Reasons", "plot": "The owner of a perfume shop in Paris is horrified to find a skunk, Pepé Le Pew, testing the wares inside his store. A strong and powerful gendarme, also repelled by the odor, is of no help.\nThe perfumer notices a black female cat (not named in this short, the black cat character is identified as such in the much later Carrotblanca as Penelope Pussycat), and with rage flings her into the store and demands her to \"Remove that skunk, that polecat pole from the premises. Avec!\". The cat slides into the shop, hitting a bureau and causing a bottle of white dye to spill and run down her back and tail (a black cat acquiring a white, skunk-like stripe is a running gag in most Pepé Le Pew shorts). Pepé Le Pew sees her and immediately mistakes her for a skunk.\nThe cat smells Pepé's odor and immediately tries to run away, chased by Pepé. As she attempts to wiggle free from Pepé's embrace, he makes comments like, \"it is love at sight first, no?\" and \"we will make beautiful music together.\" She breaks free and attempts to wash the stripe and the smell off but is unsuccessful. She runs to a window and tries to open it, but it is stuck. She finally takes refuge inside a locked glass cabinet, much to Pepé's chagrin. Pepé first tries to lure her out sweetly, then demands that she come out of the cabinet. She refuses, indicating that it is due to his odor. Pepé Le Pew becomes saddened, pulls out a gun, walks out of sight and fires the weapon, presumably killing himself. Panicked, the cat rushes out to save him, only to run directly into Pepé's arms. He tells her, \"I missed, fortunately for you.\" The chase continues until Pepé finds the cat on the windowsill. He believes that she is trying to prove her love for him by committing suicide, and declares that he will save her. Pepé grabs for her, but she slips through his arms. Pepé then calls out: \"Vive l'amour, we die together\" and steps off the window ledge. The cat falls into a barrel of water under a rain-spout, while Pepé lands in a can of blue paint.\nThe water washes the white stripe off the cat, and also gives her a cold. When Pepé climbs out he is blue. He sees the ragged-looking, sneezing wet cat but does not recognize her. He wanders off to find the \"beautiful young lady skunk.\" The soaked black cat watches his blue form walking away and she falls for him. When Pepé goes back into the perfume shop to look for the female skunk, he hears the door shut and the lock click behind him. When he turns, he sees the drenched female cat leering at him and begins to panic, realizing that he is now the victim of love. She drops the key to the lock down her neckline as the startled Pepé says, \"Oh, no!\" and runs away. As Pepé runs as fast as he can, the cat follows using Pepé's familiar hopping pace. The short ends with Pepé telling the audience: \"You know, it is possible to be too attractive,\" while continuing to run."}