{"mid": "FortyGuns", "IMDB_id": "tt0050407", "title": "Forty Guns", "plot": "In the 1880s, Griff Bonnell (Barry Sullivan) and his brothers Wes (Gene Barry) and Chico (Robert Dix) arrive in the town of Tombstone in Cochise County, Arizona. Griff is a reformed gunslinger, now working for the Attorney General's office, looking to arrest Howard Swain (Chuck Roberson) for mail robbery.\nSwain is one of landowner Jessica Drummond's (Barbara Stanwyck) forty hired guns. She runs the territory with an iron fist, permitting the town to be terrorized and trashed by her brother, Brockie Drummond (John Ericson), and his boys. Brockie is an arrogant drunk and bully, but he goes too far by shooting vision-impaired town Marshal, Chisolm (Hank Worden), in the leg. Thereupon, Brockie and his drunken friends start trashing the town.\nGriff intervenes and pistol-whips Brockie with a single blow while Wes covers him with a rifle from the gunsmith shop. Aware of how close Brockie is to his sister, Griff makes it a point not to crack Brockie's skull. Jessica delivered Brockie when their mother gave birth for the last time.\nWes falls in love with Louvenie Spanger (Eve Brent), the daughter of the town gunsmith, so he decides to settle down and become the town's marshal. Griff becomes romantically involved with Jessica after she is dragged by a horse during a tornado.\nTwo of Jessica's forty dragoons, Logan (Dean Jagger) and Savage (Chuck Hayward), attempt an ambush of Griff in an alley. He is saved by youngest brother Chico (Robert Dix), who was supposed to be leaving for California for a new life on a farm. Chico's shot kills Savage, after which Jessica's brother and hired guns try to turn the town against the Bonnell brothers.\nOn his wedding day, Wes is gunned down by Brockie, who is really aiming at Griff (who leans forward to kiss the bride, thereby unknowingly saving himself). Brockie is jailed for the murder. He tries to escape by using his sister as a shield, daring Griff to shoot, and is shocked when Griff does exactly that. Griff's expertly-placed bullet merely wounds Jessica, and the cowardly Brockie then becomes the first man Griff has had to kill in ten years. Brockie's last words are \"Mr. Bonnell, I'm killed!\"\nChico remains behind to take the marshal's job. Griff rides out, certain that Jessica hates him for killing her brother, but she runs down the dirt street after his buckboard - repeatedly calling out \"Griff! Mr. Bonnell!\" - and they appear to ride off together for California."}