{"mid": "FourLions", "IMDB_id": "tt1341167", "title": "Four Lions", "plot": "A group of radicalised young British Muslim men aspire to be suicide bombers. They are Omar (Riz Ahmed), who is deeply critical of Western society and imperialism; his dim-witted cousin Waj (Kayvan Novak); Barry (Nigel Lindsay), a bad-tempered and extremely rash white convert to Islam; and the naive Faisal (Adeel Akhtar), who tries to train crows to be used as bombers. While Omar and Waj travel to an Al Qaeda-affiliated training camp in Pakistan, Barry recruits a reluctant fifth member, Hassan (Arsher Ali). The training trip ends in disaster when Omar attempts to shoot down an American drone and accidentally destroys part of the camp; the pair are forced to flee. However, Omar uses the experience to assert authority on his return to Britain.\nThe group begins acquiring materials for making improvised explosive devices but disagree about what to target. Barry wants to bomb a local mosque as a false flag operation to \"radicalise the moderates\", but Omar considers this idiotic. Faisal suggests blowing up a branch of the pharmacy chain Boots, but Omar states it is a not a worthwhile target. Hassan allows an oblivious neighbour (Julia Davis) into their safe house; the group suspect they have been compromised and transport their volatile explosives to a new location in grocery bags. Faisal trips up while crossing a field and is killed in the explosion. This causes a row among the remaining four, who disband; they later reconcile, and Omar decides to target the upcoming London Marathon.\nWearing mascot costumes to conceal their explosives, they drive to London and prepare to attack. Waj expresses doubts about the morality of their plot, but Omar convinces him and the group parts ways to detonate at separate locations. Hassan loses his nerve and tries to alert nearby police officers, but is killed when Barry detonates his bomb remotely. This causes the police to search for the remaining three.\nOmar has a change of heart, feeling guilt about manipulating the easily led Waj into dying for a cause he doesn't understand, and attempts to prevent the attack. Police snipers receive Omar's description and shoot at him as he attempts to blend in with the runners, but mistakenly kill a bystander in a similar costume instead. Omar eventually contacts Waj from his mobile phone but is attacked by Barry, who swallows the phone's SIM card. However, Barry begins to choke on it, provoking a passer-by to carry out the Heimlich manoeuvre and in the process detonate his bomb, killing them both as Omar flees.\nWaj is cornered by police in a kebab shop and takes the staff hostage. Omar borrows a phone and attempts to talk him down, but his call is interrupted when the police charge in and kill a hostage whom they mistake for Waj. Confused, Waj detonates his bomb, killing himself and the officers. Distraught, Omar walks into an empty pharmacy and blows himself up. In an epilogue, it is revealed that the police later arrested Omar's innocent brother as a terrorist; that they deflect responsibility for shooting the bystander; and that Omar unknowingly killed Osama Bin Laden when Omar misfired his rocket in Pakistan."}