{"mid": "FoxyBrown", "IMDB_id": "tt0071517", "title": "Foxy Brown", "plot": "Foxy Brown (Pam Grier) seeks revenge when her government agent boyfriend is shot down by members of a drug syndicate at her doorstep. She links her boyfriend's murderers to a \"modeling agency\" run by Steve Elias (Peter Brown) and Miss Kathryn (Kathryn Loder) that services local judges, congressmen, and police in the area. Foxy decides to pose as a prostitute to infiltrate the company, and helps save a fellow black woman from a life of drugs and sexual exploitation and reunites her with her husband and child. Not long after she infiltrates the company, her relation to her late-boyfriend and Link Brown, her brother who ratted him out, is exposed and she is caught before she can escape. After an exchange of words and heated death threats, Miss Kathryn decides to keep her alive in hopes of her being worth some monetary value in the sex-slave trade. They give her a shot of heroin and then send her to a farm which is actually a drug manufacturing plant, with two of Miss Kathryn's henchmen. after she wakes from her sleep she tries to escape her captors but is caught by one of the henchmen with a whip and dragged back to the bedroom where he proceeds to tie her to the bed. then Kathryn's second goon comes and gives foxy another shot of heroin, the dealer begins to eye foxy quoting \"I'm beginning to get that ole feeling\" where he massages and fondles her breasts before he rips off her bra. tied up and defenseless with her breasts exposed the dealer rapes her and leaves her tied but using her quick thinking she uses a razor to get free and escape her captors by setting the farm on fire. Ms Kathryn orders her boyfriend to kill her where he proceeds by scaring info out of her brother but to no avail he then kills him and his girlfriend foxy asks her black panther bros for help where they take Steve and cut off his genitals foxy comes to the house of ms Kathryn and shows her the jar containing Steve's genitals and she kills two of the guards and shoot's Kathryn in the arm. foxy says that death is too easy her and wants her to suffer the way that she made her suffer."}