{"mid": "Frantic", "IMDB_id": "tt0095174", "title": "Frantic", "plot": "Dr. Richard Walker (Harrison Ford) is a (rather arrogant) surgeon visiting Paris with his wife Sondra (Betty Buckley) for a medical conference. At their hotel, she is unable to unlock her suitcase, and Walker determines that she picked up the wrong suitcase at the airport. While Walker is taking a shower, his wife mysteriously disappears from their hotel room.\nStill jet-lagged, he searches for her in the hotel with the help of a polite but mostly indifferent staff and then wanders outside to search himself. A vagrant overhears him in a café and says he saw Walker's wife being forced into a car. Walker is skeptical until he finds his wife's ID bracelet on the cobblestones. He contacts the Paris police and the U.S. Embassy, but their responses are bureaucratic, and there is little hope anyone will look for her.\nAs Walker carries on the search himself (with input from a very sympathetic but wary desk clerk at the hotel), he stumbles onto a murder scene and then encounters the streetwise young Michelle, who had mistakenly picked up his wife's suitcase at the airport. It transpires that Michelle is a career smuggler but does not know for whom she is working. She reluctantly helps Walker in his increasingly frantic attempt to learn what was in the switched suitcase and to trade whatever it is for the return of his wife.\nIt turns out that hidden within a small replica of the Statue of Liberty is a krytron, a small electronic switch used in the detonators of nuclear devices that had been stolen and smuggled by Arab agents. The American embassy, working with Israeli agents, want it back and are willing to let Sondra die in the process of reacquiring it. Thus, the doctor is forced to try to save his wife with Michelle, who wants her money for her work. The film ends with a confrontation beside the River Seine where Walker's wife is released. However, a firefight ensues between the Arab and Israeli agents who followed them. During the crossfire, the Arab agents are killed but Michelle is also shot and dies with Walker and Sondra at her side.\nAngry and upset, Walker throws the krytron into the river while the helpless Israeli agents look at him. He then carries Michelle's body away from there. Soon after, the Walkers, traumatized because of what happened, leave Paris."}