{"mid": "FrankFilm", "IMDB_id": "tt0070071", "title": "Frank Film", "plot": "Jon lives in a small coastal town, but aspires to be a songwriter. While walking along the beach, Jon witnesses a man trying to drown himself. The man is revived, but taken to hospital. Jon talks to Don, who explains the man was a keyboardist in an experimental band called the Soronprfbs, managed by him. Jon mentions that he plays keyboards and is invited to play with him in town that night. Jon goes along and meets the rest of the band, all of whom are reluctant about Jon, except for Frank, the band leader who wears a paper-mâché mask over his head. The concert goes well, until Clara breaks her theremin and storms offstage.\nFrank invites Jon to become a full-time member of the band. He accompanies them to Ireland, where they plan to record their first album in a remote cabin for the next year. Clara displays contempt to Jon and they end up sleeping together, but she threatens to kill him if he mentions it. Don becomes depressed and explains to Jon that he wants to be a songwriter, but is terrible. He plays a song for Jon, who compliments it. The next morning, Jon finds what appears to be Frank's corpse hanging from a tree. He calls the rest of the band down and they remove the mask, only to find it was Don wearing one of Frank's masks. Don is cremated and Jon reveals he has been posting the band's recording sessions online. The Soronprfbs have gained a small following and have been invited to South by Southwest.\nUpon arrival in Texas, Jon, Frank and Clara scatter Don's ashes, but realise Frank accidentally replaced them with powdered food. Drummer Nana and bassist Baraque reveal their strong hatred for Jon and return to England the night before the concert. On the day of the concert, Clara and Frank disappear. Jon finds them in an alley, but Clara stabs Jon in the leg, but runs away. She is later arrested by the police. At the concert, only Jon and Frank remain of the band. As they go onstage, Frank refuses to sing, forcing Jon to sing one of his songs. Frank dislikes it and suffers a nervous breakdown. The next day, Jon attempts to reason with Frank, which ends in them arguing and Jon trying to remove Frank's head. Frank runs out of the motel room and is hit by a car. Jon gives chase, but realises Frank has escaped.\nSometime later, Jon has attempted to track down Frank, but all his attempts have failed. He finally succeeds in tracking Frank to his hometown of Bluff, Kansas, where he is living with his parents. They explain that Frank has suffered with severe mental health issues all his life and began wearing the mask as a teenager. Jon finally sees Frank without a mask, only to learn he has a large scar on his head and is balding. Jon takes Frank to a bar, where Clara, Nana and Baraque are playing. Frank approaches the band and when he begins to speak, they realise who he is. He begins singing and joins them onstage, while Jon watches. As Frank sings, Jon leaves the bar to return to England."}