{"mid": "FrankensteinsArmy", "IMDB_id": "tt1925435", "title": "Frankenstein's Army", "plot": "During World War II, Russian soldiers on a reconnaissance mission receive a distress call that would lead them further into Germany. The message seems to repeat without any response to their queries, and at the same time that they begin to receive the message, they lose radio contact with their command. Although the others are dubious about the existence of other Russians in the area, Sgt. Novikov orders them to investigate. Dmitri, a Soviet propagandist who is filming the mission, interviews the soldiers and documents the proceedings. As they draw closer to the designated coordinates, Dmitri takes an interest in and films several odd occurrences, such as unexplained dead Nazis, a burnt convent full of massacred nuns and strange machinery. When the soldiers arrive at their destination, they find an abandoned church guarded by an undead person with metal implants; the film calls these creatures zombots in the credits. The zombot kills Sgt. Novikov, and, after they destroy the zombot, Sergei takes charge. The hotheaded Vassili challenges his authority, but the others back Sergei.\nWhen a caretaker enters the church, Dmitri interrogates him, but Vassili becomes impatient and tortures the man for information. The caretaker promises to lead them through the church's catacombs to the captured Russian soldiers, but he instead leads them into a zombot trap and escapes. Overwhelmed, the soldiers flee deeper into the catacombs. Along the way, Sergei discovers that Dmitri has deceived them. There never were any Russian troops; the distress call was a ruse by Dmitri, who was also responsible for jamming their signal. Dmitri reveals himself as a captain and demands the others join him on his secret mission to capture or kill the Nazi scientist who created the zombots. Furious that they were deceived and led unprepared into this mission, they threaten to kill Dmitri, but he takes command after threatening their families with retribution. As Dmitri leads them deeper into the catacombs and they encounter increasingly bizarre aberrations, the soldiers once again mutiny and abandon Dmitri, who enters the main laboratory alone.\nAmid the carnage, Dmitri encounters a live Nazi officer, who screams as the zombots collect him for harvesting. Curious, Dmitri explores further, only to be captured and knocked unconscious by the zombots. When Dmitri wakes, he is a prisoner of the caretaker, who reveals himself to be Dr. Viktor Frankenstein, a descendent of the original Victor Frankenstein. Dmitri attempts to recruit Frankenstein, who seems noncommittal about defection. Instead, Frankenstein proposes an experiment he says will end the war: fusing together the brains from Sergei, whom he has captured, and the Nazi prisoner into one whole. Horrified but unwilling to antagonize Frankenstein, Dmitri does nothing to save Sergei, who swears his revenge. When the composite being shows little sign of life, Frankenstein abandons it and moves on to experimenting on Dmitri. Before Frankenstein can proceed, Soviet forces carpet bomb the laboratory, and Sacha, the only surviving member of the Russian soldiers, shoots Frankenstein dead. Sacha takes the camera from Dmitri and flees with Frankenstein's head just as the composite being made of Sergei's body comes to life and kills Dmitri.\nThe film ends on a photograph of Sacha with Joseph Stalin."}