{"mid": "Freaks", "IMDB_id": "tt0022913", "title": "Freaks", "plot": "The film opens with a sideshow barker drawing customers to visit the sideshow. A woman looks into a box to view a hidden occupant and screams. The barker explains that the horror in the box was once a beautiful and talented trapeze artist. The central story is of this conniving trapeze artist Cleopatra, who seduces and marries sideshow midget Hans after learning of his large inheritance. Cleopatra conspires with circus strongman Hercules to kill Hans and inherit his wealth. At their wedding reception, Cleopatra begins poisoning Hans' wine. Oblivious, the other \"freaks\" announce that they accept Cleopatra in spite of her being a \"normal\" outsider: they hold an initiation ceremony in which they pass a massive goblet of wine around the table while chanting, \"We accept her, we accept her. One of us, one of us. Gooba-gobble, gooba-gobble\". The ceremony frightens the drunken Cleopatra, who accidentally reveals that she has been having an affair with Hercules. She mocks the freaks, tosses the wine in their faces and drives them away. The humiliated Hans realizes that he has been played for a fool and rejects Cleopatra's attempts to apologize, but then he falls ill from the poison.\nWhile bedridden, Hans pretends to apologize to Cleopatra and also pretends to take the poisoned medicine that she is giving him, but he secretly plots with the other freaks to strike back at Cleopatra and Hercules. In the film's climax, the freaks attack the evil pair during a storm, wielding guns, knives and other sharp-edged weapons. Hercules is not seen again (the film's original ending had the freaks castrating him: the audience sees him later singing in falsetto). As for Cleopatra, she has become a grotesque, squawking \"human duck\". The flesh of her hands has been melted and deformed to look like duck feet, her legs have been cut off and what is left of her torso has been permanently tarred and feathered. She is the opening scene's cause for alarm.\nIn a final scene MGM inserted later for a happier ending, Hans is living a millionaire's life in a mansion. Venus and her clown boyfriend Phroso visit, bringing Frieda, to whom Hans had been engaged before meeting Cleopatra. Hans refuses to see them, but they force their way past his servant. Frieda assures Hans that she knows he tried to stop the others from exacting revenge. Phroso and Venus leave as Frieda comforts Hans when he starts to cry.\n=== Subplots ===\nInterspersed between segments of the main narrative are a variety of \"slice of life\" segments detailing the lives of the sideshow performers.\nThe Bearded Lady, who loves the Human Skeleton, gives birth to their daughter. The news is spread among the freak friends by the Stork Woman.\nViolet, a conjoined twin whose sister Daisy is married to one of the circus clowns, becomes engaged to the circus's owner. The sisters appear able to experience each other's physical sensations: Daisy appears to react with romantic arousal when Violet's fiancé kisses her, and a closed-eyed Violet knows when Daisy's shoulder has been touched. The sisters were played by the real-life conjoined twins Daisy and Violet Hilton.\nIn the middle of a conversation, the Human Torso lights his own cigarette, using only his mouth. In the original scene, he also rolls the cigarette.\nFrances O'Connor, the armless wonder, demonstrates how she performs everyday activities using feet instead of arms."}