{"mid": "FreeWilly2TheAdventureHome", "IMDB_id": "tt0113114", "title": "Free Willy 2: The Adventure Home", "plot": "It's been two years since Jesse saved and freed his orca friend, Willy. Jesse, now a teenager, has since been adopted by his foster parents, Glen and Annie Greenwood. Jesse and his adoptive parents are preparing to go on a family camping trip to the Pacific Northwest. Glen has been trying to teach Jesse to drive their motorboat, but Jesse is more interested in girls. Before they leave town, however, Dwight, Jesse's former social worker, shows up to inform them that they have found Jesse's biological mother, who abandoned him 8 years ago. Jesse's mother has died and left behind another son, Jesse's 8-year old half-brother named Elvis (Francis Capra). Elvis is morose, overly talkative, and mischievous, and he is also prone to telling lies and easily gets on Jesse's nerves. He is invited on their trip to San Juan Island so that he and Jesse might get to know each other.\nAt the environmental institute, Jesse reunites with his old Native American friend Randolph Johnson (August Schellenberg) whom Jesse met at the aquatic park when he met Willy. Jesse quickly becomes smitten with Randolph's attractive and kindly goddaughter, Nadine (Mary Kate Schellhardt). Jesse also tracks down and reunites with Willy. Jesse cautiously begins to show his interest in Nadine, and as the awkward teenagers grow closer, Jesse helps Nadine befriend Willy and his orca siblings, Luna and Little Spot. Elvis spies on the two, but at the same time, forms a bond with Willy's brother Little Spot.\nAs they continue to enjoy their camping trip, an oil tanker runs aground and spills oil into the ocean, trapping the three young killer whales in a small cove. When word gets out that the orcas are trapped and Luna is dying from the oil in her lungs, John Milner, the president of the oil company (Jon Tenney), arrives and announces a plan to move the orcas into captivity where they can recover from their injuries. His real plan, however, is to sell the orcas to marine mammal parks.\nRandolph eventually uses an old Indian remedy that he administers to Luna, who recovers. Elvis and Jesse learn of Milner's real plan to lock up the whales, and they confront him, ruining his plans. Then, with Nadine, they get the orcas away from the cove by stealing the boat belonging to Glen and leading them out of the cove to safety. However, the tanker explodes, and the crude oil in the water catches fire. While the three whales swim under the flaming oil safely, the boat hits a rock and starts to sink. Elvis begins to panic and Jesse promises to not let anything happen to him. Nadine and Elvis are lifted into a rescue helicopter summoned by Randolph's distress signals, but Jesse ends up slipping and falls back into the ocean. The helicopter is unable to go back for him due to the heavy smoke and is forced to fly away. However, Jesse is rescued by Willy, who takes him under the flames, and delivers him to Glen, Annie and Randolph. Jesse, after taking a moment to say goodbye, sends Willy off back to his family.\nShortly after, the Coast Guard brings Nadine and Elvis to Randolph's boat. Elvis gives Jesse an old picture of him and their mother, and explains that he once ripped it up out of anger, but taped it back together for him. Elvis tells Jesse that their mother always talked about him and that she felt bad about abandoning him. Jesse thanks him for the picture and hugs him, finally able to put his past at rest. Glen and Annie decide to adopt Elvis so the brothers can stay together."}