{"mid": "FrenchKiss", "IMDB_id": "tt0113117", "title": "French Kiss", "plot": "A fastidious and wholesome history teacher named Kate (Meg Ryan) is living in Canada with her fiancé, Charlie (Timothy Hutton), a dentist. While waiting for her Canadian citizenship to come through, Kate has been busy planning their wedding and the purchase of their first house, complete with a white picket fence. When Charlie urges her to accompany him to Paris for an upcoming conference, she declines due to her fear of flying and her general intolerance for cheese, secondhand smoke, and the French.\nA few days later, Kate's plans for the future are crushed when she receives a phone call from Charlie, who informs her that he has fallen in love with a beautiful French \"goddess\" named Juliette (Susan Anbeh) and that he will not be returning. Determined to win him back, Kate boards a flight to Paris and is seated next to a crude Frenchman, Luc Teyssier (Kevin Kline), whose every word seems to annoy her. Unknown to Kate, Luc is smuggling a vine cutting and a stolen diamond necklace into France hoping to use both to start his own vineyard. With the help of a few drinks, Kate is able to tolerate her \"rude\" and \"hygiene deficient\" seating partner long enough to arrive safely in Paris. Before de-boarding, Luc sneaks the vine and necklace into Kate's bag, knowing she will not be searched at customs.\nAt the terminal, Luc is spotted by Inspector Jean-Paul Cardon (Jean Reno) who insists on giving him a ride during which he searches his bag. Jean-Paul knows of Luc's vocation, but feels \"protective\" of him because Luc once saved his life. Meanwhile, Kate arrives at the Hôtel George V where she encounters new levels of French sarcasm and rudeness from the concierge (fr:Laurent Spielvogel). While waiting in the lobby with a petty thief named Bob (François Cluzet), Kate sees Charlie and Juliette kissing in a descending elevator and faints. Bob steals her bag and leaves just as Luc arrives. After reviving Kate, Luc realizes that Bob now has the necklace, goes with Kate to Bob's apartment, and recovers the bag, absent her money and passport.\nUpset with Luc, Kate heads off on her own and learns that Charlie is traveling south to Cannes to meet Juliette's parents. Luc, meanwhile, realizes that the necklace must still be in Kate's bag. He tracks her down to the train station, offers to help her \"win back Charlie\", and together they board a train to Cannes. After lactose intolerant Kate samples some of the 452 official government cheeses of France, she becomes sick, and they get off the train at Luc's hometown of La Ravelle in Paulhaguet, where they stay at his family home and vineyard. Kate learns about Luc's past and how he gambled away his vineyard birthright to his brother in a single hand of poker; she also learns that while he may be a schemer, he knows a lot about wine, and dreams of someday buying land for his own winery. As they board the train to Cannes, Kate shows him that she in fact has the necklace.\nAt Cannes, the two check into a room at the Carlton Hotel using a stolen credit card. Following Luc's advice, Kate confronts Charlie in front of Juliette on the beach pretending to be indifferent to him. To make him jealous, Luc pretends to be Kate's lover, and the deception works. Later that afternoon, Jean-Paul approaches Kate and urges her to convince Luc to return the necklace anonymously to avoid jail. Luc was planning to sell the necklace at Cartier, but agrees to Kate's \"new plan\" to have her sell the necklace, as that would be safer. At dinner, Charlie apologizes to Kate and accompanies her to her room where he tries to seduce her. Rejecting his advances, Kate realizes she no longer wants him, and that she has fallen in love with Luc. Meanwhile, in an effort to \"ensure victory\" for her, Luc takes an all-too-willing Juliette to bed, but his plan fails when he calls her \"Kate\".\nThe following morning, Kate tells Luc that Charlie wants her back, but quickly leaves the room, saying, \"Cartier is waiting\". She returns the necklace to Jean-Paul and purchases a Cartier check for $45,782 with her own savings to create the illusion that she sold it. After giving the check to Luc, she leaves for the airport pretending to meet Charlie. Soon after, Jean-Paul approaches Luc and reveals the charade and all that Kate has done for him. Luc rushes to the airport, boards the plane, and confesses that he's in love with her and wants her to stay with him. Sometime later, he and Kate embrace each other in their beautiful new vineyard."}