{"mid": "FriendlyPersuasion", "IMDB_id": "tt0049233", "title": "Friendly Persuasion", "plot": "The film is set in Jennings County, Indiana in 1862. Jess Birdwell (Gary Cooper) is a farmer and patriarch of the Birdwell family whose Quaker religion conflicts with his love for the worldly enjoyments of music and horse racing. Jess's wife Eliza, (Dorothy McGuire) a Quaker minister, is deeply religious and steadfast in her refusal to engage in violence. Jess's daughter Mattie (Phyllis Love) wants to remain a Quaker but has fallen in love with dashing cavalry officer Gard Jordan (Peter Mark Richman), a love that is against her mother's wishes. Jess's youngest child \"Little\" Jess (Richard Eyer) is a feisty child whose comical feud with his mother's pet goose causes her heartache. Jess's elder son Josh (Anthony Perkins) is torn between his hatred of violence and a conviction that to protect his family he must join the home guard and fight the invaders.\nWe are introduced to the family via its youngest member, \"Little\" Jess, who is forever at war with his mother's pet goose. The story begins as an easygoing and humorous tale of Quakers trying to maintain their faith as they go to meeting on First Day (Sunday); contrasted with the Birdwells' neighbor Sam Jordan (Robert Middleton) and other members of the nearby Methodist Church. The mood shifts dramatically when the meeting is interrupted by a Union officer who asks how the Quaker men can stand by when their houses will be looted and their families terrorized by approaching Confederate troops. When confronted with the question of his being afraid to fight, Josh Birdwell responds that it might be the case. His honesty provokes the wrath of Purdy, a Quaker elder who condemns people who don't believe as he does.\nThe film returns to its lighter tone as the Quakers try to maintain their ways, despite the temptations of amusements at a county fair, and a new organ (which Jess buys over Eliza's opposition), but one is always reminded that the Confederate Army is drawing closer. On a business trip, Jess acquires a new horse from the widow Hudspeth (Marjorie Main), and is finally able to defeat Sam in their weekly horse race. One day, Jess is cultivating his fields and notices an immense cloud of smoke on the horizon produced by the burning of buildings. Josh soon arrives and tells them the neighboring community has been reduced to ash and corpses. Josh believes that he must fight, a conviction that threatens to destroy the family. Eliza tells him that by turning his back to their religion he's turning his back on her, but Jess sees things a different way. Josh finds himself on the front line of the battle to stop the advance of the raiders, fires his gun, and is injured by the Confederates. Meanwhile, Jess is reluctant to fight, only picking up a rifle when the family horse gallops back to the farm riderless.\nWhen Confederates arrive, they loot the farm for food when only Eliza and the younger children are present. Sam Jordan is bushwhacked by a \"Reb\" and Jess struggles with the Confederate soldier and takes away his gun, but ultimately lets him go free and unhurt. Each member of the family faces the question of whether it is ever right for a Christian to engage in violence."}