{"mid": "FritzTheCat", "IMDB_id": "tt0068612", "title": "Fritz the Cat", "plot": "In a New York City park, hippies have gathered with guitars to sing protest songs. Fritz and his buddies show up in an attempt to meet girls. When a trio of attractive females walk by, Fritz and his friends exhaust themselves trying to get their attention, but find that the girls are more interested in the crow standing a few feet away. The girls attempt to flirt with the crow, making unintentionally condescending remarks about blacks, while Fritz looks on in annoyance. Suddenly, the crow rebukes the girls with a snide remark and walks away. Fritz invites the girls to \"seek the truth\", bringing them up to his friend's apartment, where a wild party is taking place. Since the other rooms are crowded, Fritz drags the girls into the bathroom and the four of them have group sex in the bathtub. Meanwhile, the police (portrayed as pigs) arrive to raid the party. As the two officers walk up the stairs, one of the party-goers finds Fritz and the girls in the bath tub. Several others jump in, pushing Fritz to the side where he takes solace in marijuana. The two officers break into the apartment, but find that it is empty because everyone has moved into the bathroom. Fritz takes refuge in the toilet when one of the pigs enters the bathroom and begins to beat up the partygoers. As the pig becomes exhausted, a very stoned Fritz jumps out, grabs the pig's gun, and shoots the toilet, causing the water main to break and flooding everybody out of the apartment. The pigs chase Fritz down the street into a synagogue. Fritz manages to escape when the congregation gets up to celebrate the United States' decision to send more weapons into Israel.\nFritz makes it back to his dormitory, where his roommates ignore him. He decides to ditch his bore of a life and sets all of his notes and books on fire. The fire spreads throughout the dorm, finally setting the entire building ablaze. In a bar in Harlem, Fritz meets Duke the Crow at a billiard table. After narrowly avoiding getting into a fight with the bartender, Duke invites Fritz to \"bug out\", and they steal a car, which Fritz drives off a bridge, leading Duke to save his life by grabbing onto a railing. The two arrive at the apartment of a drug dealer named Bertha, whose cannabis joints increase Fritz's libido. While having sex with Bertha, he comes to a realization that he \"must tell the people about the revolution!\" He runs off into the city street and incites a riot, during which Duke is shot and killed.\nFritz hides in an alley where his older fox girlfriend, Winston Schwartz, finds him and drags him on a road trip to San Francisco. When the car runs out of gas in the middle of the desert, he decides to abandon her. He later meets up with Blue, a heroin-addicted rabbit biker. Along with Blue's horse girlfriend, Harriet, they take a ride to an underground hide-out where several other revolutionaries tell Fritz of their plan to blow up a power station. When Harriet tries to get Blue to leave with her to go to a restaurant, he hits her several times and ties her down with a chain. When Fritz objects to their treatment of her, he is hit in the face with a candle by a member of the group. Blue and the other revolutionaries then gang-rape her. After setting the dynamite at the power plant, Fritz suddenly has a change of heart, and unsuccessfully attempts to remove it before being caught in the explosion. At a Los Angeles hospital, Harriet (disguised as a nun) and the girls from the New York park come to comfort him in what they believe to be his last moments. Fritz, after reciting the speech he used to pick up the girls from New York, becomes revitalized and has sex with the trio of girls while Harriet watches in astonishment."}