{"mid": "FunAndFancyFree", "IMDB_id": "tt0039404", "title": "Fun & Fancy Free", "plot": "=== Bongo ===\nJiminy Cricket first appears inside a large plant in a large house, exploring and singing \"I'm a Happy-go-Lucky Fellow\", until he happens to stumble upon a doll, a teddy bear, and a record player with some records, one of which is Bongo, a musical romance story narrated by actress Dinah Shore. Jiminy decides to set up the record player to play the story of Bongo. The story follows the adventures of a circus bear named Bongo who wishes he could live freely in the wild. Bongo is raised in captivity and is praised for his performances, but is poorly treated once he is off stage. As such, while traveling by a circus train his natural instincts urge him to break free. As soon as he escapes and enters a forest, a day passes before his idealistic assessment of his new living situation has been emotionally shattered and he experiences some hard conditions. The next morning however, he meets a female bear named Lulubelle. The two fall in love, until Bongo immediately faces a romantic rival in the brutish, enormously-shaped bear named Lumpjaw. Bongo fails to interpret Lulubelle slapping him as a sign of affection and when she accidentally slaps Lumpjaw, he claims her for himself, forcing all other bears into a celebration for the \"happy\" new couple. Bongo comes to understand the meaning of slapping one another among wild bears and returns to challenge Lumpjaw. He manages to outwit Lumpjaw for much of their fight until the two fall into a river and go over a waterfall. While Lumpjaw is swept away and dies, Bongo's hat saves him from falling down and he finally can claim Lulubelle as his mate.\nBongo later aired as an individual episode on a 1955 episode of Walt Disney's anthology TV series with new introductory segments, which used Jiminy Cricket's narration and singing replacing Dinah Shore's. The short was released separately in 1989 in the Walt Disney Mini-Classics line.\n=== Mickey and the Beanstalk ===\nThis segment is narrated by Edgar Bergen in live-action sequences, who, with the help of his ventriloquist dummies Charlie McCarthy and Mortimer Snerd, tells the tale to child actress Luana Patten at her birthday party. The short later aired as an individual episode on a 1963 episode of Walt Disney's anthology TV series with new introductory segments. Ludwig Von Drake (voiced by Paul Frees) replaces Edgar Bergen as the narrator in the 1963 version, for which he has a Bootle-Beetle companion named Herman (replacing the sassy comments of Edgar Bergen's ventriloquist dummy Charlie McCarthy). A second version of the short was produced replacing Bergen with narration by Sterling Holloway, as a stand-alone short in such venues as the 1980s TV show, Good Morning, Mickey!. This short was one of many featured in Donald Duck's 50th Birthday. A third version of Mickey and the Beanstalk was on the Disney television show \"The Mouse Factory\", which aired from 1972 to 1974. This version starred Shari Lewis and Lamb Chop. The Ludwig Von Drake version of Mickey and the Beanstalk was released separately in 1987 in the Walt Disney Mini-Classics line. This version was then re-released in 1994, as part of Disney Favorite Stories collection. In 2004, the theatrical version of Mickey and the Beanstalk was released as a bonus feature on the Walt Disney Treasures set Mickey Mouse In Living Color, Volume Two. The TV version, featuring Ludwig Von Drake narrating, is available as part of the Disney Animation Collection (Volume 1).\nA jovial countryside land called Happy Valley, kept alive at all times by a singing harp, is suddenly plagued by a severe drought and falls into turmoil and depression after the harp is stolen from the castle by a mysterious assailant (and also nicknamed \"Gruesome Gulch\"). The residents are driven into poverty and forced to leave in order to avoid death by starvation. Eventually, only three residents are left: Mickey, Donald, and Goofy. The trio have but just one loaf of bread and a single solitary bean to eat. One particular night, Mickey is forced to cut the bread into slices so ridiculously paper-thin that you could see right through them. Donald, driven to insanity by starvation, attempts to kill their pet cow with an axe, but is stopped by the combined efforts of Mickey and Goofy. Mickey then decides to sell the cow for money to buy food.\nGoofy and Donald are excited about eating again and begin to sing about delicious dishes until Mickey comes back and reveals that he traded their beloved bovine for a container of beans, which he claims to be magical. An enraged Donald, thinking that Mickey had been tricked, furiously throws the beans down the floor and they fall through a hole. However, it turns out that the beans are truly magical after all as later that night, the light of a full moon causes a beanstalk to sprout from under the house and lift it far up into the sky.\nThe next morning, Mickey, Donald, and Goofy climb the gigantic beanstalk and enter a magical kingdom of enormous scope, where they appear to be tiny creatures compared to their surroundings. They eventually make their way to a huge castle, where they help themselves to a sumptuous feast. There they stumble across the harp locked in a small box, as she explains that she was kidnapped by a \"wicked giant\". Sure enough, just then, a giant named Willie emerges from the shadows, grunting angrily but then suddenly breaking into a happy song (\"Fee Fi Fo Fum\") and bouncing a ball about while demonstrating rather amazing powers like flight, invisibility, and shapeshifting.\nAs Willie prepares to eat lunch, he accidentally catches Mickey in his sandwich. Mickey sneezes when Willie pours pepper and tries to run away, but Willie catches him. Mickey plays palm reader and gains the childish giant's trust. Willie offers to show off his powers, and Mickey, spotting a nearby fly-swatter, asks him to change into a fly. However, Willie suggests turning into a pink bunny instead, and as he does he sees Mickey, Donald, and Goofy with the fly-swatter. Angry, Willie captures Mickey, Donald, and Goofy and locks them in the harp's chest so as to keep them from pulling any more tricks.\nIn order to escape, Mickey must find the key and rescue his friends, and does so with the help of the singing golden harp, who begins singing Willie to sleep. Mickey almost alerts Willie to his presence by sneezing after falling into a box of powder in Willie's pocket, but the same powder makes Willie sneeze and he loses sight of Mickey. Mickey frees his friends and they make a break for it with the harp. However, Willie wakes up from his sleep and spots them, giving chase all the way to the beanstalk. Mickey stalls him long enough for Donald and Goofy to reach the bottom and begin sawing the beanstalk. Mickey arrives just in time to finish the job of cutting down the beanstalk, and Willie, who was climbing down, falls to his apparent death.\nBack in the narrator's home, the narrator (be it Ludwig Von Drake or Edgar Bergen) finishes his story and cheers up his companion (be it Herman or Mortimer Snerd), who was crying for Willie. Just as the narrator says that Willie is a fictional character and not real, Willie himself appears, alive and well, tearing the roof off the narrator's house. Willie inquires about Mickey's whereabouts, but the narrator faints in shock while the companion tells Willie goodnight. Before the scene closes, Willie notices The Brown Derby restaurant and picks up the building searching for any sign of Mickey and since the restaurant looks like a hat, places it on his head, and stomps off with the HOLLYWOOD lights blinking in the background."}