{"mid": "FunnyMan", "IMDB_id": "tt0109858", "title": "Funny Man", "plot": "When Max Taylor (Benny Young) wins the ancestral home of Callum Chance (Christopher Lee) in a game of poker, little does he realise that the game is far from over. After moving into the ancestral home with his family the nightmare begins after Max spins a wheel of chance, (a wheel with four parts, two saying win, and two saying lose). It lands upon lose, and this awakens a demonic creature that lives in the soil of the ancestral home. Soon, one by one, Max's family are murdered by this strange creature known as the Funny Man (Tim James), a Mr Punch-like jester with a varied and imaginative repertoire of homicidal techniques and a highly irreverent sense of humour. This sense of humour is shared with the audience. He is the only character that addresses the audience directly, as in a pantomime. He kills off Max's wife and both kids in gruesome yet humorous ways. Max's son being the 1st, after walking around a pillar in circles playing with Funny Man, he stops and is killed off screen. After, Funny Man changes his voice to sound like Max's son and talk Max's wife while looking at her through a key hole, he is then seen dragging the child's body away and telling the audience \"when hosting a party, it's always good to put the little ones down first.\". Max's wife is beaten to death with a club after failing to escape an endless room. Max's daughter is killed while playing a Gameboy after Funny Man hooks jumper cables up to her head, electrocuting her to death to the point where she catches fire. Meanwhile, Max's brother, Johnny Taylor (Matthew Devitt), is on his way to the mansion with a bunch of hitchhikers who will be lucky to survive the night. Among the hitchhikers is a voodoo woman (Pauline Black) who after using tarot cards later learns about the awakening of the Funny Man. At first, after arriving at the ancestral home, everything seems fine. But the Funny Man has made his targets, and his evil game has begun. It soon becomes a Scooby-Doo Rock'n'Roll madhouse with bizarre scenes, gruesome kills and lots of humorous moments. \"Just remember, there's no rest for the wicked.\""}