{"mid": "Futureworld", "IMDB_id": "tt0074559", "title": "Futureworld", "plot": "Two years after the Westworld tragedy (the date June 20, 1985, is seen on the check presented to the game show winner in the opening scene), the Delos corporation owners have reopened the park after spending $1.5 billion in safety improvements. For publicity purposes, newspaper reporter Chuck Browning and TV reporter Tracy Ballard are invited to review the park. Just before the junket is announced, Browning arranges to meet with a Delos employee who promises he has dirt on the corporation. During the meeting, the tipster is shot in the back and dies after giving Browning an envelope.\nAt the resort, guests choose from a range of theme parks: Spaworld (\"where old age and pain have been eliminated\"), Medievalworld, Ancient Romanworld, and Futureworld; Westworld is abandoned. Browning and Ballard choose Futureworld, which simulates an orbiting space station. Robots are available for sex as well as amusements like boxing. They are guided through the resort by Dr. Duffy, who shows them the marvels of Delos, demonstrating that all the problems have been fixed.\nThe reporters are stunned to find that the Control Center is staffed entirely by robots. That night, their dinners are drugged. While they sleep, medical tests are conducted so Delos can make clones of them. A visiting Russian General and a Japanese politician are also tested for cloning. Back in her room a few hours later, Ballard wakes in a fright, remembering the experience as a nightmare.\nBallard and Browning sneak out to explore the resort's underground areas. They end up triggering a cloning machine, which generates three samurai. Just as they are about to be captured by the samurai, a mechanic named Harry saves them. He takes them back to his quarters, where he cohabits with a mechanic robot he has named Clark after Superman's alter-ego. The reporters interview Harry, but they are interrupted and returned to their rooms.\nThe following day, while Ballard is testing out a Delos dream-recording device, Browning slips out to see Harry. Harry takes Browning to a locked door that he has never been able to enter, although robots routinely enter. Realizing the key is in the robot's eyes, Harry destroys a robot and steals its face. They return with Ballard and open the door. Inside, they find clones of themselves, as well as clones of the Russian and Japanese leaders. The clones are being programmed through subliminal messages; they are instructed to always work for the good of Delos and to destroy their originals. Browning explains that his tipster's envelope was filled with clippings about leaders from around the world, realizing that Delos must be cloning the rich and powerful.\nThe trio decides to flee the resort on the next plane. The reporters return to their apartment where Duffy is waiting for them; he explains that, by cloning world leaders, they can ensure that nothing harms Delos' interests, and that without \"proper\" guidance, humans will eventually destroy the planet. Cloning the reporters would ensure favorable coverage, letting people forget about the Westworld tragedy. Browning attacks Duffy but is easily overpowered with unnatural strength. Ballard shoots the doctor twice, and Browning peels back Duffy's face to reveal that he is a robot. As Harry races to meet up with the reporters, he runs into Browning's clone, who kills him. Ballard and Browning are then chased by their own duplicates, all the while taunting them with details about their lives. Eventually, one of each pair is killed, though which one is left unclear. When they find each other, Browning seizes and kisses Ballard.\nIn the end, as they leave the resort with the other guests, Dr. Schneider meets them to make sure they are the clones. The reporters confirm that they will be writing positive reviews for Delos; but, just as they reach the exit, Ballard's badly injured clone stumbles towards him and Schneider realizes too late that he has been fooled. On the jetway, Browning tells Ballard that his editor is running the exposé on Delos, that the whole world will know what they are up to, and that kissing her was his idea to figure out whether or not she was a duplicate."}