{"mid": "GabrielOverTheWhiteHouse", "IMDB_id": "tt0024044", "title": "Gabriel Over the White House", "plot": "The film opens during the depths of the Great Depression, with the inauguration of newly-elected President Judson C. \"Judd\" Hammond (Walter Huston). Hammond, a genial but corrupt and apathetic party hack, cares little for the pressing concerns of the day. Dismissing unemployment and bootlegging to be \"local problems\", he demonstrates more interest in playing with his nephew Jim and sleeping with his \"private secretary\", Pendie Molloy (Karen Morley), than with doing any actual work.One day, while recklessly racing his automobile, Hammond suffers a near-fatal crash, which leaves him in a coma. Though his doctors conclude that the president's death is imminent, a mysterious presence (conjectured later in the movie to be the Archangel Gabriel) revives Hammond. Uncertain of how to respond to the turn of events, Hammond's physician keeps his condition secret for weeks. When Molloy is finally permitted to see him, she finds Hammond distant and cold to her.Summoning his Cabinet, Hammond becomes an advocate of an activist government. When the Cabinet calls for the military to be deployed against an \"Army of the Unemployed\" that is marching to Washington, D.C. to demand work, he refuses, firing the Secretary of State when he threatens to resign in response. After the leader of the marchers is killed by racketeers, Hammond travels to the marchers' camp and announces the formation of an \"Army of Construction,\" a massive public works program that will give a paying job to every unemployed man in America until the economy recovers.Alarmed at Hammond's new course, his vice president and Cabinet begin plotting against him, only to receive requests for their resignation. This triggers impeachment proceedings against him in Congress, which is also corrupt and controlled by laissez-faire politicians. While in the midst of impeachment debates, Hammond appears before Congress and requests money to stimulate the economy. Facing Congressional opposition, he demands that Congress vote him extraordinary powers and to adjourn until the crisis was over. When the members of Congress denounce his request as dictatorship, Hammond threatens to declare martial law, leaving Congress little choice but to capitulate to his demands and grant him the power to enact all necessary measures, unfettered by the normal system of checks and balances. Enjoying the support of the public for his actions, Hammond outlaws foreclosures, creates federal bank insurance to protect depositors, and offers subsidies to farmers.Next, Hammond turns his attention to the problem of organized crime. Securing Congressional repeal of the Eighteenth Amendment, he tells crime boss Nick Diamond (C. Henry Gordon) of his plan to open government liquor stores and encourages the immigrant mobster to return to his own country voluntarily. In response, Diamond orders the bombing of the first government liquor store and attempts to assassinate Hammond in a drive-by shooting of the White House that leaves Molloy injured. Hammond retaliates by creating a special military unit called the Federal Police, to go after Diamond. Led by Hammond's top aide, Hartley Beekman (Franchot Tone), the unit corners Diamond in a warehouse and blasts him and his men out using armored cars. \"Technicalities of the law\" are circumvented with a brief military tribunal, also led by Beekman, that ends in the execution by firing squad of Diamond and his associates.Finally, Hammond moves to collect the large unpaid war debts due from other nations from the Great War. He invites the world's ambassadors to a conference on board a yacht, where, before a worldwide radio audience, he demands repayment of the debts. When the representatives protest their inability to pay, Hammond announces his country's repudiation of the naval limitations agreement, threatening a renewed arms race as a result. Staging a display of air power for the conferees by ordering naval bombers to sink two obsolete battleships, he delivers an impassioned speech on the total destruction of humanity to come in \"the next war\" unless they choose the alternative of using military expenditures to balance their budgets and repay their debts instead. The world's leaders agree to a peace covenant, but upon adding his signature to the covenant Hammond collapses. As he lies dying, Molloy sees his face change and the old Judd Hammond returns, seeking her approval for all that he has accomplished before finally expiring."}