{"mid": "GameChange", "IMDB_id": "tt1848902", "title": "Game Change", "plot": "The film opens in 2010 with a frame story: Republican strategist Steve Schmidt is being interviewed by Anderson Cooper for 60 Minutes. Cooper poses a difficult question regarding former vice presidential nominee Sarah Palin: was she selected because she would make the best vice president or because she would win the election?\nThe story flashes back to Senator John McCain's 2008 presidential campaign, which is struggling to compete with other Republican candidates during the primary season. A desperate McCain places a call to Schmidt, who tells him that he has decided to sit out the 2008 race. McCain, however, convinces Schmidt to reconsider.\nMonths later, Schmidt is serving as McCain's Senior Campaign Strategist, and with his help, McCain has clinched the Republican nomination. McCain's preferred running mate, Senator Joe Lieberman, is rejected by the majority of his senior advisers – including Schmidt – because he will not help compete with the celebrity of their opponent, Democratic Senator Barack Obama. The strategists quickly look for a \"game change\" candidate. The replacement must do four things: excite the conservative base, win the vote of independents, distance the campaign from the Bush administration, and close the \"gender gap\" – the GOP's 20-point deficit with women. Investigating prominent female Republican politicians, the campaign finds Palin, the governor of Alaska, to have the charismatic qualities they want. After an exceptionally brief vetting process, she is selected. Palin's eventual public reveal creates the buzz that Schmidt and McCain were looking for, bringing them to even or better with Obama in the polls.\nWhile Palin's acceptance speech at the Republican National Convention is well received, the campaign becomes concerned that she is ignorant about many political issues and grossly unprepared. Schmidt handles controversies from her past, such as Troopergate and \"Bridge to Nowhere\", while other staff attempt to fill broad gaps in her understanding of domestic and foreign politics. While prepping for the interviews, she is preoccupied with her approval ratings in Alaska and the absence of her family while campaigning, eventually becoming unresponsive to advisers who begin to question her mental state. Several prominent blunders in major interviews, such as those with Katie Couric, are a source of mockery in the media and frustration in the campaign. Overwhelmed and poorly prepared, Palin lashes back at attempts by Schmidt and Nicolle Wallace to give her a crash course on the major issues, then blames them for setting up public interviews that ultimately reveal her lack of knowledge. Schmidt opines that YouTube has altered the media landscape in that Palin's gaffes are seen online repeatedly rather than being forgotten in the news cycle.\nBy late 2008, with prospects appearing poor, the campaign staff boosts a negative campaign against Obama's past associations with the liberal elite, which Palin supports but McCain resists. The staff also comes to accept that Palin is better at memorizing and delivering lines than she is at actually understanding issues. Thus they grudgingly prepare her for the Vice-Presidential debate by simply having Palin memorize about forty minutes' worth of talking points, which manages to get her through the debate without major incident. However, Palin's growing popularity with the Republican base, even as she alienates mainstream voters, soon overshadows the campaign; Palin becomes uncooperative, rejecting – and conflicting with – Schmidt and the rest of the campaign staff as she gains her own following. Palin, in fact, rebuffs McCain by publicly disagreeing with his decision to end campaigning in Michigan. McCain, meanwhile, becomes discouraged by the negative campaigning, watching growing hostility and vitriol emerge toward Obama among McCain's supporters. With Election Day approaching, senior campaigners express regret that Palin turned out to be style without substance, with Schmidt lamenting that they neglected to vet her competency. McCain consoles Schmidt by reaffirming that taking a risk with Palin was better than fading away.\nWhen Obama wins on Election Night, McCain and his advisers stop a rebellious Palin from giving a concession speech along with McCain's, as it was unheard of for a vice-presidential candidate. McCain tells Palin that she is now one of the party leaders, and warns her not to let herself be hijacked by extremism. Rick Davis (McCain's campaign manager) comments that Palin will soon be forgotten. During McCain's concession speech, he thanks Palin, who receives enormous and sustained applause, chants, and enthusiasm from the crowd, which is noted in the faces of McCain's advisors. The film returns to the 2010 interview; regarding Cooper's question about whether he would pick Palin again if he had the chance to go back, Schmidt replies that life does not give you do-overs."}