{"mid": "Gandhi", "IMDB_id": "tt0083987", "title": "Gandhi", "plot": "The story begins with the assassination of Mohandas K. \"Mahatma\" Gandhi in India in 1948. The following funeral procession is a long one and his body is conveyed on a jeep covered in flowers.The story flashes back to Gandhi's early days as an attorney in the late 1800s in South Africa. He is thrown off a train for sitting in the first-class compartment despite possessing a ticket to be there. He later stages a non-violent protest in the center of town where, with several police officers and officials present, he burns work permits that all non-Afrikaners are required to carry and present to police when demanded. Gandhi's reasoning is that the permits are an unfair and oppressive symbol of Afrikaner rule over minorities. As he burns them, he is struck by a police officer on the hand. Though quite plainly in pain, Gandhi continues to burn the permits, his will overcoming the blows from the officer. He is finally knocked down, unable to continue his protest and is arrested.When he's freed from jail, he meets a young American reporter, Walker, with whom he converses about the oppression of the masses by a handful of bureaucrats. While they walk, Gandhi is confronted by an angry youth (Daniel Day-Lewis in a bit part) and his friends. They demand that he pay them to walk down their street. Gandhi refuses in the face of obvious bigotry. When the young man's mother calls him inside, Gandhi and Walker continue down the street.Gandhi travels to his home country of India. When he arrives there he is met by members of the press who know of his exploits in South Africa. They ask if he'll take up any political causes, especially those in opposition to the British rule of India. Gandhi politely refuses the requests, saying he's only going to his home city of Porbandar. His wife accompanies him. Gandhi's real plan is to organize a non-violent protest against Britain, knowing that millions of Indians will follow him. Very soon Gandhi realizes that the British rule of India is harsh and oppressive, having grown more so since he left to pursue his law degree and is growing worse each day.One of Gandhi's first public protests is against the British textile industry. He urges his followers to weave their own cloth for clothing and other needs and burn the British cloth they've been forced to buy and wear for decades. However, many Indians, both Muslim and Hindu, stage more aggressive protests. The crowds become angry mobs when they are attacked by the police. Gandhi appears inwardly angry that his message has been misunderstood.In Amritsar, a city in Northern India, a group of Indian citizens gather in the Jallianwala Bagh garden to protest an unfair town curfew. Though the protest was peaceful, a British general, Reginald Dyer, orders his troops into the garden. They take up firing positions in the courtyard. When one of his lieutenants suggests that the protest is peaceful, Dyer says that the people have \"had their warning\" and commands his troops to open fire. Many are killed.a trial is held by the Hunter Commission, comprised of British and Indian officials. Dyer himself testifies and is at first quite proud and defiant, claiming he wished to \"inflict a lesson that would be felt through all of the India\". When asked if he'd ordered his troops to fire at the thickest part of the crowd, he says yes. He also states he would have used the machine gun on the tank that accompanied his troops (it was unable to fit through the narrow passage to the garden). When an Indian attorney asks Dyer if he attempted to help the wounded in any way, he becomes agitated and says he would have. A British official asks him how a wounded child that had been shot would be able to approach him for help. Dyer is silent.Nevertheless, the campaign generates great attention, and Britain faces intense public pressure. After World War II, Britain finally grants Indian independence. Indians celebrate this victory, but their troubles are far from over. The country is subsequently divided by religion. It is decided that the northwest area and the eastern part of India (current-day Bangladesh), both places where Muslims are in the majority, will become a new country called Pakistan. It is hoped that by encouraging the Muslims to live in a separate country, violence will abate. Gandhi is opposed to the idea, and is even willing to allow Muhammad Ali Jinnah to become the first prime minister of India, but the Partition of India is carried out nevertheless. Religious tensions between Hindus and Muslims erupt into nationwide violence. Horrified, Gandhi declares a hunger strike, saying he will not eat until the fighting stops.The fighting does stop eventually.Gandhi spends his last days trying to bring about peace between both nations. He thereby angers many protesters on both sides, one of whom (Godse) is involved in a conspiracy to assassinate him.\nAs Godse shoots Gandhi in a scene recalling the opening, the film cuts to black and Gandhi is heard in a voiceover, saying \"Oh, God!\" The audience then sees Gandhi's cremation; the film ending with a scene of Gandhi's ashes being scattered on the holy Ganga. As this happens, viewers hear Gandhi in another voiceover from earlier in the film:When I despair, I remember that all through history the way of truth and love has always won. There have been tyrants, and murderers, and for a time they can seem invincible, but, in the end, they always fall. Think of it. Always."}