{"mid": "GangsterKa", "IMDB_id": "tt3956562", "title": "Gangster Ka", "plot": "The first part follows Káčko during his criminal career in the Czech Republic. Káčko is a gangster in Ostrava who is known for that he doesn't kill his rivals but has them shot in leg. He decides that Ostrava is too small for him and departs to Prague. Prague criminal world is dominated by Milota and Sivák. Káčko starts a business with them and steals them 260 million crowns as a result. Milota decides to not revenge yet. Káčko then gains more influence and earns millions crowns during variable frauds and plans to overtake Čepro company which owns all fuel resources in the country. This plan fails when he is betrayed by one of his associates. Káčko is arrested and taken in custody awaiting trial. Milota and Sivák use it to revenge and try to steal money from his accounts. This fails because Káčko gave pin codes to his father and account numbers to his pregnant wife Sandra. Káčko's father dies during torture but doesn't give those codes. Sandra who was abducted by Sivák is then released but loses the baby as a result an abduction. Káčko is released from custody thanks to a murder of an investigator and thanks to his lawyer. He leaves the prison as a different person and decides for revenge against Milota. He decides to spare Sivák because he was just obeying Milota's orders. Káčko gives Sivák a list of people he is supposed to murder. Sivák kill people on the list one by one and gains a nickname \"Butcher\". Klein meanwhile tries to negotiate more money from Káčko but Káčko slaps him and threatens to destroy him if he doesn't obey. Klein is scared and asks Milota for help. Milota has materials that can be used as evidence of Káčko's crimes. He gives the material to Lánský an investigator who wants to get Káčko behind bars. Police raids Káčko's mansion and arrest him but Káčko escapes when he asks for toilet. Káčko then flees from the Czech Republic. Milota is meanwhile murdered on Klein's orders.\n=== African ===\nKáčko escapes to Seychelles where he only drinks and lies on a Sunshine. Meanwhile, Sivák takes over Milota's business and starts to work with Klein. Klein wants to get Káčko back to the Czech Republic because Káčko has evidence that can compromise Klein. Lánský starts to investigate Klein but his wife is killed in a murder attempt ordered by Klein which devastates him. Lánský starts reopens his investigation of Káčko. Káčko at the time \"sobered up\" and made money on selling imported Toilet Paper in Seychelles. Káčko becomes influential in Seychellois politics and helps local politician Dr. Martier during his campaign with hope of getting Seychellois citizenship. Lánský organizes another plan to take down Káčko and puts agents on him. Agents are later revealed and Káčko angrily reveals his association with Klein to media which leads to fall of government. Káčko then moves to South Africa because his friend Darda starts to work with Lánský. Káčko gains a fuhgitive status in South Africa and creates connections in South African crime world. He forms a business partnership with local mob boss Uncle Cyril. Káčko later murders Cyril and takes over his place. Káčko becomes the most powerful mobster in South Africa but starts to have problem with public and is threatened by possible loss of fugitive status which would lead to his extradition to the Czech Republic. Káčko decides to sell drugs which is against his principles. His plan to sell drugs in Australia fail when his associate John Greengrass betrays him and drugs are stolen by Pakistani mafia. Káčko then leads group of criminals in Pakistani quarter with intention to get drugs back. It results in shootout and Dardan is shot and dies which strucks Káčko. Káčko is arrested when Lánský gets a map that marks graves of Kraviec's victims. Lánský tells Kraviec during the investigation that Kraviec's family returns to the Czech Republic but he can't assure their safety against Sivák. Kraviec has Sivák killed to protect his son and wife. The film concludes with Kraviec facing trial for his crimes."}