{"mid": "GentlemenPreferBlondes", "IMDB_id": "tt0045810", "title": "Gentlemen Prefer Blondes", "plot": "Lorelei Lee (Marilyn Monroe) and Dorothy Shaw (Jane Russell) are American showgirls and best friends. Lorelei has a passion for diamonds, believing that attracting a rich husband is one of the few ways a woman can succeed economically. She is engaged to Gus Esmond (Tommy Noonan), a naïve nerd willing to do or buy anything for her. However, Gus is under the control of his wealthy, upper-class father. Dorothy, on the other hand, is looking for a different kind of love, attracted only to men who are good-looking and fit.\nLorelei plans to wed Gus in France, but Esmond, Sr. stops his son from sailing, believing that Lorelei is bad for him. Although Lorelei's job requires that she travel to France with or without Gus, before she leaves, Gus gives her a letter of credit to cover expenses upon her arrival, and promises to later meet her in France. However, he also warns her to behave, noting that his father will prohibit their marriage if rumors of misdeeds make their way to Esmond, Sr. Unbeknownst to both of them, Esmond, Sr. has hired a private detective, Ernie Malone (Elliott Reid), to spy on Lorelei.\nDuring the Atlantic crossing, Malone immediately falls in love with Dorothy, but Dorothy has already been drawn to the members of the (male-only) Olympic athletics team. Lorelei meets the rich and foolish Sir Francis \"Piggy\" Beekman (Charles Coburn), the owner of a diamond mine, and is attracted by his wealth; although Piggy is married, Lorelei naively returns his geriatric flirtations, which annoys his wife, Lady Beekman (Norma Varden).\nLorelei invites Piggy to the cabin she shares with Dorothy, whereupon he recounts his travels to Africa. While Piggy demonstrates how a python squeezes a goat by hugging Lorelei, Malone spies on them through the window and takes pictures of the two, but is caught by Dorothy as he walks away nonchalantly. She tells Lorelei, who fears for her reputation. They come up with a scheme to intoxicate Malone and then search him to recover the incriminating film while he is unconscious. They find the film in his pants, and Lorelei promptly prints and hides the negatives. Revealing her success to Piggy, she persuades him to give her Lady Beekman's tiara as a thank you gift. However, Malone reveals he had planted a recording device in Lorelei's cabin, and has heard her discussion with Piggy about the pictures and the tiara. Malone implies that Lorelei is a golddigger and, when Dorothy scolds him for his actions, admits that he himself is a liar. However, Dorothy reveals to Lorelei she is falling for Malone, after which Lorelei chastises her for choosing a poor man when she could easily have a rich man.\nThe ship arrives in France, and Lorelei and Dorothy spend time shopping. However, the pair are then kicked out of their hotel and discover Lorelei's letter of credit has been cancelled due to the information Malone shared with Esmond, Sr. When Gus shows up at their show, Lorelei rebuffs him, after which she performs Diamonds are a Girl's Best Friend, the musical number whose lyrics explain why and how women need to pursue men with money. Meanwhile, Lady Beekman has filed charges regarding her missing tiara, and Lorelei is charged with theft. Dorothy persuades Lorelei to return the tiara, but the pair discover it is missing from her jewelry box. Piggy tries to weasel out of his part in the affair when Malone catches him at the airport.\nDorothy stalls for time in court by pretending to be Lorelei, disguised in a blonde wig and mimicking her friend's breathy voice and mannerisms. When Malone appears in court and is about to unmask \"Lorelei\" as Dorothy, she reveals to Malone in covert language that she, Dorothy, loves him but would never forgive him if he were to do anything to hurt her best friend, Lorelei. Malone withdraws his comments, but then reveals Piggy has the tiara, exonerating Lorelei.\nBack at the nightclub, Lorelei impresses Esmond, Sr. with a speech on the subject of paternal money, and also makes an argument that if Esmond, Sr. had a daughter instead of a son, he would want the best for her, to which he agrees and consents to his son's marriage to Lorelei. The film closes with a double wedding for Lorelei and Dorothy, who marry Esmond and Malone, respectively."}