{"mid": "GetOut", "IMDB_id": "tt5052448", "title": "Get Out", "plot": "In the opening scene, a young black man named Dre (Keith Stanfield) is walking alone at night through a perfectly manicured suburban street. A little sports car pulls up and starts slowly tracking him. Andre gets spooked, says, \"fuck this shit\", and changes directions to briskly walk back the way he came. When he turns to see what the car did, he sees its parked where it was, but the door is open. From out of nowhere, a man in a medieval helmet attacks the black guy and drags his body to the car.Rose (Allison Williams) shows up to her photographer boyfriend Chris's (Daniel Kaluuya) apartment with pastries and coffee. They're getting ready to go away for the weekend to visit her family and hes concerned that they don't know she's dating a black guy. She assures him that, while they will likely say some stupid things, they are incredibly progressive. Her dad would have even voted for Obama a third time if he could have. He makes sure hes the only black guy Rose has ever dated. She says he is, but is confident that her parents will be totally cool.On the ride to her parents home, Chris goes for a cigarette, but Rose takes it and throws it out the window. She tells him that parents would really frown on her dating a smoker. Chris calls his buddy Rod (LilRel Howery), a TSA agent and reminds him to take care of his dog and not to feed him human food. Rod berates Chris about going to visit the white folk and says its a bad idea (Rod does not approve of his friend Chris dating a white woman). He also flirts with Rose a little bit. Chris gets a little jealous and Rose thinks its sweet. While they're deep in conversation and not entirely paying attention to the road, a deer darts out in front of the car and is hit.They pull over to investigate and call the police. The police show up and ask what they're doing in the area. Rose tells them that they're visiting her family who live nearby. The officer asks to see Chris's ID, but Rose steps in and says that because he wasn't driving there's no need for that. The officer lets them go and Chris tells Rose that was hot the way she stood up for him to the racist policeman.Chris and Rose arrive at her parents home. Her father, Dean Armitage (Bradley Whitford) is an affable neurosurgeon who, yes, tells Chris that he would have voted for Obama a third time if he could have. Her mother, Missy (Catherine Keener) is a strangely cold hypnotherapist. She offers to cure Chris of his nicotine addiction through hypnosis, but he doesn't feel cool with people tooling around in his head.The Armitages also have two onsite black helpers. Walter (Marcus Henderson) the groundskeeper and Georgina (Betty Gabriel) the maid/housekeeper. Dean acknowledges that it looks bad, two wealthy white people having two helpers who are black, but they were hired to take care of his parents and Dean would have felt bad letting them go. There's definitely something off about both Walter and Georgina. They have a definite stiff Stepford artificial politeness about them. They also both speak using dated vernacular.Dean gives Chris a tour of the house and shows him old family photos. Dean claims that his father was a track runner who was beat out by Jesse Owens to compete in the 1936 Olympics in front of Hitler. And while that was sad for his dad, it was still great to have Hitler's Aryan idealism proven wrong. There is also photos of Rose's brother who will be joining them later. He's a surgeon like his dad, but he went through a rough patch.The family gets together for afternoon tea. Missy asks about Chris's parents. Chris claims that his father left when he was young and his mother died after she hit by a car when he was age 11. Georgina sort of short circuits while pouring tea and Missy tells her to go lay down and get some rest. The Armitages tell Rose that they're having their big party tomorrow. She's surprised and they remind her that it's the same day every year. Rose's brother Jeremy (Caleb Landry Jones) arrives. He's an aggressively spoiled rich kid.That night the family has dinner and a drunk Jeremy starts talking to Chris about MMA fighting. He says that because Chris comes from a hearty stock he'd be a natural. He wants to spar, but Chris says that he has rules about play fighting with drunks. Dean and Missy tell Jeremy that maybe its time for him to go to bed.Chris and Rose retire to their room where she apologizes for her family and they go to sleep. In the middle of the night, Chris gets up and decides to sneak out for a cigarette. While outside he sees something in the distance charging him. It's Walter! He heads straight for Chris, but makes a sharp turn at the last moment and runs off in another direction. Inside the house, Georgina is staring out a window. It turns out she's looking at her own reflection, not Chris. She adjusts her hair and Chris decides to head back inside.Before Chris can make it back to his room, Missy turns on a light and startles him. She tells him that smoking is a bad habit and offers again to help him quit. He sits down and mocks the notion of hypnotism unaware of the fact that she's slowly hypnotizing him while using her tea spoon as a focus object. She takes him back to when he was 11 on the night his mom died. Chris tells Missy that his mother didn't come home from work and he was took scared to do anything about it. He was afraid that if he called the police it would make it real. So he just sat there watching television nervously digging his nails into his bedposts. Present day Chris is doing the same thing, digging his nails into the arms of the chair. She tells him to sink and 11 year old Chris sinks into his bed, while present day Chris sinks into blackness seeing himself and Missy far above. His consciousness has left his body, while his body is still paralyzed in his chair.He wakes in the morning and checks his phone. Rod has sent Chris a picture of him pretending to give his dog beer. His battery is low, so he plugs it in. Chris tells Rose that he thinks maybe her mom hypnotized him last night. He has vague recollections of the evening.The Armitages wealthy friends start to show up for the big party. Its mostly older white people who say a lot of inappropriate things to Chris like how he has a good build, because Tiger Woods golfs he must have a good swing too, are black guys better in bed, etc. Chris sneaks off and finds a blind man named Jim Hudson (Stephen Root) who says that all the people at the party are ignorant. He's an art dealer and Chris is well aware of who he is. Jim says that he's a fan of Chris's work. He recognizes the irony of a blind art dealer, but tells him that he has a really good assistant who is great at describing pieces. He envies Chris's eye. Jim says that he himself tried photography, but was never very good at it.Chris goes back to mingling with the guests and discovers another black guy in attendance. It's a young guy about his age. Chris tries to bond with him, but he too is stiff and unnatural like Walter and Georgina. (Note: a sharp eye will notice that this man is Dre from the opening of the movie.) There's something about him that seems familiar to Chris though.Chris decides to check in with Rod again. When he returns to his phone he finds it unplugged again. He plugs it in and calls Rod to tell him everything that's been going on. Rod tells him that white people love to have sex slaves and he needs to get out of there. Rose finds Chris and he tells her how weird everything is and that his phone was unplugged again. She tells him he's just being paranoid because he's in an uncomfortable situation. He agrees and she leaves. Rod tells Chris to take a picture of the black guy and he will see if he remembers him. As Chris is about to leave, hes blocked by Georgina who apologizes for unplugging his cellular phone. She was dusting the night stand and lifted it up. That's when it came unplugged and she didn't want to mess with it further. He says that its fine and hopes that he didn't mean to rat her out. She doesn't understand. So he clarifies that he didn't mean to get her in trouble. She gets super weird and lets out a single tear while telling him that the Armitages treat her like family.Chris goes back outside and tries to discreetly take the familiar black man's picture with his cell phone, but has forgotten to turn off the flash. As soon as his phone flashes, the man changes. He goes from overly prim and proper to raving. His nose starts bleeding and he jumps at Chris telling him, \"Get out! Get the fuck out while you still can!\"Rose is freaked out now too. She asks her dad what happened and he explains that the flash just caused the man to have a seizure. The man comes out and apologies for upsetting everyone and says he must return home. Chris and Rose go for a walk and Chris tells her that he's sure he recognizes the guy and that something strange is definitely going on. She agrees by saying that it did not seem like a seizure at all. Chris says that he'd really like to go home now. Rose reluctantly agrees. She says she will make up something to tell her parents.Back at the house, Dean is holding an auction with his guests. Next to him is a picture of Chris. Jim Hudson has won the auction. The rest of the guests all go home.Chris goes back to pack his belongings and gets a call from Rod who tells him that the guy in the picture is a guy named Dre whom they knew who used to work at a movie theater, but went missing some weeks ago. The phone battery dies. Chris notices the closet door is open. He looks inside and finds a box filled with photos of Rose posed romantically with many other black guys. Also there are photos of her with both Walter and Georgina who don't look at all like the robotic versions of themselves we've come to know so far. Apparently Chris isn't the first black guy Rose has been with after all!Rose returns and Chris says that he needs the keys to put their bags in the car. She looks for them in her purse as they make their way out of the house. Suddenly, Jeremy appears blocking the front door. Dean and Missy are there too. Jeremy is ready to attack, but Missy and Dean tell him to calm down. Chris keeps telling Rose to get the keys. Missy and Dean tell Chris that they don't want him to leave. Chris asks for the keys again and Rose says, very calmly: \"You know I can't give you the keys\". Chris finally realizes that Rose too is in on whatever this is. Jeremy attacks Chris. Dean yells and Missy clinks he tea spoon on her glass causing Chris to sink back into the dark void again.Meanwhile, Rod keeps trying to call Chris, but it keeps going straight to voicemail. He looks up the picture of the guy in the photo and sees that he went missing some time ago, so he goes to the police. He tells a female officer that his boy was kidnapped by white folk to be a sex slave just like the missing guy in the picture. She calls in two more officers to listen to Rod's story. When he finishes, they all burst out laughing. No one is going to take him seriously.Chris wakes up to find himself tied to a chair in front of a mounted deer head and an old TV. He watches a video made by Dean's father that talks about immortality and stuff like that. Chris sees that his finger nails have clawed through the leather arm of the chair and exposed the padding. The teacup and spoon appear on the screen again. TING TING TING and he's out.Rod tries Chris's phone again and Rose answers. She lies by saying that Chris left two days ago and is concerned about his whereabouts too. Rose says that Chris left in a taxi or an Uber maybe. Rod tells her that he went to the police and she seems concerned about this. He starts to realize that something is wrong, so he tries to record the call. When he goes back to talking to her, she tells him she knows that he has the hots for her. He tells her she's a crazy bitch and hangs up.Chris wakes up and Jim Hudson is on the screen. He tells Chris that they're going to swap brains. The other people at the party were all about being black, but Jim couldn't give less of a shit about that. What he really wants is to be able to see the world through Chris's eyes. Dean has perfected the neurosurgery to make this all possible. And Missy hypnotizes the body donors to prep them for the procedure. He will continue existing in the dark void, but will be able to continue on as sort of a passenger. The flashing is an unfortunate side effect as they saw earlier at the party. TING TING TING of the teaspoon and Chris is out again.Dean and Jeremy prep Jim Hudson for a brain transplant. Dean tells Jeremy to go get Chris. Jeremy goes down the hall, we see now were in the basement of the house, and finds Chris unconscious. He takes of his restraints and gets an I.V. ready. Chris wasn't unconscious after all. He stuffed the padding from the chair in his ears to block the sound of the tea spoon. He knocks out Jeremy.Dean starts calling for Jeremy and goes out of the lab area to check on him. Chris rushes him and impales him with the deer antlers from the other room. He knocks over a candle that ignites the blanket covering Jim Hudson too.Rose has earbuds in and isn't aware any of this is going on.Chris goes upstairs and finds Missy. She goes for the tea cup and spoon, but Chris beats her to them and smashes them. Instead she attacks him with a knife, but he turns it on her and stabs her to death. Chris goes for the front door again, but Jeremy has returned and puts him in a choke hold. Chris breaks free and finally kills Jeremy. He runs outside and gets in Jeremy's car. On the passenger seat is the medieval helmet from earlier. He starts down the driveway, but hits Georgina. He can't just let her lay there like his mom did, so he gets her in the car and continues down the driveway. She wakes up and attacks him. In the process her wig falls off and we see she has a scar across her head from a brain transplant too. They crash into a tree and she dies.Suddenly, the rear view mirror is blown away. Rose is coming after Chris with a gun. He begs her to stop, but she's more worried about the condition of her grandma. (Note: Georgina was the vessel in which Rose's grandmother's brain is now housed!) Rose shoots again and misses Chris. From out of nowhere, Walter runs in an tackles Chris. He takes the gun from Rose and she says, \"kill him grandpa.\" Walter aims at Chris, but Chris takes his picture. Flash! Walter turns and shoots Rose instead. Then he takes the gun and shoots himself in the head.Rose is on the ground bleeding out. Chris gets to his feet and then a police car pulls up. Rose smiles with her last breath. The door opens and it's Rod. Chris gets in the car. Rod looks at the chaos and says, \"Man, I told you not to go in that house.\""}