{"mid": "Gettysburg", "IMDB_id": "tt0107007", "title": "Gettysburg", "plot": "The film begins with an account of the Confederate Army of Northern Virginia, commanded by Robert E. Lee, crossing the Potomac River to invade the North in June 1863, marching across Maryland and into Pennsylvania. On June 30, Confederate spy Henry Thomas Harrison reports to Lt. Gen. James Longstreet, commander of the First Corps, that the Union Army of the Potomac is moving in their direction, and that Union commander Joseph Hooker has been replaced by George Meade. Longstreet reports the information to General Lee, who is concerned that the army is moving \"on the word of an actor\", as opposed to that of his cavalry chief, J. E. B. Stuart. Nonetheless, Lee orders the army to concentrate near the town of Gettysburg. At the Union encampments near Union Mills, Maryland, Col. Joshua Lawrence Chamberlain of the 20th Maine is ordered to take in 120 men from the disbanded 2nd Maine who had resigned in protest, with orders to shoot any man who refuses to fight. Chamberlain speaks to the men, and is able to persuade all but six to take up arms.\nIn Gettysburg, Brig. Gen. John Buford and his cavalry division spot elements of Henry Heth's division of A. P. Hill's Third Corps approaching the town, and judging the terrain to be \"lovely ground\", elect to stand and fight there. Buford sends word to I Corps commander Maj. Gen. John F. Reynolds to bring up reinforcements. Heth's troops engage Buford's cavalry the following morning, July 1, with Richard S. Ewell's Second Corps moving in to flank them. Reynolds brings his corps forward, but is killed by a Confederate sharpshooter. The Union army is pushed out of Gettysburg to Cemetery Ridge, and Lee - rejecting Longstreet's suggestion to redeploy south of Gettysburg and go on the defensive - orders Ewell to take the Union position \"if practicable\"; however, Ewell hesitates, and does not engage. The armies concentrate at their chosen positions for the remainder of the first day. At Confederate headquarters at Seminary Ridge, Maj. Gen. Isaac R. Trimble angrily denounces Ewell's inaction to Lee, and requests another assignment.\nOn the second day, July 2, Col. Strong Vincent's brigade from the Union V Corps is deployed to Little Round Top, and Vincent places the 20th Maine at the end of the line, warning Chamberlain that he and his regiment are the flank, and that if they retreat, the Confederate army can swing around behind them and rout the Union forces. Lee orders Longstreet to deploy his two available divisions to take Little Round Top and the neighboring Big Round Top. As Longstreet's corps deploys, Maj. Gen. John Bell Hood, commanding one of the divisions, protests to Longstreet; with the Union holding the high ground, he would lose half his forces if he attacked as ordered. Longstreet, despite his own protests to Lee, orders Hood to attack; Hood is later wounded fighting at Devil's Den. At the summit of Little Round Top, Chamberlain and the 20th Maine fight off wave after wave of advancing Confederates, and begin running out of ammunition. Colonel Vincent is mortally wounded, and none of the other three regiments in his brigade are able to provide support. Chamberlain orders his men to fix bayonets, and charge in a right wheel down the slope against the attacking Confederates. The attack successfully drives the Confederate assault back, and the Union flank holds. That evening, Stuart finally arrives, and Lee reprimands him for his being out of contact. At the same time, Longstreet's remaining division, under Maj. Gen. George Pickett, arrives on the field.\nFor the third day, July 3, Lee decides to send three divisions - Pickett's, Trimble's, and J. Johnston Pettigrew's - to attack the center of the Union line at Cemetery Ridge. Longstreet expresses his belief to Lee that the attack will fail, as the movement is a mile over open ground, and that the Union II Corps under Maj. Gen. Winfield Scott Hancock is deployed behind a stone wall, just as Longstreet's men had been at Fredericksburg. Lee nonetheless orders the attack to proceed. Longstreet then meets with the three division commanders and details the plan, beginning first with Colonel Edward Porter Alexander's artillery clearing the Union guns off the ridge, before deploying the men forward. Despite heavy Confederate fire, Alexander is unable to make an impact upon the Union guns; when Pickett asks to move forward, Longstreet simply nods. The Confederate divisions march across the open field, and Hancock is wounded as he commands from the front line. One of Pickett's brigades, commanded by Brig. Gen. Lewis Armistead, makes it over the stone wall, but Armistead is wounded and captured by Union troops. Pickett's Charge ultimately fails; meeting with Longstreet that evening, Lee finally decides that they will withdraw. The film ends with the fates of the major figures of the battle."}