{"mid": "GetTheGringo", "IMDB_id": "tt1567609", "title": "Get the Gringo", "plot": "The film opens with a getaway driver (Mel Gibson) and a wounded accomplice dressed as clowns fleeing from American police toward the Mexican border. The driver crashes through the border fence, whereupon he is arrested by corrupt Mexican police officers Vasquez (Mario Zaragoza) and Romero (Gerardo Teracena). When they find over $2 million in the car, they incarcerate him in El Pueblito prison under false charges, keep the cash for themselves, and cremate the accomplice, who by then has died. As one of the only Americans incarcerated there, the driver becomes known as \"the Gringo\". El Pueblito proves surprising, operating more like a small ghetto than a prison. The Gringo quickly manages to work out the prison's criminal hierarchy and engages in petty thefts and robberies from some of the prison's less reputable businesses. One of these thefts is witnessed by an unnamed kid (Kevin Hernandez) who is living with his incarcerated mother (Dolores Heredia) and is protected by the prison's criminals. Curious, the Gringo presses him to explain why the criminals protect him, but the Kid refuses.\nLater, the Gringo stops the Kid from an ill-fated assassination attempt on Javi (Daniel Giménez Cacho), leader of the crime family that runs El Pueblito. After an argument, he learns why the Kid is protected: Javi has a failing liver, and the Kid is the only viable match; Javi has already killed the Kid's father and harvested his liver. The Gringo vows to stop the transplant from happening and to help kill Javi. Meanwhile, the Gringo attracts the attention of an American Embassy employee (Peter Gerety), who easily identifies him as a career criminal. Unconcerned, the Gringo and the Kid work towards bringing down Javi, and the Gringo grows closer to the Kid's mother. The Gringo ingratiates himself to Javi by saving Javi's brother, Caracas (Jesús Ochoa) and revealing the money stolen by Vasquez and Romero. Thugs working for criminal boss Frank (Peter Stormare) have already located Vasquez and Romero and are torturing them to find the location of an additional $2 million. Javi's men kill everyone and take the money, enraging Frank. With the aid of the Embassy guy, Frank sends assassins into El Pueblito to kill Javi and the Gringo.\nThe resulting shootout results in the Mexican authorities planning a raid on the prison. Knowing time is short, Javi hires the Gringo to kill Frank and sets up an immediate transplant operation. In the US, the Gringo lures Frank out of hiding by arranging a meeting between him and shipping magnate Warren Kaufmann (Bob Gunton). The Gringo sets up his ex-partner, Reginald T. Barnes (J. J. Berry), who had betrayed him, and kills Frank. When the Gringo ambushes the Embassy employee, he learns about the transplant operation and rushes to save the Kid, who has unsuccessfully attempted to stab himself in the liver. Using the Embassy guys's credentials, the Gringo infiltrates the raid on the prison and interrupts Javi's liver transplant surgery. Threatening to kill Javi, the Gringo forces Caracas to retrieve the kid's mother, who Javi has tortured. Caracas returns with two thugs, but the Gringo kills them all. A nurse helps the Gringo by pretending to capture him. When Caracas relaxes, the Gringo shoots him. They grab the money, and the nurse helps them escape from the prison in an ambulance. In the epilogue, the Gringo recovers the missing $2 million hidden in the escape car held in the impound lot, and the Gringo, the Kid, and his mother retire to an idyllic beach."}