{"mid": "GhostInTheMachine", "IMDB_id": "tt0107009", "title": "Ghost in the Machine", "plot": "A serial killer named Karl Hochman (Ted Marcoux) is known as \"The Address Book Killer\" due to his habit of stealing address books and choosing his victims from them. While he is working at a computer store, he obtains Terry Munroe's (Karen Allen) address book after another employee, who is demonstrating a scanner, copies a page of her address book into the computer. On a rainy night while heading home, Karl suddenly ends up in a collision with a truck, which causes his car to go off the road and swerve down a trail in a cemetery as he laughs. Moments later he dies as the police and ambulance arrives to the scene.\nAfter he is put into an MRI machine in the emergency room, a surge from an electrical storm manages to transfer his soul into a computer. Now as a network-based entity, Karl continues to plot his killing spree using various objects connected to the electrical grid and computer networks.\nKarl opens the scanned page from Terry's address book and begins to kill all the names that are on her list. Her co-worker, Frank Mallory (Richard McKenzie), becomes the first victim when he dies in an electrical fire. Another friend, Elliot Kastner (Jack Laufer), gets burned to death when a hand dryer turns into a flamethrower. Terry hires a babysitter, Carol Maibaum (Shevonne Durkin), to look after her son Josh (Wil Horneff). However, Carol becomes the third victim when she gets caught between an exploding dishwasher in the kitchen as she is electrocuted.\nWhen the police do not believe the theory that Karl is on a killing spree after his death, Josh realizes the order of the killings is related to a list of contacts from Terry's address book that had been scanned into a computer at the computer store. Terry, along with computer hacker Bram Walker (Chris Mulkey), unplugs everything electrical in her house.\nThe police then receives anonymous reports of an armed robbery, hostage situation, domestic violence, and a murder in progress, all at Terry's house. The police open fire on the home after mistaking an exploding generator for gunfire. When they realize their mistake, they cease fire. Terry's mother was shot during the siege and goes to the hospital for recovery. Aided by Bram and Terry, Josh manages to defeat Karl by introducing a computer virus that traps him in a physics laboratory. They activate a atom smasher located in the lab, which draws Karl in and destroys him.\nThe film ends with Bram telling Terry to turn off a heart rate monitor in an ambulance as a signal fades out to black."}