{"mid": "GhostDad", "IMDB_id": "tt0099654", "title": "Ghost Dad", "plot": "Elliot Hopper (Bill Cosby) is a workaholic widower who is about to land the deal of a lifetime at work, which he hopes will win him a promotion and a company car. After he forgets his daughter Diane's birthday, he attempts to make it up to her by promising her she can have his car when he secures the deal at work on the coming Thursday. After being persuaded to give the car to his daughter early, Elliot must hail a taxi from work, which is driven by Satanist Curtis Burch (Raynor Scheine), who drives erratically and speeds out of control. Attempting to get the taxi stopped, Elliot announces that he is Satan and commands him to stop the taxi. Shocked to see his \"Evil Master\", Burch drives off a bridge and into the river.\nElliot emerges from the accident scene, but when he approaches a police officer, he learns that he is a ghost when the officer urinates on his shoes, then when he walks into the road, a speeding bus goes straight through him. When he gets home he discovers that his three children can see him, but only in a totally dark room, and they can't hear him. He struggles to tell them what happened when he is whisked away to London by paranormal researcher Sir Edith (Ian Bannen), who tells him he is a ghost who has yet to enter the afterlife because \"they screwed up\"; his soul will not cross over until Thursday.\nThe pressures of work and family life lead to many comedic events, as Elliot attempts to get a life insurance policy and complete his company's merger, so his family will be provided for once he crosses over. One day, he must choose between staying in an important work meeting and helping his son with a magic trick at school. He eventually decides that his family's happiness is more important and walks out on his furious boss, Mr. Collins (Barry Corbin), who later smugly fires him. Dejected, Elliot reveals himself as a ghost to his love interest, Joan (Denise Nicholas), whose initial shock soon turns to sympathy.\nEdith arrives from London to announce that Elliot is not dead; his spirit jumped out of his body in fright. They also work out that the only previous known case of this happening was Elliot's father. In the excitement to find Elliot's body to reunite his spirit with it, Diane trips on a pair of skates that her little sister Amanda left on the stairs; she falls and is seriously injured. The family rush her to the hospital where her spirit has also jumped out of her body. As she delightedly flies around, Elliot begs her to re-enter her body; his own has started to \"flicker\". When he collapses, Diane becomes concerned and races into the intensive-care unit to find her father's body. She helps him into the room and they discover that Burch had swapped wallets with Elliot, meaning Elliot was wrongly identified by the hospital as Burch. Elliot returns to his body and wakes up; Diane does the same and jumps off the operating table to tell the family what has happened.\nAs the reunited family leave the hospital, Elliot spots a yellow taxi parked outside and Burch behind the wheel. Delighted to see his \"Evil Master\", Burch returns Elliot's wallet and tells Elliot he will do whatever Elliot commands. Elliot commands Burch to go to hell and sit on red hot coals waiting for him \"until it snows\". Curtis agrees enthusiastically and drives off while Elliot, Joan, Edith and the family leave the hospital."}