{"mid": "GhostDogTheWayOfTheSamurai", "IMDB_id": "tt0165798", "title": "Ghost Dog: The Way of the Samurai", "plot": "Ghost Dog (Forest Whitaker) sees himself as a retainer of Louie (John Tormey), a local mobster, who saved Ghost Dog's life years ago. While living as a hired hitman for the American Mafia, he adheres to the code of the samurai, and interprets and applies the wisdom of the Hagakure in his contracts for the mob.\nLouie tells Ghost Dog to kill a gangster, Handsome Frank, who is sleeping with the daughter (Tricia Vessey) of local mafia don Vargo (Henry Silva). Ghost Dog arrives and kills the gangster, before seeing that the girl is also in the room at the time; she lends him a book; he leaves her alive, and exits. In order to avoid being implicated in the murder of a made man, Vargo and his associate Sonny Valerio decide to get rid of Ghost Dog. Louie knows practically nothing about Ghost Dog, and the hitman communicates only by homing pigeon. The mobsters start by tracing all the pigeon coops in town. They find Ghost Dog's cabin atop a building and kill his pigeons. Ghost Dog realizes he must kill the entire mafia or otherwise they will kill him and his master.\nDuring the day, Ghost Dog frequently visits the park to see his best friend, a Haitian ice cream salesman named Raymond (Isaach De Bankolé) who speaks only French. Ghost Dog does not understand French and Raymond does not understand English, but the two seem to understand each other. Ghost Dog also makes friends with a little girl named Pearline (Camille Winbush), to whom he lends the book —Rashōmon and Other Stories— he received from Vargo's daughter. Paralleling a major theme of Rashōmon, Louie and Ghost Dog have different accounts of the circumstances of their meeting: in Louie's flashback he shoots Ghost Dog's attacker in self-defense, while in Ghost Dog's flashback, Louie shoots the attacker just as the attacker is about to kill Ghost Dog.\nEventually, Ghost Dog attacks Vargo's mansion single-handedly and kills almost everyone he encounters, sparing only Louie and Vargo's daughter. At night, Ghost Dog kills Sonny Valerio in his house, shooting a bullet through Valerio´s bathroom pipe. Ghost Dog is later expecting that Louie attacks him (as he feels that, according to the mob code, Louie must avenge the murder of his boss Vargo). He goes to the park and gives Raymond all his money, helping him to stay in the country and build a boat. Pearline appears and gives back Rashōmon to Ghost Dog, expressing that she liked it. Ghost Dog then gives Pearline his copy of Hagakure and encourages her to read it.\nThough Louie feels some loyalty to Ghost Dog, he finally confronts Ghost Dog at Raymond's ice cream stand with Raymond and Pearline watching. Ghost Dog is unwilling to attack his master and allows Louie to kill him. His last act is to give Louie the copy of Rashōmon and encourage him to read it. It is then revealed that Vargo's daughter ordered Louie to murder Ghost Dog. Pearline takes Ghost Dog's gun and shoots at Louie, but the gun is empty. Ghost Dog dies peacefully with Raymond and Pearline at his side. Later, Pearline reads passionately the Hagakure, indicating that she may follow Ghost Dog's way in the future."}