{"mid": "GhostInTheShell", "IMDB_id": "tt1219827", "title": "Ghost in the Shell", "plot": "In 2029, with the advance of cybernetic technology, the human body can be \"augmented\" or even completely replaced with cybernetic parts. Another significant achievement is the cyberbrain, a mechanical casing for the human brain that allows access to the Internet and other networks. An oft-mentioned term is \"ghost\", referring to the consciousness inhabiting the body (the \"shell\").\nMajor Motoko Kusanagi is an assault-team leader for the Public Security Section 9 of \"New Port City\" in Japan. Following a request from Nakamura, chief of Section 6, she successfully assassinates a diplomat of a foreign country to prevent a programmer named Daita from defecting.\nThe Foreign Minister's interpreter is ghost-hacked, presumably to assassinate VIPs in the upcoming meeting. Believing the perpetrator is the mysterious Puppet Master, Kusanagi's team follows the traced telephone calls that sent the virus. After a chase, they capture a garbage man and a thug. However, both are only ghost-hacked individuals with no clue about the Puppet Master. The investigation again comes to a dead end.\nMegatech Body, a \"shell\" manufacturer with suspected close ties to the government, is hacked and assembles a cybernetic body. The body escapes but is hit by a truck. As Section 9 examines the body, they find a human \"ghost\" inside its computer brain. Unexpectedly, Nakamura arrives to reclaim the body. He claims that the \"ghost\" inside the brain is the Puppet Master himself, lured into the body by Section 6. The body reactivates itself, claims to be a sentient being and requests political asylum. After the Puppet Master initiates a brief argument about what constitutes a human, a camouflaged agent accompanying Nakamura starts a diversion and gets away with the body.\nHaving suspected foul play, Kusanagi's team is prepared and immediately pursues the agent. Meanwhile, Section 9 researches \"Project 2501,\" mentioned earlier by the Puppet Master, and finds a connection with Daita, whom Section 6 tries to keep from defecting the country. Facing the discovered information, Daisuke Aramaki, chief of Section 9, concludes that Section 6 created the Puppet Master itself for various political purposes. This is why Section 6 is desperately trying to reclaim the body.\nKusanagi follows the car carrying the body to an abandoned building. It is protected by a large walking tank. Anxious to face the Puppet Master's ghost, Kusanagi engages the tank without backup and is nearly killed. Her partner Batou arrives in time to save her, and helps connect her brain to the Puppet Master's.\nThe Puppet Master explains to Kusanagi that he was created by Section 6. While wandering various networks, he became sentient and began to contemplate his existence. Deciding the essence of humanity is reproduction and mortality, he wants to exist within a physical brain that will eventually die. As he could not escape section 6's network, he had to download himself into a cybernetic body. Having interacted with Kusanagi (without her knowledge), he believes she is also questioning her humanity, and they have a lot in common. He proposed merging their ghosts, in return, Kusanagi would gain all of his capabilities. Kusanagi agrees to the merge.\nSnipers from Section 6 approach the building, intending to destroy the Puppet Master's and Kusanagi's brains to cover up Project 2501. The Puppet Master's shell is destroyed, but Batou shields Kusanagi's head in time to save her brain. As Section 9 closes in on the site, the snipers retreat.\n\"Kusanagi\" wakes up in a new cyborg body in Batou's safehouse. She tells Batou that the entity within her body is neither Kusanagi nor the Puppet Master, but a combination of both. She promises Batou they will meet again, leaves the house and wonders where to go next."}