{"mid": "Gigi", "IMDB_id": "tt0051658", "title": "Gigi", "plot": "Set in turn-of-the-20th century Paris, the film opens with Honoré Lachaille (Maurice Chevalier) who is surrounded by members of high society in the Bois de Boulogne. Being a charming old roué, he remarks that in Paris, marriage is not the only option for wealthy young bon vivants like his nephew Gaston (Louis Jourdan), who is bored with life. The one thing Gaston truly enjoys is spending time with Madame Alvarez (Hermione Gingold), whom he calls Mamita, and especially her granddaughter, the precocious, carefree Gilberte, aka Gigi (Leslie Caron).\nFollowing the \"family tradition\", Madame Alvarez sends Gigi to her Great Aunt Alicia (Isabel Jeans) to be groomed as a courtesan to learn etiquette and charm. To Alicia, love is an art, and a necessary accomplishment for Gigi's social and economic future. But Gigi shows disdain for such trivial love that a man and his mistress usually have. Remaining true to her girlish, yet charming personality, she finds herself having the most fun when she is with Gaston, whom she regards as an older brother.\nLike his uncle, Gaston is known as a wealthy womanizer. The whole of Paris watches his every move, and Parisian high society shows unrestrained judgment towards him and his mistresses. Gaston's latest mistress attempts to run off with her ice skating instructor. As a response, he publicly humiliates her, resulting in her attempted suicide. After this ordeal, Gaston wishes to retreat to the country, but his Uncle insists on him staying in Paris and attending more parties.\nGigi makes a wager during a card match with Gaston, suggesting that if he loses, he has to take her and her grandmother to the sea with him when he goes on vacation. Gaston agrees, and they all travel to the country. While Gaston and Gigi spend countless hours having fun together, Honoré and Madame Alvarez reveal their once-passionate relationship. While other women at the resort are shown holding perfect poise constantly, and giving off an air of boredom and disdain for anything unfamiliar, Gigi is pulling Gaston out of his depressive rut with her carefree, fun attitude.\nOnce Gigi and her grandmother return to Paris, Gaston goes to Monte Carlo for some time. During this time, Gigi's aunt and grandmother discuss the possibility of Gigi becoming Gaston's mistress, thereby fulfilling their goals for her. Madame Alvarez, though dubious at first, agrees to let Gigi train around the clock to prepare for Gaston's return. Gigi accepts this as a necessary evil.\nWhen Gaston returns, he is surprised and discomfited when Gigi appears in her new, adult dress. Gaston stammers out that she looks like a giraffe and that he misses her old outfits. He storms out, realises his folly, and rushes back to apologize. He tells her that she looks lovely, and says that he will prove it to her by taking her to tea at the Reservoir. Gigi's grandmother refuses and tells Gaston that this may ruin her reputation to be seen unchaperoned with Gaston before her reputation has even begun. Gaston, angered, storms out once again.\nAs he walks, he starts to reflect about Gigi. He stops and realizes suddenly, that she has become a woman whose charms, wit, and personality have sent his head spinning, and comes to the conclusion that he has developed a romantic desire for Gigi. Although he has doubts due to their enormous age difference, he also realizes that he loves her even more than he thought (unheard of between a man and a mistress) and he wants to be with her. He proposes an arrangement to Madame Alvarez and Aunt Alicia for Gigi to become his mistress. They are overjoyed. Gigi, wisely, is not.\nGaston talks to Gigi and she tells him that she isn't the type of girl who wants publicity and to be dumped by him one day, then having to become someone else’s mistress. After Gaston accidentally reveals that he loves Gigi, she admits that she has feelings for him too, but wants their relationship to remain platonic. Gaston leaves angered, but Gigi later calls him up admitting she would rather be miserable with him than without him and agrees to accompany him in public. Gigi dresses in finery for their date, and when Gaston arrives he is entranced by her beauty.\nThey go to a restaurant, where Gigi acts the role of courtesan perfectly – perhaps a little too perfectly. Gaston is uncomfortable with her knowledge of the other courtesans, and concerned for Gigi because of the unrelenting attention and judgment of other patrons. Honoré then delivers a crushing blow when he congratulates Gaston on his new courtesan and makes degrading remarks towards Gigi. Gaston, too in love with Gigi to give her this appalling life of uncertainty and judgment, leaves without a word after dragging her home crying. However, he stops a little way down the street and realizes his love for her is too strong so he does something he never thought he would do; he proposes marriage.\nThe final sequence reverts to Honoré Lachaille, proudly pointing out Gaston and Gigi riding in their carriage in the Bois de Boulogne. The couple are elegant, beautiful, and happily married with a sense of fun and love that has been unseen when looking at other relationships high society has to offer."}