{"mid": "GiJoeResolute", "IMDB_id": "tt1259299", "title": "G.I. Joe: Resolute", "plot": "After repeated attempts to seize power through brute force have failed, Cobra Commander comes up with a new plan to recover Cobra's financial investments, and seize control of world power at the same time. The plan begins with the seizure of the High Frequency Active Auroral Research Program array (HAARP), which superheats the ionosphere. Following this, various rockets carrying electronic equipment are launched into low earth orbit. A solar powered stratellite network is deployed just below the ionosphere, allowing Cobra to maintain a covert worldwide communication network. Finally, at a decommissioned nuclear missile silo in Siberia, a prototype particle beam weapon is unveiled. Cobra Commander warns his troops that he will tolerate no attempts against him, and as a show of his seriousness, he kills Major Bludd, and has his dead body found in Washington DC.\nA Cobra operative known as Firefly fires a special missile package through the wall of the United Nations building in Manhattan, NY, which deploys a small holographic projector. Cobra Commander uses the projector to broadcast a message to the assembled UN representatives, in which he demands that all nations on earth turn control of their resources over to the Cobra organization within 24 hours, or face indiscriminate attacks upon their capital cities. As a show of force, the cannon is fired at Moscow, Russia, destroying the city and killing approximately ten million civilians. In the Pacific Ocean the USS Flagg, a modified aircraft carrier, falls prey to a saboteur. Explosives rigged in vital areas destroy almost all on board weapons, ammunition, and vehicles, in addition to severely compromising the vessel's integrity. A Joe named Bazooka had been killed prior to the attack while on guard duty. An autopsy uncovers a note hidden in Bazooka's mouth, which reveals the assassin to be Storm Shadow, a former friend of Snake Eyes from his time training as a ninja. Snake Eyes, after reading the scroll's hidden note, departs to confront Storm Shadow and settle their rivalry once and for all.\nMeanwhile, the other Joes on board the Flagg learn from Dial Tone that satellite communications are down due to the superheated ionosphere, and eventually trace Cobra's activity to the HAARP array, the satellites, and the Siberian particle cannon, which lies beneath the decommissioned Russian ballistic missile complex. Logistical personnel explain that the HAARP array allows the particle cannon to superheat the ionosphere, causing it to reflect particles. The energy from those charged particles is dispersed across the super-hot ionosphere, and then reassembled above its intended target. Once there, the particles are focused into a powerful collimated beam, which uses charged particles to wipe entire cities off the map.\nThree separate Joe teams are deployed: The first team consisting of Gung-Ho, Roadblock, Stalker and Beach Head manages to recapture the HAARP array in Alaska, and free hostages being held by Destro and the Baroness. The second team consists of Ripcord, Duke and Scarlett. Duke and Scarlett perform a HALO jump to the Siberian facility wearing winged jet packs. They infiltrate the location, kill Zartan, and destroy the location by forcing the repurposed nuclear warheads powering the particle cannon to detonate. Tunnel Rat manages to knock out Cobra's orbiting stratellite network by reviving technology from Project Manhigh, building an assault platform capable of reaching the stratellite array, without activating each stratellite's defensive cannons. He then uses a microwave power transmission broadcast via the stratellite's rectenna to compromise and destroy the network. However, Cobra Commander unveils a second smaller HAARP array on an islet in Micronesia, and a second lesser particle cannon hidden in the town of Springfield, a major Cobra installation. Cobra fires this secondary particle cannon at the Flagg, sinking the already evacuated carrier. Elsewhere, Snake Eyes and Storm Shadow meet on an island, containing an abandoned complex that was once used by Snake Eyes' ninja clan. In flashbacks, Snake Eyes recalls his time as a student, and how he unsuccessfully attempted to prevent his mentor's assassination at the hands of a Cobra mercenary working for Storm Shadow. Snake Eyes and Storm Shadow engage in a fight to the death, a fight that ends with Storm Shadow's defeat.\nOver the Pacific Ocean, several aircraft carrying the evacuated Joes and crew members of the Flagg arrive at the location of the secondary particle cannon. After exchanging fire with Cobra forces, Flint and Scarlett manage to create an opening, allowing Duke and Snake Eyes to gain access to the facility. Duke makes his way to the control center, and discovers that Cobra Commander ordered his men to aim the particle cannon at Washington, DC, then killed them, and locked himself inside a safe room within the control center. Unable to prevent the firing of the particle cannon, Duke elects to reprogram the targeting coordinates, causing the directed-energy weapon to fire on its own location. However, Cobra Commander's whereabouts remain unknown, as his safe room was later found empty, as documented by Duke in his final report. A post credits scene shows Storm Shadow's grave to be empty."}