{"mid": "GiJoeTheMovie", "IMDB_id": "tt0093066", "title": "G.I. Joe: The Movie", "plot": "G.I. Joe faces a new enemy as an ancient society of snake people known as Cobra-La try to forcefully take back the earth from those who drove them underground eons ago.\nThe leader of Cobra-La, Golobulus, sends out Cobra Commander and the Cobra forces to steal the Joe's BET, Broadcast Energy Transmitter, but they have failed to do so. Golobulus and Cobra-La need the BET because it's the only energy source that is hot enough to ripen the pods that they are about to launch into earth's atmosphere and devolve mankind into their perfect society. One that is devoid of any intelectually sound organic life-forms. The punishment for failiure in Cobra-La society is being biologically mutated and devolved.\nCobra Commander begged and pleaded for mercy before being sentenced for his short-comings.\nG.I. Joe then figures out that if they don't stop the enemy from launching the spores into the earth's atmosphere it could devolve mankind as they know it.====================================================The story opens at Cobra's headquarters, the Terror Drome fortress. Cobra Commander is berating his staff for gross incompetence in light of the failures Cobra has endured in their plan for world domination. Cobra's supreme ruler, Serpentor, is also present and wastes no breath in belittling Cobra Commander's own failures, which his staff, Destro, the Baroness, the Crimson Twins, Tomax and Xamot, and Zartan, all agree is at the root of their organization's problems.Outside the Drome, a mysterious figure, dressed in a cloak, rapidly approaches the main gate of the Terror Drome and begins using what appear to be organic weapons to subdue Cobra's elite guards -- the intruder throws small, octopus-like creatures at the guards faces, which instantly incapacitate them. The intruder rushes through the Drome at a rapid pace, heading for Serpentor's throne room. Though several security gates and devices are employed and many more guards are dispatched to stop her, she defeats them all and slips in between two large gates and falls to her knee before Serpentor. As she evades capture, Cobra Commander sees her and seems to recognize her.The intruder is a humanoid woman named Pythona, who tells Cobra's Emperor that she is an emissary from an ancient civilization called Cobra-La. Though Dr Mindbender had created Serpentor through genetic manipulation and was inspired to do so through a dream, Pythona's species was responsible for the actual dream Mindbender experienced. Pythona shows Serpentor a small organic holographic projector and gives him his next mission: he and Cobra must attempt to steal a device from their greatest opponents, GI Joe. The device is the Broadcast Energy Transmitter (BET), which can generate enough energy to remotely power any device or vehicle that is electrical. Pythona promises Serpentor that the plan will succeed and Cobra will rule the Earth.GI Joe heads to a site near the Himalaya Mountains to run the first tests of the BET's capabilities. In a snowy valley, they unload the BET and are about to begin the tests when Cobra attacks in full force, lead by Cobra Commander. The battle is fierce and Cobra is able to turn the tide of battle against the Joes when they activate the BET. The device sends power surges to all their vehicles, which engage in the battle. Cobra is routed, Serpentor is captured and the Joes split their forces: one unit will pursue Cobra into the nearby Himalayas & the other will take the BET to a secure location.Cobra Commander leads the rest of their forces into a valley between two of the mountains where there appears to be a tropical forest. Large flowers form most of the forest and the whole area is covered by a natural stone dome. As the Joes continue their pursuit, one of their vehicles is suddenly flipped over by a large being of which they only catch a glimpse. Other humanoids burst up from the ground holding large cleaver-like weapons. The Joes are quickly overwhelmed and captured.Cobra Commander walks up to the hulking humanoid that had flipped the Joes' vehicle and congratulates him and his forces on their easy defeat of the Joes. The winged humanoid, the Nemesis Enforcer, grabs the Commander by the throat and gives him to his comrades, who take him away. The rest of Cobra's lieutenants, including Zartan and the Dreadnoks, are easily persuaded to follow the orders of Pythona when she shows them a large jewel, promising them riches beyond their dreams.The remnants of Cobra's forces are taken to the center of the domed area, called Cobra-La. There, they meet Golobulus, Cobra-La's ruler. He shares his peoples history with the group: millions of years ago, they were the rulers of the Earth as it's first intelligent species and their own technology was based on organic life. However, another species began to threaten their sanctity: humans. As neanderthal humans evolved and began to discover technology based on science and mechanical means, Cobra-La and its inhabitants realized they must retreat and wait for a time when they could destroy humanity and regain the Earth. Cobra-La's dome was constructed and became their home for many millennia.One of Cobra-La's brilliant scientists began to work with a plant species that produced dangerous spores. An accident occurred in his lab where the spores exploded in the young scientist's face and mutated his appearance, giving him multiple eyes. Golobulus saw the potential for this being to retake the Earth and sent him out to do battle with humanity, wearing a helmet with a silver mask. He became Cobra Commander and rallied others to his cause, building the forces of Cobra. However, he was repeatedly met with defeat by the forces of GI Joe.Golobulus reveals that the recounting of Cobra-La's and Cobra Commander's history is a trial of sorts, where the Commander is judged to have committed the greatest sin of their civilization: failure. He is condemned to be exposed to the spores again. Nemesis Enforcer carries out the sentence and the Commander is again deformed, his body mutated again into a snake. Golobulus also reveals his plan to wipe out humanity: the large flowers that make up the forest outside of Cobra-La's dome contain larger spores, enough to infect the Earth and turn humans into mindless, deformed beasts, which Cobra-La can rule over. Golobulus will need the BET to aid the spores' maturity in space before the intense cold freezes them. He orders Serpentor's lieutenants to mount a mission to both rescue their leader and steal the BET.Back at GI Joe's headquarters, the officer put in charge of guarding the Serpentor is Lt. Falcon, Duke's half-brother. He is arrogant and irresponsible, bringing a young woman on a date to the secure facility which imprisons Serpentor. Duke finds them and orders Falcon to escort his date off the base. As the woman runs from the area, she whips off a disguise; she is Zarana, Zartan's sister. She reports back to Cobra-La about the Serpentor's location & the security measures surrounding him.Meanwhile, at a training facility, Beach Head is trying to whip some new recruits into shape. Lt Falcon is one of them but does not show up for PT. The rest are quite undisciplined and a motley bunch: Jinx is a Japanese martial arts expert who is able to defeat Beach Head in hand-to-hand combat when she fights with her eyes closed, but brings her own bad luck to any situation she finds herself in. Law is a demolitions expert whose dog, Order, is a trained bomb-sniffer. Big Lob is a tall former basketball player who sees combat as a form of sport. Tunnel Rat can find alternate routes around most obstacles. Chuckles is an undercover operative but also relies on brute strength. Beach Head's training sessions are tough but the recruits bring their own unique talents to bear and complete the course.At night, a small Cobra unit, led by Pythona and the Nemesis Enforcer, lead a mission to free Serpentor. Pythona and the Enforcer outwit the security measures and defeat the Joes with their organic weaponry. Gung Ho, Alpine and Bazooka are all seriously injured.General Hawk holds Lt Falcon, responsible for the security of Serpentor, accountable for the theft and for the wounded. He is quickly court-martialed and sent to St Slaughter's remote training grounds to learn proper soldiering. He's dropped out of an airplane and parachutes into a large desert, where he's met by several thuggish brutes, the Renegades. Sgt Slaughter appears and tells Falcon he's been charged with \"whipping him into shape\". While the rest of the team board vehicles and drive to Slaughter's base, Falcon is left behind to travel by foot. When he arrives, he's too late for chow and is ordered to clean all the dishes. While they train, Duke gives Slaughter and his team a mission to infiltrate the Terror Drome and gather any intelligence they can. Falcon jokingly suggests that they go on the mission unarmed. With the help of Mercer, a former Cobra operative, the team successfully sneaks into the Terror Drome and discovers that Cobra plans to again capture the BET. They also overhear Serpentor talking about Cobra-La, an organization Mercer himself has never heard of. Slaughter orders Falcon to find the communications room and alert the Joes while he, Mercer & the rest of his squad set a bomb in the armory. Falcon is discovered and captured. Serpentor interrogates him harshly until Slaughter and the Renegades rescue Falcon and they escape as their bomb explodes.Meanwhile, at Cobra-La, the imprisoned Joes believe that they can rebel against their captors and escape. Waiting for the guards to open their cell, they rush out, beating several guards. However, when they reach the main gate, large plants surrounding the area come alive and snatch them, wrapping them in vines and immobilizing them. Only Roadblock manages to escape, meeting the Nemesis Enforcer, who blinds him with dust from an organic pod. Roadblock is found by Cobra Commander, who leads him out a secret exit. They float down a nearby river to safety. Cobra Commander mumbles most of the way, his voice slowly changing to a snake's hiss and his speech indicative of his mind being lost. His mask falls off, revealing that his face is changing to a snake's.Cobra launches another assault on the Joes to seize the BET. Again, Cobra-La's organic weaponry defeats the Joes, who are highly outnumbered. Two gigantic caterpillar-like creatures erupt from underground and battle the Joes. Slaughter, Falcon and the other Renegades join the battle. A large moth-like creature appears and carries off the BET. Serpentor himself is about to kill Lt Falcon with a poisonous snake he uses as a spear but Duke throws himself in front of it. He falls into a coma, bidding the Joes to defeat Cobra and Cobra-La.Roadblock and Cobra Commander are picked up by Joe forces in the Himalayas. Roadblock is told that his sight will return; however, there's nothing they can do for Cobra Commander. Roadblock warns them that the outer defenses of Cobra-La are formidable but with the Commander's help, they will able to sneak into Cobra-La. The mutating spores are launched into space and Golobulus orders the activation of the BET to mature the spores in space and infect the Earth. The Joes begin a final assault to stop them.In the pitched battle, Golobulus orders all of Cobra-La's plant and animal life to rise and attack the Joes. Sgt Slaughter faces off against the Nemesis Enforcer and defeats him, throwing him down a deep chasm. Jinx blindfolds herself and battles with Pythona and beats her hand-to-hand, avoiding Pythona's venomous claws. Lt Falcon takes on Serpentor, sabotaging his air chariot and sending him spinning out of Golobulus' lair. Falcon then faces off with Golobulus, who emerges from his pod, exposing his serpentine lower body. When it seems that he'll break Falcon's neck, Falcon stabs him in the eye with his timer rod. Golobulus retreats to his pod, telling Falcon that the spores have matured in space and will cover the Earth any second. When Falcon finds the BET, he reconfigures the device to overload and incinerate the spores. The plan works and the BET overloads and explodes.The Joes regroup, gathering prisoners. They are informed that Duke has come out of his coma. Lt Falcon has proven himself a solider, as have Sgt Slaughter's Renegades and Beach Head's motley recruits. The Joes return to their headquarters victorious."}