{"mid": "Gilda", "IMDB_id": "tt0038559", "title": "Gilda", "plot": "Johnny Farrell (Glenn Ford) is in Buenos Aires playing dice with locals. Soon someone holds a gun to his head, but a man with a snappy cane helps him out and also tells him about a casino on the other side of town.At the casino, Johnny makes sure he looks his best and enters the gambling room. He watches a short man win with a late bet at the roulette table. He goes to the blackjack table and wins several hands after requesting each time to cut the deck. Two tough guys says the casino director wants to see him; Johnny tries to fight them, but fails. The director turns out to be the man with the cane and goes by the name of Ballin Mundson (George Macready). Johnny admits to cheating, but instead of being thrown out he manages to persuade Mundson to hire him.Soon World War II ends, and there is a party at the casino. Mundson is due to leave town and leaves Johnny in charge; they have gained each other's trust. When Mundson returns he has Johnny come to his house. Mundson has brought home a woman, Gilda (Rita Hayworth), as his wife. When Johnny and Gilda see each other it's clear that they know each other, though they don't tell Mundson. That night at the casino Johnny sees the man from earlier winning at roulette again in suspicious manner and learns that it is Mundson's way of bribing those that allow his casino to continue despite gambling being illegal.Johnny has dinner with Mundson and Gilda. When Mundson leaves the table to meet with some German men, Johnny blames Gilda for marrying Mundson for the money. Gilda dances with another man, Capt. Delgado, and even gives him her phone number in front of Johnny. Later that night Mundson reveals his suspicion to Gilda that she knows Johnny from before and warns her that she should not make any missteps.Another night at the casino we see the man from before looking for his bribe at the roulette table, but his bet is turned away. Soon Johnny finds Mundson in his office talking to the same man; the conversation is about tungsten trading, Mundson telling the man he should not be selling the metal according to their agreement. Johnny goes downstairs to get Gilda out of the way, who is again enjoying herself with another man, and he and Mundson have a drink in the bar. Suddenly there's a gunshot, it's the man with the tungsten who is out to get Mundson; he misses, but in the commotion goes into the washroom and shoots himself.Scared by the threat to his life, Mundson tells Johnny about the cartel that he runs to monopolize tungsten and control the world, and gives him the combination to the safe in his office. Later that night Gilda returns home from town with the young man, Gabe. Johnny knocks the guy over and has him leave and tells Gilda she should not make trouble with Mundson and that he will make things appear right even if she does continue to cavort with other men.One night Johnny wakes up by the sound of Gilda singing in the casino room with only the washroom attendant, Pio (Steven Geray), as audience. She's been out again. Johnny takes her home and they tell to Mundson that they have been swimming, together.Another night the casino is having a carnival party. Two Germans come to Johnny's office and demand to see Mundson; Johnny rings Mundson. Mundson talks to Gilda about being late for the party; tension runs thick between them. At the party Johnny and Gilda dance; Gilda comes on to him, but he refuses. A man, Obregon (Joseph Calleia), who's been hanging around the casino for weeks, tells Johnny there might be trouble. Johnny gets a message that Gilda has left and wants him to pick her up later. Soon a man is revealed to be dead behind his mask, and there is commotion. Johnny finds Mundson in his office and warns him he might be in danger. But Mundson tells Johnny to go find Gilda, then calls an airfield and makes some arrangements.Johnny picks Gilda up, and they go to the house. Gilda suggests they make use of the time alone. He goes to her room to throw her out, but ends up kissing her. They hear a sound and Johnny sees Mundson leaving the house: he has seen them. Johnny goes after Mundson in a car, and so do the police, headed by Obregon. They follow Mundson to an airfield and watch him take off in a plane and crash down into the ocean, assuming that he is dead. However, we soon see Mundson being picked up by a boat, revealing that he had indeed intended to escape from the police investigation.With everybody thinking Mundson is dead, Gilda inherits his fortune, and Johnny takes over the casino and the cartel. Gilda and Johnny get married, and he takes her to a new home. Gilda is happy, but Johnny does not intend to live with her; instead, he makes sure she cannot have contact with anyone. One of the Germans from the cartel comes to see Johnny and tells him that Mundson held the tungsten patents unrightfully. Now he wants them and the cartel leadership back.Gilda comes to see Johnny, wanting a reason for his treatment of her. He blames her for cheating on Mundson and wants to punish her. Seeking company, Gilda starts going out with other men, but Johnny has them disappear one by one. Realizing Johnny wants to keep her in cage, she runs. We see her as a club singer in Montevideo with another man, Tom. He persuades her to go back to Buenos Aires to get an annulment of her marriage. But when they arrive, it turns out Tom is on Johnny's payroll, and Gilda is back in her cage.Obregon talks to Johnny, wanting him to reveal the names of the cartel members, Johnny says he knows nothing about it. Gilda starts singing and dancing in the casino and flirts with the men. Johnny doesn't like it and hits her. Obregon comes again, closes down the casino and puts pressure on Johnny. Johnny gives him what he wants. Obregon tells Johnny that Gilda is waiting in the casino. Johnny overcomes his pride and asks Gilda to take him with her back to America. Suddenly Mundson appears from his office, explains how he is not dead afterall and announces his intention of killing them both. But before he can, Pio stabs Mundson with his own cane. Obregon comes in seeing what's happened, but lets them go, saying afterall a man can only die once. Gilda tells Johnny, \"Let's go home.\""}