{"mid": "GirlWithAPearlEarring", "IMDB_id": "tt0335119", "title": "Girl with a Pearl Earring", "plot": "Griet (Scarlett Johansson) is a shy girl living in the Dutch Republic in 1665. Her father, a Delftware painter, has recently gone blind, rendering him unable to work and putting his family in a precarious financial situation. To help matters, Griet is sent to work as a maid in the household of famed painter Johannes Vermeer (Colin Firth). Griet works hard, almost wordlessly, in the lowest position in a harsh hierarchy, doing her best despite spiteful treatment by one of Vermeer's children. While she is on a routine shopping trip outside the house, a butcher's son, Pieter (Cillian Murphy), notices Griet and falls in love with her, even though she is slow to return his affections.\nAs Griet cleans Vermeer's studio, which his wife Catharina (Essie Davis) never enters, the painter begins to converse with her and encourages her appreciation of painting, light and color. Vermeer gives her lessons in mixing paints and other tasks, taking care to keep this secret from his wife, who would react with anger and jealousy if she found out that her husband was spending time with Griet. In contrast, Vermeer's pragmatic mother-in-law, Maria Thins (Judy Parfitt), sees Griet as useful to Vermeer's career.\nVermeer's rich patron, Van Ruijven (Tom Wilkinson), notices Griet on a visit to the Vermeer household and asks the painter if he will give her up to work in his own house, a situation which ruined a previous girl. Vermeer refuses, but accepts a commission to paint a portrait of Griet for Van Ruijven.\nAs Vermeer secretly works on the eponymous painting, Catharina cannot help but notice something is amiss and her growing jealousy of Griet becomes apparent. As Griet deals with her growing fascination with Vermeer and his talent, she has to fend off Van Ruijven's attempt to rape her. Soon afterwards, Catharina's mother summons Griet, hands over her daughter's pearl earrings, and instructs Griet to finish the painting while Catharina is away for the day. At the final painting session Vermeer pierces Griet's earlobe so she can wear one of the pearl earrings for the portrait; she then runs to Pieter to be consoled. They caress and make love in a barn. Afterwards, Pieter proposes marriage, but unexpectedly leaves. She then returns the earrings to Catharina's mother.\nCatharina discovers that Griet used her earrings, accuses her mother of complicity, and demands Vermeer show her the painting of Griet. Heartbroken that Vermeer does not consider her worthy of being painted because she \"doesn't understand,\" Catharina tries but fails to destroy the painting, then banishes Griet from the house forever. Vermeer does not object, and Griet leaves the house in shock. Later, Griet is visited by the cook from the house, who comes bearing a gift: a sealed packet containing the blue headscarf she wore in the painting, wrapped around Catharina's pearl earrings."}