{"mid": "Girlhouse", "IMDB_id": "tt2577172", "title": "GirlHouse", "plot": "In Rehobeth, Alabama, 1988, two little girls trick an overweight child they have nicknamed “Loverboy” into dropping his pants and preparing for a kiss, only to tease and humiliate him. When one of the girls rides home alone afterwards, Loverboy knocks her from her bicycle and throws her off a bridge, making the girl’s death look like an accident.\nIn the present day, struggling to pay her way through school following the death of her father, college coed Kylie Atkins is recruited by entrepreneur Gary Preston to join his online pornography venture Girl House. Girl House allows its users to watch the ladies living inside the house 24/7 via 50 camera feeds. The girls perform stripteases and regular daily activities with the option of performing sexual acts on camera for additional money. Gary assures Kylie that Girl House’s technology cannot be hacked and that the house’s secret location is untraceable. He brings Kylie to the house and introduces her to Steve, who shares security guard duties with Big Mike. Kylie also meets fellow Girl House residents Kat, Devon, Janet, Heather, and Mia.\nKylie performs her first striptease online and captures the attention of Loverboy, who watches from his basement in Atlanta and is known as a Girl House regular. Also watching are Alex and his college roommate Ben Stanley, who recognizes Kylie as the girl he has had a crush on since kindergarten. Having been banned for her heroin addiction, former Girl House performer Anna sneaks back into the house and convinces Gary to give her another try. Ben and Kylie begin a relationship.\nKylie has a private chat session with Loverboy. He hacks into the computer system and surprises Kylie by sending her a picture of his face. Anna later finds the picture while snooping on Kylie’s laptop. Later, Ben admits to Kylie that he knows about her involvement with Girl House. However, they talk through the issue and continue their relationship.\nLoverboy angers the other women in Girl House by continually asking for Kylie when she is not there. The girls begin making fun of him for being pathetic. Loverboy notices his picture on the bulletin board inside Girl House with a handwritten caption that reads, “What a stud.” Kylie comes home and takes down the picture as soon as she sees it. Eventually, Loverboy snaps. He hacks into Girl House’s system, dons a mask, and breaks into the building housing Girl House’s servers, where he kills the website’s technical team. Loverboy straps Gary to a chair and stabs him several times. Slowly dying from blood loss, Gary is forced to watch through the monitors as Loverboy travels to the house’s location and continues his rampage. Loverboy kills Steve at the security gatehouse. He then strangles Anna with a piece of rope inside the house’s Off-Camera Room.\nFrom his dorm room, Alex watches as Loverboy mutilates Devon during a private dance. Alex shows Ben the carnage taking place live at Girl House. Ben tries texting a warning to Kylie but, just as she returns to Girl House, Loverboy jams incoming and outgoing communications. Oblivious to what is going on inside the house, Kylie retires to her room. Ben instructs Alex to try hacking into Girl House to find its address while he goes in search of other ways to locate Kylie. Meanwhile, Loverboy kills Heather and her boyfriend while they are having sex. Janet investigates the commotion and catches Loverboy in the act of severing the boyfriend's head; Loverboy throws her over an upstairs railing. She survives, but breaks her legs in the fall. Next, Loverboy locks Mia in the sauna room. She smashes a lump of coal through the door and escapes to the pool outside, but there Loverboy kills her with a sledgehammer. Gary eventually dies from blood loss while watching the horror unfold onscreen at the technical facility. Kylie realizes the danger when she spots Loverboy at the pool from her window. Loverboy electronically locks Kylie inside the house. Janet attacks him, but is unsuccessful and gets stabbed in the head.\nKylie finds Kat and tries to hide in her bedroom. Loverboy breaks in and corners Kylie, who now recognizes him. Kat seemingly knocks Loverboy unconscious with his crowbar and goes for help while Kylie tries to find Devon. Kat meets Big Mike at the front door, but Loverboy recovers in time to kill them both. Kylie is able find Devon and tells her to stay in her bedroom while she searches for help. Distraught over her disfigured face and severed fingers, Devon suffocates herself with a plastic bag. At the same time, Ben finds Kylie’s friend Liz Owens at Selby College and together they try to find out where Kylie is. Ben helps the police find an address for Girl House, but their tactical team ends up storming the technical facility instead. Alex eventually hacks into Girl House’s ISP and determines the house’s real address. Ben races there with Liz.\nLoverboy chases Kylie throughout the house. She hides in the utility room and shuts off all of the cameras. She then lures Loverboy to a darkened basement where she uses a video camera’s night vision to help her stab him in the stomach with a pool stick. Injured, Loverboy overpowers and begins to strangle her, but she ends up clubbing him to death with the camera. She runs outside, where Ben and Liz show up with the police and a news crew following behind. The film ends with Kylie breathing deeply and the screen cuts to black."}