{"mid": "GiveMyRegardsToBroadStreet", "IMDB_id": "tt0087337", "title": "Give My Regards to Broad Street", "plot": "Paul (Paul McCartney) is stuck in a traffic jam in his chauffeur-driven car on his way to an interview. He day-dreams that he is driving himself in a flashier car crammed with modern technology around the countryside when he gets a call from Steve (Bryan Brown) that Harry (Ian Hastings), a reformed criminal, is missing along with the master tapes he was supposed to give to the factory the previous day. Paul races to the studio to find that the police are already there investigating the matter, thinking that Harry is back to his old ways and plans to bootleg the tapes. The news gets worse when Mr. Rath (John Bennett), to whom the studio owes money, arrives with the news that he will take over the record company if the tapes aren't found by midnight.\nFollowing the meeting, the film follows a day in the life of Paul and his work with wife Linda McCartney and friend Ringo Starr, which includes filming two videos, rehearsing in a loft, and recording performances for the radio. In between this, Paul wonders what Harry might have done: did he give the master tapes to be bootlegged, did he just run off, or was he murdered? During several songs, Paul has elaborate fantasies in various settings and costumes inspired by his predicament. Once the day is done, Paul goes out driving around London while his associates brace themselves for the takeover as midnight approaches. While driving towards Broad Street, Paul remembers that Harry was headed there when he last saw him and goes exploring the station. Eventually, he finds the blue case containing the tapes on a platform bench, and Harry in a small maintenance building nearby, where he had accidentally trapped himself looking for a bathroom. They both laugh, and as they drive off, Paul informs Linda, and Linda informs the studio at the last minute, that the tapes have been found and the takeover is averted. Paul's chauffeur-driven car finally arrives at its destination and he is awoken from his slumber."}