{"mid": "GleamingTheCube", "IMDB_id": "tt0097438", "title": "Gleaming the Cube", "plot": "Brian Kelly is an underachieving high school student in Orange County, California. An avid skateboarder along with many of his friends, Brian is frequently at odds with his parents for his increasingly reckless behavior, which has landed him in jail on more than one occasion. The only person in the family Brian can relate to is his adopted Vietnamese brother Vinh, who works as a shipping clerk for the Vietnamese Anti-Communist Relief Fund (VACRF), an organization whose stated purpose is to send medical supplies to Vietnam.\nWhen Vinh discovers a suspicious error in VACRF's shipping records, he brings it to his boss Colonel Trac, who dismisses the matter as a clerical error. But when Vinh tries to investigate further, Colonel Trac abruptly fires him. Determined to find out the truth, Vinh sneaks into Westpac Medical Supplies (WMS), the warehouse responsible for VACRF's shipping, but is apprehended by the warehouse's owner, Ed Lawndale. He is then taken to a local motel and interrogated by Lawndale and Bobby Nguyen, another of Colonel Trac's employees. When Colonel Trac himself arrives at the motel, it is revealed that he and Lawndale are conspirators in a scheme to smuggle illegal weapons and ammunition to Vietnam. Convinced that Vinh poses no threat to their operation, Trac intends to set him free, but unfortunately Vinh dies from being strangled by Nguyen. The next morning, a housekeeper enters the room and finds Vinh's body hanging from a noose, purposely made to look like he committed suicide.\nAfter the funeral, Brian finds the same list of medical supplies Vinh was investigating in their room, but written in Vietnamese. While looking for someone to translate it, he encounters Bobby Nguyen who immediately begins to follow him. When Nguyen stops to use a pay phone, Brian slips unnoticed into the backseat of his car. In a secluded area, Nguyen meets with Trac and Lawndale and attempts to extort them for $50,000 and plane ticket to Bangkok in exchange for information on Brian. A struggle ensues, and Nguyen is inadvertently shot to death by Lawndale. When Trac and Lawndale depart, Brian flees to notify the police. However, when they arrive at the scene, the authorities find no trace of the crime. Brian confides in Detective Al Lucero, believing that his brother did not commit suicide. While skeptical, Lucero offers to do what he can to help.\nAs Brian's suspicion of Colonel Trac continues to grow, he decides to reach out to Trac's daughter Tina, a fellow high school student and Vinh's ex-girlfriend. After an image makeover, Brian asks her out on a date and the two become closer. He accompanies Tina to one of VACRF's social functions, where he notices Lawndale and learns of his connection to Trac and WMS. Following in his brother's footsteps, Brian sneaks into Lawndale's warehouse and successfully uncovers a cache of weapons in a shipping crate.\nTaking matters into his own hands, Brian causes an explosion at the warehouse and plants evidence to incriminate Trac, but Lucero immediately suspects Brian and admonishes him for the act. However, the incident causes Trac to panic and send his wife and daughter away to his brother's house, for their own safety. A distressed Tina spends the night with Brian and discovers a lighter belonging to her father in Brian's room, leading Brian to explain all his suspicions to her. Tina angrily confronts her father about the conspiracy, who is shamed by his involvement and contacts Lawndale to remove himself from the operation. In response, Lawndale begins to target Brian directly, sending a group of Vietnamese motorcyclists to run him down on the street. The police manage to apprehend the bikers and, with the aid of an interpreter, Lucero is able to confirm Lawndale's role in the attack.\nMeanwhile, Brian visits his friend Yabbo, who builds a newer, faster skateboard for Brian and rallies the rest of the skateboarding clique. Brian and the police both converge upon Colonel Trac's house, where Lawndale takes Tina hostage at gunpoint. When Trac tries to wrestle the gun away, Brian crashes into the room through the window, but Lawndale shoots and kills Trac before making his escape in a stolen police car. A chaotic chase ensues, with Brian, Lucero, and the entire skateboarding crew eventually cornering Lawndale. As Lawndale prepares to shoot him, Brian soars into the air on his skateboard and knocks him out, injuring himself in the process. At the hospital, Brian tries to comfort Tina in the wake of her father's death and suggests that they go back to school together, implying that their relationship will continue. The film ends with Brian and Lucero visiting Vinh's grave before driving away."}