{"mid": "Glory", "IMDB_id": "tt0097441", "title": "Glory", "plot": "During the American Civil War, Captain Robert Shaw, injured at Antietam, is sent home to Boston on medical leave. Shaw accepts a promotion to Colonel commanding the 54th Regiment Massachusetts Volunteer Infantry, one of the first all-black regiments in the Union Army. He asks his friend, Cabot Forbes, to serve as his second in command, with the rank of major. Their first volunteer is another friend, Thomas Searles, a bookish, free African-American. Other recruits include John Rawlins, Jupiter Sharts, Silas Tripp, and a mute teenage drummer boy.\nThe men learn that, in response to the Emancipation Proclamation, the Confederacy has issued an order that all black soldiers will be returned to slavery. Black soldiers found in a Union uniform will be executed as will their white officers. They are offered, but turn down, a chance to take an honorable discharge. They undergo rigorous training with Sergeant-Major Mulcahy, which Shaw realizes is to prepare them for the challenges they will face.\nTripp goes AWOL and is caught, Shaw orders him flogged in front of the troops. He learns that Tripp left to find shoes to replace his worn ones; his men are being denied supplies. He confronts the base's racist quartermaster on their behalf. Shaw also supports them in a pay dispute, as the Federal government pays black soldiers $10 not the $13 per month white soldiers earn. Tripp encourages the men to go without pay in protest; Shaw tears up his own pay stub in solidarity. In recognition of his leadership, Shaw promotes Rawlins to the rank of Sergeant-Major.\nOnce the 54th completes its training, they are transferred under the command of General Charles Harker. On the way to South Carolina they are ordered by Colonel James Montgomery to sack and burn Darien, Georgia. Shaw initially refuses to obey an unlawful order, but agrees under threat of having his troops taken away. He continues to lobby his superiors to allow his men to join the fight, as their duties to date have involved manual labor for which they are being mocked. Shaw finally gets the 54th into combat after he confronts Harker and threatens to report the illegal activities he has discovered. In their first battle at James Island, South Carolina, early success is followed by a confrontation with many casualties. The Confederates are defeated and retreat. During the battle, Thomas is wounded but saves Tripp. Shaw offers Tripp the honor of bearing the regimental flag in battle. He declines not believing the war will result in a better life for slaves.\nGeneral George Strong informs Shaw of a major campaign to secure a foothold at Charleston Harbor. This involves assaulting Morris Island and capturing Fort Wagner, whose only landward approach is a strip of open beach; a charge is certain to result in heavy casualties. Shaw volunteers the 54th to lead the charge. The night before the battle the black soldiers conduct a religious service, and several make emotional speeches to inspire the troops, and to ask for God's help. On their way to the attack, the 54th is cheered by the same Union troops who had scorned them earlier.\nThe 54th leads the charge on the fort suffering heavy casualties. At night the bombardment continues, forestalling progress. Attempting to encourage his men, Shaw is killed. Tripp lifts the flag rallying the soldiers to continue the charge. He is shot but holds up the flag until he dies. Forbes takes charge, and the soldiers are able to break through the fort's outer defenses. Outnumbered, Charlie Morse is killed and Thomas is wounded. At the end of the battle it is implied that Forbes, Rawlins, Thomas, Jupiter, and the two Color Sergeants are killed by canister shot. The morning after the battle, the beach is littered with bodies of Union soldiers; the Confederate flag is raised over the fort. The corpses are buried in a mass grave, with Shaw and Tripp's bodies next to each other.\nClosing text reveals Fort Wagner was never taken by the Union Army. The courage demonstrated by the 54th resulted in the Union accepting thousands of black men for combat, which President Abraham Lincoln credited with helping to turn the tide of the war."}