{"mid": "Glorious39", "IMDB_id": "tt1319694", "title": "Glorious 39", "plot": "In present-day London, Michael Walton (Toby Regbo) visits his cousins, Walter and Oliver Page (Christopher Lee and Corin Redgrave). Michael, interested in family history, asks them about his great aunt, Anne Keyes (Romola Garai), the sister of his grandmother, Celia (Juno Temple). Anne, an actress, was the eldest of the three Keyes children. Desperate for children, her father, Alexander (Bill Nighy), a Member of Parliament, and mother, Maud (Jenny Agutter), had adopted her: however, Maud subsequently gave birth to Ralph (Eddie Redmayne) and Celia. Michael is curious to learn what happened to Anne, which leads Walter to reminisce about the summer of 1939, at the Keyes estate in Norfolk.\nOn the day of Alexander's birthday, Anne has prepared a table in the garden to celebrate. Anne's friend, the outspoken MP Hector (David Tennant), and lover, the reserved Lawrence (Charlie Cox), are present for the festivities. When Alexander arrives that night he also brings a guest, the quiet government employee Joseph Balcombe (Jeremy Northam). During dinner Hector rants about Britain's lack of action against Nazi Germany, noting that while his view is unpopular, he feels that it needs to be said. It is later revealed that he has been one of those calling out for a new prime minister.\nThe next day, while looking for a missing cat, Anne finds her in one of the property's sheds, which are off-limits as they are used for storing Alexander's private papers. She finds gramophone records labelled \"Foxtrot\", which, when played, prove to contain recorded meetings and telephone conversations. Alexander reveals that he has allowed Balcombe to store government documents in the shed.\nTwo weeks later, Anne is notified that Hector has been found dead, of an apparent suicide. Anne wonders if Balcombe had anything to do with Hector's death. Alexander brushes off the idea, but does offer to ask Balcombe to remove the records from the shed, something he promises to do the next day during a picnic. While there, the picnic-goers take off for a walk, including Aunt Elizabeth (Julie Christie), leaving Anne to watch over baby Oliver. Anne awakens to find Oliver and his pushchair missing. She follows his cries to no avail, and when the family returns, they search, too, until they find him in his pushchair on a lane. Anne vehemently denies moving the baby, but the incident plants roots of doubt about Anne's word.\nBalcombe removes the records that night, but Anne has secretly kept two of them. The family then returns to London because Parliament has been recalled. While there Anne listens to the records. One contains a recording of a distressed Hector pleading with Balcombe to cease calling him and also his parents. However, the maid bursts into the room, which causes the gramophone to fall and the record to break into pieces. On 1 September Anne gives a second record to her fellow actor and friend Gilbert (Hugh Bonneville), however he is later found dead from an apparent suicide.\nAnne travels back to Norfolk to keep Aunt Elizabeth company, where she listens to the second recording. On it she recognizes Balcombe's voice, along with another, her brother, Ralph. Ralph is heard suggesting the name \"Thin Man Dancing\" for a covert operation. The name he suggested is a reference to a childhood toy with which the siblings played. This confirms to Anne that Ralph is not to be trusted. At a party in London, Anne attempts to tell Lawrence of Ralph's involvement, but he already knows. Lawrence convinces Anne to bring him the recording at a rendezvous at a suburban veterinary surgery. After Anne finds Lawrence's body in a shed filled with euthanised pets, she is drugged by her father and taken prisoner in Aunt Elizabeth's house, which is close to St Paul's Cathedral. Balcombe pays her a visit and brings with him the second recording, which was intercepted by him. He informs her that the recording had been made for her father, and that was why they were stored at the house in Norfolk. He also informs her that their house in London is being used for series of pro-appeasement meetings which her father is chairing.\nAlexander later admits to her that he believes Britain will be completely destroyed unless it secures a peace treaty with Germany, and that nothing should disturb that. Alexander tells her that she is the only member of the family that does not share his beliefs, which is why they are keeping her locked away and sedated. After some time, Maud unlocks the door to release her while the rest of the family is at the park. She goes past them, and when they act as though nothing wrong had happened, Anne runs away.\nBack in the present, Walter tells Michael that Anne died in Canada 20 years ago, and that he was just doing what his family and Balcombe had wanted. It is then revealed that Balcombe convinced Walter to move Oliver's pushchair into the lane. Michael asks Oliver and Walter to accompany him to meet his mother. They travel to the same park where Anne had last seen her family. A woman, Michael's mother, wheels an elderly woman towards them. That elderly woman is revealed to be Anne, and Michael tells them that he knew the truth all along but wanted to hear it from them."}