{"mid": "Goksung", "IMDB_id": "tt5215952", "title": "Goksung", "plot": "A Japanese man has recently arrived at a little village in the mountains of South Korea, living in a secluded house. A mysterious disease starts spreading among the villagers, causing a rash which precedes violent murderous outbreaks followed by stupor and eventually death.\nPolice officer Jong-goo, who is investigating the case, meets a mysterious young woman called Moo-myeong (“no name” in Korean), who tells him about the Japanese stranger, and later disappears. A local hunter tells Jong-goo that he saw the near-naked stranger eating a deer, with glowing red eyes. Jong-goo is unsettled, as he has had dreams about this stranger, which the hunter had described to him. He enlists the help of another police officer, and a Japanese-speaking priest to serve as translator, and they investigate the stranger's house while he is away. The other police officer finds pictures of the infected and murdered residents and their belongings. He is too shocked to say anything to the others. The stranger's house guard dog attacks the priest and Jong-goo. The stranger arrives and pacifies the dog, and the other three leave.\nThe police officer tells Jong-goo of what he saw, and hands over a shoe which belongs to Jong-goo's daughter, Hyo-jin. Soon, Hyo-jin becomes sick and displays similar symptoms as the other infected villagers. Jong-goo makes his way to the stranger’s house with the priest in anger, but finds that the pictures and evidence have been burned. Infuriated, he destroys the stranger's worship room and kills the dog when it attacks him, ordering the stranger to leave the village.\nDistraught about Hyo-jin's condition, Jong-goo's mother-in-law seeks help from a shaman, Il-gwang. As Il-gwang performs a ritual to exorcise the demon, Jong-goo finds his daughter in pain and interrupts the ritual, taking her to a hospital instead. The following day, he gathers his friends to hunt down the stranger, believing that the stranger is responsible for the disease and murders. Jong-goo and his friends go after the stranger, and eventually end up hitting him with their vehicle. They dispose of his body as Moo-myeong watches from the hills. When Jong-goo returns home, he finds that Hyo-jin's condition has seemingly improved. Il-gwang suspects they killed the wrong person; he later encounters Moo-myeong, and starts vomiting blood. He calls Jong-goo, telling him that Moo-myeong is the demon.\nJong-goo finds Moo-myeong near his house. She requests Jong-goo to believe her, telling him she had set a trap for the demon, but the trap will not work if Jong-goo goes back to his house. Confused and hesitant, Jong-goo eventually leaves to save his family, but Moo-myeong grabs him, her skin turning a ghostly white as he notices that she is wearing the personal items of some of the victims. He pulls himself away, and as he crosses his home's threshold, the floral trap withers.\nThe priest encounters the still-alive Japanese stranger in a cave. After being photographed by the stranger, the priest witnesses the stranger evolving into a demon. Back at his house, Jong-goo arrives to find that Hyo-jin has murdered their family. He calls out to her, but she stabs him and falls into a stupor. Il-gwang arrives at Jong-goo's house and takes photographs of them, and while returning to his car, unintentionally drops a box filled with photos of the other victims.\nAs Jong-goo lies dying in his home, he sees visions of happier times with his daughter and assures her he will protect her."}