{"mid": "GoldDiggersOf1933", "IMDB_id": "tt0024069", "title": "Gold Diggers of 1933", "plot": "The \"gold diggers\" are four aspiring actresses: Polly (Ruby Keeler), an ingenue; Carol (Joan Blondell), a torch singer; Trixie (Aline MacMahon), a comedian; and Fay (Ginger Rogers), a glamour puss.\nThe film was made in 1933, during the Great Depression and contains numerous direct references to it. It begins with a rehearsal for a stage show, which is interrupted by the producer's creditors who close down the show because of unpaid bills.\nAt the unglamorous apartment shared by three of the four actresses (Polly, Carol, and Trixie), the producer, Barney Hopkins (Ned Sparks), is in despair because he has everything he needs to put on a show, except money. He hears Brad Roberts (Dick Powell), the girls' neighbor and Polly's boyfriend, playing the piano. Brad is a brilliant songwriter and singer who not only has written the music for a show, but also offers Hopkins $15,000 in cash to back the production. Of course, they all think he is kidding, but he insists that he is serious – he offers to back the show, but refuses to perform in it, despite his talent and voice.\nBrad comes through with the money and the show goes into production, but the girls are suspicious that he must be a criminal since he is cagey about his past and will not appear in the show, even though he is clearly more talented than the aging juvenile lead (Clarence Nordstrom) they have hired. It turns out, however, that Brad is in fact a millionaire's son whose family does not want him associating with the theatre. On opening night, in order to save the show when the juvenile cannot perform (due to his lumbago acting up), Brad is forced to play the lead role.\nWith the resulting publicity, Brad's brother J. Lawrence Bradford (Warren William) and family lawyer Fanuel H. Peabody (Guy Kibbee) discover what he is doing and go to New York to save him from being seduced by a \"gold digger\".\nLawrence mistakes Carol for Polly, and his heavy-handed effort to dissuade the \"cheap and vulgar\" showgirl from marrying Brad by buying her off annoys her so much that she plays along, but the two fall in love. Meanwhile, Trixie targets \"Fanny\" the lawyer as the perfect rich sap ripe for exploitation. When Lawrence finds out that Brad and Polly have wed, he threatens to have the marriage annulled, but relents when Carol refuses to marry him if he does. Trixie marries Fanuel. All the \"gold diggers\" (except Fay) end up with wealthy men."}