{"mid": "GoodBurger", "IMDB_id": "tt0119215", "title": "Good Burger", "plot": "On the first day of summer, a slacking high school student, Dexter Reed (Kenan Thompson), takes his mother's car on a joyride while she is on a business trip and accidentally crashes into and damages the car of his teacher, Mr. Wheat (Sinbad). Dexter is in danger of going to jail, as he does not have a driver's license or insurance. But Mr. Wheat agrees to let Dexter pay for the damages to both cars in exchange for not calling the police on Dexter. With the damages estimated at $1,900, Dexter is forced to get a summer job. After being fired from a job at Mondo Burger for insulting the manager, Kurt Bozwell (Jan Schweiterman), he ends up finding employment at Good Burger where he meets and reluctantly befriends dimwitted Ed (Kel Mitchell) and a host of other colorful employees. Initially neither of them are aware that it was in fact Ed who inadvertently caused Dexter's car accident.\nThings take a turn for the worse when a new Mondo Burger location opens across the street from Good Burger, its fancy decor and oversized burgers threatening to close down the smaller restaurant. Fortunately, Good Burger is saved by the invention of a secret sauce made by Ed. Upon learning from Mr. Wheat that the true damages from the car accident exceed the original $1,900 estimate, Dexter takes advantage of Ed to make money off the secret sauce in order to pay off his debt sooner. Ed signs a contract that gives Dexter 80% of his profits.\nEd's sauce is a huge success and vastly improves Good Burger's business, but draws the attention of Kurt Bozwell who attempts to obtain the sauce for Mondo Burger. After failing to lure Ed away from Good Burger for a higher hourly wage at Mondo Burger, Kurt sends Roxanne (Carmen Electra) to seduce Ed into giving her the recipe for the sauce, but to no avail.\nWhen a dog refuses to eat a discarded Mondo Burger instead of a Good Burger, Ed and Dexter become suspicious and decide to investigate. Disguised as fashionable women, the two infiltrate Mondo Burger's kitchen and discover that their burgers are being artificially enhanced with Triampathol, an illegal chemical; Kurt kidnaps them, and calls a man named Wade who has them committed to an asylum called Demented Hills so they won't tell the public.\nThreatened by the success of Ed's sauce, Kurt breaks into Good Burger after hours and taints Ed's secret sauce with shark poison, but is confronted by Otis (Abe Vigoda), an elderly Good Burger employee who was sleeping on the premises, leading him to commit Otis to Demented Hills as well. After informing Ed and Dexter about Kurt's scheme, the three of them manage to escape Demented Hills and steal an ice cream truck to drive them back to Good Burger to prevent anyone from eating the poisoned sauce.\nEd and Dexter then break into Mondo Burger to expose their chemically induced burgers to the police. Dexter creates a diversion, during which Ed tries to take a can of Triampathol, but clumsily knocks one into the meat grinder. Inspired, Ed pours the entire supply into the grinder. Meanwhile, Kurt has captured Dexter, and is about to do away with him when Ed arrives bearing an empty can. Kurt mocks Ed's presumed foolishness, whereupon Ed snidely comments that the can wasn't empty when he found it. Chaos ensues in the Mondo Burger building; the burgers are now exploding due to overuse of Triampathol.\nIn the aftermath, Kurt is arrested for using the illegal substance and Mondo Burger is destroyed, with an artificial burger destroying Mr. Wheat's newly repaired car as well. Dexter also tears up the contract he formed with Ed and tells him that he gets to keep all the profits from his sauce. Ed and Dexter then walk back to Good Burger where they are both praised by the other employees as heroes for saving Good Burger."}