{"mid": "Goosebumps", "IMDB_id": "tt0111987", "title": "Goosebumps", "plot": "Zach Cooper and his mother Gale move to the town of Madison, Delaware. While settling in, Zach meets his new neighbor Hannah and her overprotective father \"Mr. Shivers.\" Zach and Hannah become quick friends, but Mr. Shivers warns Zach to stay on his side of the fence. At Madison High School where Gale works as the vice-principal, Zach befriends Champ, a socially awkward student. Later that evening, Hannah comes to Zach and takes him to an abandoned amusement park out in the woods where they watch the sun set together on top of the Ferris wheel. When they get back home, Mr. Shivers appears and again warns Zach to stay away from them or something bad would happen.\nThe next night, Zach hears Mr. Shivers and Hannah arguing, followed by Hannah screaming and something crashing. Zach calls the police, but Mr. Shivers assures the officers that the noise came from his television. Fearing Hannah is in danger, Zach tricks Mr. Shivers into going to the police station for further questioning and breaks into his house with Champ's help. The two find a shelf containing many Goosebumps manuscripts, all of which are locked. Frustrated by Champ's curiosity, Zach unlocks one of the books. When Hannah discovers them, Zach drops the book, releasing the Abominable Snowman of Pasadena. They pursue the Abominable Snowman to an ice skating rink, where Mr. Shivers appears and imprisons it back into the book.\nOn the way home, Mr. Shivers reveals that he is Goosebumps author R.L. Stine. He created the stories as a child to terrorize the people that made fun of him, but the monsters came to life and became uncontrollable, so he trapped them in the manuscripts. Returning to the house, they find Slappy from \"Night of the Living Dummy\" (who was freed after the Abominable Snowman knocked over his book) waiting for them. Angry at being imprisoned, Slappy burns his own manuscript and flees with the others in the Haunted Car (after releasing it from its book) after unlocking the book \"Revenge of the Lawn Gnomes\". They are attacked by the living lawn gnomes. When Stine and the kids try to smash them, each of the gnomes reform, making them realize that they can only run away.\nSlappy releases several monsters, letting them rampage under his command. Zach suggests Stine to write a new book that will trap every monster, but he can only do it with his special typewriter which is at the high school. On the way there, Brent Green from \"My Best Friend is Invisible\" and the giant praying mantis from \"A Shocker on Shock Street\" attack Stine's car, so they are forced into hiding. Will Blake from \"The Werewolf of Fever Swamp\" pursues them into an abandoned supermarket, only to be run over by Zach's aunt Lorraine in the parking lot.\nAs they cut through the cemetery, Zach notices that Hannah glows blue in the moonlight, revealing her not to be an actual teenage girl. They are then chased by the Graveyard Ghouls from \"Attack of The Graveyard Ghouls,\" but manage to escape. When they arrive at the school which is having a school dance, Zach privately questions Stine about Hannah. Stine reveals that she is a Goosebumps character (from \"The Ghost Next Door\") he created to cope with his loneliness, of which she is seemingly unaware. Stine finds the typewriter and starts writing a new story based on the events around them, while Zach, Hannah, and Champ lead the students at the dance in fending off all the released monsters that are storming the building. Champ manages to get his crush to kiss him, after he saves her from Will Blake when Davidson abandons her. Slappy confronts Stine and breaks his fingers with the typewriter case before the story is finished.\nStine, Zach, Champ and Hannah use one school bus to trick the monsters, and ride another one to go to the abandoned amusement park. There, Slappy lets out the big pink blob from \"The Blob that Ate Everyone.\" Stine hands the book and typewriter to Zach, and distracts the blob by allowing it to devour him. Zach finishes the story on top of the ferris wheel which is then attacked by the praying mantis and it rolls down toward where the bus is parked. They get out alive, but Zach is reluctant to open the book because Hannah will also be sucked inside it. Revealing she knew the truth about herself all along, Hannah opens the book, sucking all the other monsters into it. The blob spits Stine out as it is sucked in. Stine is then attacked by an enraged Slappy, but he manages to kick him into the vortex. Zach tries to hold on to Hannah as the book attempts to suck her in, but she accepts her fate and bids farewell to Zach with a kiss before she is also sucked in.\nSometime later, Stine has started working as Zach's English teacher and is in a relationship with Lorraine. After class, Zach asks Stine if he misses Hannah. Stine says she will always be in their minds and hearts, and then points down the hallway where to Zach's surprise and delight, Hannah is standing. Stine reveals to Zach that he wrote her back into reality with another book. Hannah and Zach kiss and leave school together while Stine burns Hannah's manuscript, making her permanently real. As Stine prepares to leave Madison High School, he sees the typewriter typing by itself inside its display case. To Stine's horror, Brent Green has evaded imprisonment and begins writing a new story titled \"The Invisible Boy's Revenge.\""}