{"mid": "GorillaMyDreams", "IMDB_id": "tt0040397", "title": "Gorilla My Dreams", "plot": "\"Sweet Dreams, Sweetheart\" plays briefly under the title card, and the cartoon opens with a trail of carrot tops floating on the seas. Bugs is stranded in a barrel in the middle of the ocean, but he doesn't seem to mind - he's reading Esquire magazine (considered an \"adults only\" magazine at that time) and singing the song \"Down Where the Trade Winds Play\" (a song made popular by Bing Crosby).\nOn the island of 'Bingzi-Bangzi - Land of the Ferocious Apes', the population is made up of gorillas that act like humans - they read the newspaper and read books such as \"The Apes of Wrath\", have families and live in huts - and speak American English. (In the underscore, one of Stalling's orchestrations of Raymond Scott's jungle themes is heard, its official title being \"Dinner Music for a Pack of Hungry Cannibals\"). One of the apes, Mrs. Gruesome Gorilla, is sad that she doesn't have any children, whereas her husband (voiced by Mel Blanc) couldn't care less. Mrs. Gruesome (also voiced by Blanc, using a falsetto) walks toward the water and starts to say, \"I'm going to...\" (suggesting despondency), but then spots Bugs floating in his barrel. Her mood instantly changes, and she takes him back to her treetop (at one point, yielding the right-of-way to a Tarzan look-alike). (Bugs finishes \"Trade Winds\" just as Mrs. Gruesome picks up the barrel, and segués into a full verse of \"Someone's Rocking My Dreamboat\", which he finishes just as he discovers himself in the clutches of the ape.) Mrs. Gruesome wants Bugs to be her 'baby'. At first, Bugs doesn't want to, but when she starts crying, he gives in (\"That's my soft spot - dames crying.\")\nMrs. Gruesome then presents Bugs to Mr. Gruesome - who is none too happy about having a baby in the house. Bugs tries to fit in, playing like a 'monkey'. Mr. Gruesome takes Bugs out for 'play', but Bugs soon realizes that he's in for a beating if he sticks around. A long chase ensues (including a frenetic version of Stalling's jungle theme), and Bugs finds himself trapped against the edge of a cliff. Bugs gives up and allows Gruesome to catch him. However, Gruesome quickly tires out and drops from exhaustion, with Bugs knocking him over with a mere puff of breathe. Emerging as the 'victor', Bugs jumps up and catches a hanging branch, again playing 'monkey' (another short clip of the jungle theme is heard in the underscore, along with the time-honored \"jungle\" sound of a kookaburra) at iris-out."}