{"mid": "GoWest", "IMDB_id": "tt0032536", "title": "Go West", "plot": "A drifter identified only as \"Friendless\" (Keaton) sells the last of his possessions, keeping only a few trinkets and a picture of his mother. Unable to find a job in the city, he goes west and manages to get a job at a cattle ranch despite having no experience. Meanwhile, a neglected cow named Brown Eyes fails to give milk and is sent out to the field along with the other cattle.\nAs Friendless tries to figure out how to milk a cow, he's told to go out and help the other ranch hands bring in the cattle. Unsuccessful in riding a horse, he falls off and sees Brown Eyes. Noticing her limp, Friendless examines her hoof and removes the rock that had been hurting her. Brown Eyes proceeds to follow Friendless around, saving him from a bull attack. Realizing that he's finally found a companion, Friendless strikes up a friendship with the cow, giving her his blanket at night and attempting to protect her from wild dogs. The next day, Brown Eyes follows Friendless everywhere, much to the chagrin of the other ranch hands. Friendless accidentally sets two steers loose after they'd been corralled in, but on the joking suggestion of the other hands, brings them back in by waving his red bandanna.\nThe ranch owner (Truesdale) and his daughter (Myers) are preparing to sell the cattle to a stockyard, though another rancher wants to hold out for a higher price. The owner, no longer wanting to wait, prepares to ship the whole herd out. Friendless, shocked to hear that Brown Eyes will go to a slaughterhouse, refuses to let her go. The ranch owner fires him and gives him his wages. Friendless tries to buy his friend back with his earnings, but is told that it's not enough. After failing to get more money from a card game, he joins Brown Eyes in the cattle car and tries to find a way to free her. The train is ambushed by the other rancher and his men. Friendless and the ranch owner's other hands manage to drive off the attackers, but only Friendless makes it back to the train as the others chase away the rancher.\nArriving in Los Angeles, Friendless frees Brown Eyes and leads her away, using his red bandanna once more to guide the other thousand steers to the stockyard. The townspeople are terrified of the cattle as some of the cows break away and begin entering the stores, but Friendless manages to corral them together. Friendless ties Brown Eyes up before going back to retrieve the other cattle, leaving his red bandanna with her in order to keep her cool. Realizing his mistake, he enters a masquerade store to find something red to attract the cows. Deciding on a red devil's outfit, he exits the store and the cattle begin to chase him. The police attempt to arrest him, but are mistakenly sprayed with hoses from the fire department, who flee once the see the cattle coming.\nThe ranch owner, realizing his ruin if the cattle are not sold, drives with his daughter to the stockyard. The owner tells him that no cattle have arrived yet. Defeated, the ranch owner prepares to leave when he sees Friendless leading the herd into the stockyard. Overjoyed, the ranch owner tells Friendless that his house and anything he owns is his to ask for. Friendless says that he only wants \"her,\" gesturing behind him to where the ranch owner's daughter is. The owner is surprised and the daughter flattered, but they quickly realize that it's Brown Eyes that he's referring to. The three drive back to the ranch, with Brown Eyes beside Friendless in the back seat."}