{"mid": "GrandPiano", "IMDB_id": "tt2039345", "title": "Grand Piano", "plot": "Tom Selznick was an up-and-coming concert pianist until he developed stage fright while attempting to play a complex piece, \"La Cinquette\". Five years later, he is slated to appear in Chicago for a comeback performance, dedicated to the memory of his late mentor, pianist and composer Patrick Godureaux (who composed \"La Cinquette\"). Godureaux posthumously acquired massive media coverage due to the mysterious disappearance of his vast fortune. Tom's return to the stage is prompted by the encouragement of his actress-singer wife, Emma.\nAs Tom arrives at the theater, his friend Norman (conductor for the evening) offers Tom confident assurance that he will perform beautifully. Shortly thereafter, a house usher hands Tom a folder of sheet music. Within, he finds the manuscript to \"La Cinquette\" and discards it. During the concert, Tom finds a note written on his sheet music that reads \"Play one wrong note and you DIE\". Believing it to be a prank, he ignores it, only to find further notes that threaten Emma, as well as a laser dot that tracks his movement. Disturbed, Tom leaves the stage, shocking the audience. He returns to his dressing room, where he receives a text that instructs him to locate and wear an earpiece, allowing communication with the would-be assassin, Clem. When Tom returns to the stage, Clem demonstrates the stealth and range of his silenced rifle by firing a shot into the floor to Tom's left; no one else notices.\nDesperate, Tom surreptitiously uses his cell phone to contact his friend Wayne, who is in the audience. When Wayne's phone rings, it momentarily disrupts the performance; Wayne leaves the concert hall in embarrassment. As he plays, Tom taps a text message to Wayne, but the usher (who is revealed to be working with Clem) kills Wayne. Clem tells Tom to look up, and Tom sees Wayne's body on the rafters. Wayne's girlfriend Ashley leaves the hall in search of him, but she is also killed by the usher. Clem then tells Tom that instead of performing Beethoven's \"Tempest Sonata\", as Norman originally announced, he must perform \"La Cinquette\" flawlessly, as an embedded lock in the piano depends on a flawless performance. Clem further reveals that the release of said lock would yield a key to a safe deposit box containing Patrick Godureaux's disappeared fortune; Clem himself is the locksmith who worked with Godureaux to construct the mechanism. Tom insists that he can only perform \"La Cinquette\" with sheet music.\nDuring intermission, Tom runs backstage in search of the crumpled manuscript, only to find that the janitor has destroyed it. Tom returns to his dressing room and listens to the piece, feverishly taking notes to help himself remember before returning to the stage. Norman announces Tom's solo performance of the Tempest Sonata, but Tom interrupts and nervously but firmly announces that he will instead perform \"La Cinquette\", to the audience's delight. Clem warns Tom to pace himself, so as not to wear himself out. Tom plays the piece completely free of error, until he gets to the very last note, which he deliberately misplays, infuriating Clem. Tom retorts that the audience does not know the difference - he receives a standing ovation, during which Tom realizes that he has finally conquered both \"La Cinquette\" and his own stage fright. Tom ignores Clem's shouted threats and introduces Emma. Much to her and the audience's surprise, he suggests that she sing an encore. Emma reluctantly obliges and Norman accompanies her on a rendition of \"Sometimes I Feel Like a Motherless Child\". The usher, realizing that everything he and Clem worked for is over, attempts to flee the building, but is shot by Clem. Tom overhears this and runs off the stage.\nRacing upstairs, Tom finds the dead body of the usher. Clem comes out of the shadows and chases Tom to the light fixture rafters, directly above the piano onstage. In the ensuing struggle, Clem threateningly dangles Tom over the rafters, but Tom (ready to die) braces himself and yanks Clem over the railing. To the entire hall's horror, Tom and Clem come crashing down onto the stage. Clem hits the piano and is killed instantly, but Tom lands to the side and survives. Emma rushes over to him, they embrace, and he says, \"I think I broke my leg\". Later, while waiting with Emma for his ambulance to leave, Tom sees the obliterated piano loaded into a shipping truck. Climbing into the truck, he plays the last four bars of \"La Cinquette\" correctly, but nothing happens. Disappointed, Tom turns away until he hears the gears of the internal lock system turn and the sound of a metal key hitting the floor. He bends down to pick it up as the camera cuts to black."}