{"mid": "GraveEncounters2", "IMDB_id": "tt2231554", "title": "Grave Encounters 2", "plot": "Film student Alex Wright and his friends Jennifer Parker, Trevor Thompson, Tessa Hamill, and Jared Lee all decide to produce a documentary about the original Grave Encounters movie, which the entire public aside from Alex believes to be fake. Alex posts an online plea for any information about the film and receives a message from someone named \"DeathAwaits6\". The message leads him to the mother of Sean Rogerson, the actor who played Lance in Grave Encounters. She believes that Sean is still alive but they discover from her caretaker that she has severe dementia and does not realize that her son is actually dead.\nAlex realizes the cast and crew from the first movie are all missing or have died (except for the directors, The Vicious Brothers, who we learn are actually interns of the first film's producer, Jerry Hartfield, and were not directly involved thus sparing their lives). He receives a mysterious message leading him to Hartfield, who confesses that the film was actual found footage. Discovering that the Collingwood Mental Hospital from the movie is actually an abandoned asylum in Canada, Alex and his friends travel to there to meet DeathAwaits6, where they discover a Ouija board. Using it to communicate with spirits, they realize that their online contact is not a person, but a paranormal entity, which turns violent and forces the group to flee. Alex decides the group should leave but not until they gather all the cameras.\nThe group unsuccessfully tries to escape, resulting in the deaths of Jared (violently hurled out of the room with the cursed window and falls to his death) and Tessa (spinal cord severed). The survivors also witness the death of the asylum's security guard by electrocution. Fleeing from one of the spirits, the group manages to escape the hospital and return back to the hotel, at which point they decide to abandon the project and flee.\nHowever, to their dismay, the hotel's elevator leads the group back to the tunnels beneath the hospital. There, they meet the actor Sean Rogerson and discover that he has been trapped inside for over nine years, lobotomized and driven insane. Rogerson explains that the reason the hospital is like this is due to Dr. Arthur Friedkin's satanic experiments and rituals which merged the spirit world and the real. He then shows them a red door in one of the rooms and tells them it is the only way out, but it is wrapped in chains that require a chain cutter to remove that is lost (the instrument is in a tool bag left behind by Trevor in one of the rooms) and eventually retrieved.\nWhile the group sleeps for the night, Rogerson, compelled by Dr. Friedkin's demonic voice, kills Trevor, then steals the team's equipment to cut the chains on the red door. He goes through it, only to realize the door leads nowhere. In a mental frenzy, he begins talking to the entities, who instruct Rogerson to continue killing.\nHaving woken up and realizing Rogerson and their equipment are missing, Alex and Jennifer explore and stumble upon Friedkin's satanic altar as he performs a lobotomy, then the sacrifice of an infant. The couple flees and encounter Rogerson, who demands them to hand over their tapes in order to \"finish\" the film, which is the only way to escape the hospital. Alex refuses and Rogerson tries to kill him.\nDuring the struggle, a void opens up on the wall and sucks Rogerson in. Realizing that Rogerson was being honest in how to escape, Alex kills Jennifer thus completing the film. He then exits the hospital through the red door, which leads him to the outskirts of Los Angeles. He is soon arrested while walking down the street at night. The last scene shows that the footage has been made into a film, with Alex and producer Jerry Hartfield claiming that everything the public sees has been staged and that it is \"just a movie\". However, Alex tells the interviewers not to go anywhere near the hospital because \"it's not worth it\".\nThe film ends, cutting to a black screen with the numbers \"49, 14, 122, 48\" appearing on screen for a split second, which, if Google searched, comes up as Riverview Hospital (Coquitlam), the hospital where the movie was filmed."}