{"mid": "GraveEncounters", "IMDB_id": "tt1703199", "title": "Grave Encounters", "plot": "Jerry Hartfield, the producer of Grave Encounters, a famous ghost investigation television series, explains that Grave Encounters was cancelled in 2003 after the fifth episode, when the cast and crew, along with the footage for episode six, mysteriously went missing. The footage was finally recovered in 2010 and brought to Hartfield. In it, the show's host Lance Preston, along with occult specialist Sasha Parker, surveillance operator Matt White, cameraman T.C. Gibson, and fake medium Houston Grey, investigate the abandoned fictional mental asylum Collingwood Psychiatric Hospital, where many instances of paranormal activity have been reported since its closure.\nAfter taking a tour of the hospital, the crew begin an overnight surveillance campaign while locking themselves inside. At first, everything is quiet, but soon, strange phenomena begin to occur, such as odd noises, doors automatically slamming shut, and (unseen to anyone but the audience) a wheelchair moving on its own. After recording a haunting where an invisible entity moves Sasha's hair, the group decides to finish their filming and wait for 6 AM when the caretaker will let them out.\nHowever, Matt disappears while retrieving the wall cameras, and the crew is unable to radio him. Now becoming uneasy and with the caretaker nowhere to be seen, the crew eventually attempt to break down the exit doors, only to discover that the exit mysteriously loops back into another hallway, and they have no way of leaving the building. Lance soon realizes that the sun has not risen, and it is still night outside, despite their cellphone clocks showing that it is well past mid-morning.\nThe group attempts to find an alternate exit, including a fire escape from the roof that T.C had seen while filming the exterior, but to no avail, as the building seemingly changes around them, creating dead ends and false exits. While the group is sleeping again, someone scratches the word \"HELLO\" into Sasha's back. After the group encounters a young woman in a hospital gown whose face demonically distorts, Houston is separated and killed by an invisible force while stumbling around in the dark. His death is recorded by one of the wall cameras. While resting, the remaining crew awakens, only to discover that they have somehow been fitted with hospital identification bracelets.\nLance, Sasha, and T.C. eventually find Matt in a room, wearing a hospital gown and mentally unstable. As the group leaves the room, T.C. tries to bring Matt with them, but is attacked by a demonic being who drags him into a blood-filled bathtub in which they both disappear. With Matt in tow, Lance and Sasha find an elevator, and Lance goes alone to find something to wedge to elevator door open. After taking a pipe from an old hospital gurney he encounters a demonic patient. Lance panics, flees to the elevator, and pries the elevator door open. He is then attacked by the patient, but Sasha rescues him.\nMeanwhile, Matt commits suicide by jumping down the elevator shaft. After climbing down a ladder in the shaft to the underground tunnels of the hospital, Sasha becomes violently ill and starts coughing up blood. The two stop to rest, and while they sleep, Sasha is covered by a strange mist and disappears. Lance alone wanders down the seemingly endless corridors as his mental health spirals downward, feeding on rats to survive.\nEventually, Lance encounters a door that appears seemingly out of nowhere, which leads to the secret operating room of Dr. Arthur Friedkin, who had performed unethical experiments on Collingwood's patients. There, he finds evidence of satanic rituals and black magic being performed on the patients. Lance then discovers a small sacrificial altar on the floor, after which he is attacked by Friedkin, who drags him away as he screams, before the camera cuts out. The camera is turned back on, showing Lance alive, though his eye is bleeding from a lobotomy done by Friedkin. He states to the camera, \"He said I'm all better now...I can finally go home. For Grave Encounters...Lance Preston signing off.\" The screen then cuts to black."}