{"mid": "GregorysGirl", "IMDB_id": "tt0082477", "title": "Gregory's Girl", "plot": "Gregory Underwood (John Gordon Sinclair) is an awkward teenager who plays in his school football team. They are not doing very well, so the coach (Jake D'Arcy) holds a trial to find new players. Dorothy (Dee Hepburn), turns up and, despite the coach's sexist misgivings, proves to be a very good player. She subsequently takes Gregory's place as centre forward, and Gregory in turn replaces his friend Andy (Robert Buchanan) as goalkeeper.\nGregory is all for her making the team, as he finds her very attractive. However, he has to compete for her attention with all the other boys who share the same opinion. Gregory initially confides in his best friend Steve (William Greenlees), the most mature of Gregory's circle of friends, and asks him for help in attracting Dorothy. Steve, however, is unable to assist him.\nActing on the advice of his precocious 10-year-old sister, Madeleine (Allison Forster), he awkwardly asks Dorothy out on a date. She accepts, but Dorothy's friend, Carol (Caroline Guthrie), shows up at the rendezvous instead and informs Gregory that something had come up; Dorothy will not be able to make it. He is disappointed, but Carol talks him into taking her to the chip shop.\nWhen they arrive, she hands him off to another friend, Margo (Carol Macartney), and leaves. By then, Gregory is rather confused, but goes for a walk with the new girl. On their stroll, they encounter a waiting Susan (Clare Grogan), another of Dorothy's friends, and Margo leaves. Susan confesses that it was all arranged by her friends, including Dorothy. She explains, \"It's just the way girls work. They help each other.\"\nThey go to the park and talk. At the date's end, Gregory is more than pleased with Susan, and the two kiss numerous times on his doorstep before calling it a night and arranging a second date. Madeleine, who had been watching from the window, quizzes him on his date and calls him a liar when he claims he did not kiss Susan.\nGregory's friends, Andy and Charlie (Graham Thompson), are even more inept with girls but see Gregory at various times with three apparent dates, and are envious of his new success. They try to hitchhike to Caracas, where Andy has heard the women greatly outnumber the men, but fail at that as well."}