{"mid": "Gremlins2TheNewBatch", "IMDB_id": "tt0099700", "title": "Gremlins 2: The New Batch", "plot": "After the death of his owner Mr. Wing, the mogwai Gizmo becomes the guinea pig of scientists at Clamp Enterprises, a state-of-the-art office building in Manhattan, run by eccentric billionaire Daniel Clamp. At the mercy of the chief researcher Dr. Catheter, Gizmo is rescued by his friend Billy Peltzer and his fiancee Kate, both of whom work for the company. Clamp befriends Billy upon being impressed by his skills in concept design, also sparking the interest of Billy's superior Marla Bloodstone. Gizmo is left in the office, where water spills on his head and spawns new mogwai, including Mohawk, who then has Gizmo locked in the vents. They eat after midnight, turning into gremlins.\nAfter Gizmo finds a way out of the vent, Mohawk tortures him while the other gremlins cause the fire sprinklers to go off and spawn a gremlin army that throws the building into chaos. Billy attempts to lure the gremlins into the lobby, where sunlight will kill them; after Billy briefs Clamp on gremlin knowledge, Clamp exits through a secret tunnel to cover the front of the building in a giant sheet to trick the creatures. The gremlins devour serums in the lab; one becomes the intelligent Brain Gremlin, who plans to use a \"genetic sunblock\" serum to immunize them to sunlight. One gremlin turns into a female, while a third becomes pure electricity and is trapped in Clamp's answering machine by Billy. All the while \"Grandpa Fred\" watches the chaos on camera with help from a Japanese tourist named Mr. Katsuji.\nMurray Futterman, Billy's neighbor from Kingston Falls who is visiting New York City, encounters a bat-hybrid gremlin and covers it with cement, effectively turning it into a gargoyle. Murray realizes that he is not crazy and that he has to help; when Clamp escapes the building using a secret route, Murray uses it to sneak inside to aid Billy. Billy and the chief of security Forster team up, but Forster is stalked and trapped by the female gremlin. Mohawk finishes torturing Gizmo and devours a spider serum, transforming into a monstrous half-gremlin half-spider hybrid. He attacks Kate and Marla, but Gizmo confronts Mohawk and kills him with an ignited bottle of white-out. Outside, a rainstorm frustrates Clamp's plan as the gremlins gather in the building's foyer, singing \"New York, New York\".\nBilly formulates a plan to kill the Gremlin army: Mr. Futterman sprays the army with water while Billy releases the electric gremlin, electrocuting them. Clamp charges in with the police and press, but sees the battle is over; he is so thrilled by the end result that he gives Billy, Kate, Fred, and Marla promotions and hires Mr. Katsuji as a cameraman. Billy and Kate then return home with Gizmo."}