{"mid": "Greta", "IMDB_id": "tt1059925", "title": "Greta", "plot": "Greta (Hilary Duff) is seventeen, a bright and beautiful young woman. However, she is also rebellious as a consequence of her turbulent home life. Pushed aside by her mother, Karen (Melissa Leo), who is on her third marriage, Greta is shipped off to her grandparents for the summer. She is not happy about it and neither are her grandparents. She tells them that she fully intends to kill herself before the summer is over and compiles a notebook of suicide methods.\nGreta's sarcastic attitude results in her being offered a job as a waitress at a local seafood restaurant. While working there, her odd sense of humour makes her attractive to many customers. Greta falls for a charismatic short-order cook named Julie (Evan Ross). When he reveals to her that he was once incarcerated in a juvenile correctional facility for stealing cars, Greta is even more attracted to him. Julie tells her that his experience made him determined to do something positive with his life and he attempts to convince Greta to not give up on hers. He is alarmed when he sees Greta's 'suicide list.'\nAlthough Greta's grandparents Katherine (Ellen Burstyn) and Joseph (Michael Murphy) are initially concerned about her boyfriend's criminal past, Julie proves himself worthy of their trust and demonstrates that he truly does care for Greta. Joseph tells him about Greta's father, who committed suicide in front of Greta when she was very young. Julie also demonstrates his respect for Greta when she attempts to lose her virginity to him. He tells her he will not be one of the thing she checks off of her 'To Do List' and that it has to be another time.\nThe police come as a result of neighbors having seen Julie come in through the upper story window. At first the grandparents are upset with Julie for being there. Greta is called inside to talk with them and she explains to her grandparents he was there at her request. The grandfather goes outside and squares things with the police. Julie then explains to the grandparents that he sincerely cares for Greta.\nWhile the four are out sailing in Joseph's boat, Greta tries to drown herself. When Julie rescues her, the fright causes Katherine to have a mild heart attack. Katherine is given a positive prognosis by a doctor and she and her husband stay the night at the local hospital. Julie is mad at Greta, telling her that she should appreciate the life she has. The near catastrophe gives Greta a wake-up call and shows her how deeply her own actions affect those around her.\nOnce Katherine gets back from the hospital, Greta is determined to show her how sorry she is. Katherine, however, is still furious at her, telling Greta she does not even know what she is sorry about. She and Greta have a heart to heart conversation, although they are interrupted by Greta's mother, Karen, and her current husband, who have come to take Greta to a summer boot camp. The grandparents are shocked at Karen's abrasive behaviour.\nGreta runs away to talk to Julie who tells her that she is indeed, very messed up, but a boot camp will never help her if she doesn't want to help herself. Julie's advice calms Greta and she returns to the house to find her mother has already packed up her things. Joseph arrives and interrupts them all telling Karen that Greta does not need a boot camp, she needs love, and that both Greta and Karen will be staying with them.\nThe three women bond looking at old pictures and the film ends with Greta leaving her suicide notebook in the ocean and in a voice over (letter to her mom) thanking her for letting her stay for the rest of the summer with her grandparents."}