{"mid": "Grizzly", "IMDB_id": "tt0074593", "title": "Grizzly", "plot": "The film opens with military veteran helicopter pilot and guide Don Stober (Prine) flying individuals above the trees of a vast national park. He states that the woods are untouched and remain much as they did during the time when Native Americans lived there.\nTwo female hikers are breaking camp when they are suddenly attacked and killed by an unseen animal. The national park's chief ranger, Michael Kelly (George), and photographer Allison Corwin (Joan McCall), daughter of the park's restaurant owner, decide to follow a ranger to the primitive campsite to check on the female hikers. There, they discover the mangled corpses of the two girls, one of which has been partially buried.\nAt the hospital, a doctor tells Kelly that the girls were killed by a bear. The park supervisor, Charley Kittridge (Joe Dorsey), blames Kelly for the attacks, saying that the bears were supposed to have been moved from the park by Kelly and naturalist Arthur Scott (Jaeckel) before the tourist season began. Kelly and Kittridge argue over closing the park, before deciding to move all hikers off the park's mountain while allowing campers to remain in the lowlands. Kelly calls Scott, who tells him that all of the bears are accounted for and this specific bear must be unknown to the forest.\nDuring a search of the mountain, a female ranger stops for a break at a waterfall. Deciding to soak her feet, she is unaware that the bear is lurking under the falls, and she is attacked and killed. Kelly recruits the helicopter pilot, Stober, to assist in the search. Flying above the forest, they see what they believe to be an animal, only to discover the naturalist Scott adorned in an animal skin while tracking the bear. He informs them that the animal they are looking for is a prehistoric grizzly bear (a fictional Pleistocene-era Arctodus ursos horribilis) standing at least 15 feet tall. Kelly and Stober scoff at the notion.\nAt the busy lowland campground, the grizzly tears down a tent and kills a woman. Kelly once again insists on closing the park, but Kittridge refuses. The attacks are becoming a national news story, and to counteract this, Kittridge allows amateur hunters into the forest. Kelly, Stober, and Scott, now a team, are disgusted by this development. Later, a lone hunter is chased by the bear, but he manages to escape the animal by jumping into a river and floating to safety. Later that night, three hunters find a bear cub that they believe is the cub of the killer grizzly, so they use it as bait for the mother. However, the grizzly finds and eats the cub without the hunters noticing. Scott concludes that the bear must be a male, as when it comes to bears, only the males are known to be cannibalistic. A ranger at a fire lookout tower on the mountain is attacked by the grizzly, the animal tearing down the structure and killing the ranger.\nKelly and Kittridge continue to argue over closing the park. Frustrated by the politics of the situation, Scott sneaks away to track the grizzly on his own. On the outskirts of the national park, a mother and her young child are attacked by the grizzly. The mother is killed, while the child survives, albeit severely mutilated. Stunned by this development, Kittridge finally allows Kelly to close the park and ban all hunters.\nStober and Kelly now go after the elusive grizzly alone, setting up a trap by hanging a deer carcass from a tree. The grizzly goes for the bait, but suddenly retreats. The men chase the animal through the woods, but it easily outruns them. When they return, they discover the grizzly has tricked them and taken the deer carcass. Scott, tracking on horseback, finds the remains of the carcass and calls Stober and Kelly on the radio. He is going to drag the deer behind his horse and create a trap by leading the grizzly towards them. However, the grizzly ambushes Scott, killing his horse and knocking him unconscious. He subsequently awakens to find himself alive but half-buried in the ground. Before he can dig himself out, the grizzly returns and immediately kills him.\nKelly and Stober discover Scott's mutilated body and, in despair, return to the helicopter to track the grizzly from the air. They soon spot the bear in a clearing and quickly land. The grizzly attacks the helicopter, swiping the craft and causing Stober to be thrown clear. The grizzly kills Stober before turning on Kelly, who frantically pulls a bazooka from the helicopter. Before the bear can reach him, Kelly fires the bazooka at the grizzly, killing the animal instantly. For several seconds, Kelly sadly stares at the burning remains of the grizzly, before walking towards Stober's body."}