{"mid": "GrossePointeBlank", "IMDB_id": "tt0119229", "title": "Grosse Pointe Blank", "plot": "Professional assassin Martin Blank finds himself depressed and bored with his work. A major problem is his chief rival Grocer, whose effort to incorporate the hitman business puts him at potentially lethal odds as he is unaffiliated. Following a botched contract, Martin receives an invitation to his 10-year high school reunion in his hometown of Grosse Pointe, Michigan. Initially reluctant to attend, he is pressured into it by both his therapist, Dr. Oatman, and his secretary, Marcella. She books him a contract in Michigan that coincides with the reunion, ostensibly to make amends with the client whose contract was botched.\nUpon arriving in Grosse Pointe, Martin reconnects with his childhood friend Paul and his high school sweetheart Debi Newberry, now a radio DJ, whom Martin had abandoned on prom night to enlist in the army. He also visits his mentally-ill mother in a retirement home, and his father's gravestone (who is implied to had been an abusive alcoholic). Meanwhile, Martin is being stalked by Felix LaPoubelle, another hitman who attempts to kill Martin in the convenience store built over his childhood home. He is also shadowed by two NSA agents who were tipped off to Martin's contract by Grocer. Despite these dangers, Martin remains distracted by his desire to woo Debi and fails to open the dossier on his prospective target.\nAt the reunion, Martin and Debi mingle with their former classmates, and begin to rekindle their relationship. Later, while exploring the halls alone, Martin is attacked again by LaPoubelle, whom he kills in self-defense. Debi stumbles upon the scene and flees the reunion in horror. Paul arrives soon after, and helps Martin dispose of LaPoubelle's body in the school furnace.\nDebi later confronts Martin in his hotel room; he reveals that when he joined the army, his psyche profile made him suitable to work as an assassin for the CIA, after which he decided to go freelance. His rationalizations for his work scares Debi even further; she rejects his attempts at reconciliation and storms out. Martin fires his therapist over the phone, lays off Marcella (but directs her to a brick of cash hidden in the office, set aside for her severance pay), and finally opens the dossier detailing the contract that brought him to Grosse Pointe. He is startled to find that the target is Debi's father, Bart, who is scheduled to testify against Martin's client.\nGrocer decides to kill Bart himself to impress Martin's client. Martin abandons the contract and rescues Bart, driving him to the Newberry house and holing up inside, narrowly ahead of Grocer and his mercenaries. During the siege, Martin finally reveals that he stood Debi up on prom night to protect her from his homicidal urges, which were due to his troubled upbringing. Martin gradually kills off the mercenaries, and the NSA agents are gunned down by both Grocer and Martin. Martin kills Grocer by smashing a television over his head. Injured and winded, Martin proposes marriage to Debi, who (shell-shocked from the day's events) does not respond. In the end, Debi and Martin leave Grosse Pointe together."}