{"mid": "GrumpierOldMen", "IMDB_id": "tt0113228", "title": "Grumpier Old Men", "plot": "The feud between Max (Walter Matthau) and John (Jack Lemmon) has cooled and both of them patch things up, and their children, Melanie (Daryl Hannah) and Jacob (Kevin Pollak), have become engaged. Meanwhile, John is enjoying his marriage to new wife Ariel (Ann-Margret).\nThe spring and summer fishing season is in full swing with the annual quest to catch \"Catfish Hunter,\" a rather large catfish. However, the local bait shop closed after Chuck, the previous owner died, and Maria Ragetti (Sophia Loren) has purchased the property with the intent of converting it into a fancy Italian restaurant.\nIrritated it will no longer be a bait shop, Max and John join forces to sabotage the restaurant. They are successful at first with their practical jokes. However, when Ariel learns what is going on, she tells John to apologize to Maria at once. He eventually does, but falls asleep at the restaurant after drinking grappa. Max and Maria begin dating due to their shared passion in fishing, while her mother Francesca (Ann Morgan Guilbert) dates John's father (Burgess Meredith).\nTo complicate things further, Jacob and Melanie call off their engagement due to stress from their parents' involvement. Upon hearing the news, John and Max reignite their feud. Ariel is stressed out because of it and leaves John.\nAt the restaurant, Francesca is worried about all the time Maria spends with Max. She reminds her daughter of her five failed marriages and worries that Max will make it six. After being convinced to take a long look at herself, Maria reluctantly stops seeing him.\nDistraught over losing Ariel, John heads to the lake for his father's advice, but finds him dead. Following the funeral, John and Max call off their feud again and John and Ariel reconcile. After realizing that their own inability to properly plan a wedding is what drove their kids to call it off, they decide to set it right. They help Jacob and Melanie reconcile (the couple later elopes), and manage to catch \"Catfish Hunter\" and release it, then clarify their own drama. Max marries Maria, and on the way to their honeymoon, discover Max's one-eyed bulldog, Lucky, in the car with them. Ragetti's is reformed so it will also be a bait shop."}