{"mid": "GuestHouseParadiso", "IMDB_id": "tt0202381", "title": "Guest House Paradiso", "plot": "Richard \"Richie\" Richard (Mr Twat/Thwaite) and Edward \"Eddie\" Elizabeth Ndingombaba Hitler (Rik Mayall and Adrian Edmondson) run the worst guest house in the United Kingdom (\"You're not in any of the guidebooks. Nobody for miles around - an oasis of calm. Even the peasants in the village denied its existence.\"), neighbouring a poorly maintained nuclear power station. The chef is not only unable to cook, but is both an idiotic drunkard and an illegal immigrant and eventually leaves due to not being paid and worse of it the waiter is not to be seen as Richie believe that he's in the hospital (\"Have you seen Pascal? Oh, damn. I'll have to phone the psychiatric hospital, he's probably checked himself in again!\") but obviously not being paid too or insulted by his boss. The guests (one of them played by Bill Nighy) are thoroughly dissatisfied by the poor service, and all decide to leave, except for one \"Mrs Foxfur\" (Fenella Fielding) who lives there.\nLife seems bleak for Eddie and Richie, but things seemingly improve with the arrival of the \"Nice family\", with Simon Pegg playing the father. Furthermore, the famous Italian actress \"Gina Carbonara\" (Hélène Mahieu) comes to stay in the grotty house while seeking safety from her ill-tempered fiancé Gino Bolognese (Vincent Cassel). However Gino does eventually find her at the guest house as Eddie and Richard had put her name up in lights outside in order to attract more guests. Later, Richie finds some fish, which fell off a military lorry heading away from the nuclear power station. Richie and Eddie don't realise that the fish had been contaminated by a radiation leak until after they've fed them to the guests.\nHours later, with everybody violently ill from the radioactive fish, the guests are all projectile vomiting at high velocity and in huge quantities — all except for Gina Carbonara, apparently the only guest who did not eat the fish. In an act of spontaneous solidarity (given that no other guests have had any contact with Gino), every guest projectile vomits on him at once, forcing him backwards, out through a window and off a cliff edge into the ocean. Government agents arrive to hush up the incident and give Eddie and Richie ten million pounds, first class tickets to the Caribbean and new identities for both the duo and Gina in exchange for their silence over the leak. The three accept the offer, and head to the Caribbean. In the film's final scene, Eddie winks to the camera after commenting \"How lucky he was the only fatality. Otherwise there'd be a moral question mark hanging over our escape.\""}