{"mid": "Gummo", "IMDB_id": "tt0119237", "title": "Gummo", "plot": "A grainy voiced narrator (Solomon) recounts the events of the tornado while disturbing home-movie images play — mostly of the town's people. A mute adolescent boy, known as Bunny Boy, wears only pink bunny ears, shorts, and tennis shoes on an overpass in the rain.\nA cat is carried by the scruff of its neck by Tummler, a teenage boy. He drowns the cat in a barrel of water. The film then cuts to a different scene with Tummler, in a wrecked car with a girl. They fondle each other, and Tummler realizes there is a lump in one of the girl's breasts.\nTummler and Solomon then ride down a hill on bikes. The narrator introduces Tummler as a boy with \"a marvelous persona\", whom some people call \"downright evil\". Later, Tummler aims an air rifle at a cat. His friend Solomon stops him from killing the cat, protesting that it is a house cat. They leave and the camera follows the cat to its owners' house. The cat is owned by three sisters, two of whom are teenagers and one who is pre-pubescent.\nThe film cuts back to Tummler and Solomon, who are hunting feral cats. They bring the cats to a local grocer, who intends to butcher and sell them to a local restaurant, and the grocer tells them that they have a rival in the cat killing business. They then buy glue from the grocer, which they use to get high via huffing.\nThe film then cuts to a scene in which two foul-mouthed young boys dressed as cowboys destroy things in a junkyard. Bunny Boy arrives and the other boys shoot him \"dead\" with cap guns. Bunny Boy plays dead and the boys curse at him, rifle through his pockets, then remove and throw one of his shoes. They grow bored of this and leave him sprawled on the ground.\nTummler and Solomon track down a local boy who is poaching \"their\" cats. The poacher, named Jarrod Wiggley, is poisoning the cats rather than shooting them. When Tummler and Solomon break into Jarrod's house with masks and weapons with intent to hurt him, they find photos of the young teen in drag and his elderly grandmother, who is catatonic and attached to life support machinery. The poacher Jarrod is forced to care for her, which he had earlier opined was \"disgusting\". Seeing that Jarrod isn't home, Tummler and Solomon decide to leave. Tummler then discovers the grandmother lying in her bed, states that it is \"no way to live,\" and turns off the life support machine.\nA number of other scenes are interspersed throughout the film, including: an intoxicated man (played by Harmony Korine) flirting with a gay dwarf; a man pimping his Down syndrome afflicted sister to Solomon and Tummler; the sisters encountering an elderly child molester; a pair of twin boys selling candy door-to-door; a brief conversation with a tennis player who is treating his ADD; a long scene of Solomon eating breakfast while taking a bath in dirty water; a drunken party with arm- and chair-wrestling; and two skinhead brothers boxing each other in their kitchen. There are also a number of even smaller scenes depicting Satanic rituals, footage seemingly from home movies, and conversations containing racial bigotry.\nThe next scene in the movie is set to the song \"Crying\" by Roy Orbison, which had been previously mentioned by Tummler as the song his older brother,who was a transsexual, would sing (the brother eventually went to the \"Big City\" and abandoned him). The final scene involves Solomon and Tummler shooting the sisters' cat repeatedly with their air rifles in the rain with jump cuts to Bunny Boy kissing the teenage girls in a swimming pool. Bunny Boy runs towards the camera through a field holding the body of the dead cat, which he shows to the audience, breaking fourth wall.\nThe final scene shows a girl, who shaved her eyebrows earlier in the movie, singing \"Jesus Loves Me\" in front of her parents in bed. The film finally cuts to black as they tell her to go to bed."}