{"mid": "GunfightAtTheOkCorral", "IMDB_id": "tt0050468", "title": "Gunfight at the O.K. Corral", "plot": "In Fort Griffin, Texas, Ed Bailey (Lee Van Cleef) comes looking to avenge the death of his brother at the hands of gunslinger John H. \"Doc\" Holliday (Kirk Douglas). Seeing him in a bar, Holliday's girl, Kate Fisher (Jo Van Fleet), returns to Holliday's room, where the two argue—while Holliday throws knives at the wall—once she brings up Holliday's once-prominent family. At the same time, well-known marshal Wyatt Earp (Burt Lancaster) arrives in Fort Griffin thinking he will take outlaws Ike Clanton (Lyle Bettger) and Johnny Ringo (John Ireland) into custody, but instead finds out that the local sheriff, Cotton Wilson (Frank Faylen), released them despite the outstanding warrants for their arrest. Holliday refuses to help the lawman, holding a grudge against Wyatt's brother, Morgan. Holliday kills Bailey with a knife-throw when Bailey attempts to shoot him in the back. Holliday is arrested for murder, though Wyatt and Kate allow him to escape from a lynch mob.\nIn Dodge City, Kansas, Wyatt finds out that Holliday and Kate are in town. Holliday tells him he has no money, so Wyatt allows him to stay if he promises to not fight while he is in town. Meanwhile, gorgeous gambler Laura Denbow (Rhonda Fleming) is arrested for playing cards since women are not allowed to gamble. She is released and allowed to play in the side rooms of the saloon. Wyatt is forced to deputize Holliday because a bank robber kills a cashier and Wyatt's other deputies are out in a posse catching another outlaw. The bank robbers attempt to ambush Wyatt outside of town, but are instead killed by Wyatt and Holliday.\nBack in Dodge City, Holliday learns Kate has left him for Ringo, who taunts Holliday to a shootout and throws liquor on him. Holliday steadfastly refuses to fight him. Shanghai Pierce (Ted de Corsia) and his henchmen ride into town, wound deputy Charlie Bassett (Earl Holliman) and attack a dancehall, but Wyatt and Holliday hold the men and defuse the situation. As Ringo attempts to intervene, Holliday shoots him in the arm. Holliday returns to his room and Kate is waiting for him, but he refuses to take her back. She swears she will see him dead. By now, Wyatt and Laura have fallen in love, but when he receives a letter from his brother, Virgil, asking him to come clean up Tombstone, Arizona, she refuses to go with him unless he changes. Holliday catches up to Wyatt on the trail and both head to Tombstone.\nIn Tombstone, Wyatt finds out that Ike Clanton is trying to herd thousands of head of Mexican cattle but cannot as long as the Earps control Tombstone's railway station. Morgan Earp (DeForest Kelley) criticizes his brother's association with Holliday, but Wyatt insists the gunslinger is welcome in Tombstone as long as he stays out of trouble. Cotton, the cowardly county sheriff from Fort Griffin, offers Wyatt a $20,000 bribe (about $496,000 today) if he allows the stolen cattle to be shipped, but Wyatt refuses. He rides out to the Clanton ranch, returning young Billy Clanton (Dennis Hopper) to his mother after finding Billy drunk. Wyatt informs Ike that he has been made a U.S. Marshal and has legal authority in every county in the United States. Finding no recourse, the Clantons decide to ambush Wyatt as he makes his nightly rounds, but kill his younger brother James Earp (Martin Milner) by mistake.\nThe next morning, Ike and five of his henchman go to Tombstone to face off against the Earps at the O.K. Corral. Holliday, who is sick from tuberculosis, joins them. Though Virgil and Morgan are wounded in the gunfight, all six in Clanton's gang are killed, including Billy, who is given a chance to surrender but refuses. After the fight is over, Wyatt joins Holliday for a final drink before heading off to California to meet Laura, as promised."}