{"mid": "Gunmen", "IMDB_id": "tt0109959", "title": "Gunmen", "plot": "Wheelchair-bound drug baron Peter Loomis (Patrick Stewart) has his $400 million drug fortune stolen in South America by his errand boy Carlos, who stashed the fortune on an undisclosed boat in an undisclosed harbor. Loomis sends ruthless killer Armor O'Malley (Denis Leary) to find the boat and recover the money—he and sidekick Marie (Brenda Bakke) kill Carlos before they can get the name and location of the boat, but they learn that Carlos's brother Dani (Christopher Lambert) knows where it is, and set out to find him.\nDani is sprung from a South American prison by Cole Parker (Mario Van Peebles), a bounty hunter working for the DEA who is bent on taking down Loomis—Cole knows the name of the boat, Dani knows the location, and both men want the money for their own reasons. Complicating matters is a mole in the DEA who feeds intel to O'Malley about the heroes' movements. Alone and outnumbered, Cole and Dani are forced into a reluctant alliance as they quest for the 400 million dollar boat, with O'Malley and his men chasing them every step of the way.\nLoomis quickly realizes that O'Malley wants the fortune for himself and tries to have him and his men assassinated, but the attempt fails. O'Malley returns to Loomis's estate and makes it clear that he now wears the pants in their relationship: without the $400 million, Loomis can't pay his soldiers, and O'Malley will get his hands on the money before the stay-at-home cripple does. Loomis is killed and O'Malley renews the chase with a small army at his disposal.\nAfter numerous betrayals on both sides of the conflict, the chase ends at a Puerto Vallarta harbor, and a yacht called the \"Matador\" according to Cole. Dani and Cole shoot it out with O'Malley's soldiers and leave the boat a flaming wreck (and Dani beside himself at the loss of the money). But Cole reveals he lied about the boat name to mislead and eliminate O'Malley: the fortune was actually stashed on a rickety old fishing boat called the \"Gunmen.\" The heroes agree to split the money and sail into the sunset."}