{"mid": "GuysAndDolls", "IMDB_id": "tt0048140", "title": "Guys and Dolls", "plot": "=== Act I ===\nA pantomime of never-ceasing activities depicts the hustle and bustle of New York City (\"Runyonland\"). Three small-time gamblers, Nicely-Nicely Johnson, Benny Southstreet, and Rusty Charlie, argue over which horse will win a big race (\"Fugue for Tinhorns\"). The band members of the Save-a-Soul Mission, led by the pious and beautiful Sergeant Sarah Brown, call for sinners to \"Follow the Fold\" and repent. Nicely and Benny's employer, Nathan Detroit, runs an illegal floating crap game. Due to local policeman Lt. Brannigan's strong-armed police activity, he has found only one likely spot to hold the game: the \"Biltmore garage.\" However, the owner, Joey Biltmore, requires a $1,000 security deposit, and Nathan is broke (\"The Oldest Established\"). Nathan hopes to get $1,000 by winning a bet against Sky Masterson, a gambler willing to bet on virtually anything. Nathan proposes a bet which he believes he cannot lose: Sky must take a doll (a woman) of Nathan's choice to dinner in Havana, Cuba. Sky agrees, and Nathan chooses Sarah Brown. At the mission, Sky claims he wants to be saved, impressing Sarah with his knowledge of the Bible. He offers Sarah a deal: He will bring the mission \"one dozen genuine sinners\" if she will accompany him to Havana the next night. Sarah rebuffs him, telling him that she plans to fall in love with an upright, moral man. Sky replies that he plans on being surprised when he falls in love (\"I'll Know\"). Sky kisses Sarah, and she slaps him. Nathan goes to watch his fiancée of 14 years, Miss Adelaide, perform her nightclub act (\"A Bushel and a Peck\"). After her show, she asks him, as she has many times before, to go down to city hall and get a marriage license. She is distraught to find out that Nathan is still running the crap game. She consults a medical book, which tells her that her chronic cold is a psychosomatic reaction to her frustration with Nathan's failure to marry her (\"Adelaide's Lament\").\nThe next day, Nicely and Benny watch as Sky pursues Sarah, and Nathan tries to win back Adelaide's favor. They declare that guys will do anything for the dolls they love (\"Guys and Dolls\"). General Cartwright, the leader of the Save-a-Soul organization, visits the mission and explains that she will be forced to close the branch unless they succeed in bringing some sinners to the upcoming revival meeting. Sarah, desperate to save the mission, promises the General \"one dozen genuine sinners\", implicitly accepting Sky's deal. The gamblers, including a notorious gangster from Chicago named Big Jule, are waiting for Nathan to secure the spot for the game and Lt. Brannigan becomes suspicious. To convince him of their innocence, they tell Brannigan their gathering is Nathan's \"surprise bachelor party\". This satisfies Brannigan, and Nathan resigns himself to eloping with Adelaide. Adelaide goes home to pack, promising to meet him after her show the next afternoon. The Save-A-Soul Mission band passes by, and Nathan sees that Sarah is not in it; he realizes that he lost the bet and faints.\nIn a Havana nightclub, Sky buys a drink for himself and a \"Cuban milkshake\" for Sarah. She doesn't realize that the drink contains Bacardi rum, and she innocently drinks multiple glasses, becoming progressively tipsier. Outside the club, Sarah kisses Sky and proclaims that she is truly enjoying herself for the first time in her life (\"If I Were a Bell\"). She wants to stay in Havana with Sky. Sky is surprised to find, though, that he truly cares about Sarah's welfare, and he insists that they go back to the airport and return to New York. Back in New York, it is 4:00 a.m., and as Sky and Sarah (now sober) stand in the street outside the mission, Sky explains that this is his favorite time of day, and Sarah is the only woman he's ever wanted to share it with him (\"My Time of Day\"). They both spontaneously admit that they're in love (\"I've Never Been in Love Before\"). A siren rings out and gamblers run out of the mission, where Nathan has been holding the crap game. Sarah assumes that Sky took her to Havana and pretended to be in love with her just so Nathan could use the mission for the game, rejecting his protests of innocence.\n=== Act II ===\nThe next evening, Adelaide performs her act at the Hot Box (\"Take Back Your Mink\"). Nathan doesn't show up for the elopement because he's still running the crap game. She soon realizes that Nathan has stood her up again and turns to her book for comfort (\"Adelaide's Second Lament\").\nSarah admits to Arvide Abernathy, who is her grandfather and fellow mission worker, that she loves Sky but will never see him again because she believes he is responsible for the previous night's crap game. Abernathy expresses his faith in Sky's inherent goodness and urges Sarah to follow her heart (\"More I Cannot Wish You\"). Sky tells Sarah he intends to deliver the dozen genuine sinners for the revival. She doesn't believe him and walks off, but Arvide subtly encourages him.\nNicely shows Sky where the game is being held: the sewer (\"Crapshooters Dance\"). Big Jule has lost a large amount of cash and insists on playing on credit. To change his luck he uses his own dice which are blank and proceeds to cheat Nathan out of all of his money. Sky then arrives with Nicely. Big Jule isn't impressed in the slightest but Sky responds by punching him out. He then gives Nathan $1,000, saying that Nathan won the bet and implying that Sarah refused to go to Havana with him. Sky, determined to get the dozen sinners he promised Sarah, bets every man at the game a thousand dollars against their souls. If he loses, everyone gets a thousand dollars each, but if he wins, they must all attend the revival at the mission (\"Luck Be a Lady\"). He tosses the dice. The gamblers head towards the mission, and it is clear that Sky has won his bet. On his way there, Nathan runs into Adelaide and tells her that he has to attend the prayer meeting. Adelaide does not believe him. She asks herself why she keeps putting up with Nathan's lies, and he tells her that he loves her (\"Sue Me\").\nSky and the gamblers arrive at the mission, much to Sarah's surprise. General Cartwright asks if anyone wishes to give testimony to their sins. Benny and Big Jule testify but another gambler named Harry The Horse lets slip that Sky only got them to the meeting because he won their souls in a dice game. The General is very pleased by this as it shows that good can come out of evil. Attempting to appear contrite, Nicely invents a dream which encouraged him to repent, and the gamblers join in with revivalist fervor (\"Sit Down, You're Rockin' the Boat\"). Brannigan arrives and threatens to arrest everyone for the crap game in the Mission, but Sarah clears them, saying that none of the gamblers were at the mission the previous night. After Brannigan leaves, Nathan gives testimony and confesses that they held the crap game in the mission. He also confesses the bet he made with Sky about taking Sarah to Havana. He adds that he won the bet, to Sarah's shock, and she realizes that Sky wanted to protect her reputation and must genuinely care about her.\nSarah and Adelaide run into each other, and they commiserate and then resolve to marry their men anyway and reform them later (\"Marry the Man Today\"). Several weeks later, Nathan has opened a newsstand. Sky and Sarah have just been married, and Sky is playing the drum in the mission band. Adelaide and Nathan are about to get married at the mission, and Sky tells Nathan he'll lay eight to ten odds that he will be very happy. The title song is reprised (\"Guys and Dolls\" (Finale/Reprise)."}