{"mid": "GuyverDarkHero", "IMDB_id": "tt0109965", "title": "Guyver: Dark Hero", "plot": "One year after bonding with the Guyver unit and destroying the Cronos Corporation, the company responsible for the Guyver and the creatures called the Zoanoids, in Los Angeles, Sean Barker has been using his powers to fight crime. Unfortunately, the Guyver unit’s desire to kill has left Sean emotionally exhausted. Learning of cave drawings discovered in the mountains of Utah that resemble the images he has been seeing in his dreams, Sean makes his way to the archeological dig taking place there. Along the way, Sean encounters Cori Edwards, daughter of Marcus Edwards, the lead archeologist at the archaeological site.\nArriving at the archeological site, Sean discovers a skull resembling Lisker, a Zoanoid that he fought a year ago. Later that night, Sean battles another Zoanoid, called Volker, which has been terrorizing the mountains of Utah. Their battle is cut short by the arrival of Cori and her team which lets Volker escape. Sean is questioned by a suspicious Commander Atkins, revealing that the Guyver only destroyed the Los Angeles branch of the Cronos Corporation and that another branch of Cronos is behind the Zoanoid attacks in the mountains of Utah.\nThe very next day, the team of archaeologists unearths an extraterrestrial ship. After several unsuccessful attempts to breach it, the ship mysteriously opens up a hatch for the archaeologists to enter. Inside, Sean communicates with the ship and demands that it removes the Guyver unit from within him. Meanwhile, Cori discovers another Guyver unit that has been damaged, but Arlen Crane confiscates it from her. Attempting to confront Crane, Cori instead learns that Arlen Crane actually works for the Cronos Corporation and plans to terminate all non-Cronos personnel at the site. Cori is captured by Volker eavesdropping and is escorted in a jeep. The jeep is attacked by Marcus, revealed to be a Zoanoid, who battles both Monk and Volker Zoanoids but is eventually overwhelmed. At the camp, Crane reveals himself to be a Zoanoid to Sean who rejects his offer of an alliance to activate the ship and turn himself and the Zoanoids back to normal. Crane has his chief of security, Brandi, sedate and bind Sean. Atkins frees Sean who rushes to save Cori as the Guyver. After killing both Monk and Volker Zoanoids, the Guyver spares Marcus and reveals his identity to Cori.\nAt the camp, Atkins and his commandos prevent Crane from executing the archaeological team and safely evacuate them. However, Atkins is captured and his commandos brutally murdered when one of the Zoanoids manages to escape.\nSean reveals to Cori that he plans to destroy the ship. Whilst Sean communicates with the ship, seeing images of prehistoric times with the creation of Zoanoids and the Guyver units, Cori plants dynamites in the dig site but is captured by Crane and his Zoanoids. With Cori as a hostage, Crane demands Sean to deactivate the Guyver unit and surrender. Marcus intervenes and a battle ensues: Marcus battles Crane but is killed in the process, Atkins manage to kill Brandi, a Zoanoid as well, after electrocuting her and finally shooting her dead. Sean kills the Corben and Stenzoanoids Zoanoids before confronting Crane. Crane reveals that he merged with the second Guyver unit and transforms into a Guyver Zoanoid. Faster and stronger, Crane overwhelms Sean, stabbing him in the chest but Cori shoots Crane’s Control Metal. Sean removes the damaged Control Metal which causes the Guyver suit to begin consuming Crane. Sean uses his Mega Smasher to put Crane out of his misery.\nFollowing the events, Sean reveals to Cori that the Guyvers were a failed experiment: in prehistoric times, aliens had attempted to turn primitive humans into Guyvers to fight their wars, but the humans rebelled, forcing the aliens to leave earth. Using his Control Metal, Sean instructs the ship to return to its home planet. With the battle won, Atkins attempts to recruit Sean to aid the government in fighting an underground war against the Cronos Corporation, but Sean drives off with Cori instead."}