{"mid": "HacksawRidge", "IMDB_id": "tt2119532", "title": "Hacksaw Ridge", "plot": "The film starts with very VERY graphic, visceral images of warfare. Soldiers are blown apart, burnt alive, and getting shot to pieces. The voice of Desmond T. Doss (Andrew Garfield) speaks about how God will not grow tired or weary of his children, no matter how bad things are. We see Desmond being carried away on a stretcher as another soldier tells him everything will be fine.16 years earlier, Desmond (here played by Darcy Bryce) and his brother Hal (Roman Guerreiro) are running through the woods playfully. They live with their mother Bertha (Rachel Griffiths) and their father Tom (Hugo Weaving), a former soldier and veteran of World War I who is haunted by his past in the war who now drinks heavily and often beats his sons. The whole family are Seventh-Day Adventists. One afternoon, the boys are fighting in front of the house. Desmond picks up a large brick and whacks Hal over the face, knocking him unconscious. As their parents frantically try to aid Hal, Desmond feels nothing but utter remorse. He looks at an illustration of the Ten Commandments with guilt as Tom goes to whip him with his belt, until Bertha stops him because it won't teach Desmond anything. She reassures her son that Hal will be okay.15 years later, Desmond is working in the church as his mother is singing with her group. They near a loud noise from outside and see a young man who had a car part fall on his leg as he was working on it. The part severed an artery, causing blood to gush out of his leg. Desmond uses his belt as a tourniquet. When they take the boy to the hospital, Desmond first sees a nurse named Dorothy Schutte (Teresa Palmer). She is there to take blood from donors, and Desmond offers to donate so he can continue talking to her.Desmond and Dorothy later go on a date to the movies. After the show, the two are walking when Dorothy almost walks into the path of a car. Desmond pulls her aside and stuns her with a kiss. She slaps him because she wasn't expecting it. She walks away, leaving Desmond in disbelief. Dorothy then asks if he will join her. He starts walking and almost gets hit by a car too.Tom and Bertha become displeased when Hal (now played by Nathaniel Buzolic) has signed up to fight in World War II. He stands his ground and insists he's doing it for the right reasons.Desmond takes Dorothy out for a hike. This time, she lets him kiss her, and they quickly fall in love. Desmond even learns a few things about medicine from Dorothy. However, when Desmond informs her that he has enlisted in the Army, Dorothy becomes upset. She asks if he will ask her to marry her. He asks her on the spot, and she accepts.Desmond finds his father at a cemetery standing by the graves of his friends that he lost fighting in war. Tom worries that the same fate will befall his sons.Desmond says his farewell to Dorothy as he heads off for training. When he gets to the camp, he encounters several noteworthy characters, including Hollywood Zane (Luke Pegler), who is doing pull-ups in the nude, plus Smitty Riker (Luke Bracey), who is throwing knives at another soldier's foot. Sergeant Howell (Vince Vaughn) shows up. Smitty ends up with a knife in his foot as they run to line up. Howell goes around berating the other soldiers as he meets them before they proceed to training.The men begin their training through the obstacle course. When it comes time to handle rifles, Desmond states that he does not wish to use weapons as he is simply trying to be a medic, and he also chooses not to train on Saturdays as that is his Sabbath. Howell brings Desmond to Captain Jack Glover (Sam Worthington), who orders Desmond to do what they say as long as he is on the field.Howell and several other soldiers make Desmond's time there a living hell. When Desmond cannot get discharged, Howell turns the soldiers on him as they make Desmond to look like a coward for being a conscientious objector. Smitty tries to provoke Desmond by taking his bible and a picture of Dorothy, but Desmond never budges. Some of the soldiers beat Desmond in his bed at night. When Howell asks him to point out his attackers, Desmond refuses and he carries on with training.When the squad is to be released from training, Desmond is detained and incarcerated for insubordination. To make matters worse, it is his wedding day to Dorothy. He is put in a cell and is forced to miss his wedding. Dorothy visits him and questions whether he is mistaking his own will with the will of God.Desmond is put on trial. Tom puts on his old uniform and speaks to his former captain about his son's predicament. He shows up to the courthouse with a paper from the captain that states that Desmond's right to follow his beliefs and refusal to carry a weapon is protected by the Constitution. Desmond is thus let go, allowed to continue his work in the field, and immediately marries Dorothy. They later consummate.Desmond joins the squad as they head on to the 1945 Battle of Okinawa. They climb up the Maeda Escarpment, which is better known as Hacksaw Ridge. Once at the top, the soldiers quietly move forward across a field of dead soldiers. The Japanese soldiers begin firing, leading to a brutal and bloody battle. In the midst of the chaos, countless men are blown to smithereens. Desmond tends to his fellow soldiers on the field, administering morphine to the wounded while trying to get them down the cliff to safety.At night, the squad sets up camp. Desmond and Smitty are in a foxhole, getting to know each other better. Smitty acknowledges that he's been an asshole to Desmond. Desmond recounts to him how his father would abuse him and his brother, but when he went after their mother, Desmond held Tom back as he held a gun. He took the gun away from Tom and pointed it at him, ready to shoot until Bertha stopped them. Desmond talks about how he came close to killing his father. Smitty apologizes to Desmond for how he was before.The next day, the Japanese strike back with heavy force, delivering grenades and bullets everywhere. The American squad is forced to make their way down the cliff. Desmond tries to save those who he can, but while he tries to save Smitty, he is mortally wounded and dies. Desmond continues to aid the soldiers and keep them secured as the Japanese soldiers go killing any surviving members of the squad. At one point, he must run through a tunnel and avoid the Japanese, but he even tends to a lone wounded soldier. Desmond eventually rescues Howell and brings him to the base. The other men are stunned to know that Desmond has saved a large number of soldiers.Captain Glover apologizes to Desmond for having doubts in him. He informs him that the next attack falls on the Sabbath day, but they will not proceed without him. Desmond joins them anyway after praying for his men.The squad runs into a group of men that have falsely surrendered, bringing them under fire. One member of the Japanese squad commits seppuku to avoid capture. Desmond helps Glover by kicking away grenades and continuing to bring men to safety. Desmond gets injured in the fight. He is carried away and told he is going home. He asks for his bible, and another soldier runs to get it to him. Desmond is then flown away for treatment.We are shown footage of the real Desmond Doss, Hal Doss, and Jack Glover, recounting Desmond's heroics and experiences in the battle. The text states that Desmond was the first conscientious objector to receive the Medal of Honor. He rescued over 75 men in the battlefield. He and Dorothy Schutte were married until her death in 1991. Desmond passed away at the age of 87 in 2006."}