{"mid": "HalloweenNight", "IMDB_id": "tt0848587", "title": "Halloween Night", "plot": "The film follows Chris Vale (Scot Nery), who was admitted into an insane asylum at the age of 12 after witnessing how his mother was raped and killed by two thugs hired by his father(who subsequently committed suicide) and nearly killed by them with a headshot. Now a 22-year-old gross disfigured young man he escapes from the asylum at Halloween after killing two orderlies who mock him wearing masks that are the same as the thugs were wearing.\nHis old home is now inhabited by the family of David Bexter(Derek Osedach) who hosts a party there with his girlfriend Shannon(Rebekah Kochan), friends and schoolmates. Vale manages to kill Todd(Nicholas Daly Clark) at a gas station, hiding in his costume and stealing his car in which he drives to the party.\nAt the party Vale is taken for Todd by everyone and starts his killing spree unnoticed. Meanwhile, David fakes a dispute with a friend who kidnaps Vale(who still is taken for Todd) with a gun and another friend disguised as police officer who is forced to hand over the keys of his car. After escaping with the car the kidnapper is murdered my Vale who goes back with it. Because someone at the party has called the real police the angry officer ends the party telling everyone to go home, leaving only David, the now disappointed Shannon and some friends there.\nVale enters the house again, killing several of the remaining people and tying Shannon because she wears the collar of his mother that David found in the house earlier. He breaks up a hole in the wall that was covered with boards where the corpse of his mother was hidden by his father before committing suicide.\nAs one girl escapes from the house in panic David begins to search for Shannon, finding her captured in the basement. After freeing her Vale knocks out David from behind but Shannon manages to grab a gun that Vale has lost shooting him twice, presuming the killer for dead.\nAs the police and ambulance arrives later David seems to have disappeared with the police searching for him. Suddenly a hooded person appears behind a police officer who is talking to Shannon. Shannon grabs the officers gun shooting and killing the hooded person, after removing the hood she is shocked to see that she killed David.\nIn the final scene Vale is seen hitch-hiking and picked up by a car-driver who presumes him to having a long Halloween party night. The film ends while the car leaves."}