{"mid": "HalloweenResurrection", "IMDB_id": "tt0220506", "title": "Halloween: Resurrection", "plot": "Three years after the events at Hillcrest Academy, Laurie Strode has been confined to psychiatric facility after killing a paramedic instead of her brother Michael Myers. The paramedic had located the body of Myers in the dining hall of Hillcrest Academy; Myers attacked him, and crushed his larynx so he wouldn't cry out, and switched clothing and his mask. It was actually the paramedic that Laurie had beheaded. As Laurie drove the coroner's van out of the school, Myers in the paramedic's clothing walked out of the school grounds and went into hiding.\nOn October 31, 2001, Laurie, pretending to be heavily medicated, prepares herself for the inevitable confrontation with her brother. Michael appears and kills two security guards, decapitating one and slitting the throat of the other as he makes his way to Laurie. After a chase, Laurie lures Michael into a trap; as she attempts to kill him, Michael feigns confusion and pretends to struggle with his mask. Unable to risk killing another innocent person, Laurie starts to remove his mask to make sure that it is her brother. Myers quickly gains the upper hand and stabs Laurie in the back before sending her off the roof to her death.\nThe following year, college students Bill Woodlake, Donna Chang, Jen Danzig, Jim Morgan, Rudy Grimes, and Sara Moyer win a competition to appear on an Internet reality show Dangetainment, directed by Freddie Harris and his friend Nora Winston, in which they have to spend a night in Michael's childhood home in order to figure out what led him to kill. On Halloween, equipped with head-cameras as well as the cameras throughout the house, they search the house and separate into three groups. Sara's messaging friend Deckard watches the broadcast during a Halloween party. Meanwhile, Michael appears in his home and stabs Bill in the head, and kills a cameraman.\nDonna and Jim begin getting intimate in the basement and a wall filled with corpses falls on them. Jim realizes the corpses are fake and the show is a setup. Jim leaves, but Donna notices a tunnel behind the fallen wall. Myers chases her through the tunnels before impaling her on a spike on the wall. At the party, Deckard and other partygoers witness the murder. Deckard realizes that the murder was real, but the others believe it is an act. Freddie goes through the house dressed as Michael, but is secretly followed by the real Myers. Freddie, mistaking Michael for Charlie (the cameraman who had been killed earlier), tells him to go to the garage and help Nora out; he goes to the garage and promptly kills Nora.\nWhen Rudy, Sara, and Jim find Freddie in the Myers costume, he reveals the scheme to them and begs them to cooperate, telling them that he's set up a nice payday for all of them. When he leaves, the trio decides to gather up the other three and leave. But before they can, Jen discovers the body of Bill (who was stabbed in the head and vanished earlier) and is decapitated by Myers right in front of Rudy, Sara, and Jim. Rudy and Sara flee, but Jim stays to fend off Myers only to have his head crushed. Myers kills Rudy by pinning him to the door with kitchen knives before chasing Sara upstairs.\nLocking herself in a bedroom, Sara begs for Deckard to help her. The other party goers realize that the deaths have not been staged. With Deckard messaging her Myers' location, Sara escapes and is found by Freddie. Myers finds and attacks them. Freddie is injured and Sara makes her way to the tunnels. She finds an exit near Donna's body and emerges in the garage, where Myers finds her and starts an electrical fire in the garage. Freddie returns and begins fighting Myers hand-to-hand. When he is overpowered, Freddie instead electrocutes Myers, tangling him up in electrical wiring before carrying Sara out of the burning garage.\nThe Myers house burns to the ground. Myers' body and the bodies of his victims are then taken to the morgue. As the medical examiner begins to examine Myers' body, he awakens."}