{"mid": "HanaBi", "IMDB_id": "tt0119250", "title": "Hana-bi", "plot": "Kitano plays Yoshitaka Nishi, a violent police detective who had to retire from the police after a tragic accident during a detention: detective Tanaka was killed by the suspect, while two other detectives, Nakamura and Horiba, were severely injured. Becoming unemployed, Nishi spends most of his time taking care of his sick wife Miyuki (Kayoko Kishimoto), who has leukemia. The film moves at a deliberate pace and devotes much time to exploring their relationship. Miyuki also suffers after the death of their child. To pay for his wife's needs, Nishi borrows money from the yakuza but is having difficulty repaying them.\nMeanwhile, Horiba, whom the accident left in a wheelchair, experiences a deep depression. His marriage quickly breaks up, so now he lives alone. In a conversation with Nishi, Horiba hints he considered committing suicide, while adding that he would like to paint but cannot afford to buy himself necessary materials.\nNishi buys a second-hand taxi cab and repaints it in police colors. He arms himself with a signal revolver and commits an audacious bank robbery dressed as a cop. He gives money to Tanaka's widow and buys inks and papers for Horiba who takes up painting and creates wonderful surrealistic works of art. Nishi then starts a journey to historical sites with his wife; both of them know they will not return.\nDetective Nakamura learns about the gift for Tanaka's widow, advising her to keep the money. He also learns about the paints for Horiba and soon understands who committed the robbery. Meanwhile, guessing who may be behind the bank robbery, the yakuza thugs chase Nishi to extort money from him, allegedly for storage. Eventually, the yakuza men find Nishi, but he kills them all in a violent shootout. At the same time, Nishi is found by Nakamura, who wants to arrest Nishi for the robbery. Nishi asks Nakamura to spare him a moment of time and sits down on the beach next to his wife, who suddenly says to him, \"Thank you... for everything\". Then two gunshots are heard behind the scene, so viewers may guess that Nishi shot his wife and then himself."}