{"mid": "HansChristianAndersen", "IMDB_id": "tt0044685", "title": "Hans Christian Andersen", "plot": "In the 1830s, in the small Danish town of Odense, cobbler Hans Christian Andersen spends his day spinning fairy tales for the village children, teaching them lessons about pride, humility, love and growing up through his fanciful characters. One day, the stern schoolmaster, who believes Hans is wasting his pupils' precious time, implores the Burgomaster and councilmen to curtail the cobbler's habit of distracting the students with his storytelling, but even the adult citizens easily become a rapt audience for Hans' fables. Hans finally agrees to stop distracting the children and returns to his shop, where his teenage assistant, the orphan Peter, begs him to stop causing trouble. However, later that day Hans is drawn back to the schoolhouse to see the children. As he hears the schoolchildren drone mathematical phrases, he compares an inchworm's myopic measuring of beautiful blossoms to the schoolmaster's blindness to beauty and creativity. On yet another day, when the children do not arrive at the sound of the school bell, the schoolmaster deduces that Hans is again distracting his pupils. When the schoolmaster then demands that the Burgomaster and the councilmen choose between him and the cobbler, they decide that Hans must leave Odense. Peter, who has witnessed the verdict, returns to the shop and secretly tries to save his friend from the shame of being exiled by eagerly suggesting Hans travel to Copenhagen. After much prodding, Peter succeeds in convincing Hans to leave that afternoon by reminding him that he will be the envy of the town for having been the first to visit the famous city. Soon after Hans begins his journey, Peter joins him on the trail, bringing all the shop's tools to start their business anew.\nAfter a sea voyage, the pair arrive at the city's harbor and find their way to the Great Square of Copenhagen, which is filled with vendors selling flowers, pots and pans and fresh foods. When Hans sets up shop and introduces himself to the crowd while standing on a statue of the king, police arrest him for defaming the image of their leader. Peter, who has sought refuge from the police by hiding near the back entrance of the Royal Theatre, overhears choreographer Niels demand that a company producer send for a cobbler and asks them to free his friend, a cobbler, from jail. Meanwhile, Hans sees a lonely young girl outside his jail cell window and offers to introduce her to his companion. By drawing on his thumb, Hans creates a puppet he calls \"Thumbelina\" and brings a smile to the girl's face. Soon after, Hans is bailed out of jail by the theater company and taken to the theater where he becomes entranced by the beauty and talent of a Royal Danish Ballet dress rehearsal. When Niels ridicules lead ballerina Doro's performance, she in turn complains that her shoes need adjusting. Doro gives the slippers to Hans, who is immediately smitten with the ballerina. After Hans leaves, Peter learns that Niels and Doro are a happily married couple, despite their theatrical quarrels. When Hans returns, Niels is equating his wife's performance with an \"elephant in the snow drift,\" prompting Doro to break into tears. After learning that the couple is married, Hans fantasizes that he can save Doro from her horrible fate with \"the cruel\" Niels.\nLater, when Peter explains that the couple is actually in love, Hans resists the idea and writes a love letter to Doro in the form of a fable called \"The Little Mermaid,\" in which he tells her that she has chosen the wrong man. That night while Peter surreptitiously reads the letter, a gust of wind whisks it from his hands and carries it into the theater through an open window, where a stage doorman finds it and delivers it to Doro. The next morning, Peter tells Hans that Doro has the letter, but Hans is unconcerned, believing that Doro's possession of the letter is a good omen. The next day, the entire ballet company sets off on their annual tour, leaving Hans bereft, but he soon finds comfort entertaining a new group of children with his stories. One day, Lars, a sad boy with a shaved head, remains behind after the other children tease him. Hans tells him the story of an ugly duckling who is ostracized by his peers until the ice melts at winter's end, and he sees his reflection in the lake and finds he has become a handsome swan. When not with the children, Hans counts the days by making pair after pair of brightly colored satin slippers for his absent ballerina and dreaming of her love. One day, Hans receives an invitation from the Gazette newspaper office, where Lars's father, the publisher, thanks Hans for helping his son overcome his difficulties and offers to publish \"The Ugly Duckling\" in the newspaper. Overjoyed by the news, Hans asks that his credit be changed from \"Hans, the cobbler\" to \"Hans Christian Andersen\" and runs down the street singing his full name with pride.\nThat evening, when the ballet company returns, Doro tells Hans that they have created a ballet based on his story \"The Little Mermaid,\" which Hans believes is a sign of her love for him. The next evening, Peter tells Hans about the councilmen's verdict and warns Hans that Doro will humiliate him as well. Disappointed by his friend's attitude, Hans suggests that they part ways and leaves for the opening of the new ballet. When Hans tries to deliver Doro's slippers backstage, Niels locks the insistent writer in a closet to prevent him from disrupting the performers. While Hans listens to the music and dreams of his story, the performance opens on stage. In the ballet, mermaids float in the ocean, while a ship carrying a handsome prince sinks to the mermaids' garden at the bottom of the sea. The littlest mermaid helps the unconscious man to the surface, saving his life. Having fallen in love with the prince, she seeks the help of the sea witches, who transform the mermaid into a woman, so she might find the prince on land. She arrives at the palace during a masquerade ball and dances with the prince, but his attentions are for another. Heartbroken, the mermaid returns to the sea.\nThe morning after the ballet, Doro sends for Hans and discovers that he is in love with her and has misunderstood her relationship with Niels. Niels inadvertently interrupts their conversation and insults Hans by offering to pay him for \"The Little Mermaid.\" To save face, Hans refuses Niels's offer and claims that his writing was a fluke. Doro knowingly accepts the slippers Hans made for her and graciously allows him to leave. On the road to Odense, Hans meets Peter and renews their friendship. Upon reaching town, Hans is greeted as a celebrity and regales the citizens, including the schoolmaster, with his now famous moral tales."}