{"mid": "HappilyEverAfter", "IMDB_id": "tt0099733", "title": "Happily Ever After", "plot": "The film starts as the Looking Glass recaps the story of \"Snow White.\" The wicked Queen has been vanquished and the kingdom is at peace as Snow White and the Prince prepare to marry. Meanwhile, back at the castle, the Queen's animal like minions are celebrating their freedom by throwing a party for themselves. Then, the Queen's equally evil wizard brother, Lord Maliss, arrives at the castle, wondering where his sister is. After learning about his sister's demise, he vows to avenge her death. In the process, he transforms into a wyvern and decides to take control of the palace, while Scowl, (a red colored owl) starts training his companion, a purple bat named Batso, on how to be evil.\nThe next day, Snow White and the Prince are in the meadow picking flowers for their wedding, when suddenly Lord Maliss, in his dragon form, begins attacking Snow White and the Prince as they are traveling to the cottage of the Seven Dwarfs. He targets the Prince, but Snow White manages to flee.\nSnow White reaches the cottage and meets the Dwarves' female cousins, the Seven \"Dwarfelles\": Muddy, Sunburn, Blossom, Marina, Critterina, Moonbeam, and Thunderella. The Dwarves have left the cottage after they bought another mine in a different kingdom, but the Dwarfelles gladly assist Snow White, taking her to visit Mother Nature at Rainbow Falls. Mother Nature has given the Dwarfelles individual powers to assist her; she holds Thunderella accountable for not being able to master her powers correctly, and accuses the other Dwarfelles of improperly using their powers, and threatens to take them away as punishment. Lord Maliss attacks them, but Mother Nature shoots him with lightning, causing him to crash and return to his human form. Before leaving, Lord Maliss informs Snow White that the Prince is held captive in his castle.\nSnow White and the Dwarfelles travel to Lord Maliss' castle in the Realm of Doom, along the way encountering a strange cloaked humanoid known as the \"Shadow Man.\" Lord Maliss sends his one-horned wolves after the group, and they manage to escape with the help of the \"Shadow Man.\" Lord Maliss is furious at this failure and transforms into his dragon form, finally capturing Snow White successfully himself and taking her to the castle. The Dwarfelles follow them and sneak into the castle as well.\nIn the castle, Snow White is reunited with her Prince, who begins exhibiting strange behaviors, and takes her through a secret passage to supposedly escape. When Snow White realizes that he's not the real Prince but is actually Lord Maliss in disguise, he attempts to throw a magical red cloak on Snow White to petrify her into stone. He almost succeeds, but is attacked by the \"Shadow Man.\" The Dwarfelles arrive and attack Lord Maliss as well, but fail and become petrified themselves. The only one unharmed is Thunderella, who finally regains control of her powers and assists Snow White to subdue Lord Maliss. The cloak is thrown on him and Lord Maliss is petrified in mid-transition between his human and dragon form.\nAs the sun shines onto the castle, the Dwarfelles are restored back to their normal selves. Snow White tearfully mourns the \"Shadow Man\", believing that she lost both him and her Prince, until Mother Nature arrives at the scene. Suddenly, the \"Shadow Man\" wakes up and he turns out to be the Prince; as he is waking up he begins comforting Snow White, telling her not to cry, and she notices that he is back to his normal self. The Prince reveals that Lord Maliss had cast a spell on him and he has been watching over Snow White during her journey, guarding her with his life.\nMother Nature decides to let the Dwarfelles keep their powers because they have finally proven themselves by working together as one, and she allows them to attend Snow White's wedding. In the end, Mother Nature takes in Batso and Scowl to be trained as her new apprentices. Sunburn steals Scowl's cigar from him and this allows him to stop smoking. Scowl realizes that he is able to breathe again; he then comments to Batso that working for Mother Nature might not be so bad, even realizing that he can smell again as he wasn't able to before. Batso replies by saying \"But with your cigar, you always smell\" and the Dwarfelles begin laughing. Snow White and the Prince are reunited, as the two of them share a kiss, and begin to live happily ever after."}