{"mid": "HarbingerDown", "IMDB_id": "tt3397918", "title": "Harbinger Down", "plot": "In 1982, a Soviet moon lander crashes into the Bering Sea. In 2015, two biology graduate students, Ronelle and Sadie join their professor, Stephen, on an experimental tour to study the effects of global warming on whales. Sadie's grandfather, Graff, takes them to sea in his commercial fishing trawler, Harbinger, which is crewed by Bowman, Big G, Dock, Svetlana, and Atka. Sadie declines when Graff encourages her to helm the boat, as she has lost her nerve since losing her father at sea. After meeting the crew, Sadie, Ronelle, and Stephen go to sleep.\nThat night, Sadie wakes as the crew catch a load of fish. Detecting that there is whale activity in the area, Sadie unsuccessfully attempts to wake the others, then investigates on her own. She is intrigued when she finds something large under the ice, and the crew help her to recover what proves to be the crashed Soviet lander, now frozen in ice. Ronelle and Stephen are woken by the commotion, and Stephen excitedly claims ownership of the lander. Graff disputes his claim, and says the Russians will want their ship back. Sadie points out that the object was the property of the now-nonexistent Soviet Union, and therefore maritime salvage law would give them the rights to it. Graff infuriates Stephen further by declaring that it belongs to Sadie. Ronelle tries to contact her sister Tamara to tell her about what they found to no avail.\nBowman encourages Sadie to investigate the moon lander before Stephen can find a way to claim it for himself. Bowman recruits Big G to distract Stephen while Sadie sneaks off. She discovers that the Soviet cosmonaut died of an unknown infection and takes a skin sample to analyze. Stephen becomes further frustrated when he learns she has examined the shuttle before him. He threatens to destroy her career unless she signs over the discovery to him. Though Graff threatens to take the issue to the courts, Sadie gives in. Meanwhile, Sadie learns that the moon lander was carrying tardigrades, a hardy terrestial life-form that can survive in extreme conditions. However, cosmic radiation has caused them to mutate and become capable of shapeshifting.\nWhen the cosmonaut's body goes missing, Stephen accuses Sadie of moving or hiding it. She denies this, and Bowman defends her. When Stephen becomes belligerent, Graff threatens him. While examining the lander, Stephen becomes contaminated with the mutated tardigrades. Sadie finds Stephen standing on the deck complaining that he can't breathe and sees him stripping his clothes off despite the sub-zero temperatures. The others drag him back in, after which several stalks sprout from his back and sprays the area with a strange, dark liquid. Dock is sprayed in his mouth, but Sadie confirms that they are all potentially contaminated. They make the liquid nitrogen portable by putting it into a scuba tank and proceed to freeze Stephen's body and the lander.\nDock soon shows signs of infection, and Svetlana locks him in a cage above deck in order to incinerate him using a flare gun. The others object to the plan until Dock also sprouts tentacle-like growths. The tardigrades cut the ship's power, demonstrating high intelligence, but the backup battery kicks in. As they work to restore it, the organism kills Atka, during which Svetlana is revealed to be a Russian spy. Holding Sadie, Bowman, Big G, Ronelle, and Graff hostage, she explains that the tardigrades were part of a Soviet experiment to create radiation-resistant cosmonauts. She does not want to reclaim the Soviet moon lander but instead intends to sink the boat after being picked up by a nearby Russian submarine. Before she can kill her hostages, however, the organism attacks, causing Svetlana to lose her gun. Ronelle picks up the gun, but she is grabbed by the creature, which pulls her through the narrow pipe and presumably kills her. When Svetlana tries to reason with the others, she too is grabbed by the creature.\nThe survivors, Graff, Sadie, Bowman, and Big G, search for several explosive charges that Svetlana hid throughout the ship. The last four are hidden in the bilge, a tight area which only Sadie has access to. As she collects the explosives, the others discover that the tardigrades have consumed and absorbed their latest catch, two tons of crab. As they call down to warn Sadie, she realizes she is standing amid the tardigrades. Although she escapes, Graff is infected. He instructs Big G to restart the ship and Sadie to pilot it before asking Bowman to kill him.\nBig G restarts the ship but dies after battling Svetlana's shape-shifted and mutated body. Before Bowman can freeze Graff with the liquid nitrogen, he is abducted by the creature, and Graff instructs Sadie to scuttle the ship and save herself. She steers it toward an iceberg and escapes just as the creature bursts through the deck. Via the portable radio, the US Coast Guard alerts her that a rescue helicopter is in her vicinity. The helicopter can be heard approaching as Sadie lies motionless on the ice."}