{"mid": "Hardware", "IMDB_id": "tt0099740", "title": "Hardware", "plot": "A nomad scavenger treks through an irradiated wasteland and discovers a buried robot. He collects the pieces and takes them to junk dealer Alvy, who is talking with 'Hard Mo' Baxter, a former soldier, and Mo's friend Shades. When Alvy steps away, Mo buys the robot parts from the nomad and sells all but the head to Alvy. Intrigued by the technology, Alvy begins to research its background. Mo and Shades visit Jill, Mo's reclusive girlfriend, and, after an initially distant welcome where Jill checks them with a Geiger counter, Mo presents the robot head as a Christmas gift. Jill, a metal sculptor, eagerly accepts the head. After Shades leaves, Mo and Jill argue about a government sterilization plan and the morality of having children. Later, they have sex, while being unknowingly watched by their foul-mouthed, perverted, voyeuristic neighbor Lincoln Weinberg via telescope.\nJill works the robot head into a sculpture, and Mo says that he likes the work, but he does not understand what it represents. Frustrated, Jill says it represents nothing and resents Mo's suggestion that she make more commercial art to sell. They are interrupted by Alvy, who urges Mo to return to the shop, as he has important news about the robot, which he says is a M.A.R.K. 13. Before he leaves, Mo checks his Bible, where he finds the phrase \"No flesh shall be spared\" under Mark 13:20, and he becomes suspicious that the robot is part of a government plot for human genocide. Mo finds Alvy dead of a cytotoxin and evidence that the robot is an experimental combat model capable of self-repair; Alvy's notes also indicate a defect, a weakness to humidity. Worried, Mo contacts Shades and asks him to check on Jill, but Shades is in the middle of a drug trip and barely coherent.\nBack at the apartment, the robot has reassembled itself using pieces of Jill's metal sculptures and recharged by draining her apartment's power network. It attempts to kill Jill, but she traps it in a room after the apartment's doors lock. Lincoln sees the robot close the blinds while trying to peep on Jill, and, after he briefly manages to open the apartment door and sexually harasses her, offers to override the emergency lock that traps them in her apartment. Lincoln dismisses her warnings of a killer robot, and, when he attempts to open Jill's blinds so that he can more easily peep on her, the M.A.R.K. 13 brutally kills him. Jill flees into her kitchen, where she reasons that her refrigerator will hide her from the robot's infrared vision. She damages the robot before Mo, Shades, and the apartment's security team arrive and open fire on it, apparently destroying it.\nAs Jill and Mo embrace, the M.A.R.K. 13 drags her out a window, and she crashes into her neighbor's apartment. Jill races back upstairs to help Mo, who is alone with the M.A.R.K. 13. Overconfident, Mo engages the robot in battle, and it injects him with the same toxin that killed Alvy. Mo experiences euphoria and a series of hallucinations as he dies. After Jill reenters her apartment, the M.A.R.K. 13 sets her apartment doors to rapidly open and close; the security team die when they attempt to enter, and Shades is trapped outside. Jill hacks into the M.A.R.K. 13's CPU and unsuccessfully attempts to communicate with it; however, she discovers the robot's weakness and lures the M.A.R.K. 13 into the bathroom. Shades, who has managed to quickly jump through the doors, gives her time to turn on the shower. The M.A.R.K. 13 short circuits and is finally deactivated. The next morning, a radio broadcast announces that the M.A.R.K. 13 has been approved by the government, and it will be mass manufactured."}