{"mid": "HardRain", "IMDB_id": "tt0120696", "title": "Hard Rain", "plot": "During the worst recorded rainstorm in the history of the Midwestern United States, armored truck drivers Tom (Christian Slater) and his uncle Charlie (Edward Asner) are collecting the money from the local banks affected by the rising flood waters. In the small town of Huntingburg, Indiana, which has been evacuated, Tom and Charlie drive into a ditch and become stuck, and Charlie calls dispatch to alert the National Guard. They are then ambushed by Jim (Morgan Freeman) and his gang of armed robbers, Kenny (Michael Goorjian), Mr Mehlor (Dann Florek) and Ray (Ricky Harris). Kenny accidentally shoots Charlie dead, as Tom gets away with the $3 million in cash and hides it in a cemetery.\nAfter being chased through the local Middle School by the gang now travelling with a boat and jet skis, Tom takes refuge in a nearby church. He is knocked out and wakes up in a cell at the local Sheriff's office. Tom tells the Sheriff (Randy Quaid) about the gang and the area he hid the money, although he keeps him locked up. He and his Deputy Wayne (Mark Rolston) then leave to investigate, whilst another officer Phil (Peter Murnik) is ordered to take Karen (Minnie Driver), the woman who knocked Tom out and is currently restoring the church, out of town. In protest, she pushes Phil out of the boat so she will be able to fill the water pumps at her church.\nThe town's dam continues to experience huge pressure from the rain and the operator Hank (Wayne Duvall) is forced to open another spillway floodgate. This causes another huge burst of water to stream through the town, resulting in even worse flooding, especially at the church. Tom wakes in his cell, trapped as the Sheriff's building slowly fills up with water. After filling the pumps at the church, Karen returns and saves him by opening the light fitting on the roof for him to escape. They are then spotted by the gang, and hide before having to get out of the water because a nearby transformer is going to blow.\nKenny grabs Tom and they both fall in the water, but Tom fights him off before Kenny is electrocuted and later dies. Tom and Karen enter a nearby house, only to discover locals Doreen (Betty White) and Henry Sears (Richard Dysart) who believe they are looters. After explaining their story, Henry decides to give Tom their boat so he can return to the armored truck. When he resurfaces from the now submerged truck, he finds Jim and the gang holding the elderly couple hostage. Tom gets Jim to let them go by promising he'll show them where the money is.\nOn the way to the cemetery, Jim reveals to Tom that the National Guard were never coming because Charlie was actually calling the gang, and was in an alliance with them. He was only killed because Kenny was never told Charlie was on their side. Jim then sends Tom to retrieve the money but finds it has disappeared. When the gang are about to shoot him in anger, they are all ambushed by the Sheriff and his Deputies, who have found Karen. The Sheriff now doesn't care any more about justice and intends to keep the money for himself, Wayne, Phil and Hank, who has now joined them from the dam.\nMr Mehlor and Ray are killed in the shoot out, and Jim and Tom escape in a boat, finding sanctuary in the church. Wayne takes Karen back to her house, with the intention of raping her. The others try to force Tom and Jim out by throwing petrol bombs on the roof, but instead are forced to drive through the stained glassed windows. At Karen's house, Karen manages to stab Wayne with her penknife, killing him. In the church, a shoot out occurs, and at one point Tom and Phil come face to face, but Phil cannot bring himself to shoot him. Hank then shoots Phil, thinking he's a coward.\nThe dam overtopping alarm sounds, alerting the town that the dam is going to fail. Offering a deal, the Sheriff says Tom and Jim should let Hank and him go with a couple of the moneybags. Tom agrees, yet Jim does not. Instead, Tom then leaves to try and save Karen, before the Sheriff shoots Jim with a revolver he was hiding, although he isn't badly hurt. The Sheriff and Hank escape in a boat and, when they are forced to go faster to avoid the wave engulfing the town, the Sheriff pushes Hank out of the boat. He then dies after being caught in a gas explosion.\nTom arrives at Karen's house, to find her handcuffed to the banister. He first tries to free her with a saw, then uses Wayne's gun. The water is so high now they have to get onto the roof and are then caught by the Sheriff. Jim, who managed to escape from the church, comes from behind them in a boat. The Sheriff shoots at him, disabling the steering, forcing him to go over the roof. As he does so, the engine breaks off and collides with the Sheriff, knocking him into the water. However, he is not dead and tries to shoot Karen as he grabs a moneybag, but Tom and Jim manage to shoot him dead. Tom tells Jim he should leave, just as the State Police arrive. Jim picks up the Sheriff's moneybag and rows away, as Tom tells Karen the fire damage to her church wasn't too bad, and it can be repaired."}