{"mid": "HardLuck", "IMDB_id": "tt0489070", "title": "Hard Luck", "plot": "As the film begins. A former criminal and drug dealer Lucky (Wesley Snipes) was released from prison and tries to lead a respectable life despite his troubled past. However, Lucky once or twice reflects on the wisdom of his grandfather who supposedly told him \"sometimes without bad luck, it would seem you don't have any luck at all.\" Shortly after his release from prison, Lucky tries to get back on his feet but inexplicably ends up a victim of Hurricane Katrina's wrath, and loses his newly found life.\nAfter Lucky returns to New York, Lucky is dealt another blow when the government withdraws funds for his yoga and samba dance classes which he uses to try to keep kids off the streets. This unfortunate event leads to Lucky enduring the bad influences of two old friends from his past life as a criminal, who lure Lucky to a strip club under the false pretense of his friend's birthday. When a drug deal with some dangerous mobsters goes bad, and Lucky is now on the run with a feisty Puerto Rican stripper from the strip club, Angela (Jacquelyn Quinones), and over $500,000 in American currency, which is wired with marking dye.\nLater that night, there are short cuts of an unconventional and troubled couple, unexplained and also known to the police as the \"Sawtooth Killers\". Chang (James Liao), an egotistical and maniacal accomplice to his old-fashioned girlfriend Cass (Cybill Shepherd), the mother of a mentally challenged man named Eugene (Mike Messier). Motivated by Cass's son Eugene's unpleasant experiences with society's rejection of mentally challenged individuals, the couple brutally kidnaps, tortures, and presumably kills their abductees, recording their exploits on video, possibly for future viewing.\nAngela and Lucky find themselves caught up in the path of violence, and Lucky ends up an unlikely hero by saving the life of a would be victim of the Sawtooth Killers. Lucky saves Captain Davis (Mario Van Peebles) from Cass's son Eugene, who is armed with a shovel. Lucky chooses to have a positive outlook on the events by using perspective gained from his grandfather, characterizes the events as being \"the luckiest day in an unlucky man's life.\" Lucky and Angela go on to receive a $200,000 reward which had been offered by the police for information leading the capture, arrest, and or prosecution of the Sawtooth Killers."}