{"mid": "HaredevilHare", "IMDB_id": "tt0040422", "title": "Haredevil Hare", "plot": "The U.S. is preparing to launch a rocket to the moon, and Bugs Bunny is the passenger. He is forcefully dragged to the launch site when he does not want to go, but after seeing a supply helicopter dumping carrots into the rocket, he agrees to go. He gets inside the rocket, which blasts off shortly thereafter. Shocked at the sudden acceleration, Bugs tries to escape, but realizes that the rocket has left Earth by this time. He remains in the rocket as it crash-lands on the moon.When the rocket hatch opens, Bugs is so shocked by what he sees that he goes stark-raving mad and stumbles out of the rocket, babbling incomprehensibly. He eventually regains his composure, and walks off, content with his position as the first being to set foot on the moon. At that moment, though, another rocket appears and lands nearby. It is revealed to be from Mars, and a Martian named Marvin emerges from the ship, focusing his telescope on Earth. Bugs goes over and inquires as to what he is doing. Marvin responds that he is preparing to blow up the Earth with a \"Uranium Q-36 Explosive Space Modulator\", which resembles a stick of dynamite in appearance. When Bugs realizes what this means, he snatches the explosive space modulator away from Marvin and sets off. Marvin calls out his dog, K-9, and orders him to retrieve the lost goods.Bugs frantically attempts to contact Earth on his walkie-talkie, but all he can pick up is a commercial for breakfast cereal. At that moment, K-9 appears, taking the explosive space modulator. Bugs and K-9 argue over it before Bugs pulls a switcheroo and takes it back. After upstaging K-9 once more, Bugs runs off. The enraged Marvin kicks K-9 in the buttocks, saying, \"You make me very angry. Very angry, indeed.\"At that moment, Bugs appears in Martian garb and gives the two their explosive space modulator back, disguised as a \"special delivery from Mars\". Unknown to Marvin and K-9, it is now wired to a detonator. Bugs activates the detonator, blowing up the moon in the process. The scientists back on Earth contact Bugs, who responds that he has safely landed on the moon. The scientists ask him if he has a statement to make to the press, and Bugs, who is now hanging from the remains of the exploded moon along with Marvin and K-9, reveals his prepared statement: \"GET ME OUT OF HERE!\" Iris out."}