{"mid": "HarlemNights", "IMDB_id": "tt0097481", "title": "Harlem Nights", "plot": "In Harlem, New York, 1918, Sugar Ray has a dice game. Nearly killed by an angry customer, Ray is saved by seven-year-old errand boy Vernest Brown, who shoots the man. After being told that his parents are dead, Ray decides to raise the boy as his own. And because of the boy's savvy, he is nicknamed \"Quick.\"\nTwenty years later, Ray and Quick run a nightclub called \"Club Sugar Ray\", with a brothel in back run by madam Vera. Smalls, who works for the gangster Bugsy Calhoune, and Miss Dominique LaRue, Calhoun's mistress, arrive. Smalls and LaRue have come to see the club and report to Calhoune. Later, Calhoun sends corrupt detective Sgt. Phil Cantone to threaten Ray with shutting the club down unless Calhoun gets a cut.\nRay decides to shut down, but first wants to make sure he's provided for his friends and workers. An upcoming fight between challenger Kirkpatrick and defending champion (and loyal Club Sugar Ray patron) Jack Jenkins will draw a lot of money in bets. Ray plans to place a bet on Kirkpatrick to make Calhoune think Jenkins will throw the fight. Ray also plans to rob Calhoune's booking houses. A sexy call girl named Sunshine is used to distract Calhoune's bag man Richie Vinto.\nCalhoune thinks Smalls is stealing and has him killed. Quick is noticed near the scene by Smalls' brother Reggie who tries to kill him. Quick kills him and his men. Calhoune sends LaRue to seduce and kill Quick. Quick realises he is being set up and kills LaRue.\nCalhoune has Club Sugar Ray burned down. Sunshine seduces Richie Vinto and tells him she has a pickup to make. Richie agrees to pick her up on the way to collect money for Calhoune. Richie gets into an accident orchestrated by Ray's henchman Jimmy. Ray and Quick, disguised as policemen, attempt to arrest Richie, telling him that the woman he's riding around with is a drug dealer. Quick attempts to switch the bag that held Calhoun's money with the one Sunshine had placed in the car, but two white policemen \"real boys\" arrive. Richie explains that he's on a run for Bugsy Calhoune, so they let him go.\nThe championship fight begins. Two of Ray's men blow up Calhoune's \"Pitty Pat Club\", to retaliate against Calhoun for destroying Club Sugar Ray. At the fight, Calhoune realizes it was not fixed as he thought, and hears that his club has been destroyed. Quick and Ray arrive at a closed bank. Cantone arrives, having followed them. Ray's crew seal him inside the bank vault.\nRichie arrives to deliver Calhoun's money, but tells Calhoune that the bags of money had been switched with bags of 'heroin', which turns out to be sugar. Calhoune then deduces that Ray was behind the plot. Vera visits Calhoune and tells them where to find Ray and Quick. Bugsy and his men arrive at Ray's house. One of his men trips a bomb, killing them all. Ray and Quick pay off the two white men who disguised themselves as the policemen earlier, revealing there are white people who are aware of the mis-treatment that has been happening. Ray and Quick take one last look at Harlem, knowing they can never return and that there will never be another city like it. Despite this, they happily depart for an unknown location as the credits roll."}