{"mid": "HaroldAndMaude", "IMDB_id": "tt0067185", "title": "Harold and Maude", "plot": "Harold Chasen (Bud Cort) is a young man obsessed with death. He stages elaborate fake suicides, attends funerals and drives a hearse, all to the chagrin of his socialite mother (Vivian Pickles). She sets him up appointments with a psychiatrist, but the doctor is befuddled by his case and fails to get Harold to talk about his real emotions.\nAt another stranger's funeral service, Harold meets Maude (Ruth Gordon), a 79-year-old woman who shares Harold's hobby of attending funerals. He is entranced by her quirky outlook on life, which is bright and excessively carefree in contrast with his morbidity. The pair form a bond and Maude shows Harold the pleasures of art and music (including how to play banjo), and teaches him how to \"[make] the most of his time on earth\". Meanwhile, Harold's mother is determined, against Harold's wishes, to find him a wife. One by one, Harold frightens and horrifies each of his appointed dates, by appearing to commit gruesome acts such as self-immolation, self-mutilation and seppuku. She tries enlisting him in the military instead, but he deters the recruiting officer by staging a scene in which Maude poses as a pacifist protester and Harold seemingly murders her out of militaristic fanaticism.\nWhen Harold and Maude are talking at her home he tells her, without prompting, the motive for his fake suicides: When he was at boarding school, he accidentally caused an explosion in his chemistry lab, leading police to assume his death. Harold returned home just in time to witness his mother react to the news of his death with a ludicrously dramatized faint. As he reaches this part of the story, Harold bursts into tears and says, \"I decided then I enjoyed being dead.\"\nAs they become closer, their friendship soon blossoms into a romance and Harold announces that he will marry Maude, resulting in disgusted outbursts from his family, psychiatrist, and priest. Maude's 80th birthday arrives and Harold throws a surprise party for her. As the couple dance, Maude tells Harold that she \"couldn't imagine a lovelier farewell\". Confused, he questions Maude as to her meaning and she reveals that she has taken an overdose of sleeping pills and will be dead by morning. She restates her firm belief that eighty is the proper age to die.\nHarold rushes Maude to the hospital, where she is treated unsuccessfully and dies. In the final sequence, Harold's car is seen going off a seaside cliff but after the crash, the final shot reveals Harold standing calmly atop the cliff, holding his banjo. After gazing down at the wreckage, he dances away, picking out on his banjo Cat Stevens' \"If You Want to Sing Out, Sing Out\"."}