{"mid": "Harper", "IMDB_id": "tt0060490", "title": "Harper", "plot": "Private investigator Lew Harper's (Paul Newman) marriage to Susan (Janet Leigh) is on the rocks and he doesn't have many friends, but one of them, mild-mannered attorney Albert Graves (Arthur Hill), brings him a case in Santa Theresa, 90 miles up the coast from Los Angeles. Ralph Sampson, the millionaire husband of hard-boiled Elaine Sampson (Lauren Bacall), has disappeared after flying from Las Vegas to L.A. Ralph, worth $20 million, is described as money-driven, crazy, alcoholic and egotistical. Elaine, physically disabled from a horseback riding accident, doesn't even seem to like her husband and believes he is off with another woman. She just wants to know where he is.\nHarper first interviews Elaine's spoiled, seductive step-daughter, Miranda (Pamela Tiffin), and her amiable boyfriend Allan Taggert (Robert Wagner), the missing man's private pilot. He is told Sampson disappeared from the airport after calling a hotel to send a limousine for him. The hotel staff says Sampson cancelled his request shortly after making it. A photo of a glamorous starlet in a bungalow Sampson keeps at the hotel leads to Fay Estabrook (Shelley Winters), now an overweight alcoholic. Harper gets her drunk to see if there is any evidence linking her to Sampson's disappearance. While she is passed out, he answers her phone and pretends to be the \"Mr. Troy\" that the caller, \"Betty\" (Julie Harris), initially assumes him to be. Betty says that Fay was seen with a stranger – that being Harper – and that they need to be careful \"when the truck goes through.\" As soon as Harper mentions Ralph Sampson, Betty realizes that she is not speaking to Troy. After Harper hangs up, Troy comes out of the woodwork. He is Fay's husband, Dwight Troy (Robert Webber), and the house is his. He kicks out Harper at gunpoint.\nHarper tracks down Betty Fraley, a lounge singer with a nasty drug habit. When he asks about Ralph, she recognizes his voice from the phone call. Harper, noticing the fresh track marks on her arm, threatens to turn her over to the narcotics squad, and Betty admits she knows Sampson, but only casually as a drunk who comes into the bar. Harper becomes more insistent and Betty has the bouncer, Puddler (Roy Jenson), throw him out. Puddler works over Harper in the back alley until Taggert comes out of nowhere and knocks Puddler unconscious. Taggert had apparently been following leads himself which led him to the lounge. They head back to Troy's house to check on the truck, thinking Sampson may be in it. While Harper is inside the house, he hears gunshots. Taggert, standing watch outside, spotted the truck and tried to shoot the tires. Harper tries to run the truck down on foot, but the truck with distinctive tire tracks attempts to run Harper over before it speeds away.\nElaine receives a message from Ralph asking her to cash in $500,000 worth of bonds. She verifies that the handwriting is Ralph's and Harper deduces that he's actually been kidnapped. After Graves cashes the bonds for her and puts the money in the estate's safe as a contingency, Harper advises him to call in the cops to guard it while he goes up to a remote mountaintop property that Sampson gave away to Claude (Strother Martin), a bogus holy man, for his cult's Temple in the Clouds. Despite Claude's attempts to distract him, Harper looks around. He finds a huge kettle of beans cooking and a tire print identical to the truck's.\nBack at Sampson's estate, Harper finds a ransom note with instructions to drop the cash that night at an oilfield outside of town. Since the note assumes they already have the cash, Harper suspects the kidnapper has an inside source, which someone eavesdropping on his call to Graves confirms. They decide that Taggert and Graves will make the ransom drop with Harper nearby to observe the pickup. The man picking up the money is shot dead and the cash taken, however, by someone following in a white convertible. A matchbook on the body leads Harper to The Corner, a seedy bar in Castle Beach, a beachfront community. Harper cons the barmaid into revealing the dead man was \"Eddie\", a regular customer who had made a long distance call to Las Vegas from the bar three nights before. Outside, Harper spots the truck that earlier tried to run him over, driven by Puddler, which he follows back to the mountaintop temple. There, he uncovers a smuggling operation of illegal immigrant labor run by Troy, who use Claude's temple as a front, with Eddie as the smuggler. Harper is caught by Troy, who knows nothing of the kidnapping or Eddie's part in it but recognizes the white convertible as Betty Fraley's. Puddler takes Harper to another location and beats him, but Harper manages to kill him and escape.\nAt the estate, Graves tells Harper that the dead man was Eddie Rossiter, a small-time car thief and junkie who has a sister, Betty, also a junkie. Harper concludes that because Taggert was the only person who knew Sampson was in L.A. and could have cancelled the request for a limo, that Taggert, Betty, and Eddie conspired to kidnap him. Taggert was at The Piano to rescue Harper because he was a fan who fell in love with Betty, he shot at the truck not to stop it but to warn Eddie, and Taggert was the person Eddie called in Las Vegas, to arrange the kidnapping. He confronts Taggert, who pulls a gun on him. Harper vows to let Taggert escape with the money if Harper is allowed to finish the job of finding Sampson. Taggert tries to kill Harper but is shot when Graves bursts into the room. After Harper tells Miranda that Taggert is dead, Miranda admits she hated her father out of self-loathing. Graves, who has long been in love with Miranda, attempts to console her.\nHarper goes looking for Betty and the money in Castle Beach, where she and Taggert had their love nest, and locates the cottage by finding her white convertible parked outside. He hears Betty being tortured inside by Troy, Claude and Fay. She tells them the money is hidden in a deep freeze storage locker. Harper bursts in, shoots Troy, slugs Claude, locks Fay in a closet and, after he retrieves the key to the locker, helps Betty to escape. After he says that he knows she double-crossed and killed her brother, she reveals that Sampson is being held in an abandoned oil tanker. Harper calls Graves to tell him to meet them there. Harper is hit over the head from behind while searching the ship, knocking him unconscious. Some time later Graves revives Harper. They find Sampson dead, presumably murdered by whoever hit Harper over the head. They also discover that Harper's car is gone, driven off by Betty. When she sees them looking for the car, she flees at high speed along a narrow winding hillside road and is killed when the car swerves off the road.\nHarper and Graves retrieve the money. Harper says that he knows that Graves is the one who hit him from behind and killed Sampson, because if it had been Betty or another kidnapper, Harper would have been searched for the key to the locker. Graves admits he killed Sampson when the opportunity arose because Sampson was cruel to everyone including him, prodding Graves to pursue Miranda's affections just for his own cruel amusement. Harper tells him that he has no choice but to turn him in. Harper tells Graves he'll need to shoot him to stop him. Graves cannot bring himself to shoot Harper. Neither man is sure what to do next; each pauses uncertainly, saying to himself, \"Aw, hell.\""}