{"mid": "HarrisonBergeron", "IMDB_id": "tt0113264", "title": "Harrison Bergeron", "plot": "In the year 2081, amendments to the Constitution dictate that all Americans are fully equal and not allowed to be smarter, better-looking, or more physically able than anyone else. The Handicapper General's agents enforce the equality laws, forcing citizens to wear \"handicaps\": masks for those who are too beautiful, radios inside the ears of intelligent people, and heavy weights for the strong or athletic.\nOne April, 14-year-old Harrison Bergeron, an intelligent and athletic teenager, is taken away from his parents, George and Hazel Bergeron, by the government. They are barely aware of the tragedy, as Hazel has \"average\" intelligence (a euphemism for stupidity), and George has a handicap radio installed by the government to regulate his above-average intelligence.\nHazel and George watch ballet on television. They comment on the dancers, who are weighed down to counteract their gracefulness and masked to hide their attractiveness. George's thoughts are continually interrupted by the different noises emitted by his handicap radio, which piques Hazel's curiosity and imagination regarding handicaps. Noticing his exhaustion, Hazel urges George to lie down and rest his \"handicap bag\", 47 pounds (21 kg) of weights locked around George's neck. She suggests taking a few of the weights out of the bag, but George resists, aware of the illegality of such an action.\nOn television, a news reporter struggles to read the bulletin and hands it to the ballerina wearing the most grotesque mask and heaviest weights. She begins reading in her unacceptably natural, beautiful voice, then apologizes before switching to a more unpleasant voice. Harrison's escape from prison is announced, and a full-body photograph of Harrison is shown, indicating that he is seven feet (2.1 m) tall and burdened by three hundred pounds (140 kg) of handicaps.\nGeorge recognizes his son for a moment, before having the thought eliminated by his radio. Harrison himself then storms the television studio in an attempt to overthrow the government. He calls himself the Emperor and rips off all of his handicaps, along with the handicaps of a ballerina who he proclaims his \"Empress\". He orders the musicians to play, promising them royalty if they do their best. Unhappy with their initial attempt, Harrison takes control for a short while, and the music improves. After listening and being moved by the music, Harrison and his Empress dance while flying to the ceiling, then pause in mid-air to kiss.\nDiana Moon Glampers, the Handicapper General, enters the studio and kills Harrison and the Empress with a ten-gauge double-barreled shotgun. She forces the musicians to put on their handicaps, and the television goes dark. George, unaware of the televised incident, returns from the kitchen and asks Hazel why she was crying, to which she replies that something sad happened on television that she cannot remember. He comforts her and they return to their average lives."}