{"mid": "HarryPotterAndTheGobletOfFire", "IMDB_id": "tt0330373", "title": "Harry Potter and the Goblet of Fire", "plot": "=== Plot introduction ===\nThroughout the three previous novels in the Harry Potter series, the main character, Harry Potter, has struggled with the difficulties of growing up, and the added challenge of being a famed wizard: when Harry was a baby, Lord Voldemort, the most powerful Dark wizard in history, killed Harry's parents but mysteriously vanished after unsuccessfully trying to kill Harry, which left a lightning-shaped scar on Harry's forehead. This results in Harry's immediate fame and his being placed in the care of his abusive muggle, or non-magical, aunt and uncle, Aunt Petunia Dursley and Uncle Vernon Dursley, who have a son named Dudley Dursley.\nHarry learns that he is a wizard when he is 11 years old, just before he enrolls in Hogwarts School of Witchcraft and Wizardry. He befriends Ron Weasley and Hermione Granger, and is confronted by Lord Voldemort who is trying to regain power. In Harry's first year he has to protect the Philosopher's Stone from Voldemort and one of his faithful followers at Hogwarts. After returning to the school after summer break, students at Hogwarts are attacked by the legendary monster of the \"Chamber of Secrets\" after the chamber is opened. Harry ends the attacks by killing a Basilisk and defeating another attempt by Lord Voldemort to return to full strength. The following year, Harry hears that he has been targeted by escaped mass murderer Sirius Black. Despite stringent security measures at Hogwarts, Harry is confronted by Black at the end of his third year of schooling, and Harry learns that Black was framed and is actually Harry's godfather. He also learned that it was his father's old school friend Peter Pettigrew who actually betrayed his parents.\n=== Plot summary ===\nThe book opens with Harry seeing Frank Bryce being killed by Lord Voldemort in a vision, and is awoken by his scar hurting. The Weasleys then take Harry and Hermione Granger to the Quidditch World Cup, using a Portkey, to watch Ireland versus Bulgaria, with Ireland emerging victorious. There, Harry meets Cedric Diggory, who is attending the match with his father. After the match, Voldemort's followers attack the site, destroying spectators' tents and wreaking havoc. The Dark Mark gets fired into the sky, which leads to a panic since it is the first time the sign has been seen in 13 years. Winky, Barty Crouch Senior's house elf, is falsely accused of casting the Mark after she is found holding Harry's wand, which is revealed to have been used to cast the Mark, as Harry had lost it during the chaos of the Death Eaters' attack. Hermione, angry at this injustice, forms a society to promote the rights of house elves.\nAt Hogwarts, Professor Dumbledore announces that Alastor \"Mad-Eye\" Moody will be the Defence Against the Dark Arts teacher for the year, and also that Hogwarts will host the Triwizard Tournament, with a prize of one thousand gold Galleons. However, only those over 17—the age of majority in the wizarding world—will be allowed to enter. It is the first time in 202 years that the Triwizard Tournament will be held. Students from Beauxbatons Academy and the Durmstrang Institute, other wizarding academies, will travel to Hogwarts, where they will stay for the year, in hopes of competing. At Halloween, the Goblet of Fire picks Fleur Delacour from Beauxbatons Academy; Viktor Krum (who is also the Seeker on Bulgaria's Quidditch team) from Durmstrang Institute; and Cedric Diggory from Hogwarts to compete in the tournament. However, it additionally gives a fourth name—Harry Potter—leading to suspicion and indignation from everyone and magically binding Harry to compete. Ron is jealous that Harry is once again in the limelight and refuses to speak to Harry.\nHagrid reveals to Harry that the first task involves dragons, and since Fleur and Krum's headmasters are also aware of this, and will surely tell them in advance, Harry informs Cedric as well. At the task, Harry has to pass a Hungarian Horntail to retrieve a golden egg that contains a hint to the next task, which he does by summoning his Firebolt broomstick with the Accio spell, and finishes the task tied for first with Krum. Ron and Harry subsequently reconcile, Ron now understanding the full danger of the tournament. When Harry opens the egg, though, it merely shrieks loudly. Hermione then takes Harry and Ron to the school kitchens, where house elves work. There, they meet a distraught Winky, who is struggling to get over the loss of her sacking. They also meet Harry's old friend Dobby, who has been employed at Hogwarts to work in the kitchens; he is the only known house elf to appreciate his freedom, despite his hardworking nature.\nMeanwhile, gossipy reporter Rita Skeeter is writing scandalous articles of half-truths and outright fabrications in The Daily Prophet about those at Hogwarts, including Hermione, Harry, Hagrid, and Madame Maxime of Beauxbatons.\nWith the Yule Ball approaching, Harry must find a partner, but when he finally approaches his crush Cho Chang, Cedric has beaten him to her, so Harry and Ron ask Parvati and Padma Patil. Ron is shocked and jealous to see that Hermione is attending with Krum. Cedric gives Harry a tip on the egg, telling him to take it to the prefects' bathroom, but Harry refuses to listen, jealous over Cho.\nFinally acting on the tip, Harry takes the egg to the prefects' bathroom, where Moaning Myrtle tells him to listen to the egg underwater; there the words become understandable. Harry learns that the task is to recover something he will \"sorely miss\", and starts looking for spells to help him breathe where the objects will be taken: The Black Lake. By the morning of the task, Harry still hasn't found a solution, but Dobby gives him some Gillyweed to give Harry gills. Harry completes the task by rescuing Ron from under the lake. Harry then takes a risk by also rescuing Fleur's younger sister, Gabrielle, after Fleur was unable to. After the judges confer, he earns enough points to tie him with Cedric for the lead.\nOne month before the final task, Harry and Krum are talking when they encounter Crouch, who appears to have gone insane, but manages to tell Harry to get Dumbledore. Leaving Krum with Crouch, Harry fetches Dumbledore but returns to find Krum stunned and Crouch gone. Harry returns to preparing for the final task, a hedge maze. Inside the maze, Harry is forced to incapacitate Krum, who has been bewitched, to save Cedric. Working together, the two reach the cup. They agree to touch it at the same time, and doing so, discover that it is a Portkey that transports them to a graveyard. There, Peter Pettigrew kills Cedric and uses Harry's blood (along with his own hand and Tom Riddle Sr.'s bone) to resurrect Lord Voldemort.\nVoldemort summons his Death Eaters, berating them for thinking he was dead, before he reveals that he has a single \"faithful servant\" concealed at Hogwarts, who has been working to ensure that Harry would make it to the graveyard, and then challenges Harry to a duel. However, when he and Harry fire curses at each other, their wands connect due to their identical cores. Voldemort's wand releases the most recent spells it performed, resulting in imprints of his last victims appearing in the graveyard, including Harry's parents, who provide a distraction so that Harry can escape back to Hogwarts using the Portkey, taking Cedric's body with him.\nWhen he returns, Moody takes him to his office, and reveals himself to be Voldemort's 'faithful servant'; he was the one who put Harry's name into the Goblet of Fire, and has been guiding him through the tournament from behind the scenes to ensure that he would grab the Portkey first. Before Moody can kill Harry, Dumbledore, McGonagall and Snape intervene. They learn that Moody is in fact Barty Crouch Jr., Mr. Crouch's son, disguised by Polyjuice Potion. Crouch had sentenced Crouch Jr. to life imprisonment in Azkaban over alleged ties to the Death Eaters but smuggled him out as a last favour to his dying wife. Crouch Jr. was the one who set off the Dark Mark at the Quidditch World Cup, doing it to scare the Death Eaters he felt had abandoned Voldemort. Eventually, Voldemort had gotten in contact with Crouch Jr. and had him impersonate Moody as part of his plan. Crouch Jr. also admits to killing Crouch Sr., to prevent him telling Dumbledore about Voldemort. The real Moody is found inside Crouch Jr.'s enchanted trunk and rescued. Harry is then declared the winner of the Triwizard Tournament and given his winnings.\nMany people, including Fudge, do not believe Harry and Dumbledore about Voldemort's return, and as Fudge has the Dementor's Kiss performed, Crouch Jr. is unable to give testimony. Hermione discovers Rita Skeeter is an unregistered Animagus, who can take the form of a beetle, and blackmails her to force her to stop writing her libellous stories. Not wanting his tournament winnings, Harry gives them to Fred and George to start their joke shop and returns home with the Dursleys."}