{"mid": "HeartAndSouls", "IMDB_id": "tt0107091", "title": "Heart and Souls", "plot": "In San Francisco, 1959, four people embark on the same bus. A single mother named Penny Washington leaves her three children at home to work in her night shift as a telephone operator. A singer named Harrison Winslow is afraid of the stage and quits his audition. A waitress named Julia regrets turning down her boyfriend John's marriage proposal and leaves her job to seek him out. A small-time thief named Milo Peck fails to retrieve a collection of vintage stamps that he had conned out of a young boy. The bus driver, Hal, has a serious accident, killing himself and everyone on board.\nMeanwhile, Frank Reilly is driving his pregnant wife Eva to the hospital. Frank successfully swerves to escape the bus, just before it drives off an overpass, but Eva delivers their baby in the car. Hal ascends into the next life, but the souls of the four passengers become the guardian angels of the boy, Thomas Reilly, and can be seen only by him. Seven years later, the boy's parents and teachers begin to worry about his obsession with these \"imaginary friends\" and discuss submitting him to psychological exams. After realizing their presence is harming Thomas, the quartet decides to become invisible also to him. Unknown to Thomas, they remain by his side.\nTwenty-seven years later, in 1993, Hal returns with his bus and prepares to finally take them to the next life. The quartet learns from Hal that they've been with Thomas all these years because he serves as their corporeal form; they were supposed to ask him for help in resolving the problems they left behind. If he ever refused, one of them should have inhabited his body and made him cooperate. After convincing Hal to buy some more time for them to rectify their unfinished lives, they reappear to Thomas, who is now a ruthless businessman and indecisive in his relationship with girlfriend Anne.\nThomas reluctantly agrees and, through a series of hilarious mishaps, the lost souls are freed: Milo by returning the stolen stamps, Harrison by facing his fears and singing to a live audience, Penny by discovering the fates of her children and Julia by encouraging Thomas to repair his relationship with Anne, as she was never able to do the same with John. In the end, Thomas becomes a better man and he dances with Anne as four stars twinkle in the night sky, symbolizing that Penny, Julia, Harrison, and Milo are finally at peace."}