{"mid": "Heathers", "IMDB_id": "tt0097493", "title": "Heathers", "plot": "17-year-old Veronica Sawyer (Ryder) is one of the most popular girls at Westerburg High School in Sherwood, Ohio. In addition to Veronica, the popular clique consists of three wealthy and beautiful girls with the same first name: the leader, Heather Chandler (Walker); the bookish bulimic Heather Duke (Doherty), and the weak-willed cheerleader Heather McNamara (Falk). Though they are the most popular students, the Heathers are feared and hated. Veronica has had enough of their behavior and longs to return to her old life and her nerdy friends.\nWhen a new student, a rebellious outsider named Jason \"J.D.\" Dean (Slater) pulls a gun on school bullies Kurt Kelly (Fenton) and Ram Sweeney (Labyorteaux) and fires blanks at them, Veronica finds herself fascinated with him. When Veronica attends a frat party with Heather Chandler, but refuses to have sex and throws up, Heather vows to destroy her reputation. J.D. shows up at Veronica's house and they end up having sex outside, after which Veronica tells J.D. she wants to make Heather puke her guts out. The next morning, Veronica and J.D. break into Heather's house. J.D. serves Heather a liquid he claims is a hangover cure but is actually drain cleaner, killing her. J.D. urges Veronica to forge a dramatic suicide note in Heather's handwriting.\nThe school and community look on Heather's apparent suicide as a tragic decision made by a popular but troubled teenager. Heather Duke soon steps into Heather Chandler's former role as clique leader and begins wearing a red scrunchie that had belonged to Chandler.\nSeveral days later, Kurt and Ram spread a rumor about Veronica giving them oral sex, ruining her reputation. J.D. proposes that Veronica lure them into the woods with the promise to \"make the rumors true\"; then shoot them with nonfatal German bullets. J.D. shoots Ram but Veronica misses Kurt, who runs away. Veronica realizes that the bullets are real; J.D. chases Kurt back towards Veronica, who panics and shoots him. J.D. plants \"gay\" materials beside the boys, and a suicide note stating the two were lovers participating in a suicide pact. At their funeral, the boys are made into martyrs against homophobia. Although she keeps dating J.D., Veronica is alarmed by his behavior.\nMartha Dunnstock, an obese, regularly bullied student known as \"Martha Dumptruck\", pins a suicide note to her chest and walks into traffic. She survives but is badly injured and is mocked for trying to \"act popular\". Heather McNamara calls a popular radio show one night while Veronica and Heather Duke are listening and talks of depression in her life; the next day, Heather Duke tells the entire school about Heather McNamara's radio call; McNamara attempts to take her life by overdosing on pills in the girls' bathroom but is saved by Veronica.\nVeronica tells J.D. that she will not participate in any more killings. He climbs into her room with a revolver to kill her, but Veronica has used a harness to make it look like she has hanged herself. Assuming she is dead, he rambles about his plan to blow up the school during a pep rally. A petition he has been circulating via Heather Duke, to get the band Big Fun to perform on campus is actually a mass suicide note. Most of the students had already signed, so the mass murder would appear to be a mass suicide instead.\nVeronica confronts J.D. in the boiler room, where he is rigging timed explosives. She shoots him when he refuses to stop the bomb. As J.D. collapses, he stabs the timer and it stops. Veronica walks out through the pep rally with everyone cheering. The severely injured J.D. follows her outside with a bomb strapped to his chest, offers what amounts to a personal eulogy as Veronica looks on, and detonates the bomb.\nVeronica confronts Heather Duke, takes the red scrunchie, says \"Heather my love, there's a new sheriff in town\" and invites Martha Dunnstock to hang out on prom night and watch movies with her. Martha and Veronica walk down the hallway while Heather Duke watches them with disbelief."}