{"mid": "HeDiedWithAFelafelInHisHand", "IMDB_id": "tt0172543", "title": "He Died with a Felafel in His Hand", "plot": "=== Prologue ===\nDanny (Noah Taylor), enters the lounge of his Sydney flat late at night and discovers that his roommate Flip (Brett Stewart) has died in front of the TV holding a felafel sandwich.\n=== House #47: Brisbane, Australia ===\nNine months prior, Danny and Flip are sharing a house in Brisbane, with housemates Taylor (Alex Menglet), Milo (Damian Walshe-Howling), Otis (Torquil Neilson), Sam (Emily Hamilton), Jabber (Haskel Daniel), and Derek (Robert Rimmer). Anya (Romane Bohringer), arrives and becomes a new housemate. Later that night, Milo and Otis set the rules for a contest to see which of them can successfully romance Anya. The next day, a pair of thugs (Linal Haft and Nathan Kotzur) show up at the house and threaten them for not paying their rent. Anya asks to invite some friends over for a party. The next morning, Danny types out a horror story about masturbation and posts it to Penthouse. While checking the mail, he is devastated to find an invitation to his ex-girlfriend's wedding. A young Japanese girl, Satomi (Sayuri Tanoue), who speaks little English, comes in, declaring, \"I move in now.\" After Satomi produces a wad of cash, Sam offers to let her stay in a narrow storage closet in the screened veranda surrounding the house. Anya's party turns out to be a pagan ritual, and a drunk Milo gets tied to the pole of the washing line. Taylor also invites over a gang of skinheads to help confront the landlord's thugs. Milo escapes from the neopagans as the skinheads start looting and vandalizing the house with chainsaws. Anya kisses Sam just as the skinheads manage to remove the entire back wall of the house. Danny quickly packs his belongings, leaves his boom box with Flip, and departs.\n=== House #48: Melbourne, Australia ===\nThree months later, Danny is living in Melbourne with a housemate named Iain (Ian Hughes). Danny attends the outdoor wedding of his ex-girlfriend (Pascal Delair) and best friend (Stuart Nicholls) in the pouring rain. When he arrives back home, Taylor and Flip arrive. Taylor expresses his pleasure at having discovered the joys of hiring prostitutes. Later, Sam also shows up after fleeing from an argument with Anya. Taylor checks the telephone directory for local prostitutes. Sam lies in bed with Danny and asks him to make love. Danny declines on the grounds that \"we're mates.\" Danny is awakened in the middle of the night by loud music. He discovers Sam in the bath with her wrists cut. Danny comforts her, and she kisses him. In the morning, the two are awakened by two policemen (Tim Robertson and Robert Morgan), who drag in an unconscious Taylor and lecture Danny about morality. The policemen line up Danny, Sam, Flip, and Iain in the lounge to interrogate them. The cops threaten them, checking all their arms for heroin needle track marks and declares Flip a \"pincushion.\" Danny asks Flip what's going on, but Flip reveals he has checked into a rehab bootcamp. The policemen reveal that Taylor had stolen Danny's credit card and charged over $8000 to it during a night of drunken mayhem. They also tell Danny that he owes more than $7,000 to the Brisbane landlord. Iain demands a lawyer and one of the cops draws his gun Iain panics and grabs for the gun, and gets shot in the ear. The cop warns Danny to be careful and Danny takes it as a threat, deciding to leave.\n=== House #49: Sydney, Australia ===\nThree months later, Danny is living in a tidy flat in Sydney with housemates Nina (Sophie Lee), 'Uptight Ivan' (Ivan Tatarovic), Dirk (Francis McMahon), and Taylor. Danny notices a newspaper article saying that Melbourne police have been cleared of responsibility for Iain's shooting. Sam arrives and moves into the spare room. An agent (Clayton Jacobson) from a department store credit bureau arrives, looking for a \"Mr. Corcoran.\" Danny shows the man a drawer full of collection letters addressed to Robert J. Corcoran. Anya arrives, and soon after, so does a policewoman, Sgt. P. O'Neill (Skye Wansey), also looking for Corcoran. Anya and Sam argue about their broken relationship, which quickly escalates into loud sex. Nina urges Danny to get rid of them. Danny tells Anya that he just wants to be left alone, but Anya begins kissing him passionately. Sam appears at the door and sees them. Sam begins angrily packing her things while Danny apologizes. Sam declares Anya a \"chaos freak\" and heads out the door.\nThe roommates all complain to themselves about their problems. Dirk enters to declare that he's gay, but is disappointed by the lack of reaction from the roommates, who had all assumed as much. Danny loses his temper with Dirk, urging Dirk to chill out, since he isn't the only one with problems. Danny then locks himself in his bedroom with a telephone sitting on his chest. Taylor slides food to him under the door. Several hours later, Anya slides a cigarette through, and, sitting on the other side of the door, tells Danny a story about lovers, the plot of Solaris. Danny takes the cigarette. Taylor discovers that Penthouse has published Danny's story. As Taylor gives Danny the good news, Flip arrives at the door, and reveals that he has left rehab. Sgt. O'Neill arrives with a partner (Simon Wheeler). She adds up the amount due in Corcoran's bills as $28,000, and issues a summons to Danny to appear in court. At night, Danny tells Flip that he's going to be sent to prison for credit fraud, but Flip says he needs Danny because he's the only friend he has who is not on drugs. Flip leaves Danny's room to get something to eat.\nLater that night, Danny starts packing his things in a milk crate. Loud music catches his attention, and he discovers Flip dead in front of the TV. A pair of cops declare Flip a \"typical bloody junkie\" and cover his body with a sheet, telling Danny not to touch anything. As the sun rises, Danny leaves with his typewriter, catches a ferry, and drops his typewriter into Sydney Harbour. Later, Sam encounters Danny asleep in front of her door, who, after waking him up, tells her that Flip has died. Danny and all of his former roommates hold a memorial service for flip. Each leaves a memento on a charcoal fire in a kettle grill in which Flip's ashes have been dumped. Danny sacrifices his old boombox. Anya gives Danny a cheque, ostensibly from Penthouse, and Nina declares that she and Anya, now a couple, are going to Paris together, where Nina hopes be a successful actor. Danny calls Sgt. O'Neill and identifies the now-deceased Flip as Robert J. Corcoran, and he and Sam set off down the street together."}