{"mid": "HeKnowsYoureAlone", "IMDB_id": "tt0080850", "title": "He Knows You're Alone", "plot": "A young bride is murdered on her wedding day by the man she rejected for her current fiancé Len Gamble, a police detective. Several years later, a bride-to-be is stabbed to death in a movie theater with a dagger on Long Island while her friend sits beside her. The killer, Ray Carlton, flees into the night.\nThe next morning, the killer arrives by bus at Staten Island, where he sees from a distance university student Amy Jensen (Caitlin O'Heaney). Amy is preparing for her wedding, and she sees off her husband-to-be Phil and his two friends who leave town for a bachelor party the weekend before the wedding. After attending a ballet class with her friends Nancy and Joyce, the three run into their psychology professor Carl (James Rebhorn), with whom Joyce is having an affair. Amy leaves to go to a dress fitting, stopping to get ice cream on the way, where she notices a man following her. She is startled by Marvin (Don Scardino), her ex-boyfriend, outside the ice cream shop on a break from his job at the local morgue. She then goes to the dress shop for her fitting, and as she leaves, the dressmaker is stabbed to death with scissors by the man who was following her. Later that night, Nancy and Joyce surprise Amy at her home with a small bachelorette party. Her parents are gone for the weekend, leaving Amy in charge of her kid sister. Joyce leaves the party for Carl's house, where the two begin to have sex until the power inexplicably goes out. Carl goes to check on the electrical box, and when he returns he is stabbed to death by the killer with a chef's knife after finding Joyce's lifeless body in the bed.\nThe following morning, Marvin arrives at Amy's house and insinuates that he wants to rekindle their relationship, and Amy expresses second thoughts over her marriage to Phil. While in the kitchen, Amy sees the mysterious man standing in her yard and becomes frightened. She invites Marvin to come to a local amusement park with her, Nancy, and her sister, but he declines as he has a shift at the morgue that night. Meanwhile, police find the dressmaker's body at the shop, and detectives Frank Daley (Paul Gleason) and Len Gamble arrive to investigate. Later, Amy and Nancy meet Elliot (Tom Hanks), a psychology student, while jogging through a forest trail. They later attend the amusement park with him, where he questions Amy's claims of a man following her. While riding a dark ride with her sister, Amy sees Ray Carlton inside the ride, and confides in Nancy at her house that night. Amy briefly leaves to take her sister to a birthday party, leaving Nancy alone at the house. Nancy takes a shower and then puts on a record and lies down in the living room where she smokes a joint, and moments later has her throat cut by Ray with his chef's knife.\nAmy returns, discovers Nancy's severed head in the fish tank, and is attacked by Ray. She flees outside to her car and struggles to drive with Ray on the roof. She crashes the car in a wooded area and runs to the nearby morgue, where she finds Marvin and phones the police. Ray enters the morgue, and Detective Gamble arrives as well. Ray confronts Amy and chases her through a tunnel system in the morgue's basement. When confronted by Detective Gamble, the killer stabs him in the heart after he gets shot in his right shoulder by the detective. Neverless, Ray continues to pursue Amy. Amy manages to trap the wounded killer inside a storage closet and escapes from the basement where Marvin finds her. The two flee outside to safety where police are arriving and entering the morgue. Later, Marvin and Amy are to be married, as it is implied that she cut off her marriage to Phil. As Amy sits in front of a mirror in her wedding dress, an unseen person enters the room. She stands, approaches the camera, and says \"Phil, what are you doing here?\" before she screams and the screen fades to red."}