{"mid": "HellraiserBloodline", "IMDB_id": "tt0116514", "title": "Hellraiser: Bloodline", "plot": "In 2127, Dr. Paul Merchant, an engineer, seals himself in a room aboard The Minos, a space station that he designed. As armed guards attempt to break through the door, Merchant manipulates a robot into solving the Lament Configuration, destroying the robot in the process. The guards break through the door and apprehend Merchant, who agrees to explain his motivations to their leader, Rimmer.\nThe film flashes back to Paris, France, 1796. Dr. Merchant's ancestor, Phillip LeMarchand, a French toymaker, makes the Lament Configuration on commission from the libertine aristocrat Duc de L'Isle. Unbeknownst to LeMarchand, L'Isle's specifications for the box make it a portal to Hell. Upon delivering the box to L'Isle, LeMarchand watches as he and his assistant Jacques sacrifice a peasant girl and use her blood to summon a demon, Angelique, through the box. LeMarchand runs home in terror, where he begins working on blueprints for a second box which will neutralize the effects of the first. Returning to L'Isle's mansion to steal the box, LeMarchand discovers that Jacques has killed L'Isle and taken control over Angelique, who agrees to be his slave so long as he does not impede the wishes of Hell. The pair kill LeMarchand, and Jacques informs him that his bloodline is now cursed for helping to open a portal to Hell.\nIn 1996, LeMarchand's descendant, John Merchant, has built a skyscraper in Manhattan that resembles the Lament Configuration. Seeing an article on the building in a magazine, Angelique asks Jacques to take her to America so that she can confront him. When Jacques denies her request, Angelique kills him, as Merchant poses a threat to Hell. Angelique travels to America, where she fails to seduce Merchant. Discovering the Lament Configuration in the building's foundation, Angelique tricks a security guard into solving it, which summons Pinhead. The two immediately clash, as Pinhead represents a shift in the ideologies of Hell, which she left behind two hundred years ago: while Angelique believes in corrupting people through temptation, Pinhead is fanatically devoted to pain and suffering. Despite their conflicting views, the pair forge an uneasy alliance to kill Merchant before he can complete The Elysium Configuration, an anti-Lament Configuration that creates perpetual light and would serve to permanently close all gateways to Hell.\nAngelique and Pinhead initially collaborate to corrupt Merchant, but Pinhead grows tired of Angelique's seductive techniques and threatens to kill Merchant's wife and child. Having grown accustomed to a decadent life on Earth, Angelique wants no part of Hell's new fanatical austerity, and she intends to force Merchant to activate the Elysium Configuration and destroy Hell, thus freeing her from its imperatives. However, Merchant's flawed prototype fails. Pinhead kills Merchant, but his wife opens Angelique's Lament Configuration, sending Pinhead and Angelique back to Hell.\nIn 2127, Rimmer disbelieves Dr. Merchant's story and has him locked away. However, Pinhead and his followers—now including an enslaved Angelique—have already been freed after Merchant opened the box. Upon learning of Dr. Merchant's intentions, they kill the entire crew of the ship, save for Rimmer and Paul, who escape. Paul reveals that the Minos is, in fact, the final, perfected form of the Elysium Configuration, and that by activating it, he can kill Pinhead and permanently seal the gateway to Hell.\nPaul distracts Pinhead with a hologram while he boards an escape pod with Rimmer. Once clear of the station, he activates the Elysium Configuration. A series of powerful lasers and mirrors create a field of perpetual light, while the station transforms and folds around the light to create a massive box. The light is trapped within the box, killing Pinhead and his followers, thus ending Pinhead's existence, this time, permanently."}