{"mid": "HellIsForHeroes", "IMDB_id": "tt0056062", "title": "Hell Is for Heroes", "plot": "Montigny, Meurthe-et-Moselle, 1944: Squad leader Sergeant Larkin (Harry Guardino) and his men are taking a well-deserved rest behind the lines after conducting front-line combat operations for several weeks. Rumor has it the unit will be rotated state-side and the men are almost giddy in anticipation. During an interlude at a church and later at a tavern, the senior non-commissioned officer, Platoon Sergeant Pike (Fess Parker), happens upon acquaintance Private John Reese (Steve McQueen) who has been assigned to his platoon. Reese was a former master sergeant, demoted to private after a court martial, who walks about armed with a distinctive M3 submachine gun. Reese is the quintessential troubled loner, managing to alienate almost everyone in the squad right from the beginning. Unlike his jubilant comrades, the prospect of a long break from combat, perhaps the end of the war itself, renders Reese morose. The company commander, Captain Loomis (Joseph Hoover), is worried because Reese, although already having won a Distinguished Service Cross, acts irresponsibly when there is no fighting, but Pike comments that he is a good soldier in combat.\nPike informs the men that they will shortly be going back on the line rather than home. After much bitter complaining, the men get ready to move out. The remaining members of 2nd Squad include con-man/scavenger Corby (Bobby Darin); Corporal Henshaw (James Coburn), a mechanic who can fix anything; the easy-going, somewhat-naive kid, Cumberly (Bill Mullikin); and family man Kolinsky (Mike Kellin). The squad has their own mascot, a young Polish displaced person Homer Janeczek (Nick Adams), who is not a soldier, but stays with the squad in hopes of accompanying the men upon their return to the United States. The morning after they arrive at their appointed post and dig in, the men realize that an unannounced overnight withdrawal of the main American force has left them spread dangerously thin. Finally, Pike arrives to explain the situation, which only heightens everyone's awareness that any reconnaissance by the Germans across the valley will quickly reveal how weak the American defenses are there.\nOne stroke of good luck is the sudden and mistaken arrival of an Army company clerk, Private First Class James Driscoll (Bob Newhart in his first film role). Larkin quickly puts Driscoll’s jeep to use by having Henshaw drive it back and forth behind their lines, after rigging it to backfire and sound like a tank, in an attempt to fool the Germans. Driscoll himself is put to use improvising misleading radio messages for a hidden microphone, discovered by Corby, left by the Germans in an abandoned pillbox (Newhart was noted for his telephone conversation skits in his stand-up comedy routines). Additionally, Larkin has his men run wire to three empty ammo cans, partially filled with rocks and hung from trees, distributed along gaps in their front lines, which they can pull to create noise to make the Germans believe that a much larger American force is present.\nA German raid results in Cumberly's death, but Reese manages to eliminate three Germans in close combat. Worried that the German survivors will report on the understrength American lines, Reese recommends attacking a large, opposing German pillbox, flanked by a minefield and barbed wire, to make the enemy pause and convince them the Americans are at normal strength. Larkin, fearing an overwhelming enemy assault on their positions, decides to go find Pike and obtain his permission for the pillbox attack. Unable to locate Pike because he has gone to the rear, Larkin returns and berates Pike when he finds out Henshaw, whom Larkin had put in charge in his absence, had been convinced by Reese to go to a supply dump to obtain satchel charges. After a heated argument with Reese, Larkin is killed in an artillery barrage. Reese decides to proceed without orders and two others, Henshaw and Kolinsky, go along. Shortly after they set out, Sgt. Pike and the rest of the company begins to return to the line.\nThe squad's attack fails when Henshaw accidentally sets off an undetected S-mine, fatally burning with the exploding flamethrower tanks he carries, as well as illuminating the battlefield. Reese and Kolinsky retreat, covered by smoke from the company mortar squad. As they run back to their lines, Kolinsky is struck by shrapnel through the back and abdomen, and finally dies, screaming about his guts, as a medic and others attend to his wounds.\nA furious Captain Loomis berates Reese and promises him a court-martial for defying orders to hold the line, but only after the American assault at dawn. The dominant German pillbox fires on the advancing Americans, who press on despite heavy casualties. Determined to eliminate the pillbox, Reese gets within striking range, aided by Corby, manning a flamethrower. Reese throws a satchel charge into the pillbox, but, in the process, is wounded in the back and stomach. When the unexploded satchel charge is tossed out by the alert defenders, the wounded Reese retrieves it and carries it back through the pillbox opening, blowing up the fortification's occupants and himself. Corby, at Pike's command, directs his flamethrower at the blown-out pillbox window, until it is engulfed with fire, as the Americans continue to advance, and fall, to other unseen German weapons."}