{"mid": "HerculesAndXenaTheAnimatedMovieTheBattleForMountOlympus", "IMDB_id": "tt0119283", "title": "Hercules and Xena - The Animated Movie: The Battle for Mount Olympus", "plot": "Long after Zeus stole the Cronus Stone from the monsters called the Titans whom he also imprisoned in Tartarus, he and Alcmene gave birth to a son named Hercules, who defeated two serpents (sent by a jealous Hera) at a young age and became a hero. After Hercules battles a sea serpent, the villagers thank him, and Iolaus climbs out of a restchair and joins him. Hercules and Iolaus head to Thebes to see Alcmene but Iolaus is a little upset because Hercules takes the credit. Meanwhile, Xena and Gabrielle reclaim the gold stolen by satyrs from a group of travelers in Corinth. Ares tells Xena to stop Hercules from going to Thebes because there is a trap set for him there, but Xena doesn't believe him and leaves with Gabrielle.\nWhile tending to the crops, Hercules and Iolaus encounter Zeus, who takes Alcmene to Mount Olympus, much to Hercules' anger. After a brief argument, Iolaus and Hercules decide to rescue her from Mount Olympus. Back at Olympus, Hera hears about Alcmene's presence and confronts Zeus before stealing the Cronus Stone, the stone that keeps the Titans in the Underworld lava pits. She releases the Titans out while Zeus checks on Alcmene, who has been shrunk and placed in a small Arabian doll house castle for safety from Hera. Meanwhile, Aphrodite surfs down a mountain to warn Hercules of Hera's wrath if she sees him. Ignoring Aphrodite's warning, Hercules decides to continue on to Mount Olympus and Iolaus stays behind with Aphrodite. However, an earthquake begins (probably due to Hera messing up with the power of the Cronus Stone), and a small boy nearly falls into the lava pits, forcing Hercules to hold the faults while Iolaus goes to rescue the boy. Xena and Gabrielle, in a nearby town, gets into a fight with three thugs during the aftermath of the earthquake. After the boy is rescued, Hercules and Iolaus meet the Earth Titan Porphyrion as he emerges from the faults. Hercules tells Porphyrion that he can go free because he is not defending the gods, but warns Porphyrion that he should keep his fight against the gods away from the mortal world. Giving his word, Porphyrion heads over to Mount Olympus, signaling the other Titans to awaken. The Water Titan Tethys arises from the water as the Fire Titan Mnemosyne emerges from the volcano and the fat Wind Titan Crius materializes from a tornado right in front of Xena and Gabrielle after they defeated the thugs. The Titans then gather to begin their revenge on the gods.\nZeus calls Artemis, Aphrodite, and Ares together to fight the Titans and they hope Hercules will help them, unaware that Hercules has let one of them go out of hate against the gods. Xena and Gabrielle are helping wounded people and Artemis decides to get Xena's help and transforms Gabrielle into a Roc. Xena flies on Gabrielle to the gods' home while Hercules climbs up. When Xena accuses Ares for what happened to Gabrielle, Artemis confessed the truth about her own actions, offering to turn Gabrielle back if Xena helps the gods fight the Titans.\nHercules shows up and rescues Alcmene and leaves everyone to fight the Titans. Hera transforms Ares, Aphrodite, Artemis and Zeus into a goat, a cow, a rabbit and a mouse, respectively. They are angry that Hercules did not help them to fight against the Titans, but he didn't care, considering the fact that he hated them because of the hardtimes they given for humanity. When Xena and Ioalus arrive, the former blames Hercules and his family for Gabrielle's fate and she confronts Artemis and learns that she can not turn Gabrielle or herself back due to the loss of her powers. Hercules finds out that Alcmene was sick and Zeus offered to make up for hardtimes by giving her immortality and taking her to live with him on Mount Olympus. Alcmene also confessed that she couldn't bear to tell Hercules about it because of his hatred of Zeus. Realizing his mistake, Hercules decides that it's for the best, as long as Alcmene is happy. Even Zeus starts to feel guilty for not being a little frank with Hercules, holding himself partially responsible for causing Hercules to hate the gods and deny his help back in Mount Olympus in the first place.\nHera scolds the Titans for wrecking Mount Olympus when they celebrate their victory against the gods. On Earth, Xena and Hercules reconcile and agree to help the gods get their home and the Cronus Stone back. Upon learning of the heroes' return (due to hearing Xena's battle cry), Hera uses the Cronus Stone to give the Titan more powerful forms and tries to force the Titans to do her bidding. However, Porphyrion strips the stone away from Hera (with the help from Crius) and deprive her of her powers by shrinking her into the dollhouse, declaring himself and the Titans as the new rulers. The heroes ride Gabrielle to the mountain and fight the Titans. Hercules gets the Cronus Stone and almost tears it apart which causes the Underworld caverns to open, allowing Xena to flip Crius into the pits and Iolaus to get Tethys and Mnemosyne to collide and dissolve into the fiery pits. However, Porphyrion, having inherited much of the power from the Stone before being separated from it, uses it to restrain Hercules, but is pulled into the air by Gabrielle, who then drops the Titan into the cavern. Gabrielle then drops Hercules off on the gods' mountain in time for him to close the stone, locking the Titans in the Underworld. The gods are then returned to their original forms while Hera remains trapped in the dollhouse as punishment, and Artemis turns Gabriele back to her original form as promised.\nBack at Thebes, Alcmene is preparing to leave and return to Mount Olympus, and Zeus assures Hercules that he is welcome to meet them again anytime he wants. As Zeus and Alcmene leave for Mount Olympus, Hercules heads off with Xena, Iolaus, and Gabrielle to Corinth to return a bag of gold and seek another adventure."}