{"mid": "HereComesMrJordan", "IMDB_id": "tt0033712", "title": "Here Comes Mr. Jordan", "plot": "On 11th May 1941, Boxer and amateur pilot Joe Pendleton (Robert Montgomery), affectionately known as \"the Flying Pug\", flies his small aircraft to his next fight in New York City, but crashes when a control cable severs. His soul is \"rescued\" by 7013 (Edward Everett Horton), an officious angel who assumed that Joe could not have survived. Joe's manager, Max \"Pop\" Corkle (James Gleason), has his body cremated. In the afterlife, the records show his death was a mistake; he was supposed to live for 50 more years. The angel's superior, Mr. Jordan (Claude Rains), confirms this, but since there is no more body, Joe will have to take over a newly dead corpse. Mr. Jordan explains that a body is just something that is worn, like an overcoat; inside, Joe will still be himself. Joe insists that it be someone in good physical shape, because he wants to continue his boxing career. Joe keeps saying the body they find \"has to be in the pink\".\nAfter Joe turns down several \"candidates\", Mr. Jordan takes him to see the body of a crooked, extremely wealthy banker and investor named Bruce Farnsworth, who has just been drugged and drowned in a bathtub by his wife Julia (Rita Johnson) and his secretary, Tony Abbott (John Emery). Joe is reluctant to take over a life so unlike his previous one, but when he sees the murderous pair mockingly berating Miss Logan (Evelyn Keyes), the daughter of a financier who was sold worthless bonds by Farnsworth's bank, he changes his mind and agrees to take over Farnsworth's body.\nAs Farnsworth, Joe repays all the investors, including Miss Logan's father. He sends for Corkle and convinces him that he is Joe (by playing his saxophone just as badly as he did in his previous incarnation). With Farnsworth's money to smooth the way, Corkle trains him and arranges a bout with the current heavyweight champion, but Mr. Jordan returns to warn Joe that, while he is destined to be the champion, it cannot happen that way. Joe has just enough time to tell Miss Logan, with whom he's fallen in love, that if a stranger (especially if he is a boxer) approaches her, to give him a chance. Then he is shot by his secretary. The body is hidden, and Joe returns to a ghostly existence.\nAccompanied by Mr. Jordan, Joe finds that his replacement in the prizefight with the champ is a clean-cut, honest fighter named Murdoch, whom Joe knows and respects. Finding that he has forgotten his lucky saxophone, Joe runs back to the Farnsworth mansion to find that everyone believes Farnsworth has \"disappeared.\" Corkle has hired a private investigator to find him. Corkle explains about Joe, Mr. Jordan and the body-switching, but of course the police detective (Donald MacBride) thinks he is a nut. Joe manages to mentally nudge Corkle into turning on the radio to the fight and hears that Murdoch has collapsed without even being touched. Mr. Jordan reveals that the boxer was shot by gamblers because he refused to throw the fight. Joe takes over Murdoch's body and wins the title. Back at the mansion, Corkle hears one of the radio announcers mention a saxophone hanging by the ringside and realizes Joe has assumed Murdoch's body.\nCorkle races down to the dressing room. There, Joe passes along information from Mr. Jordan that Farnsworth's body is in a refrigerator in the basement of the mansion. Corkle tells the detective, who promptly has Mrs. Farnsworth and the secretary arrested. As Murdoch, Joe fires his old, crooked manager and hires Corkle. Mr. Jordan reveals to Joe that this is his destiny; he can be Murdoch and live his life.\nHealing the gunshot wound and at the same time removing Joe's memory of his past life, Mr. Jordan hangs around for a bit longer until Miss Logan arrives. She wanted to see Corkle, but runs into Murdoch instead. The pair feel they have met before. The two go off together, while Mr. Jordan smiles and says \"So long, champ.\""}