{"mid": "HeroesForSale", "IMDB_id": "tt0024115", "title": "Heroes for Sale", "plot": "A veteran of World War I, Thomas Holmes (Richard Barthelmess), struggles to make his way in civilian life in almost every way imaginable. In the opening scene of the movie, Tom and his friend are on a mission to gather intelligence by capturing a German soldier. Tom's friend, the banker's son Roger Winston (Gordon Westcott), in terror, refuses to leave the shell hole so Tom volunteers to go alone.\nHe captures a German but is apparently killed; in fact, he has only been wounded, and the Germans take him to their hospital to recover. His friend Roger Winston returns to the safety of American lines with the captured German soldier and is rewarded with a medal for it; his feeble efforts to refuse credit are dismissed as modesty, and he comes home a decorated hero. During Tom's captivity, German doctors treat his pain with morphine and he becomes addicted to the drug. After Tom returns from the war, Roger offers him a job at his father's bank out of shame.\nBut Tom's addiction costs him his job. Exposed as an addict, confined and cured in an asylum, he comes out in 1922, unemployed and alone; his mother has died, apparently of shame and grief, while he was away. Heading to Chicago, he happens upon an apartment over a diner, run by kindhearted Pop Dennis (Charlie Grapewin) and his daughter Mary (Aline MacMahon). Tom finds a job in a laundry, and a romance with Ruth Loring (Loretta Young). Always the go-getter, Tom makes good, better than the other drivers on his route, and earns a promotion. A fierce radical inventor (Robert Barrat) devises a machine that will make washing and drying clothes easier, and Tom induces his fellow employees to raise the money to pay for patenting it. The laundry company adopts the machinery, but only on Tom's stipulation that none of the workers at the plant lose their jobs because of it. Success and marriage are his. Then the president of the firm, the kindhearted Mr. Gibson (Grant Mitchell) dies. The new ownership decides to break the deal and automate the laundry, throwing most of its employees out of work, Tom included.\nFurious and resentful, the fired employees march on the plant to destroy the machines, as Tom does his best to stop them. In the riot with police that follows, Ruth is killed trying to find him, and he is arrested as a ringleader of the mob. Tom is put away for five years in prison; in the meantime, the invention he helped finance continues to sell nationwide, throwing countless other people out of work. When Tom gets out, it is 1932, the heart of the Depression. Unimaginably rich, he refuses to take the proceeds, which by now amount to over fifty thousand dollars. Instead, it goes to feed the endless line of hungry and jobless that come seeking a handout at the diner that Pop Dennis and Mary run. When \"Red Riots\" break out, the local city \"Red Squad\" arrests Tom and drives him out of town.\nWithout work, at the mercy of a society in which unemployed men are turned into hobos and every community orders them to keep moving on, Tom finds himself in one hobo shantytown, next to Roger, his old army comrade. Roger Winston, too, has been ruined; his father stole from the bank and when exposure came, killed himself. Roger served time in prison. Now neither of them has any prospect, any future. The difference is that Tom, in a stirring speech, asserts his faith that America can and will restore itself, that he can lick the Depression. Still driven on by authorities, with no prospect in sight, he marches ahead, determined that this is not the end. And back at the diner, the line of needy continues to stretch down the street, all of them being fed by the funds he provided, and on the wall a plaque honors him for his gift. The movie closes with his son looking at it and declaring to Mary that when he grows up, he means to be just like his Dad. The message is clear: a hero in war, Tom is a hero still."}