{"mid": "HeyGoodLookin", "IMDB_id": "tt0084070", "title": "Hey Good Lookin'", "plot": "In Brooklyn during the 1980s, a heavyset, middle-aged woman walks alone meets a mysterious man who greets her and shows her the remains of a black leather jacket. The woman sobs at the sight of it, and the man begins to tell a story.\nIn the 1950s, Vinnie is the leader of a gang named \"the Stompers\". His best friend, Crazy Shapiro, is subject to multiple murder attempts by Crazy's detective father, Solly. While in an old basketball court, Vinnie reunites with an old flame named Rozzie, but their reunion is abruptly interrupted by Rozzie's protective Jewish father, who chains her to her bed so she won't meet with Vinnie. Vinnie and Crazy spend the evening drinking, meet up with two prostitutes and go to sleep on the beach, waking up to find themselves close to a group of showering women and their mobster husbands. While Crazy inches over to the ladies, Vinnie finds a dead body buried in the sand. The screams of Vinnie and the women alert the mobsters, who beat up Crazy. It's later seen that Crazy has killed off the mobsters.\nVinnie runs off, finding himself on the black area of the beach where he bumps into rival gang leader Boogaloo Jones and his gang, the Chaplains. Boogaloo sets up a rumble between his gang and the Stompers. Vinnie later meets up with Roz and the girl Crazy dates, Eva; Crazy has meanwhile beaten all the mobsters. The four head out to a party, where Vinnie tells the Stompers that they are going to fight with the Chaplains, to which the gang responds negatively. Much of the gang and their girls head out to a rock and roll show. Vinnie is horrified at the idea of Crazy and himself having to fight the Chaplains alone. One of the Stompers named Sal and his girl have a run-in with Boogaloo while driving, and wind up in a car crash. Vinnie finally persuades the Stompers to rumble with the Chaplains.\nAt a drive-in restaurant, Vinnie and Crazy make out with their girls. When Roz spots a car that she thinks Boogaloo is in, Crazy is quick to drive off after it. Crazy ends up shooting two of the black gang members in an alley, much to Vinnie's shock. Solly investigates the death of the two black gang members. He questions Boogaloo, who tells him that he should be looking for the Stompers.\nCrazy and Roz are then seen at a pier. Rozzie tells him that Vinnie is ditching town, her and the rumble, which makes Crazy the leader of the Stompers. Disgusted with Vinnie's cowardice, Roz allows Crazy to make love to her in an abandoned warehouse. Solly interrupts, and fights Crazy to get him to talk. As he is losing, Crazy lies, saying Vinnie killed the gang members. Vinnie packs up his things and leaves, but bumps into the Stompers and in time for the rumble. As the two gangs wait for Boogaloo to show up, Solly drives up, ready to arrest Vinnie. On the rooftop of a nearby building, Crazy begins shooting randomly towards the street, causing both gangs to begin shooting at each other. Vinnie tries to run and is shot at by Solly. Crazy jumps off the rooftop, landing on Solly, killing himself and Solly. As Roz calls up a radio station to make a memorial request in honor of Vinnie, he stands up and walks away, leaving Brooklyn.\nAs the mysterious man finishes his story, he claims he left because he was heartbroken over the death of Crazy. The woman knows he is lying. She reveals that she is Roz, and that the man is Vinnie, returned after 30 years. Roz angrily berates him for abandoning her and the gang just to save his own skin. Roz tells him that her husband will soon come looking for her, and he hates to see her with another man. She gives Vinnie a second chance, if he will fight for her like she wished he did before. But she's bluffing. At first Vinnie imagines himself walking out on her again, but then embraces Roz telling her \"I've been waiting for you.\""}