{"mid": "HeyThereItsYogiBear", "IMDB_id": "tt0154587", "title": "Hey There, It's Yogi Bear", "plot": "Boo-Boo Bear wakes up from winter hibernation, excited about the new Spring. Then Yogi Bear wakes up, his only interest finding some food to eat. Cindy Bear unsuccessfully tries to woo Yogi. After Ranger Smith thwarts Yogi's latest attempts to grab some food, Yogi gets angry and convinces Ranger to transfer him out of Jellystone National Park. Smith prepares Yogi to be sent over to the San Diego Zoo along with an identification tag. Yogi first says goodbye to everything, but tricks another bear named Corn Pone into going to California instead of him and Boo-Boo and Cindy remain unaware of this, thinking Yogi departed for good.\nSoon, Yogi is stealing food from all over the park under the alter ego \"The Brown Phantom\", but Smith believes it is another bear. He threatens whoever it is to be sent to the zoo. Cindy, wishing to be with Yogi at the zoo, angers Smith into mistakenly sending her away. However, she gets sent to the St. Louis Zoo instead, as the San Diego Zoo doesn't need anymore bears. When she realizes her true destination, she gets very sad, crying since she knows she'd be far from Yogi now.\nLate that night, Cindy falls out of the train and becomes lost. A traveling circus is looking for a great act to raise their ratings, when suddenly, their dog runs off and scares Cindy into walking on the telephone wires, the perfect opportunity for the circus.\nYogi has recently missed Boo-Boo and above all Cindy. Yogi goes to Ranger Smith and hears about her disappearance. Soon, Yogi and Boo-Boo escape from Jellystone to find Cindy. Meanwhile, Ranger Smith decides to let them find their way home to avoid trouble with the commissioner. After an extensive travel, Yogi and Boo-Boo locate Cindy, who is being kept a prisoner for the greedy manager's nest egg. As Yogi confronts the manager, he is made to join the circus, too. Boo-Boo releases Yogi and Cindy and they make their exit. As they make their way home, they crash a barnyard party somehow escaping afloat a river with the barn's door. Then, while Cindy & Yogi dream about a honeymoon in Venice, they find themselves suddenly being chased and hunted by the police, as they somehow became fugitives, but make their escape.\nThey hitch a ride, but find themselves in the middle of a busy city and make a run from the police to the top of a hotel and across to a high rise under construction. The next morning, Ranger Smith sees the three bears on television and decides to pick them up in a helicopter. All the commotions have made a great publicity for Jellystone and Ranger Smith gets promoted to Chief Ranger."}