{"mid": "HighVoltage", "IMDB_id": "tt0129992", "title": "High Voltage", "plot": "The film begins with a bus driving along a snow-covered roadway in the Sierra Nevada between Nevada City, California, and Reno, Nevada. Soon the vehicle gets hopelessly stuck in deep snow forty miles from the nearest town. Needing shelter, the driver \"Gus\" (Billy Bevan) and his four passengers find refuge in an isolated one-room log church. The passengers include \"Billie\" (Carole Lombard), who is an escaped criminal being escorted back to jail in New York by a deputy sheriff, \"Dan Egan\" (Owen Moore); a young woman, \"The Kid,\" (Diane Ellis) on her way to Chicago to meet her boyfriend; and \"Hickerson,\" a pompous, ill-tempered banker. In the church the group finds \"Bill\" (William Boyd), a self-described \"hobo,\" who had found shelter there earlier. Tensions quickly arise in the group over their general plight, petty jealousies, and concerns about how six people are going to share the small supply of food that Bill had brought with him.\nAfter a few days being stranded, the group sees a passing mail plane high in the sky. They try to attract the pilot's attention, but he is too far away to see them. More days pass, and the group continues to ration their dwindling supplies and battle the subfreezing temperatures. To keep warm they begin to break up the church's pews and other furnishings to use as firewood in the room's potbelly stove. The group's desperation intensifies, as does a romance between Bill and Billie. Soon Bill confides to her that he too is a wanted criminal, a fugitive from Saint Paul, Minnesota. As conditions worsen, The Kid collapses from hunger and become delirious; and the church's interior becomes almost bare as more furnishings--even the church's pulpit and pump organ--are consigned to the stove. Bill and Billie finally commit to leaving to avoid being imprisoned if the group is somehow rescued. They quietly depart during the night, hoping to reach a ranger station ten miles away. Everyone else is sleeping except Dan, the deputy sheriff, who sees the two leaving; but he does nothing to stop them. After walking a short distance through snowdrifts, Bill and Billie hear and then see a search plane slowly circling overhead at low altitude. Realizing that the others inside the church will not hear the plane's engine, they rush back and awaken them. The group hurriedly builds a signal fire, which the plane's pilot sees. He parachutes a box of provisions to them with a note saying that help will be sent immediately.\nThe next day the group sees a rescue party heading toward the church. While awaiting their rescuers, Dan observes Bill and Billie sitting together on the floor. From his coat pocket Dan pulls out Billie's extradition papers and a \"wanted\" notice that includes a photograph of Bill and information about his being a fugitive from Saint Paul. Dan walks over to the stove, now cold from no fires, and tosses both papers into it. Bill and Billie see him discard the papers, and they look at one another. Bill then gets up, retrieves the papers from the stove, gives them back to Dan, and asks him to drop him off in Saint Paul on his way back to New York with Billie."}