{"mid": "HighRise", "IMDB_id": "tt0462335", "title": "High-Rise", "plot": "Following his divorce, doctor and medical school lecturer Robert Laing moves into his new apartment on the 25th floor of a recently completed high-rise building on the outskirts of London. The tower block provides its affluent tenants all the conveniences and commodities that modern life has to offer: a supermarket, bank, restaurant, hair salon, swimming pools, a gymnasium, its own school, and high-speed elevators. Its cutting-edge amenities allow the occupants to gradually become disinterested in the outside world, providing them with accommodations and their own secure environments inside.\nLaing meets fellow tenants Charlotte Melville, a secretary who lives one floor above him, and Richard Wilder, a documentary film-maker who lives with his family on the building's lower floors. Life in the high-rise begins to degenerate quickly, as minor power failures and petty grievances among neighbours and rival floors escalate into an orgy of violence. Soon skirmishes are being fought throughout the building, as floors try to claim elevators and hold them for their own. Groups gather to defend their rights to the swimming pools and party-goers attack \"enemy floors\" to raid and vandalize them. The lower, middle, and upper floors of the building gradually stratify into distinct groups.\nIt does not take long for the occupants of the entire building to abandon all social restraints, abandoning life outside the building and devoting their time to the escalation of violence inside; people abandon their jobs and families and stay indoors permanently, losing all sense of time. As the amenities of the high-rise break down and bodies begin to pile up, no one considers leaving or alerting the authorities, instead exploring the new urges and desires allowed by the building's disintegration. As Laing navigates the new environment, Wilder sets out to reach the top of the building's 40 floors and finally confront the building's architect, Anthony Royal."}