{"mid": "HighlanderIITheQuickening", "IMDB_id": "tt0102034", "title": "Highlander II: The Quickening", "plot": "In August 1994, news broadcasts announce that the ozone layer is fading, and will be completely gone in a matter of months. In Africa, millions have perished from the effects of unfiltered sunlight. Among the dead is Connor MacLeod's wife, Brenda Wyatt MacLeod. Before dying, Brenda extracts a promise from Connor that he will solve the problem of the ozone layer.\nBy 1999, Connor MacLeod becomes the supervisor of a scientific team headed by Dr. Allan Neyman, which attempts to create an electromagnetic shield to cover the planet, and protect it from the Sun’s radiation. The team succeeds, in effect giving Earth an artificial ozone layer. MacLeod and Neyman are proud to have saved humanity, and believe they will be remembered for a thousand years.\nThe shield has the side effect of condemning the planet to a state of constant night, a high average global temperature, and high humidity. By 2024, the years of darkness have caused humanity to lose hope and fall into a decline. The shield has fallen under the control of the Shield Corporation. The corporation’s current chief executive, David Blake, is focused on profit, and is imposing fees for the corporation’s services. A number of terrorist groups have begun trying to take down the Shield, among them Louise Marcus, a former employee of the Shield Corporation.\nMeanwhile, MacLeod, now a frail old man, expects to eventually die of natural causes. As he watches a performance of Wagner’s Götterdämmerung, an image of Juan Sanchez Villa-Lobos Ramirez appears, and induces MacLeod to recall a forgotten event of his past. On the planet Zeist, a last meeting is held between the members of a rebellion against the rule of General Katana. The rebellion’s leader, Ramirez, chooses \"a man of great destiny\" from among them—MacLeod—to carry out a mission against Katana. At this moment, Katana and his troops attack, crushing the rebellion. Katana orders his men to capture Ramirez and MacLeod alive and kill the rest of the rebels. The two captives are put on trial by Zeist's priests, who sentence them to be exiled and reborn on Earth in pursuit of \"The Prize.\" Winning the Prize gives the victor the choice to either grow old and die on Earth, or to return to Zeist. Katana is unsatisfied with their decision, but the sentence is executed, leading to the events of the original 1986 film.\nBack in 2024, Louise Marcus discovers that the ozone layer has in fact restored itself naturally, which means that the shield is no longer needed. The Shield Corporation is aware of this development, but has chosen to hide it from the general public in order to maintain its main source of profit. Meanwhile, on Zeist, Katana decides that MacLeod cannot be allowed to return, and sends his immortal henchmen, Corda and Reno, to kill him.\nMarcus manages to reach MacLeod first, and asks for his help in taking down the Shield. To her disappointment, she finds the passionate person she once admired has grown into a tired old man. MacLeod explains to her that he is dying and expresses his disapproval of terrorism. Before they can finish their conversation, Corda and Reno attack. MacLeod manages to decapitate them both, absorbs their energy during the Quickening, and regains his youthful appearance. In the process, MacLeod summons Ramirez back to life.\nIn Glencoe, Scotland - the location of his death in the first Highlander film - Ramirez is revived. He finds himself on a theatrical stage during a performance of William Shakespeare's Hamlet. Meanwhile, MacLeod has found a new lover in Marcus. He attempts unsuccessfully to explain to her the concepts of his immortality. Elsewhere, General Katana arrives in New York, the scene of The Gathering and begins wreaking havoc.\nBoth Ramirez and Katana soon adapt to their new environment. Ramirez’s earring is apparently valuable enough to pay both for a new suit he acquires from the finest and oldest tailor’s shop in Scotland, and for an airplane ticket to New York City. Katana finds New York much to his liking. After entertaining himself for a while, Katana encounters MacLeod at a church. Since immortals are forbidden from fighting on holy ground, they do not fight each other, but MacLeod expresses rage at being immortal once again.\nSoon thereafter, MacLeod is contacted by Ramirez, who joins them in their plan to take down the Shield. Katana, expecting this, forges an uneasy alliance with David Blake, who mentions that shutting down the planetary shield would require so much energy that the planet would be destroyed. The conflict between the two sets of allies eventually leads to the deaths of Dr. Allan Neyman, Ramirez, Blake and General Katana himself. MacLeod succeeds in taking down the Shield by using the combined energies of his final Quickening from General Katana. Marcus sees the stars for the first time in her life. MacLeod then claims The Prize by returning to Zeist with Marcus."}