{"mid": "Himiko", "IMDB_id": "tt0071609", "title": "Himiko", "plot": "In an unnamed forest, a group of women with white-painted faces and robes wander to a ritual site. One of the women, Himiko, the shaman and translator of the Sun God, lies on the ground while another holds a bronze mirror up which reflects the sun's light. Himiko starts to convulse and moan, imitating an orgasm which symbolizes the Sun God penetrating her body. We see several different tribes, one of the Land People, and one of the Mountain People. The Mountain People are a raggedy, unsightly group, all conjoined together by a single rope, and donned with haunting makeup consisting of heavy paint, cobwebs and strings. They wander around the mountain like insects, twitching and in almost no control of their own limbs and muscles. A lone traveler appears, named Takehiko, from the far side of the mountain and enters the forest.\nHimiko spends her days weaving cloth on a loom. She hears of Takehiko's arrival and it pleases her. In a ritual, the king of the Sun-God People, Ohkimi, holds a meeting to discuss the visions of the Sun God seen by Himiko. He also discusses the possibility of Mimaki as his own successor to the throne. Mimaki is pleased at this, but Nashime, servant to Himiko, believes that Himiko will be the successor herself, as direct orders from the Sun God. Mimaki is suspicious of this. He confides in his brother Ikume and King Ohkimi and tells them that Himiko might be losing her ability to communicate properly with the Sun God. That her love for Takehiko, a sympathizer of the Land God People, is not allowing her to translate the Sun God's words properly. Mimaki also states that he believes the Land God and the Mountain God are false Gods because they believe that God is in all things and any human being and living creature is able to communicate with God, and the only way for the Sun God People's kingdom to prosper is to take over the Mountain and Land People's kingdoms and force them to believe in only the Sun God. Anyone who resists will be killed.\nIn the forest, during a ritual, Himiko sees Takehiko hiding behind a tree, and engages in conversation with him. Nearby, Adahime, one of Himiko's assistants in the ritual, over hears them. Takehiko comes to the kingdom of the Sun-God people and meets Himiko in her quarters after dark. Himiko reveals that Takehiko is her half-brother. Despite this, she seduces him and they have sex. Adahime is not far away, and watches them from behind a pillar. During a ritual in the king's court the next night, Himiko addresses the court subjects of the Sun God's wishes. She states that the Sun God requires the people of the kingdom to also accept the Land God and the Mountain God as valid Gods. This shocks the people of the court. King Ohkimi refuses to believe that this is true. He restates Mimaki's assertion from earlier, that Himiko has lost her powers to speak with the Sun God, and her statement is solely out of her love for Takehiko, who is a sympathizer of the Land God People. Believing that Himiko is not wrong in her assertion, her assistant Nashime assassinates the king while the subjects are all distracted by Himiko's speech. King Ohkimi falls and Himiko takes over rule of the Sun God People. She orders anyone who did not believe in the Sun God's words that she would be ruler to be buried alive in the mountains.\nThe next night, Himiko and Takehiko again sleep together, but Takehiko is resistant to stay with her. Himiko tries to gain Takehiko's favor by offering him a cloth that she knitted. He accepts but leaves her anyway. Adahime follows him and meets him by a lake. She professes her love to him, pleading him to make love to her. After resisting, he eventually obliges. Himiko is horrified to know that her lover has been with another woman, and orders his arrest. Takehiko is captured in the mountains and brought back to the Kingdom of the Sun God. There, Himiko banishes him, but orders her subjects to first rip out all of his fingernails and tattoo his face in colors of shame. Takehiko leaves the kingdom bloody and in pain. The Mountain God People carry him up the mountain where Adahime reunites with him.\nBack in the Sun God Kingdom, Nashime consoles a broken Himiko, who feels betrayed and unloved. Himiko proceeds to perform oral sex on Nashime. Meanwhile, Mimaki and Ikume conspire to take power away from Himiko, who they still believe is not acting on the Sun God's behalf, but rather through her own love. They do their best to convince Nashime, and he eventually succumbs to the belief that Himiko has lost her powers, and he keeps her stashed away in her room and Mimaki takes the throne as the leader of the Sun God People. Nashime then tells Mimaki that the young girl Toyo will take Himiko's place as the shaman and translator of the Sun God.\nMimaki declares war on the Land and Mountain God People. The battle between the kingdoms wages in a field. Takehiko and Adahime decide to run away to be together forever, but they are ambushed in the forest by Mimaki's soldiers who pierce them with arrows. Takehiko and Adehime's corpses are brought back to the Sun God People's Kingdom to show to Himiko. She is angered and sad. Nashime again tries to console her, but she tells him to leave. Nashime realizes that Himiko has lost all her powers and possibly her mind too. While she is knitting cloth, the Mountain God People kidnap her from her room and torture her. She calls out for Nashime's help, but he only watches and cries. Himiko dies and Nashime's falls into depression, crying out in the mountains for her. Ikume and Mimaki are shown battling with swords on a ridge, and Mimaki kills Ikume.\nMimaki has a court ritual in which the new translator, Toyo, comes and declares the Sun God is still within Himiko. Mimaki is disturbed by this. Nashime breaks down crying. The film flashes forward several years, and Nashime is walking in the forest, old and fragile, still crying over Himiko. He looks up and sees a helicopter. The camera pans out of the forest to reveal that it is atop a kofun, or ancient keyhole-shaped burial mound, surrounded by a suburban neighborhood with offices, houses, factories and a highway, revealing the film as a mythical fable shrouded from, yet within, modern times. The credits roll with aerial shots of more ancient tumuli and their modern surroundings."}