{"mid": "Hisss", "IMDB_id": "tt1244093", "title": "Hisss", "plot": "The story begins in Natchi, a small town in Kerala, India. American George States (Jeff Doucette) is suffering from the last stage of brain cancer and has only six months to live. To prevent death and gain immortality, he decides to extract the 'Nagmani' from a nagin, a shape-shifting snake that can morph into a human. He captures the nag (the male snake) so that the nagin (the female) comes after the capturer to free her lover, thus allowing him to obtain the nagmani by force. He keeps the nag in a glass box where he electrocutes and tortures him. His plan works and the nagin starts following him.\nThe nagin transforms into a beautiful woman (Mallika Sherawat), and is later helped by a police inspector (Irrfan Khan) and his wife (Divya Dutta), who is infertile, causing a strain in their relationship. The nagin helps a few women who are helpless: One who is beaten mercilessly by her husband; one being raped by a man, and so on. She brutally murders those men who were involved in the capture of her mate as well as men who torture women. The police inspector who is trying to help her find her mate investigates the murders. Finally, she reaches George's hideout where she reclaims her mate and they have sex, leading to the nagin becoming pregnant. George attempts to capture the nagin during intercourse since this is when she will be at her most vulnerable.\nWearing a suit that hides his heat signature, he lures her by using her dying mate as bait to a trap. He captures her and tries taking the nagmani but at that moment, the police inspector arrives and helps her. Angered by the death of her mate by the hands of George, she transforms into a half snake, half human creature and throws him in the glass box where her mate was kept and electrocutes him. The police inspector and his wife later welcome their new baby into the world. The nagin, back in the form of a beautiful woman, also gives birth to her new snake babies."}