{"mid": "HistoryIsMadeAtNight", "IMDB_id": "tt0170107", "title": "History Is Made at Night", "plot": "Irene Vail (Jean Arthur) decides to divorce her husband, the rich ship owner Bruce Vail (Colin Clive), after he falsely accuses her of having an affair. Bitterly jealous and possessive of Irene, Vail learns that he can prevent the divorce from being finalized if he can provide evidence that she has been involved with another man within six months of filing for divorce. Vail pays his driver, Michael (Ivan Lebedeff), to go to Irene's hotel room in Paris and pretend to be her lover, with the intention of having a private detective catch them in a compromising position. However, an unknown man overhears Irene's startled cry upon finding Michael in her room. A struggle ensues when the man defends Irene against Michael's unwanted advances, and ends with Michael on the floor, unconscious. When Vail and the detective burst into the room, the man threatens them with a gun, demands Irene's jewelry, and takes Irene hostage.\nOnce they are away, the intruder, Paul Dumond (Charles Boyer), returns Irene's jewelry and invites her to dine with him at the Château Bleu restaurant, where he works as a waiter. They dance the night away and Irene falls madly in love with the charming and handsome Paul. In the morning, Irene returns to find Vail and the police in her room, for Michael is dead. Vail leads her to believe that Paul is responsible for his death, and blackmails her into coming back to America with him in exchange for Paul's freedom. Distraught that he is unable to find Irene, Paul reads in the newspaper that Irene has reunited with her husband and left for America. Sensing something is wrong, he embarks for the United States to find her, accompanied by Cesare (Leo Carrillo), his good friend and head chef of Château Bleu.\nIn Manhattan, Paul and Cesare rehabilitate a restaurant, with the hope that its reputation will cause Irene to come to dine. The reunion takes place at last, but the happiness is short-lived when Paul learns that Michael is dead and a man has been arrested in Paris for the murder. Unwilling to let an innocent man pay for what he thinks is his crime, Paul embarks for Paris, and Irene joins him. They travel on the liner Princess Irene, which is owned by Vail.\nVail learns they are on the ship. In a rage, he radios orders to the captain to run at full speed, despite the danger of collision with an iceberg in the poor weather conditions, supposedly to break the record for fastest crossing. He actually hopes the ship will be sunk, killing Paul and Irene. The ship does strike an iceberg, and premature news reports state that the ship has sunk with horrendous loss of life. Consumed by guilt, Vail commits suicide and confesses to killing Michael in a suicide note. But the Princess Irene's bulkhead doors manage to hold the water and prevent the ship from sinking. There is no loss of life, and Paul and Irene and the other passengers rejoice when they hear the news. They also learn that other ships are coming to their aid to help the crippled liner."}