{"mid": "HoboWithAShotgun", "IMDB_id": "tt1640459", "title": "Hobo with a Shotgun", "plot": "A hobo arrives by boxcar in Hope Town, its welcome sign repainted to read \"Scum Town\". The town is ruled by \"The Drake\" and his sadistic sons Ivan and Slick. The Hobo sees an amateur film maker shooting a \"Bumfight\" movie. As he pushes his shopping cart through the streets, a bloodied man screams for assistance. Two cars approach the man, revealing The Drake and his sons. The man is revealed to be Logan, The Drake's younger brother. The Drake explains to the townspeople that his brother is a traitor and will be made example of. He proceeds to publicly decapitate Logan with a barbed-wire noose.\nThe Hobo sees a lawnmower in a pawn shop. Wishing to buy it, he starts begging for change on a sidewalk. He sees a group of punks drag a homeless man into The Drake's night club. Ivan and Slick enter the building and he follows them in. Inside, the brothers, along with their henchmen, torture and kill homeless people in demented arcade style games. Slick begins harassing a boy named Otis, who owes him money. A prostitute named Abby attempts to intervene, angering Slick. Ivan snaps Otis' arm. Slick then propositions the hooker, gets her outside, then prepares to kill her. The Hobo intervenes, knocks Slick unconscious and carries him to the police station.\nAt the station, he learns of the police chief's corruption and complicity with criminal activities and he hate hobos and the others cops hate hobos also. Ivan enters the station and, along with the chief, restrains The Hobo. Slick then joins the two, roughs up The Hobo and carves the word \"scum\" onto his chest. The Hobo is then thrown into a garbage bin by the chief and the another cop. He stumbles across Abby, who takes him to her apartment and tends to his wounds. The next day, The Hobo goes to the amateur filmmaker seen earlier to make money. Upon completing a series of degrading acts, including chewing glass, he earns enough money to purchase the lawnmower. At the pawnshop, a trio of robbers enter and take a woman and her baby hostage. The Hobo grabs a shotgun from the shelf and kills the robbers. Realizing that Hope Town needs justice, he chooses the shotgun, which costs the same as the lawnmower. He buys the gun and kills dozens of criminals, including the filmmaker, a pimp, a coke lord and a pedophile dressed as Santa Claus.\nThe Drake, infuriated, sets loose Ivan and Slick. The two burn a school bus filled with children to terrorize people because the kids like hobos. Afterwards, they bursts into a television studio during a live news broadcast, kill the anchorman who like the hobo and demand that all homeless people be killed. The Drake then joins them and requests The Hobo be brought to him. The town is plunged into anarchy as a mass genocide of the towns vagrants begins.\nAs Abby is walking home, a corrupt cop attempts to rape her, but The Hobo kills him. The gunshots alert a nearby group, who rush to investigate. Abby smuggles The Hobo past them in a shopping cart covered with the dead cop's remains. The pair are spotted by Otis, who informs Slick and Ivan. Back at her apartment, The Hobo tells Abby of his plan to start a lawnmowing business, which she enthusiastically supports. Ivan and Slick enter the apartment and attack the two, wounding Abby. The Hobo overpowers Slick and holds him at gunpoint, then forces Ivan to leave. The Hobo then shoots Slick in the groin, and takes Abby to the hospital. Slick gets to a payphone and calls The Drake. He is then dragged down to hell in a demonic, perpetually burning schoolbus. The Drake, mourning the death of his favorite son, resolves to take The Hobo down. He summons \"The Plague\", a duo of armor-clad demons: Rip and Grinder. While Abby is recovering, The Hobo visits the maternity ward and monologues to the babies. When he returns to Abby's room, The Plague capture and deliver him to The Drake, who plans to publicly execute him.\nAbby, having recovered, returns to the pawn shop for weapons. She attaches an axe to The Hobo's shotgun and turns the lawnmower into a shield. She then rallies a crowd to free The Hobo and bring down The Drake. Abby holds Ivan hostage and confronts The Drake. However, he shoots his son and denounces him as a disappointment. In the ensuing fight, she manages to kill Grinder. The Drake then severs her hand with the lawnmower shield, but she stabs him repeatedly with her exposed arm bone, incapacitating him. Rip tries to persuade Abby to replace Grinder as his partner, but The Hobo drives him off.\nThe Hobo spots The Drake crawling away to safety and prepares to execute him, but is interrupted by the corrupt police. The townspeople, motivated by Abby, stand up against the police. Not wishing to let innocent people die for him, The Hobo ends the stalemate by killing The Drake, and is gunned down by the police as Abby screams. The townspeople respond by shooting and killing all the corrupt police.\nIn an extended ending that was cut from the final film, Abby's hand is replaced by several shotguns as she becomes part of The Plague."}