{"mid": "Holiday", "IMDB_id": "tt0461062", "title": "Holiday", "plot": "Iris Simpkins (Kate Winslet), a society columnist for The Daily Telegraph in London, has been in love with Jasper Bloom (Rufus Sewell) for over three years, despite his infidelities and the fact they have broken up some time previously. When she learns at a company Christmas party that he is engaged to be married, Iris despairs over the state of affairs in her life. Meanwhile, Amanda Woods (Cameron Diaz), a workaholic in Los Angeles who owns a company that produces movie trailers, discovers that her boyfriend, Ethan Ebbers (Edward Burns), has been cheating on her with his 24-year-old secretary. On the spur of the moment she decides to get away for the Christmas holidays and visits a home-exchange website on which Iris has listed her \"quaint cottage in Surrey.\" Amanda contacts Iris, and the two women quickly agree to swap homes for two weeks.\nWhile Iris revels in the luxury of Amanda's Los Angeles home, Amanda is disappointed by the slow, quiet pace of life in Iris's Surrey cottage. Amanda grows bored after just a few hours and books a flight home for the next day. Later that night, Iris's brother, Graham (Jude Law), knocks at the door thinking Iris is home. Graham asks Amanda to let him spend the night despite the fact that he is a stranger, as he has been drinking at the pub and doesn't want to drive. Because of the obvious chemistry between them, they end up sleeping together.\nIn the morning, Graham receives phone calls from Sophie and Olivia, which arouse Amanda's suspicions that Graham has girlfriends. Graham, knowing that Amanda is planning to return home imminently, says to Amanda that \"if the flight gets cancelled, [he is] having dinner at the pub\" with friends. At the airport Amanda decides to stay and goes to the pub. Graham enters the pub and looks for her but cannot see her until he meets his friends and then sees Amanda. Amanda drinks far too much that night, and Graham agrees to stay the night with her. The next day Graham suggests they go to lunch to get to know one another better. During lunch, Amanda shares with Graham that her parents divorced when she was fifteen and since then she has been unable to cry. Graham tells her that he cries all the time: movies, books, and birthday cards. He also reveals himself to be a book editor. While obviously enjoying each other's company, Amanda is nonetheless worried that the relationship will become \"complicated.\"\nMeanwhile, Iris is enjoying her stay at Amanda's house. She meets Ethan's friend Miles (Jack Black) when he comes with his girlfriend Maggie (Shannyn Sossamon) to Amanda's house. Later, she meets an elderly neighbour named Arthur Abbott (Eli Wallach), standing lost at the corner, and she escorts him home. She learns that he was a screenwriter during the Golden Age of Hollywood. The two become fast friends. Arthur notes that Iris's relationship with Jasper is not serving her well, and he suggests movies for her to watch that include strong female characters, in hopes that she can acquire what he calls \"gumption.\"\nAmanda chooses not to see Graham again but, alone again in the cottage, she has a change of heart and surprises Graham at his house. He looks uncomfortable at the door, Amanda asks Graham whether he is alone, and he says he isn't. Before she can turn away, Olivia and Sophie come to the door, revealing that they are Graham's young daughters. Inside the house, Amanda asks Graham in a whisper if he is married. He says no, revealing that his wife died two years earlier. Amanda asks him why he did not reveal the existence of his daughters to her during their lunch, and Graham explains that he doesn't usually tell women about them because he doesn't know how to date women while also being a dad. Amanda gets along beautifully with Sophie and Olivia, making Graham consider how Amanda might fit into his family life.\nIris discovers that the Screenwriters' Guild wants to throw a grand celebration in Arthur's honor, but he is reluctant to attend for several reasons, chief among them being that he cannot walk without the assistance of his walker, and does not want to embarrass himself on stage. Iris encourages him to go because it's a tremendous honor for him, and promises to help him prepare to attend the award function with her. She undertakes an exercise program with him, determined to help him walk without his walker. During this time Jasper contacts her, asking her to assist with the book he is writing. She agrees to look over his pages, but ends up having so much fun that she doesn't have the time.\nIris and Miles have slowly become friends, and one night go to the video store to rent some other films that Arthur had recommended. From the video store, Miles sees his girlfriend Maggie in the arms of another guy. He is shocked, as she told him that she was in Santa Fe on an extended film shoot and would not be in L.A. on Christmas Eve. He runs out of the store to confront Maggie and realizes that she has been cheating on him. Iris and Miles then return to Amanda's house, where they discuss their tendencies to fall for people that they know are wrong for them, and they begin to bond with each other. Shortly afterwards Miles and Iris are eating lunch together, and Maggie calls Miles wanting to see him. Miles leaves to see her, but promises to come to Arthur's award ceremony that night. Iris returns to Amanda's house, and is later surprised to find Jasper at her doorstep. Iris is touched at first, but then asks if he is still engaged. When he responds that he is, she finally realizes he is no good for her and breaks up with him for good. Meanwhile, Maggie tries in vain to convince Miles to forgive her. He realizes that Maggie was never meant for him, ends his relationship with her for good and rushes to attend Arthur's award ceremony.\nIris and Arthur arrive at the ceremony and are pleasantly surprised to find that, despite Arthur's fears that the ceremony would be sparsely attended, the hall is filled with attendees standing and applauding his achievements. That, and the music that Miles wrote especially for Arthur for this moment, give him the confidence to walk onto the stage unassisted. Miles arrives and asks Iris for a date on New Year's Eve. Iris responds that she will be back in England by then; Miles replies \"I've never been to England.\" Iris responds that she would love to spend the evening with Miles. Meanwhile, Graham confesses his love for Amanda on the night before she is scheduled to depart, but Amanda is still doubtful that a long-distance relationship will work. On her way to the airport, she cries for the first time since she was fifteen years old, and returns to the house to find Graham crying, too. Amanda tells him that she has decided to stay to spend New Year's Eve with him, and they embrace. Iris and Miles celebrate the new year with Amanda and Graham and his daughters, enjoying the evening, and laughing and dancing together."}