{"mid": "HollywoodStepsOut", "IMDB_id": "tt0033724", "title": "Hollywood Steps Out", "plot": "A large bird's-eye view of Los Angeles is shown with searchlights moving to a conga beat. The action takes place in the famed Ciro's nightclub, where the Hollywood stars are having dinner — at $50 ($814.14 today) a plate and \"easy terms\". The first stars seen are Claudette Colbert, Don Ameche, and, at a table behind them, Adolphe Menjou and Norma Shearer, followed by Cary Grant, seated alone. Grant talks to himself: \"What a place! What a place! It's as pretty as a picture. But if I ever told my favorite wife the awful truth I'd land right on the front page. Yessireee Bobby.\" (All these jokes are references to some of his films, although The Front Page was retitled His Girl Friday after it was mostly completed.)\nThen Greta Garbo comes along selling \"cigars, cigarettes, butts.\" Grant buys some, tossing a quarter ($4.07 today) into her tray and asks her for a light. She lifts her enormous foot on the table and strikes a match on her shoe, then lights his cigarette. (In real life she had an average women's shoe size 8, but her penchant for wearing mannish footwear in public and house slippers on film sets led to a popular myth of her possessing very large feet, and this was caricatured repeatedly in Warner Brothers cartoons of the era.)\nIn the next scene Edward G. Robinson asks Ann Sheridan, \"How's the Oomph girl tonight?\" She responds by uttering the word \"Oomph\" several times. Her final \"Oomph\" surprises him. (She was a sex symbol known as the \"Oomph\" girl in those years.)\nThe camera then tracks past some tables: the first one has Henry Binder and Leon Schlesinger sitting there as an in-joke, while the soundtrack quotes \"Merrily We Roll Along\" — the theme to the Merrie Melodies series. (Schlesinger was producer for the Looney Tunes cartoons and Binder was his assistant.) The camera shows some other tables which are reserved for people: Bette Davis, a large sofa for Kate Smith (a well known singer at the time, noted for her ample girth), and the last table is reserved for comic strip (and movie and radio) characters: Blondie, Dagwood, and Baby Dumpling, with a fire hydrant for Daisy the dog.\nMeanwhile, in the cloakroom Johnny Weissmuller has arrived. He leaves his overcoat behind to reveal his Tarzan outfit, with the single addition of tuxedo collar and black tie. Sally Rand (famous for her striptease acts and fan dance), leaves her trademark feather \"fans\" behind and leaves presumably naked, as only her hands are seen and not her entire torso.\nIn the next scene James Cagney informs Humphrey Bogart and George Raft that they must prepare to do something risky. They, all known for their \"tough guy\" roles, get ready, turn, and start pitching pennies. Harpo Marx, usually the prankster in the Marx Brothers films, sticks some matches under Garbo's foot, then lights them. She reacts very slowly and coolly to the pain, a parallel to her serene and cool acting style by slowly saying, \"Ouuchhh.\" Then Clark Gable spots a girl, whom he follows with his head turning around 180 degrees (He was known for his womanizing).\nAfter this, Bing Crosby announces the first act that evening. During his speech he is interrupted by a jockey on a race horse (a reference to his fondness for horse racing — he owned several race horses — and his lack of luck in that sport. Jokes about his horse racing passion would be referred to in other Warner Brothers cartoons as well, such as Porky's Preview and The Old Grey Hare). He then introduces the first musical number by conductor Leopold Stokowski. Stokowski, seen with a snood containing his long hair, prepares himself dramatically and seriously to conducting what looks to be a classical orchestral arrangement. However, it's the conga \"Ahí, viene la conga\" that he conducts, moving rhythmically to the beat as he does so.\nThe beat \"does something\" to Dorothy Lamour, who is seen sitting at a table with James Stewart. She begs him to go dancing with her. He starts stuttering and hesitating, but in the end agrees to follow her to the dance floor. (He was known for his \"shy guy\" type roles.) When she stands up, revealing her outfit to be a very short sarong and moves her body to the beat, he gets scared and runs away, leaving a sign reading \"Mr. Smith Goes to Washington,\" the title of one of his best-known films at that time.\nThe next shot shows Gable again, moving to the beat and at the same time following the girl he saw earlier.\nTyrone Power dances with Sonja Henie, known for her ice-skating movies, who is still wearing her ice skates. Frankenstein's monster is dancing very stiffly and woodenly. The Three Stooges poke and smash each other in rhythm to the beat, a reference to their famous \"poke in the eye\" slapstick films. Oliver Hardy dances with someone as well and is shown from the back. When he turns his face to the camera he is revealed to be dancing with two girls at the same time; a double reference to his \"ladies man\" routine within the Laurel and Hardy series and also to his obesity. Cesar Romero, known for his roles as a Latin lover, dances with Rita Hayworth in another send-up or tease. They are shown in the long shot to be dancing clumsily with almost no coordination. In reality, they were considered to be two of Hollywood's finest dancers.\nThe camera then cuts to Mickey Rooney and Judy Garland sitting at a table. The waiter brings an expensive bill, which shocks Rooney. He asks his \"father\", Judge Hardy (Lewis Stone), for a favor. In the next scene they are seen washing the dishes to the conga beat. This is a reference to the Andy Hardy film series in which Rooney played the small town boy who always got into trouble with money and girls. Stone played his father, Judge Hardy; Garland played his girlfriend.\nGable is shown still following the girl, giving an aside to the audience: \"Don't go away folks, this oughta be good!\" Crosby then introduces the final act, again interrupted by the same jockey on his race horse. Sally Rand (identified as \"Sally Strand\") performs the bubble dance to \"I'm Forever Blowing Bubbles\" in complete nudity, which is never seen, although areas of her torso are revealed. She is shown standing with a large bright white bubble (it is never revealed how she got one like that, let alone whether she brought it in, or if it's a night club prop she borrowed) held in front of her nude body center stage in a dim place, with a bright light shining on her to signal the start of the dance. Instead of throwing the bubble around and doing spins and twists like she does in another short, she performs the dance by walking around the stage and manipulating the bubble in front of her nude body.\nDuring the bubble dance, several celebrities in the audience react to the dance in different ways. Kay Kyser (a well-known band leader at the time, nicknamed \"The Professor\" because he and his band were featured on radio's \"The Kollege Of Musical Knowledge\") is shown dressed in his \"Professor\" square academic cap. He is excited by the act and shouts out, \"Students!\", which was his catchphrase on the radio show: Whenever a contestant missed an answer, he called out to his audience for the correct answer. A group of men look, whistle in unison, and exclaim, \"Baby!\" They are William Powell, Spencer Tracy, Ronald Colman, and Errol Flynn. Sitting down are Wallace Beery and C. Aubrey Smith. Peter Lorre, known for his portrayal of sinister and weird characters, says dreamily, \"I haven't seen such a beautiful bubble since I was a child.\" This is a possible reference to his breakthrough film role in Europe, a movie titled \"M\", in which he played a murderous child molester. Henry Fonda enjoys the act too, but is pulled away by his mother. This is a reference to the popular radio show The Aldrich Family which always opened with the cry: \"Hen-RYYYYY! Henry Aldrich!\" by the mother of the teenage title character, Henry Aldrich, who always replied, \"Coming, Mother!\" (Fonda replies in the voice of Jimmy Lydon, who played Henry.) J. Edgar Hoover says \"Gee!\" several times as a pun to his function as G-man. Boris Karloff, Arthur Treacher, Buster Keaton, and Mischa Auer watch the spectacle without any emotion, which was typical for their film roles: All were known for playing dour, deadpan characters. Ned Sparks, another famous movie \"grouch\" asks them if they are having a good time. They all respond in unison with a terse and dry, \"Yes.\" Jerry Colonna reacts in excitement to the act and utters his catchphrases \"Guess who?\", and the camera reveals an invisible character next to him: \"Yehudi!\" (\"Who's Yehudi?\" was his famous catchphrase, referring to a violinist he could never find, hence an \"invisible man\".) The camera zooms back to Strand lifting up her bubble, whereupon the camera follows it, with her out of sight, thus never revealing her nude body, and the bubble comes back down again, She catches it and is once again holding it in front of her.\nFinally, Harpo Marx shoots the bubble with an improvised slingshot. It bursts and Strand is shown wearing a barrel underneath. She reacts with shock, and the curtains close to signify the end of the dance. The conga stops and the cartoon cuts to Gable, who has finally caught the girl he was chasing, insisting she kiss him. \"She\" turns out to be Groucho Marx in drag — \"Well, fancy meeting you here!\""}