{"mid": "HolyMotors", "IMDB_id": "tt2076220", "title": "Holy Motors", "plot": "After waking up one morning, a man called \"The Sleeper\" locates and opens a secret door in his apartment. He enters, wandering into a packed movie house, while a young child and a giant dog wander up and down the aisles.\nMeanwhile, a man called Oscar rides to work in a white limousine, driven by his close friend and associate Céline. Oscar's job involves using makeup, elaborate costumes and props to carry out a number of complex and unusual \"appointments\", sometimes for the service of others, and at other times for seemingly no reason at all. The rest of the film is set in Paris. At his first appointment, Oscar masquerades as an old woman beggar in the street. At the next, Oscar wears a motion capture suit and performs an action sequence and simulated sex with an actress on a soundstage while being directed by an unseen man. At Oscar's third appointment, he plays the role of Monsieur Merde, an eccentric and violent red-haired man who kidnaps a beautiful model from her photo-shoot in a cemetery. The next scene finds Oscar as a father picking up his daughter from a party in an old red car. The two argue when the daughter reveals that she had spent the party crying in the bathroom instead of socializing. Céline continues to drive Oscar to his appointments.\nIn a little interlude, Oscar performs a short musical piece on accordion with a group of other musicians in a church. In the fifth scene he assumes the role of a Chinese gangster assigned to murder a man who looks identical to him. After he has stabbed the man in the neck and carved scars into his face that match his own, the victim suddenly stabs the gangster in the neck as well. Oscar manages to limp his way back to the limousine, seemingly injured before being seen sitting comfortably inside the limo removing his makeup. A man with a port-wine stain on one side of his face is sitting in the limo and discusses Oscar's work with him, informing Oscar that others believe he is getting \"tired\". Oscar admits that his business is changing, and that he misses the days when he was aware of cameras. He remains in his profession, though, for \"the beauty of the act\". Later, in what turns out to be the sixth sequence, Oscar abruptly runs from the limo, dons a balaclava, and shoots a banker (who looks identical to Oscar when he left for his first appointment in the morning) eating at a cafe before he is gunned down by the banker's bodyguards. Céline rushes to him, urging him towards his next appointment, and again Oscar returns to the limo unharmed.\nIn the seventh sequence, Oscar's character is an old man on his deathbed. A young woman named Léa referring to Oscar as \"uncle\" keeps him company, and the two talk about their lives. Oscar then pretends to die as Léa cries, before he leaves the bed and excuses himself to go to another appointment. Léa reveals her real name to be Élise, and she tells Oscar that she too has another appointment. When Céline stops the limousine beside an identical limo in what turns out to be the eighth sequence, Oscar recognizes the woman inside and asks if they can talk. The woman, Eva, tells Oscar that she has an appointment as an air hostess who spends her last night at a vacant building, and that they have twenty years to catch up on. As the two ascend the interior of the building, Eva sings \"Who Were We\", its lyrics suggesting that Oscar and Eva had a child together. When she concludes, Oscar says he should leave before her \"partner\" arrives, and on his way out he narrowly avoids him. When Oscar returns to his car, he sees that Eva and her mysterious partner have seemingly jumped to their deaths from the top of the building. He lets out an anguished cry as he runs past the two and enters his limo. Oscar finally heads to his ninth and final appointment in what seems to be an ordinary family man scenario. His dossier on the appointment refers to \"your house\", \"your wife\" and \"your daughter\". However, when Oscar enters the house, it is revealed that his \"wife\" and \"child\" are apparently both chimpanzees.\nCéline drives the limo to the Holy Motors garage, a place filled with identical limousines. She parks the car, places a mask on her face and exits the premises. The moment she leaves the building, the limousines begin talking to one another, vocalizing their fears that they may be considered outdated and unwanted."}