{"mid": "HomeAlone2LostInNewYork", "IMDB_id": "tt0104431", "title": "Home Alone 2: Lost in New York", "plot": "In Chicago, Illinois, the McCallister family is preparing for a Christmas vacation in Miami. On the night before their departure, the entire family gathers at Peter and Kate's home, where their 10-year-old son Kevin sees Florida as contradictory to Christmas because he thinks there are no Christmas trees in Florida. During the school Christmas pageant, Kevin's older brother Buzz humiliates him during his solo, causing Kevin to retaliate. Refusing to apologize for his actions, Kevin goes up to the third floor of the house. During the night, Peter unknowingly causes the alarm clock to reset; consequently, the family once again oversleeps. In the confusion and rush to reach the airport on time, Kevin boards a flight bound for New York City while trying to replace the batteries for his tape recorder, carrying Peter's bag containing his wallet and a large amount of cash; upon arrival in Miami, Kate realizes that Kevin is missing again. In New York, Kevin tours the city and convinces the staff at the Plaza Hotel into renting him a room using his father's credit card. During a visit to Central Park, Kevin is frightened by the appearance of a homeless woman tending to pigeons.\nOn Christmas Eve, Kevin tours the city in a limousine and visits a toy store where he meets its philanthropic owner, Mr. Duncan. Kevin learns that the proceeds from the store's Christmas sales will be donated to a children's hospital. Duncan offers Kevin a pair of ceramic turtledoves as a gift, instructing him to give one to another person as a sign of eternal friendship. After encountering Harry and Marv, a pair of burglars who recently escaped from prison and are now called the \"Sticky Bandits,\" Kevin retreats to the Plaza. The hotel's concierge Mr. Hector confronts Kevin about the credit card which has been reported stolen. Kevin flees after evading Mr. Hector, but is captured by Harry and Marv. The duo discuss plans for breaking into the toy store that night, before Kevin escapes.\nKevin's family travels to New York after tracking the whereabouts of the stolen credit card and Kate searches the city for Kevin. Meanwhile, Kevin goes to his uncle Rob's townhouse only to find the house vacant and undergoing renovations while Rob and his family are in Paris. In Central Park, he encounters and befriends the pigeon lady. At Carnegie Hall, the pair watch an orchestra perform \"O Come, All ye Faithful.\" The pigeon lady explains how her life collapsed and how she dealt with it by taking care of the pigeons in the park. Kevin gives the pigeon lady some advice and promises that he will be her friend.\nKevin, after remembering what the bandits said, returns to the townhouse and rigs it with numerous booby traps. Kevin arrives at the toy store during Harry and Marv's robbery, throws a brick through the window, setting off the store's alarm. Kevin then lures the duo to the townhouse, where he springs the traps and Harry and Marv suffer various injuries. When the duo chase Kevin around the townhouse, he escapes and calls the police. Harry and Marv catch him take him down to Central Park to kill him, but the pigeon lady sneaks in and incapacitates the duo with her birdseed before they can do anything, and Kevin sets off fireworks he had bought earlier to signal the police. The police arrive and arrest Harry and Marv. At the toy store, Mr. Duncan finds a note from Kevin attached to the brick explaining his actions.\nKate remembers Kevin's fondness for Christmas trees. After observing Kevin making a wish at the Rockefeller Center Christmas Tree, Kate meets him there and they reconcile. On Christmas Day, a truckload of gifts arrive at the McCallisters' hotel room from the toy store. Kevin and Buzz reconcile and Buzz allows him to open up the first present. Kevin goes to Central Park to give the pigeon lady the second turtledove. At the Plaza, Buzz receives the bill for Kevin's stay from Cedric and shows it to Peter. Peter suddenly calls out, \"Kevin, you spent $967 on room service?!\" at which point Kevin runs off."}