{"mid": "HomewardBoundTheIncredibleJourney", "IMDB_id": "tt0107131", "title": "Homeward Bound: The Incredible Journey", "plot": "Chance, a disobedient American Bulldog (voiced by Michael J. Fox) and narrator of the film, opens by explaining that he is the pet of Jamie Burnford (Kevin Chevalia), but expresses no interest in his owner or being part of a family. He shares his home with Shadow, an older and wiser Golden Retriever (voiced by Don Ameche) owned by Peter Burnford (Benj Thall), and Sassy, a smart-mouthed Himalayan cat (voiced by Sally Field), owned by their sister, Hope (Veronica Lauren). That morning, Bob Seaver (Robert Hays) marries Laura Burnford (Kim Greist), and Chance manages to cause chaos by digging into the wedding cake in front of all the guests.\nShortly after the wedding, the family has to move to San Francisco because Bob must temporarily relocate there for his job. They leave the pets at a ranch belonging to Kate (Jean Smart), a family friend. Shadow and Sassy start missing their owners immediately, but Chance sees it as an opportunity to explore and have some fun. Later in the week, Kate goes on a cattle drive, leaving the animals at the ranch to be looked after by her neighbor Frank (Gary Taylor). He does not see her message, and thinks that she has taken them along. Worried by the disappearance of their host, the animals come to the conclusion that they've been abandoned. Shadow in particular is worried about Peter, as he is adamant that Peter would never abandon him; therefore, he decides to go find his owners, as he fears Peter may be in danger. Not wanting to be left alone on the ranch, Chance and Sassie determine that they have no choice but to come along with him.\nThey head into the rocky, mountainous wilderness of the Sierra Nevadas with Shadow leading by instinct. After a night spent in fear of the woodland noise, the group stops to catch breakfast at a river. Two black bear cubs steal Chance's fish, and when Chance barks at them in protest, they leave the fish and climb a tree. He cockily assumes that he has scared them off, but then a huge brown bear appears, causing the group to quickly flee. At another river, Sassy refuses to swim across to follow the dogs; therefore, she runs along the river until she reaches a path of wood that seems to cross its breadth. Halfway across, it breaks apart and she falls in the water. Shadow jumps in to try to save her, but she goes over a waterfall. Shadow and Chance search for her along the bank, but as night falls, they mourn their loss and continue on without her.\nMeanwhile, a half-drowned Sassy is rescued from the river and nursed back to health by Quentin (William Edward Phipps), a man who lives in the woods. With Sassy recuperating from her injuries, the dogs struggle to catch fish from the river. Unbeknownst to the dogs, a mountain lion begins stalking them. While Chance is fishing, he spots the mountain lion and tells Shadow about it. The mountain lion chases them to the edge of a cliff. Chance assumes he is about to die, so he blurts his dark secrets to Shadow by telling him where he has buried everything at home. When Chance mentions that the remote control is buried under the seesaw, Shadow gets an idea to use a balanced rock shaped like a seesaw as a way to thwart the mountain lion. While Shadow acts as bait, Chance pounces onto the end of the rock and sends the mountain lion over the cliff and into a river. Sassy hears Chance and Shadow barking in celebration and follows the sound to rejoin them.\nThe animals continue on their way, but Chance tries to befriend a porcupine, ending up with a load of quills in his muzzle. His friends are unable to pull them out, and as they journey on, they find a little girl named Molly (Mariah Milner), who is lost in the woods. Too loyal to ignore her, they stand guard over her and keep her warm during the night. In the morning, Shadow finds a rescue party, which includes Molly's parents, and leads them back to her. The forest rangers, along with the party, recognize the animals from a missing pets flyer and take them to the local animal shelter, which Chance calls \"The Pound.\" Because Chance has had experiences with being in a dog pound, and it is a place Shadow does not think exists, he panics and warns the others to run. Sassy gets away while he and Shadow are taken inside. As the medical staff removes the quills from Chance's muzzle, Sassy sneaks in and frees Shadow. Together, they retrieve Chance and escape the shelter, without realizing that their owners were on their way to get them.\nThe group is crossing through a train yard when Shadow falls through some old boards into a muddy pit, injuring his leg. With Sassy and Chance's encouragement, he tries to climb out, but is unable to climb up the slippery slope. Lying down, he says he is too old and that they should go on without him. Chance jumps into the pit to try to get him going, but Shadow refuses to move. Near dusk, the family is out in the backyard playing basketball when Jamie claims to hear Chance barking. The others think he is imagining things, but moments later Chance comes running over a hill, happily tackling \"his boy.\" Sassy follows to be reunited with Hope. Peter looks for Shadow, but when he does not show up, Peter says he was too old, and it was too far of a walk for him and turns to go back inside. As he does, Shadow is seen limping over the hill. Peter turns back around and shouts Shadow's name as the two run towards each other. As everyone watches, Chance narrates how it was Shadow's belief that brought them home and how the years seemed to lift off of him, making him a puppy again after being reunited with his best friend. While everyone goes inside, Chance stays behind for a moment, ending his narration by saying he had a family and for the first time in his life, he was really home. He then happily runs into the house at the smell of food."}