{"mid": "HomeAlone", "IMDB_id": "tt0295318", "title": "Home Alone", "plot": "The McCallister family is preparing to spend Christmas in Paris, gathering at Peter and Kate's home outside of Chicago on the night before their departure. Peter and Kate's youngest son, eight-year-old Kevin, is being ridiculed by his siblings and cousins. A fight with his older brother, Buzz, results in Kevin getting sent to the third floor of the house for punishment, where he wishes that his family would disappear. During the night, heavy winds cause damage to power lines, which causes a temporary power outage and resets the alarm clocks, causing the entire family to oversleep. In the confusion and rush to get to the airport, Kevin is accidentally left behind.\nKevin wakes up to find the house empty and, thinking his wish has come true, is overjoyed with his new-found freedom. However, Kevin soon becomes frightened by his next door neighbor, \"Old Man\" Marley, who is rumored to have murdered his family with a snow shovel in 1958; as well as the \"Wet Bandits\", Harry and Marv, a pair of burglars who have been breaking into other vacant houses in the neighborhood and have targeted the McCallisters' house. Kevin tricks the pair into thinking his entire family is home, forcing them to put their plans on hold.\nKate discovers mid-flight that Kevin is missing and, upon arrival in Paris, the family discovers that all flights for the next two days are booked. Peter and the rest of the family go to his brother Rob's apartment in the city while Kate manages to get a flight back to the United States only to get as far as Scranton, Pennsylvania. She attempts to book a flight to Chicago but again, everything is booked. Unable to accept this, Kate is overheard by Gus Polinski, the lead member of a traveling polka band, who offers to let her travel with them to Chicago on their way to Milwaukee in a moving van, which she graciously accepts.\nMeanwhile, Harry and Marv realize that Kevin is home alone, and on Christmas Eve, Kevin overhears them discussing plans to break into his house that night. Kevin goes to church and watches a choir perform. He meets Old Man Marley, who sits with Kevin and they briefly speak; he learns that Marley is actually a nice man and that the rumors about him are false. He tells Kevin he is watching the choir because his granddaughter is singing, but he never gets to see her because he and his son are estranged and have not been on speaking terms for some time; Kevin suggests that he try to reconcile with his son.\nKevin returns home and rigs the house with numerous booby traps. Harry and Marv break in, springing the traps and suffering various injuries. While the duo pursues Kevin around the house, he calls the police and flees the house, luring the duo into a neighboring vacant home. Harry and Marv manage to catch him and discuss how they will get their revenge, but Marley sneaks in and knocks them unconscious with his snow shovel before they can do anything to Kevin. The police arrive and arrest Harry and Marv, having identified all the houses they burglarized due to the latter's habit of flooding them.\nOn Christmas Day, Kevin is disappointed to find that his family is still gone. He then hears Kate enter the house and call for him; they reconcile and are soon joined by the rest of the McCallisters, who waited in Paris until they could get a direct flight to Chicago. Kevin keeps silent about his encounter with Harry and Marv, although Peter finds Harry's missing gold tooth. Kevin then observes Marley reuniting with his son and his family. Marley notices Kevin and the pair wave to each other before Marley and his family go inside his house. Buzz suddenly calls out, \"Kevin, what did you do to my room?!\" at which point Kevin runs off."}