{"mid": "HomeAlone4", "IMDB_id": "tt0329200", "title": "Home Alone 4", "plot": "At the McCallisters' house, Peter (Jason Beghe) is about to get divorced from Kate (Clare Carey) and announces that he's living with his new and rich girlfriend Natalie (Joanna Going) at her mansion. He tells his three children Buzz (Gideon Jacobs), Megan (Chelsea Russo), and Kevin (Mike Weinberg) that they are hosting the visit of a royal family and invites everyone to spend Christmas with him and Natalie. After initially refusing, Kevin takes his father up on his offer after being tormented by Buzz.\nKevin enjoys his time at Natalie's mansion with his new bedroom, latest gadgets and his life. The next morning, Natalie and Peter go out for a bit while Kevin stays at the mansion with Natalie's butler Mr. Prescott (Erick Avari) and maid Molly (Barbara Babcock). While Prescott makes Kevin a milkshake, he goes into the security room and gets caught by Prescott who gives Kevin another chance. With Natalie and Peter still away, Kevin notices his old nemesis Marv (French Stewart), who is the remaining member of the Wet Bandits after ditching his last partner, Harry, along with his new sidekick and wife Vera (Missi Pyle) outside the house. Kevin tries to get Mr. Prescott to answer the intercom, but unfortunately it doesn't work because Marv altered the security system. He then spies on them and drive them away by flooding the house, but Peter and Natalie arrive while Kevin is cleaning up and don't believe Kevin's explanation, especially since Prescott claims to have seen nothing. Kevin then attempts to use the security camera footage to prove himself, but discovers that the camera had been turned off and is caught by Prescott, who Kevin now believes to be Marv and Vera's ally. Molly then appears and gets Kevin out of trouble. Peter and Natalie then realize they gave Kevin a hard time and decide to make him feel better, so the three of them decorate the tree.\nThe next morning, Peter and Kevin wake up and realize their tree was re-decorated because of Natalie. Kate, Buzz and Megan then arrive to visit Kevin. Kate meets Natalie in person and Kevin shows the entire house to Buzz and Megan. At a party for the royal family while Peter and Natalie have gone to pick them up, Kevin notices Marv and Vera dressed up as caterers. Mr. Prescott warns Kevin about tonight so he then tricks Mr. Prescott into going into the freezer room and he ends up locked in the freezer room and frozen in ice. Kevin then spies on Marv and Vera in his bedroom and hears them planning about kidnapping the prince. Unfortunately for them, Kevin makes sure that their plan was a failure and has them fall out and break the window. The royal family are unable to attend the party because their flight was cancelled, so Peter and Natalie decide to announce their engagement to the party guests instead. Marv and Vera run back into the house and Kevin hits Marv with a frying pan, flips the table and get soup spilled on Marv and Vera. Then they chase Kevin, causing him to accidentally ruin the party. Peter is angered at this event and tells Kevin that he is grounded, still refusing to believe him about the break-in and believes that Kevin is trying to end his relationship with Natalie.\nSince no one believes him about the heist, Kevin decides to deal with matters himself, and sets booby traps for Marv and Vera. The next morning Peter and Natalie go get the royals and Kevin is left back at the house. Marv and Vera wake up and head to the house. Kevin tricks and locks Mr. Prescott in the basement, but eventually discovers Marv and Vera's real ally is actually Molly, who also turns out to be Marv's mother as well. Kevin gets locked in the basement with Mr. Prescott. After apologizing to Mr. Prescott for misjudging him (and vice versa), Kevin manages to escape through the dumbwaiter. Kevin then traps Marv under the dumbwaiter but Vera gets him out. Then Kevin unleashes his traps on Marv and Vera. Then Molly appears as Kevin manages to trap her in the elevator and runs to his bedroom. At the airport, Peter gets worried about Kevin and takes a cab back to Natalie's to check on him. Back in the basement, Mr. Prescott then manages to escape through the dumbwaiter as well to see if Kevin is alright. Just on the road, Kate, Buzz and Megan are on their way to save Kevin as well. Marv heads to the bedroom and ends up getting caught and stuck under the bookshelf. Kevin then plays a recording of Marv, making it sound like he's insulting Vera, which causes her to yell at him and argue. Marv then gets hit by Kevin's electric aircraft making him fall and rumble down the stairs. Marv and Vera are then tricked by Kevin with a secret wall switch, end up swinging from a chandelier, and they fall and are knocked unconscious. Molly, having escaped, grabs Kevin but Mr. Prescott knocks her out with a serving tray. Then he and Kevin call the police. As Peter, Kate, Buzz and Megan arrive, Kevin, with Buzz and Megan's help, chases Marv and Vera out of the house and trips them up. The royal family and Natalie arrive and Natalie is confused when she sees Marv, Vera, and Molly getting arrested. Peter tells Natalie that Kevin saved the day and an FBI agent reveals that Molly, Marv and Vera masterminded the plot to abduct the royals. Peter breaks up with Natalie, Mr. Prescott resigns, the royals spend Christmas with the McCallisters, and it is a good Christmas for everyone except for Natalie, Marv, Vera and Molly."}