{"mid": "Homecoming", "IMDB_id": "tt1135500", "title": "Homecoming", "plot": "After having lived in the United States for several years, Teddy brings his wife, Ruth, home for the first time to meet his working-class family in North London, where he grew up and which she finds more familiar than their arid academic life in America.\nMuch sexual tension occurs as Ruth teases Teddy's brothers and father and the men taunt one another in a game of oneupmanship, resulting in Ruth's staying behind with Teddy's relatives as \"one of the family\" and Teddy and their three sons returning home to America without her.\n=== Act one ===\nThe play begins in the midst of what becomes an ongoing power struggle between the two more dominant men, the father, Max, and his middle son, Lenny. Max and the other men put down one another, expressing their \"feelings of resentment,\" with Max feminising his brother Sam, while, ironically, himself claiming to have himself \"given birth\" to his three sons.\nTeddy arrives with his wife, Ruth. He reveals that he married Ruth in London six years earlier and that the couple subsequently moved to America and had three sons prior to his returning to the family home to introduce her. Ruth's and Teddy's discomfort with each other, marked by her restless desire to go out exploring after he goes to bed and followed by her sexually suggestive first-time encounter with her brother-in-law Lenny, begins to expose that there are problems in the marriage. After a sexually charged conversation between Lenny and Ruth, Ruth exits. Awakened by their voices, Max comes downstairs. Lenny does not tell Max about Teddy's and Ruth's arrival at the house and engages in more verbal sparring with Max. The scene ends in a blackout.\nWhen the lights come up the scene has changed to the following morning. Max comes down to make breakfast. When Teddy and Ruth appear and he discovers that they have been there all night without his knowledge, Max is initially enraged, assuming that Ruth is a prostitute. After being told that Ruth and Teddy have married and that she is his daughter-in-law, Max appears to make some effort to reconcile with his son Teddy.\n=== Act two ===\nThis act opens with the men's ritual of sharing the lighting of cigars after lunch, ending with Teddy's cigar going out prematurely and symbolically. Max's subsequent sentimental reminiscences of family life with Jessie and their \"boys\" and his experiences as a butcher also end abruptly with a cynical twist.\nAfter Teddy's marriage to Ruth receives Max's blessing, Ruth appears to let her guard down. She relaxes and, focusing their attention on her (\"Look at me.\"), she reveals some details about her previous life before meeting Teddy and how she views America (68–69). After Max and his brothers exit, Teddy abruptly suggests to Ruth that they return home immediately (70). Apparently, he knows about her past history as \"a photographic model for the body\" (73) and about which she reminisces when talking to Lenny alone after Teddy has gone upstairs \"to pack\" for their return trip to America. When he returns with the suitcases and Ruth's coat, he expresses concern about what else Lenny may have gotten Ruth to reveal. As Teddy looks on, Lenny initiates dancing \"slowly\" with her (74). With Teddy, Max, and Joey all looking on, Lenny kisses Ruth and then turns her over to Joey, who asserts that \"she's wide open\"; \"Old Lenny's got a tart in here\" (74). Joey begins making out with Ruth on the sofa, telling Lenny that she is \"Just up my street\"(75). Max asks Teddy if he is \"going\" so soon; ironically, he tells Teddy, \"Look, next time you come over, don't forget to let us know beforehand whether you're married or not. I'll always be glad to meet the wife.\" He says that he knows that Teddy had not told him that he was married because he was \"ashamed\" that he had \"married a woman beneath him\" (75), just before peering to look at Ruth, who is literally still lying \"under\" Joey. Max adds that Teddy doesn't need to be \"ashamed\" of Ruth's social status, assuring Teddy that he is a \"broadminded man\" (75), and \"she's a lovely girl. A beautiful woman,\" as well as \"a mother too. A mother of three.\" Contrary to the concurrent action, even more ironically, Max observes that Teddy has \"made a happy woman out of her. It's something to be proud of\"; right after Max further asserts that Ruth is \"a woman of quality\" and \"a woman of feeling,\" clasped in their ongoing embrace, Joey and Ruth \"roll off the sofa on to the floor\" (76).\nSuddenly pushing Joey away and standing up, Ruth appears to take command, asking for food and drink, and Joey and Lenny attempt to satisfy her demands (76–77). After Ruth questions whether or not his family has read Teddy's \"critical works\" — leading Teddy to defend his own \"intellectual equilibrium\" and professional turf (77–78) — Ruth and Joey go upstairs for what Lenny later says turns out to be a two-hour sexual encounter in bed, without going \"the whole hog\" (82).\nWhile Ruth is still upstairs, Lenny and the others reminisce about Lenny's and Joey's sexual exploits. Lenny, whom the family considers an expert in sexual matters, labels Ruth a \"tease,\" to which Teddy replies, \"Perhaps he hasn't got the right touch\" (82). Lenny retorts that Joey has \"had more dolly than you've had cream cakes,\" is \"irresistible\" to the ladies, \"one of the few and far between\" (82). Lenny relates anecdotes about Joey's sexual prowess with other \"birds\" (82–84). When Lenny asks Joey, \"Don't tell me you're satisfied without going the whole hog?\", Joey tentatively replies that \"sometimes\" a man can be \"happy\" without \"going any hog\" (84). Lenny \"stares at him.\" Joey seems to be suggesting that Ruth is good at \"the game\" that Lenny ultimately gets the \"idea\" to \"put\" her \"on\": Lenny proposes to Max that he \"take her up with me to Greek Street\" (88).\nMax volunteers that Ruth could come to live with the family, suggesting that they \"should keep her\" while she works for them part-time as a prostitute. The men discuss this proposal in considerable detail, seemingly half-joking to irritate Teddy and half-serious (86–89). Sam declares the whole idea \"silly\" and \"rubbish\" (86), Teddy adamantly refuses to \"put\" anything \"in the kitty,\" as Max asks (87), and Lenny suggests that Teddy could hand out business cards and refer Americans he knows to Ruth when they visit London, for \"a little percentage\" (89–90).\nRuth comes downstairs \"dressed\" and apparently ready to join Teddy, who is still waiting with his coat on and their packed suitcases (90). Teddy informs her of the family's proposal, without going into explicit detail about their intention to engage her in prostitution, saying euphemistically that she will \"have to pull [her] weight\" financially because they are not \"very well off\"; then he offers her a choice to stay in London with the family \"or\" to return to America with him (91–92). Ruth appears far more interested in the idea of staying with them. She negotiates the terms of their \"contract\" (93) using business terminology in a professional manner that makes her seem adept at getting what she wants in such transactions (92–94). Teddy prepares to return to America without her.\nHaving spoken up a few times earlier to voice his objections, Sam blurts out a long-kept secret about Jessie and Max's friend MacGregor, then \"croaks and collapses\" and \"lies still\" on the floor (94). Briefly considering the possibility that Sam has \"dropped dead\" and become a \"corpse\" (94), the others ascertain that he is still breathing (\"not even dead\"), dismiss his revelation as the product of \"a diseased imagination,\" and mostly ignore his body. After a pause, Ruth accepts their proposal: \"Yes, it sounds like a very attractive idea\" (94). Teddy focuses on the inconvenience that Sam's unavailability poses for him: \"I was going to ask him to drive me to London airport\" (95). Instead, he gets directions to the Underground, before saying goodbye to the others and leaving to return home to his three sons in America, alone. As he moves towards the front door, Ruth calls Teddy \"Eddie\"; after he turns around, she tells him, \"Don't become a stranger\" (96). He goes out the door, leaving his wife with the other four men in the house.\nThe final tableau vivant (96–98) depicts Ruth sitting, \"relaxed in her chair,\" as if on a throne. Sam lies motionless on the floor; Joey, who has walked over to Ruth, places his head in her lap; and Lenny, stands looking on. After repeatedly insisting that he is not an old man, and getting no reply from Ruth, who remains silent, Max beseeches her, \"Kiss me\" – the final words of the play. Ruth sits and \"continues to touch JOEY's head, lightly,\" while Lenny still \"stands, watching\" (98). In this \"resolution\" of the play (its dénouement), what might happen later remains unresolved. Such lack of plot resolution and other ambiguities are features of most of Pinter's dramas."}