{"mid": "HoneyIShrunkTheKids", "IMDB_id": "tt0097523", "title": "Honey, I Shrunk the Kids", "plot": "Eccentric scientist and inventor Wayne Szalinski lives in his suburban home attempting to perfect a ray gun capable of shrinking objects, but the apples he uses as test objects instead blow up. After an argument between Wayne and his wife Diane, she spent the night with her mother and is currently at work, worrying her teenaged daughter Amy, and their son Nick, who has inherited his father's inventive ingenuity and intelligence. Next door neighbors, the Thompsons, are getting ready for a fishing trip, but Russ' oldest son Little Russ is less than enthusiastic, as he and his father's interests often clash, resulting in his feeling belittled, and he is more interested in meeting Amy than spending the weekend camping. Younger son Ron, however, is enthusiastic, though his relationship with Russ Sr. is strained when he inadvertently sets off a booby trap in the yard.\nWayne instructs Amy and Nick to clean the house in preparation for Diane's return home before leaving for his conference. Nick is assigned to do the lawn, but he makes a deal to let his friend Tommy Pervis mow the lawn with the remote-controlled mower, but he (Tommy) has to leave and promises to do it later. Ron accidentally hits his baseball through the Szalinskis' attic window, which inadvertently activates the machine and blocks its targeting laser. Caught by little Russ, he is made to apologize to Nick and Amy, and Amy has her brother take Ron to retrieve his ball; the two encounter the machine and are hit by its beam, thus shrinking them. At his conference, Wayne is laughed at for failing to provide proof of his shrink ray and leaves in frustration, while at the house Amy and Russ go to check on their siblings and are shrunk by the ray. When Wayne returns home, they try to get his attention, but their voices are too small and he is unable to hear them. Frustrated by his day and the broken window he discovers, Wayne takes it out on the machine, damaging it and nearly crushing the children with the shrapnel of parts. He then sweeps the debris (and the children) into a dust pan and takes them out in a trash bag. They escape and enter the uncut yard's wilderness where Nick calculates over 3.2 miles at their size to get back to the house and they start walking. Meanwhile, Diane returns home and she and Wayne make up, but they soon grow concerned about Nick and Amy. While trying to summon their dog Quark, Nick falls into a flower and is picked up by a bee, and Russ jumps on it to help him. The bee flies around the backyard with the two stuck to its hair; as it attacks Wayne, he knocks it out of the air with a baseball bat, causing the bee to crash land. Wayne realizes that a baseball was what caused the window to break in the attic since Nick doesn't play sports. Once in the attic, he finds his shrunken couch and realizes what happened to the kids; afraid to step on the lawn he arranges a sling to hover over the grass and search for the children. Next door, Russ and Mae are forced to call off their trip because their boys haven't returned yet and they call the police to report them missing.\nHaving been separated from Amy and Ron, Nick and Russ go to search for them. Wayne, after a snafu with his sling, resorts to using stilts to search for the kids and accidentally activates the sprinklers which causes chaotic torrents to come down on them. Amy is nearly drowned when she is knocked into a pool of mud, but Russ saves her with CPR. Soon, their hunger is sated by one of Nick's oatmeal creme cookies, but their meal is interrupted by an ant scouting it. Ron decides to tame it in order to take them home, but soon they grow attached to \"Antie\" and try to set him free, but he instead decides to follow Ron like a loyal pet. After calling the police, Diane is told what happened to the kids and she joins in the search after a short panic attack, she convinces Wayne to tell the Thompsons, who are extremely skeptical and Russ threatens Wayne but leaves his porch light on just in case. The kids find a Lego block to camp for the night, and after a heart felt conversation about their feelings for each other, Russ and Amy kiss but are interrupted by an arrival of a scorpion which traps Ron in the Lego while the others escape. Antie comes to rescue Ron, but is mortally wounded as the kids unite and drive the scorpion off. Ron is heartbroken when Antie dies and they bury him. The next morning, Tommy returns to mow the lawn. Nick recognizes this and they run, seeking shelter in an earthworm burrow; Wayne and Diane stop Tommy just in time to save the kids who are blown out of the burrow by the mower's blades, but they despair when they still can't get the Szalinskis' attention. Riding Quark into the house, Nick loses his grip and falls into Wayne's bowl of Cheerios; he is nearly eaten before Quark bites Wayne, making him aware of Nick and the other kids' presence.\nBack in the attic, Nick and the others manage to communicate that the baseball made the machine work and Wayne realizes the laser it blocked was giving it too much heat, causing things to blow up. He corrects the mistake and Russ Sr. volunteers as a test subject, which is almost successful (his hat no longer fits, but then again, Mae took the cigarettes he was hiding them in). The kids are then restored to their normal sizes and are reunited with their families. Months later, at Thanksgiving the Thompsons and Szalinskis, now close friends, are toasting over an enlarged turkey. Russ and Amy are apparently dating now while Ron and Nick are friends, while Quark is eating from an enlarged Milk-Bone treat. Nick finally gets a joke that Russ told him about learning CPR in \"French\" class. He laughs."}