{"mid": "HoneyIBlewUpTheKid", "IMDB_id": "tt0104437", "title": "Honey I Blew Up the Kid", "plot": "Five years after inventor Wayne Szalinski shrunk his children, his family have moved to Nevada, and welcomed a new son, mischievous two-year old Adam. Wayne’s wife Diane leaves on a Friday with their daughter Amy for college, leaving Wayne to look after Adam and their teenage son Nick, who struggles with puberty. He develops a crush on Mandy Park, who Wayne later arranges to babysit Adam. One Saturday, Wayne takes his sons to Sterling Labs, where he has constructed a device which could make objects grow. He tests it out on Adam’s toy Big Bunny. However, when Wayne and Nick’s backs are turned, Adam retrieves his toy and is zapped by the machine, which appears to short circuit and not enlarge the targeted object.\nBack home, Adam and Big Bunny are exposed to electrical waves from the microwave oven and grow in size, now seven feet tall. Wayne and Nick try to take Adam back to the lab to reverse the process, but are caught by Wayne’s superior Doctor Charles Hendrickson, who dislikes Wayne, later discovering his folly. Diane returns home and discovers the truth. Wayne and Diane drive to a warehouse and retrieve Wayne’s shrink ray to turn Adam back to normal. Mandy arrives to babysit Adam, Nick calming her down when she sees the gigantic toddler. Adam is exposed to a television’s electrical waves and grows to fourteen feet, before escaping through a wall.\nNick and Mandy search for him, but they and Adam are taken into custody, Adam placed into a truck. Wayne and Diane return home, finding the smug Hendrickson waiting for them. He has summoned Clifford Sterling, the company chairman, with the plan to fire Wayne and experiment on Adam. Sterling arrives, praising Wayne when he admits his mistake and agrees to help Adam, firing the rude Hendrickson as well. Adam grows even larger, escaping confinement, and heads for Las Vegas, pursued by his family and the authorities. Adam mistakes Nick and Mandy as toys and picks puts them in his overalls pocket.\nHendrickson gets permission to board a military helicopter and tranquilise Adam. Wayne needs Adam to stand still for twelve seconds so he can be shrunk. At first, he tries using Big Bunny to pacify Adam but it backfires when Wayne suggests his son takes a nap (which he hates). After wandering through Las Vegas, Adam saves the escaped Nick and Mandy in a sports car from falling off the Kicking Lady of Glitter Gultch and puts the car inside his pocket again, before pursuing an ice cream truck driven by Marshall Brooks to distract him away from the city. However, he continues to grow even larger and heads towards the Hard Rock Café, where he plays the lit up guitar. Hendrickson arrives and shoots Adam, causing him to drop the guitar and get an electric shock. Diane convinces Wayne to enlarge her so she can hug Adam, preventing Hendrickson from harming her son and getting Adam to stand still for the needed time period for the shrinking ray to work. Wayne then fires the shrink ray, returning Adam and Diane to normal size. Hendrickson arrives, attempting to justify his actions, but Diane knocks him out.\nIn the closing scene, Nick and Mandy are revealed to have been shrunk inside the car from inside Adam's pocket to the size of insects, only to be found by Wayne quickly. The only problem left is to shrink Big Bunny to normal size."}