{"mid": "HopeFloats", "IMDB_id": "tt0119313", "title": "Hope Floats", "plot": "Birdee Pruitt (Sandra Bullock) is a Chicago housewife who is invited onto the Toni Post talk show under the pretense of getting a free makeover but instead is ambushed with the revelation that her husband Bill has been having an affair with her best friend Connie (Rosanna Arquette). Humiliated on national television, Birdee and her precocious daughter Bernice (Mae Whitman) move back to Birdee's hometown of Smithville, Texas, with Birdee's eccentric mother Ramona (Gena Rowlands) and young, imaginative nephew Travis (Cameron Finley), to make a fresh start. As Birdee and Bernice leave Chicago, Birdee gives Bernice a letter from her father, telling Bernice how much he misses her.\nBirdee struggles to make a new life as a working single mother and deals with the growing attraction between herself and a former high school classmate, Justin Matisse (Harry Connick, Jr.), who Ramona hopes that Birdee will get together with. She also tries to rebuild her relationship with her estranged mother, her ailing father (who suffers from Alzheimer's Disease), and her daughter, who wants desperately to be with her father and blames her mother for the breakup, even trying to sabotage the romantic overtures Justin makes towards Birdee. Meanwhile, Bernice is not happy that she left Chicago and is having difficulty adjusting to life in Smithville. Her negative view of the small town is worsened when she is bullied by a classmate known as Big Dolores.\nAdding to Birdee's heartache is her former status as the school queen bee and a beauty pageant winner, which alienated many of her former classmates. They also haven't forgotten Birdee's high school snobbery and rub her nose in her televised embarrassment.\nRamona tries to mend the gap between her daughter and granddaughter by telling a childhood story of her own. She asks Bernice what she's wishing for her upcoming birthday. Even though Bernice says she doesn't have a birthday wish, she secretly wishes for her father to return.\nThat night, drinking a cup of tea before she could sleep, Ramona suffers a massive heart attack and dies. At the funeral, Bill arrives at the church. Bernice believes her father's presence is a sign her wish has come true...that her father wants them both to come home. However, it soon becomes clear to her that her parents' split is permanent when Bill asks Birdee for a divorce. Wanting to be with her father, Bernice runs up to her room, packs a suitcase, and follows Bill to his car. She is devastated when her father tells her that even though he loves her, he has no room for her in his new life with Connie. Bill turns his back on Bernice and drives off, leaving her sobbing and screaming for him to come back and take her with him at the end of the driveway. Birdee comes to pick Bernice up and carries her into the house. As Birdee comforts Bernice up in her room, Bernice learns the letter was actually written by her mother, and not really by her father.\nOne day at work, Birdee finds Justin outside waiting for her with flowers. As she walks to him, she says, \"Ok, Mama, stop pushing\". After they kiss and embrace, he picks her up, places her in his truck and they drive off together.\nThe final scene shows Birdee, Justin, Bernice, and Travis at a big town event. Birdee is now taking care of Travis and dating Justin, but isn't planning on getting married again for a really long time. Bernice welcomes Smithville as her new hometown, ultimately accepts Bill's departure from her life as a full-time parent, and begins to accept Justin as her mother's new love interest and a father figure. She and Birdee are much closer because of everything they've been through, as Bernice finally realizes it wasn't her mother's fault that her father left them and that Birdee really did love her. They share a tender, yet humorous moment when Bernice asks Birdee if she's going to marry Justin. When Birdee asks her if she doesn't like Justin, Bernice says her only real concern is being known as \"Bernice Matisse\"."}