{"mid": "HornetsNest", "IMDB_id": "tt0065850", "title": "Hornets' Nest", "plot": "In Northern Italy in 1944, the entire population of the village of Reanoto is massacred by the SS under the command of the cruel Sturmbannführer Taussig (Jacques Sernas) for helping the Italian resistance movement. The only survivors are a group of young boys in ages from 7 to 14 led by Aldo (Mark Colleano, son of Bonar Colleano and Susan Shaw) who witness the mass execution and vow revenge.\nThat night, a detachment of US Army paratrooper saboteurs jump into the area with a mission to destroy a strategic dam with the partisans prior to the Fifth United States Army's advance into the area. Their drop zone has been discovered by Wehrmacht troops under the command of Hauptmann Friedrich von Hecht (Sergio Fantoni), who kill them all except the leader of the paratroopers, Captain Turner (Rock Hudson), who is rendered unconscious and goes unnoticed by the Germans when he lands in the branches of a tree. The Germans capture the demolition equipment from the dead Americans.\nAldo and his friends rescue Turner by spiriting him away from the ambush. Realising that Turner needs medical attention, they kidnap German doctor Bianca Freedling (Sylva Koscina) to nurse him to health, and keeping her captive even after Turner's recovery. In order to avenge the massacre of Reanoto, Aldo wants Turner to train him and his friends in the use of military weapons and tactics. Turner uses the opportunity as a second chance to complete his sabotage mission, using the boys instead of his late command. He has the boys steal the captured American demolition gear from von Hecht's headquarters, killing SS Rottenführer Gunther in the process, but Aldo hides the detonators until Turner leads them in their revenge. He trains them to use German MP40 guns.\nIn response to the killing of Gunther, Standartenführer Jannings makes the hunt for Turner and his \"Dead End Kids\" an SS-led affair, placing von Hecht under the command of Taussig and reassigning his regular Wehrmacht troops to guard a tunnel. Not long after this, Turner and the boys steal a truck and drive to SS headquarters, slaughtering all of Taussig's men in a surprise attack. Killing the SS was enough for most of the boys, but not for Aldo, who is becoming emotionally and mentally unhinged. He wants to keep killing Germans.\nVon Hecht, after an argument, shoots and kills Taussig in the aftermath of the attack on SS headquarters, and goes after Turner and the boys solo. While Turner and a few of the boys are planting Composition C charges on the dam, Aldo and a few of the others go against orders and directly engage the German guards on top of the dam, which very nearly costs the entire mission. Taking over an MG42, Aldo becomes blood-drunk as he mows down Germans, even going so far as to shoot down his own friend Carlo when Carlo blocks his shot. Despite interference from von Hecht, Turner and the kids successfully plant the explosives and blow up the dam, flooding the valley.\nWith the dam destroyed and the Germans routed, the American troops begin moving in. When Turner learns of Carlo's death, as well as that of another boy who died protecting Bianca and some of the younger children, he regrets having involved the children and breaks all of the guns. Aldo however refuses to hand his over, and runs off, encountering von Hecht, who survived the destruction of the dam. Aldo shoots and wounds him just as Turner catches up to him, and after failing to talk him out of finishing the German officer off, prevents him by force, taking his gun away. He takes von Hecht prisoner as von Hecht expresses his admiration for Turner's success.\nTurner, Bianca, von Hecht and all of the surviving boys except for Aldo go down to meet the approaching column of American soldiers. Aldo lingers. After seeing to it that the others are safely aboard a truck, Turner goes back for Aldo, who angrily throws rocks at him because he stopped him from killing von Hecht. But finally he is overcome with remorse for having killed Carlo, and begs Turner's forgiveness. Turner gives it, and scoops the defeated and frightened boy up, and carries him to the waiting truck."}