{"mid": "HorrorExpress", "IMDB_id": "tt0068713", "title": "Horror Express", "plot": "In 1906, Saxton (Lee), a renowned British anthropologist, is returning to Europe by the Trans-Siberian Express from China to Moscow. With him is a crate containing the frozen remains of a primitive humanoid creature that he discovered in a cave in Manchuria. He hopes it is a missing link in human evolution. Doctor Wells (Peter Cushing), Saxton's friendly rival and Royal Geological Society colleague, is also on board but traveling separately. Before the train departs Shanghai, a thief is found dead on the platform. His eyes are completely white, without irises or pupils, and a bystander initially mistakes him for a blind man. A monk named Father Pujardov (Alberto de Mendoza), the spiritual advisor to the Polish Count Marion Petrovski (George Rigaud) and Countess Irina Petrovski (Silvia Tortosa), who are also waiting to board the train, proclaims the contents of the crate to be evil. Saxton furiously dismisses this as superstition. Saxton's eagerness to keep his scientific find secret arouses the suspicion of Wells, who bribes a porter to investigate the crate. The porter is killed by the ape-like creature (Juan Olaguivel) within. It then escapes the crate by picking the lock.\nThe creature finds more victims as it roams the moving train. Each victim is found with the same opaque, white eyes. An autopsy suggests that the brains of the victims are being drained of memories and knowledge. When the creature is gunned down by police Inspector Mirov (Julio Peña), the threat seems to have been vanquished. Saxton and Wells discover that images are retained in a liquid found inside the eyeball of the corpse, which reveal a prehistoric Earth and a view of the planet seen from space. They deduce that the real threat is somehow a formless extraterrestrial that inhabited the body of the creature and now resides within the inspector. Father Pujardov, sensing the greater presence inside the inspector and believing it to be that of Satan, renounces his faith to pledge allegiance to the mysterious entity.\nNews of the murders is wired to the Russian authorities. An intimidating Cossack officer, Captain Kazan (Telly Savalas), boards the train with a handful of his men. Kazan believes the train is transporting rebels; he is only convinced of the alien's existence when Saxton switches off the lights and Mirov's eyes glow, revealing him to be the creature's host. The creature has absorbed the memories of Wells' assistant, an engineer, and others. It seeks the Polish count's metallurgical knowledge in order to build a vessel to escape Earth. Kazan fatally shoots Mirov, and the alien transfers itself to the deranged Pujardov.\nThe passengers flee to the freight car while Pujardov murders Kazan, his men, and the count, draining all of their minds. Saxton rescues the countess and holds Pujardov at gunpoint. Saxton, having discovered that bright light prevents the entity from draining minds or transferring to another body, forces Pujardov into a brightly lit area. The creature/Pujardov explains that it is a collective form of energy from another galaxy. Trapped on Earth in the distant past after being left behind in an accident, it survived for millions of years in the bodies of protozoa, fish, and other animals. It cannot live outside a living being longer than a few moments. The creature begs to be spared, tempting Saxton with its advanced knowledge of technology and cures for diseases. While Saxton is distracted by the offer, the creature resurrects the count's corpse, which attacks Saxton.\nSaxton and the countess flee from the creature, but it now resurrects all of its victims as zombies. Battling their way through the train, Saxton and the countess eventually reach the caboose where the other survivors have taken refuge. Once there, Saxton and Wells work desperately to uncouple themselves from the rest of the train. The Russian government sends a telegram to a dispatch station ahead, instructing them to destroy the train by sending it down a dead-end spur. Speculating that it must be war, the station staff switch the points.\nThe creature takes control of the train as it enters the spur. Saxton and Wells manage to separate the last car from the rest of the train. The creature tries to find the brakes to try and stop the train, but fails to even get it to slow down. The train rams through the barrier and plunges down the cliff and is destroyed as soon as it hits the bottom. The caboose rolls precariously to the end of the track before stopping, inches away from the edge of the cliff. The survivors quickly leave the caboose, while Saxton, Wells, and the countess gaze over the ravine and witness an inferno consuming the train and its unearthly inhabitants."}