{"mid": "HorrorsOfTheBlackMuseum", "IMDB_id": "tt0052901", "title": "Horrors of the Black Museum", "plot": "HORRORS OF THE BLACK MUSEUM In London a delivery truck pulls up in front of an apartment building and the postman (Frank Forsyth) delivers a package to Gail Dunlap (Dorinda Stevens), who signs for it and takes it inside. Her roommate Peggy (Malou Pantera) encourages her to open it and find out who sent it. It is revealed to be a pair of expensive binoculars. Gail takes it over to the window to have a look. Suddenly she screams, holding her hands over her bloody eyes and collapses on the floor. Peggy screams and runs out the door for help. The binoculars are shown to have two sharp-pointed awls which were spring-loaded and released into her eyes when she turned the focus knob.At Scotland Yard, Peggy answers questions from Supt. Graham (Geoffrey Keen) and is escorted out the door by Insp. Lodge (John Warwick). Before the door can be closed, in comes Edmund Bancroft (Michael Gough) who is scarcely welcome. Asking to see the binoculars, Bancroft says that the murderer must have seen them in the black museum of the police. He suggests maybe a disgruntled policeman might be the culprit. Graham asks if that will be the subject of his next article in the newspaper. Bancroft reminds them that they do not control the writing of his column, books or newspaper articles which are always accurate. More discussion on who the murderer might be and what weapon might next be used is interrupted by a phone call from Commissioner Wayne (Austin Trevor), who summons the police to a meeting.At the meeting Wayne finds that the police have absolutely no leads on whom the suspect might be. It is confirmed that the weapon used was like one of the ones seen in the police black museum. Wayne tells them they must find the killer.Dr. Ballan (Gerald Anderson as Gerald Andersen) tells Bancroft that he shouldnt smoke but that his real addiction is working on crime cases. After each of the recent murders Bancroft has seen the doctor for treatment: high blood pressure, racing heartbeat, etc. Bancroft refuses to take tranquilizers or slow down until the killer is caught. He insists that the police might never be able to find the perpetrator without his help. He promises the doctor that he will become obedient once the crimes are solved.Aggie (Beatrice Varley) is stocking her antique shop when Bancroft enters. She tells him she has an item he might be interested in: a music box/cigarette case. He says he is not interested but only wants clues. Finding a kris dagger with a wavy blade, he haggles with her and buys it. She tells him that she reads all his books and articles. He tells her that he believes because of her age that she is safe from the killer.Returning home to his office, Bancroft greets his assistant, Rick (Graham Curnow), who tells him there were a few crank calls after the last article came out. Bancroft insists that all information they publish be accurate. Rick asks if he should pick up the mail from readers or the cigars that came in from the tobacconist, but is told that they have more important work to do now. They go downstairs where Rick is told to unlock a door. Inside they step into Bancrofts own black museum, filled with figures of murderers and victims along with various instruments of torture and murder. Bancroft rattles on about how his museum is far superior to that of Scotland Yard and that his weapons will continue to be useful in the future. He also notes that his electronic machine will continue to make the museum alive.Meanwhile Dr. Ballon dictates notes to his nurse, in which he says he believes Bancroft is the victim of some aberration which if untreated will be fatal. He recommends psychiatric treatment.Bancroft is drinking at the apartment of Joan Berkley (June Cunningham), a blonde with whom he has been keeping company. She complains that he never takes her anywhere and that she is tired of it. He argues with her, saying that he deserves a medal for putting up with her. She insists he give her some money and he refuses. Taking up his cane, she tells him he is half a man without it, and would be no man without his money (he has been paying for her apartment, food and her company). He gets violent and smashes dishes and glasses on the table. She breaks up with him, telling him she will find a real man and for him to get out for good. He leaves in a huff.At the local tavern, Joan dances to juke box music. Many older men watch in amusement. One man asks to buy her a drink. She tells him she already has one from another man, which she sits down at a table with. She soon insults him and he leaves. Going to the bar, she tells the barman Ted (Richard Caldicot) how she intends to have fun from now on, and that no man will hold her down. He gives her a drink on the house, telling her to return soon.Walking alone down the street in the dark, she hears footsteps behind her. She turns and finds two constables (William Abney and Howard Pays) who walk her home and converse with her. Once home, she goes upstairs into her apartment and prepares for bed as the radio plays. Climbing into bed, she is horrified to observe a strange man with a horrible face looking down. She screams as he releases a guillotine which comes down, beheading her. Gathering up all his tools into a bag, he prepares to leave.Outside in the hall, neighbors complain about the scream from her apartment. One man (Sidney Bromley) knocks on the door, which suddenly opens and the culprit runs out, carrying his bag and pushing everyone aside.Supt. Graham questions two ladies in the hall (Hilda Barry and Nora Gordon) who claim it was an older man with a wrinkled face. Another man claims it was the devil or someone who looked like him. One woman tells that he wore a jacket like the young students wear. Graham thanks them all and leaves, telling the constable to remain.A little girl (Ingrid Cardon) tells the constable that she saw the man who entered the apartment earlier with a cane and unlocked the door with a key. Her mother suggests that she made this up or saw it on television. They are all told to go to bed by the constable, and all leave.At the crime scene, Graham and Lodge discuss what they see. Lodge says the head has not been found. The medical examiner (Frank Henderson) suggests maybe it was a guillotine and that she didnt have a chance. Fingerprint expert (Garard Green) tells them it will be hard to get a print off the shattered fragments of glass.A newspaper seller (Thomas Gallagher) hawks the latest edition which reads   KILLER STRIKES AGAIN . One man (Edgar Driver) comments on the story as does another woman.Bancroft is attending a party thrown by his publisher for his new book which has just come out when Graham enters. They immediately begin discussing the case, with Graham saying that Bancroft knows too much about the case. Before leaving, Graham mentions that the culprit has been caught and has confessed to all four crimes. Bancroft seems uninterested in the details but thanks him for the offer.The suspect, Tom Rivers (Howard Greene) demands to see Comm. Wayne and Supt. Graham. He wants to confess to additional murders committed before. He claims to have strangled a waitress in Dover with his bare hands. Bragging about how good he is with his hands, he claims he can build anything. He tells them his next weapon will be a death ray which he is working on, which he will shoot from his eyes. As his stories become wilder, Wayne and Graham leave. Outside the cell, the Sergeant (Geoffrey Denton) comes with a report saying that Rivers was discharged from the military and has been in and out of three mental institutions but is harmless. Graham says these false confessors always memorize the details to seem impressive. He suggests to Wayne that Rivers be detained longer so the press will comment, hoping the killer will be flushed out. Wayne agrees.Reading the paper, Bancroft gloats at the details offered by the press. Rick is surprised when Bancroft tells him they wont get a photo of Rivers for his article. He tells Rick that they will dig out other false confessions from his archives. Bancroft tells Rick he will be gone for a couple of hours and leaves. Rick waits until he is out of sight, looks at his watch, and rushes out.In the park, Rick meets his girlfriend, Angela Banks (Shirley Anne Field as Shirley Ann Field) and promises to tell his employer (Bancroft) about them soon. He confesses that Bancroft has a hold over him to the point where he is unable to refuse anything. She urges him to stand up for himself and tell about their relationship. He promises but swears he has to get back.Entering the antique shop, Bancroft finds Aggie waiting for him. She says he always comes after each murder. She has something for him: large ice tongs. He says he believes he would be interested in them. She tells him the price is £1200, to which he says she is out of her mind. She says he will pay it because she has helped him all this time but that he is the one making all the money. She confesses that she knows that it was he who killed the woman with the binoculars she sold him (because she saw her mark on them in the newspaper photo, which she shows him). He agrees to pay her, but says he doesnt carry that much cash with him. She tells him to bring it tomorrow and turns away. Grabbing the tongs, he seizes her neck with them. She falls bleeding to the floor. He wipes fingerprints off the tongs, the magnifying glass and the doorknob on his way out.The next morning Rick drives Bancroft to Scotland Yard where a newspaper seller announces that a shopkeeper has been murdered. Bancroft tells Rick that the police will be unable to find the murderer without any fingerprints. Rick is told to go back to work and that Bancroft will return by taxi.Bancroft comes in to gloat that the police are not able to do anything and asks to interview Rivers. He tells Graham that he will show in his article that the police are not infallible and will cast a sympathetic view in writing. Graham tells him he is too late; that Rivers was confined to a mental institution. Bancroft leaves, telling Graham  better luck next time in catching the murderer. Working in his museum, Bancroft is operating the machine when the door buzzer sounds. He tells Rick to answer it. Dr. Ballon comes in and confronts Bancroft, saying that Bancroft has perpetrated the murders and needs to be institutionalized. He tells him to accompany him to the police, where he will explain the aberration and have Bancroft put away. Pretending to surrender, Bancroft tells Ballon he will do so now. When Bancroft throws a switch on the machine, Ballon is struck with a death ray, killing him. He tells Rick to help him with the body. A chain is attached, and the body is lowered into a vat of acid for a few moments. When it is removed, only a skeleton remains. Bancroft notices that Rick seems hesitant to do his commands. He tells Rick to hang the skeleton up on the wall and take the night off.Bancroft is appearing at the local bookstore to autograph his book  TERROR IN THE NIGHT . Several people are seen telling him what to write. The bookshop manager (Gerald Case) tells him they sold over 200 copies and it was most successful. Inquiring about the next book, he is told it will be his best so far.Coming home early, Bancroft is horrified to see Rick kissing Angela in the black museum. She tells him they plan to be married soon and that Rick tells her everything about his work. Bancroft tells her next time he will lead her on a tour of his museum. He tells Rick to take her home because they have work to do. She insists that Rick was to take her to the fun fair. He suggests she wait upstairs while he dictates notes to Rick and then they can go. She says she will read his book and goes upstairs.Bancroft turns his anger on Rick and chews him out for bringing Angela into their secret museum. Rick admits he was wrong and wants to know how to appease him. Bancroft prepares a syringe, telling Rick he has waited too long between treatments. Giving Rick the injection, he ascertains that no one else knew about tonight. He tells Rick that one day all this will belong to him; that he will go further than Bancroft did-into the very black soul of man. He reveals that the injections prove that Dr. Jekyll and Mr. Hyde was not just a story, but a reality he is proving. He tells Rick to take Angela to the fair and do exactly as he is told.Rick and Angela walk around at the fair. When Rick bumps into a passing man, he becomes angry and Angela is surprised. He confesses that he lost his temper. He tells her that from what he has learned he will greatly benefit from Bancroft.They come to where a strength-test barker (Stuart Saunders) is calling for young men to hit the bell at the top of the pole by striking the bottom with a large hammer. The barker taunts Rick about his strength, but Rick insists he will do it. Taking the hammer, he pounds it and rings the bell to the astonishment of the barker and amusement of everyone watching.Angela encourages Rick to stand up to Bancroft and tell him off. She believes he should find another job. Maybe it is working for Bancroft that causes Ricks anger. He doesnt want to talk about it. She says it is a closed subject for tonight. They go into the Tunnel of Love.In the dark, several couples are heard talking. One couple has the woman wanting to smooch, and the other has the man wanting to. When Rick and Angela come out at the end, Ricks face has transformed into that of the killer. Angela screams and Rick stabs her with the dagger. He runs off through the fairway and goes into the Hall of Mirrors. Several people are looking at their distorted images in the mirrors. Rick comes in and looks at his face in one of them. A girl (Carole Ann Ford) notices him looking and asks to borrow his face to scare her boss. When he turns around with the dagger she screams and runs away. He leaves there and goes to the Ferris wheel where he climbs up high. Police and bystanders watch from below as the wheel is stopped.Bancroft brings the draft of his article to Graham and Lodge to inspect. Graham receives a call that the killer is trapped at the fair. They leave and Bancroft insists on coming along, saying he absolutely must have this story.Arriving at the fair, Graham and Lodge are directed to where Rick is atop the ride. They shout for him to come down and they will not shoot. Bancroft comes alongside and looks up at him. Lodge calls for him to come down once more. Rick calls down to Bancroft, telling him that he did everything Bancroft told him to do. Bancroft angrily calls for the police to shoot him down, saying hes a dangerous criminal. At this point Rick jumps and is shot by a policeman. He falls on Bancroft, stabbing him with the dagger. Graham and Lodge crowd around and Graham announces that the monster murderer has been caught."}