{"mid": "HostelPartIII", "IMDB_id": "tt1255916", "title": "Hostel: Part III", "plot": "A young stranger, named Travis, is seen going into a hotel room where a European couple, Victor and Anka, are currently staying. The couple offers Travis a drink of Vodka, but he declines and says he brought beer, enough for everyone. The three have a beer and Anka goes off to take a shower. Victor goes off to ask her a question when he finds her unconscious. Victor then calls for Travis's help. Travis walks in nonchalantly, and just stares at the couple, which reveals him to be not so innocent. Victor soon passes out from being drugged by the beer Travis gave him. Victor awakens in a cell in an abandoned building in the middle of nowhere. Two guards walk in and take Anka out of her cell.Meanwhile, Scott and his fiancee, Amy, are out in front of their home, and Carter, Scott's friend pulls up. The three chat a while and Scott leaves Amy to go with Carter to Las Vegas for Scott's bachelor party. Once in Vegas, Scott and Carter meet up with Mike and Justin, two of their buddies. The four go to a casino, where they end up meeting Kendra and Nikki, two escorts Carter had secretly paid to have sex with Scott. Kendra and Nikki tell the four men about a \"freaky\" party they could go to. The guys agree on going.The four guys take a taxi to an apparently abandoned building off the main strip. Confused, the guys knock on the door and are invited in by a bouncer. Once at the party, Kendra makes a move on Scott, but he denies her, and tells her about how he was previously unfaithful with Amy and almost lost her, and that he doesn't want it to happen again. Mike and Nikki walk in and kick out Kendra and Scott. Scott walks out of the party and passes out outside.Scott awakens in the morning in his hotel room with Carter and Justin. The three wonder where Mike is, and try calling his phone, but get his voice mail. They shake it off and assume he'll show up later.Meanwhile, Mike awakens in a cell of his own and starts freaking out. The two guards from before take Mike away and put him into a room. There is a glass screen separating him and several well-dressed people who are making bets on a game called 'Wheel of Misfortune' to how he will die. This group is part of the secret society, Elite Hunting Club, that abducts people and kills them for their twisted amusement. A middle-aged doctor comes into the room and cuts Mike's face off, killing him.That evening, Scott, Carter, and Justin are getting more worried having not heard anything from Mike, so they travel to Nikki's trailer. Scott and Carter break in while Justin waits outside. They look for Nikki and Mike, but they don't find anyone in Nikki's trailer. They hear a noise outside, and while checking it out, two people burst through the front door and throw Justin down. One of the people is Kendra, Nikki's friend. Kendra questions the three guys about why they broke into Nikki's, and the guys explain. Kendra reveals Nikki is also missing.Meanwhile, Nikki awakens and is dressed up in a cheerleading outfit. She is strapped onto a table in the same show room and a Hungarian-speaking client enters and teases her with a cockroach. He then sprays a chemical in and around her mouth that attracts cockroaches. He gets a jar full of cockroaches and dumps it on Nikki. All the cockroaches crawl into her mouth and suffocate her.After driving around, Scott, Carter, Justin, and Kendra get a text from \"Mike\" to meet him and Nikki in a hotel room. When they get there, everyone but Justin goes inside the room. When inside they get jumped by numerous men in black clothing and are gassed, and put in the back of a van. Justin hears the van and gets out to investigate. He ends up getting knocked out and put in the van by Travis.Scott, Carter, and Justin awake in individual cells along with Victor, the European man from the beginning. Kendra is still unconscious. The two guards take Justin away, and Carter reveals to the guards that he is a member of Elite Hunting Club by showing them his tattoo of a bloodhound dog which is the secret society's logo.Carter is brought to an office where he meets with Flemming, the European-accented leader of the Vegas branch of the murderous secret society. Flemming expresses a little disappointment to Carter for dragging his friends into this trap, because originally it was planned to only abduct Scott per Carter's request and the society only abducts people who will not be missed. However Flemming says, the two girls, Kendra and Nikki, that were accidentally taken to the facility (which is a huge abandoned factory surrounded by a barbed wire fence that sits on the outskirts of the city) will make up for the trouble. Carter assures Flemming that he will take care of the situation before any further mishaps occur. Flemming tells Carter that Justin has to become a collateral damage, and asks whether this will be a problem which has to be taken to the \"home office\" (implyed to be in Slovakia) and the heads of the society do not like problems. Carter says it isn't a problem.Justin gets strapped into a chair and a mist settles in the room with the members watching as usual. A woman client dressed in a costume comes out with a crossbow and shoots Justin multiple times, killing him while Carter, Travis, and another man, named Flemming, watch and place bets on the manner of death.Soon after, Scott gets taken into the room and is strapped into the chair. Carter comes in to the room, and Scott asks him why he's doing this. Carter reveals he wants Amy all for himself. Carter tells Scott about the secret society, Elite Hunting, and that this old building they are in is one of the many locations throughout the world (Slovakia, Macau, Hong Kong, Bangkok, Sao Paolo, and many others) where high paying clients can abduct and kill people as a form of 'torture-porn' for their own twisted enjoyment. Scott is shocked and doesn't know what to do. Carter tells Scott that once he kills him, he'll comfort Amy and she'll want to be with him. When Carter turns his back, Flemming orders Scott to be let go from the chair. Scott and Carter fight, and Scott ends up stabbing Carter multiple times. Scott breaks out of the room and runs away. Flemming tells Travis, his right hand man, to sound the alarm and lock down the facility.Back in the cell room, the Victor ends up killing one of the guards and gets the keys and frees himself. He kills another guard, but the guard simultaneously shoots Victor in the chest and kills him. Scott finds a cellphone and calls the police, and then frees Kendra. While running away, Kendra is shot by Travis. Scott and Travis fight, and Scott cuts his arm off and bludgeons Travis to death with Justin's crutch.Aware that the local police will be arriving, Flemming evacuates the building as the high-playing clients get into their limos and ride away, while he stays behind to set the building to explode (thus destroying the evidence and records about Elite Hunting) and attempts to drive away. However, Carter who is hiding in the back seat kills him and takes his car. Carter drives away from the building, but he sees Scott in his rearview mirror. Carter gets out and locks the front gate before Scott can get to him. Carter drives away while the building explodes with Scott still within the compound gates.Sometime later, Carter is comforting Amy, and she invites him to stay the night. He accepts. Amy goes to get champagne and when she returns, she tells Carter that Scott is still alive and suddenly stabs Carter in the hand with a corkscrew. A burned Scott comes behind Carter and drags him to the garage. Scott kills Carter with a huge electric gardening tool while Amy watches."}