{"mid": "HouseOfDracula", "IMDB_id": "tt0037793", "title": "House of Dracula", "plot": "Count Dracula (Carradine) greets the castle's owner, Dr. Franz Edelmann (Onslow Stevens). The Count, who introduces himself as \"Baron Latos\", explains that he has come to Visaria to find a cure for his vampirism. Dr. Edelmann agrees to help. Together with his assistants, Milizia (Martha O'Driscoll) and the hunchbacked Nina (Poni Adams), he has been working on a mysterious plant, the clavaria formosa, whose spores have the ability to reshape bone. Edelmann explains that he thinks vampirism can be cured by a series of blood transfusions. Dracula agrees to this, and Edelmann uses his own blood for the transfusions.\nThat night, Lawrence Talbot (Chaney Jr.) arrives at the castle. He demands to see Dr. Edelmann about a cure for his lycanthropy. Talbot is asked to wait. Knowing that the moon is rising, Talbot has himself incarcerated by the police. A crowd of curious villagers gathers outside the police station, led by the suspicious Steinmuhl (Skelton Knaggs). Inspector Holtz (Lionel Atwill) asks Edelmann to see Talbot, and as the full moon rises, they both witness his transformation into the Wolfman. Edelmann and Milizia have him transferred to the castle the next morning. Edelmann tells him that he believes that Talbot's transformations are not triggered by the moonlight, but by pressure on the brain. He believes he can relieve the pressure, but Talbot must wait for him to gather more mold from his spores. Despondent by the thought of becoming the Wolfman again, Talbot says he wants to kill himself and jumps into the ocean. He ends up in a cave below the castle.\nEdelmann searches for him and finds that Talbot survived the fall, but has turned into the Wolfman. The Wolfman attacks, but suddenly returns to his human form. In the cave, they find the catatonic Frankenstein monster (Strange), still clutching the skeleton of Dr. Niemann. Humidity in the cave is perfect for propagating the clavaria formosa, and a natural tunnel in the cave connects to a basement of the castle. Dr. Edelmann takes the monster back to his lab, but considers it too dangerous to revive him.\nThe Count tries to seduce Milizia and make her a vampire, but Milizia wards him off with a cross. Edelmann interrupts to explain that he has found strange antibodies in the Count's blood, requiring another transfusion. Nina begins shadowing Milizia, who is weakened by Dracula's presence; Nina notices that the Count casts no reflection in a mirror. She warns Edelmann of the vampire's danger to Milizia. Edelmann prepares a transfusion that will destroy the vampire. During the procedure, Dracula uses his hypnotic powers to put Edelmann and Nina to sleep; he then reverses the flow of the transfusion, sending his own blood into the Doctor's veins. When they awake, Dracula is carrying Milizia away. They revive Talbot and force Dracula away with a cross. Dracula returns to his coffin as the sun is beginning to rise. Edelmann follows him and drags the open coffin into the sunlight, destroying Dracula.\nEdelmann begins to react to Dracula's blood, and becomes evil. He no longer casts a reflection in a mirror. Falling unconscious, he sees strange visions of himself performing unspeakable acts. When he awakens, his face has changed to reflect his evil nature just like in his vision, then he returns to his normal self.\nEdelmann performs the operation on Talbot. Afterwards, he transforms again into his evil self and brutally murders his gardener. When the townspeople discover the body, they chase Edelmann, believing him to be Talbot. They follow him to the castle, where Holtz and Steinmuhl interrogate Talbot and Edelmann. Steinmuhl is convinced that Edelmann is the murderer, and assembles a mob to execute him.\nTalbot is cured by the operation, but Edelmann again turns into his evil self. He revives the Frankenstein monster, but the monster is very weak. Nina is horrified by Edelmann's transformation, and Edelmann breaks her neck and tosses her body into the cave. Holtz and Steinmuhl lead the townspeople to the castle. The police attack the Frankenstein monster, but the monster subdues them. Edelmann kills Holtz by accidental electrocution. Talbot shoots Edelmann dead. Talbot traps the Frankenstein monster under fallen shelving. A fire breaks out, and the townspeople flee the burning castle. The burning roof collapses on the Frankenstein monster."}