{"mid": "HouseIITheSecondStory", "IMDB_id": "tt0093220", "title": "House II: The Second Story", "plot": "Young urban professionals Jesse (Arye Gross) and his girlfriend Kate (Lar Park Lincoln) move into an old mansion that has been in Jesse's family for generations. They are soon joined by Jesse's goofy friend Charlie (Jonathan Stark), who brought along his diva girlfriend Lana (Amy Yasbeck), in the hopes of being discovered by Kate, who works for a record company.\nJesse has returned to the old family mansion after his parents were murdered when he was a baby. While going through old things in the basement, Jesse finds a picture of his great-great grandfather (and namesake) in front of a Mayan temple holding a crystal skull with jewels in the eyes. In the background is a man Jesse learns is Slim Reeser, a former partner of his great-great grandfather turned bitter enemy after a disagreement over who would get to keep the skull.\nReasoning that the skull must be buried with him, Jesse and Charlie decide to dig up Jesse's great-great-grandfather in the hopes of procuring the skull. They unearth the casket only to be attacked by the corpse (Royal Dano), who then shows himself to be friendly when Jesse reveals his identity as the senior Jesse's great-great grandson. Jesse and Charlie take the cowboy zombie, nicknamed \"Gramps\", back to the house, where he is horrified to learn that the skull has not rejuvenated his body as he had hoped.\nGramps and Charlie go out drinking and driving, and later the boys listen for hours to Gramps' stories of the old west and his outlaw life. Gramps explains that the house is actually a Mayan temple, and that each of its rooms act as a hidden doorway across space and time. He charges Charlie and Jesse with defending the skull against the forces of evil.\nDuring an impromptu Halloween party thrown by Charlie, Gramps makes an appearance (though he is overlooked as it is a costume party), Kate leaves Jesse (taking Lana with her) after he is seen with an old girlfriend by her smarmy boss (Bill Maher), and Jesse and Charlie pick up two new pets in the Jurassic era, a baby pterodactyl and a caterpillar-dog.\nBill (John Ratzenberger), an electrician and \"part-time adventurer\", arrives to inspect the house's old wiring. While seemingly a buffoon, he pulls a short-sword from his tool case and leads the boys through \"one of those time-portal things...you see these all the time in these old houses.\" In the mystic past, the three rescue a Mexican virgin who was about to be sacrificed, who seems to like Jesse but throws things at Charlie.\nEventually, Slim Reeser makes his appearance. Slim shoots Gramps, who then gives Jesse his guns and reveals that it was Slim who shot and killed Jesse's parents when he was a baby. Jesse jumps through a window into the Old West, and eventually succeeds in killing Slim by blasting off his head with a rifle. Gramps, who has been mortally wounded, begins to pass away. Gramps says goodbye to Jesse and tells hims he is so happy to have met his great-great-grandson. Gramps then gives a final warning about the power of the skull, encouraging Jesse to get what he wants from the enchanted object and then get rid of it. As Gramps passes, Jesse embraces him in a hug.\nThe film ends with the revelation that Jesse used the skull to travel back into the Old West, where he, Charlie and the rest of their strange friends drive off in a wagon, leaving the crystal skull behind, marking Gramps' new grave."}