{"mid": "HouseOfWhipcord", "IMDB_id": "tt0071628", "title": "House of Whipcord", "plot": "The film opens with a semi-nude young woman running down a highway and being picked up by a trucker.\nWhile at a party, French model Anne-Marie DeVarnet (Penny Irving) is shocked to see her photographer/boyfriend has put on display a recently shot photo where she is seen being arrested by police, for public nudity. Humiliated, Anne-Marie dumps her boyfriend and finds comfort in a party-goer named Mark E. Desade (Robert Tayman), who offers to take her to his country estate to escape the scandal her ex-boyfriend has caused her.\nUnfortunately, Anne-Marie discovers that Mark E. Desade (whose name shares the same pronunciation as the infamous Marquis de Sade) is a procurer for his sadistic ex-reform school matron mother, Margaret (Barbara Markham). Years earlier, Margaret was brought to trial when her corrupt reign over the reform school she worked at, led to a young French girl under her charge to kill herself (in truth, Margaret murdered her and made it look like a suicide). Found not guilty but fired from her job, she seduced the High Court Judge who heard her case (Patrick Barr). The judge left his wife for Margaret, who bore him a son (Mark) and who worked with her to turn his mansion home into a secret illegal prison for delinquent women. However, the now retired judge (blind and senile), is oblivious to the fact that his wife is now using the prison to torture and ultimately execute women, upon them gaining three demerits during their stay.\nAnne-Marie falls foul of Margaret's cruelty, as she reminds the evil warden of the charge she killed and whose death cost her her job. Meanwhile, Anne-Marie's friend finds Mark, who has discovered his mother's murderous deeds at the prison after watching his mother's minions dispose of a corpse of a prisoner.\nIn the end, Anne-Marie escapes, is recaptured, and then hanged after earning a third demerit. Her friends find her prison, and as the police search for their way in, Mark is killed by his mother, who kills herself in remorse with the same noose she set up for Anne-Marie. The judge and his wife's henchwomen are arrested, and the prisoners are freed, shown being taken to hospital."}