{"mid": "HouseOfGames", "IMDB_id": "tt0093223", "title": "House of Games", "plot": "Margaret Ford is a psychiatrist who has achieved success with her recently published book, but who feels unfulfilled. During a session one day, Billy Hahn, a patient, informs her that his life is in danger because he owes money to a criminal figure named Mike and brandishes a gun, threatening to kill himself. Margaret persuades him to surrender the weapon to her and promises that she will help.\nThat night, Margaret visits a pool hall owned by Mike and confronts him. Mike says that he is willing to forgive Billy's debt if Margaret accompanies him to a back room poker game and identifies the tell of George, another player. She agrees, and spots George playing with his ring when he bluffs. She discloses this to Mike, who calls the bluff. However, George wins the hand and demands that Mike pay the $6,000 bet, which he is unable to do. George pulls a gun but Margaret intervenes and offers to pay the debt with a personal check. She then notices that the gun is actually a water pistol, and realizes that the entire game is a set-up to trick her out of her money. She is excited, however, and returns the next night to request that Mike teach her about cons so that she can write a book about the experience. Mike appears skeptical, but agrees.\nMike begins to enchant Margaret by showing her several small tricks. Eventually, the two steal a hotel room and make love. While in the room, he instructs her that all con artists take a small token from every \"mark\" to signify their dominance. While Mike is in the bathroom, she takes a small pocket knife from the table, believing that it belongs to the man who rented the room. Afterwards, Mike says that he is late for another, large con with his associates at the same hotel. Margaret is eager to tag along and, reluctantly Mike allows it. The con involves Mike, his partner Joey and the \"mark,\" a businessman discovering a briefcase full of money, and taking it to a hotel room. There they will discuss whether to turn it in or split it among themselves. In the hotel room, Margaret discovers that the businessman is actually an undercover policeman, and the trick is a sting operation. She tells Mike and they attempt to escape, but the policeman blocks their way and tries to arrest them. There is a struggle that ends with Mike accidentally shooting the officer dead. The three leave via the stairwell and end up in the garage, where they force Margaret to steal a car, driving past two uniformed police officers, the con men concealed in the back seat. While abandoning the car, they realize that the briefcase, containing $80,000 borrowed from the Mafia for the con, has been lost. Margaret finally offers to pay Mike $80,000 of her own money so he can pay back the mob.\nMike tells Margaret that they must split up so as not to draw any attention from the police, and says that he is flying away to hide. Margaret is riddled with guilt but, by chance, spots Billy driving the same red convertible. She tracks him to a bar, where she spies on Mike and the entire group, including the undercover policeman, discussing how the preceding events were a scheme to con her out of $80,000.\nAfter overhearing that Mike is flying to Las Vegas that night, Margaret waits for him at the airport. She says that she's been so worried about the police that she has withdrawn her entire life savings, and pleads to start a new life with him. They go to a restricted baggage handling area that is deserted, where Mike finds out he's being tricked when she lets it slip that she stole his pocket knife. He says that he can't return her money because it has already been divided. Margaret, however, produces Billy's gun and demands that he beg for his life. Mike refuses, thinking that he is calling her bluff, but Margaret shoots him in the leg. When Mike curses her, she shoots him three more times, killing him. She calmly conceals her gun and walks way.\nLater, Margaret is shown just returned from a vacation, having moved on from the ordeal. While talking with a colleague, she seems to show no remorse for killing Mike. While at a restaurant, Margaret distracts another diner so as to steal a gold lighter from her purse, relishing the brief thrill."}