{"mid": "HowardsEnd", "IMDB_id": "tt0104454", "title": "Howards End", "plot": "In Edwardian England Helen Schlegel (Helena Bonham Carter) becomes engaged to Paul Wilcox during a moment of passion, while she is staying at the country home of the Wilcox family, Howards End. The Schlegels are an intellectual family of Anglo-German bourgeoisie, while the Wilcox's are conservative and wealthy, headed by hard-headed businessman Henry (Anthony Hopkins). Helen and Paul quickly decide against the engagement, but Helen has already sent a telegram informing her sister Margaret (Emma Thompson), which causes an uproar when the sisters' Aunt Juley (Prunella Scales) arrives and causes a scene. Months later, when the Wilcox family takes a flat across the street from the Schlegels in London, Margaret resumes her acquaintance with Mrs. Wilcox (Vanessa Redgrave), whom she had briefly met before. Ruth is descended from English yeoman stock and it is through her family that the Wilcoxes have come to own Howards End, a house she loves dearly.\nOver the course of the next few months, the two women become very good friends, even as Mrs. Wilcox's health declines. Hearing that the lease on the Schlegels' house is due to expire, Ruth bequeaths Howards End to Margaret on her death bed. This causes great consternation to the Wilcoxes, who refuse to believe that Ruth was in her \"right mind\" or could possibly have intended her home to go to a relative stranger. The Wilcoxes burn the piece of paper on which Ruth's bequest is written, deciding to ignore it completely. Henry begins to develop an attraction to Margaret, offering to assist her in finding a new home. Eventually he proposes marriage, which Margaret accepts.\nSome time before this the Schlegels had befriended a young clerk, Leonard Bast (Samuel West), who lives with a woman of dubious origins named Jackie (Nicola Duffett). Both sisters find Leonard remarkable, appreciating his intellectual curiosity and desire to improve his lot in life. The sisters pass along advice from Henry to the effect that Leonard must leave his post, because the insurance company he works for is supposedly heading for bankruptcy. Leonard takes the advice and quits, but has to settle for a job paying much less, which he eventually loses altogether. Helen is later enraged to learn that Henry's advice was wrong and the company was perfectly sound.\nMonths later, Henry and Margaret host the wedding of his daughter Evie (Jemma Redgrave) at his Shropshire estate. Margaret is shocked when Helen arrives with the Basts, who she has found living in deep poverty. Considering that Henry is responsible for their plight, she demands he help them. However Jackie becomes drunk at the reception, and when she sees Henry she recognizes and exposes him as a former lover from years ago. Henry is embarrassed and ashamed to have been revealed as an adulterer in front of Margaret, but she forgives him and agrees to send the Basts away. After the wedding, Helen, upset with Margaret's decision to marry a man she loathes, leaves for Germany, but not before making love to Leonard.\nMargaret and Henry marry, with the pair arranging to use Howards End as storage for Margaret's belongings. After months of only hearing from Helen through the odd postcard, Margaret grows concerned. When Aunt Juley falls ill, Helen returns to England to care for her but avoids seeing Margaret. Thinking that Helen is mentally unstable, Margaret lures her to Howards End to collect her belongings, only to confront her with a doctor. However on first glance she realizes that Helen is heavily pregnant, with Leonard Bast's child. Helen insists on returning to Germany to raise her baby alone, but asks that she be allowed to stay the night at Howards End before she leaves. When Margaret requests this from Henry, he stubbornly refuses and the two bicker.\nThe next day, Leonard, still living unhappily in poverty with Jackie, leaves London and travels to Howards End to see the Schlegels. When he arrives he finds the pair, as well as Henry's brutish eldest son Charles (James Wilby). Charles quickly realizes that Leonard is the baby's father, and begins assaulting him for dishonoring Helen. In his rage he beats him with the flat of a sword, which causes Leonard to have a heart attack and die. The police charge Charles with manslaughter and Henry breaks down when Margaret tells him that she is leaving him to help raise Helen's baby.\nA year later Paul, Evie and Charles's wife Dolly gather at Howards End. Henry and Margaret are still together, and living with Helen and her young son. Henry tells the others that upon his death, Margaret will receive Howards End, but no money, at her own request. Dolly points out the irony of Margaret inheriting the house, revealing Mrs. Wilcox's dying wish to Margaret for the first time. Henry admits to what happened, and Margaret appears to forgive him."}