{"mid": "HowILiveNow", "IMDB_id": "tt1894476", "title": "How I Live Now", "plot": "Daisy, a neurotic and anorexic American teenager, is sent to the English countryside for the summer to stay with her Aunt Penn and her cousins, Eddie, Isaac, and Piper. She arrives at Heathrow Airport to tightened security and reports of a bombing in Paris, and Isaac drives to her cousins' farm, which she discovers to be dilapidated and very messy. Although initially abrasive, Daisy warms to them upon learning that her deceased mother used to stay there frequently. She also falls in love with Eddie, her eldest cousin, finding him to be as introverted and strong-willed as she, and noticing his unusual, almost mystical connection to animals. A few days after her arrival, her aunt flies to Geneva to attend an emergency conference because she is an expert in terrorist extremist groups, and the group takes advantage of her absence to explore their local woodlands.\nTheir summer fun ends when a terrorist coalition detonates a nuclear bomb in London that potentially kills hundreds of thousands; the nuclear fallout reaches as far away as their home. In the aftermath, electricity goes out, and they learn from an emergency radio broadcast that martial law has been imposed. The next day, an American consular official arrives at the house and offers Daisy passage home. Unable to help her cousins, he advises them to remain indoors and wait for evacuation. After they move to a nearby barn, Daisy has sex with Eddie and decides that she would rather stay with them. The next day, however, the British Army storms the shelter and takes them to a nearby town. There, they learn boys and girls are to be evacuated to separate parts of the country. Both Eddie and Daisy resist separation, and Daisy is restrained with cable ties; Eddie calls to her to return to their home when she gets the chance. Daisy and Piper are taken to the home of a British Army major and his wife, who foster them. Determined to escape, Daisy discreetly begins hoarding supplies, but their neighbourhood is attacked by the enemy before she has time to take everything she needs.\nAs Daisy and Piper hike through the countryside, Daisy interprets her dreams of Eddie as indications of his current situation. One night, Daisy is woken up and witnesses a gang-rape. She and Piper flee, but after Piper starts whining, Daisy threatens to abandon her. Already disturbed by the prior experience, they discover a massacre at the camp where Isaac and Eddie were taken. Daisy reluctantly checks the bodies; although Eddie is not among the dead, Isaac's body is. She mournfully takes his glasses and later buries them. As they leave, they are spotted by two armed men, who chase them through the woods. Piper and Daisy decide to hide, but the men discover Piper. Daisy threatens them with a gun and impulsively shoots them both; she kills one and wounds the other. The horror of what she has done, along with her fears, begins to take its toll on Daisy. Later, she realises that they have lost their map and compass, and the girls are on the verge of giving up when they see Eddie's pet hawk fly overhead. They realise it will lead them home and follow it.\nUpon arriving home, their elation turns to horror when they discover that the military garrison stationed there has been massacred; the house is ransacked and empty; only Jet, Piper's dog, remains. Eddie is not at the barn where they took shelter either, and although Piper is elated to be home, Daisy breaks down in tears outside. The next day, however, the two hear Jet barking, and Daisy runs out into the woods, where she finds Eddie lying unconscious; he has severe burns, gashes, and his eyes are swollen shut. As she nurses him, a ceasefire is announced, electricity is returned, a new government forms, and the country begins to recover. However, it becomes clear Eddie suffers from post-traumatic stress disorder and is mute. After he accidentally cuts himself while gardening, Daisy tenderly sucks the blood from his cut, which mimics his actions earlier. She kisses Eddie, hoping he may soon recover."}