{"mid": "HumanDesire", "IMDB_id": "tt0047101", "title": "Human Desire", "plot": "Returning Korean War vet Jeff Warren (Glenn Ford) is a train engineer, usually working alongside Alec Simmons (Edgar Buchanan). Alec's daughter Ellen (Kathleen Case) is in love with Jeff.\nCarl Buckley (Broderick Crawford) is a gruff, hard-drinking assistant yard supervisor married to the younger and more vibrant Vicki (Gloria Grahame). When Carl is fired for talking back to his boss, he pleads with Vicki to go into the city to see the man she used to work for, John Owens (Grandon Rhodes), a railroad executive who can get Carl his job back. Unbeknownst to Carl, Vicki did more than just work for Owens, and she allows Owens to bed her again in order to get Carl his job.\nCarl suspects Vicki and in a violent argument the truth slips out of her. Carl beats her and forces her to write a letter to Owens, setting up a meeting in a train car. On the trip Carl goes with Vicki, barges into the room when Owens opens the door, and kills Owens with a knife.\nJeff, who is taking a comp ride on this run, happens to be having a smoke in the vestibule near Owens's compartment. Carl makes Vicki go to Jeff as a distraction so Carl can hide himself.\nAt the inquest for the murder of Owens, Jeff is called as a witness. The various passengers on the train that night are asked to stand. When he's asked if he saw any of the people that night, Jeff looks intently at Vicki, then answers no.\nVicki and Jeff begin an affair. Jeff wants Vicki to leave Carl and marry him. She finally explains about the killing, and the letter Carl keeps hidden so Vicki will be forced to stay with him. She suggests the only way they'll ever be free is if Jeff kills Carl, making it look like a drunken accident at the rail yard.\nJeff follows the drunk Carl through the yard. But he returns to Vicki saying he couldn't do it, and accuses Vicki of setting him up from the start just so he would kill her husband. She protests that she really does love Jeff, but it's too late. He leaves her, but gives her one thing as he does––the letter, which he took from the drunken Carl without his knowledge.\nVicki is now free to leave Carl. She gets on the next train. But shortly after it leaves the station, Carl enters her compartment, accusing her of running away with Jeff. Vicki denies it and defies Carl, who then realizes he no longer has the letter. When Vicki confronts him with the whole truth about her and Owens, Carl strangles her to death.\nJeff, happily operating the train, has thoughts about taking Ellen to a dance."}