{"mid": "HuntForTheWilderpeople", "IMDB_id": "tt4698684", "title": "Hunt for the Wilderpeople", "plot": "Ricky Baker (Dennison), a juvenile delinquent who was abandoned by his mother, is taken by child welfare services officer Paula and police officer Andy to live in a remote farm with foster mother Bella and her husband, the cantankerous Hec (Neill). Hec is remote, but Bella quickly manages to break through Ricky's defensive shell by taking him hunting and giving him a dog for his birthday, which he names Tupac after his idol Tupac Shakur.\nWhen Bella suddenly passes away and Hec tells Ricky that child services will take him back, Ricky ineptly fakes his suicide by burning a barn and runs away into the bush with Tupac, where he is completely unable to cope and gets lost. Hec finds him easily but injures his leg in a fall, forcing the two to camp for a period of time. The authorities meanwhile have found the house empty and the barn burnt down, and come to the conclusion that the bereaved and mentally unstable Hec has abducted Ricky. The impression is strengthened after an encounter with three foolish hunters who get the idea that Hec is abusing Ricky sexually. Hec reveals to Ricky that he has served prison time for manslaughter and is illiterate. Ricky, in turn, says his only friend in foster care has died and that his only options are risking the same fate in the foster system, or serve time in juvenile prison. The pair agrees to disappear into the bush.\nA national manhunt ensues, and the two slowly bond while working together to escape arrest. Upon finding another hut, they encounter an unconscious, diabetic ranger. Ricky leaves to find help and runs into a girl his age. She takes him back to her house and introduces him to her dad. Ricky stays the night and returns to the hut where Hec was supposed to be the next morning. Ricky finds the place to be swarming with police, led by Paula. Ricky runs away. He later encounters Paula and Andy in the bush, separated by a valley. Paula attempts to bribe Ricky, asking him to say that Hec was a sex offender. In return, she tells him that he won't ever go to juvenile prison. Ricky declines and runs away. Ricky catches up to Hec by remembering the survival strategies Hec taught him, and they continue their travels. After a traumatic encounter with a wild boar during which Hec's dog is mortally wounded, forcing Hec to euthanize him, Ricky reveals he has been carrying Bella's ashes and originally planned to deliver them to \"where the earth meets the blanket of the sky,\" as per her wishes. They scatter Bella's ashes into a remote lake high in a mountain range. Ricky and Hec find a man living out on his own called Psycho Sam (Darby). Sam lets them stay the night. After five months of surviving in the wilderness and several close calls, they are finally caught following a car and helicopter chase, and Ricky accidentally shoots Hec in the buttock. Hec gets remanded and Ricky is taken in by the kind family he met while on the run. After Hec's release from jail, Ricky, with his new foster family's permission, returns to the bush with Hec to photograph the huia, an extinct bird they had re-discovered during their time on the run."}