{"mid": "HydeParkOnHudson", "IMDB_id": "tt1477855", "title": "Hyde Park on Hudson", "plot": "In spring 1939, Sara Delano, the mother of Franklin D. Roosevelt, asks his sixth cousin Margaret \"Daisy\" Suckley to visit the ill President of the United States at their country estate in Hyde Park, New York. Although Daisy and Roosevelt had not seen each other for years, the distant relatives form a romantic relationship, and Roosevelt often asks Daisy to visit Hyde Park when he stays with his mother. Daisy becomes one of the several women close to Roosevelt, including Sara; Missy LeHand, the president's secretary; and Eleanor, the president's wife. Despite his power, the president is often unable to control the other women; the quiet, shy Daisy is his confidante, and he tells her that Top Cottage will be their shared refuge after his presidency.\nIn June 1939, King George VI and his wife, Queen Elizabeth, visit the United States, during which they stay with the Roosevelts at Hyde Park. The British hope that the visit will improve the chances of American support during the future war with Germany. George—who is king because his brother Edward VIII abdicated—is nervous, because of the importance of the visit, because he stutters, and because of having to eat a hot dog for the first time at a picnic in his honor. Roosevelt reassures George by citing his own inability to walk, and observes that others do not see their handicaps because \"it's not what they want to see\". The president tells the king that he hopes to overcome Americans' reluctance to help Britain.\nThe night the king and queen arrive, Daisy discovers LeHand is having an affair with Roosevelt. LeHand tells a shocked Daisy that their respective relationships with the president are not his only ones, mentioning Dorothy Schiff and Lucy Mercer Rutherfurd, and that Daisy must accept sharing Roosevelt with other women. At the picnic the next day the king successfully eats a hot dog for a photo op, and Daisy, in a voiceover, states that the visit helped the two countries form a Special Relationship. Daisy rejects Roosevelt's requests to see her until he calls on her in person; they reconcile, and Daisy accepts her role as one of the president's mistresses. As years pass, Daisy watches Roosevelt become frail as a wartime leader; nonetheless everyone, she says, \"still [looked] to him, still seeing whatever it was they wanted to see\"."}