{"mid": "IAmNumberFour", "IMDB_id": "tt1464540", "title": "I Am Number Four", "plot": "A prelude of the killing of one of the Garde children—No. 3—by Mogadorians. This story is about a 15-year-old boy named John Smith. He has been on the run from the age of 4, and he is from a planet called Lorien.\nMost of the book is told in the first-person by Number Four, who takes the name John Smith. As the story begins, he and his guardian or Cepân, Henri, learns of the death of Number Three and move to Paradise, Ohio, assuming new identities. There, John befriends conspiracy theorist Sam Goode and \"adopts\" a dog identified by its name tag as \"Bernie Kosar\". He also meets and is attracted to a fellow student, Sarah Hart, who is working as a photographer. Sarah's ex-boyfriend, football player Mark James, is a bully who torments both John and Sam.\nDuring the Halloween festival Sam mentions that he knows about Mogadorians from a magazine, They Walk Among Us, a revelation that alarms both John and Henri. Mark and his friends organize a nasty surprise during the haunted hayride: Sarah, John and Sam are left stranded in the woods, where Mark plans to beat John up. John uses his \"legacies\", which are akin to superpowers, to fend off his attackers and rescues Sarah. In the darkness Sarah does not see John use his legacies, and he quietly warns Mark not to talk (or to let his friends talk) about what happened.\nSarah and John's relationship develops. Henri continues training John to use his legacies, now with an increasing sense of urgency. Henri is unsettled, and tells John that it is not safe to stay. He is also concerned as John is late in developing his telekinesis, a power that he will need to fight the Mogadorians. Later, it is revealed that Sam has seen enough to arouse his suspicions, but John allays them by bluffingly 'admitting' to being an alien. He finds out more about the magazine Sam reads by borrowing a copy. Sam speaks of his belief that his father has been abducted by aliens.\nHenri discovers where the magazine is printed, and drives the two-hour car trip to Athens, Ohio, to find out more. John attends a Thanksgiving dinner with Sarah's family, but worries about Henri, who does not answer text messages. In his agitated state, John's telekinetic power manifests, though uncontrolled, and he leaves. He calls Sam for help, and they take Sam's father's long-unused truck and head for Athens, where they succeed in rescuing Henri. During the rescue, Sam is made fully aware of John's and Henri's alien secret, and John's legacies develop significantly. On their return, Henri insists they leave Paradise. John refuses, using his new found powers to express his adamance, and Henri relents.\nA few months pass, during which John trains in the use of his legacies. Henri gradually relaxes as John becomes more adept. At a party at Mark's house, a major fire breaks out, trapping Sarah, so John uses his powers to rescue her. He then reveals his secret to Sarah, and they lie to the police and a reporter about what happened. Later on, John also lies to Henri, in order not to reveal how much he has told Sarah.\nBut John's lies are revealed when a video is released on YouTube. Henri is furious, and demands they leave immediately. John again uses his powers to stop him, and desperately races to the school, knowing that Sarah is in danger. He finds Sarah, but the Mogadorians have already arrived. The Mogadorians have brought an enormous beast called Piken, and smaller, but still deadly, creatures called Krauls. These creatures are sent to track and kill the Loric. John and Sarah are joined by Number Six (who has been looking for them since Three's death) and later by Henri, Mark, and Bernie Kosar (\"the dog\"). John sends Mark off, exhorting him to protect Sarah. A furious battle ensues, during which Six exhibits powers of invisibility and control of the weather, and Bernie Kosar is revealed to be a Chimæra. Sam arrives partway through the battle.\nJohn kills a soldier, Bernie Kosar battles a Piken, and at key moments John is helped by his human friends, but in the end they are depleted and weakened by numbers and power. Six is wounded and taken to relative safety. John uses an ability he was barely aware of to communicate with a beast brought by the Mogadorians and to turn it against them. Henri is killed, but before dying exhorts John to read a letter he left for him. John survives, though he is very weak, and the Mogadorians are defeated.\nPromising to return for Sarah, John leaves Paradise, along with Number Six, Sam, and Bernie Kosar."}