{"mid": "Iboy", "IMDB_id": "tt3171832", "title": "iBoy", "plot": "Living in a gang ridden part of London, teenage boy Tom struggles to get by with the help of his best friend Danny who gets him a new phone and encourages him to go after his longtime friend Lucy who lives nearby. Lucy asks Tom to help her study for exams to which he happily agrees. Arriving at her flat that night, Tom sees Lucy's brother unconscious and a group of masked thugs coming out of Lucy's room, having raped her and recorded the event. Tom flees and attempts to call the police, but is shot in the head and rendered unconscious.\nTom awakens days later, with his doctor informing him that shrapnel from his phone is embedded in his head. Later that day, Tom begins to hear phone transmissions and can visualize digital signals. Using his new found abilities, Tom pieces together who had attacked Lucy and begins to take them down one by one. Meanwhile, Lucy has become a shut in with Tom her only source of hope as they enjoy a meal together outside for the first time since the incident. After a confrontation, Tom's vengeance grows and he tracks down those who gave the orders to hurt Lucy and raids their leader's home; damaging their electronics and stealing their hidden cache of cocaine which Tom plants on the attackers and tips the police off.\nFurthering his vigilantism, Tom adopts the alias \"iBoy,\" texting Lucy that he's going to set things right for her, posting his acts online, and working his way to take out more drugs that are coming in. During another raid, Tom gets trapped by the gang and is beaten severely but barely manages to escape. He stumbles his way home, but passes out in a park on the way, missing his exams and breaking a promise to Lucy. When he goes home, Tom's grandmother is held at gunpoint and the crime boss known as Ellman he's been attempting to thwart threatens Tom to give back the money he stole in exchange for Lucy's and his grandmother's safety. Tom reluctantly agrees and begins to use his powers for both Ellman and to track and help Lucy, who's been kidnapped by those who assaulted her before.\nTom is driven to the kidnapping site, where he was able to call the police, but they were unable to find anything there. Lucy was able to get a gun away from the kidnappers, but is unable to escape before Tom and Ellman arrives. Though his powers were diminished due to his beating, Tom is able to overload everyone's cell phones to explode, however, Ellman threw his away and flees outside. Tom attempts to subdue him with help from Lucy, but both are unable to do so until Tom unleashes a pulse from his brain; knocking all of them out. Tom awakens later in the hospital with his grandmother by his side.\nGoing home again, Tom sees Danny (who had ratted him out to Ellman), who wants to pay Tom back for what he did to him. Tom rebuffs him, saying he never took down the person who recorded Lucy's attack, suggesting it was Danny. Tom meets Lucy on the roof of their building, who's made a picnic for the two of them and they share a kiss while looking out to the skyline."}