{"mid": "IConfess", "IMDB_id": "tt0045897", "title": "I Confess", "plot": "Father Michael Logan (Clift) is a devout Catholic priest in Ste. Marie's Church in Quebec City. He employs German immigrants Otto Keller (O. E. Hasse) and his wife Alma (Dolly Haas) as caretaker and housekeeper. Otto also works part-time as a gardener for a shady lawyer called Villette.\nThe film begins late one evening, as a man wearing a priest's cassock walks away from Villette's house, where Villette lies dead on the floor. Shortly afterward, in the church confessional, Keller confesses to Father Logan that he accidentally killed Villette while trying to rob him. Keller tells his wife about his deed and assures her that the priest will not say anything because he is forbidden from revealing information acquired through confessions.\nThe next morning, Keller goes to Villette's house at his regularly scheduled gardening time and reports Villette's death to the police. Father Logan also goes to the crime scene after hearing Mrs. Keller mention that her husband is there.\nAt the police station, two young girls tell Inspector Larrue (Malden) they saw a priest leaving Villette's house. This prompts Larrue to call Father Logan in for questioning, but Logan refuses to provide any information about the murder. Now suspecting Logan, Larrue orders a detective to follow Logan and contacts Crown Prosecutor Robertson (Brian Aherne), who is attending a party hosted by Ruth Grandfort (Baxter) and her husband Pierre (Roger Dann), a member of the Quebec legislature. Ruth overhears Robertson discussing Logan, and Larrue's detective discovers her identity by following her home the next day after she meets with Logan to warn him that he is a suspect.\nLarrue calls Ruth and Logan in for questioning, and Ruth explains what happened, narrating a series of flashbacks: She and Logan fell in love when they were childhood friends, but he went off to fight in World War II with the Regina Rifle Regiment and eventually stopped writing to her, so she married Pierre. The day after Logan returned from the war, he and Ruth spent the day on a nearby island. A storm forced them to shelter for the night in a gazebo, and Villette found them there in the morning, recognizing Ruth as being Mrs. Grandfort. The next time Ruth saw Logan was several years later, when he was ordained as a priest.\nVillette recently asked Ruth to persuade her husband to help him escape a tax scandal, and when she refused, he tried to blackmail her by threatening to publicize the night she spent with Logan. She met with Logan on the night of the murder, and they agreed to visit Villette in the morning.\nRuth's meeting with Father Logan almost provides him with an alibi, but Larrue has evidence showing that the murder occurred after their meeting, and the blackmail suggests a possible motive for Logan to have killed Villette.\nKnowing he will be arrested, Logan turns himself in the next day at Larrue's office. Keller has planted the bloody cassock among Logan's belongings, and when Logan is tried in court, Keller testifies that he saw Logan enter the church after the murder, acting suspiciously.\nThe jury barely finds Father Logan not guilty, but the crowd outside the courthouse harasses Logan as he leaves. This upsets Keller's wife so much that she starts to shout out that her husband is the murderer, but he shoots her, resulting in her death. He then runs away and is pursued by police officers. Larrue finally guesses that Keller is the murderer, corners him in the grand ballroom of the Château Frontenac, and unknowingly tricks him into confessing his sins as well as his previous reconciliation. A police sharpshooter kills Keller when Keller tries to shoot Logan, and Keller calls out to Father Logan in extremis and dies immediately after Logan absolves him of his sins."}