{"mid": "Identity", "IMDB_id": "tt0309698", "title": "Identity", "plot": "A convict named Malcolm Rivers awaits execution for several vicious murders that took place at an apartment building. Journals belonging to Malcolm were discovered mis-filed in the case evidence, so it was not introduced during the trial. Malcolm's psychiatrist, Dr. Malick, and his defense attorney argue that the evidence was suppressed and move to stay the execution with this additional evidence that Malcolm is legally insane. With this late evidence brought forth, a midnight hearing takes place, to determine if the journal is adequate evidence to grant their motion.\nMeanwhile, ten strangers find themselves stranded in the middle of a torrential rainstorm at a remote Nevada motel, run by Larry Washington. The group consists of an ex-cop, now limousine driver, Ed Dakota; Caroline Suzanne, an actress popular in the 1980s; Officer Rhodes, who is transporting convicted murderer Robert Maine; Paris Nevada, a prostitute; newlyweds Lou and Ginny; and the York family, George, Alice and their nine-year-old son Timmy. The Yorks are in crisis because Alice has been struck by Ed's car.\nWith both ends of the road completely flooded, the group is forced to spend the night at the hotel, but an unidentified killer begins to murder them one by one. Caroline is the first to be killed. Ed finds her severed head in a clothes dryer, with Rhodes and Larry coming in just after. Rhodes pulls what appears to be a key for room 10, the room he and Maine are checked into, from the dryer. When they go to check the room they discover Maine has escaped. The rest of the guests are gathered to tell them what has happened. They are told to stay together while Ed and Rhodes search for Maine, though Larry sneaks off to steal Caroline's wallet. Ginny becomes more and more agitated, eventually fleeing to her room. She and Lou argue as he chases after her, but he is murdered while she is hiding in the bathroom.\nMaine runs through the hills towards a set of lights in the distance. When he reaches them, he breaks into a darkened building, but when he looks outside he realizes he is in the diner, back at the motel. He is discovered by Ed and Rhodes, who beat him to unconsciousness. They put a reluctant Larry in charge of guarding him, who eventually sneaks off again. While Ed is documenting Lou's murder with a disposable camera, he finds a key marked 9 on the body, even though Lou and Ginny were in room 6. He shows the key to Rhodes and Paris speculates that it's a countdown. When they see Larry outside, they go to check on Maine, and find him also dead - half of Larry's baseball bat shoved down his throat and a key marked 8 on the floor by his foot. While Ed and Rhodes are accusing Larry, he tries to escape by grabbing Paris and threatening to cut her throat. As she fights him off, a dead body falls out of the freezer. Larry attempts to escape in his truck, claiming he did not kill anybody; he accidentally runs over George, killing him.\nAt the hearing, the contents of Malcolm's diaries are revealed, indicating Malcolm suffers from an extreme case of dissociative identity disorder, harboring eleven distinct personalities. His journal contains entries written by his different personalities, each with distinct handwriting and writing style, as if they were the personal thoughts of several different people. His defense attorney argues that Malcolm is completely unaware of the crimes for which he is being executed, which is in violation of existing Supreme Court rulings. Dr. Malick is introducing the concept of integrating the personalities of someone with dissociative identity disorder, when Malcolm arrives, strapped into a wheelchair.\nAt the hotel, the survivors tie Larry up, and he tells them his story - of taking over the hotel after finding the real hotel manager dead, of apparent natural causes, while leaving Vegas broke and desperate. The others start to believe he really did not kill anyone and an angry Rhodes declares that they are going to all stay in the same room until dawn, and he will shoot anyone who tries to hurt them. Ginny recounts the plot of one of the film adaptations of And Then There Were None, speculating that they have some connection; they discover that Larry and Paris are both from Polk county in Florida, and Paris tells them that she is moving back there to purchase a lime and orange grove.\nIt is discovered that Alice has apparently died from her injuries. A key marked 6 is found by her body, so they check George's body and find the key marked 7 in his pocket, even though they both died from clear accidents. Ed tells Paris to take Ginny and Timmy away in Ginny's car, for them to just continue driving until dawn. Ginny and Timmy die when the car explodes, but after putting out the fire their bodies are nowhere to be found. As Ed, Rhodes, Paris and Larry leave the explosion they find that the rest of the bodies have also disappeared, along with the blood and any other signs of the deaths. Paris, yelling in hysterics at their unknown assailant, says that her birthday is the next week. Larry mentions that his birthday is also next week, on the 10th - Paris, Rhodes and Ed all reveal that is also their birthday. They checked Larry's photocopies of the guests' IDs and confirm that all 11 of them were born on May 10 - which is also Malcolm's birthday, and the day he committed the murders. While the others deal with a down, live power line, Ed looks more closely at the IDs and realizes they also all have names linked to U.S. states. He starts to recite a rhyme that Malcolm recites earlier in the film, and through a series of flashes finds himself seated at head of the table, at Malcolm's hearing.\nAfraid that he has blacked out again and recognizing Dr. Malick as his psychiatrist, Ed tells them about the events happening at the motel. Malick explains to \"Ed\" that he is really one of Malcolm's personalities, and the events at the motel are all happening in Malcolm's mind, the result of treatment Malcolm is receiving to eliminate his excess personalities. Ed resists this information, panicking at seeing the wrong face in his reflection and insisting that his identity, his life, is real. Malick tells \"Ed\" that it is imperative that the personality responsible for committing the murders not survive what is happening at the hotel, in order to prevent Malcolm from being executed.\nEd 'awakens' to find himself standing in the rain, looking at the hotel from a distance. Paris finds convict-transportation files for both Maine and Rhodes in the police car. A flashback reveals that Rhodes killed the corrections officer transporting him and Maine, putting the officer's body in the trunk, and then assumed his identity. Rhodes attacks Paris, but she is saved by Larry, who is then shot and killed by Rhodes. While hiding from Rhodes, she runs into a dazed Ed, and he tells her it's going to be okay. Believing Rhodes to be the murderous personality, Ed goes after him, and they end up shooting each other fatally, leaving only Paris still alive. She drives away from the hotel in Larry's truck.\nWhen Malick demonstrates that the homicidal personality is dead, Malcolm's execution is stayed and he is placed in a mental institution under Malick's care. In the final scene, Malcolm is driven in a van along with Malick to the institution. In Malcolm's mind, Paris has driven back to her hometown in Frostproof, Florida. As she tends to some soil in her orange grove, she discovers the room 1 motel key, and finds Timmy behind her. Flashbacks reveal that Timmy orchestrated all of the deaths at the motel, and made it appear that he had been killed with Ginny. Malick sees Malcolm in distress and opens the security window in the barrier between the front and back of the van. Timmy kills Paris, declaring \"Whores don't get a second chance,\" as Malcolm lunges at Malick, strangling him with the chain of his handcuffs. The van swerves off the road and stops, and Timmy's voice repeats Malcolm's rhyme."}