{"mid": "IfThereBeThorns", "IMDB_id": "tt4058368", "title": "If There Be Thorns", "plot": "Six years after Petals on the Wind, Cathy and Chris are happily married and living in California with Cathy's sons, Jory and Bart. Bart feels lonely and outshone by his older brother whom his parents seemingly favour. One day, a woman entirely dressed in black moves into the mansion next door and invites Bart and Jory over for tea and cookies. During this, she explains to them that she is rich but has no family except for her butler, John Amos. She takes a picture of them for a keepsake, and asks them to visit her often. Jory declines, but Bart agrees after she promises to give him anything he wishes for. Bart is curious as to why he has no other relatives, both he and Jory being aware that Chris is merely their step-father. Jory tells him that their maternal grandmother is in a mental hospital and that all of Chris's relatives are deceased. The woman lavishes treats and gifts on Bart, including a pet python, and eventually tells him that she's in fact his grandmother, Corrine. John Amos gives Bart a journal that belonged to his great-grandfather, Malcolm, and makes him promise never to reveal it to his family. Bart reads Malcolm's fanatical entries and writings, referring to beautiful women as sinful and degrading, which begins to leave a deep impression on him.\nOne night, Cathy places three beds in the house attic, which worries Chris about her behaving similarly to their mother. However, Cathy insists that she is only creating a back-up plan in case her and Chris's incestuous secret is ever exposed and they face the possibility of losing her children. She pleads with Chris to adopt Cindy, one of her ballet students, whose mother has died from cancer, and he agrees in order to calm her down about losing their family. Bart soon goes missing and the family discover him unconscious in the woods due to an infected cut on his arm, leading him to be hospitalized. Bart starts to suspect that his parents are keeping secrets from him, and he confronts Corrine over a painting of a boy who resembles Chris since he believed she had never met him. Corrine confesses that Cathy and Chris are actually both her children, leaving him horrified at his parents' incestuous relationship.\nBart starts to withdraw and lash out at his family, greatly worrying them. Bart begins to pressure Corrine to tell him about his biological father, about whom he knows nothing. John Amos continues to influence Bart regarding the sins and hypocrisy of the family, further straining his relationship with his parents and brother. Jory soon finds the family dog killed, and begins to believe Corrine responsible for the change in Bart. He tries to convince Bart to stay away from her, but Bart blackmails him into staying quiet and calls him weak for feeling emotion. Feeling pressured by Bart, Corrine admits that his biological father is her late second husband whom Cathy seduced to get back at her. Corrine then reveals how she wants Bart to become the child that she never got to have with his father, vengefully wishing to steal him away from her daughter.\nHaving become resentful towards Cindy since her adoption into the family, Bart attempts to drown her in the kiddie pool when she calls Cathy \"mommy\". However, he is stopped by Jory. As punishment, Chris locks him in the attic. Bart then begins to shout that they are \"the devil's spawn\" and that Chris is \"fornicating with his sister\". Realizing that he knows about their secret, Cathy and Chris desperately wonder how he could have found out. Bart is placed in a mental hospital and claims that it was Malcolm who tried to drown Cindy, leading doctors to suspect that he suffers from a mild case of schizophrenia. Jory goes to confront Corrine, who tells him that Cathy and Chris are siblings, which horrifies him. Jory then tells Chris that Corrine is living next door, and he goes to confront her. Corrine begs for Chris to forgive her and let her be part of her grandsons' lives, but what she wants most of all is to raise Bart as her own son. Chris rejects her and demands that she stay away from his family and children.\nAt Cindy's dance recital, Cathy sees Corrine in the audience and accidentally falls off the stage in shock, injuring her leg so severely that she is no longer able to dance. Jory's paternal grandmother, Marisha, comes for a visit upon hearing about Cathy's accident. However, she has learned about Chris and Cathy's true relationship and threatens to turn them in to the police for incest, wishing to take Jory into her personal custody. Cathy is put on edge and argues with her, but Marisha insists that Jory's current living situation is unhealthy for him and points out how \"nuts\" Bart is. Bart, overhearing this, storms out of the house with Cathy chasing after him. He runs to John Amos, who tells him that if he can't deal with the sins and hypocrisy of his family, then he shouldn't be with Corrine either. John Amos tells him that she is a sinner just like his parents, due to her committing incest with her half-uncle, who was Cathy and Chris's father. Cathy goes to Corrine's mansion to find Bart, and finds a portrait of her siblings and herself. She confronts Corrine about involving herself in her children's lives and orders her to leave her family alone. Corrine pleads for forgiveness, but Cathy rejects her and blames her for ruining the life she and Chris worked so hard to build and maintain. Corrine asks Cathy if she truly does love Chris, which Cathy confirms and blames Corrine for.\nDuring this, John Amos comes into the room, knocks both women out and forces Bart to lock them in the barn. Corrine wakes up, at which John Amos reveals his disgust over the family for their incestuous bloodline and his plan to burn them alive and finally end the \"family's cycle of abomination\". Bart, however, intervenes to save his family and soon runs off to get Chris. John Amos sets the barn on fire just as Chris and Bart arrive to rescue Cathy and Corrine. Believing that they are about to die, Corrine professes her love for her children, and Cathy embraces her, confirming her forgiveness. Chris rescues Cathy as Bart tries to save Corrine, but John Amos attempts to attack him. Corrine manages to stab him with a fire poker which gives Bart enough time to escape, but she's unable to do likewise and burns to death alongside her devious butler. Realizing how much he loves his parents despite their history, Jory decides to remain with them and threatens his grandmother Marisha that he will never forgive her if she reports on Cathy and Chris.\nAfterwards, Bart calms down and even begins to form somewhat of a good relationship with adopted sister Cindy. Jory and Melodie make up their strained relationship and everything appears to be returning to normal again. However, Bart begins secretly dressing like Malcolm and still has his journal, hinting that he has not recovered from his madness."}