{"mid": "IlyaMuromets", "IMDB_id": "tt0049358", "title": "Ilya Muromets", "plot": "In medieval Russia, the aging giant bogatyr Svyatogor gives his sword to some traveling pilgrims to be passed on to a new bogatyr. Svyatogor and his horse become a mountain as he dies. Meanwhile, Asiatic pagans known as the Tugars are ravaging and pillaging the land. They raid the village where the bearded and robust Ilya Muromets lives and capture his future wife Vassilisa. Ilya is unable to defend her because his legs haven't worked since childhood. A man called Mishatychka caught by the Tugars pleads to serve them if they spare him, and promises to be a double agent for them. The pilgrims with Svyatogor's sword come upon the house of Ilya Muromets and cure his ailment with a magical potion and a magical song. They also give him the sword. Later on, he decides to leave his family to go on an epic journey in order to defend Kiev from the Tugars. For this purpose he is given a foal by a neighbour (Mikula Selyaninovich) which magically grows into a steed in three days. He passes by some woods and is confronted by a forest-dwelling monster known as Nightingale the Robber who blows wind so hard it parts the forest backward; Ilya defeats him by throwing a cudgel at him.\nMeanwhile, in the capital Kiev, a peasant named Razumey stands trial before Knyaz Vladimir the Fair Sun, for cutting trees without permission. Upon hearing that Razumey's purpose was designing and building weapons to use against the enemy, Vladimir releases him and provides him with wood to continue the work.\nIlya arrives in Kiev and presents the forest monster to Knyaz Vladimir, who is impressed with his deeds. Ilya becomes part of a bogatyr brotherhood with two other bogatyrs Dobrynya Nikitich and Alyosha Popovich. A Tugar envoy arrives in the city, a huge zeppelin-like man on a massive moving platform, who warns the Knyaz to give a tribute for twelve years in advance and they will be spared. Ilya replies by insulting the ambassador, and, when he throws a sword at Ilya, throwing it back into the ambassador's stomach, cutting him down while the envoy runs off. Ilya leaves Kiev and finds Vassilisa captured by three Tugars and releases her. After a while Ilya departs from the pregnant Vassilisa to fight the Turgars. Upon leaving he expresses his wish for her to bear a son, to be called Sokolnichek (Little Falcon), who will become a heroic warrior.\nUnfortunately Vassilisa is abducted again by the Tugars. Mishatychka has become an important adviser to the knyaz and he tricks the knyaz into believing that Ilya is disloyal to him. Ilya is imprisoned in the castle's dungeons where he will eventually spend ten years deprived of food by Mishatychka. Disgusted, Nikitich and Popovich leave the knyaz's court. Mishatychka attempts to send the dungeon key to Kalin, but instead, it falls into Razumey's hands. Vassilisa has born a son, Sokolnichek, while in captivity of Tsar Kalin, the Tugar Khan. Kalin adopts Sokolnichek as his own son and has him trained as a mighty Tugar warrior. The huge Tugar army sets up camp outside the city of Kiev, demanding an enormous ransom (700 carts of gold) to be given to Kalin in order for the city to be spared. Ilya is released, having survived on food provided by a magic table cloth that Vassilisa had woven previously. Mishatychka the traitor is rooted out and ordered to be boiled in pitch, while Vladimir calls out for all the Rus' warriors to assemble for a battle the Tugar hordes. Nikitich and Popovich, hearing of Ilya's release, hurry back into Kiev. Due to the reinforcements being slow to arrive, Ilya hatches a plan to trick Kalin by using torn sacks and broken carts to create the impression that all of the gold being paid as tribute fell out during transport, and then make Kalin think the warriors tried to keep the treasure for themselves. After they warriors give Kalin the treasure (their own jewelry), the king demands to give him Ilya as well. Ilya sends people to Kiev, and they naturally come back empty handed. Kalin then promises to depart if Ilya is delivered. Ilya reveals himself to Kalin who feels insulted by this deception, captures Ilya and decides to attack Kiev anyway; Ilya escapes and goes back to Kiev. With all the aforementioned manipulations, enough time has passed for the Rus' armies to arrive.\nSokolnichek is now a strong Tugar warrior who is sent to fight Ilya. While they duel, Ilya sees the ring on his son's finger and reveals his true heritage to him. Abashed, he joins his father's side and goes to free Vassilisa, together with all the Russians held captive by Kalin. Nikitich and Popovich each lead one army with Ilya leading the center army toward the Tugar hordes and Vladimir with his personal guard stands ready as reserve. The Khan orders a massive pyramid to be made out of human bodies so that he can survey the forthcoming battle. An arrow is shot from inside Kiev by a large ballista designed and operated by Razumey, causing Kalin to tumble down. Angry, Kalin orders to release the three-headed dragon, Zmey Gorynych, to help in the fight. Another arrow from the ballista hits the dragon in the wing, forcing it to fight on the ground. More of the Russian soldiers land from ships from a nearby river and fight the fire-breathing dragon, eventually slaying it. The Tugar hordes are routed and Kalin captured. The victorious Ilya is finally reunited with Vassilisa and offered a place at the court and a title by Vladimir, but declines in order to be with his wife and go on other journeys. He gives the title and his sword to his son, who continues the heroic lineage."}