{"mid": "Images", "IMDB_id": "tt0068732", "title": "Images", "plot": "Wealthy housewife and children's author Cathryn (Susannah York) receives a series of disturbing and eerie phone calls in her home in London one dreary night. The female voice on the other end, sometimes cutting in on other phone conversations, suggests mockingly to her that her husband Hugh (René Auberjonois) is having an affair. Cathryn's husband comes home, finding her in complete disarray. Hugh attempts to comfort her, but then he is gone, and she sees a different man who is behaving as if he were her husband. She screams in horror and backs away, only to see her vision of the figure revert to her husband.\nHugh attributes her outburst to stress and her budding pregnancy. He decides to take a vacation to the countryside at an isolated cottage in Ireland, where Cathryn can work on her book and take photographs for its illustrations. Immediately upon her arrival, however, Cathryn begins to hear voices invoking her name, and witnessing strange apparitions: While preparing lunch in the kitchen one day, she witness her husband Hugh pass through the room, his body shifting into that of her dead lover, Rene. Rene continues to appear to her around the house, even having conversations with her.\nCathryn's paranoia and visions become increasingly pervasive, and are exacerbated when a local neighbor and ex-lover, Marcel, brings his adolescent daughter, Susannah, to visit. Cathryn becomes unable to distinguish Hugh from Rene or Marcel, as the men shift before her eyes. One day, Rene taunts Cathryn, asking her to kill him if she wants rid of him, and hands her a shotgun. She shoots him through the abdomen; Susannah, startled by the gunshot, runs into the house, and finds Cathryn standing in the den, having shot Hugh's camera to pieces. Cathryn claims the gun accidentally unloaded when she was moving it.\nSeeking solace, Cathryn goes to a nearby waterfall, where on several occasions she sees a doppelgänger of herself staring back at her. After one of these occurrences, she returns to the house, where Hugh tells her he has to leave for business. She drives him to the train station and returns to the house, where she finds Marcel waiting inside. He begins to undress to have sex with her, but she stabs him through the chest with a kitchen knife. The next morning, she encounters a local elderly man walking his dog, and offers him to come inside for coffee, in spite of the fact that Marcel's corpse lay in the living room; he however, declines the invitation. Later in the evening, Susannah stops by the house, and remarks that her father came home drunk the night before; Cathryn is confused by this, believing she had murdered him the night before, but finds his body has disappeared from the living room. Susannah comes inside to have tea, and asks Cathryn if she looked like her when she was young before ominously saying, \"I'm going to be exactly like you.\"\nAfter having tea, Cathryn drives Susannah back home. Marcel comes out of the house and attempts to talk to Cathryn, but she drives away. While on a stretch of road through a desolate field, Cathryn witnesses her doppelgänger again, attempting to wave her down. Back at the house, she finds both Rene and Marcel's corpses have reappeared in the living room. Cathryn leaves again, and encounters her doppelgänger at a bend in the road; this time she stops. The doppelgänger begs Cathryn to let her in the car, and the two begin to speak in unison. She then hits the doppelgänger with the car, throwing her off a cliff and into a waterfall below. Cathryn then drives back to her home in London. At her home, she goes to take a shower. While in the bathroom, the door opens, and the doppelgänger walks inside. Cathryn screams in terror, \"I killed you,\" to which the doppelgänger responds, \"Not me.\" The final shot shows Hugh's corpse lying at the bottom of the falls."}