{"mid": "IndependenceDayResurgence", "IMDB_id": "tt1628841", "title": "Independence Day: Resurgence", "plot": "The film starts in outer space on the alien mothership. A creature is observing Thomas Whitmore's (Bill Pullman) rousing speech during the battle that took place 20 years earlier (from the first Independence Day film). The creature growls, but it's just a nightmare that Thomas has.In the present, he is no longer president, and his daughter Patricia (Maika Monroe) works for current president Elizabeth Lanford (Sela Ward). Patty was a pilot for the military, but she resigned to take care of Thomas, as he is more frail and disturbed after the invasion. She's friends with Dylan Dubrow-Hiller (Jessie T. Usher), son of Steven Hiller, who died in the years since the battle. Dylan is captain of the military pilots. After the battle, the so-called Earth Space Defense was established, with Area 51 becoming headquarters.Patty's fiance, Jake Morrison (Liam Hemsworth), is on a base on the moon working on a machine with his best friend Charlie (Travis Toth). The machine loosens and nearly collapses onto the base, but Jake uses his pod to lift it and secure it in place. He later gets chewed out by his superior General Jiang Lao (Chin Han).General Joshua Adams (William Fichtner) is brought to the prison of some captive aliens that were kept alive since the battle. It's mentioned that for the past 20 years they have been catatonic, but suddenly, a couple of hours ago, they are all acting very animated and agitated.In Africa, David Levinson (Jeff Goldblum) arrives with Floyd Rosenberg (Nicolas Wright) at a base to meet warlord Dikimbe Umbutu (Deobia Oparei). David runs into an old flame, Dr. Catherine Marceaux (Charlotte Gainsbourg). They are at the site of a crashed alien ship. Umbutu and his men fought the aliens and took their weapons. Umbutu claims to have seen visions involving the aliens. The ship has also sent a distress call to its home planet.The pilots on the moon get a visit from Jiang's niece Rain (Angelababy), whom Charlie becomes smitten with. Dylan also shows up, causing friction since Jake almost accidentally killed him during training. Dylan returns the favor by punching Jake in the face.The moon base notices a spherical craft approaching them. It is also seen on Earth by those in Africa and those on Lanford's staff. Considering it a threat, Lanford orders the craft to be shot down. The moon team fires its laser cannon at it, sending it hurtling backwards. All teams celebrate, thinking they have scored another victory against aliens.Jake's shuttle picks up David, Catherine, Umbutu, and Floyd to the crash site of the craft, where they find a large container and recover it.We cut to David's elderly father Julius (Judd Hirsch) at a retirement home where he advertises a book in which he claims he was responsible for saving the planet.In a hospital, Dr. Brakish Okun (Brent Spiner) has finally awoken from his coma after 20 years. He immediately gets out of bed and scribbles alien symbols on the walls of his room.On Earth in Washington DC, a celebration is held for shooting down the craft. Several veterans from the first alien invasion attend, including an elderly and frail General Gray (Robert Loggia). Lanford credits the moon team for their effort. Thomas walks up to speak unexpectedly, but as he is introduced, he tries to warn everyone that \"they're coming back\". At the same time, he, Umbutu, and Brakish all experience the same sensation, just as high above Earth, an enormous mothership (which is DEFINITELY bigger than the last one as David says) begins to appear. It first strikes back against the moon base, killing Jiang and several others, which Rain witnesses. Then the ship moves over the Atlantic Ocean and levitates part of China and Dubai, sending many skyscrapers and landmarks crashing on top of London and other cities. In the chaos, Dylan sees his mother Jasmine (Vivica A. Fox) working in a hospital as she leads a woman and her newborn baby to the roof of the hospital. The woman and her baby are rescued, but Jasmine perishes when she falls and the building is destroyed, which Dylan sadly watches. Meanwhile, Julius is riding his boat as the attack hits and a large wave strikes his boat, but he survives.Jake later finds Dylan and offers his condolences. He says he knows his pain since his parents were killed in the first alien attack when he was a child, and the last thing he told them was that he hates them.Thomas goes to the holding cell of a captive alien. He enters to communicate with it, but it grabs him with its tentacle in front of Patty and other soldiers. The alien uses Thomas to say \"she\" is coming. Patty shows a picture of a sphere, which the alien reacts to with anger. The soldiers shoot at the alien, breaking its cell open in the process. Umbutu kills the alien as it comes out of its exoskeleton bio-mechanical suit.The military picks up an infrared reading from the mothership, where they spot the Alien Queen in the middle of everything. They figure if they can kill the Queen, they can stop her fleet. Lanford authorizes the retaliatory strike. The pilots fly into the ship and begin unloading on any alien that crosses their path.The mothership starts drilling into the planet's core. A boat full of men searching for gold is contacted as they are right near the drilling site, and they are offered a ton of money ($100 million) to send back information and to help in stopping the drilling.The alien warriors also attack Lanford's bunker, killing her and most of her Cabinet. Adams is quickly sworn in as her successor.On Earth, Julius is found by four kids driving away from Florida after being separated from their parents. Julius comforts the oldest girl Sam (Joey King), as she has to take care of her siblings and she has no idea what happened to their parents. Julius takes over the car until they come across a school bus full of kids whose driver abandoned them. Julius brings the four kids onto the bus and drives with all the other kids.Meanwhile, Brakish breaks the container open and uncovers a large white sphere not unlike the one that was shot down. Floyd activates it by touching it, and the sphere comes to life. It speaks English and explains how the race that it belongs to was extinguished by the alien harvesters. Their planet's core was absorbed by the aliens to refuel their ships, something they have done to countless other planets. The sphere also states how it attempted to evacuate Earth, but it couldn't since the moon team shot down the ship needed for the evacuation.As the pilots head toward the Queen, they start to realize it's a trap, and that she knows they're coming. The aliens disable the pilots' jets and weapons systems with some type of EMP (electro-magnetic pulse). Jake, Dylan, Charlie, and Rain all manage to escape before they are killed.A plan is formed to lure the Queen out to an isolated area where they can nuke it to death. Patty volunteers to head the attack, but Thomas makes it out before she can, knowing it's going to kill him. The pilots all get ready to fight as David prepares himself at the site of the attack. Thomas flies into the ship as the Queen's shields go down. Once she is in the trap, Thomas detonates the bombs, destroying the ship at the cost of his life.Everyone celebrates prematurely as they think the Queen is dead. She's actually very much alive... and very pissed off. The Queen (who stands around 100 ft. high) rampages through the deserted area to attack the pilots trying to strike her down. The drill is also closer to the core by the minute. As this happens, Julius drives the bus toward David's location. The Queen attempts to attack the bus. Patty flies her jet above the Queen and fires at her shields. She manages to bring them down as the Queen's fleet starts swarming around her for protection. Jake, Dylan, Charlie, and Rain shoot at the Queen from behind. The Queen is mortally wounded. She bursts out of her exoskeleton and flails around until she collapses and finally dies. The other aliens are brought down, and the drilling ceases. Earth is saved once again.The mothership ascends and leaves Earth. Jake and Patty are reunited, and they kiss. Charlie tries to get that going on with Rain, but she says \"Dinner first\", to his delight. Brakish then approaches the pilots and his son with the sphere, stating that it can offer them new technology and weapons should they take the fight against the aliens into space before they come back. Everyone agrees, and Brakish closes the film by saying that it's time to \"kick alien ass\"."}