{"mid": "Indian", "IMDB_id": "tt0300028", "title": "Indian", "plot": "Chandra Bose a.k.a. Chandru (Kamal Haasan) is a small-time middle man stationed outside Regional Transport Office, who aids people in greasing the right officials inside the RTO for getting permits and licenses. His assistant Subbaiah (Goundamani), and Paneerselvam (Senthil), a RTO official, are engaged regular tiffs while Aishwarya (Manisha Koirala), Chandru's love interest and an avid animal rights activist also battle it out with Sapna (Urmila Matondkar), the daughter of a RTO official Chandru is trying to hobnob to secure a job for himself at the RTO. Aishwarya is irked by the fact that Sapna (as well her mom) is exploiting Chandru's situation and gets him to do grocery shopping, laundry, and almost every household chors.\nMeanwhile, Krishnaswamy, a Beaurau officer, manages to trace his way to Senapathy's house, who is an ex-freedom fighter, also chandru's father. Archived newspaper reports say that Senapathy was a soldier in the Indian National Army, who was an extremist. Senapathi's wife Amirthavalli (Sukanya) details the story on their struggles during pre-independence India, the discrimination by British officials and the Indian Freedom Movement Rebellions against the British atrocities, etc. leading Senapathy marrying Amirthavalli but leaving for Singapore to join Subhas Chandra Bose to be part of the INA. He returns after independence and unites with his wife.\nIn the present day, when Krishnaswamy tries to arrest Senapathy, he escapes with his expertise in Varma kalai. Senapathy then goes on to commit a murder in front of television audiences by killing a corrupt doctor (Nizhalgal Ravi) who refused to attend immediately to Senapathy's daughter Kasturi (Kasthuri), who was suffering from third degree burns because he insisted on a bribe, which Senapathy refused in the past. Chandru parts ways with his father because of his excessive insistence on honesty and righteousness, and also, he considers these values to be dead and worthless. Public support surges for the Indian as he exposes so many corrupt people. Senapathy does not do his son any favours either. Chandru had earlier taken a bribe and given a safety certificate to a bus with faulty brakes, which eventually killed 40 school children it was carrying, and thus, Chandru is held responsible. Senapathy is bent on giving Chandru the same punishment as he gives others, i.e., death. Towards the end, a chase culminates at airport, where Senapathy kills Chandru, and apparently dies in an explosion. Krishnaswamy discovers that Senapathy escaped moments before the jeep is exploded killing his son in the explosion, while investigating the television footage at airport.\nThe epilogue shows Senapathy calling Krishnaswamy from a foreign land (Hong Kong), indicating that he will be back should the need for him arise."}