{"mid": "Indochine", "IMDB_id": "tt0104507", "title": "Indochine", "plot": "In 1930 marked by growing anticolonial unrest, Éliane Devries (Catherine Deneuve), a single woman born to French parents in colonial Indochina, runs her and her widowed father's (Henri Marteau) large rubber plantation with many indentured laborers, whom she casually refers to as her coolies, and divides her days between her homes at the plantation and outside Saigon. After her best friends from the Nguyễn Dynasty die in a plane crash, she adopts their five-year-old daughter Camille (Ba Hoang, as child). Guy Asselin (Jean Yanne), the head of the French security services in Indochina, courts Éliane, but she rejects him and raises Camille alone giving her the education of a privileged European through her teens.\nJust after Éliane wins a wager against the naval commander's (Gérard Lartigau) sweeping team, she finds herself bidding against a young French Navy lieutenant, Jean-Baptiste Le Guen (Vincent Pérez), on the same painting at an auction. She is flustered when he challenges her publicly and surprised when he turns up at her plantation days later, searching for the boy whose sampan he set ablaze for suspicion of opium smuggling. Soon they are enveloped in a torrid affair.\nOut and about in the city, Jean-Baptiste witnesses the escape and shooting of a Vietnamese prisoner by a French police officer. Camille (Linh Đan Phạm, as teen and adult) and her classmates are walking nearby, and as the prisoner falls, he knocks her unconscious, leaving her covered with his blood. Jean-Baptiste brings her indoors and cleans off the blood, cutting off her dress in the process and exposing her bosom. Camille wakes up in his arms and falls in love with him at first sight, believing that he has saved her life. Word about the \"affair\" gets out, and Camille is taunted at school.\nThrough her connections with high-ranking officials in the navy, Éliane has Jean-Baptiste transferred to Haiphong to protect Camille from getting hurt. Jean-Baptiste confronts Éliane about this at a Christmas party at her place, and a loud spat ensues in which he slaps her on the face. As a result, instead of Haiphong, Jean-Baptiste is sent to a remote French military base on the notorious Dragon Islet (Hòn Rồng) in northern Indochina. On arrival, he is greeted by the outgoing commanding officer, who says the French authorities hardly pay attention to this outpost: its sole function is to gather unemployed northern Vietnamese who seek indenture on plantations in more prosperous southern Indochina.\nAgainst her better judgment, Éliane allows Camille to become engaged to Tanh (Eric Nguyen), a young pro-Communist Vietnamese expelled as a student from France because of his support for the 1930 Yên Bái mutiny. The marriage is arranged by Tanh's wealthy, merchant mother. But the day after the engagement, Tanh helps Camille leave to look for Jean-Baptiste up north.\nCamille travels and reaches Dragon Islet with a Vietnamese family seeking a term of indenture in the south, but they are killed by a French naval officer. When Jean-Baptiste arrives at the scene and demands that the officer tell him what happened, the officer says that the family refused to be split up and started inciting a riot.\nJean-Baptiste spots Camille among the laborers and leads her away. The French sailors do not object thinking their superior is taking a congaie, a Vietnamese mistress. As Camille sees her traveling companions dead, she attacks the French officer shooting him in the struggle. This puts a price on the heads of both Camille and Jean-Baptiste, who stands by her.\nCamille and Jean-Baptiste escape from Dragon Islet and sail away through the Gulf of Tonkin for several days without food or water. When they come ashore, a Communist theater troupe rescues them and takes them to a hard-to-reach valley where the two find refuge in a large complex of buildings. After several months have passed, and Camille has become pregnant with Jean-Baptiste's child, they are told they must leave the valley, because the Communists have more important people to hide. Tanh, now a high-ranking Communist operative, arranges for the theater troupe to smuggle the lovers into China.\nGuy attempts to use operatives to put down the growing insurrection and also arranges for French agents to look for Camille and Jean-Baptiste in the north. They look up and down the Gulf of Tonkin with no success.\nGuy figures out that traveling theater troupes may be behind many near-simultaneous insurrections in the north. He orders all theater troupes traveling along certain routes to be arrested. The troupes have brought attention to themselves, among other things, through tuồng performances by Vietnamese actors with white make-up starring as Jean-Baptiste rescuing Camille, popularly nicknamed \"the Red Princess\".\nWhen the lovers are a few kilometers from the Chinese border, Jean-Baptiste takes his and Camille's newborn son Étienne (Nguyen Tran Quang Johnny, as baby) to baptize him in the river while she is sleeping. He finishes the ceremony only to see several French soldiers with their rifles aimed at him. Her lover and son captured, Camille escapes with the theater troupe, while the French authorities remand Jean-Baptiste to a Saigon jail and give Étienne to Éliane.\nJean-Baptiste spends time in prison and does not speak with anyone. He agrees to talk eventually if he can first see his son. The Navy (which has authority over the case and refuses to subject Jean-Baptiste to interrogation by the police) plans to court-martial Jean-Baptiste in Brest, France to avoid the public outcry that would likely arise from a trial in Indochina. Jean-Baptiste is allowed to be with Étienne for 24 hours and settle his affairs before leaving for France. He goes to see Éliane, who lets him stay with Étienne at her Saigon residence for the night.\nThe next day, when Éliane arrives at the house to pick Étienne up, she finds Jean-Baptiste dead, lying in bed with a shot in the temple and a gun in hand. Étienne is safe in the bed next to him. Éliane, outraged, tells Guy that she suspects the police, but Guy's girlfriend tells Éliane that the Communists probably killed Jean-Baptiste to silence him. With no evidence sought for either suspicion, Jean-Baptiste's death is ruled a suicide.\nCamille is captured and sent to Poulo-Condor - a high security prison that does not permit visitors, and not even Guy can free her. He confides to Éliane that Camille's only chance for surviving the prison is to become a dedicated Communist. Éliane lobbies government officials for Camille's release to no avail. After five years, the Popular Front comes to power and releases all political prisoners, including Camille. Éliane goes to the prison to take her home but, rather than go and live with her mother and son, Camille joins the Communists to fight for Vietnam's independence. She does not wish for her son to know the horrors she has witnessed, and tells her mother that French colonialism is drawing to an end.\nÉliane sells her plantation to Tanh's mother and leaves her home in Indochina, the land of her birth, with Étienne to live in France.\nYears later, Éliane tells a grown-up Étienne (Jean-Baptiste Huynh) the story of his mother and takes him to Switzerland, where Camille is a Vietnam Communist Party delegate to the 1954 Geneva Conference. Étienne goes to the negotiators' hotel, but he realizes the futility of attempting to find his mother in the crowds of people. He waits in the lobby, foolishly hoping that Camille will see him and call out to him, recognizing him as her son, but this does not happen. He recounts this to Éliane and tells her that she, Éliane, is his mother. Malaysian actor Dhevaakar Suppiah portraying the character of satait were an obedient caretaker of Eliane.\nAs the film concludes, an epilogue notes that, the next day, French Indochina becomes independent from France and Vietnam is partitioned into North and South Vietnam (leading, of course to the Vietnam War)."}