{"mid": "Infestation", "IMDB_id": "tt1020543", "title": "Infestation", "plot": "Our hero, Cooper, awakes to find himself nauseous, weak and covered in webbing, hanging from the ceiling of an office where, just minutes ago, he started his new job. As he struggles out of his slimy prison he comes face to face with his opponent - a grotesque, powerful and very angry bug. All 3 ft of it. And so begins a hideous, nail-biting, comedic, all-action adventure to find a safe haven while constantly outwitting an infestation of monstrous proportions. As Cooper embarks on his journey, he befriends a ragtag group of survivors including Sara, a feisty attractive female. Although the situation is dire, Cooper cant help himself from trying to solve his dating problem while trying to save his life. Will they make it to safety before they are picked off one by one? And what other surprises are in store for our group of unlikely heroes? [D-Man2010]***************\nFrom KrystelClaireCooper (Christopher \"Chris\" Marquette) hates his job. He works at a call center, but he is rude, pretends to be the manager and does lazy things. His manager, Maureen (Deborah Geffner) calls him to her office, and fires him, to which he replies that he wants to quit. The manager insists on firing him. The manager insists on firing him immediately. Suddenly, a noisy scrutch is heard.Cooper wakes up. He is inside of a white cocoon. A huge cocrachoac stings onto him and then leaves. After waking up, dizzy and confused, Cooper throws up a white liquid. He wakes up completely and wakes Maureen up. Maureen insists in looking for her daughter, who was about to pick her up. They wake up energetic doctor Sara (Brooke Nevin) - who \"shows her appreciation to Cooper\" by attacking him with an anti-rape spry, Maureen's daughter, student Leechee (Linda Park), strong but slow-witted Huge (E. Quincy Sloan) - who would have killed Sara if a crawling bug had not attacked them - and dumb blonde Cindy (Kinsey Packard) and some more people also enclosed on those cocoons. A flying bug appears and takes Maureen. \"Al\" (Wesley Thompson) is stung by one of the flying bugs, although at the moment he looks fine. The two guys who leave in a white van are attacked by some huge flying bugs towards the North End. Cindy agrees as her brother Chad and his wife live there. First Cindy wants to leave with the two guys, then she changes her mind, and when the van crashes one of the bugs to death, she runs after them so that they can take her away. However, two flying bugs kill the guys. Cindy is alive and she is kind of nice to Cooper, who can't believe his luck.Cooper want to go to his paranoid dad, a retired military man who has a bunker under his home. Leeche is the only one who stays behind with the intention of waking up as many people as possible. They capture a bug, and Leeche has analysed its poison: the substance which put everybody to sleep also has proteins, similar to those present in human pregnancies. On their way, Sara calls Cooper solisipstic, which means kind of selfish and lazy. Al, Hugo, Cooper, Sara and Cindy reach Chad (Mike Straub)'s home. There, several cocoons are joined together, as with an intention. Susan (Daniela Tonova), Chad's wife, is in one of the cocoons, is woken up, and throws up the white stuff as usual. Suddenly, Chad appears: the upper part of the body has Chad's face, but the lower part of the body is that of a 8-legged gigantic spider. Chad attacks them, kills Susan and is about to eat Cindy when Hugo and Cooper kill it. Cooper is hurt in one of his legs.At that home, Al scares Sara. Al realises that he'll become one of the huge bugs in due time. They keep on walking. They hide from some flying bugs. Cindy is angry that Cooper and Sara hold hands, so she shouts to attract the flying bugs. Al kills Cindy because of what she has done. The things take Sara away.They finally reach the home of Cooper's dad. They find him. Ethan (Ray Wise) is still angry with Cooper. They argue about the map. Ethan is looking for his little dog, Lucy, calling it Cooper's sister. Al becomes a huge spider bug at that moment. Hugo kills him because he had promised Al to do so. Lucy has also become a smaller bug. The noise attracts more flying bugs, so they have to run underground. Ethan turns off the lights, and Cooper remembers how he met Sara some days ago and gave her his phone number, although at that moment she might have thought he was a jerk.Cooper wants to go to the nest to save Sara. Ethan doesn't want him to go. Hugo goes after Cooper, although he wants Hugo to stay with his dad.When Cooper is taking a pee, he is stopped by an armed man. He takes Cooper to the local prison and puts him into jail. A white trash girl (Diane Gaeta) is putting people in jail waiting for them to become spigery buds. In the jail nearby, a Puerto Rican Man (Ismael \"East\" Carlo) tells him that Leeche woke many people up, but that she died in an explosion. He is the only one still alive from that group.Cooper tells the men: Jed (Jim Cody Williams), and Roger (Bru Muller) to check under their undershirts for the sting. It so happens that Ethan has been stung.The Puerto Rico man has become a bug, and he kills the white trash girl. Ethan kills Jed and Roger.Sara wakes up in the nest. She's been able to free herself from the cocoon somehow. She's got a knife, and that's all.Ethan says that the red smoke is very flammable, so he will go to the nest and will set it in fire. Bugs arrive because of the noise. Hugo, Ethan and Cooper leave riding bikes. They reach the nest. Inside, a child-bug screams in order to betray Sara's presence. Sara runs away, and finds Ethan, who has started to feel his stomach become pulp. Sara has seen the queen, who is constantly laying eggs. She will show Ethan the way as soon as he tells her that he is on a one-way route. At first, they can't see the queen, as it's hanging down. The queen attacks Ethan. Only deaf Hugo can resist the Queen's cry for help. All the flying bugs swarm to the nest. Finally, Cooper presses the button, his father dies with the nest which has exploded in fire.Soon, Cooper and Sara have become an item. Hugo is also there, taking care of them.However, soon they see something strange - the audience is left to believe that they've found out another nest."}