{"mid": "InHarmsWay", "IMDB_id": "tt1711478", "title": "In Harm's Way", "plot": "John Wayne stars as U.S. Navy Captain Rockwell \"Rock\" Torrey, a divorced \"second generation Navy\" son of a career Chief Petty Officer. A Naval Academy graduate and career officer, Torrey is removed from command of his heavy cruiser for \"throwing away the book\" when pursuing the enemy and then being torpedoed by a Japanese submarine after the attack on Pearl Harbor. Torrey's executive officer, Commander (later Captain) Paul Eddington (Kirk Douglas), is a wayward sort who resigned as a naval aviator and returned to the surface navy because of an unhappy marriage. His wife's affairs and drunken escapades have become the talk of Honolulu and her death during the Pearl Harbor attack—in the company of an Army Air Corps Officer (Hugh O'Brian), with whom she had a wild fling on a local beach—drives Eddington into a bar brawl with a group of other Army Air Corps officers, a subsequent stint in the Pearl Harbor brig, then exile as the \"... officer in charge of piers and warehouses ...\" in what he calls a \"backwater island purgatory.\"\nAfter months of desk duty in Hawaii and recuperation from a broken arm he suffered in the attack, Torrey begins a romance with divorced Navy Nurse Corps lieutenant Maggie Haynes (Patricia Neal), who tells him that his estranged son Jeremiah (Brandon De Wilde) is now an ensign in the Naval Reserve on active duty, assigned to a PT boat, and dating Maggie's roommate, a Nurse Corps ensign. A brief and strained visit with Jeremiah brings Torrey in on a South Pacific island-hopping offensive codenamed \"Skyhook,\" which is under command of overly cautious Vice Admiral B.T. Broderick (Dana Andrews). On additional information from his BOQ roommate, Commander Egan Powell (Burgess Meredith), a thrice-divorced Hollywood film writer and Naval Reserve intelligence officer recalled to active duty, Torrey guesses that the aim of Skyhook is to capture a strategic island named Levu-Vana, whose central plain would make an ideal airfield site for Army Air Forces Boeing B-17 Flying Fortress squadrons. Maggie informs him that her unit is to be shipped out to the same area in preparation for the offensive.\nMaggie's roommate, Ensign Annalee Dohrn (Jill Haworth), has been dating Torrey's son. Jere is arrogant and conspiring with a superior officer, former congressman Commander Neal Owynn (Patrick O'Neal), to do as little as possible in combat. Dohrn's romance with Jere ends and Eddington develops an interest in her. In the meantime, Torrey's loyal and resourceful young flag lieutenant, Lieutenant Commander William \"Mac\" McConnell (Tom Tryon), uses a 30-day leave to get reacquainted with wife Beverly (Paula Prentiss), a civilian observer for the Navy who worries that Mac will be killed in action and wants a child.\nCome the summer of 1942, Torrey is promoted to rear admiral by the Pacific fleet's commander-in-chief (Henry Fonda), who then gives him tactical command of Skyhook, an assignment requiring the same sort of guts and gallantry he previously displayed as commanding officer of his cruiser. Torrey personally selects Paul Eddington to be his Chief of Staff, and infuriates Broderick by immediately planning and executing an operation to overrun Gavabutu, an island to be used as a staging base for the invasion of Levu-Vana. Owynn is now Broderick's aide, with Jere still by his side.\nThe Japanese have withdrawn their garrisons from Gavabutu, making it an easy capture. But as Torrey turns his undivided attention to Levu-Vana, his attempts to secure more material and manpower are frustrated by General Douglas MacArthur's simultaneous and much larger campaign in the Solomon Islands. Reconnaissance aircraft prove especially difficult to come by, and surface combatant forces amount to little more than several cruisers and destroyers, including Torrey's former command. When the mission succeeds, Jere recognizes the disloyalty of Owynn and Broderick and gains a new regard for his father.\nEddington's instability drives him to rape Dohrn, who is now engaged to Torrey's son. The traumatized nurse, fearing she might be pregnant, tries to tell him but he doesn't believe her. She then commits suicide with an overdose of sleeping pills. As the truth is about to be revealed, Eddington—still a qualified aviator—commandeers a North American PBJ Mitchell patrol bomber and flies solo on an unauthorized reconnaissance flight to locate elements of the Japanese fleet. Engaged, shot and killed by Japanese Zero fighters, he goes down in a fiery death in a redeeming act of sacrifice, finding and giving advance warning of a large Japanese task force centered around the super-battleship Yamato, on its way to blast Torrey's much smaller force off the islands.\nDespite the new seaborne threat, Torrey nevertheless mounts the invasion of Levu-Vana and proceeds with a nothing-to-be-lost attempt to turn back the enemy force. Tragically, his son Jere is killed during a nighttime PT boat action when he is rammed by a Japanese destroyer. The following morning sees a pitched surface action off the shores of Levu-Vana, with the Americans drawing first blood and the Yamato decimating much of the U.S. force in response. Many lives are lost, Powell's among them. Severely injured at the height of the battle, resulting in the amputation of his left leg, Torrey is rescued by his flag lieutenant, LCDR McConnell, and is returned to Pearl Harbor aboard a Navy hospital ship under Maggie's care. Expecting to be court-martialed, Torrey is instead congratulated by CINCPAC for successfully repelling the Japanese advance and allowing his Marines to take Levu-Vana. Although Torrey has lost a leg, he is told by CINCPAC he will get a peg leg and then command a task force and \"stump his way to Tokyo\" with the rest of the Allied forces. CINCPAC and McConnell leave Maggie and a drowsy Torrey. Maggie pulls the blinds which slightly surprises Torrey who calls out \"Maggie!\". She responds in a calming voice \"I'll be here, Rock\" and Torrey lapses into sleep. The last shot is of Maggie warmly smiling back at him."}