{"mid": "InHell", "IMDB_id": "tt0339135", "title": "In Hell", "plot": "Kyle LeBlanc is an American working overseas in Magnitogorsk, Russia. When he hears his wife being attacked over the phone, Kyle rushes home, but is too late to save her. Sergio Kovic, the man who has killed his wife, buys the judge and is found not guilty for lack of evidence. Kyle takes the law into his own hands and kills Kovic, and for this he is sentenced to life in prison without parole. He soon befriends inmate Billy Cooper, a 21-year-old American who is subjected to constant rape and beatings by prison inmates with the assistance of the guards, and Malakai, a wheelchair-bound prisoner who claims to know the ins and outs of prison life.\nAfter getting into a brawl with an inmate who provoked him in a way similar to his wife's murderer, Kyle is put in solitary confinement. Then he is transferred to a cell with Inmate 451, who has the reputation of killing inmates, and the sadistic head of the guards believes he will do the same to Kyle. However, over time they begin to trust one another.\nThe warden amuses himself by betting on organized fights between his prisoners to fill his pockets. After savagely the inmate who previously provoked him in his first fight, Kyle is continuously forced into more because the warden and guards know he is a sure thing, and slowly he begins to lose his sanity. At one point 451 asks him, \"Do you even know who you are? Probably not.\" Meanwhile, Billy attempts multiple times to escape the prison, first by running during outside work detail, and again by sneaking off during the Russian Independence Day celebration; the latter fails as he is betrayed by Malakai, who informs the guards because his need of special medicine. 451 discovers his betrayal, and later, in retaliation, pours lighter fluid on him and sets him on fire.\nAfter being locked in a cell with prison fighter Valya overnight one night, Billy is beaten to within an inch of his life after he spits in Valya's face. Billy later succumbs to his injuries, but before he dies, he whispers to Kyle, \"Don't let them make you become something you're not.\" With this advice, Kyle now knows he must fight another battle: the fight for inner peace, as it is the only way he can become the man he once was. Kyle refuses to fight in the next match, and as a result, is hung by his arms outside for all to see. However, seeing Kyle's courage and his ability to stay strong during his punishment, the other inmates begin to follow suit by refusing to fight. Kyle is released soon from his restraints and is forced into a fight with Miloc, a gargantuan prisoner kept separate from the general population who Kyle kept hearing through the walls from his time in solitary confinement. During the fight, Kyle knocks on a door repeatedly, making Miloc recognize him, as this was his only form of communication, and he embraces him as a friend. The two then turn on the guards and ignite a full-scale riot, during which Miloc is killed by gunfire.\nSoon, 451 gives Kyle the evidence of all the murders that have happened in this prison for the past 20 something years that he had planned to expose to the US government. While the guards are getting the prisoners under control, 451 shows Kyle a secret passage to the prison garage for their next move. Kyle participates in one final fight, which he wins, but the guards have indicated they will kill him afterward. When two guards take Kyle to the garage, 451 launches an attack and kills one of them while Kyle holds the other at gunpoint and pins him down to the ground. After taking the key to free himself, Kyle takes one of the guards' uniforms to disguise himself and drives off in one of their cars while 451 stays behind to assassinate the warden for his misdeeds. His fate is unknown, but Kyle returns to the US and expose the prison's crimes. Three months later, the prison is shut down."}