{"mid": "InLikeFlint", "IMDB_id": "tt0061810", "title": "In Like Flint", "plot": "After observing the launch of a new space platform, Z.O.W.I.E. (Zonal Organisation World Intelligence Espionage) Chief Lloyd C. Cramden joins President Trent (Andrew Duggan) for a game of golf. While on the links they are interrupted by a small group, two women disguised as boys and an actor disguised as an old man, all from the Fabulous Face organization. Discreetly substituting the presidential golf ball with a small gas bomb they succeed in temporarily immobilizing the presidential party and replacing the president with the now-undisguised actor, who has been surgically altered to look exactly like him. The Fabulous Face organization has conceived a plot to gain control of the world and run it entirely by a group of women led by Elisabeth (Anna Lee); Cramden has more-or-less inadvertently stumbled upon this world-domination plot. The women want to establish a matriarchy, and the first step in their plan is to gain control of a US space facility in the Virgin Islands. Elisabeth has established the spa there as a cover. The women establish their headquarters near the rocket base to brainwash their male-oriented sisters by planting tape recorders in their hair dryers.\nPuzzled by an apparent three-minute time discrepancy - revealed by a perusal of a stopwatch that was active during the switch - Cramden visits former agent Derek Flint at his New York City home. Greeted by Flints' three female live-in companions in the living room of Flint's spacious Manhattan apartment, Cramden is informed that Flint is experimenting with the creation a dolphin language dictionary. Flint tells Cramden these undersea mammals are intelligent creatures and that they use sounds or sonics to communicate, a notion that had been only relatively recently reinforced by scientific experimentation at the time the film was produced. Flint then shows Cramden a sonic device of his own invention that is integrated into a cigarette lighter (and that, amongst many other uses mentioned - 82 are claimed for the gadget - is later revealed to service as a belt buckle), first moving and then shattering a white cue ball on the pool table. Cramden requests that Flint investigate the \"lost\" three minutes recorded by the stopwatch. Flint agrees to take up the matter after his return from a survival exercise in the Mojave Desert. During their meeting, Lisa Norton (Jean Hale), an operative of Fabulous Face, is meeting with Flint's three live-in girl friends, where she tricks the girls into accepting a free visit to the Fabulous Face Spa in the Virgin Islands. That evening Cramden encounters Norton, whom Fabulous Face has re-tasked to deal with his unexpected interference with their plans, at an Italian restaurant. Disguised as a southern schoolteacher visiting the city, she drugs him using cigarettes treated with a soporific substance and stages a compromising scene with a prostitute at a hotel; the scene is then photographed and published under the auspices of General Carter (Steve Ihnat), who is working with Fabulous Face. With Cramden framed as a libertine, the \"imposter\" President publicly suspends the disgraced spy chief from active duty.\nRecalled from his exercise, Derek Flint hypnotizes Cramden with his watch, which incorporates lights specifically designed for such a purpose, and learns the details of the encounter with Lisa. Tests of trimmings from Cramden's mustache (secured through the use of the ubiquitous, multi-talented cigarette lighter) reveal traces of \"euphoric acid\", a drug that when mixed with alcohol leaves the subject mildly sedated and aroused. Investigating further, Flint breaks into Z.O.W.I.E. headquarters and discovers that the two astronauts on the recently launched space platform are, in fact, Russian female cosmonauts. Flint is interrupted by General Carter and a force of turncoat guards who, after a struggle, believe they have killed Flint when he apparently falls into a document incinerator.\nHaving actually escaped his supposed demise, Flint travels to the Soviet Union to investigate the cosmonaut connection. Dancing in the Bolshoi ballet, he makes contact with ballerina Natasha, unaware that she is a Fabulous Face operative until she attempts to drug him with soporific cigarettes, as Lisa Norton had done to Lloyd Cramden in New York. Flint manages to foil Natasha's designs, but his subsequent interrogation of her is interrupted by the KGB, who arrive at her apartment intending to bring Flint to the Soviet Premier. Flint escapes their clutches and leads the KGB agents in a chase across the roof, tricking one agent to looking over the ledge by imitating a pigeon (making cooing noises), then reaching up from his precarious perch beneath the building's eaves and pulling the man to his death. Flint, hopping atop roof again, evades the other agent and manages to propel a grappling hook, shot from his multi-purposed cigarette lighter, onto another nearby roof and, walking along the line he's secured at his end, crosses over and escapes into a lower vent hatch. Flint next sneaks into the Kremlin, where he overhears the Premier bluffing the (fake) U.S. President; conversational clues point Flint to the Fabulous Face spa in the Virgin Islands.\nCramden has also traveled to the Fabulous Face Spa to investigate further but he is captured and imprisoned with the real President. The Fabulous Face staff, in anticipation of Flint coming to the spa, have imprisoned his girl friends in cryogenic freezing chambers. Flint boards an Aeroflot flight for Cuba disguised as a bearded Cuban Revolutionary. An amusing scene ensues on the Russian airliner which pokes tongue-in-cheek fun at the idea of how an airline would be run in the Caribbean \"socialist paradise\". Distracting the other passengers, he ties up the pilots, parachutes out over the Virgin Islands, and swims to the Fabulous Face complex. There he is intercepted by Lisa Norton, who brings him before the Fabulous Face leadership, a group of female business executives who explain their plan to brainwash women (through the use of subliminal messages transmitted by salon hairdryers, as revealed in the film's opening scenes) into overthrowing the male-dominated political order. As Flint attempts to talk the women out of their plan, he is interrupted by General Carter, who is dissatisfied with his subordinate role in the women's plot and plans to take power himself with the aid of the fake president. After a fight, Flint is captured by Carter's men and placed, along with Cramden, the captive U. S. President, and the Fabulous Face leadership with their lead staff, into cryogenic suspension. Derek Flint escapes his freezing chamber, where he has been imprisoned with the lovely Miss Norton, with the sonic wave amplifier device he demonstrated to Cramden in his New York apartment. Subsequently, Flint decides to join sides with the women in stopping Carter's plan to atomically arm the space station. Flint, Cramden, the real President Trent, and the women of Fabulous Face travel to the nearby base where the launch is scheduled to take place. Once they arrive, the women execute \"Operation Smooch\", using their beauty and sexual allure to distract, seduce, and subdue the male guards. After the women thereby succeed in taking over the control room, Carter (who is on board the rocket) threatens to activate the atomic warheads under his control unless he is allowed to proceed with the launch. Flint manages to board the capsule just before it takes off; once in orbit he and Carter fight in zero gravity, causing the spacecraft to tumble. After overpowering Carter, Flint escapes the capsule, which is then destroyed with a nuclear missile launched from the surface. Using his wave amplifier, Flint floats to the nearby space platform, where he enjoys the hospitality of the female cosmonauts there while awaiting return to Earth."}