{"mid": "Inside", "IMDB_id": "tt0425132", "title": "Inside", "plot": "The film opens with gloomy footage of night-time Dublin and a female radio DJ talking about three girls who recently went missing in the city centre. While in a pawnshop a young man (Eoin Macken) pawns his ring for cash, offered €50 he demands €200, and eventually accepts €75 and a second hand camcorder. He discovers a tape still inside, sits in a cafe, plays back the footage on the camera and watches the film.\nIn the footage, a group of girls; Sienna (Kellie Blaise), Cara (Tereza Srbova), Louise (Vanessa Fahy) and Sian (Natalia Kostrzewa) are heading out for the 21st birthday of Corina (Siobhan Cullen). As a gift, Sienna and Cara have bought Corina a video camera, with which they plan to record the evening's events. They blindfold Corina and instead of going to a club they break into an disused, abandoned and ramshackled warehouse on a secluded back street, much to Sian's disapproval. Once there, they start drinking, Corina's boyfriend Barry (Sean Stewart) arrives, and they reminisce and share secrets. After Barry leads Sian to a toilet, the remaining girls complain and back-stab about Sian. Louise then takes the camera and discovers Barry having sex with Sian.\nThen three vagrant, violent men; Eamo (Brian Fortune), Scat (Karl Argue) and Hughie (Emmett Scanlan) break in and gatecrash the party. They terrorise, verbally torment, abuse, and physically and sexually assault the women, and the women scream and wail in fear and despair. Sienna tries to confront them only to be head-butted by Hughie. When Barry tries to intervene, Hughie beats him to death and instigates a game of spin the bottle to rape the women. Whilst Sian is being raped by Eamo, the lights go out, odd sounds emanate from the building, old televisions switch themselves on and a baby's haunting cries are heard. Moments later, Eamo is yanked from Sian by an unseen force, quickly followed by Sian herself.\nThe negative energy from the brutality of the vagrants awakens a dormant, malevolent, demonic, supernatural force with a thirst for flesh and souls within the building. A brave Cara and hysterical Louise take the camcorder around the building, and try and escape using the narrow beam of the camera's built-in light via the labyrinthine, brick basements with decrepit corridors. They are approached by a Scat who is hysterical about something he has seen and begs them not to leave him alone. After shutting the door behind him, they find a dead Corina with her eyes gouged out. They then notice arches and ominous, arcane symbols and shapes signs on the walls in the dark. Louise enters a trance and is approached by a shambling, ghoulish, gore-covered, malign, emaciated naked figure (Patrick Moynan).\nA distressed Cara runs away and finds Sienna, they continue trying to find a way out from room to room but are trapped in the building. They are found by Hughie and shortly followed by The Creature. They break through a door leaving them behind, Sienna picks another lock, then Cara also enters a trance and is taken by The Creature. Sienna runs off through decrepit brick basements to a catacomb in an effort to evade The Creature, she discovers a dead workman and hides from The Creature before being followed and stalked by it, she then runs back, escapes from the warehouse and abandons the camcorder.\nAfter finishing watching the video, The Man uses the footage as a guide to retrace the steps to where the events occurred. The man tracks down the warehouse and makes his way into the basement. He walks into the aftermath and finds Sian and Louise. Sian cries for help as The Creature approaches, The Man tells her to be quiet and hides, she is then attacked and consumed by The Creature. After The Creature leaves, The Man then tries to rescue Louise, but while in a hypnotic trance she hits him over the head with a stone, escapes from the warehouse and is hit by a car."}