{"mid": "InspectorGadget2", "IMDB_id": "tt0301454", "title": "Inspector Gadget 2", "plot": "Inspector Gadget (French Stewart) and his Gadgetmobile (voiced by D.L. Hughley) are having problems in their line of work, mostly because of Gadget's overzealous nature. At this time, Dr. Claw (Tony Martin) escapes from prison. Mayor Wilson (Sigrid Thornton) takes this opportunity to create G2 (Elaine Hendrix), a female Gadget-type robot that can function normally. Gadget begins to fall in love with G2.\nClaw begins a new plan to steal gold from the United States Treasury. Gadget makes repeated attempts to stop Claw, but is continually foiled by his own bumbling and gadgetry glitches. Gadget's bumbling allows Dr. Claw's men to steal components for Claw's latest scheme and get away with it. Chief Quimby becomes increasingly frustrated and eventually fires Gadget, despite that Gadget had enough evidence from scientists to prove that it wasn't his fault. When Penny realizes that her uncle was fired and asks if there's anything she can do to help, Gadget tells her that she is still too young.\nPenny decides to examine the evidence on her own and eventually finds Claw's hideout at an abandoned bowling factory. She infiltrates the hideout, but Claw captures her. At the gala, Gadget gets a job as a limo driver who opens doors for the guests. Inside the gala, Claw activates the laughing gas to keep the people busy as he steals a 50,000-karat ruby, however G2 was immune to the gas. In order to stop the robot, Claw uses a magnet to trap G2. Afterwards, Claw and his minions escape after Gadget fails to recognize him. After G2's failure, Quimby is ordered by Mayor Wilson to deactivate the robot and end the Gadget program.\nGadget goes to the police department to reactivate G2. Brain tells them that Claw has kidnapped Penny and has used the three stolen supplies (ionic fuel cells, a protoid laser, and a ruby) to build a super-weapon. Outside, Claw activates his machine, which was hidden in a truck. The weapon freezes time in Riverton, allowing Claw and his minions to easily rob the Federal Reserve. Both Gadgets manage to avoid the weapon's blast and find Claw and his minions at the Federal Reserve.\nAt the treasury, Claw orders his minions to attack Gadget and G2 so he can get away. Gadget and G2 decide to switch chips in order to make Gadget work perfectly, leaving G2 to deal with the glitches. Gadget chases after Claw, who is escaping in an ice cream truck, but Claw drops Penny off the truck with explosives attached to her so that Gadget has to go after her instead of stopping Claw. At the bridge, Gadget stops Claw's truck with a puddle of bubble gum. Claw's minions try to escape but get stuck in the smear of bubble gum and are arrested. When Gadget orders Claw to put his hand (and claw) up, Claw gets away in a rocket-like escape pod, proclaiming: \"You may have won this round, but I'll get you next time, Gadget!\"\nThe movie ends with both Gadgets being awarded their jobs back, as well as being honored at a ceremony for their heroic actions, by Mayor Wilson."}