{"mid": "InTheHeartOfTheSea", "IMDB_id": "tt1390411", "title": "In the Heart of the Sea", "plot": "Herman Melville visits old Thomas Nickerson about the whaling ship Essex. The man refuses to speak but his wife insists otherwise, believing that Thomas has been tormenting himself by refusing to speak of his story, so he starts.Nantucket farmer and whaler Owen Chase convinces his wife all will be better as he gets his promised captaincy. But the executives have him as the first mate instead on his next whaling journey aboard the Essex, accommodating young Captain George Pollard, who is descended from a family of prestigious whalers. After they set out, Owen shows he's the de facto captain with his skills and initiative. One day the captain orders the crew to head into a squall despite Owen's warning. As the ship gets damaged the captain orders to turn around, but the waves wreak havoc to the ship. This starts open animosity between George and Owen, but they grudgingly remain allies for the sake of the ship's success.They capture a sperm whale, with Chase again displaying his expertise by correctly guessing the whale would not be able to dive deep enough to drag the harpoon boat under the water. Young Nickerson gets his first experience with whale oil when he is ordered to slip inside the head to scoop leftover oil. But no whale appears for the Essex for the next several months. After sailing far they meet a Spanish captain informing of them a large whale pack's location, but there's also a 'demon' whale. Both George and Owen agree to chase the pack, dismissing the 'demon' whale as a myth. They reach the place and soon find the 'demon', a 30-foot long white whale. It easily damages the Essex' hull, forcing the crew to abandon her. The whale oil the crew had gathered earlier catches fire, but the crew are able to save the three harpoon boats and some makeshift sails. The crew rations their supplies, but the supplies are very limited. The crew faces friction among them. Weeks pass and the men grow large beards and grow increasingly haggard. After days adrift, Owen spots the demon whale following them. The second mate Matthew Joy gets injured in a storm. Again Owen spots the demon whale; this time, it attacks the boats, killing some men. They get washed ashore to an island. But after some time, Owen finds a cave full of decomposing bodies and realizes that other crews that were stranded here waited in vain for someone to rescue them. Owen proposes to leave since no boats will come.They go, leaving the injured Matthew and three others. Some more days adrift, one of the men dies. As rations scarce over, Owen proposes they eat the remains to survive, and so they do. The men in George's boat even draw straws to determine who should sacrifice himself to be the next meal. Back in the present, the old Nickerson tearfully admits that the sheer atrocities of cannibalism and drawing lots to see who will be the next meal were the memories that he refused to share even with his wife. The crew again they spot the 'demon'. The crew cooperates and Owen gains a killing shot position, holding a makeshift trident that Captain Pollard had forged on the island. He and the whale exchange stares, canceling Owen's throw. The two remaining boats are separated by currents, but both eventually become rescued. Pollard's boat, containing Pollard and one other survivor, is found by another whaling vessel, and the vessels captain is horrified at the number of human bones in the boat. Owen's boat drifts near a harbor and is rescued by ships in the area. Arriving back in Nantucket, Owen and George are intimidated by the executives, who demand that Owen and George lie to preserve the industry's reputation. The executives do not want horror stories of monster whales and human cannibalism to spread among the sailors, who would inevitably quit from fear. But Owen refuses, claiming that it would be dishonorable to dismiss what the crew had gone through. George eventually tells the truth in the inquiry, and Owen moves from Nantucket. The young Nickerson meets Owen before Owen leaves, and Owen gives Nickerson a whale bone pin, a badge of whaling prowess that Nickerson had longingly looked at when he first boarded the Essex.The elderly Nickerson still has the pin in the present, and when he asks Melville what facts he will include in his story, Melville respectfully answers that he will \"add some, and leave out others,\" and Nickerson is relieved that Melville will likely not include the atrocities in his story. Melville leaves and Nickerson closes the door."}