{"mid": "InTheHeatOfTheNight", "IMDB_id": "tt0061811", "title": "In the Heat of the Night", "plot": "Phillip Colbert, a wealthy industrialist from Chicago, is constructing a factory in Sparta, Mississippi. One night in September 1966, when driving back into town after a meeting at the plantation home of one of Sparta's leading citizens, Eric Endicott, he is murdered. His body is found on the pavement at the front of an alley's entrance onto Main Street by Police Officer Sam Wood at about 3:30 a.m.\nPolice Chief Bill Gillespie arrives on the scene where the body has been discovered and takes direct charge of the investigation. A local undertaker and a freelance photographer have been summoned to the scene to assist the police with their investigation. The undertaker tells Gillespie that it is his immediate guess that the death occurred no more than a couple of hours earlier than the time of Wood’s discovery of the body, around 1:30 a.m. Gillespie is also told by Wood that his patrol was quiet, without incident, and with no one seen.\nGillespie, speculating that the crime may have been committed by a transient, orders Wood to verify that the pool hall is closed (its hours had it open until 12:30 a.m.), the streets and alleyways are clear, and that the train and bus depots are clear as well.\nAt the town train depot, Wood finds a black man, Virgil Tibbs, sitting quietly with his luggage in a business suit after 3:00 a.m., waiting for what seems to be no specified train. Officer Wood immediately arrests him (at gunpoint), cursorily searches him, and finds more than $200 in cash in his wallet.\nWood takes him into the Sparta police station, where he presents him to Gillespie. Prejudiced against blacks, Gillespie jumps to the conclusion that he has his culprit and attempts to get Tibbs to confess. But he is embarrassed to learn that Tibbs is a police officer from Philadelphia, Pennsylvania who happens to make more money in a week than Gillespie does in a month.\nGillespie phones Tibbs' chief to confirm the story. The chief informs Gillespie that Tibbs is his top homicide investigator and recommends that Tibbs stay and assist the investigation. Tibbs wants nothing more than to leave as quickly as possible, and Gillespie politely tells the chief that Tibbs' assistance won't be necessary. But as Tibbs prepares to head back to the train station, Gillespie swallows his pride and asks for help. Tibbs relents.\nLeslie Colbert, the victim's widow, already frustrated by the ineptitude of the local police, is impressed by Tibbs' expertise when he clears another wrongly accused suspect whom Gillespie has arrested on circumstantial evidence. She threatens to stop construction on the much needed factory unless Tibbs leads the investigation. Unwilling to accept help, but under orders from the town's mayor, Gillespie talks a reluctant Tibbs into working on the case.\nDespite the rocky start to their relationship, the two policemen are compelled to respect each other as they are forced to work together to solve the crime. Tibbs initially suspects wealthy plantation owner Eric Endicott, a racist who publicly opposes the new factory, as its workforce will consist primarily of black people. When Tibbs attempts to interrogate Endicott about Colbert, Endicott slaps him in the face, but Tibbs slaps him back, which leads to Endicott sending a gang of hooligans after Tibbs. Gillespie rescues him from the fight and orders him to leave town for his own safety, but Tibbs is convinced he is on the trail of the murderer, and refuses to leave until he has solved the case.\nTibbs' examination of Colbert's body has already placed the murder much earlier in the night than either Gillespie or the Sparta police had initially thought. He examines Colbert's car, and deduces that it was used to drive the dead man's body back from an as yet unknown location where Colbert was actually killed. Tibbs asks Wood to retrace his steps from his patrol on the night of the murder. Tibbs knows that an earlier time of death for Colbert means that Colbert's body was driven around Sparta and dumped into an alley while Wood was on patrol.\nTibbs and Gillespie accompany Wood on his patrol route, stopping at a diner where the counterman, Ralph Henshaw, refuses to serve Tibbs. When Tibbs notices that Wood has deliberately changed his route, Gillespie starts suspecting Wood of the crime. Tibbs indicates that he knows why Sam has changed his route but will not disclose the reason to Gillespie.\nWhen Gillespie discovers that Wood made a sizable deposit into his bank account the day after the murder (which Wood claims is gambling winnings) and Lloyd Purdy, a local, files charges against Wood for getting his 16-year-old sister Delores pregnant, Gillespie arrests Wood for the murder, despite Tibbs' protests. Purdy is offended that Tibbs, a black man, was present for his sister's interrogation about her sexual encounter with Wood, and he gathers a mob to get his revenge on Tibbs.\nTibbs is able to clear Wood by finding the original murder scene, the site where Colbert's factory will be built, and pointing out that Sam would not have been able to drive his police patrol car and the victim's car at the same time. Tibbs also admits that he knew immediately that Wood changed his route not to hide being a murderer, but to hide being a peeping Tom (peeping on Delores Purdy, who herself is an exhibitionist), and declined to publicly reveal this in order to spare Wood embarrassment.\nActing on a hunch, Tibbs tracks down the local back-room abortionist, who reveals that someone had paid for Delores to have an abortion. When Delores arrives, Tibbs pursues her outside, where he is confronted by the murderer, Henshaw. Purdy's mob has tracked down Tibbs and is holding him at gunpoint when he proves to Purdy that it was Henshaw, not Wood, who got Delores pregnant.\nHenshaw shoots Purdy dead before being disarmed by Tibbs. Henshaw is arrested and confesses to the murder of Colbert. He had robbed Colbert to gain money to pay for Delores's abortion but had accidentally killed him in the process.\nHis job done, Tibbs finally boards the Gulf, Mobile & Ohio train out of town, after being bid farewell by a now respectful Gillespie, \"Virgil, . . you take care, . . you hear.\""}