{"mid": "InTheLoop", "IMDB_id": "tt1226774", "title": "In the Loop", "plot": "When both the UK and the US are suggesting military intervention in the Middle East, Simon Foster (Tom Hollander), the Minister for International Development, unintentionally states that a war in the Middle East is \"unforeseeable\" during a radio interview on BBC Radio 4's Today programme, the Prime Minister's Director of Communications, Malcolm Tucker (Peter Capaldi) castigates Simon and tells him to toe the line.\nWith the help of his girlfriend Suzy (Olivia Poulet), Simon's new aide Toby Wright (Chris Addison) manages to get him into the Foreign Office meeting that day. Karen Clarke (Mimi Kennedy), the US Assistant Secretary of State for Diplomacy, who is against military intervention, is leading the meeting and flags a report by her assistant Liza Weld (Anna Chlumsky) titled \"Post-War Planning, Parameters, Implications and Possibilities\" (PWPPIP). The report heavily opposes intervention, noting the lack of intelligence except that which is coming from an unsubstantiated source known as \"Iceman\". Also during the committee it is hinted at that the US Assistant Secretary of State for Policy, Linton Barwick (David Rasche), may have set up a secret war committee. After the meeting, Simon is ambushed by reporters and contradicts his previous statements by saying the government has to be prepared to \"climb the mountain of conflict.\" Again he is subjected to chastisement from Tucker.\nReturning to the US, Karen and Liza conclude that Linton has created a war committee under the guise of Future Planning. At a party Karen teams up with General George Miller (James Gandolfini) who opposes the war believing that the US does not have enough troops to succeed. She tells him that they could use Simon on the committee as he would \"internationalise the dissent\". While on a fact-finding mission in Washington, Simon and Toby are invited by Karen to the Future Planning committee. Toby accidentally leaks the details of the meeting to a friend at CNN before meeting up with Liza at a bar; they end up sleeping together. Due to Toby's leak the Future Planning committee is swamped, but Karen and George fail to find out anything about the war. Both Karen and Linton turn to Simon to back their respective causes, but he struggles to say anything meaningful and ultimately does not take a side. Tucker, who is in the US, is diverted by Linton to the White House for a fake briefing. He confronts Linton, who tells him that he has to supply the US with the British intelligence on the situation in the Middle East, with which Linton will influence the vote on intervention.\nBack in the UK, Simon attends a surgery in his constituency of Northampton, where he is harassed by one constituent, Paul Michaelson (Steve Coogan), about a wall of Simon's constituency office, which is on the verge of collapsing into his mother's garden. News of this reaches the papers, who criticise Simon for not acting on the issue. Suzy finds out about Toby's one-night-stand with Liza and they break up. When leaving their apartment he gives her a copy of PWPPIP to leak if she chooses, but she calls him a coward for not doing it himself.\nThe President rushes forward the security council vote on military intervention by vetoing tariffs on Chinese imports. Simon tells his Director of Communications Judy Molloy (Gina McKee), to leak to the press that he would resign if the committee votes in favour. Once at the UN Headquarters Tucker gets word that PWPPIP has been leaked, making a yes vote unlikely. It is later revealed that Michael Rodgers (James Smith) of the Foreign Office accidentally leaked it, not realising its importance. Miller and Tucker convince Jonathan Tutt (Alex MacQueen), the UK Ambassador, to push the meeting forward so that the leak will not have time to spread in the US. However, Linton asserts his dominance over Tucker by telling him that the British intelligence has to be handed over before a vote can be taken. Unable to make Jonathan reverse his changes and delay the meeting, Tucker, with the help of Senior Press Officer Jamie McDonald (Paul Higgins), fabricates the details of PWPPIP by forcing Michael to remove all the arguments against intervention and presenting it as the intelligence. Subsequently, the committee votes in favour of intervention.\nAfter the vote, Miller informs Karen that he will not resign now that the war is happening. Simon realises that his own resignation is inevitable, but before he gets the chance, Tucker sacks him over his failure to prevent the collapse of Paul's wall, which he had managed to make headline news on television news. He tells Simon that he cannot take any sort of stand on the war, as he has contradicted himself too many times. Simon is reduced to mundane constituency business. A new Minister for International Development arrives at the office."}