{"mid": "IntoTheForest", "IMDB_id": "tt2625810", "title": "Into the Forest", "plot": "In the near future, two teenage sisters, Nell and Eva, live in a remotely located home with their father in an old-growth forest. There is a massive, continent-wide power outage that appears to be part of an overall technological collapse. Nell is careless with their car so that the battery is drained, so they are left stranded for days. Eventually their father is able to get the car working and they make it to the nearest town where they are able to buy some limited supplies including gas from a man called Stan. Later Eva attends dance class while her sister meets up with Eli, a boy she has a crush on. Returning home, they see a stranded car and the girls' father offers to help the passengers, but after they brandish guns he moves on.\nThey are low on gas, and things seem increasingly hostile, so the girls' father tells them they will not be returning to town until the power is back on. Shortly after, while cutting down a tree in the forest, the girls' father has an accident and cuts his leg with a chain saw. Before dying he tells the girls to take care of each other and love one another.\nThe girls struggle onwards for two months as they run low on food. They are surprised one night by a knock on the door that turns out to be Eli, who walked there looking for Nell. He tells the sisters that he had searched the surrounding houses and they are all abandoned. Nell and Eli sleep together several times and he finally tells her that he heard that out east there is still electricity, internet, and order. He convinces Nell to go with him, but Eva chooses to remain behind. Nell briefly leaves but then turns back after a night away from home, unwilling to leave Eva.\nReunited, the girls begin to do research on the plants in the forest and use it to collect berries and other edibles. One day, after Nell gets her period and realizes she is not pregnant, she encourages Eva to celebrate by getting drunk with her, and the two use some of their gas on the generator and watch home movies of their deceased parents, and Eva dances to music for the first time in half a year.\nThe following day Nell goes to collect berries while Eva stays behind and chops wood. She is approached by Stan, who rapes her and then steals the remaining gas they have. As a result, the girls become more reclusive, boarding up the house and refusing to go outside. Nell tries to help Eva with her depression, playing her a song and revealing that she had actually hidden the gas and that Stan did not take the rest of it.\nEventually Eva realizes she is pregnant, which helps to jolt her out of her depression. Though Nell encourages her to try to abort the baby, Eva insists on keeping it, saying that she doesn't want to lose anyone else. During her pregnancy Eva states that she'll have a boy and Nell believes she'll have a girl. The two bet on the gas, saying that whoever correctly predicts the baby's gender will win the remaining gas.\nDuring a storm several beams of the roof break and Eva begins to have contractions. The two sisters flee for a hollowed out tree stump that once served as their playhouse, where Eva gives birth to a baby boy. Returning to their now destroyed home, Eva decides to use her prize to destroy their home, so that passersby will think that they died in a fire and they will be safe from stragglers.\nRescuing a few precious items, the sisters burn down the house and then relocate to their new home, deep within the forest."}