{"mid": "InWhichWeServe", "IMDB_id": "tt0034891", "title": "In Which We Serve", "plot": "The film opens with the narration: \"This is the story of a ship\" and the images of shipbuilding in a British dockyard. The action then moves forward in time showing the ship, HMS Torrin, engaging German transports in a night-time engagement during the Battle of Crete in 1941. However, when dawn breaks, the destroyer comes under aerial attack from German bombers.\nEventually the destroyer receives a critical hit following a low-level pass. The crew abandon ship as it rapidly capsizes. Some of the officers and ratings manage to find a Carley float as the survivors are intermittently strafed by passing German planes. From here, the story is told in flashback using the memories of the men on the float. The first person to reveal his thoughts is Captain Kinross (Coward), who recalls the summer of 1939 when the Royal Naval destroyer HMS Torrin is being rushed into commission as the possibility of war becomes a near certainty.\nThe ship spends a relatively quiet Christmas in the north of Scotland during the Phoney War. But by 1940, the Torrin is taking part in a naval battle off the coast of Norway. During the action, a young terrified sailor (Attenborough) leaves his station while another rating (Mills) returns to work his gun after its crew is knocked unconscious by a torpedo strike. The damaged Torrin is towed back to port, all the time being harried by dive-bombers.\nSafely back in harbour, Captain Kinross tells the assembled ship's company that during the battle nearly all the crew performed as he would expect; however one man didn't. But he tells everyone present they may be surprised to know that he let him off with a caution as he feels as Captain he failed to make them understand their duty.\nReturning to the present, the float survivors watch the capsized Torrin take on water as the badly damaged ship slowly sinks. The raft is again strafed by German planes. Some men are killed, and \"Shorty\" Blake (Mills) is wounded. This leads to a flashback in which Blake remembers how he met his wife-to-be, Freda, on a train while on leave. It is also revealed, she is related to the Torrin's affable Chief Petty Officer Hardy (Miles). When both men return to sea, Freda moves in with CPO Hardy's wife and mother-in-law.\nThe Torrin participates in the Dunkirk evacuation of the British Expeditionary Force, (portrayed in the film by the 5th Battalion of the Coldstream Guards). Meanwhile, the nightly Blitz takes its toll on British towns. Blake soon gets a letter from home to say that Freda has given birth to his son during one raid. But the letter also says that Hardy's wife and mother-in-law were killed in the same attack. Stoically he goes to the Petty Officers' Mess to tell Hardy (who is in the process of writing a letter home) the bad news.\nThe flashback ends as the survivors on the life raft watch the capsized Torrin finally sink. Captain Kinross leads a final \"three cheers\" for the Torrin when suddenly another passing German plane rakes the raft with machine gun fire, killing and wounding more men. A British destroyer soon appears and begins rescuing the men. On board, Captain Kinross talks to the survivors and collects addresses from the dying. He tells the young man who once deserted his post that he will write and tell his parents that they can be proud that he did his duty; the critically injured young man smiles and dies peacefully. Relatives soon receive telegrams informing them about the fate of their loved ones.\nCaptain Kinross and the 90 surviving members of the crew are taken to Alexandria in Egypt. Wearing a mixture of odd clothing and standing in a military depot, Captain Kinross tells them that although they lost their ship and many friends, who now \"lie together in fifteen-hundred fathoms\", he notes that these losses should inspire them to fight even harder in the battles to come. The ship's company is then told they are to be broken up and sent as replacements to other ships that have lost men. Captain Kinross then shakes hands with all the ratings as they leave the depot. When the last man goes, the emotionally tired captain turns to his remaining officers, silently acknowledges them before walking away.\nAn epilogue then concludes: bigger and stronger ships are being launched to avenge the Torrin; Britain is an island nation with a proud, indefatigable people; Captain Kinross is now in command of a battleship. Its massive main guns fire against the enemy."}