{"mid": "IrmaVep", "IMDB_id": "tt0116650", "title": "Irma Vep", "plot": "Director René Vidal [Jean-Pierre Leaud] has been charged with the remake of Louis\nFeuillade's 1915 silent French movie Les Vampires. The star of Les\nVampires, Irma Vep, was played by a French actress named Musidora. In a\nsearch for an actress to play Irma, René has become impressed with Chinese\nmartial artist, Maggie Cheung [herself], because of her beauty, her grace, and her\npresence, he says. Maggie is hired and flies to Paris from Hong Kong.\nUnfortunately, she is three days late in arriving, which is causing havoc\nwith the filming. It also doesn't help that Maggie does not speak French.First thing on the agenda is for Maggie to be fitted in her costume,\na skin-tight latex catsuit, much like the one worn by Halle Berry in\nCatwoman. Next, Maggie grabs some lunch with costumer Zoé [Nathalie Richard] and learns\nthat René Vidal's reputation as a director is going downhill. To Maggie,\nhowever, he seems to believe in the remaking of Les Vampires, so she\nisn't worried. Then comes the shoots. They shoot the scene where Irma is\nchloroformed and a double substituted in her place. At the viewing of the\nshoot, however, René is so P.O.ed that he stomps out of the theater.That night, following the viewing, everyone drives off and leaves\nMaggie behind until Zoé happens by and offers Maggie a ride on her\nmotorbike. They go to a friend's house for dinner, where everyone is\ndissing René in French and Maggie has no idea what they are saying.\nMeanwhile, out in the kitchen, Zoé and a friend are discussing Zoé's\nattraction to Maggie, and the firend advises Zoé to go for it. When she\ngets Maggie alone, the friend tells her that Zoé wants to have sex with her.\nMaggie is very embarrassed.When Maggie gets back to the hotel, she finds a half dozen messages\nfrom René, who's been calling every few minutes, asking her to call back.\nHe asks her to meet him at his house. By the time Maggie arrives, the\npolice are buzzing in and out. René has had a huge fight with his wife,\nand the doctor on call has given him tranquilizers. As René is in the\nmiddle of explaining to Maggie her role in the movie, he passes out.Maggie goes back to her hotel room. Almost as though she is possessed\nby the spirit of Irma Vep, she puts on her catsuit and sneaks into the\nroom of a hotel guest where she finds a pile of jewelry and takes it with\nher. Like Irma Vep, she flees to the rooftop where she drops the jewelry\nover the ledge. The next morning, Maggie is so tired that she sleeps\nthrough her wakeup until Zoé shows up with the hotel passkey to see if\nMaggie is okay. When Maggie gets to the studio, she rehearses the scene\nwhere Irma kills the Great Vampire.Meanwhile, René has come up missing, and the entire crew is in\ndistress. It turns out that René has had a nervous breakdown and has been\nadmitted to a rest home. René's director friend, José Mirano, is going to\ntake his place. What Mirano cannot comprehend is why René chose a Chinese\nactress to play Irma Vep, the epitome of the Paris Underground. Mirano\nagrees to take over direction but only if he can replace Maggie.Maggie is given a ticket to New York where she is to meet with Ridley\nScott and then fly on to Los Angeles. Mirano views the film as it's been\nedited by René. The film is a total mess (although some reviewers claim\nthat it's a \"love sonnet\" from René to Maggie). [Original Synopsis by bj_kuehl]"}