{"mid": "IronSky", "IMDB_id": "tt1034314", "title": "Iron Sky", "plot": "The film opens in 2018 with an American manned landing mission to the Moon. The lander carries two astronauts, one of them an African American male model, James Washington, specifically chosen to aid the U.S. President in her re-election (various \"Black to the Moon\" word-play posters are seen in the film, extolling the new Moon landing).\nUpon landing on the far side of the Moon, they encounter the descendents of Nazis who escaped to the Moon in 1945 (self-styled the \"Fourth Reich\" in dialogue). Washington is taken captive after the other astronaut is killed. Nazi scientist Doktor Richter examines Washington and obtains his smartphone, which he later recognizes as having more computing power than the 1940s style computers of the Fourth Reich, enabling its use as a control unit to complete their giant space battleship Götterdämmerung.\nWhen Richter strives to demonstrate his Wunderwaffe to the current Führer, Wolfgang Kortzfleisch, the phone's battery is quickly exhausted. Nazi commander Klaus Adler, chosen for genetic reasons to mate with Earth specialist Renate Richter (Doktor Richter's daughter), embarks in a flying saucer to collect more such computers on Earth. He takes with him Washington, who has been \"Aryanized\" by Doktor Richter using an \"albinizing\" drug.\nUpon landing in New York City, they discover that Renate has stowed away with them. They abandon Washington after he connects them with the President's campaign adviser, Vivian Wagner. Whereafter Adler and Renate energize the President's re-election campaign using Nazi-style rhetoric. At the time, Renate is unaware of Adler's ambition to replace Kortzfleisch and rule the world. After three months, Kortzfleisch lands on Earth and confronts Adler, but is killed by Adler and Vivian. Adler declares himself the new Führer before returning to orbit in Kortzfleisch's flying saucer, deserting Vivian but taking her tablet computer.\nConcurrently, Renate is persuaded by the now-homeless Washington that Adler intends global genocide. Shortly afterwards, the Moon Nazis launch a mass attack on the Earth with a fleet of giant Zeppelin-like spacecraft called Siegfrieds which tow asteroids as missiles and launch countless flying saucers at New York City, where they destroy the Statue of Liberty and blitz the city. The U.S. Air Force engage the flying saucers with some success.\nThe United Nations assembles to discuss the Moon Nazi threat. The President appoints Vivian as commander of the secretly militarised spacecraft USS George W. Bush, which carries nuclear and directed-energy weapons, only to discover that most of the other nations (except Finland) have also secretly armed their spacecraft. They dispatch them against the Nazi fleet and wipe out the Siegfrieds.\nAdler arrives in Kortzfleisch's flying saucer with the tablet computer to activate the Götterdämmerung. Renate and Washington travel in Adler's flying saucer to the Götterdämmerung, where Washington goes to disable the engines while Renate seeks out Adler. Meanwhile, the international space fleet damage the Nazis' Moon base and approach the Götterdämmerung which dwarfs them all. Commanding the Götterdämmerung, Adler destroys parts of the Moon to expose Earth to his line-of-fire. During the battle, Washington disconnects Vivian's tablet from the control panel of the Götterdämmerung, while Renate kills Adler before he can fire at Earth. Renate and Washington separately escape as the Götterdämmerung crashes into the Moon.\nThe U.S. President congratulates Vivian from the UN session; whereupon Vivian discloses the presence of large tanks of helium-3 on the Moon, of which the President immediately assumes sole claim on grounds that its possession ensures a millennium-long supply of energy. This enrages the other UN members, who engage in a brawl, while the international fleet turn on each other.\nAt the damaged Moon base, Renate reunites with Washington, who has reverted his pigmentation back to normal. They kiss before a confused group of Nazi survivors, whom Renate assures, \"[they] have a lotta work cut out for [them]\". The final moments of the film show the Earth apparently during an international nuclear war. At the very end of the credits, the planet Mars is revealed with an artificial satellite in orbit.\nMost of the names in the movie have a symbolic and often ironic meaning. The plot refers to several motifs that originate in post-war Esoteric Nazism, such as the symbol of the Black Sun and Nazi UFOs."}