{"mid": "ItHappenedHere", "IMDB_id": "tt0055024", "title": "It Happened Here", "plot": "=== Setting ===\nThe film opens with the statement: \"The German invasion of Britain took place in 1940 after the retreat from Dunkirk.\" After months of fierce resistance and brutal reprisals, the occupying forces manage to restore order, largely suppressing the resistance movement. However, due to demands from the Ural Mountains front, most German troops are eventually removed from Western Europe, and the garrisoning of Britain is largely carried out by local volunteers to the German army and the SS.\nEngland appears to be governed by the British Union of Fascists (the situation in the rest of the British Isles is unclear but presumably similar); the followers are referred to as \"Blackshirts\", wear uniforms with the Flash and Circle, and a framed portrait of Oswald Mosley appears in a government building, alongside one of Adolf Hitler. Meanwhile, the United States, having entered the war, stations its U.S. Seventh Fleet off Ireland. The Americans begin bombing raids on the southwest coast of England, as well as supplying men and equipment to a resurgent partisan movement.\n=== Story ===\nSet in 1944–1945, the story focuses on an apolitical Irish district nurse, Pauline. Following an upsurge in partisan activity in her area, she is forcibly evacuated from her village by the Germans and their collaborators and witnesses an attack on German forces by a group of British partisans, during which a number of her friends from the village are killed in the crossfire. The attack (and more particularly the deaths) influences her subsequent views and decisions.\nShe is evacuated to London, where she reluctantly becomes a collaborator, joining the medical wing of the Immediate Action Organisation (IAO), a kind of quasi-paramilitary medical corps and is re-trained as an ambulance attendant. Although at first reluctant and intent on remaining apolitical, Pauline begins to show the effects of fascist indoctrination in her behaviour. It is a reunion with old friends (an antifascist doctor and his wife) that gives Pauline pause and when she subsequently discovers they are harbouring an injured partisan she reluctantly agrees to help.\nGradually Pauline learns more about the impacts of the German occupation and she sees her friends arrested. The discovery of her association with the antifascist couple by her superiors in the IAO leads to her demotion and transfer to another part of the country. She welcomes the move at first, as her new job appears to have less of the paramilitary trappings. However Pauline discovers that she has unwittingly taken part in a forced euthanasia programme and killed a group of foreign forced labourers who had contracted tuberculosis.\nThe film ends with Pauline being arrested after protesting and refusing to continue but before she can be put on trial, she is captured by the resurgent British Resistance and agrees to work for them as they fight to liberate the country with the help of arriving American troops. In the finale, Pauline tends a group of wounded partisans while, out of her view, a large group of soldiers from the Black Prince Regiment of the British Legion of the Waffen-SS who had surrendered are summarily shot, a scene reminiscent of an SS massacre of civilians earlier in the film."}