{"mid": "IVitelloni", "IMDB_id": "tt0046521", "title": "I vitelloni", "plot": "As summer draws to a close, a violent downpour interrupts a beach-side beauty pageant in a provincial town on the Adriatic coast. Sandra Rubini (Leonora Ruffo), elected \"Miss Siren of 1953\", suddenly grows upset and faints: rumours fly that she’s expecting a baby by inveterate skirt chaser Fausto Moretti (Franco Fabrizi). Under pressure from Francesco (Jean Brochard), his respectable father, Fausto agrees to a shotgun wedding. After the sparsely attended middle-class ceremony, the newlyweds leave town on their honeymoon.\nUnemployed and living off their parents, Fausto's twenty-something friends kill time shuffling from empty cafés to seedy pool halls to aimless walks across desolate windswept beaches. During the interim, they perform immature pranks. Taunting honest road workers from the safety of a luxury car they never earned, they're given a sound thrashing when it runs out of gas.\nMoraldo Rubini (Franco Interlenghi), Sandra's brother and the youngest of the five vitelloni, uncomfortably observes Fausto's womanizing as he ponders his own existence, dreaming of ways to escape to the big city. Riccardo (Riccardo Fellini), the baritone, nourishes unrealistic ambitions to sing and act. Alberto (Alberto Sordi), the daydreamer, is supported by his mother and self-reliant sister, Olga (Claude Farell). Vulnerable and effeminate, he's unhappy that Olga is secretly dating a married man. Leopoldo (Leopoldo Trieste), the aspiring dramatist, writes a play that he discusses with Sergio Natali (Achille Majeroni), an eccentric stage actor he hopes will perform in it.\nBack from his honeymoon and settled in with Sandra, Fausto is forced to accept a job as a stockroom assistant in a religious-articles shop owned by Michele Curti (Carlo Romano), a friend of his father-in-law's. Incorrigible, he pursues other women even in his wife's presence.\nAt the annual masquerade ball, Fausto is bedazzled by the mature beauty of Giulia Curti (Lída Baarová), his employer’s wife. Alberto, in drag and half-drunk, executes a surrealistic dance across the ballroom floor with a goofy carnival head made of papier-mâché. Returning home at dawn, Alberto is devastated to find his sister running off for good with her married lover. Fausto’s naive attempt to seduce Giulia results in his being humiliated and then fired by her husband. In revenge, he steals the statue of an angel in gold paint from his former employer, enlisting the loyal Moraldo to help him sell it to a monk. Suspicious, the monk turns down the offer. Fausto ends up giving the statue to a simple-minded peasant (Silvio Bagolini) who sets the angel on a mound outside his hovel, admiring it from afar.\nOne evening after a variety show, Leopoldo agrees to accompany old Sergio for a walk along the seashore to discuss the merits of his play but when the actor propositions him, he takes to his heels in horror. Learning of Fausto’s one-night stand with an actress, Sandra runs away from home, taking the baby with her. Riccardo, Alberto, Leopoldo, and Moraldo all join in Fausto’s desperate search to retrieve his wife and child. When they find her at the home of Fausto’s father, Francesco pulls off his belt in a rage and finally whips his son. Later Fausto and Sandra walk home happily, with optimism about their life together. Resolved to abandon the provincial monotony of his dead-end town, Moraldo boards the train for anyplace else (Rome), imagining his vitelloni friends sleeping their lives away."}