{"mid": "IWannaHoldYourHand", "IMDB_id": "tt0077714", "title": "I Wanna Hold Your Hand", "plot": "Ed Sullivan prepares the ushers for the Beatles' performance on his show. In Maplewood, New Jersey, Rosie and Pam visit the record shop. Janis, the owner’s daughter, hates the Beatles and prefers folk music. Grace wants to rent a limo, so they can pull up to the Beatles hotel, and get exclusive photos of the band. The girls recruit shy Larry DuBois, the local undertaker’s son, as he has access to limos. They leave for New York City and on the way pick up Tony--a brash, streetwise guy. After driving all night, they arrive in New York early on the morning of February 9, 1964. When they pull up at the hotel, Grace, Rosie and Pam sneak in, while Larry pulls the limo with Tony and Janis in it to the side of the building. Once inside, Grace and Rosie sneak into a service elevator, while Pam is left in the basement in a storage closet. Pam (who was the only one not really interested in seeing the Beatles, as she is engaged) sees them leave the hotel as they go to rehearse. Meanwhile, Grace gets off on the 11th floor. Rosie rides up to the 12th, where the Beatles’ room is located. She is caught, escapes and meets Richard Klaus, a fellow Beatles fan who is hiding out in a room in the hotel. Pam hides in a food cart and is taken to the Beatles’ room, where she handles all their stuff and hides under John’s bed. Grace is caught too, so she goes to the CBS studio, where a guard tells her that for 50 dollars he will let her in backstage while the show is on. Richard and Rosie are tossed from the hotel. Janis meet Peter, a kid whose dad will give him three tickets to The Ed Sullivan Show if he will get his Beatles style hair cut into a crew cut. She recruits Tony to steal the dad’s wallet and get the tickets. Larry asks Grace to the Valentine’s Day dance at school, but she brushes him off.\nGrace decides to take the place of a prostitute who has an encounter at the hotel to get the 50 dollars she needs. Rosie knows the question on the radio call in to win tickets, so she uses the room key she still has, goes to the room, calls in and wins two tickets. Richard then strands them in the elevator. Pam is caught, but interviewed by the press. Her fiancé arrives to get her, but she uses the ticket she was given by the Beatles roadie Neil Aspinall to see the show. Once in the john’s room, Grace can’t go through with it and hides, but takes photos of the john and the hooker and blackmails him into giving her 50 dollars. He attacks her, but Larry saves her. Tony lifts the dad’s wallet. It’s empty, but they get the tickets anyway. Richard and Rosie escape from the elevator and get to the show. Tony’s effort to sabotage the show fails. Larry parks the limo beside CBS in an alley and is about to be arrested for improper parking and driving without a license, but Grace uses the 50 dollars to bribe the cop in to letting him go, but now she can’t get backstage and get her photos. Grace accepts Larry’s invitation to the dance. On leaving the show the Beatles take a wrong turn and end up in Larry’s limo. They drive away, pursued by a mob of screaming fans, while Grace snaps away."}