{"mid": "JackAndJill", "IMDB_id": "tt0810913", "title": "Jack and Jill", "plot": "When you get together with your family for the holidays, everybody has that one family member who drives you crazy. They mean well, and you love them, but stillFor Jack, that's his sister his twin sister Jill. Growing up, their lives were incredibly intertwined. But ever since Jack moved away, they have moved in different directions. Jack has become a highly motivated and successful ad executive in L.A., while Jill was the one who stayed back east and took care of their parents. Now, they see each other only once a year, at Thanksgiving, when Jill comes to L.A. for a visit. Time and distance have taken a toll on their relationship and now Jack finds himself enduring Jill's annual visit, rather than enjoying it.Still, its just a couple of days, right? Wrong. Jack and Jill get off on the wrong foot just like always and the only way Jack can make things right is to ask Jill to stay on through Hanukkah, giving her some time to enjoy everything L.A. has to offer, from game shows to horseback riding. Still, Jack isn't exactly pleased that his sister is extending her tripAnd adding to Jacks stress is the fact that things aren't going all that well at his ad agency. His biggest client, Dunkin Donuts, is demanding that Jack deliver Al Pacino to perform in a new Dunkaccino commercial. Jack wonders how in the world he is going to get Pacino does he even do commercials? and his quest is intensified when he finds out that the famous actor is having a nervous breakdown and losing his mind. Having played one too many roles, the actor is starting to confuse reality with the parts he is playing and is acting out in some increasingly erratic ways.When Jack takes Jill to see the Lakers, he approaches Pacino about the commercial, but is stunned when Pacino is much more interested in talking to Jill. It turns out that Jill reminds Pacino of everything he left behind his boyhood home in the Bronx, his childhood and for Pacino, who is preparing to play Don Quixote on stage, something clicks. Because hes having trouble with reality, suddenly, Jill isn't Jacks wacky sister shes Dulcinea, Don Quixotes idealized romantic love and Pacino must conquer her affections to realize his quest.Trouble is, Jill isn't interested. But Pacino will not be brushed aside so easily. Inviting himself to Jack and Jill's surprise birthday party, he sweeps Jill off her feet and takes her for a private party at his home but Jill still isn't biting, which only inflames Pacino's passion (and insanity). Its not clear who's more upset Jill, from the experience, or Jack, who thinks his chance to get Pacino could be over, or Pacino, who is completely losing it for Jill.For Jack, now the shoe is on the other foot: he has to try to convince Jill to extend her trip even further and give Pacino one more shot. Its a move that sets in motion a wild, outrageous series of events that reveals to Jack who the most important people in his life are and have always been.Sony Pictures"}