{"mid": "JackRyanShadowRecruit", "IMDB_id": "tt1205537", "title": "Jack Ryan: Shadow Recruit", "plot": "Jack Ryan (Chris Pine) joins the U.S. Marine Corps after the 9/11 attacks. He is a Marine second lieutenant when the helicopter he is riding in is shot down over Afghanistan. Ryan is critically injured and during a lengthy rehab, he attracts the attention of Dr. Cathy Muller (Keira Knightley), his future wife, and the interest of the CIA, in the person of Thomas Harper (Kevin Costner). The CIA is impressed with Ryan's ability to recognize complex patterns. As part of the recruitment, Ryan is sent by the CIA back to finish his PhD at the London School of Economics, which he had dropped after enlisting.Ten years later, Ryan is working on Wall Street at both a cover job as a compliance officer at a stock brokerage, and as a covert CIA analyst, looking for suspect financial transactions that would indicate terrorist activity. When the Russian Federation loses a key vote before the United Nations, Ryan notices that the markets do not respond in the expected way. He discovers that trillions of dollars held by Russian organizations have \"fallen off the radar\". There is so much money held out of view that the United States economy may actually be vulnerable to a sudden move. All of these funds are controlled by Viktor Cheverin (Kenneth Branagh), a veteran of the Soviet invasion of Afghanistan. Cheverin, along with a group of key Russian politicians, have been left embittered by the United States' covert intervention in the invasion and are seeking revenge.Ryan's employer happens to do business with Cheverin, so when Ryan discovers that certain accounts have become firewalled away from him as auditor, he has a legitimate excuse to visit Moscow and investigate. On arrival he narrowly survives a murder attempt by an assassin posing as his bodyguard. Ryan sends out an SOS and is surprised to learn that his backup is Harper. During their debrief, Ryan explains how Cheverin's shadow investments can make the United States vulnerable: A staged terrorist attack will spook and weaken global markets including US debt obligations. Then Cheverin will dump all of his inventory onto the market at the same time, causing the American dollar to collapse. It would hurt China too because of their dollar holdings, and so the goal is to trigger a new Great Depression.At his frosty meeting with Cheverin the next day, he is told that the problem company and all of its assets have been sold. This is transparently about stopping Ryan's audit.Meanwhile, Ryan's fiancée Cathy has become concerned that he is having an affair and secretly flies to Moscow to meet him. Against protocol for unmarried couples, Ryan reveals that he works for the CIA, to her great relief. Improvising on the situation, Harper has Cathy agree to be included in a plan to infiltrate Cheverin's offices. Ryan and Cathy meet Cheverin at an upscale restaurant across the street from Cheverin's office; over dinner Ryan causes a scene and \"insults\" Cathy. Excusing himself, he gains access to Cheverin's office where he downloads critical files. He discovers Cheverin has been secretly propping up the Chinese and Japanese economies for 20 years, and that the entire global economy is vulnerable. Cheverin, alerted to Ryan's infiltration, abducts Cathy. Ryan rescues her, but Cheverin maintains that Ryan cannot stop his plan.Ryan and the CIA discover Cheverin used a falsified death certificate to place his son Aleksandr (Alec Utgoff) in the United States as a sleeper agent. Ryan uses his talent for pattern recognition to locate Aleksandr's hideout and intended target: Wall Street. He locates a bomb hidden in a dummy police response vehicle and gives chase. Unable to defuse it, he hijacks the vehicle and crashes it into the East River, killing Aleksandr and preventing the loss of any innocent life.Ryan and Cathy are reunited and discuss their future together. Cathy decides to stay with him despite his career and the risks he has to take. Cheverin is executed by his co-conspirators in Russia, while Ryan, now married, and Harper are called to the White House to brief the president."}