{"mid": "JakersTheAdventuresOfPiggleyWinks", "IMDB_id": "tt0381772", "title": "Jakers! The Adventures of Piggley Winks", "plot": "Jakers! takes place in two different settings, in two different time periods.\nIn the present time (the frame story), Piggley Winks lives in the United States of America (or Great Britain, according to different versions) and tells stories of his childhood in a rural area in the south of Ireland to his three grandchildren. In flashback, he is seen as a child, playing with his friends and going to school in rural Ireland in the mid-1950s. Most of the main characters are anthropomorphic animals—including Piggley and his family, who are all pigs. However, there are normal, non-anthropomorphic animals in the show as well.\n=== Past ===\nPiggley Winks lived with his parents Padrig and Elly and his younger sister Molly at Raloo Farm in Ireland during the 1950s. His best friends are Dannan O'Mallard, a duck who lives in a hut by a pond with her rarely seen grandmother, and Fernando Toro, known as Ferny, a young bull who lives with his father, the Spanish blacksmith Don Toro in the village of Tara. His rival is the main antagonist, Hector McBadger.\nPiggley lives his everyday life on the farm as a normal child, going to school, helping his parents, taking care of his sister, and having adventures, almost always followed by his friends. He has always been interested in stories and legends, and his fertile mind and mischievous spirit put him in many unpredictable situations, like believing fairies turned Ferny into a bug, trying to hatch a supposed dragon's egg, using the Salmon of Knowledge to pass the school exam, and even trying to capture the legendary Fir Darrig.\nEach story also features a subplot featuring Wiley, the sheep (voiced by Mel Brooks). As the only sheep in the flock who can talk, he believes he is their natural leader, and tries to get the other sheep to do all kinds of anthropomorphic things (singing, racing, playing sports, acting, etc.), with varying degrees of success. He is later assisted by his mate, a female sheep named Shirley (in earlier seasons, Shirley could not talk, and in the episode \"Growing Pains\" gave birth to a lamb, later named Little Baa).\nA running gag on the show is that Wiley's subplot and Piggley's plot would collide (e.g. in \"Sheep on the Loose\", Wiley runs away and Piggley, as the shepherd, tries to find him).\nCommonSenseMedia explain that at the end of each episode there is a live-action segment, in which \"group of children talk about their own experiences and feelings, reflecting on what the episode has been about\".\n=== Present ===\nAn elderly Piggley lives with his daughter Ciara and her three children, the twins Sean and Seamus, and their older sister Meg. Whenever the children have a problem, Piggley tells them one of his childhood stories as a moral lesson. The grandchildren are able to identify exaggerations in his stories.\nThe original American accents of Ciara and her children have been dubbed with English accents for broadcast in the United Kingdom."}