{"mid": "JamesAndTheGiantPeach", "IMDB_id": "tt0116683", "title": "James and the Giant Peach", "plot": "Protagonist James Henry Trotter, 4 years old, lives with his loving parents in a beautiful cottage by the sea in the south of England, until his parents are killed by an escaped rhinoceros during a shopping trip in London.\nAs a result, James is forced to live with his two cruel aunts, Spiker and Sponge, in a run-down house on a high, desolate hill near the White Cliffs of Dover. For 4 years, James is treated as a drudge, forced to do hard labour, beaten for hardly any reason, improperly fed, and forced to sleep on bare floorboards in the attic. One summer afternoon, after a particularly upsetting altercation with his aunts, James stumbles across a mysterious stranger, who gives him magic green \"crocodile tongues\" which, when drunk with water, will bring him happiness and great adventures. On the way to the house, James spills the \"tongues\" onto a barren peach tree, which then produces a single peach that quickly grows to nearly the size of a house. The next day the aunts sell tickets to neighbours to see the giant peach.\nWhen night comes, the aunts send James to collect rubbish discarded by the crowd; but he discovers a tunnel, which leads to secret room inside the peach's seed, inhabited by a rag-tag band of human-sized, talking invertebrates (a grasshopper, centipede, earthworm, spider, ladybug, silkworm, and a glow-worm), also transformed by the magic given him earlier. These then become James' companions in his adventure. Upon his arrival, the Centipede bites through the stem of the peach, whereupon it rolls down the hill, crushing and killing Spiker and Sponge on the way. It rolls through villages, houses, and a famous chocolate factory before falling off the cliffs at Dover into the sea. James and the bugs emerge to find themselves floating in the sea, but manage to sustain themselves on the delicious flesh of the peach. Hours later, near the Azores, the peach is surrounded by sharks. Using the Earthworm as bait, James and the others of the peach lure five hundred seagulls to the peach from the nearby islands, which they tie to the broken stem as a source of flight.\nNow airborne, the peach crosses the Atlantic Ocean. At one incident, the Centipede entertains the others with ribald dirges to Sponge and Spiker, but in his excitement falls into the ocean and is rescued by James. That night, thousands of feet in the air, the giant peach floats through mountain-like, moonlit clouds, where the protagonists discover the ghostly \"Cloud-Men\", who control the weather. As the Cloud-Men form hailstones to throw down to the world below, the Centipede insults them, and an army of Cloud-Men pelt the giant peach with hail. They escape and then encounter a rainbow which they smash through. One Cloud-Man pours a tin of \"rainbow paint\" onto the Centipede, briefly turning him into a statue before he is freed by a Cloud-Man who pours water on him. One Cloud-Man almost boards the peach by climbing down the silken strings tied to the stem, which the Centipede severs to release him. Thereafter the protagonists approach New York City; whereupon the military, police, fire department, and rescue services are all called, and people flee to air raid shelters and subway stations, believing the city is about to be destroyed.\nA huge passenger jet flies past the giant peach, and severs the silken strings connecting the seagulls to the peach, which is then impaled upon the tip of the Empire State Building. The people on the 86th floor at first believe the inhabitants of the giant peach to be monsters or extraterrestrials; but when James explains his story, the people hail James and his friends as heroes. The remains of the giant peach are brought down to the streets, where it is consumed by the town's children, and its seed is established as a mansion in Central Park, where James lives, while his friends establish careers in the human world. In conclusion, James is said to have written the preceding story."}