{"mid": "JasonGoesToHellTheFinalFriday", "IMDB_id": "tt0107254", "title": "Jason Goes to Hell: The Final Friday", "plot": "The undead serial killer Jason Voorhees returns to Camp Crystal Lake. An undercover government agent lures Jason into a trap set by the FBI, and several armed men blow him to bits, destroying his body. His remains are sent to a morgue, where a coroner becomes possessed by Jason's spirit after ingesting Jason's putrid heart. Jason, now in the coroner's body, escapes the morgue, leaving a trail of death.\nAt Crystal Lake, he finds three partying teens. While two of them have sex, Jason kills the third, then the other two. Jason attacks two police officers, killing one and possessing the other. Meanwhile, bounty hunter Creighton Duke discovers only members of Jason's bloodline can truly kill him, and he will return to his normal and near-invincible state if he possesses a member of his family. The only living relatives of Jason are his half-sister Diana Kimble, her daughter Jessica, and Stephanie, the infant daughter of Jessica and Steven Freeman.\nJason makes his way to Diana's house. Steven bursts in and attacks Jason. Diana is killed and Jason escapes. Steven is falsely accused and arrested for Diana's murder, and meets Duke, who reveals Jessica's relation to Jason. Determined to get to Jessica before Jason does, Steven escapes from jail. Jessica is dating tabloid TV reporter Robert Campbell. Steven goes to the Voorhees house to find evidence to convince Jessica but falls through rotten boards. Robert enters the upstairs room and receives a phone call which reveals that he is attempting to \"spice up\" his show's ratings by putting emphasis on Jason's return from death, having stolen Diana's body from the morgue for this reason. Jason bursts in and transfers his heart into Robert, while the body he left melts. Jason leaves with Steven in pursuit. Jason attempts to be reborn through Jessica but is disrupted by Steven, who hits him and takes Jessica into his car. Steven stalls Jason by running him over. When he tries to explain the situation to Jessica, she disbelieves him and throws him out of the car. Jessica goes to the police station.\nJason arrives at the police station and kills most of the officers. He nearly possesses Jessica before Steven stops him; Jessica realizes Steven is right. In the chaos, Duke makes his escape. Jessica and Steven make their way to the diner to grab the baby. Jason arrives but is attacked by the owners of the shop. He kills the owners but is injured by waitress Vicki, who shoots him with a shotgun then impales him with an iron rod, but then impales her on the same rod before crushing her head, killing her. Jason is presumably killed, and Jessica and Steven discover a note from Duke, telling them that he has the baby and demands that Jessica meet him at the Voorhees house alone.\nJessica meets Duke at the Voorhees house and is given a mystical dagger which she can use to permanently kill Jason. A police officer enters the diner where Robert, possessed, transfers his heart into him. Duke falls through the floor, and Jessica is confronted by Landis and Randy. Landis is killed accidentally with the dagger, and Jessica drops the dagger. Randy, possessed, attempts to be reborn through Stephanie, but Steven arrives and severs his neck with a machete. Jason's heart, which has grown into a demonic infant, crawls out of Randy's neck to Diana's dead body in the basement. Steven and Jessica pull Duke out of the basement as Jason discovers Diana's body and slithers up her vagina, allowing him to be reborn.\nWhile Steven and Jessica attempt to retrieve the dagger, Duke distracts Jason and is killed with a bear hug. Jason turns his attention to Jessica, and Steven tackles Jason, who both fight outside while Jessica retrieves the dagger. Jason badly brutalizes Steven and when he is about to kill him, Jessica stabs Jason in the chest, releasing the souls Jason accumulated over time. Demonic hands burst out of the ground and pull Jason into the depths of Hell. Steven and Jessica reconcile and walk off into the sunrise with their baby. Later a dog unearths Jason's mask while digging in the dirt. Freddy Krueger's gloved hand bursts out of the dirt and pulls Jason's mask into the ground as Freddy's signature laughter is heard."}