{"mid": "Jaws", "IMDB_id": "tt0073195", "title": "Jaws", "plot": "Late one night, on one of the many beaches of Amity Island off the coast of New England, a group of teenagers throw a bonfire party. Chrissie Watkins (Susan Backlinie), a beautiful blonde, catches the eye of partygoer Tom Cassidy (Jonathan Filley) and leads him away from the group to go skinny-dipping with her in the ocean. Tom, quite drunk, passes out on the beach before he can even undress, but Chrissy, undeterred, strips down and dives into the surf.As Chrissy swims further from the shoreline, she pauses to tread water. Ominous music plays as an unseen creature notices Chrissy's paddling legs from beneath the water's surface and begins to approach her. Chrissy is quickly attacked by the creature, who grabs hold of her leg and violently drags her underwater. Her screams for help go unheard, and eerie silence follows her submergence.The surrounding community of Amity is preparing for the upcoming Independence Day weekend, their most financially beneficial point of the year. The community depends on tourism as a major source of economic support and waits eagerly for each summer to arrive when herds of mainlanders come to savor Amity's shores. Martin Brody (Roy Scheider), Amity's Chief of Police, receives a call at home regarding Chrissie Watkins' disappearance. Following the report made by Tom Cassidy that she was last seen off the coast, Brody goes to the beach with his deputy Jeff Hendricks (Jeffrey Kramer) to search for clues. Hendricks soon stumbles upon the segmented remains of Chrissie, washed up on the shore and being feasted upon by crabs.Back at the police station, Brody receives a call from the coroner (Robert Nevin) , who determines that Chrissie Watkins was the victim of a shark attack. Fearing for the safety of Amity's many swimmers, Brody immediately prepares to close the beaches until further investigations can be made. His intentions are quickly noticed by Mayor Larry Vaughn (Murray Hamilton) who, fearing for the income loss that would result from closing the beach at such a pivotal point in the summer, attempts to convince Brody that a shark attack is too hasty a conclusion, and pressures Brody and the coroner to change the Chrissie's official cause of death to being cut up by a boat propeller. Brody remains dedicated to the safety of Amity's citizens and tourists, regardless of the financial toll the town might endure. However, Vaughn prevents him from closing the beaches just yet.Over the next few days, ferryloads of tourists arrive on Amity's shores. The beaches are crowded each day, and Brody is extremely anxious that there will be another attack. As Brody and his wife Ellen (Lorraine Gary) sit in the sand, Brody intently scans the shoreline for any sign of trouble. A ways down the beach, young Alex Kitner (Jeffrey Voorhees) asks his mother for permission to go swimming. Though Mrs. Kitner (Lee Fierro) notes that her son's fingers are starting to \"prune\" from the time he has already spent in the water that day, she allows him ten more minutes. Alex and his yellow raft enter the ocean one last time before Alex is attacked by what is unmistakably an enormous shark. The other swimmers panic and rush out of the water, while the bloodied and shredded remains of Alex Kitner's raft wash up in the surf. Mrs. Kitner calls out desperately for her son, unaware that he has just been killed.With dozens of witnesses to Alex Kitner's gruesome death, the presence of a shark in Amity waters is certain and Brody is finally permitted to close the beaches. Alex's grieving mother issues a $3000 reward to anyone who can catch the shark that killed her son, and a town meeting is held to discuss the official shark problem. While Brody explains that the police department is expanding their efforts to keep the beaches safe and bringing in a shark expert from the Oceanographic Institute to assist them, most of the assembled townspeople are simply angry about the beaches being closed, although Mayor Vaughn assures them it will only be for 24 hours. The chatter is quelled by Sam Quint (Robert Shaw), an eccentric and roughened local fisherman who guarantees the capture and slaughter of the offending shark for the price of $10,000. Though his offer is not accepted at that point, Quint seems confident that the job will fall to him eventually.With Mrs. Kitner's reward made public, scores of amateur shark hunters crowd Amity's docks. Two local men make a clumsy attempt to lure the shark with a pork roast, which results in one of them nearly being the shark's third victim. Arriving at the same time as the horde of overconfident fishermen is Matt Hooper (Richard Dreyfuss), the shark expert from the Oceanographic Institute hired by the Amity police. After meeting with Brody, Hooper is allowed to view the remains of Chrissie Watkins. Hooper, visibly shaken after examining the mangled body parts, assures Brody that a shark was responsible. More specifically, a Great White.The town breathes a sigh of relief when the corpse of a large tiger shark is hung on the docks, having been caught by some of the contending fishermen. Brody is initially elated, believing the nightmare to be over, until Hooper examines the mouth of the beast and determines that its bite radius did not match the wounds on Chrissie Watkins' body, and therefore was likely not the shark they were seeking. Hooper attempts to convince Mayor Vaughn to keep the beaches closed until an autopsy on the shark can be completed and the contents of its stomach can be analyzed for human remains, but Vaughn impatiently dismisses his pleas.The crowd falls silent as Mrs. Kitner arrives, clad in black and choking back tears, presumably returning from her son's funeral. She approaches Brody and slaps him across the face, furiously accusing him of keeping the beaches open despite having prior knowledge that there was a man-eating shark in the water. She makes clear her belief that Brody was largely responsible for Alex's death. Brody's determination to find the killer shark only increases.As Brody attempts to unwind at home, Hooper visits the house to share his thoughts on the shark situation. When Ellen Brody asks about his background, Hooper explains that he had been fascinated by sharks ever since he was a boy and remains just as enthusiastic about studying them. Hooper theorizes that Amity may have a \"rogue shark,\" in its waters, which will likely remain until its food source is entirely gone. Brody and Hooper decide to examine the stomach contents of the tiger shark, and proceed to the docks. Hooper slices open the shark and finds nothing to conform that it had eaten anything other than fish, tin cans, and a license plate within the last several days. Hooper once again confirms that the shark responsible for the killings would have a much larger bite radius than the tiger shark, and believes that the only shark species that would meet that criteria is the Great White.Continuing their investigation that night, Hooper takes Brody onto his boat to do some reconnaissance on the water. Brody, who faces an additional source of stress within the shark case due to his fear of the water, drinks heavily before setting foot on the vessel. Using sonar equipment, Hooper locates a large object a good distance away from the shoreline. Brody recognizes it as the boat of Ben Gardner (Craig Kingsbury), a local fisherman. Hooper decides to investigate the half-submerged craft, despite Brody's protests, and dons his scuba gear before entering the water. Hooper discovers a large hole in the hull of the boat, and finds an enormous tooth embedded in the side. While examining the tooth, Hooper is horrified to see the corpse of Ben Gardner floating out of the hull, one of his eyes missing. Hooper drops the tooth and rushes to the surface.Brody and Hooper make yet another attempt to reason with Mayor Vaughn, hoping their discoveries from the previous night will make a difference. Vaughn, however, still stubbornly ignores their words and states that even with the evidence of Ben Gardner's ravaged boat, there is no proof that a shark is responsible. Hooper explains that he pulled a shark tooth \"the size of a shotglass\" out of the hull of Gardner's boat, but Vaughn merely insults and dismisses him once again since Hooper cannot produce the tooth he dropped in the water.Independence Day weekend finally arrives along with plenty of tourists, but the beachgoers are made uneasy by the numerous police boats patrolling the water for the shark. Vaughn is concerned that no one is swimming, and asks a personal friend in attendance to enter the water, along with his wife and grandchildren, to put everyone's minds at ease. The man and his family reluctantly and warily obey, and others begin to relax and follow suit.Brody is aiding with shark patrol, while Ellen and their two young sons remain on the beach. When Brody's elder son Michael (Chris Rebello) wishes to take his boat out into the water with one of his friends, Brody asks him to take it into the adjacent estuary just to be safe. While complaining that \"the pond is for old ladies,\" Michael reluctantly agrees. In the meantime, a dorsal fin appears among the swimmers in the main water, and panic ensues. The crowd scrambles back onto the beach, only to learn that the \"shark\" was merely a cardboard fin and two boys in snorkel gear playing a prank.The beachgoers begin to relax, but a young woman overlooking the water sees the unmistakable form of a huge shark making its way into the estuary, where Michael and his friend are sailing. The woman's cry is first dismissed as another prank, but when Ellen reminds her husband that their son is in the pond, Brody goes to investigate. Michael and his friend are approached by a man in a rowboat (Ted Grossman), presumably the friend's father, who is instructing them on their knotting techniques, when both vessels are suddenly capsized by the shark. All three of the startled sailors surface, and Michael watches in paralyzed horror as the man fails to reach his rowboat before the shark attacks him and rips him apart.Michael and his friend are brought safely to shore, though Michael is taken to the hospital to be treated for shock. Brody confronts Vaughn once again and puts his foot down, demanding that real action must be taken to deal with the shark. Vaughn, for once, is vulnerable and shaken, realizing that his own children were on the beach that day as well. He finally relents and gives Brody full permission to do all that is necessary to stop the shark.Brody seeks out Quint and promptly hires him to catch the shark for $10,000. Though Quint desires to complete the mission alone, Brody insists that he and Hooper will go as well. There is instant tension between Quint and Hooper, with Quint seeing Hooper as a naive college boy with no real shark-hunting experience, and Hooper seeing Quint as a reckless thrill-seeker. Though Hooper proves himself a perfectly capable sailor, the tension remains as the three men embark on their voyage in Quint's boat, the \"Orca.\"Once out to sea, the men set about attracting the shark by ladling chum off the stern of the boat. Quint attaches a line of piano wire to a sturdy rod secured against a specially-designed fishing chair on the deck. After hours of waiting, the wire goes taut and Quint believes the shark has finally shown up. The shark swims under the boat until the piano wire snaps, proving the immense strength of the beast they are up against.As the voyage presses on with no further sign of the shark, Brody grumpily ladles more chum off the back of the boat, while Quint continues to show his disdain for Hooper. Without warning, the massive head of a Great White shark emerges from the water for a moment, and we get our first good look at the size of the fish. Brody is stunned and alerts Quint. Hooper notices the shark beginning to circle the boat, and Quint rushes out for a look. He estimates the shark is 25 feet long, and weighs three tons. After barking a few orders to Brody and Hooper, Quint begins to fire harpoons tied to plastic barrels, intended to both slow the shark down and act as visible tracking devices. Though Quint manages to hit the shark with three harpoons, the barrels have no effect and the shark easily pulls them underwater. Just in time, Hooper manages to attach a technological tracking device to the beast before it disappears again.That night, the men have dinner and drinks below deck and Hooper surprisingly begins to bond with Quint as they compare tattoos and scars. Brody notices that Quint has had a tattoo removed. The mood suddenly darkens as Quint admits that the former tattoo represented the US Navy cruiser \"Indianapolis.\" Quint, aboard that ship in World War II when it was sunk by torpedoes, had witnessed the deaths of roughly 800 men that day, many of whom were eaten by sharks as they struggled helplessly in the water. Quint's eerie retelling of the disaster confirms how his hatred for sharks began, and reveals his guilt at being one of the mere 300 sailors who survived the sinking of the Indianapolis. After the solemnity of Quint's story, the three men sing a rowdy sea shanty to lighten the mood, but are interrupted by the returning shark violently knocking into their boat, causing it to begin leaking. Quint rushes on deck and fires at the three telltale barrels, but the shark escapes once again.The next day, the men attempt to repair the boat, with limited success. Seawater has contaminated the fuel, and the thick clouds of smoke belching from the ship's exhaust pipe are a sign of engine damage. When the shark returns, Quint, waiting and ready, instructs Hooper to grab the barrels with a hook and secure them to the stern. Hooper succeeds, and Quint attempts to drag the shark by powering the boat to full throttle, but the shark uses its immense strength to pull the boat in the opposite direction, nearly capsizing it and causing further structural damage before Quint cuts the ropes attached to the boat. The shark breaks free from the barrels and submerges again. Quint demonstrates the extent of his mad vengeance against sharks by destroying the radio which Brody was attempting to use to call for help. The shark begins to chase the boat, and Quint steers back toward land at full speed, dismissing Hooper's protests that he is overtaxing the already damaged engine. When the engine inevitably fails, the three men are trapped on a sinking boat with no means of propulsion and no radio. Quint offers life jackets to the other men, though he takes none for himself.Running out of options, Hooper resorts to putting on his scuba gear and having Quint and Brody lower him into the water inside a shark cage, his aim being to inject the shark with poison using a harpoon syringe. The cage proves to be no match for the shark, who attacks Hooper with such ferocity that he drops the harpoon and is forced to hide in a reef while his cage is being destroyed. Brody and Quint haul up the remains of the shark cage, sans Hooper, and assume him to be dead. They barely have time to process the notion before the shark leaps from the water like a breaching whale and lands most of its body on the sinking stern of the boat. Quint and Brody hang on to the cabin for dear life as the boat is upended, the shark's gaping mouth at the bottom of the drop. Quint ultimately loses his grip and, despite Brody's endeavors to pull him to safety, slides into the mouth of the shark and is devoured. The shark, with Quint's corpse in its mouth, slides back into the water.Horrified, and believing himself to be the only survivor of this seemingly doomed mission, Brody hastily enters the cabin of the rapidly sinking boat and finds one of Hooper's pressurized air tanks. The shark smashes through the side of the boat, mere feet away from Brody, whose attempts to drive it off by beating it with the tank result in the tank becoming lodged in the shark's mouth before the beast swims away again.With little more than the boat's mast above water now, Brody climbs to the top of the mast with a rifle in his hand. Now possessing some of Quint's courage and madness, Brody begins to fire at the approaching shark, hoping to hit the air tank in its mouth. At last, Brody hits his mark. The tank explodes, taking the shark with it, and Brody laughs maniacally as blood and shark meat rain down around him into the sea.Moments later, Hooper finally surfaces, alive and well. The two men celebrate the end of their adventure with a weak chuckle before assembling a makeshift raft and paddling back to Amity's shore."}