{"mid": "Jcvd", "IMDB_id": "tt1130988", "title": "JCVD", "plot": "The film establishes Jean-Claude Van Damme playing himself as an out-of-luck actor. He is out of money; his agent cannot find him a decent production; and the judge in a custody battle is inclined to give custody of his daughter over to his ex-wife. His own daughter rejects him as a father, much to his chagrin. He returns to his childhood home of Schaarbeek in the Brussels capital region, Belgium, where he is still considered a national icon.\nAfter posing for pictures with clerks outside a video store, Van Damme goes into the post office across the street. A shot is fired inside the post office, and a police officer responds but is waved off by Van Damme at the window, which is then blocked. He calls for backup.\nThe narrative then shifts to Van Damme's point of view. He goes into the post office to receive a badly needed wire transfer but finds that the bank is being robbed. He is taken hostage along with the others. The police mistakenly identify Van Damme as the robber when he is forced to move a cabinet to block the window. Van Damme finds himself acting as a hero to protect the hostages by engaging with the robbers about his career, as well as both a negotiator and presumed perpetrator. While speaking by phone as the ringleader of the robbers, Van Damme even goes so far as to demand $465,000 for the law firm handling his custody case. It is not clear if Van Damme demands the $465, 000 out of self-interest or out of a desire to appear as a genuine bank-robber to the police as he insists to the thieves or perhaps both.\nThe narrative continues to shift to show Van Damme's troubles getting roles and money, and the media circus that develops around the post office and video store, which the police use as a base of operations.\nIn a notable scene, Van Damme and the camera are lifted above the set, and he performs a six-minute single-take monologue, where he breaks the fourth wall addressing the audience directly with an emotional (but characteristically cryptic) monologue about his career, his multiple marriages, and his drug abuse.\nVan Damme then persuades one of the bank robbers to release the hostages. After this happens, a scuffle ensues and in the resulting conflict, the head robber is shot. The police, after hearing a gunshot, storm the building. The police shoot another one of the thieves, and Van Damme is held at gunpoint by the final one. Van Damme briefly imagines a scenario in which he takes the robber out by elbowing him and kicking him in the face and everyone including the police and crowd cheering for him, but in reality, he just elbows him in the stomach, and the police take him into custody.\nVan Damme is arrested for extortion over the $465,000 and sentenced to 1 year in prison. The final scenes show him teaching karate to other inmates, then being visited by his mother and daughter."}