{"mid": "JeanDeFlorette", "IMDB_id": "tt0091288", "title": "Jean de Florette", "plot": "The story takes place outside a small village in Provence, France, shortly after the First World War. Ugolin Soubeyran (Auteuil) returns early in the morning from his military service and wakes up his uncle César (Montand), called in the local dialect 'Le Papet' meaning grandfather. Ugolin stays only briefly to talk, as he is eager to get to his own place farther up in the mountains. Here he throws himself into a project that—at first—he keeps secret from Papet. He eventually reveals that the project consists of growing carnations. Papet is at first skeptical, but he is convinced when the flowers get a good price at the local market. They decide the project is worthy of expansion, and together they go to see the neighboring farmer known as Pique-Bouffigue, to buy his land.\nThe land in question is apparently \"dry\", but Papet knows of a source of water, a spring, that can solve that problem. Pique-Bouffigue does not want to sell, and an altercation breaks out when he insults the Soubeyran family. In the fight, Pique-Bouffigue is knocked unconscious. He becomes friendly (as a result of memory loss from a head wound) but dies about a year after the fight. Papet sees this as an opportunity, so after the funeral, Papet and Ugolin dig out the rubble that is filling the spring, plug the hole, and cover it with cement and then earth. Unknown to them, they are seen blocking the spring by a poacher.\nThe property descends to the dead man's sister, Florette, a childhood friend of Papet, who married the blacksmith in another village whilst Papet was recovering in a military hospital in Algeria. He writes to a common friend for news on Florette and finds that she died the same day his letter arrived. The property thereby descends to her son who is a tax collector and \"unfortunately, by God's will...he's a hunchback\". To discourage Florette's son from taking up residence, Ugolin breaks many tiles on the roof of the house.\nFlorette's son (Depardieu), Jean, arrives with his wife Aimée and young daughter Manon, and the Soubeyrans' hopes of an easy takeover are soon shattered. Florette's son is called Jean Cadoret, but Ugolin, in the local custom, calls him Jean de Florette. Jean makes it clear that he has no intention of selling, but plans to take up residence and live off the land. He has a grand scheme for making the farm profitable within two years, involving breeding rabbits and feeding them off cucurbit. Jean does not know about the blocked spring, only of a more distant one, and is relying on rainfall to fill a cistern with water for supplying livestock and irrigating crops. The distant spring, where an old Italian couple lives, is 2 kilometres (1.2 mi) away and also part of the property. Jean believes the needs of the farm can be met from here. Ugolin is discouraged, but Papet tells him to befriend Jean and gain his confidence. They also keep secret from him the fact that—while average rainfall for the surrounding region is sustainable—the area where Florette's farm lies rarely gets any of this rain. Meanwhile the two work to turn the local community against the newcomer, who is described merely as a hunchbacked former tax collector, since the deceased Pique-Bouffigue had cousins in the village who know about the blocked spring and would tell Jean about it should they come to trust him.\nJean initially makes progress, and earns a small profit from his rabbit farm. In the long run, getting water proves a problem, and dragging it all the way from the distant spring becomes a backbreaking experience. Jean asks to borrow Ugolin's mule, but is met only with vague excuses. Then, when the rain does come, it falls on the surrounding area but not where it is needed. Jean loudly berates God, whom he thinks has already given him enough trouble by deforming him. Later, the dusty winds of the sirocco also arrive, bringing the farm to near-catastrophe. Jean is undeterred, and decides to dig a well. At this point Ugolin sees it fitting to try and convince Jean that his project is hopeless, and that he might be better off selling. Jean asks how much he could expect to receive for the farm, and Ugolin gives an estimate of around 8,000 francs. Jean has no intention of leaving though, but wants to use the value of the property to take up a mortgage of half that sum. Ugolin is not happy, but Papet again sees opportunity: he will himself grant the mortgage; that way he will either earn the interest, or drive Jean away for good. From the money Jean buys dynamite to finish the well, but in his first blast is hit by a flying rock and falls into the cavity. At first the injuries seem minor, but it turns out his spine is fractured and when the doctor arrives he declares Jean dead. Ugolin returns with the news to Papet, who asks him why he's crying. \"It is not me who's crying,\" he responds, \"it's my eyes\".\nAimée and Manon cannot remain on the farm, and Papet offers to buy them out. As mother and daughter are packing their belongings, Papet and Ugolin make their way to where they blocked the spring, to pull out the plug. Manon follows them, and when she sees what the two are doing, understands and gives out a shriek. The men hear it, but quickly dismiss the sound as that of a buzzard making a kill. As Papet performs a mock baptism of his nephew in the cold water of the spring, the film ends with the caption \"end of part one\"."}