{"mid": "JeremiahJohnson", "IMDB_id": "tt0068762", "title": "Jeremiah Johnson", "plot": "The opening scene depicts an early Rocky Mountain riverside trading post bustling with activity. Indians, trappers and traders of all stripes freely mingle. A young ex-soldier named Jeremiah Johnson (Robert Redford), fleeing civilization, equips himself with the needed foodstuffs, gear and pack mule required for life as a solitary mountain man.After a short time in the high mountains, Johnson finds himself critically short on both food and basic survival skills. While comically struggling to retrieve an elusive trout from a swift mountain stream, Johnson is startled to discover a bemused Indian brave silently watching him. The brave quietly rides downstream. After failing in his attempt to kindle a warming fire in the deep snow, Johnson comes upon a dead mountain man, frozen against a tree. A note attached to the dead man's coat identifies him as Hatchet Jack and explains that he was mauled and disabled by a grizzly bear. He bequeaths his prized .50-caliber rifle to whoever finds him. Johnson uses the gun to bag his first deer.Johnson awakens the next morning to find that his horse has died in the night. He continues through the deep snows on foot, leading his pack mule. He is soon surprised by a venerable old mountain man whose bear hunt he has inadvertently spoiled. The old mountain man, Bear Claw (Will Geer), patiently teaches Johnson the ways of the mountains. While hunting elk, Johnson and Bear Claw are surrounded by a Crow Indian party, but Johnson successfully barters their way out of trouble. The leader of the Crows is the same brave who observed Johnson's abortive fishing attempt earlier.After parting with Bear Claw, Johnson comes across a cabin where an Indian band has killed several white settlers. One child survives, along with his grieving, traumatized mother who has clearly gone mad. She frantically places her equally traumatized son in Johnson's charge, apparently intent on killing herself. Since the boy is unable to speak his own name, Johnson names the boy Caleb. As their journey continues, the pair comes across another mountain man, Del Gue (Stefan Gierash), buried up to his neck in burning sand by the same Blackfoot raiding party that attacked the settler cabin. Johnson rescues him and they track down the raiding party, intent on recovering Gue's horses and weapons. Against Johnson's wishes, Gue ambushes the Blackfoot party that night, and the Indians are killed with Johnson's reluctant assistance. Del Gue scalps the dead Blackfeet.This works to Johnson's advantage when they are subsequently surrounded by Flathead Indians, who are the Crows' blood enemies. Seeing the captured Blackfoot ponies and fresh scalps and believing Johnson to be a great warrior, the Flathead chief honors Johnson by giving his daughter to him as a bride. Del Gue goes his own way, and Johnson leads his newfound family deeper into the wilderness.Despite a mute \"stepson\" and a wife he cannot communicate with, Johnson finds fulfillment in his new life. They build a fine cabin alongside a mountain stream before Johnson leaves to hunt for buffalo. A few days after his return, a cavalry detail arrives at the cabin looking for a mountain guide. A small wagon party has become stranded in the high country and is in danger of starving in the freezing cold. Johnson is goaded into leading the rescue attempt.Once in the high mountains, the party encounters a sacred Crow burial ground blocking a mountain pass. Johnson explains they will have to go around, adding considerable distance to the journey. The cavalry officers are skeptical, explaining that the detour could result in many dead settlers. Against his better judgement, Johnson tells the troopers to stay quiet and follow along in single file through the burial ground. It is of no use; the Indians soon know of the desecration. After locating the wagon train, Johnson parts with the white men and traverses the burial ground again, suddenly becoming spooked. He rushes back to his cabin to find his wife and stepson dead, murdered by the Crows. Johnson is wracked with guilt and grief. After some time, he tenderly places the boy and his wife in the bed, covers them, and sets fire to the cabin.Johnson tracks down the murderous group of six or seven Crow warriors and attacks their campsite, without concern for his own life. He wipes out the entire group, becoming wounded in the process. His reprisal invites a seemingly endless series of solitary attacks upon Johnson as he travels the mountains. One by one, the Crow warriors ambush him, only to die in the process. Johnson himself is wounded many times. He becomes a living legend among the Indians and the white settlers alike. During this period, Johnson crosses paths once again with both Bear Claw and Del Gue, who are aware of his predicament. They wish him well and take their leave.After months of attacks, a weary Johnson sees one more Crow warrior approaching in the distance. He warily cocks his rifle and readies for a fight. Suddenly, the Indian raises his hand in tribute and in peace. It is over. Johnson breaks into a wide grin- it is the same Crow who watched him struggle to catch a trout long ago."}