{"mid": "JerryMaguire", "IMDB_id": "tt0116695", "title": "Jerry Maguire", "plot": "Jerry Maguire (Tom Cruise) is a glossy 35-year-old sports agent working for Sports Management International (SMI). After having a life-altering epiphany about his role as a sports agent, he writes a mission statement about perceived dishonesty in the sports management business and his desire to work with fewer clients so as to produce better quality. In turn, SMI management decides to send Bob Sugar (Jay Mohr), Jerry's protégé, to fire him. Jerry and Sugar call all of Jerry's clients to try convincing them not to hire the services of the other. Jerry speaks to Arizona Cardinals wide receiver Rod Tidwell (Cuba Gooding Jr.), one of his clients who is disgruntled with his contract. Rod tests Jerry's resolve through a very long telephone conversation while Sugar is able to convince the rest of Jerry's clients to stick with SMI instead. Leaving the office, Jerry announces that he will start his own agency and asks if anyone is willing to join him, to which only 26-year-old single mother Dorothy Boyd (Renée Zellweger) agrees. Meanwhile, Frank \"Cush\" Cushman (Jerry O'Connell), a superstar quarterback prospect who expects to be the number one pick in the NFL Draft, initially also stays with Jerry after he makes a visit to the Cushman home. However, Sugar is able to convince Cushman and his father to sign with SMI over Jerry the night before the draft. Cushman's father implies they decided to sign with Sugar over Jerry when they saw Jerry attending to Tidwell; an African-American player, versus his son (a white player).\nAfter an argument, Jerry breaks up with his disgruntled fiancée Avery (Kelly Preston). He then turns to Dorothy, becoming closer to her young son, Ray (Jonathan Lipnicki), and eventually starts a relationship with her. Dorothy contemplates moving to San Diego as she has a secure job offer there, however she and Jerry agree to get married. Jerry concentrates all his efforts on Rod, now his only client, who turns out to be very difficult to satisfy. Over the next several months, the two direct harsh criticism towards each other with Rod claiming that Jerry is not trying hard enough to get him a contract while Jerry claims that Rod is not proving himself worthy of the money for which he asks. Meanwhile, Jerry's marriage with Dorothy gradually deteriorates and they eventually separate.\nDuring a Monday Night Football game between the Cardinals and the Dallas Cowboys, Rod plays well but appears to receive a serious injury when catching a touchdown. He recovers, however, and dances for the wildly cheering crowd. Afterwards, Jerry and Rod embrace in front of other athletes and sports agents and show how their relationship has progressed from a strictly business one to a close personal one, which was one of the points Jerry made in his mission statement. Jerry then flies back home to meet Dorothy. He then speaks for several minutes, telling her that he loves her and wants her in his life, which she accepts. Rod later appears on Roy Firestone's sports show. Unbeknownst to him, Jerry has secured him an $11.2 million contract with the Cardinals allowing him to finish his pro football career in Arizona. The visibly emotional Rod proceeds to thank everyone and extends warm gratitude to Jerry. Jerry speaks with several other pro athletes, some of whom have read his earlier mission statement and respect his work with Rod.\nThe movie ends with Ray throwing a baseball up in the air surprising Jerry. Jerry then discusses Ray's possible future career in the sports industry with Dorothy."}