{"mid": "JetsonsTheMovie", "IMDB_id": "tt0099878", "title": "Jetsons: The Movie", "plot": "The company \"Spacely Sprockets and Spindles\" is in dire trouble. Their latest project, dubbed the 'Orbiting Ore Asteroid,' has had numerous technical setbacks, doing only 3 days of work in over 6 months. To make matters worse, the vice-president in charge of operations, Alexander Throttle-bottom, has run off, making this the fourth vice-president that the operation has lost. Matters are further compounded when the site's assistant refuses to press the start button to activate the factory, or accept Spacely's offer for a promotion or raise.Using his secretarial computer, Spacely pegs George Jetson to be the new vice-president, sending George home to pack and tell his family. However, the news is met with with sadness, as the move will interfere with Jane's recycling program, Elroy's spaceball tournament, and Judy's date with rock star Cosmic Cosmo.Even so, the family manages to come together (with the exception of Judy who is sad about her missed date), and the family arrives at the 'Orbiting Ore Asteroid,' which not only houses the factory, but a shopping center and housing complex. The Jetsons meet their new neighbors, including Lucy-2, whose husband Rudy-2 works at the factory, and son Teddy-2 plays on the local spaceball team. They also meet the Furbolo family, including their mischievous daughter, Fergie.The next day, George arrives at work and meets Rudy-2. Rudy verses George on the factory equipment, and they prepare for the official start-up of the factory. Meanwhile, Jane and Judy go shopping with Lucy-2. Still feeling depressed, Judy goes off on her own, and meets a boy named Apollo Blue, whom she quickly develops a crush on.Later on that day, everyone turns out for the re-opening of the plant, with George activating the controls. However, the machine malfunctions again, irritating Spacely. Shortly thereafter, Rudy-2 reveals to George about previous technical issues with the plant, and cautions that it may be safer if George were to go home. George refuses, not wanting to give up on being vice-president. The next day, repairs appear to be made but the factory again malfunctions. Spacely blames George for the technical glitches, and leaves Earth to check on the factory.After inspecting the factory again, Rudy-2 reveals that the incidents do not appear to be accidents, but 'warnings' to shut down the plant. Rudy then explains about the factory's troubles, and of the 4 previous vice-presidents. George decides to stay overnight at the plant, and figure out just what is happening.Elroy and Teddy-2 sneak off to follow him. However, when their disappearance is found out, Jane asks Judy and Apollo Blue to try and find them. Judy and Apollo find both Elroy and Teddy-2 at the plant, along with Fergie, who tagged along. They also find a strange little creature, whose species Fergie identifies as a Grungee. The Grungee leads them into the core of the asteroid, where it is revealed why the factory keeps being sabotaged: The factory's enormous drill is destroying the Grungee's habitat in the base of the asteroid. The Grungees have been making the plant malfunction to keep their homes from being destroyed.Jane and Astro soon make their way into the factory, along with Rudy-2. Rudy stays in the factory, as Jane and Astro go below. Soon afterwards, they all find George, who had been bound and gagged by the Grungees. George has no idea why this has happened to him, untill Jane and the others explain.Shortly after this revelation, Mr Spacely arrives, and against Rudy-2's protestations, reactivates the drill, almost killing Elroy when it's actions cause a large amount of rock to collapse. The other Grungees manage to help him, and they all head top-side. After Mr Spacely refuses to stop the drill, George manage to make the system malfunction. When Spacely demands an explanation, George explains about the Grungees, and Spacely is soon found to have ignored reports that the asteroid was inhabited.A deal is made by which the Grungees operate the plant, but instead of drilling for ore, they recycle older sprockets to make new ones. Spacely then decides to give George his old job back on Earth. The family says goodbye to their new friends, and head for home."}