{"mid": "JingleAllTheWay", "IMDB_id": "tt0116705", "title": "Jingle All the Way", "plot": "Howard Langston is a workaholic mattress salesman with no time for his wife, Liz, and his 9-year-old son, Jamie — especially when compared to next door \"superdad\" divorcee, Ted Maltin, who continually puts Howard in a bad light. After missing Jamie's karate class graduation, Howard resolves to redeem himself by fulfilling Jamie's ultimate Christmas wish: getting an action figure of Turbo-Man, a wildly popular children's TV superhero toy. Along the way, Howard meets Myron Larabee, a postal worker dad with a rival ambition, and the two soon become bitter competitors in their race for the action figure. During his search, Howard repeatedly runs into Officer Alexander Hummell, a police officer who had earlier pulled him over for a traffic violation. After several failed attempts to find the toy in a store, Howard attempts to buy a Turbo-Man from a Mall of America Santa, who is actually the leader of a band of counterfeit toy makers. When he accuses the Santa of undermining the values of Christmas (having been sold a defective toy that falls apart the moment he opened the package), Howard ends up in a brawl with the gang. He narrowly escapes when the police raid their warehouse and gets out by posing as an undercover detective using a toy badge.\nLater, Howard arrives at Mickey's Diner and uses their phone to call home. As he tried to get a hold of Liz, he unintentionally scolds Jamie on the phone over Turbo-Man. Jamie, in turn, rebukes his father about how he never keeps his promises, and hangs up. Liz overhears the argument and becomes disappointed in her husband. Howard then encounters Myron at the diner. As they sat down and talk, Myron tells Howard about the time when his father was unable to get him a Johnny Seven OMA toy on Christmas. They hear on the KQRS radio station that the D.J. is running a Turbo-Man competition. When they get to the studio, they find out they can only win a gift certificate. They are nearly arrested, but Myron bluffs the police into backing off by threatening them with a package (which he claims is a mail bomb, unaware that it really is one). Officer Hummell tries to open it and it blows up in his face. After his car is stripped by thieves, Howard is ultimately forced to return home empty-handed. Upon seeing Ted in his house placing the star on his tree, Howard gets angry and attempts to steal the Turbo-Man doll from Ted's house that he had bought for his son Johnny (E.J. De La Pena), but changes his mind at the last moment as he could not see himself stealing from a child. He is attacked by Ted's pet reindeer and the commotion leads him to be caught by Ted and a distraught Liz. Liz and Jamie leave for the local Wintertainment Parade with Ted; Howard follows, aiming to make amends. At the parade, Ted makes a pass at Liz, but after seeing what he really is, she turns him down by hitting him with a thermos of eggnog.\nHoward runs into a bandaged Officer Hummell and accidentally drenches him with hot coffee. In the ensuing chase, Howard runs into a preparations room for the parade and is mistaken for a replacement for the actor who will play Turbo-Man on a parade float. As the \"real\" Turbo-Man, he presents the coveted limited-edition Turbo-Man doll to his awed son. Before he recognizes his father, Jamie is chased by Myron, who has dressed as Turbo-Man's arch enemy Dementor (having caught, tied up and gagged the real actor). As the crowd assumes this is all part of the show, Howard attempts to rescue his son by utilizing the Turbo-Man suit's equipment.\nHoward catches Jamie as he falls from a roof and reveals himself to his son. Officer Hummell gives the doll to Jamie, then is shocked to discover that Howard was Turbo-Man; Howard then apologizes to Officer Hummell about everything. Myron is arrested while ranting about having to explain his failure to get the Turbo-Man toy for his son. Touched by Myron's words, Jamie gives the doll to him and tells Howard that he does not need it since his father is \"the real Turbo-Man\". Howard is crowd-surfed away as Liz, Jamie and Myron happily look on.\nIn a post-credits scene, Howard puts the star on the top of his tree and shares a great Christmas spirit with Jamie and Liz until he realizes he also forgot to get a present for Liz. Howard stares in shock at the camera before the fadeout."}