{"mid": "JohnWickChapter2", "IMDB_id": "tt4425200", "title": "John Wick: Chapter 2", "plot": "In the opening scene, John Wick (Keanu Reeves) heads to a warehouse owned by Abram Tarasov (Peter Stormare) to get his car back. Abram wants payback against John for killing his brother Viggo and nephew Iosef. John is killing all of Abram's guards before he finally gets to his car. As he drives away, a whole mess of Abram's goons start attacking John. His car gets banged up, and the henchmen slam into John with their cars, but the man is persistent and easily kills all the goons before making his way to Abram's office. John simply pours Abram and himself a drink. He chooses to spare Abram in a peace offering. Abram questions John as to whether or not he can actually find peace.John returns home to the still unnamed dog he took at the end of the first movie. He calls Aurelio (John Leguizamo) to come pick up the car, which is a total wreck. Still, Aurelio claims he can fix it. After he leaves, John reburies his weapons beneath cement, as he feels he is done with the assassin life. He watches a video on his phone of himself and his late wife Helen (Bridget Moynahan)Later that night, John is visited by another assassin named Santino D'Antonio (Riccardo Scamarcio). He presents John with a marker that John gave him, which is essentially a blood oath used to get out of the assassin life when he decided to be with Helen. Santino wants John to kill his sister Gianna (Claudia Gerini), who is set to ascend to the High Table, a group of powerful assassins. John refuses, despite knowing full well what will happen if he does so. Santino leaves John's house and then grabs an RPG launcher to destroy John's house. Thankfully, the dog survives this time.John goes to the Continental hotel to meet with Winston (Ian McShane) to discuss the marker and what Santino has requested of him. Winston cannot do anything about it since John took the oath, and if he continues to refuse it, his life will be up for grabs. John then heads off and leaves the dog in the care of the hotel's concierge, Charon (Lance Reddick).John heads off to Rome to complete the task. He stays at the Continental there, owned by Julius (Franco Nero). John then meets with several people to get the weapons he needs to kill Gianna.John attends a party that is basically Gianna's \"coronation\". She is accompanied by her loyal bodyguard Cassian (Common). John confronts Gianna alone. He tells her that Santino sent him. She chooses to die on her own terms and slits her wrists. Gianna lays in a pool as she dies. John holds her hand and puts a bullet in her head to make it look like he killed her.Cassian spots John as he is leaving. Knowing John is working again, Cassian tries drawing his gun on John, but John is faster. He gets away and starts killing the other hitmen that go after him when they find out Gianna is dead. John shoots them all dead as he gets away. Cassian catches up to him and fights him up until they crash through a window of the Continental. Since no blood may be spilled on Continental grounds, John and Cassian sit at the bar to calm their nerves with drinks. John explains the marker and that Santino sent him to kill his sister. Cassian understands but also cannot allow his ward's killer to go unpunished. He pays for John's drink and leaves. John then spots Ares (Ruby Rose), Santino's mute bodyguard. She lets him know through sign language that she'll be seeing him.As John is heading back to New York City, Santino puts out a $7 million contract to kill John. The contract goes out to all the hidden assassins in the area. A female violinist in the subway pulls out a gun from the violin and tries to kill John, but he subdues her and breaks her neck. A heavyset Asian man goes after John and gets his brains blown out. Two men in the subway try to get in on it, and John brutally kills them with a PENCIL. Cassian finds John as he gets on the subway and fights him in the train. John stabs Cassian and pushes the knife into his aorta. He tells Cassian that if he pulls the knife out, he will bleed to death. John leaves Cassian on the subway. John runs into an assassin posing as a homeless man and asks for help as two assassin janitors go after John. The homeless assassin kills the janitors.John goes to seek sanctuary from the Bowery King (Laurence Fishburne), an assassin that once had a run-in with John and was left with a scar on his neck. John spared him, and so now the BK sees himself as unbreakable. He also knows of the bounty on John's head. With BK's help, John is able to locate Santino's whereabouts.John heads to a museum where Santino is set to take his place at the High Table. John crashes the shindig and starts going after all of Santino's men. John chases Santino through a hall of mirrors before having to fight Ares. John manages to stab Ares and leave her to die.Santino rushes to the Continental to seek refuge, knowing that he can't be touched there. John finds him in the lounge. Winston knows what John is about to do and tries to calm him down. Still, John blows Santino's brains out. He then goes to pick up his dog from Charon.The next day, John goes with his dog to meet with Winston at the park. Winston informs John that because he killed on Continental grounds, the High Table has doubled the contract and sent it to every assassin across the globe. Winston must mark John as excommunicado, but he gives him one hour before the contract takes effect. It then becomes evident that every single person in the park is an assassin, and they have their eyes on John. John tells Winston to let everyone know that if they go after him, he will kill them all. Winston agrees. John leaves as Winston puts the word out. Every passing person looks at John, knowing who he is and what they want from him. John is forced to take the dog and keep on running."}