{"mid": "JohnnyGuitar", "IMDB_id": "tt0047136", "title": "Johnny Guitar", "plot": "On the outskirts of a wind-swept Arizona cattle town, an aggressive and strong-willed saloonkeeper named Vienna maintains a volatile relationship with the local cattlemen and townsfolk. Not only does she support the railroad being laid nearby (the cattlemen oppose it), but she permits \"The Dancin' Kid\" (her former amour) and his confederates to frequent her saloon. The locals, led by McIvers but egged on by Emma Small, a onetime rival of Vienna, are determined to force Vienna out of town, and the hold-up of the stage (they suspect, erroneously, by \"The Dancin' Kid\") offers a perfect pretext. Vienna faces them down, helped by the mysterious and just arrived Johnny Guitar. McIvers gives Vienna, Johnny Guitar and \"The Dancin Kid\" and his sidekicks 24 hours to leave. Johnny turns out to be Vienna's ex-lover and a reformed gunslinger whose real name is Johnny Logan. A smouldering love/hate relationship develops.\nThe Dancin' Kid and his gang rob the town bank to fund their escape to California, but the pass is blocked by a railroad crew dynamiting a way in, and they flee back to their secret hideout behind a waterfall. Emma Small convinces the townsfolk that Vienna is as guilty as the rest and the posse ride to her saloon. Vienna appears to be getting the best of another verbal confrontation when one of the wounded bank robbers, Turkey, is discovered under a table. Emma persuades the men to hang Vienna and Turkey, and burns the saloon down. At the last second Vienna is saved by Johnny Guitar.\nVienna and Johnny escape the posse and find refuge in The Dancin' Kid's secret hideaway. The posse tracks them down, and the last two of Kid's men are killed by infighting. A halt is called to the bloodbath by the posse's leader, McIvers. Emma challenges Vienna to a showdown; The Dancin' Kid calls to Emma but is killed by a bullet to the head by an angered Emma. Emma then shoots Vienna, but only in the shoulder, where Vienna shoots Emma in the head. The posse allows Johnny and Vienna to leave the hideout in peace, and watches them go."}