{"mid": "JonahAVeggietalesMovie", "IMDB_id": "tt0298388", "title": "Jonah: A VeggieTales Movie", "plot": "Bob the Tomato and Dad Asparagus are driving Junior Asparagus, Laura Carrot, and other Veggie children to see the popular singer \"Twippo\" in concert. During the drive, Laura taunts the other children because she won a backstage pass; much to the annoyance of Junior. Circumstances unfold and soon Bob loses control of the vehicle, causing Laura to lose her pass, and the van careens down a hill, stopping short of a river.\nIn a nearby restaurant, Bob blames Dad Asparagus for the crash and Junior tells a grieving Laura that losing her pass was her own fault. Once seated by the maître d's, Jean-Claude and Phillipe Pea, Junior is met by Larry the Cucumber, Pa Grape, and Mr. Lunt, who collectively comprise The Pirates Who Don't Do Anything, who tell Junior that he was being rather tough on his friend and encourage him to show some compassion. To illustrate their point, they tell all the Veggies a story about a man of God named Jonah.\nJonah (Archibald Asparagus) is a Prophet of ancient Israel who goes from town to town delivering God's messages. One night, God asks him to deliver a message to Nineveh, the harsh and dangerous capitol city of Assyria. However, Jonah is unwilling to preach a word of repentance to the Ninevites and instead tries to flee from the Lord by having The Pirates sail him to Tarshish. After leaving port, a guilt-stricken Jonah goes below deck to rest where he meets Khalil, a traveling Persian rug salesman and a stowaway.\nAfter experiencing a nightmare, Jonah awakens to find the ship beset by a great storm. Captain Pa Grape concludes that the storm has been sent because God is angry at someone on the ship. The group decides to play Go Fish to divine who is at fault. Jonah loses the game and is forced to walk the plank. As soon as Jonah is off the ship, the skies clear and the Pirates attempt to reel him back in, but a giant fish swallows Jonah. Attacking the fish, the Pirates fire a cannon with a bowling ball (with Khalil inside it) as ammo. The whale swallows the ball, disgorges Jonah's lifebelt, and swims away.\nInside the belly of the whale, Khalil finds a grieving Jonah and the pair are soon visited by a host of God's angels, who explain through song that if Jonah repents, God will grant him a second chance. Upon repenting, Jonah and Khalil are spit up onto the shore where they ride Jonah's camel, Reginald, to Nineveh.\nAfter Jonah is denied entrance to the city, the Pirates appear, explaining that they won the Mr. Twisty's Twisted Cheese Curls sweepstakes which grants them free access to Ninevah where they are produced. Sneaking Jonah and Khalil into the city, the group is soon arrested after Larry tries to steal the King's Cheese Curls and are sentenced to death. As a last request, they are granted an audience with King Twistomer (Apollo Gourd). Jonah then delivers the message given to him by God that the Ninevites should repent of their ways forever or Nineveh will be destroyed. King Twistomer and the Ninevites quickly agree.\nStill expecting God to destroy Ninevah for their past sins, Jonah watches from a distance in the hot sun. Feeling compassion for Jonah, God provides a plant to shade Jonah, only for Khalil to eat a single leaf off the plant, which kills it. Jonah laments the dead plant, but Khalil is disappointed in Jonah who shows compassion for a plant, but not for the Ninevites. He then tries to explain that God is compassionate and merciful and that he wants to give everyone a second chance. But Jonah refuses to accept that and states it would be better if he died. The story ends with Khalil and Reginald leaving Jonah to his sulking.\nBack in the present day, the Veggies are disappointed in the anti-climactic ending, but come to understand the point of the story: God wants everybody to show compassion and mercy, even to those that do not seem to deserve it. Twippo then appears in the restaurant unexpectedly and offers to give everybody a lift to the concert, while Bob forgives Dad Asparagus and Junior gives his Twippo ticket to Laura. The film ends in song and the arrival of the tow truck driver, who is none other than Khalil."}