{"mid": "JourneyIntoFear", "IMDB_id": "tt0034922", "title": "Journey Into Fear", "plot": "In an opening scene before the credits an assassin, Banat, is seen preparing a gun while a gramophone skips as it plays. The story that follows is the narrative of a letter from Howard Graham, an American armaments engineer, to his wife Stephanie. While journeying to the Soviet port of Batumi to return to the United States to complete his business with the Turkish Navy, Graham and his wife stop in Istanbul and are met by Kopeikin, a Turkish employee of Graham's company, who under the pretense of discussing business, takes Graham to a nightclub to introduce him to dancer Josette Maretl and her partner Gogo. Banat tries unsuccessfully to kill Graham during a magic act, shooting the magician instead. Graham is brought to the headquarters of the Turkish secret police for questioning, where Colonel Haki blames the assassination attempt on German agents seeking to delay the re-arming of Turkish ships. The colonel shows Graham a photograph of Banat, whom he says was hired by a Nazi agent named Muller. Haki then orders Graham to travel secretly to Batumi aboard a tramp steamer, while Haki personally oversees the safe overland transit of Stephanie.\nGraham's fellow passengers include Josette and Gogo; Kuvetli, an ingratiating Turkish tobacco salesman; Professor Haller, an apolitical German archeologist; and the henpecked Matthews and his French wife. Josette sees that Graham is frightened, and not knowing that he is married, tries to become close to him. At an interim port call, Graham is made aware of the arrival of a new passenger by the annoying clamor of a gramophone, while Haller warns him that Kuvetli is not who he claims to be. At dinner Graham recognizes Banat and tries to persuade the ship's captain and purser to put him ashore, but they believe that he is crazy. Graham turns to Josette for help and she has Gogo engage Banat in a poker game while Graham unsuccessfully searches Banat's cabin for the assassin's gun.\nWhen Graham returns to his own cabin, he is met by an armed Haller and deduces that he is actually Muller. Muller offers to spare Graham's life by delaying his return to the States for six weeks by having him taken to a hospital with a case of \"typhus.\" Muller warns him that Kuvetli is a Turkish agent sent by Haki and warns Graham he will be killed if he confides the plan to the Turk. Kuvetli was eavesdropping from the next cabin, however, and informs Graham that Muller's \"plan\" is just a scheme to get Graham away from the ship before murdering him. Kuvetli instructs Graham to pretend to agree to the plan but before the ship docks in Batumi to hide himself in an empty cabin while the Turkish agent arranges for the arrest of the German agents. When Graham goes to the empty cabin, he finds Kuvetli dead on the floor, murdered by Banat. Graham asks Mathews to deliver a message to the Turkish consul in Batumi to notify Haki. Matthews gives the unarmed Graham a pocket knife. Graham runs into Gogo, who bluntly offers to \"give up\" Josette for Graham to marry for a cash consideration.\nMuller and Banat coerce Graham into a waiting car. When the car has a flat tire, Graham jams Matthews' pocket knife into the horn, and in the ensuing commotion, jumps into the driver's seat, crashes the car into a shop window and escapes. That night, as a storm rages, Graham joins his wife at their hotel, but Muller arrives there first, impersonating a coworker from Graham's company. Banat intimidates Graham from leaving and Muller persuades Stephanie to join Haki downstairs while he \"talks business\" with Graham. He leaves Graham to be killed by Banat, but Gogo enters the room to promote his deal for Josette and Banat shoots at him. Graham flees out of the room's window onto the cornice of the building in the torrential rain, pursued by Banat and Muller. Trapped between them, he is saved when Haki appears and shoots Muller. Banat wounds Haki but blinded by the rain, misses Graham. The two struggle and Banat falls to his death. Back in the present, Haki tells Graham as he finishes the letter that Stephanie is waiting for him but wonders why the engineer took decisive action when he had been so indecisive before. Graham tears up the now completed letter and tells Haki that he simply got mad and wasn't going to take any more."}