{"mid": "JoyRide3RoadKill", "IMDB_id": "tt3138376", "title": "Joy Ride 3: Road Kill", "plot": "Rob and Candy are holed up in a motel room, using methamphetine and having sex. When they run out of drugs, Rob convinces Candy to use the CB to lure a trucker to their room, so they can rob him. Rusty Nail responds to Candy's summons. When Rob answers the door, Rusty realizes he's been tricked and takes the pair captive. Rob and Candy are chained to each other and the axle of Rusty Nail's truck. He takes them to a deserted stretch of Highway 17 and tells them he will let them go if they can hang onto the hood of the truck for a mile. If one of them falls, the other will be pulled off the truck by the chain, and both will die under the truck. He tapes a bag of meth to the windshield of his truck, telling them they can have the drugs after they make it. After riding awhile, Rob calls out that they have ridden for at least a mile, and Rusty Nail agrees. Thinking they have made it, Candy reaches for the bag of drugs; her chain is pulled into the axle, and she and Rob are both pulled underneath the still-moving truck and killed. Later, the authorities are called to the scene; Officer Williams, a newly appointed deputy, wants to investigate further, but is encouraged by Officer Jenkins to make it an open-and-shut case.\nRacecar drivers Jordon and Austin, along with their team -- Jewel (manager and Jordon's girlfriend), Mickey (mechanic and pit crew chief), Alisa (PR), and Bobby (groupie) -- are caravanning from Kansas to Canada so that they can compete in the Road Rally 1000; they have an SUV with a flatbed trailer for the racecar, and walkie-talkies to communicate from car to car. When they stop at Headingley Grill for lunch, Austin finds Highway 17 on a map; he discovers that it would shorten their journey by a day and give them more time to get the lay of the land. When they ask a creepy truck driver, Barry, for directions, he warns them against taking 17; he tells them it's called \"Slaughter Alley\" (which the cops at the scene of Rob and Candy's deaths also claimed), and tells them the story of Rusty Nail, who has become something of an urban legend. Jenkins stops in for a cup of coffee and denies Barry's claims, encouraging them to take 17. Barry tells them that stretch of highway is unpatrolled, which appeals to Austin, who wants to be able to test the limits of their car on open road, so they agree to go that way.\nAustin drives the racecar and Jordon, Jewel, and Alisa ride along. They tease Austin about a wreck he had previously gotten in. This is clearly a sore subject for Austin, who vents his frustration by messing with a truck driver (who just happens to be Rusty Nail) and then speeding off. Jordon makes Austin pull over and takes the driver's seat; just as they catch up to Mickey and Bobby in the SUV, Rusty Nail catches up to the group and starts laying on his horn. When Jordon tries to let him pass, he boxes them in, switching lanes so neither car can get around him. Jordon gets around, but as Mickey tries to pass, Rusty rams the flatbed trailer, causing it to detach from the SUV and run off the road. He then tailgates Jordon, who dodges to get out of the way of an oncoming station wagon; when Rusty tries to do the same, he jackknifes. Jewel and Alisa try to convince Jordon to stop, but he refuses, worried a mark on his record will cost them the race. Rusty checks a camera he has mounted to the front of the truck, identifying Jordon's license number, and then uses the CB to hail them; he has found their website and now knows exactly who they all are, threatening to make them pay for what they did. Jordon disregards his threats, and the team continues on.\nNight falls, and the group stops at a gas station. Everyone is at odds over how to proceed. After Jewel fights with Jordon, she and Austin leave in the SUV to go to the police, as the others continue on in the racecar. Rusty Nail catches up to Jewel and Austin and tries to run them off the road; they desperately try to call Jordon for help on the walkie-talkie, which doesn't work on Jordon's end (as Barry warned them might happen). Rusty runs them off the road and puts their unconscious bodies in the back of his truck. Just then, the gang in the racecar gets their signals back and worry when they can't reach Jewel and Austin.\nRusty takes Jewel and Austin to a deserted field, and then kills Austin by putting his hands and then face through the engine fan of his truck. He then calls Jordon on the walkie-talkie, telling him he'll trade Jewel and Austin for the racecar. Rusty instructs Jordon to come to an old warehouse in an hour; Jordon and the others devise a plan to ensure that Rusty Nail will not double cross them, as Rusty torments Jewel. Meanwhile, Officer Williams finds the wrecked and abandoned SUV.\nJordon, Mickey, Alisa and Bobby arrive at the warehouse and split up; Alisa stays with the car, Bobby and Mickey go around the perimeter, and Jordon heads inside. After a tense search of the warehouse, during which Rusty kidnaps Bobby, Rusty flees in the truck. Jordon, Mickey, and Alisa follow in the racecar. When they come across a police cruiser, they pull over to find Jenkins; after convincing him of their story with a photo Rusty sent of Jules, he agrees to help them catch up to Rusty Nail. However, Rusty comes out of nowhere and obliterates Jenkins and his cruiser; Jordon, Mickey, and Alisa give chase. Meanwhile, Officer Williams encounters a truck weaving recklessly, and flags it down; however, it's a driver for a meat packing plant on a rush to deliver his cargo. When Williams searches the cargo, he finds parts of Austin's body; the driver claims he picked up a \"rogue load\" from a fellow trucker who needed help, but Williams subdues him and tries to hail Jenkins on the CB. He then tells dispatch he's bringing the meat truck driver in. Later he finds the burning wreckage of Jenkins' cruiser.\nRusty contacts Jordon, and kills Bobby as the group listens helplessly over the walkie-talkie. Rusty then tells Jordon to meet him at a junkyard and give himself up; only then will he set Jewel and Austin free. Mickey wants to go get help instead, and forces Jordon off the road; he tries to convince Alisa to come with him, but she refuses and leaves with Jordon to go save their friends. Mickey goes for help on foot; he finds the truck parked on a side road, and is overpowered by Rusty Nail. Rusty crushes Mickey's head in a wench, then lights the semi-trailer of his truck on fire, driving off in just the tractor unit.\nJordon sends Alisa to go get help and enters the junkyard alone. Jewel's screams draw him into the final showdown with Rusty Nail. The two fight, as Rusty indicates Jewel is trapped in a dangling car about to be crushed. Just as it seems Rusty has the upper hand, Alisa runs him over with the racecar, and she and Jordon go to rescue Jewel from the crusher. However, Jordon finds the video camera in the trunk of the crushed car; it is playing previously shot footage of Jewel. It's revealed that Rusty Nail tied her to the roof of the truck and ran her into the girders of a steel bridge, killing her.\nEnraged, Jordon and Alisa get in the car to go find Rusty Nail, but he rams into them, trying to crush them. Alisa's leg is stuck, keeping her from getting out. Jordon runs to a nearby wrecking claw and uses it to put Rusty's truck in the crusher, with Rusty inside. Later, however, when Williams and his men investigate, Rusty Nail is nowhere to be found. The film ends with Rusty Nail hitching a ride with another truck driver."}