{"mid": "JudgmentAtNuremberg", "IMDB_id": "tt0055031", "title": "Judgment at Nuremberg", "plot": "Judgment at Nuremberg centers on a military tribunal convened in Nuremberg, Germany, in which four German judges and prosecutors stand accused of crimes against humanity for their involvement in atrocities committed under the Nazi regime. Judge Dan Haywood (Spencer Tracy) is the Chief Trial Judge of a three-judge panel that will hear and decide the case against the defendants. Haywood begins his examination by trying to learn how the defendant Ernst Janning (Burt Lancaster) could have sentenced so many people to death. Janning, it is revealed, is a well-educated and internationally respected jurist and legal scholar. Haywood seeks to understand how the German people could have turned blind eyes and deaf ears to the crimes of the Nazi regime. In doing so, he befriends the widow (Marlene Dietrich) of a German general who had been executed by the Allies. He talks with a number of Germans who have different perspectives on the war. Other characters the judge meets are US Army Captain Byers (William Shatner), who is assigned to the American party hearing the cases, and Irene Hoffmann (Judy Garland), who is afraid to provide testimony that may bolster the prosecution's case against the judges.\nGerman defense attorney Hans Rolfe (Maximilian Schell) argues that the defendants were not the only ones to aid, or at least turn a blind eye to, the Nazi regime. He also suggests that the United States has committed acts just as bad or worse as those the Nazis perpetrated. He raises several points in these arguments, such as: U.S. Supreme Court Justice Oliver Wendell Holmes, Jr.'s support for the first eugenics practices (see Buck v. Bell ); the German-Vatican Reichskonkordat of 1933, which the Nazi-dominated German government exploited as an implicit foreign recognition of Nazi leadership; Stalin's part in the Nazi-Soviet Pact of 1939, which removed the last major obstacle standing in the way of Germany's invasion and occupation of western Poland, initiating World War II; and the atomic bombings of Hiroshima and Nagasaki in the final stage of the war in August 1945.\nJanning, meanwhile, decides to take the stand for the prosecution, stating that he is guilty of the crime he is accused of: condemning to death a Jewish man of \"blood defilement\" charges—namely, that the man slept with a 16-year-old Gentile girl—when he knew there was no evidence to support such a verdict. During his testimony, he explains that well-meaning people like himself went along with Hitler's anti-Semitic policies out of a sense of patriotism, even though they knew it was wrong.\nHaywood must weigh considerations of geopolitical expediency and ideals of justice. The trial takes place against the background of the Berlin Blockade, and there is pressure to let the German defendants off lightly so as to gain German support in the growing Cold War against the Soviet Union. All four defendants are found guilty and sentenced to life in prison.\nHaywood visits Janning in his cell. Janning affirms that Haywood's decision was just, but asks him to believe that he and the other defendant judges never desired the mass murder of innocents. \"We never knew,\" he insists, \"that it would come to that.\" Judge Haywood replies, \"Herr Janning, it came to that the first time you sentenced a man to death you knew to be innocent.\" Haywood departs; a title card informs the audience that, of 99 defendants sentenced to prison terms in Nuremberg trials that took place in the American Zone, none were still serving their sentences as of the film's 1961 release."}