{"mid": "JuDou", "IMDB_id": "tt0099902", "title": "Ju Dou", "plot": "Ju Dou takes place in the early 20th century in rural China. The story begins as Yang Tianqing (the regular Zhang collaborator Li Baotian) is returning from a trek to sell silk for his adoptive uncle, Yang Jinshan (Li Wei). Jinshan, whose trade is dyeing fabrics, is known for his cruelty. Tianqing learns that Jinshan has just recently purchased a new wife, having beaten two previous wives to death after they failed to produce a son, the cruel irony being that Jinshan is in fact impotent.\nUpon meeting the wife, Ju Dou (Gong Li), Tianqing is immediately enamored with her. At night, Jinshan tortures Ju Dou. Eventually, Tianqing discovers Ju Dou's bathing area and spies on her. He does not know that Ju Dou knows he is there. Although Tianqing watches luridly, by exposing her bruises to him and sobbing, Ju Dou transforms the meaning of his gaze, forcing him to see her not only as a sexual object, but also as a human being.\nSoon, the two are unable to control their passions any longer, and they engage in sexual intercourse. When Ju Dou discovers she is pregnant, she and Tianqing pretend that the child is Jinshan's. Jinshan suffers a stroke which leaves him paralyzed from the waist down. Confined to a wheel chair, he nevertheless discovers Ju Dou and Tianqing's affair and attempts to kill the child. Jinshan is tied up by Tianqing and hoisted in a large barrel, leaving him dangling helplessly. Knowing that society would never accept her infidelities, Ju Dou goes to a nunnery to get contraceptives.\nMeanwhile, Tianbai has grown into a sullen child (Yi Zhang), but when he calls Jinshan \"Father\", Jinshan accepts the boy as his son. Jinshan falls into the dye vat and drowns one day while playing with his son and a funeral is carried out for him.\nTen years later. Ju Dou and Tianqing still run the dye operation, but Tianbai (now played by Zheng Ji'an) is now a rage-filled teenager. Rumors of his parents' infidelities drive him to nearly kill a local gossip. Upon discovering his parents resting in an underground cellar after one of their trysts, Tianbai drags them out and drowns Tianqing. Ju Dou then burns the mill down as the film ends."}