{"mid": "JulienDonkeyBoy", "IMDB_id": "tt0192194", "title": "Julien Donkey-Boy", "plot": "The film opens on television footage of an ice dancer - a recurring motif in the film - before cutting away to Julien, a young man with untreated schizophrenia. In the opening scene, Julien meets up with a small child with several turtles, only to strangle him to death when he is denied one. The child is then buried by Julien under the mud whilst he prays for mercy from God.\nFrom here, we see snapshots of the members of Julien's dysfunctional family. These include his pregnant sister Pearl, the father of her baby not being revealed (though there are implications that it could indeed be Julien's), his brother Chris, who aspires to be a wrestler, his grandmother, and his domineering, German father, who shows no real love or encouragement to his family.\nRather than follow a linear narrative, we instead see various scenes and vignettes involving the main characters, such as Julien working at a school for the blind, going to confession, muttering to himself on the streets and imagining conversations with Hitler. Pearl meanwhile learns to play the harp, looks for baby clothes for her soon-to-be-born child, lists her favorite baby names and cuts her Father's hair. Chris spends practically the entire film working out and practicing his wrestling moves on trash cans, even having a frustratingly unserious match with Julien. And the Father recounts historical stories, lambasts Julien and Pearl for 'artsy-fartsy' poetry and being 'a dilettante and a slut' respectively, though also pines for his dead wife.\nThe climax of the film sees Pearl and Julien at an ice-skating rink. Whilst Julien tries to sell some home-made skates to a Hassidic Jewish boy, Pearl takes to the ice despite being heavily pregnant.\nShe accidentally trips over, landing on her stomach and causing a miscarriage. Her fate remains unknown. At the hospital however, Julien convinces a nurse to let him hold the baby, stating it is his. She allows this, but whilst she leaves him alone with the baby, Julien makes an escape, getting on the bus to go home.\nJulien goes up to his room, hiding under the blankets, cradling the baby and muttering prayers. The film ends as it begins; with ice-skating footage."}