{"mid": "JuliusCaesar", "IMDB_id": "tt0065922", "title": "Julius Caesar", "plot": "The play opens with the commoners of Rome celebrating Caesar's triumphant return from defeating Pompey's sons at the battle of Munda. Two tribunes, Flavius and Marrullus, discover the commoners celebrating, insult them for their change in loyalty from Pompey to Caesar, and break up the crowd. There are some jokes made by the commoners, who insult them back. They also plan on removing all decorations from Caesar's statues and ending any other festivities. In the next scene, during Caesar's parade on the feast of Lupercal, a soothsayer warns Caesar, \"Beware the ides of March.\" This warning he disregards. The action then turns to the discussion between Brutus and Cassius. In this conversation, Cassius attempts to influence Brutus's opinions into believing Caesar should be killed, preparing to have Brutus join his conspiracy to kill Caesar. They then hear from Casca that Mark Antony has offered Caesar the crown of Rome three times and that each time Caesar refused it, fainting after the last refusal. Later, in act two, Brutus joins the conspiracy, although after much moral debate, eventually deciding that Caesar, although his friend and never having done anything against the people of Rome, should be killed to prevent him from doing anything against the people of Rome if he were ever to be crowned. He compares Caesar to \"A serpents egg/ which hatch'd, would, as his kind, grow mischievous,/ and kill him in the shell.\" He then decides to join Cassius in killing Caesar.\nCaesar's assassination is one of the most famous scenes of the play, occurring in Act 3, scene 1. After ignoring the soothsayer, as well as his wife's own premonitions, Caesar comes to the Senate. The conspirators create a superficial motive for coming close enough to assassinate Caesar by means of a petition brought by Metellus Cimber, pleading on behalf of his banished brother. As Caesar, predictably, rejects the petition, Casca grazes Caesar in the back of his neck, and the others follow in stabbing him; Brutus is last. At this point, Shakespeare makes Caesar utter the famous line \"Et tu, Brute?\" (\"And you, Brutus?\", i.e. \"You too, Brutus?\") Shakespeare has him add, \"Then fall, Caesar!\" This suggests that such treachery destroyed Caesar's will to live.\nThe conspirators make clear that they committed this act for Rome, not for their own purposes, and do not attempt to flee the scene. After Caesar is killed, Brutus delivers an oration defending his actions, and for the moment, the crowd is on his side. However, Mark Antony makes a subtle and eloquent speech over Caesar's corpse, beginning with the much-quoted \"Friends, Romans, countrymen, lend me your ears!\" In this way, he deftly turns public opinion against the assassins by manipulating the emotions of the common people, in contrast to the rational tone of Brutus's speech, yet there is method in his rhetorical speech and gestures: he reminds them of the good Caesar had done for Rome, his sympathy with the poor, and his refusal of the crown at the Lupercal, thus questioning Brutus's claim of Caesar's ambition; he shows Caesar's bloody, lifeless body to the crowd to have them shed tears and gain sympathy for their fallen hero; and he reads Caesar's will, in which every Roman citizen would receive 75 drachmas. Antony, even as he states his intentions against it, rouses the mob to drive the conspirators from Rome. Amid the violence, an innocent poet, Cinna, is confused with the conspirator Lucius Cinna and is taken by the mob, which kills him by tearing him to pieces for such \"offenses\" as his bad verses.\nThe beginning of Act Four is marked by the quarrel scene, where Brutus attacks Cassius for supposedly soiling the noble act of regicide by having accepted bribes. (\"Did not great Julius bleed for justice' sake? / What villain touch'd his body, that did stab, / And not for justice?\") The two are reconciled, especially after Brutus reveals that his beloved wife Portia had committed suicide under the stress of his absence from Rome; they prepare for a war against Mark Antony and Caesar's adopted son, Octavius. That night, Caesar's ghost appears to Brutus with a warning of defeat. (He informs Brutus, \"Thou shalt see me at Philippi.\")\nAt the battle, Cassius and Brutus, knowing that they will probably both die, smile their last smiles to each other and hold hands. During the battle, Cassius has his servant Pindarus kill him after hearing of the capture of his best friend, Titinius. After Titinius, who was not really captured, sees Cassius's corpse, he commits suicide. However, Brutus wins that stage of the battle--but his victory is not conclusive. With a heavy heart, Brutus battles again the next day. He loses and commits suicide by running on his own sword, which is held by a soldier named Strato.\nThe play ends with a tribute to Brutus by Antony, who proclaims that Brutus has remained \"the noblest Roman of them all\" because he was the only conspirator who acted, in his mind, for the good of Rome. There is then a small hint at the friction between Mark Antony and Octavius which characterizes another of Shakespeare's Roman plays, Antony and Cleopatra."}