{"mid": "JusticeLeagueCrisisOnTwoEarths", "IMDB_id": "tt1494772", "title": "Justice League: Crisis on Two Earths", "plot": "In an alternate universe where the roles of the heroes and villains are reversed from their counterparts in the mainstream DC Universe, heroic analogues of Lex Luthor and Joker (called the Jester) are stealing a device called the \"Quantum Trigger\" from the headquarters of the Crime Syndicate. When an alarm is tripped, the Jester sacrifices himself to allow Luthor to escape and kills J'edd J'arkus and Angelique (alternate versions of Martian Manhunter and Hawkgirl respectively) with a bomb. Luthor is nearly captured by the remaining Syndicate members (Ultraman, Superwoman, Power Ring, Johnny Quick and Owlman) but escapes to the Earth of the heroic Justice League by activating a dimensional travel device.\nLuthor locates a police station, but is mistaken for the evil Luthor and ends up strip-searched. The Justice League is summoned and Superman's x-ray vision confirms Luthor's reversed organs indicate that he is from a parallel Earth and that the evil Luthor is still incarcerated at Stryker's Island. The Justice League take the alternate Luthor to the Watchtower, where they learn of the Syndicate threat. As the Justice League debates the matter, Luthor hides the Quantum Trigger on the satellite. With the exception of Batman, the rest of the Justice League (Superman, Wonder Woman, Green Lantern, Flash and Martian Manhunter) travel to Luthor's Earth.\nArriving at the parallel Justice League's base, the heroes attack Syndicate targets. After a successful series of raids in which they capture Ultraman, the League confront United States President Slade Wilson, who releases Ultraman and explains that acceding to the Syndicate's demands saves millions of lives. His daughter, Rose, however, regards him as a coward. Martian Manhunter inadvertently reads her mind and explains that as a military man her father actually holds life more dear than others. Martian Manhunter later foils an assassination attempt on Rose, and the pair fall in love.\nOwlman has developed a weapon, the Quantum Eigenstate Device or Q.E.D., which the Syndicate intend to use as the equalizer to the threat of a nuclear reprisal. When pressed by Superwoman, Owlman reveals that he's secretly planning to overthrow Ultraman and take control of the Crime Syndicate. He also admits the weapon can destroy entire worlds. Believing there are many parallel Earths, and that each one develops from the choices that each person makes, Owlman becomes obsessed with the idea that nothing he does can possibly matter, as there will always be parallel worlds where he explored another option. As a result, he searches for Earth-Prime, the very first Earth from which all other universes originated, intending to use the Q.E.D. to destroy it and spark a chain reaction that will erase the entire multiverse, as it is the only action that would not result in the creation of another universe. Superwoman agrees to help him, as it would give her the power to kill everyone who's ever lived. Owlman sends Superwoman with three of her lieutenants to the League's dimension, and on the Watchtower they battle Batman, Aquaman, Black Canary, Black Lightning, Firestorm, and Red Tornado. Superwoman and one of her lieutenants escape with the Quantum Trigger, but are followed by Batman.\nBatman defeats Superwoman and summons the League. J'onn and Rose bond, and Rose decides to learn the location of the Syndicate base to allow the Justice League to confront them. The League arrive at the Crime Syndicate's moon-base with the captive Superwoman, and eventually battle the Syndicate. Owlman fights off Batman and takes the Q.E.D. bomb to Earth-Prime, finding it to be uninhabited and lifeless, having suffered an unknown cataclysm that caused it to leave solar orbit. Luthor speculates that a speedster might be able to vibrate and match the temporal vibration of the teleported Q.E.D. device and open a portal. Flash volunteers but Batman states that he isn't fast enough, only Johnny Quick is. Johnny agrees and opens a portal.\nBatman pursues Owlman to Earth-Prime and engages in a brutal battle with his doppelganger. Batman manages to teleport Owlman and the Q.E.D. device to another uninhabited Earth, and triggers the Q.E.D. Seeing what is about to happen, Owlman simply says \"It doesn't matter.\" The bomb destroys the alternate Earth, killing Owlman in the process. Batman returns to the Syndicate's Earth, where the strain of acting as a vibratory conduit has aged Johnny Quick to near death. Before dying, Johnny correctly deduces Batman lied about Flash not being fast enough and knew what would happen. Despite this, he shows no ill will toward Batman, dying with a smile. Martian Manhunter returns, accompanied by President Wilson and the U.S. Marines, and together they arrest Ultraman, Superwoman, and Power Ring.\nWilson thanks the heroes. Although Rose asks Martian Manhunter to remain with her, the group return to their dimension. Batman and Superman later discuss a membership drive with the five heroes summoned previously greeting the Justice League."}