{"mid": "JusticeLeagueDoom", "IMDB_id": "tt2027128", "title": "Justice League: Doom", "plot": "The Justice League, with Cyborg's assistance, stop the Royal Flush Gang's attempted robbery of a diamond vault using complex technology that allows them to pass through solid objects. Vandal Savage plots to start a new civilization by exterminating part of the population; he gave the technology to the Gang for testing. Savage hires Mirror Master to hack into the Batcomputer and steal contingency plans devised by Batman to incapacitate his League teammates, in case they go rogue. Savage assembles Mirror Master, Bane, Cheetah, Ma'alefa'ak, Star Sapphire, and Metallo, who all have personal vendettas against the heroes and pays them to simultaneously attack using the plans, altered to be lethal. When the supervillains agree, he welcomes them to the Legion of Doom.\nBatman, as Bruce Wayne, is informed by Alfred Pennyworth that the bodies of Thomas and Martha Wayne have been exhumed and are missing. At their graves, Bruce is ambushed by Bane, who renders Bruce unconscious. Bruce is buried alive in his father's coffin; he is left a tape recorder with Bane's message to taunt him, which motivates him to break out. He realizes the League has been attacked using his contingency plans, which were constructed from studying physical and psychological weaknesses. Batman and Cyborg save them one by one.\nWonder Woman is attacked by Cheetah with a scratch that sends nanomachines into her bloodstream. The nanomachines cause her to believe everyone she sees is Cheetah's duplicate. Since she never stops fighting until her opponent is defeated, Wonder Woman will fight until she dies. Cyborg adjusts his sonic emitter to a frequency that neutralizes the nanites. Martian Manhunter (as John Jones) celebrates his birthday with his colleagues. He receives a drink from Ma'alefa'ak in disguise, which is laced with magnesium carbonate; being disruptive to Martian biology, the Manhunter struggles to maintain form while sweating out the magnesium. The Manhunter is set on fire, which will constantly burn. Batman provides aluminum oxide to neutralize the magnesium.\nThe Flash is lured into Mirror Master's trap, resulting in a bomb on his wrist. If he does nothing, tries to remove it or decreases in speed, the bomb will explode, killing everyone in a three-mile radius. Batman instructs him to run and vibrate through an entire iceberg in the Arctic—Flash just barely escapes the blast radius. Green Lantern is targeted by Star Sapphire using Scarecrow's will-undermining fear gas; after failing to save hostages' lives, she exploits his fears, convincing him that he doesn't deserve the power. Jordan renounces his ring and resigns his fate in the collapsing mine. Batman shows him the hostages were just androids. Jordan reestablishes his willpower, removing the effects and summons his ring again. Superman, as Clark Kent, is lured to the Daily Planet's roof by a former employee aiming to commit suicide. Superman believes to have talked him out of it, when he is shot with a Kryptonite bullet by Metallo in disguise. It is extracted by Cyborg, using a Kryptonite scalpel laser, and Manhunter, who pulls it out; Superman regains consciousness.\nThe League retreats to the Watchtower, where Batman reveals he was the real mastermind behind the plans; he also had one in place should the Batcomputer be hacked: a hidden tracing algorithm. The League track down the Legion of Doom and subdue them, but fail to prevent an apocalyptic cataclysm via solar flare. Using the Hall of Doom's technology, the League saves the Earth by phasing it so the flare can go through. Savage is later tried and found guilty for crimes against humanity and sentenced to life without parole. The League adds Cyborg to their roster and Superman calls for a vote on Batman's membership. Batman defends his plans and criticizes them for not understanding the potential danger of a rogue Justice League before quitting. Batman explains to Superman the original plans were meant to only immobilize. Superman asks if Batman had a plan to stop himself if he himself were to go rogue, and Batman tells him that the Justice League themselves is his plan. With his trust in Batman assured, Superman hands him the Kryptonite bullet and teleports him out of the Watchtower."}