{"mid": "JustCause", "IMDB_id": "tt0113501", "title": "Just Cause", "plot": "Paul Armstrong (Sean Connery), a liberal Harvard professor opposed to capital punishment, is persuaded to go to Florida to investigate the conviction of Bobby Earl Ferguson (Blair Underwood) for murder. Ferguson, a former Cornell University student, who was convicted of raping and murdering a young white girl named Joanie Shriver (Barbara Jean Kane). Armstrong must save him from being executed in the electric chair. Ferguson tells Armstrong that he was tortured by two police detectives to get a confession. As Armstrong digs deeper into the case, he discovers that Tanny Brown (Laurence Fishburne), the chief detective on the case, did indeed coerce Ferguson's confession.\nThe plot thickens when Ferguson tells the professor that the murder was actually committed by Blair Sullivan (Ed Harris), a serial killer awaiting execution, who later reveals the location of the weapon used to kill the girl. When Armstrong discovers the weapon, Brown tries to threaten him into abandoning the investigation. (It is revealed that the murdered girl was Brown's daughter's best friend.) Ferguson gets a re-trial and is freed from prison. Subsequently, the governor signs Sullivan's death warrant.\nArmstrong receives a call from Sullivan, who says he has a final clue to share, but first wants Armstrong to visit his (Sullivan's) parents and tell them he said goodbye. Armstrong is shocked to find their butchered bodies. Back at the prison, Sullivan gloats that he and Ferguson struck a deal: Ferguson would kill Sullivan's parents in exchange for freedom, while Sullivan would claim responsibility for the girl's murder, which Ferguson did in fact commit. Armstrong asks why he was needed for their scheme, and Sullivan replies that was \"Bobby Earl's call.\" Armstrong has the last laugh by lying to Sullivan that his parents were alive and that they \"forgive him.\" Sullivan becomes enraged. He resists the guards taking him to the electric chair, where he is executed.\nArmstrong and Brown go after Ferguson, whose motive for everything turns out to be a desire for revenge on Armstrong's wife (Kate Capshaw); she was the prosecutor against him in a previous rape trial which, while thrown out of court on a technicality, resulted in him being brutalized and castrated in jail, as well as being kicked out of Cornell, robbing him of any chance of a future. Ferguson plans to murder Armstrong's wife and daughter (Scarlett Johansson) and then disappear. Armstrong and Brown join forces to kill Ferguson and save Armstrong's family."}