{"mid": "JusticeLeagueVsTeenTitans", "IMDB_id": "tt5091548", "title": "Justice League vs. Teen Titans", "plot": "The Justice League battle the Legion of Doom (Lex Luthor, Cheetah, Weather Wizard, Solomon Grundy, and Toymaster). Weather Wizard flees when his comrades are beaten, but becomes possessed by the shade of Trigon's minions . Robin (Damian Wayne) disobeys his father's orders to get civilians to safety, thinking he can help the Justice League fight the possessed Weather Wizard, and sets the Batwing to crash into Weather Wizard and explode, defeating him and forcing Trigon's shade to leave his body. Upset that there's no answer to this occurrence, and in order for his son to learn teamwork, Batman sends Robin to join the Teen Titans. Meanwhile, Trigon's minion possesses Superman, plaguing him with visions of demonic shadows and making him bang his head on a Stone Wall, so they can release Trigon.\nRobin meets the Titans' leader Starfire and members Raven, Garfleid Logan, and Blue Beetle but his lack of respect for the others causes friction. Blue Beetle and Robin fight until Blue Beetle's suit instinctively uses an energy blast to severely burn Robin. Raven heals him, but during the process her emapthic powers cause both to see into the other's memories. Robin later thanks Raven, but is curious about an entity he saw in her mind. With Raven unwilling to answer, Damian tries looking in the Titans' records, but finds no useful information. Starfire tells Damian that the team isn't just for fighting crime, but also a surrogate family, as they are all lost souls in a world with no place for them.\nSuperman finds and brutally beats down Atomic Skull, alerting Wonder Woman and Batman to his possession. The latter uses kryptonite to drive Superman back. Cyborg tries to locate Superman and a \"female with supernatural powers\", whom Trigon is searching for, and he and Batman conclude that if the host is damaged or overwhelmed, they will be freed from it. In the meantime, in order to loosen Damian up, Starfire takes the group to a carnival, where Raven encounters Trigon in spirit form and his demonic emissaries, who wants to find her so they can be together. With the help of the other Titans, Raven resists and fights the emissaries until they cannot maintain their presence on the Earthly plane and dissipate.\nAfterward, Raven reveals that her mother was a member of a cult who married her off to Trigon, who took a human form. Her mother fled after discovering his true nature and was saved by the Azarathians; benevolent people from another dimension, where Raven grew up. After unwittingly summoning her father and thus causing the obliteration of Azarath and her mother, Raven was taken by him so he could conquer Earth, but she imprisoned him inside a crystal in Hell. The Titans offer their support, but the Justice League arrives in order to take Raven away. However, before they can act, Flash, Cyborg, and Wonder Woman are taken over by Trigon's shadow and turned into demon emissaries. Batman prevents his own possession by injecting himself with a nerve toxin, putting himself in a comatose state and thus causing the shade to abandon him.\nThe Titans battle the League without success, causing Raven to surrender herself. Just before the League and Raven use a portal to leave, Blue Beetle frees Cyborg from Trigon's control. Robin locates Raven in the Middle East, revealing he put a tracking device on each of the Titans, and Cyborg and the Titans portal to the Middle East, to discover that Superman had unearthed a mystical shrine that Raven uses her powers on so that Trigon can pass though the shrine as a gate. Robin stabs Superman with kryptonite to free him from Trigon's control, and Superman defeats Flash and Wonder Woman, which frees them as well. The Titans save Raven, but not before Trigon returns to his physical form.\nFollowing Raven's plan, the Titans and Cyborg portal to Hell to retrieve the crystal to re-imprison her father, while the League vainly engage Trigon to prevent him from reaching innocent civilians. The Titans battle their way through hordes of demons, but an undead Ra's al Ghul, turned into Trigon's servant after his death at the hands of Deathstroke, shatters and destroys the crystal. He tries to persuade Robin to join him and Trigon by killing Raven so that he may return to life, but Robin declares himself a Titan; they battle, and Robin eventually defeats Ra's al Ghul and kills him. Overcoming her inner doubts and Trigon's telepathic attempts to dissuade her, Raven uses her powerful magic and her telepathic link to Trigon to re-imprison him in a shard of the broken crystal.\nRaven informs the Titans that the shard must stay in Hell and be watched always, in case Trigon tries once again to break free. She puts herself forward as Trigon's keeper, but the Titans assure that her home is with them. Back at Titans Tower, the group - now joined by Robin and Cyborg - are lauded by the Justice League for saving Earth, and Raven has her father's crystal prison attached to her forehead for safekeeping, while Trigon seethes with rage over his renewed imprisonment.\nIn a post-credits scene, Terra is seen approaching Titans Tower, riding a boulder across the sea."}