{"mid": "JusticeLeagueThroneOfAtlantis", "IMDB_id": "tt3878542", "title": "Justice League: Throne of Atlantis", "plot": "In the Atlantic Ocean, the USS California submarine picks up incoming human-like threats approaching the sub by sonar. The sub is attacked and the entire crew is killed by the hostiles. At S.T.A.R. Labs' Justice League headquarters, Cyborg, who has recently received environmental upgrades in an operation that replaced his remaining lung, is given news by Colonel Steve Trevor, the liaison for the Justice League since Darkseid's invasion.\nAt Mercy Reef in Maine, Arthur Curry, drunk over his father's recent death, picks a fight with a group of thugs when they wanted to eat the lobster Arthur was talking to. He defeats them and when the last man tries to stab him, his knife breaks into pieces against Arthur's chest. After throwing him into the ocean, Arthur leaves, unaware that Mera and Dr. Shin are watching him. Cyborg uses a Boom Tube to teleport to the sub and discovers hand prints on the hull and that several nuclear missiles are missing. He is then attacked by the same hostiles and suffers damage to his servos through his escape, though he takes a knife-like weapon from one of his attackers.\nBack at HQ, Cyborg gets help from Flash and Shazam to get Superman, Wonder Woman and Green Lantern. Green Lantern decides to head to Gotham City to get Batman, who is chasing henchmen of the Scarecrow. Green Lantern captures them for Batman, but angers Batman who needed them to lead him to Scarecrow. Batman joins the team and they check the now-raised sub. They realize the enemy is warriors from Earth's origin.\nDiana reveals that these warriors are from Atlantis, beings turned into underwater creatures by their king's mystical trident, after seeing the weapon that Cyborg had nabbed. Using Shazam's suggestion, Superman and Batman decide to meet Atlantis-expert Dr. Shin, while the others are tasked to find Atlantis.\nAt Atlantis, Prince Orm and Black Manta meet with Orm's mother, Queen Atlanna. They argue over declaring war on the surface world, noting the damage during Darkseid's attack, with Atlanna saying that the volcano that killed Orm's father was due to Darkseid's forces while Orm says it was the Justice League's fight with Darkseid. Orm also says that the humans polluting the Earth will eventually destroy it and Atlantis, which he believes is reason to attack them first. Atlanna silences Orm and asks Mera to bring Arthur, her other son, to Atlantis. Black Manta uses a craft holographically disguised as a submarine to attack Atlantis using the stolen missiles, framing the surface for their \"unprovoked\" attack.\nDr. Shin tries to tell Arthur that his father asked him before his death to help Arthur. Moments later, Dr. Shin is killed by Atlantean soldiers sent by Black Manta. Arthur is overwhelmed by the attack, knocked out and blasted out of his collapsing house, but is saved by Mera, who dispatches the soldiers by using her control over water, and takes him underwater.\nBatman and Superman enter Dr. Shin's home discovering that his work is destroyed. Superman recreates a photograph of Curry and a letter from his father revealing that his son is half-Atlantean. Batman decides they must find him.\nThe attack on Atlantis leads the citizens and Orm to demand war and to break the seal on war plans created by the former king in the event of conflict with the surface. Queen Atlanna states that they might need to reveal themselves after centuries of hiding and contact the Justice League. Arthur wakes up with gills on his neck in underwater Atlantean ruins with Mera, who explains that he was in Atlantis and that Atlanna was Arthur's mother.\nAs a royal, she could not be with his father or Arthur, so she left to be with her king and Orm, though she still loved Arthur greatly and watched him when he was a child. Arthur had once encountered Atlanna when he was swimming by the shore. Now, Atlanna believes Arthur can help Atlantis bridge the gap between the two worlds.\nMera then dresses him in the king's royal garb, hidden by Atlanna inside the ruins. Arthur, having difficulty processing the situation, removes the armor and crown, leaving only the orange and green Atlantean bodysuit, and heads to the surface with Mera following him.\nSoon, they are attacked by the Trench. The creatures overwhelm Arthur. One of them bit Arthur's hand, making him bleed. The Justice League arrives in time to defeat the Trench. Orm hears from Black Manta that the Trench failed to kill Arthur. Orm and Queen Atlanna argue because Orm wants to start a war and reveals his knowledge of Curry. Queen Atlanna reveals to him that she knows he attacked Atlantis. With this news, Black Manta confronts the queen, but is overpowered by her trident. Orm then stabs her from behind, killing her and taking over Atlantis as the new king.\nArthur, Mera, Superman, Wonder Woman, Green Lantern, and Cyborg arrive at Atlantis and learn of Queen Atlanna's death. The Atlantean people were under the mistaken impression that a surface dweller killed her. The heroes are then defeated by Orm, who has assumed the mantle of \"Ocean Master\" and uses the trident to incapacitate and restrain them inside cocoon-like pods. Even Superman bleeds when attacked with the trident. The group is sent to be consumed by the monstrous Dark Trench, while Ocean Master leads Atlantis' army to the surface.\nArthur destroys his pod by tapping into the power of the trident and with Superman's help, as well as his telepathic control over sea creatures, they save the rest and defeat the monster. In Metropolis, a massive tidal wave created by Ocean Master's trident is used to conceal Ocean Master's army, which reaches the shores and attacks. The military is powerless until the League arrive.\nDuring the fight, Superman saves John Henry Irons, and Wonder Woman saves Lois Lane and Jimmy Olsen. Arthur is attacked by Black Manta, who reveals that he manipulated Ocean Master and plans to overthrow and kill him when the time is right and take Atlantis for himself. While Black Manta is revealing his plan, Arthur calls a shark to attack him, dragging Black Manta underwater, killing him in the process. Mera and the League attack Ocean Master, but are once again defeated due to his Trident's power, as Mera is knocked unconscious, Shazam is transformed back into his normal form of Billy Batson by the Trident's mystical electric energy, Cyborg is impaled, severely wound, electrocuted and disabled by Ocean Master, Wonder Woman successfully disarms him of the Trident, though she is incapacitated and knocked unconscious by its electric energy when she holds it, both Flash and Green Lantern are knocked unconscious by Ocean Master, and Superman is impaled in the chest and severely wounded by it because of its mystical properties. Curry becomes the last to face Ocean Master. Curry has an upper hand during the fight because Ocean Master is unable to use its full power on Arthur given his status as Atlantean royalty. Despite this, Ocean Master defeats Arthur with the trident's power by using it to create a massive blast of power to incapacitate him and knock him unconscious. Batman saves Cyborg from dying by electrocuting him with a taser device, and Cyborg reveals that he has video of Ocean Master confessing to killing his mother when they were captured. Ocean Master nearly kills Arthur, impaling him and severely wounding him with his trident. Cyborg broadcasts Ocean Master's confession all over Metropolis for Atlantis' soldiers to see. Stunned by this treachery, the soldiers do not obey Ocean Master's commands and Arthur uses the distraction to defeat him. He then convinces the soldiers to stand down and declares his desire to bring Atlantis and the surface world together in peace.\nLater in Atlantis, Arthur is crowned as king, with the Justice League celebrating among the audience. Batman suggests that, with new threats appearing, they need to solidify the team and Cyborg reveals plans for a watchtower. Arthur joins as Aquaman (which is a nickname everyone on the internet gave him and he hates), and soon heads with now-love interest Mera against the Trenchers outside Atlantis.\nIn the post-credits, Orm is incarcerated at Belle Reve, yelling at the guards to release him. He is approached by Lex Luthor who has a proposition for him to consider."}