{"mid": "JustBeforeDawn", "IMDB_id": "tt0082592", "title": "Just Before Dawn", "plot": "Two men named Ty (Mike Kellin) and Vachel (Charles Bartlett) are hunting in a forest and come across an abandoned church, which they go in to explore. After Ty sees their truck being crashed into a tree, Vachel is stabbed with a serrated machete by a chuckling assailant who then dons Vachel's hat and jacket. Ty, seeing the murderer come out of the church, quietly flees off into the forest. Meanwhile, forest ranger Roy McLean (George Kennedy) is at his home, where he encounters a van of five college-aged adults heading to rural property which one of them has inherited. Despite his insistence that they not venture up the mountain, the five continue along. Among them are Warren (Gregg Henry); his girlfriend Constance (Deborah Benson); Jonathan (Chris Lemmon), and his girlfriend, Megan (Jamie Rose); and Daniel, Jonathan's brother (Ralph Seymour).\nOn their way up the mountain, they hit a deer, and encounter Ty stumbling through the woods on his way down the mountain; they dismiss his warnings of \"demons,\" as he is visibly drunk. After reaching a point where the van cannot drive any further, the group set out and foot and make a campsite; at night, while around the fire, Constance, Megan, and Daniel hear noises around them and become frightened, only to find that Jonathan and Warren are playing a joke on them. The next morning, they hike along Silver Creek to a waterfall, where they see a young girl named Merry Cat Logan (Kati Powell) singing before noticing their presence and running into the woods. Megan and Jonathan go skinny dipping at the bottom of the falls, unaware that someone else has entered the water. Megan feels hands touching her and assumes it's Jonathan, until she sees him on shore, whereupon she panics and swims to safety.\nWhen the group splits up to go exploring, Jonathan spots Merry and chases after her. She runs to a clearing but sees something that frightens her and hides behind some trees. Jonathan assumes it's the rope bridge over the waterfall ahead and begins to go across, only to be confronted by the killer, who cuts his hand with his machete. The killer severs the bridge and Jonathan plummets into the water below. Unable to swim, he attempts to climb back up over the ledge using the rope. When he reaches the ledge, the killer kicks him in the face, and he falls to his demise. Meanwhile, Megan and Daniel are taking photographs in the woods, and come across the church and a graveyard. Daniel, who has lost his glasses, sees a figure coming through the woods, and thinks it's Jonathan. He and Megan pretend to kiss as a joke, but as the figure comes closer, Daniel realizes it is not his brother. The figure stabs Daniel, and Megan flees into the church, where she watches through the window as the killer investigates Daniel's camera. Suddenly, another identical man emerges behind her inside the church, realizing that the two are identical twins; she is murdered in the church while the other twin photographs her death from outside the window.\nWarren and Constance (now barefoot and in shorts) return to the camp, but cannot find anyone else. While wading through the river, they encounter Jonathan's body floating downstream, and pull him out. As night approaches, Warren leaves Constance at the campsite to retrieve the car keys from Jonathan's body, but it's not where he left it; nearby, he finds Jonathan's body against a tree. Meanwhile, Ty finally encounters Roy in the woods and tells him about the twins at the church. Roy goes out on his horse to find the teens, and comes across Merry's family. They tell him that the twins were actually their own and their mother died during childbirth, so he mated with his daughter and had Merry. Left alone, Constance is attacked by one of the twins, who chases her up a tree. The twin cuts down the tree, and just before he is about to kill Constance, Roy shoots him and he tells the couple to go pack their items. They go back to camp, as Merry runs through the woods to find them. At camp, the other twin stabs Warren and tries to kill Constance, who rams her fist down his throat, choking him to death. Warren begins to sob and Merry watches from the trees, as the sun rises in the forest."}