{"mid": "JusticeLeagueWar", "IMDB_id": "tt3060952", "title": "Justice League: War", "plot": "A series of strange abductions have occurred in Gotham City, Central City, Coast City and Metropolis among others. Video footage suggests that Batman, a wanted, costumed vigilante, is behind the incidents. When a mysterious, burly, cloaked kidnapper abducts a woman, Green Lantern (Hal Jordan) arrives to confront the kidnapper and saves the woman when she is dropped from above. Green Lantern then attacks the kidnapper, revealing it to be a monstrous Parademon. The creature defeats Green Lantern soundly, and as he is about to be killed, Batman appears and attacks the Parademon, trying to interrogate it. The Parademon then attacks both heroes. They escape from the city's police and chase the creature into the sewers, where it charges a Mother Box and explodes. Batman and Green Lantern examine the box, deduce that it is of extraterrestrial origin, and decide to ask Superman for an answer. Another Mother Box, supplied by The Flash (Barry Allen) is being studied at S.T.A.R. Labs. Doctor Silas Stone, father of Vic Stone, deliberately misses his son's football game so he can study the box. Arriving in Metropolis, Batman and Green Lantern fight Supermanwho has fought a Parademon previously and believes the heroes are working with it. The battle spreads over a portion of the city; it finally stops when Batman calls Superman \"Clark\". Superman uses his x-ray vision and recognizes Batman as billionaire Bruce Wayne. The three heroes then begin to collaborate. On planet Apokolips, Darkseid orders Desaad to begin an invasion of Earth in response to the superheroes' discovery of his plans.Vic arrives at S.T.A.R. Labs and argues with his father Silas, who believes that football has no importance in a world that is changing with the appearance of metahumans, and states that he will never come to one of his son's football games due to his devotion his own work. At the Daily Planet, Superman, Batman, and Green Lantern realize the invasion has begun when the box activates and several Boom Tubes appear throughout the world, including S.T.A.R. Labs. While Vic is holding the Box being study by his father during their argument, it activates and explodes, creating a Boom Tube. The explosion fuses the technology inside the Box to Vic's fatally wounded and mutilated body. With several Parademons attacking, Silas is forced to take Vic to an emergency room to save him. Silas loads Vic into a technologically advanced medical bed and uses experimental nano mechanical and tissue grafting technologies on Vic in desperation, though this seems to fail when his heartbeat flatlines. Countless Parademons appear around the world, attacking everyone on sight. The box's technology spliced with Vic's body fuses itself with the various technologies, as well as computers, around the room, transforming Vic into Cyborg, with a body now made from technology capable of transforming and adapting itself and obtaining new features, such as weapons. Just as the Flash arrives to save the scientists, Cyborg's systems reveal details of Apokolips, Darkseid, and the invasion plan. He sees that the Parademons are actually the inhabitance countless worlds conquered by Darkseid. The inhabitance are captures and spliced with Darkseids technology, allowing it to control and repurpose their genetics and physical makeup, transforming them into mind controlled monsters and together serve as highly expendable army for conquering other planets. Vic's was affected by the same technology but it had not been programmed to create a Parademon and fused with other materials and instead. At his foster home, teenager Billy Batson sees a Parademon outside and mystically turns into the superhero Shazam. Air Force One is attacked in the air, but is saved by the Amazon princess Wonder Woman (Diana Prince) and Superman. After the heroes gather, Cyborg reveals that the invasion is a prelude to the terraforming of Earth. Darkseid arrives and proves to be a powerful opponent who defeats each hero effortlessly.Darkseid uses his Omega Beams while fighting Flash and Superman, with the latter being unable to outmaneuver the beam and is hit, incapacitated and captured by a Parademon. Batman stops Green Lantern from going after them on his own, as his ego has caused him to charge at Darkseid without thinking and be quickly defeated and injured to the point where his arm breaks. Batman then persuades him to think about the many lives at stake rather than his own image as a hero and to help the heroes work together after he unmasks himself and reveals that his parents's murders were what motivated him to fight evil. Wayne deliberately allows himself to be captured to save Superman. Green Lantern, acting as a leader, assembles everyone and decides that to defeat Darkseid they must destroy his eyes first, stripping him of his power to use his Omega Beams. He is taken through a portal and arrives on Apokolips, proceeding to escape the Parademon and stop Desaad from turning Superman into a Parademon. Because of a brainwashing process being done on him using Darkseids technology, Superman becomes unstable and highly aggressive, resulting in him crushing Desaad to death and attacking anything insight, including other Parademons and Batman. Batman reasons with Superman, helping him reassert his own personality. On Earth, after Darkseid's eyes are disabled, Cyborg connects with the Mother Box to reopen the Boom Tubes and send the tyrant and his army back to their home world. Though the Parademons are gone, Darkseid remains. Superman and Batman arrive and together they force the tyrant into the portal. With the world saved, the once-maligned superheroes gain the public's trust and are honored at the White House. The President of the United States asks whether they have a name. Shazam abruptly announces the name \"Super Seven\", to which the others object. After a short debate the team of superheroes agree to take the name of The Justice League.In a post-credits scene, an Atlantean ship emerges from the ocean and Ocean Master appears carrying the dead body of his king, possibly killed when the Parademons assembled in the sea during Darkseids arrival on Earth. He believes that the surface dwellers on Earth are responsible for his death, calling it an act of war from the surface, for which he vows retribution."}