{"mid": "JusticeLeagueDark", "IMDB_id": "tt2494376", "title": "Justice League Dark", "plot": "All over the world, people suddenly begin panicking as they start to see everyone around them as demonic monsters and end up killing innocents before members of the Justice League stop them. Deliberating about this strange outbreak, most of the League's members come to the conclusion that magic must be involved in this. Despite his own past experiences with magic, Batman expresses his skepticism and walks out; but as he returns to Wayne Manor to rest, he suffers a temporary blackout (from a possession by Deadman) and then finds the word \"Constantine\" written all over the nearby walls.\nIn a flashback, occultists John Constantine and Jason Blood engaged the Demons Three in a poker game in Las Vegas for high-end stakes; the former even offering his home, the House of Mystery, as his part of the pool in exchange for a box of artifacts, including one called the Dreamstone. However, both parties cheated at the game, and when Constantine exposed the Demons' trickery, they attacked him. Constantine unleashed Jason's alter ego, the demon Etrigan, who defeated the Demons Three, but not before they swore revenge on him.\nBatman visits Zatanna after one of her performances and begins to ask about Constantine, with whom Zatanna had a disappointing romantic history. Deadman possesses Batman once again and tells Zatanna she needs to see John. Zatanna brings Batman to Constantine, but they are attacked by a magical whirlwind summoned by an unknown sorcerer. The trio narrowly manage to get inside John's house in time where they are joined by Black Orchid, the spiritual embodiment of the House. The group gathers to share information, and after a quick discussion and some argument between John and Zatanna, form a team to investigate the cause and reason for these supernatural occurrences.\nThe heroes visits a friend of Constantine and Zatanna's named Ritchie Simpson, but outside the house they find shroud spirits of Death waiting to collect Ritchie's soul upon his upcoming demise. The team is granted entry by Simpson, who is suffering from a magical cancer and resentful of Constantine for abandoning him to his fate, but loans them the Keshanti Key. Constantine and Zatanna look through one of the unwitting rampager's memories for the cause of his frenzy, and discover that he was possessed by an unknown entity wearing a strange ring. Batman, Deadman, Constantine, and Zatanna narrowly manage to escape from a living feces beast conjured to consume the man, and Zatanna proceeds to destroy the monster.\nReturning to Ritchie's home to identify the ring from the man's memory, the team finds him about to die, with Blood nearby. Batman revives Ritchie with an adrenaline shot to the chest, but he quickly falls into a coma. After being brought to the House of Mystery for interrogation, Blood tells the team that he did not attempt to hurt Ritchie, but was looking for a way into the House of Mystery to find the Dreamstone. He reveals that in his old time, the era of King Arthur, the stone was created by a sinister magician naming himself Destiny, who sought to conquer the land. Blood fought Destiny and managed to cleave the stone in two, banishing the sorcerer, but was himself mortally wounded. Merlin, anticipating that Destiny was only temporarily defeated, fused Blood with his demonic servant Etrigan to battle the evil magician once the Dreamstone would resurface. Ritchie awakens and names Felix Faust as his assailant before falling back asleep.\nThe group locate Faust's observatory with help from Swamp Thing. When they infiltrate Faust's lair, the wizard battles the team, but is ultimately defeated by Zatanna; however, Faust is found to have no involvement in hurting Ritchie. Ritchie awakens and is revealed to have the other piece of the Dreamstone, which he has been using it to keep his cancer in remission; he apparently destroys Black Orchid, but then is seemingly killed when the Dreamstone brings Destiny back to life. Destiny declares himself a god, destroys the House and departs to sink the United States into chaos; Zatanna saves the group, but passes out from the exertion. The Justice League tries to fight Destiny, but he makes them perceive each other as demonic threats. Etrigan attacks Destiny, but is separated back into Jason Blood and Etrigan. Constantine summons Swamp Thing and tricks him to fight Destiny while Batman and the recovered Zatanna disable the Justice League. However, Destiny defeats Swamp Thing by ripping Alec Holland's remains from his body.\nConstantine tricks Destiny into bringing him and Deadman within his protective shield, allowing Deadman to wound Destiny, before Constantine, Batman, and Blood destroy the Dreamstone and Destiny's body, leaving Ritchie, whose soul is dragged to Hell by the shroud spirits. Right afterwards, Blood succumbs to his mortal wound from centuries before. Zatanna, Constantine, and Etrigan bury Blood's body near the place of his old village, before Etrigan leaves for parts unknown. Zatanna agrees to join the Justice League, and offers Constantine a position as well. Constantine initially declines claiming Batman wouldn't approve of him, but Zatanna claims it was his idea. The two return to the now-rebuilt House of Mystery, taking a first tentative step to restoring their fractured relationship, and Deadman likewise joins the restored Black Orchid as her soulmate."}