{"mid": "JustImagine", "IMDB_id": "tt0021016", "title": "Just Imagine", "plot": "In 1980, J-21 (John Garrick) sets his aircraft on \"hover\" mode in New York, lands and converses with the beautiful LN-18 (Maureen O'Sullivan). He describes how the marriage tribunal had refused to consider J-21's marital filing and applications, and LN-18 is going to be forced to marry the conceited and mean MT-3 (Kenneth Thomson). J-21 plans to visit LN-18 that night.\nRT-42 (Frank Albertson) tries to cheer him up by taking him to see a horde of surgeons experimentally revive a man from 1930, who was struck by lightning while playing golf, and was killed. The man (originally named Peterson now is called Single O) is taken in hand by RT-42 and J-21, where it is revealed that aircraft have replaced cars, numbers have replaced names, pills have replaced food and liquor, and the only legal babies come from vending machines. That night, LN-18 feigns a headache, and her father and the despicable MT-3 decide to go to \"the show\" without her. The second they are gone, RT-42 and J-21 appear and woo B-27 and LN-18 respectively. MT-3 and LN-18's father return quite early, as MT-3 was highly suspicious, and RT-42 and J-21 hide. However, the game is foiled by the moronic Single O (El Brendel), the man from 1930, becoming addicted to pill-highballs, getting drunk, and trying to get some more pill-highballs from J-21.\nJ-21 is depressed, but is contacted by Z-4, the scientist. He is told that Z-4 (Hobart Bosworth) has built a \"rocket plane\" that can carry three men to Mars. After a farewell party where J-21 works, on the Pegasus, a dirigible they call an \"air-liner,\" the rocket blasts off, carrying J-21, RT-42 and Single O, who has stowed away for the synthetic rum. Landing on Mars, they are received by the Queen, Looloo and the King, Loko. That night, Looloo and Loko take them to see a \"show,\" a Martian opera, where a horde of trained Martian ourang-outangs dance about. They are suddenly attacked by Booboo and Boko, the evil twins (everyone on Mars is a twin) of the King and Queen. They escape and return to Earth, and as one of the first men on another planet, J-21 is permitted to marry LN-18. Finally, Single O is reunited with his aged son, Axel."}