{"mid": "JusticeLeagueGodsAndMonsters", "IMDB_id": "tt4324302", "title": "Justice League: Gods and Monsters", "plot": "In an unspecified alternate universe, the Justice League is a brutal force that maintains order on Earth. This universe has its own versions of the League, Batman is Dr. Kirk Langstrom, Wonder Woman is Bekka, and Superman is Hernan Guerra. The Justice League's lack of accountability is ultimately challenged by the world's governments following the suspicious deaths of three renowned scientists: Victor Fries, who was drained of blood in the Arctic, Ray Palmer, who was sliced into two with a sharp weapon, with his car having traces of a high heel shoe, and Silas Stone, who was burned alive by an explosion of heat vision energy along with his young son Victor Stone. The innocence or guilt of the three is the central plot element of the film.\nAs all suspicion falls on the Justice League, President Amanda Waller asks that they cooperate with the government's investigation. Wonder Woman speaks to Steve Trevor to learn what the government knows while Superman invites Lois Lane to the Justice League's HQ, where he tells her of his goals to help humanity, and reveals how little he knows about Krypton or his heritage.\nBatman investigates Silas Stone's office and discovers an email that was sent to a number of scientists including Dr. Will Magnus, Kirk's best friend and college roommate who helped his transformation. Having remained close friends with Magnus and his wife, Tina, Batman asks the doctor about \"Project Fair Play,\" which involved all the scientists under Lex Luthor's employ, but Magnus tells him nothing. Later, Batman locates all the remaining scientists discussing the possible threat over their heads, when they are attacked by three robotic assassins, who travel via Boom Tube. Despite Batman and later, the other League Members intervening, the assassins slaughter the remaining scientists and Tina before 'Booming' out, leaving Magnus, severely burned by one of the creature's heat vision, the sole survivor of the attack.\nThe Justice League take Magnus to their HQ, the Tower of Justice, to recover, while Superman flies into the moon's orbit to a satellite, where Luthor now resides. Luthor reveals that Project Fair Play is a weapons program to destroy the League if necessary, while also revealing that he retained all the remaining information on Krypton from Superman's shuttle, and tells him the truth about Zod, who Superman had envisioned as a hero trying to save his world. Luthor tells Superman that Waller has the original files, and as Superman leaves, a robotic assassin booms in and the satellite explodes, seemingly killing Luthor. As Superman looks on in shock, Trevor shows satellite footage of the explosion and Superman's presence to Waller, and she retaliates with Project Fair Play, which consists of troops and vehicles armed with energy weapons powered by red solar radiation like Krypton's sun.\nSuperman and Wonder Woman face the army at their door as Batman stays inside the Tower, where he activates the Tower's forcefield, with the idea being that once Magnus recovers, he can clear the League. Suddenly, Tina arrives and before Batman can react, she subdues him and shape-shifts into a liquid metal robot. With Batman restrained by Tin, Magnus' house robot, Tina revives Magnus with an organic nanite serum similar to Batman's, which physically enhances him and gives him regenerative healing powers. Magnus is revealed to have orchestrated the framing of the League, with his robotic assassins actually being the Metal Men, armed with 'Boom Tube' technology and red sun energy. Magnus tells Batman that he intends to detonate a Nanite Bomb, with microscopic Boom Tubes teleporting nanites into every person on the planet, to forcefully link humanity together into a hive mind. He confesses that he accidentally killed the real Tina in a fit of rage one night early into their marriage. Overwhelmed with irrational jealousy, he believed that she secretly loved Kirk, and was tired of her constantly begging him to find a cure for Kirk's vampiric condition. After covering up her death, Magnus replaced her with a robotic duplicate named Platinum, capable of mimicking human flesh, and joined Fair Play, intending to use its resources to fund his secret Nanite Bomb project. He feels that his actions prove that there is no hope for humanity if even a brilliant, rational man like himself could do that to his own wife.\nAs Magnus prepares his weapon, Lex Luthor, who escaped the explosion, suddenly teleports into the middle of the battle outside and tells everyone that he has discovered Magnus' plan. Inside, Batman destroys Tin and frees himself, then seizes an opportunity to drop the forcefield. With Batman fighting Magnus, Wonder Woman faces Platinum, and Superman takes on the Metal Men, who quickly merge into a single, more powerful entity. Wonder Woman uses her sword's boom tubes to 'Boom' Platinum to the sun, Superman destroys the mother boxes inside the Metal Men to keep them from 'Booming' before taking them underground and melting them inside molten rock. They manage to destroy the bomb (at the cost of Superman's Kryptonian escape craft) and, after being defeated by Batman, a regretful Magnus commits suicide by disintegrating himself with nanites.\nA week later, the Justice League has been cleared of all wrongdoing, and the world, along with Lois Lane, views them differently. Bekka decides to leave the Justice League to face her past along with Lex Luthor, who wants to explore other universes after growing bored with this one. Before leaving, Lex Luthor gives Superman all the data on Krypton and tells him to be a \"real hero\". The film ends with Superman and Batman deciding to sort through the data immediately to help humanity, but in a less brutal way."}