{"mid": "JustinAndTheKnightsOfValour", "IMDB_id": "tt1639826", "title": "Justin and the Knights of Valour", "plot": "Justin (Freddie Highmore) lives in the kingdom of Gabylonia, where lawyers control everything and knights have been ousted. His dream is to become one of the Knights of Valour, like his grandfather, Sir Roland. But his father Reginald (Alfred Molina), a widower and the chief counsel to the Queen (Olivia Williams), wants his son to follow in his footsteps and become a lawyer. After an argument with his father, Justin seeks comfort from his grandmother (Julie Walters), a friend of the Queen, who encourages him to follow his dreams. Justin notices that his grandfather's sword is missing and decides to find the sword as his knights quest. His grandmother gives him a key which originally belonged to his grandfather and tells him to go to an abbey where three wise monks would train him. Before Justin leaves on his quest, he visits his crush Lara (Tamsin Egerton) who is a spoilt brat and the daughter of the kingdom's greatest businessman. He says farewell to her, though she is not really listening and rather uncaringly gives him a sock as a token.\nJustin embarks on his quest to become a knight. Along the way he meets a beautiful, feisty girl named Talia (Saoirse Ronan), a barmaid who works at the Broken Eagle Inn, a job which she doesn't enjoy, and a quirky wizard called Melquiades (David Walliams). Talia is immediately enamored by Justin, which Melquiades notices. Meanwhile, Justin's grandmother visits the Queen, who tells her that she regrets her decision of ousting the knights. An armor polisher and small-time thief overhears their conversation and steals some armour to disguise himself as a knight, naming himself Sir Clorex (Antonio Banderas). He instantly becomes popular with the townsfolk and is used to attract customers at the Broken Eagle Inn, but Talia is immediately able to tell that he is a phony.\nJustin arrives at the abbey and receives training from the monks, Braulio (Barry Humphries), an inventor who suffers from nervous attacks when shocked or stressed, Legantir (Charles Dance), a wizard and head monk of the abbey and Blucher (James Cosmo), a knight and an old friend of Sir Roland. They train him using the ways of the Knights of Valour. The monks then receive news that a banished former knight, Sir Heraclio (Mark Strong) and his accomplice Sota (Rupert Everett), have returned from exile and have started gathering an army (composed of people broken out of prison by Sota's idiotic brothers) to seek revenge on the Queen for outlawing knights. The monks later reveal to Justin the Hall of Heroes, where all the statues of the finest knights were kept. Justin finds his grandfather's statue and notices that his grandfather's sword is not in the chest below it, and Sir Heraclio's statue has been removed. Blucher then tells Justin what really happened to his grandfather and how the Queen outlawed knights: The King was killed in a battle and all the ruling was left to the Queen. The Queen started depending on lawyers and Justin's father chose the Law over Knights, and eventually wrote a contract that outlawed Knights, which the Queen signed. Heraclio, furious, tried to attack the Queen, but Justin's grandfather defended the Queen and was killed by Heraclio with his own sword. Justin realizes that his grandfather's sword is with Heraclio. The monks attempt to challenge Justin by battling a dragon, which turns out to be a crocodile named Gustav with mechanical wings and a fire-breathing trumpet. Justin ends up near-fatally injured but is saved by Legantir and Blucher using a healing spell that requires magic, healing leaves and a true knight. The monks fear for his safety and decide to end the training. Just before he leaves, Blucher gives Justin his sword and tells him that he'll need it.\nOn his way back home, Justin saves Talia when she gets intimidated by thugs. Talia joins in and helps Justin defeat the thugs, resulting in her getting fired, though she happily quits before she can actually be fired. Justin is amazed that Talia is a proficient fighter, which she says is from dealing with five older brothers. She gets slightly disheartened when she learns that Justin already has feelings for Lara. Meanwhile, Justin's grandmother tells her son Reginald to understand Justin's dream of becoming a knight, just like his father understood his dream to become a Lawyer. She persuades Reginald to bond with his son at Lara's party, an event that Justin wouldn't miss. Justin attends Lara's party with Talia as his date. Justin is shocked when he finds out that Lara has fallen in love with Sir Clorex. Like Talia, Justin can also tell that Sir Clorex is a fraud, having already seen him shamefully sell autographs for money. Sota and his brothers invade the party in order to kidnap Lara for a ransom of 100,000 gold bars from her father. Justin attempts to save Lara, but Sota drugs him with a sharp ring, making him disorientated and he ends up embarrassing himself in front of Lara. Clorex enters the scene in a choppy way. Sota and his brothers, after hearing that the townsman call him Sir Clorex, think that he is a knight and flee quickly. Lara mocks Justin about his desire to become a knight, and Reginald attempts to bond with his son, but Justin sadly tells him that he will go to Law School (earlier on in the story, Justin was immediately accepted into Law School since he was Reginald's son). Sir Clorex and Lara share a seemingly romantic moment together, until Sir Clorex 'kidnaps' Lara and rides off with her.\nOn his way to Law School, Justin bumps into Talia who tells him that Lara has been captured. Justin is her only hope, as the townsfolk become infuriated with the lawyers. After some encouragement and persuasion, Reginald finally accepts his son's desire to become a knight and allows Justin to stand up against Heraclio. Justin, Talia and Melquiades go to Heraclio's hideout, where they find Sir Clorex, being questioned by Heraclio about his knighthood, and Lara being help captive. Justin and Talia break into the room and briefly fight. Sir Clorex then grabs Lara and runs off with her. Justin and Talia defeat Sota and his brothers, before coming face to face with Heraclio's army. Talia confronts Sir Clorex and engages in a fist fight with him. She eventually corners him and finishes him off by kicking soot all over him, telling Sir Clorex that he is simply a fake and that it's not armour that proves he's a knight, it's the man inside. Blucher arrives with Gustav to aid Justin and defeat Heraclio. Gustav scares the army away, while Heraclio and Blucher engage in a duel which ends with Blucher being stabbed. Justin then duels with Heraclio. The two get stuck on a watermill above a waterfall where they fight over Sir Roland's sword. Heraclio slips and falls to his death while Justin retrieves the sword. Blucher is on the brink of death due to the wound and Justin and Melquiades use the same healing leaves from before on Blucher, proving Justin has become a true knight.\nThe Queen then gives Justin the title of Sir Justin and praises him for his bravery. She decides to re-establish the outlawed knights by signing a new contract. Reginald is hesitant at first, as he fears that his son would follow the same fate as his father but signs the contract asit would make his son happy. While it seemed as though Justin still has feelings for Lara, he returns the sock she had given him and then turns her down much to her disappointment and surprise, as she was starting to like him. He then turns to Talia and tells her that he wants her to continue accompanying him on quests, as he has realized that she is the girl whom he truly loves. Talia happily accepts and shares a romantic kiss with Justin. At the abbey, the monks have finished creating a statue of Justin in the Hall of Knights. A wall is then torn down revealing another hall for future knights."}