{"mid": "K9", "IMDB_id": "tt0097637", "title": "K-9", "plot": "San Diego Police Detective Michael Dooley leaves his car to contact his girlfriend, Tracy, when a helicopter suddenly appears and opens fire on his car, which ignites. Presuming him dead, the assassins leave the scene. At the police station, Dooley argues with his lieutenant, refusing to take a partner; instead, he decides to get a police dog. At home, he finds Tracy with another man and spends the night in his new car. The next day, Dooley coerces Freddie, an informant, into revealing that the drug lord Ken Lyman is responsible for the attack. Dooley is assigned a German Shepherd named Jerry Lee, whom he dislikes.\nDooley and Jerry Lee head to a warehouse assumed to be filled with drugs. When Jerry Lee does not follow Dooley's orders, the workers laugh at him. Dooley is forced to leave after Jerry Lee finds only a cigarette when commanded to find drugs. The duo drive to a pub where Dooley stakes out Benny the Mule in an attempt to charge Lyman. When his cover is blown, Jerry Lee saves Dooley from a beating; with the dog's help, Dooley subdues Benny and learns the location of Lyman's next shipment. Meanwhile, Lyman kills Freddie and demands that his henchman Dillon kill Dooley before the shipment arrives.\nAt Dooley's apartment, Jerry Lee steals the spotlight after Tracy accepts Dooley's story that he rescued the dog from the streets. The next day, Dooley and Jerry Lee bond when they eat together and spy on Lyman. The two are nearly killed when someone shoots at them, and the two chase the assailant to an empty building. Jerry Lee leads Dooley to the man, who falls to his death after a fistfight with Dooley. In the man's car, Dooley finds a clue that leads him to an auto-dealer shop. There, Jerry Lee identifies a red Mercedes owned by Lyman, and Dooley learns from Halstead, the owner of the dealership, that he works for Lyman. Later, Jerry Lee falls in love with a poodle to the disapproval of its owner.\nWhen Dooley returns home, he discovers Lyman has kidnapped Tracy. Infuriated, Dooley crashes a party at Lyman's mansion and demands her return. Lyman pretends to know nothing, and Dooley is arrested by an officer from his own department and put in a squad car. Angry, Dooley's lieutenant calls him crazy. When Jerry Lee's flatulence annoys the other officers, Dooley uses it to his advantage and escapes with the dog. As Dooley tells Jerry Lee how he met Tracy, he spots a truck driven by Halstead that is pulling a trailer with Lyman's Mercedes. Dooley purses the truck, and Halstead blows a tire. After Halstead shoots at Dooley, Jerry Lee kills Halstead.\nMeanwhile, in a stranded desert in San Diego, Lyman holds Tracy hostage in his limo and becomes suspicious when Halstead is late. Dooley arrives with the truck and trailer, which is revealed to be the next shipment of drugs. Not worrying about the case anymore, Dooley orders Lyman to surrender his girlfriend to him, or he will blow up the truck. Lyman calls Dooley's bluff, and a shootout ensues. Dooley kills Lyman's henchmen Dillon and Jerry Lee chases Lyman as he runs for his helicopter. Unable to outrun the dog, Lyman shoots Jerry Lee; enraged, Dooley shoots and kills Lyman. Dooley and Tracy rush Jerry Lee to a hospital, where the reluctant surgeon operates. In the recovery room, Dooley delivers a eulogy to Jerry Lee, not knowing that he is alive. When the surgeon tells him he is going to be fine, Dooley responds in anger, thinking he was speaking to a dead dog. Jerry Lee licks Dooley's face out of love, making him give in.\nTo take a break from police work, Dooley, Tracy, Jerry Lee, and a poodle spend a vacation together in Las Vegas."}