{"mid": "Kagemusha", "IMDB_id": "tt0080979", "title": "Kagemusha", "plot": "In Japan's Sengoku period, Takeda Shingen, daimyō of the Takeda clan, meets with his brother Nobukado, and an unnamed thief whom the latter met by chance and spared from crucifixion due to the thief's uncanny resemblance to Shingen. The brothers then agree that he would prove useful as a double, and they decide to use the thief as a kagemusha.\nLater, Shingen's army has besieged a castle of Tokugawa Ieyasu. When Shingen visits the battlefield to hear a mysterious nightly flute player, he is shot by a sniper. Mortally wounded, he orders his generals to keep his death a secret for three years. Shingen later dies while being carried over a mountain pass, with only a small group of witnesses. Meanwhile, Shingen's rivals Oda Nobunaga, Tokugawa Ieyasu, and Uesugi Kenshin are each shown contemplating about Shingen's supposed passing.\nNobukado presents the thief to Shingen's generals (many of the renowned Twenty-Four Generals of Takeda Shingen), proposing to have this kagemusha impersonate Shingen full-time. At first, even the thief is unaware of Shingen's death, until he tries to break into a huge jar, believing it to contain treasure, and instead finds Shingen's preserved corpse. After this act, the generals decide they cannot trust the thief and set him free.\nThe Takeda leaders secretly dump the jar with Shingen's corpse into Lake Suwa. Spies working for Tokugawa and his ally Nobunaga Oda witness the disposal of the jar and, suspecting that Shingen has died, go to report the death. The thief, however, overhearing the spies, goes to offer his services, hoping to be of some use to Shingen in death. The Takeda clan preserves the deception by saying they were making an offering of sake to the god of the lake.\nThe spies follow the Takeda army as they march home from the siege. Although they suspect that Shingen has died, they are later convinced by the kagemusha's performance.\nReturning home, the kagemusha successfully fools Shingen's concubines and grandson. By imitating Shingen's gestures and learning more about him, the kagemusha begins to take on the persona of Shingen, and is able to impress bodyguards and fool Takemaru, Takeda Katsuyori's son and Shingen's grandson, who was very close with Shingen. When the kagemusha must preside over a clan council to plan how to respond to provocative attacks made by Tokugawa against Takeda border castles, he is instructed by Nobukado to not speak until Nobukado brings the generals to a consensus, whereupon the kagemusha will simply agree with the generals' plan and dismiss the council. However, Katsuyori is incensed by the general's decision to have an impostor play the role of his late father, instead of allowing him to inherit the leadership of the clan. Katsuyori thus decides to deliberately infuriate the generals by testing the kagemusha in front of the council, as the majority of the attendants are not aware that Shingen is dead. Katsuyori directly asks the kagemusha what course of action the \"lord thinks\" should be taken. After a long moment of tense silence, the kagemusha replies, \"Do not move. A mountain does not move.\" before concluding the meeting, a reference to the motto on the fūrinkazan standard which identifies Shingen with an immovable mountain. The kagemusha's convincing improvisation further impresses the generals and secures their confidence in the kagemusha as well as further reinforcing the hostility between Katsuyori and the rest of the clan leadership.\nIn 1573, Oda Nobunaga is mobilizing his forces to attack Azai Nagamasa, continuing his campaign in central Honshu to maintain his control of Kyoto against the growing opposition of a coalition of rival clans, which it is feared the Takeda will align themselves with. When the Tokugawa and Oda clans launch an attack on Takeda territory, Katsuyori begins a counter-offensive against the advice of other generals. The kagemusha is forced to lead reinforcements to the 1574 Battle of Takatenjin, and helps inspire the troops to victory.\nIn a fit of overconfidence, the kagemusha attempts to ride Shingen's spirited horse. When he falls off, those who rush to help him see that he does not have their lord's battle scars, and he is revealed as an impostor. The thief is driven out of the palace in disgrace, and Katsuyori takes over the clan. Oda and Tokugawa, sensing weakness in the Takeda clan leadership, are emboldened to begin a full-scale offensive into the Takeda homeland to permanently remove the clan as an obstacle to their further expansion.\nNow in full control of the Takeda army, Katsuyori leads the counter-offensive against Nobunaga, resulting in the Battle of Nagashino. Wave after wave of attacking Takeda cavalry and infantry are cut down by volleys of arquebus fire from Oda troops deployed behind wooden stockades, effectively eliminating the Takeda army. The exiled kagemusha, who has followed the Takeda army, witnesses the slaughter. In a final show of loyalty, he takes up a spear and makes a futile charge against the Oda lines. Mortally wounded, the kagemusha attempts to retrieve the fūrinkazan which had fallen into a river, but succumbs to his wounds as he wades into the water, grasping for the standard. His body floats past it as the film concludes with a long shot of the sunken fūrinkazan as the credits roll."}