{"mid": "Karla", "IMDB_id": "tt0424938", "title": "Karla", "plot": "This movie--based on a true story that shocked Canadians and dominated headlines--opens in Oct 2000 with Karla Homolka approaching the 8 year mark of a 12 year manslaughter sentence and up for parole. Under Canadian law, parole would usually be virtually automatic, but Karla's case is no ordinary case. Karla has been sent to Saskatoon to meet with a prison appointed psychiatrist, Dr. Arnold, to evaluate her suitability for parole. Most of the movie is told from the vantage point of Karla and Dr. Arnold examining the past actions that landed her in prison with a view to making a decision on parole.Karla begins by discussing how she and her ex-husband Paul Bernardo first met. At age 18, Karla is working in a veterinary clinic and is sent to Toronto by her employer to attend a veterinary convention. However, she is also interested in meeting men. Karla and a female colleague are in a hotel restaurant when they are approached by Paul and a male friend. There is an almost immediate strong attraction between Paul and Karla, and they soon find themselves making love in Karla's hotel room. Karla's colleague and Paul's friend are also in the room and feel quite uncomfortable.Karla and Paul begin a relationship which, at first, seems quite happy and successful. Karla gives Paul a pair of handcuffs for use in sex play. However, while having sex, Paul introduces the possibility that he might be a rapist. In looking back at this incident with Dr. Arnold, Karla claims she thought this was just innocent sex talk on Paul's part.Paul's true meaning, however, is quickly shown to the viewer to be something far more sinister: Paul is, in fact, the notorious Scarborough rapist, who has been terrorizing women with frequent and brutal assaults. However, the police and the general public do not yet know the true identity of the Scarborough rapist, and Karla also claims not to have known at this time. A police sketch of the Scarborough rapist is published in a Toronto newspaper. This looks enough like Paul that people who know him report him. Paul is brought in for questioning, but denies committing the assaults and agrees to provide a DNA sample. We aren't immediately told the outcome of the DNA testing.Meanwhile Paul has developed a sexual interest in Karla's younger sister, Tammy. This arouses Karla's jealousy, especially on one occasion one summer when Paul and Tammy disappeared on their own--with Karla absent--for many hours, with their exact activities being kept secret from Karla (and the viewer). In recollecting these events, Karla is reluctant to be fully candid and is reminded by Dr. Arnold that she must be truthful to get parole. Paul gradually reveals that he has truly depraved plans for Tammy: he is attracted to Tammy because she is believed to be a virgin, but he claims that Karla is still the one he loves. Nevertheless he wants to take Tammy's virginity, but not have Tammy know. He concocts a plan to rape Tammy while she is unconscious, using drugs stolen from Karla's clinic.Although reluctant, Karla eventually agrees to participate, and Paul and Karla film their assault on the unconscious Tammy. Poor performance by Karla in making the video leads to physical abuse by Paul. The results of the assault are tragic: Tammy succumbs to the drugs and dies, with Paul and Karla able to successfully pass the death off as 'accidental' to the authorities.Paul and Karla then move into a new house, with Paul's income from an illegal smuggling operation helping to pay the rent. They get a dog, Buddy, and Karla is beaten by Paul when she doesn't clean up the dog's mess fast enough. Paul's physical abuse of Karla increases, and he continues to rape women. He is also trying to start a career as a rap musician, and Karla enjoys this more positive side to Paul. After a trip to Florida, described by Paul as his one last bachelor fling, he returns to their home in St. Catherine's and continues planning their upcoming wedding--although he briefly considers leaving Karla for a woman named Tracy he met in Florida.Prowling alone late at night in another neighborhood, Paul encounters a teenage girl, Tina, and kidnaps her at knifepoint. He brings her home and, both alone and with Karla, sexually assaults Tina and films the assault. Tina begs for her life and to be reunited with her younger brother. After she accidentally opens her eyes, Tina can see and potentially identify Paul and Karla. Paul and Karla confer and agree they have to kill Tina to avoid being caught. Paul strangles her and the next day proposes a plan to dispose of the body.The body is cut into pieces and then encased in cement and disposed of. Karla considers leaving Paul but is too obsessed with her wedding to do so. Paul and Karla get married shortly thereafter and honeymoon in Hawaii--where Karla says she endured a further beating from Paul. They return to Canada to the news that they didn't hide the body as well as they thought: it has been found and identified.Paul and Karla decide to lie low for awhile, with the couple hosting a party for their friends. Karla goes to bed early and Paul decides to have sex with--or possibly rape--another female houseguest. Paul's poor behavior provokes a fight and causes him to lose friends--and Paul doesn't care that he is gradually losing his friends.About a year passes, and Paul and Karla are out driving and encounter a teenage girl, Kaitlyn, whom they decide to kidnap. They do so, but the crime scene is later identified by the presence of a shoe that Kaitlyn loses in the struggle. As with Tammy and Tina, they assault Kaitlyn at their home and film the assault. Paul also forces Kaitlyn to refer to herself in very degrading terms on video. She does so for awhile, but is also at times quite defiant, calling Paul a 'bastard'. Paul beats both Kaitlyn and Karla and leaves for awhile. With Paul absent, Kaitlyn tries to persuade Karla that Karla is herself a victim of Paul and they should both leave. Although Karla admits that Paul beats her regularly, she says Kaitlyn doesn't understand the situation.Kaitlyn is therefore unsuccessful in getting Karla to let her go. After his return, Paul forces Kaitlyn to watch television coverage of her kidnapping and then murders her.Paul becomes overconfident when he hears news coverage of the murder investigation, thinking that the detectives are pursuing false leads. His ego is deflated, however, when police arrive at his home to investigate the murder. Although the detectives lack sufficient evidence to make an arrest, Paul is believed by Karla to be really scared by this point. Paul is also nearly caught crossing the border, accompanied by Karla, with smuggled cigarettes. Although they avoid being caught, something about her responses to the border guard anger Paul, and he beats her again. His beatings are becoming significantly more vicious as time goes on.After enduring yet another beating, Karla reaches out to an older pair of friends, and is nearly persuaded to leave Paul. Eventually Paul gets her to stay, but he beats her again, and locks her in the cellar which Karla believes is haunted by Tina's ghost. With the bruising from the beatings now very obvious, friends at work convince Molly and Dan--Karla's older friends--to get involved. They do and Karla finally leaves Paul. Paul is arrested--but only for the beating of Karla--and is released after one day.However, the police attention renews their interest in Paul, and he is now the main suspect in the murders. Paul and his home are put under 24 hour surveillance. He is also positively identified by DNA evidence as the Scarborough rapist at about the same time. One of Paul's last remaining male friends, Doug, visits and implores Paul to clean up his act. In response Paul claims that Karla murdered Tammy and threatens to expose her involvement.In denial as to her own level of involvement in the crimes, Karla tries to start a new life with a new man she meets and with whom she has a brief relationship. The net finally closes in on Paul and he is arrested for the murders and rapes. Karla is named as a suspect wanted for questioning, and Karla realizes she won't be able to rebuild her life so easily.In court, with Paul on trial, Paul admits to many of the crimes but denies involvement in the murders. Karla testifies otherwise. Paul is convicted of all charges and gets life without parole, whereas Karla gets 12 years in a plea bargain.The scene then returns to Oct 2000 and Dr. Arnold's discussions with Karla about parole. Karla asks whether Dr. Arnold believes she is responsible for the murders, especially Kaitlyn's. Dr. Arnold claims to be interested only in what she may do in the future, not what she did do in the past--although this is a bit incongruous since most of their discussion has focused on the past.Karla then gives her own conclusion about her level of responsibility: she still denies killing Kaitlyn or Tina but admits to killing Tammy. Karla is denied parole and is released on July 4, 2005 after serving out the balance of her sentence."}