{"mid": "KeepingMum", "IMDB_id": "tt0444653", "title": "Keeping Mum", "plot": "In the opening scene, as pregnant young Rosie Jones (Emilia Fox) rides on a train, her very large trunk starts leaking blood. When questioned by the police, she calmly reveals that the two dismembered bodies inside are of her unfaithful husband and his mistress. She is then sentenced by the judge (Roger Hammond) to a secure unit for the criminally insane for manslaughter on the grounds of diminished responsibility.\nForty three years later, in the village of Little Wallop, Walter Goodfellow, the vicar (Rowan Atkinson) is very busy writing the perfect sermon for a convention, having no idea about the problems in his house, which include the unfulfilled emotional needs of his wife Gloria (Kristin Scott Thomas) who subsequently starts an affair with her golf instructor, Lance (Patrick Swayze); the sexual desires and growing maturity of his teenage daughter Holly (Tamsin Egerton) who constantly picks up new boyfriends; and son Petey (Toby Parkes) who is bullied by schoolmates. Then everything changes with the arrival of the new housekeeper Grace (Maggie Smith).\nGrace is installed into their lives and learns about some of the problems in the house – neighbour Mr Brown's nuisance barking Jack Russell terrier, Clarence, who consistently disturbs Gloria's sleep; the bullying of Petey; and Gloria and Lance's affair. Grace resolves to solve these problems in her own way. She first kills Clarence the Jack Russell, and when his owner finds out that his dog has been killed, she kills him, too. She sabotages the bullies' bicycles, injuring one of them and thereby making Petey very happy.\nShe catches the golf instructor outside the house one night, videotaping Holly undressing, and kills him with an iron. While Walter is preparing his sermon for the conference, Grace introduces him to having a sense of humour to his religion and also teaching him that he can still love his wife as well as God by drawing his attention to the erotic references in the Song of Solomon. As the problems in the household seem to be gradually clearing, Walter leaves for his convention.\nGrace is discovered when Gloria and Holly see her picture on the television in a news item mentioning her release and previous offences. It is then that Grace reveals that she is Gloria's long-lost mother, Rosie Jones, explaining why she came to Little Wallop in the first place. Gloria argues that when having a problem with someone, one cannot just kill them. Grace remarks that this is the one thing she and her doctors could never agree on. Despite their disagreements, Gloria tries to help Grace remove Lance's body, but cannot face up to it. Over a cup of tea, the three women decide not to tell Walter or Petey any of what has happened.\nWhen nagging congregant Mrs Parker (Liz Smith) comes over to discuss the problem of the church flower arranging committee, Grace, under the impression that Mrs Parker is about to turn them in, attempts to hit her over the head with a frying pan, but is prevented by Gloria. Mrs Parker, shocked by the murder attempt, has a heart attack and dies. Walter returns from the convention just then and sees Mrs Parker's body, but doesn't realise she is dead. Soon after this, Grace leaves the family when order seems to be restored among them.\nAt the end of the film, Walter is talking to Bob and Ted, the water works employees, about the pond at the Vicar's house. They say that there is too much algae and the pond needs to be drained. Remembering that Grace disposed of her victims in the pond, Gloria, with a disturbingly cheerful expression, offers the two men some tea. The film closes with an underwater shot depicting the bodies that had been placed in the pond, including the recently added bodies of Bob and Ted."}