{"mid": "Keith", "IMDB_id": "tt0435679", "title": "Keith", "plot": "The film begins with Natalie (Elisabeth Harnois) lying in the back of a yellow ute, which is about to roll off a cliff. When the ute is just about to fall off the edge, Natalie wakes up from a dream. The next scene is of Keith (Jesse McCartney) speaking to Al (Tim Halligan), in an informal manner.The film progresses with Natalie in her chemistry class. The class is being assigned lab partners; Natalie is assigned Keith, who is not in class at the time, but turns up mysteriously late. After having a short conversation, Natalie and Keith begin to argue due to Natalie wanting to focus on her future whereas Keith wants to focus on the present; they have different views on life, and Natalie is angered by this argument and requests a partner change from the teacher, but her request is refused. After this, Natalie bonds with boyfriend Raff (Ignacio Serricchio). She later parties with other students at The Brick (an outdoors place where students go to have fun).Realizing that she has a lab report due the next day, Natalie goes to find Keith to help her with it. While helping her with the lab report, Keith takes her into his carefree life and goes to an office building to do their report. Throughout this time, Keith and Natalie become closer. Keith reveals to Natalie that he lives at an old white house with the big porch, which she likes. She even pushes aside Raff to be with Keith. Later in the day, more of Natalie's life is revealed; she is also a talented tennis player currently ranked 14th (presumably in the state). Later in the evening, she is at The Brick again with Raff.Keith persistently asks Natalie to go out with him as friends. He takes Natalie to a few places and talks to her about random things, which she learns to get used to. As time goes on, the two continue to hang out in this fashion and become closer and closer. One night, Keith decides to send a part of a car engine to Natalie's house while she is with Raff, which she is angered by. They have an argument, when in the middle of it, Al and Billy (a child neighbor of Keith's) turn up. Billy speaks to Keith about bonding with him, which causes Natalie to think that Keith is \"a softy\" and to get back into the car with him. After driving for a short while, Natalie tells Keith to turn into a dirt road, which just so happens to be Keith's favorite spot; a cliff overlooking The Brick, separated by a river. They sit down and talk, afterwards exchanging a small kiss. The next day, Raff asks Natalie to go to The Brick, but she says she does not feel like it. Instead of going to The Brick, Natalie decides to go to the cliff she went to with Keith. She has become comfortable wearing Keith's jacket at times when alone with him, and discusses with him their future dreams. While Keith and Natalie talk while lying down in the back of the ute, Natalie notices that the ute is moving. She panics and gets out of it, trying to stop it as she screams at Keith to jump to safety. Keith, however, remains lying down, relaxed and rambling on, despite the fact that he is about to roll off a cliff. Just before rolling off, Keith swiftly moves into the driver's seat and hits the brakes. Natalie is furious with Keith and asks him if he wanted to kill himself. When Natalie gets home, she is still wearing Keith's jacket and finds antidepressants in his pocket.The following day at school, Natalie wants to speak to Keith about the medication, but he is not at school, nor is he there the day after that. Because of his absence, Natalie begins to worry and becomes slightly depressed. She tries to get his contact details from the school, but the school does not allow it. Natalie then remembers that Keith said he lived at the old white house, and decides to go visit. But it turns out that Keith lied to her about his residence. Because of Keith's mysterious disappearance, Natalie begins to lose her tennis matches, which is her key to a scholarship at Duke University.Two weeks later, Keith appears just as mysteriously as he had disappeared. Natalie is irritated about the lies he fed her. She decides to find out his real address by breaking into his locker. As a result, she is suspended from school for a week. Her friends all believe that Keith is trying to destroy her life, but she disagrees. Without anyone to turn to, and without anywhere to go, Natalie decides to go visit Keith at his house. There, she meets his father and finds out that Keith also lied to her about his family (his siblings and his deceased mother). Keith refuses to come out of his room to see her. Desperate to talk to Keith, Natalie hides in the back of his ute. Later that night, Keith comes out of the house and drives off to his favorite clifftop. While there, Natalie expresses her love for him, and they end up having sex in the back of the ute. While Keith drives Natalie home, Natalie is excited to begin an official romantic relationship with Keith, but Keith says that what happened between them that night was just for fun and is not something to make a big deal about, which infuriates Natalie.In the next few scenes, Natalie's downfall, from her perfect life to a life filled with sadness and confusion, is apparent. Her tennis rankings have dropped, and she is on the verge of losing her scholarship opportunity. In addition, she dumps her boyfriend Raff. While driving without an idea of where she is going, Natalie sees Al (the man Keith talked to at the opening of the film), who was Keith's counselor, and asks him about Billy (the boy she watched talk excitedly with Keith the first night she and Keith went to the cliff), and it turns out that Billy died because of cancer and Billy knew Keith because they went to chemotherapy treatment together. Natalie finally realizes that Keith is dying of cancer, and is informed that he does not have much longer to live. She tries to go to Keith's house again to talk to him, but she is rejected once again. Then, one night, Keith mysteriously appears at her house offering to go bowling with her. On the way to go bowling, Natalie leads Keith to the airport so that he can follow his dreams, telling him the sky is the limit. At the airport, after some resistance, Keith finally expresses his true feelings for Natalie, and Natalie tells Keith that she wants to be with him even though he will die one day soon. They kiss and embrace.The film then cuts to when Natalie graduates; Keith is not mentioned and has presumably died from cancer. Throughout the film Natalie has changed. She has almost become a replica of Keith; she has become a grease monkey, loves the yellow ute. There is a scene where Natalie is fixing the truck with Keith's father. The film cuts back to its first scene, where Natalie is slowly rolling towards the edge of the cliff. Just before falling off, she swiftly, like Keith did, jumps into the driver's seat and hits the brakes. Afterwards, Natalie drives to an intersection on the way to London, Ontario where there is a classic truck festival held each year. Attending the festival is what Keith always dreamed of. A long aerial shot of the yellow ute drives away as the film ends."}