{"mid": "KellysHeroes", "IMDB_id": "tt0065938", "title": "Kelly's Heroes", "plot": "During a thunderstorm in early September 1944, units of the 35th Infantry Division are nearing the French town of Nancy. One of the division's mechanized reconnaissance platoons is ordered to hold their position when the Germans counterattack. The outnumbered platoon also receives friendly fire from their own mortars.\nPrivate Kelly, a former lieutenant scapegoated for a failed infantry assault, captures Colonel Dankhopf of Wehrmacht Intelligence. Interrogating his prisoner, Kelly notices the officer's briefcase has several gold bars disguised under lead plating. Curious, he gets the colonel drunk and learns that there is a cache of 14,000 gold bars, worth $16,000,000, stored in a bank vault 30 miles behind enemy lines in the town of Clermont. When their position is overrun and the Americans pull back, a Tiger I kills Dankhopf.\nKelly decides to go after the gold. He visits the opportunistic Supply Sergeant \"Crapgame\" to obtain the supplies and guns that will be needed for the operation. A spaced-out tank platoon commander known as \"Oddball\" and his three M4 Sherman tanks from the 6th Armored Division invite themselves into the plan. With their commanding officer, Captain Maitland, busy pursuing opportunities to enrich himself and thus severely neglecting the welfare of his troopers, the men of Kelly's platoon are all eager to join Kelly. After much argument, Kelly finally persuades cynical Master Sergeant \"Big Joe\" to go along.\nKelly decides that his infantrymen and Oddball's tanks will proceed separately and meet near Clermont. Oddball's tanks fight their way through the German lines, managing to destroy a German railway depot, but their route is blocked when the bridge they need to cross is blown up by Allied fighter-bombers. This forces Oddball to bring a bridging unit in on the caper. An American fighter plane mistakes Kelly's group for the enemy, destroying their vehicles and forcing them to continue on foot. They stray into a minefield, and Private Grace is killed. Kelly's troops engage an enemy patrol; Private Mitchell and Corporal Job, still stuck in the minefield, are killed.\nThe two units rendezvous two nights later. They battle their way across the river to Clermont, losing two of the three tanks and leaving the bridging unit behind. When intercepted radio messages from the private raid are brought to the attention of the gung-ho Major General Colt, he misinterprets them as the efforts of aggressive patrols pushing forward on their own initiative and immediately rushes to the front to exploit the \"breakthrough\".\nKelly's men find that Clermont is defended by three Tiger tanks of the 1st SS Panzer Division with infantry support. The Americans are able to eliminate the German infantry and two of the Tigers, but the final tank parks itself right in front of the bank and Oddball's Sherman breaks down, leaving them stalemated. At Crapgame’s suggestion, Kelly offers the German tank commander and his crew an equal share of the loot.\nAfter the Tiger blows the bank doors open, the Germans and Americans divide the spoils and go their separate ways, just barely managing to avoid meeting the still-oblivious General Colt, who is blocked from entering Clermont by the French residents who have been deceived by Big Joe into thinking that General Charles de Gaulle is coming. Not long after the freelancers have gone, Captain Maitland enters the bank, to find a Kilroy and the words \"Up Yours, Baby\" painted by one of Kelly's crew on the wall."}