{"mid": "KenPark", "IMDB_id": "tt0209077", "title": "Ken Park", "plot": "The opening of the film depicts teenager Ken Park (nicknamed \"Krap Nek\", which is his first and last name spelled and pronounced backward) skateboarding across Visalia, California. He arrives at a skate park, where he casually sits in the middle of it, sets up a camcorder, smiles, and shoots himself in the temple with a handgun. His death is used to bookend the film, which follows the lives of four teens who knew him in the weeks running up to his suicide.\nShawn is the most stable of the four main characters. He's polite and caring. Throughout the story, he has an ongoing sexual relationship with his girlfriend's mother, Rhonda. He casually socializes with her family, who are all completely unaware of the affair, including his girlfriend.\nClaude fends off physical and emotional abuse from his alcoholic father while trying to take care of his neglectful pregnant mother, who never does anything to defend him. Claude's father detests him for being insufficiently manly. However, after coming home drunk one night, he attempts to perform oral sex on Claude, prompting the boy to run away from home.\nPeaches is a girl living alone with her obsessive and overly-religious father, who fixates on her as the embodiment of her deceased mother. When her father catches her and her boyfriend Curtis on her bed about to have sex, he beats the boy and savagely disciplines her, including forcing her to participate in a quasi-incestuous wedding ritual with him.\nTate is an unstable and sadistic adolescent living with his grandparents, whom he resents and frequently abuses verbally. He is shown engaging in autoerotic asphyxiation during masturbation. He eventually kills his grandparents in their bed, in retaliation for his grandfather \"cheating\" at Scrabble and his grandmother for \"invading his privacy\". He finds that the act arouses him sexually. He records himself on his tape recorder so the police will know how and why he killed his grandparents. After finishing recording, he puts his grandfather's dentures in his mouth, lies naked in his bed, and falls asleep.\nThe film cuts frequently between subplots, with no overlap of characters or events until the end. As Tate is arrested for his grandparents' murder, Shawn, Claude, and Peaches meet and have sex as a threesome, while Gary Stewart plays. The ending finally reveals the motive behind Ken Park's suicide: he has impregnated his girlfriend, who responds to his suggestion of an abortion by asking if he wishes he'd been aborted himself. Realizing that he'd rather never have been born, he sets out to the skate park to kill himself."}