{"mid": "KevinAndPerryGoLarge", "IMDB_id": "tt0205177", "title": "Kevin & Perry Go Large", "plot": "The film begins at the beheading of Anne Boleyn, which turns out to be an erotic daydream, introducing protagonist Kevin, who is having sexual fantasies when he's supposed to be doing his homework about Boleyn.\nKevin has tried to lose his Virginity for three years. He and his best friend, Perry go to a newsagent's to buy a pornographic magazine, which results in failure, as do all of Kevin's attempts at sexual exploration.\nThe boys come up with the idea to go to Ibiza to become DJs and get \"guaranteed Sex\", but Kevin's parents Ray and Sheila (James Fleet and Louisa Rix) forbid the trip due to Kevin's bad grades on his school report. As a compromise however, they tell the boys they can make the trip on the condition that they get a job to pay for it.\nThe boys search fruitlessly for a job, ending up at a house party where Kevin again tries to succeed in finally having sex, and again fails.\nHaving failed miserably at all his attempts at success with women and gainful employment, Kevin is asked to sign for the delivery of his dad's Credit card. Kevin then takes the card to the bank to steal the money for the flights from his dad's bank account. At the bank, Kevin accidentally foils a bank robbery, and the manager awards Kevin and Perry with enough cash to make the trip. With that, they plan for their holiday in Ibiza.\nOnce in Ibiza, the boys spot the 'girls of their dreams' Candice (Laura Fraser) and Gemma (Tabitha Wady). They also meet Eye Ball Paul (whose nickname derives from his practice of vodka eyeballing). The boys spend the day with the girls and although they are unsuccessful at having sex with them, they do begin to bond with them as friends.\nThat night, the boys walk down the high street filming the events around themselves. Kevin then films a couple snogging which turns out to be Ray and Sheila. Kevin sulks while he and Perry hang out with Ray and Sheila, finally ending up at the club \"Amnesia\" where they dance the night away. Their new friends, Candice and Gemma are refused entry by the doorman (Paul Whitehouse), citing their appearance as a reason.\nThe next day, the boys go to Paul's where he makes them clean his house in return for his listening to their tapes. Leaving Paul's house, they spot Candice and Gemma, but again their clumsy attempts at wooing them end up in failure.\nAfter the girls have a makeover, they are admitted to Amnesia with Kevin and Perry. However, events again conspire to ruin their chance at romance with the girls. Later, Perry videotapes Ray having sex with Sheila. The following day, Paul listens to their music as the boys clean his kitchen. He stumbles across the taping of Ray and Sheila and shows it to everyone, resulting in Kevin ending his friendship with Perry after realizing he was responsible for filming them.\nAfter a day of Kevin and he sulking around unhappily, Perry runs into Paul, who tells him that he likes their song, and that he will play it in the club. Perry tells Kevin the good news and the friends reconcile. That night they and the girls go to the club again. Their song is played but Ray and Sheila (who wanted to visit the club) are humiliated as the sex tape was used by Paul in the creation of the song. Nevertheless, the song becomes an instant club favourite. Paul becomes unhappy at Kevin and Perry's success, and turns off the song and makes the crowd angry. Kevin and Perry then take over as DJs with the club dancing through the night. The next day, Kevin and Perry finally lose their virginity to Candice and Gemma on a beach with other couples engaged in intercourse.\nIn the Epilogue, the boys are seen signing copies of their record in a music shop, whilst Kevin's parents are seen signing copies of a video they have made about better mid-marriage sex."}