{"mid": "Khartoum", "IMDB_id": "tt0060588", "title": "Khartoum", "plot": "In 1883, in the Sudan, a force of 10,000 poorly trained Egyptians under the command of British Col. William \"Billy\" Hicks (Edward Underdown) is lured into the desert and slaughtered by Muslim zealots led by Muhammad Ahmad (Laurence Olivier), a fanatic Sudanese Arab who believes he is the Mahdi, the prophesied \"expected one of Mohammed.\" The British Prime Minister William Ewart Gladstone (Ralph Richardson), who does not wish to send more military forces to Khartoum, is under great pressure to send military hero Major General Charles George Gordon (Charlton Heston) there to salvage the situation and restore British prestige. Gordon has strong ties to Sudan, having broken the slave trade there in the past, but Gladstone distrusts him. Gordon has a reputation for strong, if eccentric, religious beliefs and following his own judgement, regardless of his orders. Granville Leveson-Gower, 2nd Earl Granville, the British foreign secretary (Michael Hordern), knowing this, tells Gladstone that by sending Gordon to Khartoum, the British government can ignore all public pressure to send an army there, and absolve themselves of any responsibility over the area if Gordon ignores his orders. Gladstone is mildly shocked at the suggestion, but as it is popular with the public and Queen Victoria, he adopts it for the sake of expediency.\nGordon is told that his mission, to evacuate troops and civilians, is unsanctioned by the British government, which will disavow all responsibility if he fails. He is given few resources and only a single aide, Colonel J. D. H. Stewart (Richard Johnson). After an attempt to recruit former slaver Zobeir Pasha (Zia Mohyeddin) fails, Gordon and Stewart travel to Khartoum, where Gordon is hailed as the city's savior upon his arrival in February 1884. He begins organising the defences and rallying the people, despite Stewart's protests that this is not what he was sent to do.\nGordon's first act is to visit the Mahdi in his insurgent camp, accompanied by only a single servant. He gains the Mahdi's respect and, in the verbal fencing at the parley, discovers that the rebel leader intends to make an example of Khartoum by taking the city and killing all its inhabitants. The River Nile city of Khartoum lies at the confluence of the White Nile and the Blue Nile. A qualified military engineer, Gordon wastes no time upon his return in digging a ditch between the two to provide a protective moat.\nIn Britain, Gladstone, apprised of how desperate the situation has become, orders Gordon to leave, but, as he had feared, his command is ignored. Over the next several months, a public outcry forces Gladstone to send a relief force, but he sees to it that there is no urgency, hoping to the last that Gordon will come to his senses and save himself.\nGordon, however, has other ideas. When the waters recede in winter, drying up his moat, the small Egyptian army is finally overwhelmed by 100,000 Mahdist tribesmen. On 26 January 1885, the city falls under a massive frontal assault. Gordon himself is killed along with the entire garrison and populace of some 30,000, although the Mahdi had forbidden killing Gordon. In the end, Gordon's head is cut off, stuck on top of a long pole, and paraded about the city in triumph, contrary to the Mahdi's injunctions.\nThe film ends with another narration by Leo Genn explaining the aftermath. The relief column arrived two days too late.\nThe British withdrew from the Sudan shortly thereafter, and the Mahdi himself died six months later, but in the United Kingdom, public pressure and anger at the fate of Gordon finally forced the British to re-invade the Sudan ten years later, where they recaptured Khartoum in 1898."}