{"mid": "Kids", "IMDB_id": "tt0113540", "title": "Kids", "plot": "The film opens with Telly (Leo Fitzpatrick) and a 12-year-old girl making out on a bed. With no adults around, Telly, who is slightly older, persuades the girl, who is a virgin, to have sex with him. Afterwards, he meets his friend, Casper (Justin Pierce), and they talk about his sexual experience very crudely. Telly has taken to only having sex with virgins. They go inside a local store, where Casper shoplifts a bottle of malt liquor as Telly distracts the cashier. Looking for drugs, food and a place to hang out, they head to their friend Paul's (Sajan Bhagat) apartment, though they express dislike of him on the way there. They arrive at Paul's house, talk about sex and smoke marijuana while watching a skate video (Video Days). Casper inhales nitrous oxide out of balloons, which Telly considers dangerous. The scene intercuts with a group of girls, among them Ruby (Rosario Dawson) and Jennie (Chloë Sevigny), talking about sex—each gender contradicting what the other gender says, especially about oral sex.\nRuby and Jennie mention that they were recently tested for STDs at Ruby's request, though Jennie only got tested to keep Ruby company. Ruby's test is negative, though she has had multiple sexual encounters, many of them unprotected. Jennie tests positive for HIV. She says she has had sex only once, with Telly. Jennie spends the rest of the film trying to find Telly, to prevent him from unknowingly passing it on. Telly and Casper walk to Telly's house and steal money from Telly's mother, who is preoccupied with taking care of her new baby. They go to Washington Square Park and buy a dime bag of marijuana from a Rastafari. They then meet up with a few friends to talk and smoke, one of whom gives a blunt-rolling tutorial. As they do, Casper and many others taunt a gay couple passing through the park. On the side, Telly briefly talks to Misha, a girl who strongly dislikes Casper, calling him a jerk. As Casper rides on a skateboard, he carelessly bumps into a man, who furiously threatens him. He pushes Casper, but is struck in the back of the head with a skateboard by Harold (Harold Hunter), a friend of Telly and Casper's, causing him to collapse. A number of other skaters join in, beating, stomping, and hitting the man with their skateboards until he is rendered unconscious by a final blow to the head by Casper; Telly then spits on the man.\nWhile discussing whether or not they killed the man at the park, Telly and some of the group from the park pick up a 13-year-old girl named Darcy (Yakira Peguero), the virginal younger sister of an acquaintance, whom Telly wants to have sex with next. He convinces her to go with them to a pool. The other girls engage in pseudo-lesbian kissing and flirtation, but Darcy is restrained, though not shocked by the others' behavior. Telly and the group go to an unsupervised party at the house of another friend, Steven (Jon Abrahams). Meanwhile, Jennie makes her way to Washington Square Park. Here, she talks to Misha, who tells her about Telly's possible whereabouts. Jennie goes to a rave club called NASA trying to find Telly. She runs into a raver boy, Fidget (Harmony Korine credit as Avi, his brother), who shoves a pill in her mouth, which he refers to as \"a euphoric blockbuster drug that's supposed to make special K look weak\". It turns out to be a depressant (similar to Valium or Xanax). The pill kicks in and Jennie eventually finds out that Telly is at the party at Steven's house.\nJennie arrives at the party only to learn she is too late, as she discovers Telly having sex with Darcy, thus exposing Darcy to HIV. Emotionally drained and the drug still affecting her, Jennie cries and passes out on a couch among the other sleeping partygoers. A drunken Casper proceeds to rape Jennie unprotected as she sleeps, unknowingly exposing himself to HIV as well. The film ends with a poignant look at several early-morning junkies on the streets of New York City, as well as a soliloquy by Telly about how without sex he would have nothing to live for. The final shot features Casper drinking liquor first thing in the morning and looking at the camera and saying \"Jesus Christ, what happened?\""}