{"mid": "KillerKlownsFromOuterSpace", "IMDB_id": "tt0095444", "title": "Killer Klowns from Outer Space", "plot": "In the town of Crescent Cove, California, Farmer Gene Green spies an object falling to Earth. Believing it to be Halley's Comet, he goes to find it, coming across a large circus tent-like structure. He is at first amused by the sight, but he and his dog are quickly captured by mysterious clown-like aliens. Meanwhile, Mike Tobacco and his girlfriend Debbie Stone also investigate. Coming across the same structure, they discover a complex interior that looks nothing like a circus tent. They discover the old man in a cotton candy-shaped cocoon and are nearly captured by the alien clowns, who coat them with popcorn from a gun as they escape. A balloon animal dog that comes to life gives chase.\nNarrowly escaping, Mike and Debbie travel to the police station to confide in her ex-boyfriend Dave Hanson and his skeptical, curmudgeonly partner Curtis Mooney about the killer clowns from outer space. Mooney believes it to be a hoax. After they drop off Debbie, Mike and Dave investigate, only to find the ship missing. Dave dismisses it as a hoax until they find Mike and Debbie's make-out spot destroyed and covered in a cotton candy-like substance. In town, the clowns capture townspeople in cocoons by using ray guns that resemble toys. The clowns perform a series of pranks and performances, including a puppet show, that end with many deaths. One clown fails to lure a young girl to her death, while another one kills a biker who destroyed his tricycle.\nMike and Dave encounter one of the clowns using a shadow puppet to shrink a crowd of unsuspecting people into the palm of his hand before feeding it to a bag full of its offspring, but it escapes before Mike can run it down. Mooney, convinced that the calls to the police station are the result of a hoax, encounters one of the clowns. A series of pranks makes Mooney lock the clown up, not realizing until too late that the threat is real. Dave returns to the station to find two prisoners dead, the station decorated with shoe prints, and Mooney being used as a puppet with the clown's hand inserted in his back. Dave shoots the clown several times before destroying its nose, which causes it to spin wildly and explode.\nIn town, Mike and his friends, the Terenzi brothers, who rent an ice cream truck they were using to warn people, notice the town is overrun by the clowns and flee. Popcorn monsters attack Debbie at her home, and the clowns trap her in a giant balloon. Mike, Dave, and the brothers give chase to the amusement park. Journeying through a funhouse leading to the ship, the Terenzi brothers become separated, meeting two female clowns who seduce them off-screen. After Dave and Mike witness a clown using a crazy straw to drink the liquefied townspeople, they rescue Debbie and flee into a maze full of tricks and traps.\nWhen they emerge, they are surrounded by clowns. Rich and Paul Terenzi arrive, having escaped the female clowns, and use the clown figure on their ice cream truck to distract the clowns. However, a gigantic clown marionette, Jojo the Klownzilla, arrives, breaks free from his strings, and attacks; the other clowns flee. As Jojo destroys the ice cream truck, Dave distracts him by shooting at him. Jojo grabs Dave, who uses his badge to destroy his nose. The clown explodes and the ship is destroyed as Debbie and Mike escape. Debbie and Mike briefly mourn their friends' loss until a clown car drops out of the sky; Dave and the Terenzi brothers then emerge. As they wonder whether the ordeal is over, pies fly down and hit them in the face to the clowns' laughter."}