{"mid": "KillingThemSoftly", "IMDB_id": "tt1764234", "title": "Killing Them Softly", "plot": "In the fall of 2008, during both the American financial crisis and the presidential election campaign, an older man named Johnny \"Squirrel\" Amato plans to rob an illegal poker game. He enlists two younger men to do the robbery: Frankie, a former business associate, and Russell, a heroin-addicted Australian expatriate who is stealing purebred dogs for money. Markie Trattman, the proprietor of the poker ring, is revealed to have previously orchestrated an inside job by paying two men to rob his own illegal poker room. He holds up under rough questioning by the hitman Dillon, though later he openly admits his involvement to various criminals who laugh it off, and Markie suffers no retaliation. Squirrel anticipates that the Mafia will automatically blame Markie for the heist.\nFrankie and Russell, though obviously amateurs, do the holdup and leave with the money. However, Driver, an emissary for the Mob, discusses the recent robbery with an acquaintance of Dillon, a hitman and mob enforcer named Jackie Cogan. Although Jackie understands Markie was uninvolved in the recent heist, he believes Markie should be murdered in order to restore the mobsters' confidence in the local illegal gambling scene.\nUpon completing the crime, Russell travels to Florida to sell the dogs. While in Florida, he inadvertently informs a man named Kenny Gill of his involvement in the heist while trying to recruit him as a drug dealer. Kenny informs Jackie, who deduces that Russell, Frankie, and Squirrel are the perpetrators.\nJackie carries out the hit on Markie himself, killing him in his car, but brings in another older hitman, Mickey Fallon, who is on parole in New York, to kill Squirrel. Jackie explains to Driver how he prefers \"killing them softly\"—shooting his victims from a distance, without warning, giving them no opportunity to experience fear or despair—and that his acquaintance with Squirrel risks complicating this approach.\nMickey postpones going through with his assigned hit, instead indulging in drunkenness and sex with prostitutes in a hotel room. During conversation with Jackie, Mickey also reveals that he has violated his parole, and doesn't seem to care about or really comprehend the consequences; instead he goes off on drunken tangents. It becomes clear to Jackie that the respected hitman has lost his nerve and ability to do his job. Jackie eventually decides to carry out the hit on Squirrel himself. He convinces Driver to arrange Mickey's arrest before the job has been completed.\nRussell is arrested on a drug possession charge and deported; meanwhile, Jackie confronts Frankie and convinces him to trade Squirrel's whereabouts for his life. Jackie has Frankie drive him to Squirrel; upon reaching Squirrel's apartment complex, he kills Squirrel with a shotgun. After confirming Squirrel is dead, Jackie has Frankie drive him to get his car several hours away. Frankie becomes very nervous and begins speeding. Unable to get Frankie to slow down, Jackie takes over driving. Once they arrive at the parking garage, Jackie shoots Frankie in the head without warning. Jackie then wipes down any fingerprints he might have left and leaves the scene.\nOn the night of the presidential election, Jackie meets with Driver to collect his fee for the three hits. On the TV in the bar, Barack Obama is giving his election victory speech. Jackie sees that he has been paid $30,000. He alleges that at $10,000 each, Driver has underpaid him for the jobs—on the argument that it would have cost $15,000 to have Mickey kill Squirrel. Driver responds that Dillon charges ten, and tells Jackie to take it up with Dillon. Jackie tells Driver that Dillon died that morning. Referring to Obama's speech, Jackie says angrily, \"This guy wants to tell me we're living in a community? Don't make me laugh. I'm living in America, and in America, you're on your own. America is not a country; it's just a business. Now fucking pay me.\""}