{"mid": "Killdozer", "IMDB_id": "tt0071717", "title": "Killdozer", "plot": "A meteorite crashes onto the Earth's surface, an island off the coast of Africa. Some hundreds or thousands of years later, after natural forces have buried it and restored the local environment, six construction workers are boated to the island to begin work building an airstrip for an oil drilling company at the crash site, the uninhabited island.\nForeman Kelly (Clint Walker) and bulldozer driver Mack (Robert Urich) uncover the meteorite (though they don't recognize what it is), which emits a strange sound. When the bulldozer (a Caterpillar D9 in the movie, a Caterpillar D7 in the novella) is used to try to shift the meteorite, it emits a blue light that moves to, and seems to possess, the bulldozer. Mack, standing nearby as this occurs, falls ill and then dies some hours later. Chub (Neville Brand), the team's mechanic, cannot find anything wrong with the inoperative bulldozer, but can hear the odd sound from the blade. Kelly orders that the bulldozer not be used.\nBeltran (James A. Watson, Jr.) ignores the prohibition and starts the bulldozer, bringing it to malevolent life. It destroys the camp's only two-way radio and begins a rampage, killing the workers one by one. It seems to run indefinitely in spite of a limited fuel capacity. The machine has some rudimentary intelligence and guile, and hunts down the men.\nThe crew is soon reduced to just Kelly and Dennis (Carl Betz). Running out of options, with the expected relief crew not due to arrive just yet, they amuse themselves by convicting the bulldozer of murder, then consider methods of 'execution'. Too heavy to hang, too big for the gas chamber... until they realize it might be able to be electrocuted. They lure it to a trap consisting of steel Marsden Matting (used for constructing temporary runways during World War II) connected to a generator.\nAs the bulldozer is electrified, the alien entity emerges as an aura around the machine, then finally fades. The men shut down the power and check the blade: no sound. Though Kelly realizes his story will not be believed as he is a recovering alcoholic, and this job was his last chance to redeem himself, he intends to tell the truth."}