{"mid": "KindHeartsAndCoronets", "IMDB_id": "tt0041546", "title": "Kind Hearts and Coronets", "plot": "In Edwardian England, Louis D'Ascoyne Mazzini, 10th Duke of Chalfont, is in prison, awaiting his hanging for murder the following morning. As he writes his memoirs, the events of his life are shown in flashback.\nHis mother, the youngest daughter of the 7th Duke of Chalfont, eloped with an Italian opera singer named Mazzini and was disowned by her family for marrying beneath her station. The Mazzinis were poor but happy until Mazzini died shortly after Louis, his son, had been born. In the aftermath, Louis's widowed mother raises him on the history of her family and tells him how, unlike other aristocratic titles, the dukedom of Chalfont can descend through female heirs. Louis's only childhood friends are Sibella and her brother, the children of a local doctor.\nWhen Louis leaves school, his mother writes to her kinsman Lord Ascoyne D'Ascoyne, a private banker, for assistance in launching her son's career, but is rebuffed. Louis is forced to work as an assistant in a draper's shop. When his mother dies, her last request, to be interred in the family vault at Chalfont Castle, is denied. Then Sibella ridicules Louis's marriage proposal. Instead, she marries Lionel Holland, a former schoolmate with a rich father. Soon after, Louis quarrels with customer Ascoyne D'Ascoyne, the banker's only child, who has him dismissed from his job.\nLouis resolves to kill Ascoyne D'Ascoyne and the other seven people ahead of him in succession to the dukedom. After arranging a fatal boating accident for Ascoyne D'Ascoyne and his mistress, Louis writes a letter of condolence to his victim's father, Lord Ascoyne D'Ascoyne, who employs him as a clerk. Upon his later promotion, Louis takes a bachelor flat in St James's, London, for assignations with Sibella.\nLouis then targets Henry D'Ascoyne, a keen amateur photographer. He meets Henry and is charmed by his wife, Edith. He substitutes petrol for paraffin in the lamp of Henry's darkroom, with fatal results. Louis decides the widow is fit to be his duchess. The Reverend Lord Henry D'Ascoyne is the next victim. Posing as the Anglican Bishop of Matabeleland, Louis poisons his port. From the window of his flat, Louis then uses a bow to shoot down the balloon from which the suffragette Lady Agatha D'Ascoyne is dropping leaflets over London. Louis next sends General Lord Rufus D'Ascoyne a jar of caviar which contains a bomb. Admiral Lord Horatio D'Ascoyne presents a challenge, as he rarely sets foot on land. However, he insists on going down with his ship after causing a collision at sea.\nWhen Edith agrees to marry Louis, they notify Ethelred, the childless, widowed 8th Duke. He invites them to spend a few days at Chalfont Castle. When Ethelred casually informs Louis that he intends to remarry in order to produce an heir, Louis arranges a hunting \"accident\". Before murdering the Duke, he reveals his motive. Lord Ascoyne D'Ascoyne dies from the shock of learning that he has become the ninth duke, sparing Louis from murdering his kindly employer. Louis inherits the title, but his triumph proves short-lived. A Scotland Yard detective arrests him for murder.\nLionel was found dead following Louis's rejection of his drunken plea for help to avoid bankruptcy. Louis elects to be tried by his peers in the House of Lords. During the trial, Louis and Edith are married. Sibella falsely testifies that Lionel was about to seek a divorce and name Louis as co-respondent. Ironically, Louis is convicted for a murder he had never even contemplated.\nLouis is visited by Sibella, who observes that the discovery of Lionel's suicide note and Edith's death would free Louis and enable them to marry, a proposal to which he agrees. Moments before his hanging, the discovery of the suicide note saves him. Louis finds both Edith and Sibella waiting for him outside the prison. When a reporter tells him that Tit-Bits magazine wishes to publish his memoirs, Louis suddenly remembers that he left his detailed confession in his cell."}