{"mid": "KinDzaDza", "IMDB_id": "tt0091341", "title": "Kin-dza-dza!", "plot": "The film is set in 1980s Moscow. Uncle Vova, a generic but gruff construction foreman is relaxing at home after a stressful day at work. His wife asks him to buy some groceries so Vova goes out to the nearest store. Standing right in the city centre on Kalinin Prospekt, a barefoot man dressed in a tattered coat appeals to anyone with a strange request: \"Tell me the number of your planet in the tenture? Or least the number of your galaxy in the spiral?\". Uncle Vova and a young Georgian student with a violin (The Violinist), stop and talk to the strange man. During a short conversation the stranger shows them a teleportation device – \"traveler\". Uncle Vova decides to test the veracity of the stranger's story and, despite the stranger's warnings, presses a random button on the device. Suddenly Uncle Vova and the Violinist find themselves transported to the planet \"Pluke\" in the \"Kin-dza-dza\" galaxy.\nThe natives of the planet appear human, with deceptively primitive-looking technology and a barbaric culture, which satirically resembles that of humans. They are telepathic; the only spoken words normally used in their culture are “ku” (koo) and “kyu” (kyoo), the latter being a swear word. However, the Plukanians are able to quickly adapt to understand and speak Russian and Georgian. The society of Pluke is divided into two categories: Chatlanians and Patsaks. The difference is ascertained only by means of a small handheld device (visator), similar to flash drive in appearance; when pointed at a member of the Chatlanian group, an orange light on the device comes on; when pointed at a member of the Patsak group, a green light comes on. It is also noted that the social differences between Patsaks and Chatlanians are not constant: Pluke being a Chatlanian planet, so Chatlanians are privileged, and a system of rituals must be followed by the Patsaks to show flattery; but there are Patsak planets where Patsaks hold the upper hand and Chatlanians are subservient. The visator shows that Uncle Vova and the Violinist are Patsaks.\nThe only group allowed to use weapons (“tranklucators”) and enforce their will are the etsilops (\"police\" spelled backwards in Russian). Outside being a Patsak or Chatlanin, respect towards others is determined by the color of their pants; different shades require those of lower social standing to \"ku\" at them a predetermined amount of times, displaying their submission. The nominal leader of the Plukanian society is Mr. P-Zh; everybody makes their best to display fervent worship to him and disrespect is severely punished; but, when encountered in person, P-Zh appears harmless and dumb. The fuel of Pluke is called luts and is made from water. All naturally present water has apparently been processed into luts, so drinking water is a valuable commodity (in fact, it can only be made from luts).\nA good deal of the plot is based on the fact that ordinary wooden matchsticks (ketse) (or, rather, the chemicals of the match head) are considered to be extremely valuable on Pluke. Uncle Vova and the Violinist meet two locals, Uef and Be, who at various points either help or abandon the duo from Earth in their quest to return back to Earth, which at various times involves repairing Uef and Be's ship or raiding P-Zh's private compound.\nUncle Vova and the Violnist finally encounter the man from the film's beginning, but he disappears, making it uncertain if he took them with him. The film then jumps back to the very beginning, as Uncle Vova heads outside however there is no man at the city center, where he runs into the Violinist, however they do not recognize each other. Suddenly, a passing tractor with an orange flashing light reminds them of the ecilops and they both reflexively squat and say, \"ku!\" as was required on Pluke. They immediately recognize each other. Uncle Vova, looking at the sky, hears the sound of a song performed by the Uef and Be."}