{"mid": "Kingpin", "IMDB_id": "tt0324865", "title": "Kingpin", "plot": "Flashy young bowler Roy Munson (Woody Harrelson) wins the 1979 Iowa state bowling championship and leaves home to turn professional. In his professional bowling tour debut, he defeats established pro Ernie McCracken (Bill Murray), who takes the loss poorly and seeks revenge. McCracken convinces Roy to join him in hustling a group of local amateur bowlers. When the amateurs become furious after realizing they are being conned, McCracken flees while Roy is brutally beaten and loses his hand when it is forced into the ball return, ending his career. 17 years later, Roy uses a prosthetic hand and is living in Scranton, Pennsylvania, where he sells novelty items with little success and drinks heavily. He is also behind on his rent and is constantly harassed by his landlady Mrs. Dumars (Lin Shaye), even going so far as to have sex with her to avoid her having him evicted and possibly prosecuted for he and his friend staging a mugging for him to save her.\nOn a sales visit to a nearby bowling alley, Roy meets Ishmael Boorg (Randy Quaid). Roy tries to convince Ishmael to turn pro, with Roy acting as manager. Ishmael declines, explaining that he is from the local Amish community and that his bowling hobby is a secret. Roy then sees a poster in a bowling magazine advertising a $1 million winner-take-all tournament in Reno, Nevada. Learning that Ishmael's family is about to lose their farm to the bank, Roy eventually convinces Ishmael's family to let him join Roy.\nRoy discovers that the childlike Ishmael is not aware of some of bowling's basic rules and skills, but after some coaching, Ishmael improves. The duo earn money in various local tournaments and by hustling bowlers. Ishmael defeats a wealthy bowling enthusiast named Stanley Osmanski (Rob Moran), but Stanley attacks the duo after discovering that the roll of cash Roy put up was fake. As the group flee Osmanski's mansion, his girlfriend Claudia (Vanessa Angel), who had also been a victim of Osmanski's violence, joins them. Roy suspects Claudia has ulterior motives and is distracting Ishmael. After Roy gets in a big fight with her, Ishmael flees. During his absence, Roy and Claudia drive on and end up at his family home, abandoned ever since Roy's father passed years ago. They eventually find Ishmael and continue on to Reno.\nIn Reno, the group runs into McCracken, who is now a national bowling superstar. McCracken insults and makes fun of Roy and infuriates Ishmael, who attempts to punch McCracken but instead hits a wall and breaks his hand, leaving him unable to bowl. Later on, Claudia disappears with all of their money after being discovered by Stanley. Feeling distraught, Ishmael convinces Roy that they still have a chance to win the $1,000,000 – if Roy bowls. Roy enters the tournament, rolling the ball with his prosthetic rubber hand. He wins his first several rounds, ending up in the televised finals against McCracken. During the final match, Ishmael's brother, who had been sent by the Boorg family, arrives and takes Ishmael back to Pennsylvania. When Roy realizes he is alone, he struggles and McCracken wins the tournament by one pin.\nAfterwards, Roy is again living in Pennsylvania when he is visited by Claudia, who explains she had disappeared with Stanley in Reno in an attempt to keep him from hurting Roy and Ishmael. She made Stanley believe she was running away with McCracken, and confesses her love for Roy, offering him money Stanley earned from gambling on McCracken in the finals. Roy responds that he has already earned $500,000 in an endorsement deal for Trojan condoms based on his prosthetic hand. Roy and Claudia visit Ishmael's family home. Ishmael's parents explain that Roy and Claudia told them about Ishmael's forbidden bowling career, but also about the moral strength and decency he showed during his travels. Roy tells them how Ishamel straightened Roy and Claudia's life out. Roy pays off the Boorg family's debts with his endorsement check, and Roy and Claudia drive away together."}