{"mid": "KingsmanTheSecretService", "IMDB_id": "tt2802144", "title": "Kingsman: The Secret Service", "plot": "In the year 1997, a helicopter flies into a compound in the Middle East. Four men apprehend a terrorist leader and tie him to a chair. One of the men, Harry Hart, a.k.a. Galahad (Colin Firth), threatens to shoot the terrorist until he gives him answers. The terrorist lifts his head to reveal a grenade pin in his mouth. Harry's comrade Lee (Jonno Davies) jumps on the terrorist and covers the explosion, sacrificing himself to save his partners. Harry's other two partners, Merlin (Mark Strong) and Lancelot (Jack Davenport), remove their masks. After noting Lee's sacrifice, Harry welcomes Lancelot into the Kingsman agency.Harry visits Lee's wife Michelle (Samantha Womack) to inform her of her husband's death. He gives her a medal of valor in Lee's honor, with a phone number on the back. If she ever needs a favor, she's to call the number and use the phrase \"oxfords, not brogues\" to let him know it's her. Michelle rejects the medal. Harry then goes over to Lee's young son Gary, a.k.a. Eggsy (Alex Nikolov). He hands him the medal.Seventeen years later in a chalet in Argentina, Professor James Arnold (Mark Hamill), an expert on climate change, is being held captive by a group of thugs. There is a knock at the door. One thug answers it while pulling out his pistol and finds Lancelot. Lancelot shoots the thug before the thug can shoot him and dramatically fights and kills the rest of the thugs before helping himself to a drink. He's interrupted by another knock at the door. When he opens it, Lancelot is sliced down the middle by a woman with bladed prosthetic legs, Gazelle (Sofia Boutella). She cuts Arnold's bonds with her blade-legs, and hurries to cover all the dead bodies with towels and tablecloths, explaining to Arnold that her employer is squeamish, before opening the door to admit the boss: tech billionaire Richmond Valentine (Samuel L. Jackson). Valentine and Gazelle take Arnold with them when they go.Back in London, Harry goes to a tailor shop that is a front for the Kingsman headquarters. He meets with Merlin and their superior Arthur (Michael Caine). At a virtual meeting of all the Kingsmen (eight plus Arthur), they toast Lancelot and each member is tasked with proposing a new member to replace him. Arthur tells Harry that those involved in Lancelot's death also had ties to incidents in Uganda and Chechnya. Harry refers to what is evidently an old disagreement with Arthur about the type of person they want to recruit; Harry says the world is changing and calls Arthur a snob.We catch up with Eggsy (now played by Taron Egerton), now in his early 20's, living with his distraught and co-dependent mother and her abusive new husband Dean (Geoff Bell), along with Eggsy's baby sister. They live in a ratty flat and are financially insecure. Eggsy goes to the pub with two friends, where they spot Dean's group of goons. The goons bully Eggsy and his friends into leaving. Outside, Eggsy reveals to his friends that he stole the goon's car keys. They take his shiny new yellow sports car, do some donuts when he runs out and yells at them, and drive off, only to come across the police. In the ensuing car chase, Eggsy drives the car backwards through heavy traffic while his friends taunt the coppers until he hits another car. He tells his friends to run for it and distracts the police by ramming their car.Eggsy is detained at the police station. He refuses to give up his friends' names despite the threat of 18 months in prison. Allowed one phone call, he takes out the medal he wears around his neck and calls the number on the back, identifying himself. The person on the other end of the phone says that he has the wrong number. Just in time, Eggsy remembers the phrase \"oxfords, not brogues.\" The voice on the phone says, \"Your complaint has been duly noted,\" and moments later, Eggsy is free to go.Harry introduces himself to Eggsy in front of the station. The two go to the pub and discuss Eggsy's rather undistinguished record, which Harry seems to know all about: Eggsy showed great promise as a gymnast but gave it up. He also dropped out of the marines. There was some involvement with drugs and petty crime, and he's currently unemployed. Harry makes his disappointment clear. Eggsy calls Harry a snob in his turn, pointing out that people make decisions for good reasons -- he left the marines because his mum freaked out at the thought of losing him the way she lost his father -- and jobs aren't easy to come by.Harry offers to help, emphasizing his debt to Eggsy's father, but Eggsy declines just as Dean's goons approach to make more trouble. Harry calmly tells them to leave, but the lead goon is rude to him and tells HIM to leave. Harry walks to the front door and locks it, stating, \"Manners maketh man.\" With the hook of his umbrella, he grabs a mug and swings it at the lead thug, hitting him in the head. Then he makes short work of the others, and even makes some of them beat each other, to Eggsy's surprise. He pats Eggsy on the shoulder and leaves him after being assured that Eggsy won't tell anyone about Harry or what he's just seen.Eggsy returns home, and Dean violently confronts him over what Eggsy did with his mate's car. Michelle tries to intervene, but is shoved aside. Harry overhears the struggle through a mic that he placed on Eggsy's shoulder. Harry speaks into it and tells Dean to let Eggsy go or he will report Dean's various crimes to the authorities. Eggsy runs out of the flat and evades Dean's goons yet again.Eggsy goes to the tailor shop that Harry mentioned to him. He finds Harry, who proposes the Kingsman candidacy to Eggsy. Eggsy decides he's got nothing to lose and joins Harry as they go underground. On the way down, Harry explains that the Kingsmen are an independent secret service, beholden to no government and thus above politics. They were founded after World War I, when many rich families whose heirs died in the trenches looked for a cause to leave their fortunes to and found it in the Kingsmen. Harry and Eggsy board a small shuttle that takes them to meet the other recruits, who are gathered in the stately home that serves as the Kingsmen's center of operations and development. (The filming location was Wrotham Park in Hertfordshire.) The recruits are housed together in a barracks that has toilets, showers, and beds in one room. Eggsy is quickly befriended by a girl named Roxy (Sophie Cookson). He gets teased by a boy named Charlie (Edward Holcroft) and his buddies, who are quick to notice and remark, insultingly, on the class difference between Eggsy and all the others.Meanwhile, Valentine has taken a gruesome posthumous photograph of the bisected Lancelot, with Lancelot's face sewn back together like a baseball, to Washington DC. Valentine is complaining that the CIA and FBI have no clue as to who this agent is or why he was involved in anti-Valentine activities. As the camera pans back, it becomes apparent that Valentine is filling in the US President on his plans for a final resolution of the humans as virus problem--and the US President is going to go along with it!The Kingsmen notice that Professor Arnold is no longer missing, so Harry finds him in a lecture hall and tries to make him say who held him captive. Arnold yells in pain, then his head explodes. Two goons enter the building, forcing Harry to detonate a hand grenade before jumping out the window. He is slightly caught in the explosion and is left in a coma. Valentine learns of Arnold's death and decides to investigate who is looking into them.As the recruits are sleeping, the barracks starts to fill with water. Everyone but Eggsy swims to the toilets to run shower hoses down them -- there's air in every toilet on the other side of the drain trap. Eggsy tries to pull the door open but he can't. He then swims to the mirror and smashes it, releasing the water into the next room where Merlin was overseeing them. Although he commends Roxy and Charlie for getting to the air in the pipes and Eggsy for the mirror, Merlin says everyone failed because they didn't use proper teamwork and lost a recruit. The camera cuts back to the barracks where the drenched body of Amelia (Fiona Hampton) lies on a bed.Meanwhile, Valentine and Gazelle meet with Swedish Crown Princess Tilde (Hanna Alström) and the Swedish Prime Minister (Bjørn Floberg) over dinner, where Valentine proposes his plan for controlling climate change. The PM is on board, but Tilde thinks Valentine is crazy. She leaves the dining room and calls her bodyguards. Gazelle runs out and kills the guards with her prosthetic legs, taking Tilde captive.As the next step in their training, each recruit must train a puppy. Eggsy chooses a small pug, thinking it's a bulldog. The dog doesn't properly listen to him at first, but he becomes attached to it and names it JB (after the 24 TV series character Jack Bauer).After Harry recovers, he, Merlin, and Eggsy learn that Prof. Arnold had a chip implanted in his neck that made his head explode. The Swedish PM has the same implant, with a similar scar under his ear. Merlin traces this back to Valentine. Eggsy comments that Valentine is a genius, and he shows Harry and Merlin a video of Valentine's latest announcement. He is set to distribute free SIM cards around the world: he's offering free cell phone service and free internet for everyone, forever. (He doesn't explain why and apparently no one asks.) Valentine is also suspected in the disappearances of numerous world leaders and some celebrities (including Iggy Azalea).Harry goes undercover to Valentine's estate to investigate Valentine's plans. Gazelle wheels out a fancy dining cart. Lifting the silver cover, she reveals McDonald hamburgers, which they eat paired with very expensive wine. They discuss their admiration for James Bond movies, but Harry doesn't get much information other than seeing one of Valentine's aides carry a pamphlet for a hate group church in Kentucky.The recruits are down to six: Eggsy, Roxy, Charlie, and three of Charlie's friends. Their next assignment involves jumping out of a plane and landing as close as possible to a target on the ground. Roxy hates heights and gets encouragement from Eggsy. After they leave the plane, Merlin announces that one of them has no parachute and they need to figure out what to do.Panicking, one recruit opens his chute too early. Eggsy has everyone join hands before pulling each others' chutes. When only he and Roxy are left, they pull Roxy's chute at 300 feet (very late) while Eggsy holds on for dear life. Eggsy and Roxy land exactly on the target. Merlin commends Charlie, who was close, but fails the others and sends them home. Eggsy complains to Merlin about being singled out to be the sacrificial lamb, asking if he's more expendable than the others. Merlin tells him to get rid of the chip on his shoulder and releases Eggsy's parachute -- it turns out Merlin was fibbing about the missing parachute.Eggsy meets Harry at the Kingsman tailor shop, where Eggsy will be fitted for a bespoke (custom-tailored) suit. Harry calls it \"the modern gentleman's armor,\" not only because of the social benefits it confers, but because Kingsman suits are bulletproof. Learning that dressing room one is in use, he takes Eggsy into dressing room three containing a hidden room filled with the modern gentleman's armaments: umbrellas like Harry's that conceal both a firearm and a bulletproof shield, as well as hand grenades that look like cigarette lighters, pens that trigger a poison, signet rings that deliver 50,000-volt shocks, and pairs of shoes (oxfords and brogues -- Harry takes a moment to explain the difference) with poison-tipped blades. When they return to the front of the shop Valentine and Gazelle walk out of dressing room one; Valentine was being fitted for a morning suit because he's been invited to the queen's box at Ascot. After a tense exchange, Valentine leaves in search of a hat, and Harry leaves Eggsy in the tailor's care.On their next assignment, Eggsy, Roxy, and Charlie are sent to seduce a young woman at a nightclub. Shortly after each delivers their line, all three are drugged by an interrogator. Eggsy wakes up to find himself tied to train tracks in a dark tunnel. The interrogator tries to get Eggsy to tell him about the Kingsmen and Harry, but Eggsy refuses to talk. The train runs over him, but Eggsy is dropped into a little hole and isn't hurt. Harry emerges and tells him he and Roxy passed this test. They watch Charlie taking his test, but he refuses to die for the Kingsmen and he is sent home.As part of their last test, Arthur and Merlin take Eggsy and Roxy into separate rooms and tell each to shoot their dog. Eggsy fails to do so, but a gunshot can be heard from Roxy's room. Arthur sends Eggsy home. Eggsy takes Arthur's car and drives back home, disappointed. He hugs his mother but then sees she has a black eye. Furious, he goes by the pub to find Dean. Eggsy is set to fight him until the car drives itself to Harry's place. He is disappointed with Eggsy for failing his test (not to mention stealing Arthur's car), and reveals that the gun had a blank in it. He also reveals that Amelia never drowned and that she works with the Kingsmen in Berlin. Roxy, having passed every test, becomes the new Lancelot.Harry goes to Kentucky to attend a service at the hate group church. He hasn't heard much of the bigoted preacher's nasty sermon before he gets up to leave. Across the street, Valentine and Gazelle prepare to activate a signal built into Valentine's free SIM cards; they want to see how many people in the church will be affected. The signal goes live and causes everyone, including Harry, to go into a berserk rage and attack each other. Harry shoots several people in the head, as well as violently stabbing, bludgeoning, impaling, and blowing up anyone who comes near him, until he is the only survivor. Eggsy, Merlin, and Arthur watch from their respective locations.Outside, Harry finds Valentine and Gazelle waiting for him. Valentine explains that the signal from the SIM cards triggers aggression and represses inhibitions. He says that in the kind of old movie they both used to love, this would be the point where the villain explains his evil plan and the hero makes a clever escape. He says this isn't that kind of movie, then he then takes out a gun and shoots Harry in the head, killing him. Eggsy screams in horror, while Valentine is appalled at having killed someone.Eggsy goes back to the tailor shop to meet with Arthur. Arthur mentions that Harry recorded Valentine's confession, which has been passed along to the authorities. (In other words, the Kingsmen aren't going after Valentine.) When he offers Eggsy a drink in Harry's honor, Eggsy notices that Arthur has an implant scar under his ear. Arthur was swayed by Valentine when he proposed his plan of mass murder; we flash back to a scene where Valentine explains to Arthur that humanity is like a virus infecting the planet, and just as your body develops a fever when you're fighting a virus, the earth is heating up. Only drastic action will prevent total annihilation (\"either the virus kills the host, or the host kills the virus\"). That drastic action, Valentine says, is to cull the earth's population, and he has a plan. Back in the present, Arthur toasts Harry, and he and Eggsy drink. Arthur takes out his pen to activate the poison that he put in Eggsy's drink, only to find himself dying. Eggsy switched the drinks moments earlier, having distracting Arthur by asking him if the paintings on the wall were of former Kingsmen. Arthur dies on the table.Eggsy goes to Merlin and Roxy with the information he's just received, and they head off to thwart Valentine's plan. Roxy is sent into the upper atmosphere, lifted by two giant balloons, to launch a missile at one of Valentine's satellites. Merlin and Eggsy board a private plane to infiltrate Valentine's mountain base, where he's hosting a party for everyone involved in his plan. Eggsy, wearing the bespoke suit Harry had made for him, poses as Arthur and uses his invitation to get inside. When he reaches the party, he orders a gin martini, \"stirred for 10 seconds while glancing in the direction of an unopened bottle of vermouth.\"Roxy gets within range of the satellite, but one balloon bursts as she reaches the edge of the atmosphere. She manages to launch the missile just before the other balloon bursts, sending her plummeting back to the ground. Spinning wildly, she deploys her chute and lands safely.Back at the party, Merlin reminds Eggsy that he needs to find a network and get him online. Glancing around, Eggsy notices the Swedish PM on a laptop and prepares to apprehend him. After some chit chat, Eggsy tranquilizes him and gives Merlin the access he needs. Eggsy is about to leave when Charlie shows up and holds Eggsy with a knife to his throat, alerting Valentine that there's a spy. Eggsy electrocutes Charlie with the ring on his finger then runs back to the plane while evading and shooting through Valentine's gunmen.Meanwhile, Roxy's missile hits Valentine's satellite and delays the broadcast of the berserker signal. Eggsy gets back to the plane just as Merlin's program finishes running a system analysis of Valentine's security. Merlin informs him that they can't leave just yet as he's unable to hack into the biometric security system. Instead he needs Eggsy to get back to the party and make sure Valentine's hand never touches his desk.Hearing that it'll take an hour or two to get his satellite back up, Valentine piggybacks off one of his cohorts' satellites and moves it into position to reconnect the chain. Realizing this from the plane, Merlin informs Eggsy of the time crunch, and warns him that Valentine's got a present for him. After taking out multiple gunmen, Eggsy is finally surrounded and unable to deal with the number of people closing in on him. Backing up into a cell door, he tells Merlin that he's fucked. Looking out of the cockpit of his plane, Merlin returns \"As am I,\" as gunmen wheel an anti-aircraft machine up. Coming to terms with his end, Eggsy calls Rox and asks her for a favor: to call his mom and have her protect herself and her baby from others, and to tell her he loves her.Moments before Valentine's troops attack, Eggsy asks Merlin if he can activate the implants that were of no use to them earlier. Merlin grins and sets about doing so, much to Valentine's horror. After Merlin triggers the implants, a symphony of fireworks begins, with guests' heads popping off in colorful explosions in time to the music. Every participant in Valentine's plan is killed aside from Valentine himself, and Gazelle.Following that spectacle, Merlin and Eggsy celebrate their small win before Eggsy hears banging and angry remarks coming from the door behind him. Opening the small window, he sees Swedish Crown Princess Tilde, who asks if he can get her out. He replies asking for a kiss, saying he's always wanted to kiss a princess. She returns that she'd give him more than just a kiss if he does. Before he can open the door, Valentine taunts Eggsy, saying that the plan is still in motion as he's still alive.Valentine turns the signal on, and shots from around the world show people turning aggressive and fighting starting with Eggsy's mum, who was just instructed by Roxy to lock the baby in the bathroom and throw away the key. Merlin tells him to get a move on, as Valentine has started the signal. Looking into the cell, Eggsy says, \"Sorry, love. Gotta save the world.\" Princess Tilde tells him \"If you save the world, We can do it in the a------\" and Eggsy matter-of-factly responds that he'll \"be right back.\"Eggsy manages to get back in range of Valentine and Gazelle's control center. He shoots at them, momentarily taking Valentine's hand off the scanner and stopping the signal. Gazelle bursts through the glass and tries to kill Eggsy. The two fight and finally jump at each other. Gazelle attempts to cut Eggsy with her legs, but Eggsy poisons Gazelle by knicking her with the blade in his shoe. He then pulls off one of her legs and hurls it at Valentine's back, impaling him. Thus, every signal is deactivated for good. Merlin and Roxy congratulate Eggsy for saving the world.Eggsy walks up to the dying Valentine, who asks if this is the part where he says a really bad pun. Eggsy tells him, just as Valentine told Harry before killing him: \"This ain't that kind of movie.\" After watching Valentine die, Eggsy grabs a bottle of champagne with two glasses, and runs back to Princess Tilde's cell. Unable to open the door, he asks Merlin for help and Merlin tells him the code for the lock. Eggsy enters to a bent over princess.The closing credits begin, but we cut to Michelle and Dean in the pub. Eggsy enters, dressed in his bespoke suit. He tells Michelle that his new job has given him benefits, including a house; he invites Michelle, and pointedly not Dean, to live there with him. Dean, with his goons around him, responds with threats. Eggsy locks the front door and says what Harry once said -- \"Manners maketh man.\" As Harry did before him, he grabs a glass mug with his umbrella hook and throws it at Dean's face. He then faces the other goons and, with a grin, repeats another line of Harry's: \"Are we going to stand around, or are we going to fight?\""}