{"mid": "KingRalph", "IMDB_id": "tt0102216", "title": "King Ralph", "plot": "The entire royal family of the United Kingdom is electrocuted in a freak accident while posing for a family photograph. Sir Cedric Willingham (Peter O'Toole) leads a search for any surviving heirs to whom to pass the crown. A researcher finally locates a living heir named Ralph Jones (John Goodman), an American.\nIn Las Vegas, Ralph, an easygoing slob, works as a lounge singer and piano player in a casino. Ralph is informed that he is now king; his grandfather, the first Duke of Warren, engaged in an affair with a hotel maid while visiting the United States. Since his father and grandfather have died, Ralph is the only surviving heir.\nRalph is flown to London, where he meets Willingham and begins a long period of instruction intended to turn him into a proper monarch. He is schooled in English history and culture and shown a variety of English dishes.\nShortly after his arrival, Ralph goes to a strip club, meeting exotic dancer Miranda Greene (Camille Coduri). When she is unable to perform topless, Ralph meets her backstage. She is skeptical of his claim to be king, but Ralph proposes that if he can prove he is, Miranda will go on a date with him, and his appearance on the news proves his claim.\nLord Percival Graves (John Hurt), Prime Minister Geoffrey Hale (James Villiers), and Willingham meet to discuss Ralph's selection as King. Graves is opposed to having an American on the throne, and proposes to declare the ruling family line at an end and replace it with the House of Stuart. As Graves is the patriarch of the Stuarts, he would thus become King. Hale states that Ralph has royal blood, and that the country will have to accept him unless Ralph commits a grievous error. Graves decides to use Miranda to embarrass Ralph and remove him from the throne. Offered money to maneuver Ralph into a compromising position, Miranda accepts. She and Ralph begin falling in love. Miranda returns the money to Graves, but Graves already has pictures of them. To protect Ralph, Miranda severs the relationship.\nDespite Ralph's reluctance to accept British culture and his ineptness in formal affairs, he makes a positive impression on King Mulambon (Rudolph Walker) of Zambezi during the latter's state visit. The two monarchs share their concerns about the role of leadership they have assumed and the economic interests of their nations. Ralph accumulates a small but loyal following.\nRalph's staff arrange for him to marry Princess Anna (Joely Richardson) of Finland; Ralph receives her and her parents on a state visit. Graves has photos of Miranda and Ralph passed around at the royal ball, which, along with Ralph's wild rendition of \"Good Golly Miss Molly\" on a harpsichord, ruin any chances of a Royal marriage and causes a Finnish company to award a coveted contract to the Japanese. Having failed to realize that the role of King comes with certain expectations, and that he cannot rely on his charm or blue-collar background, Ralph accepts a stern rebuke from Willingham and endeavors to set things right. Miranda confesses to Ralph her role in the scandal. Ralph develops suspicions about his circumstances, and learns that Willingham is another heir to the throne and had refused the role.\nRalph addresses Parliament. He apologizes for his recent actions and informs Parliament that he has worked out a deal with the King of Zambezi that will create British jobs. He then reveals that Graves has been sabotaging his succession to the throne and has him arrested for violating the Treason Act of 1702. Finally, he tells the British people that he believes they deserve a better monarch. Ralph announces that he will abdicate and reveals that Willingham will succeed him.\nWillingham becomes King Cedric I and decides to fulfil Ralph's legacy as a great king. Ralph pursues his relationship with Miranda, along with his dreams of being a rock star. Ralph bids goodbye to his friends and his newly discovered relative. King Cedric appoints Ralph the third Duke of Warren, with a lucrative annual salary, a palace in the country and a state-of-the-art recording studio. Some years later, Miranda, now Duchess of Warren, sits with her and Ralph's son Baby Ralph II who is the heir to the throne, watching her husband perform with his musical group, Ralph and the Dukettes."}