{"mid": "KingsRow", "IMDB_id": "tt0034946", "title": "Kings Row", "plot": "The film commences in 1890 in the small midwestern town of Kings Row, focusing on five children. They are 1) Parris Mitchell (Robert Cummings), who lives with his grandmother; 2) Cassandra Tower (Betty Field), daughter of Dr. Alexander Tower (Claude Rains); 3) the wealthy and fun-loving orphan Drake McHugh (Ronald Reagan); 4) Louise Gordon (Nancy Coleman), daughter of the sadistic town physician Dr. Henry Gordon (Charles Coburn), who has been known to perform operations without anesthetic; and 5) the tomboy Randy Monaghan (Ann Sheridan), whose father is a railroad worker.\nParris is attracted to Cassandra, whom the other children avoid because her family is \"strange\": her mother is confined to the house and never seen. Dr. Tower takes Cassie out of school; she is confined at home and Parris does not see her again until years later, when he begins his medical studies under Dr. Tower's tutelage.\nParris' best friend, Drake, intends to marry Louise despite the disapproval of her father. Louise, however, refuses to defy her parents and will not marry him. Parris and Cassie begin a secret romance, seeing each other at Drake's house. At about this time, Parris' grandmother becomes ill from terminal cancer and dies as he is about to go overseas to Vienna for medical school. Parris, who decides to study psychiatry, proposes marriage to Cassie. She initially resists, running away, but later comes begging him to take her with him to Vienna. She then runs away again, back home.\nThe next day, Parris learns that Dr. Tower has poisoned Cassie and shot himself, and has left his estate to him. He learns from Dr. Tower's notebook that he killed Cassie because he believed he saw early signs that she might go insane like her mother, and he wanted to prevent Parris from ruining his life by marrying her, just as Tower's life had been ruined by marrying Cassie's mother.\nWhile Parris is in Vienna, Drake's trust fund is stolen by a dishonest bank official. Drake is forced to work locally for the railroad, and his legs are injured in a boxcar accident. Dr. Gordon amputates both of his legs. Drake, who had been courting Randy before the accident, marries her but is now embittered by the loss of his legs and refuses to leave his bed. Nonetheless they commence a business, begun with Parris' financial help, building houses for working families. When Parris suggests they move into one of the homes they've built, away from the railroad tracks and sounds of the trains that plague Drake, he becomes hysterical and makes Randy swear to never make him leave the room.\nParris returns from Vienna to Kings Row and decides to remain there, when he learns that Dr. Gordon has died, leaving the town with no doctor. Louise reveals that her father amputated Drake's legs unnecessarily, because he hated Drake and thought it was his duty to punish wickedness. Parris at first wishes to withhold the truth from Drake, fearing it will destroy his fragile recovery. He considers confining Louise to a mental institution, even though she is not insane, to prevent the truth from being revealed to Drake and other victims of her father. But instead, persuaded by his new friend Elise (Kaaren Verne) to treat Drake like any other patient rather than his best friend, he tells Drake what happened. Drake reacts with defiance and summons a renewed will to live instead of the deep clinical depression Parris had feared. Parris is now free to marry Elise, having helped his old friend return to a productive life."}