{"mid": "KingArthurLegendOfTheSword", "IMDB_id": "tt1972591", "title": "King Arthur: Legend of the Sword", "plot": "Mordred, an iron fisted warlock, and his armies lay siege to Camelot, seeking to establish the dominance of magic-wielding mages over humankind. Uther Pendragon, king of the Britons, infiltrates Mordred's lair and beheads him, destroying his forces and saving Camelot. Later that evening, Uther's treacherous brother Vortigern, who covets the throne, orchestrates a coup and sacrifices his wife Elsa to sea witches in order to summon a demon knight, who kills Uther's wife and slays him in combat. The only survivor is Uther's son, who drifts away in a boat and eventually winds up in Londinium, where he is found and raised by prostitutes, who name him Arthur.\nArthur grows into a skilled fighter and man of the streets, alongside his friends Tristan and Backlack. The three confront a group of Vikings headed by Kjartan, who had mistreated one of the prostitutes, forcing them to pay her a year's wages for their behavior. Afterwards, the brothel is raided by the Blacklegs, Vortigern's minions, and Arthur learns that the Vikings were guests of the king and attacking them, therefore, constitutes a crime against him personally. Arthur tries to escape the city, but is caught and put on a ship with hundreds of other men. He learns that a mysterious, magic sword has appeared near Vortigern's castle, and the Blacklegs have been forcing all men of Arthur's age to try and pull it from the surrounding stone. When Arthur tries, he pulls the sword out and quickly faints from the vast power it contains. Vortigern meets with him in the dungeon, revealing his true lineage. Meanwhile, a woman, identifying herself as an acolyte of Merlin, meets with Uther's former general, Sir Bedivere.\nAt Arthur's execution, the mage uses her magic to stage a diversion while Percival and Rubio, two of Bedivere's men, rescue Arthur. Taken to his hideout, Arthur initially refuses to help them, but soon collapses again when he tries to wield the sword. Suspecting that he lacks the willpower to control it, the mage persuades Bedivere to take Arthur to the \"Blacklands\", the realm where, years earlier, Merlin destroyed Mordred's tower in defiance of his darkness. It is revealed that Vortigern was responsible for persuading Mordred to rebel against humanity, having grown jealous of Uther's power. Arthur, having restored the sword's magic, returns determined to destroy Vortigen for his crimes.\nTogether with his friends and Bedivere's men, Arthur stages a series of ambushes and attacks to force Vortigern out of hiding. Aware that his maid is a spy for Bedivere, Vortigen announces plans to meet with his barons in Londonium, sending a body double in his place. The rebels quickly realize the deception, but attack anyway which was all part of his plan. In the process, Rubio is captured while Backlack is severely wounded and left behind. The others take refuge in a fighters' school, run by Arthur's mentor George, where they are quickly overrun by the Blacklegs. Seeing the mage being held at knifepoint, Arthur is overcome by his rage and unleashes Excalibur's potential, single-handly killing all of the enemy soldiers. As night falls and riots break out all over Londonium, the rebels take shelter in a safe house, where they are soon joined by Backlack and his son Blue.\nKnowing that he is mortally wounded, Backlack urges the others to go on and promises that he will be coming after them soon. Unbeknownst to them, the Blacklegs' commander, Mischief John, has been following the wounded Backlack, and he and Vortigern interrogate him for information. Blue sneaks back and, when caught, tries to bluff them that he is simply a worker coming to do his shift. But he can't maintain the masquerade when his father is threatened. Arthur comes back and manages to save Blue, but not before Blue watches his father die.\nAfterwards, Arthur, ashamed of his failures, throws the sword into a lake and runs into the forest. When he stops at a small marsh, the Lady of the Lake pulls him into her realm and shows him a vision of the future, where England has been ruined by Vortigern's rule and the people are left to suffer in misery. Recognizing that only he can put an end to his uncle's reign, Arthur reunites with Bedivere, George, and Percival. When they return to the rebel hideout, however, they discover all of their allies dead, Vortigern having found them thanks to information provided by Rubio. They encounter the captain, who delivers a message from the king: If Arthur does not surrender himself by nightfall, both the mage and Blue will die. Bedivere is able to get the former released in exchange for Arthur surrendering both himself and the sword.\nJust as Vortigern is about to kill his nephew, a giant snake controlled by the mage attacks and devours the captain and his men, while the others free Vortigern's prisoners and lead them in a revolt against the Blacklegs. A desperate Vortigern sacrifices his only daughter and is transformed into the demon knight, confronting Arthur in a separate dimension. Despite his fighting skill, Arthur is quickly beaten. Just as he is about to submit, he witnesses a flashback of the moment when his father was struck down, having turned his own body to stone to prevent Vortigern from seizing the sword. Arthur snatches the sword before it impales Uther, who gives him the right to wield it. Arthur then destroys Vortigern's weapon and kills him violently.\nIn the aftermath, Arthur, George, and Percival begin building the round table, where Arthur and his knights will meet. Arthur also dissolves Vortigern's pact with the Vikings, declaring that they must respect England's power if they wish to avoid war. Blue and the prostitutes arrive with the crown of Uther, which Arthur accepts. King Arthur then addresses his new subjects, holding the sword aloft in the air."}