{"mid": "KinjiteForbiddenSubjects", "IMDB_id": "tt0097670", "title": "Kinjite: Forbidden Subjects", "plot": "Hiroshi Hada, a Japanese businessman in a troubled marriage, sees a woman being groped in a crowded Tokyo subway. He is fascinated by the fact that she moans silently, involuntarily orgasms, but does not cry out or let people know she is being sexually molested. When Hada is transferred to Los Angeles, he has too much to drink at a business party and tries to imitate what he saw by groping a Caucasian school girl while riding a crowded bus. But unlike the Japanese woman that Hada saw in Japan, the American girl screams. Hada runs away, but is robbed and beaten by a mugger. Meanwhile, several innocent Asian men are beaten by bystanders who suspect that one of them is the man who groped the girl.\nThe girl happens to be Rita Crowe, the daughter of an LAPD vice-squad detective, Lt. Crowe (Bronson), an officer with a strong sense of justice who is very protective of her. Shortly afterward, Fumiko, Hiroshi Hada's daughter, is kidnapped into a child prostitution ring led by the infamous 'Pimp-King' Duke. Crowe, who has developed a general dislike to the Japanese due to his daughter's incident, is assigned against his will to find the girl. His feelings about Japanese people start to change when he realizes that the Hadas care about their daughter as intensely as he cares for his daughter.\nCrowe and his partner, Eddie Rios, eventually find Fumiko and rescue her from the pimp and his gang. They kill one member of the gang, but the others escape. The Hadas visit Crowe's house with gifts to show their appreciation for his work. Rita recognizes Hiroshi as the man who groped her on the bus - and he recognizes her - but says nothing. However, despite this apparently happy ending, Fumiko has been so traumatized by her experiences as a prostitute - she was raped by Duke and his gang members and then sold to customers of both sexes - that she commits suicide by an overdose.\nCrowe and Rios decide to find Duke and locate him on a boat in a harbor. In the ensuing fight, Duke and his remaining gang members kill Rios, but Duke eventually ends up in the harbor. Since Duke can't swim, Crowe has the choice of letting the gangster drown, but ends up dragging him out. However, as a way of \"poetic justice\", Crowe has Duke interred in a prison wing inhabited by sexually aggressive inmates, with his designated cellmate making blatant allusions as to what he is going to do with him. As Duke screams in anguish, Crowe walks away in deep satisfaction."}