{"mid": "KissOfDeath", "IMDB_id": "tt0113552", "title": "Kiss of Death", "plot": "Jimmy Kilmartin is an ex-con living in Astoria in the New York City borough of Queens, trying to stay clean and raising a daughter with his wife Bev. They are both recovering alcoholics. Bev leaves Jimmy alone to go to an AA meeting. While she is gone, Jimmy is awoken by his cousin Ronnie who is in desperate need of a driver to help him move some stolen cars. Jimmy tries to eject Ronnie, knowing that he could go back to prison just for being seen with him. Ronnie's right ring finger is broken, and he confesses that if Jimmy does not help him move the cars, Little Junior Brown will kill him.\nLittle Junior Brown is an asthmatic psychopath. Enraged that they are so behind schedule, he insists that Ronnie move the four trucks full of stolen cars in a caravan, instead of staggering them to avoid detection. The caravan draws the attention of the police, and when they arrive at the Brooklyn Navy Yard to unload the cars, the police arrive. During the arrests, Jimmy's passenger shoots at the police. The bullet goes through Jimmy's hand and just below the right eye of Detective Calvin Hart.\nThe lawyer for the Brown crime family, Jack Gold, promises Jimmy that Bev will be taken care of if he takes the rap without naming his co-conspirators. Ronnie shorts Bev on her allowance, giving her only $150 of the $400 a week that the Browns intended for her. Bev agrees to work for Ronnie at his chop shop just south of Shea Stadium. On her first day, she witnesses Ronnie beating a man who tried to sell him a stolen car. She drinks a Rolling Rock, and goes with Ronnie to Baby Cakes, the strip club owned by the Browns. She drinks vodka and wakes the next morning in Ronnie's bed. Horrified at her relapse, she rushes out of Ronnie's house and steals his car. She drives head-on into a semi-truck in the street and dies.\nGiven a supervised release for her funeral, Jimmy listens to Ronnie's lame explanation for why Bev died in his car. Bev's sister Rosie explains that she never returned home the night before her death. Convinced of Ronnie's complicity in Bev's death, Jimmy agrees to turn state's witness. He names all of the people involved in the Navy Yards fiasco, except Ronnie. When the cops arrest everyone but Ronnie, the Browns are convinced that he is the snitch. Little Junior Brown visits Ronnie's shop and proceeds to beat Ronnie to death in his office as retaliation.\nSeveral years pass, and the district attorney approaches Jimmy again about snitching on the Browns. Still in Sing Sing, Jimmy negotiates for a pardon and a job that he would enjoy. He and Rosie get married, but he hides his informant duties from her.\nDet. Hart meets with Jimmy at a Chinese restaurant and informs him that his target is actually a drug dealer named Omar, who gets weapons and cars from Little Junior Brown. Jimmy dons a wire and returns to work for the Browns with an initial assignment of boosting cars. After their rounds, Jimmy's crew heads to Baby Cakes where he sees Little Junior for the first time in years. Little Junior is distraught over the recent death of his father, and he offers Jimmy his condolences over Bev's death. Little Junior takes Jimmy to a meeting with Omar.\nJimmy is unable to sustain the charade with Rosie. Eventually, Little Junior takes Jimmy to another meeting with Omar, whom he kills. Later, Omar's crew throws Jimmy into a car and drives him to a meeting, where he learns that Omar was an undercover DEA agent. The DA and the DEA use Jimmy's tape of the killing to arrest Little Junior. When Little Junior is out on bail, he abducts Jimmy's daughter to send him a message. He eventually finds his daughter in the woods, with the letters B.A.D. (Balls, Attitude, Direction; an acronym Little Junior gives himself in a private moment with Jimmy) written on her forehead in blood.\nRealizing that his family is not safe anymore, Jimmy returns to the city and confronts Little Junior at gunpoint at Baby Cakes. A fight ensues with Little Junior and Jimmy, which results in Little Junior being arrested by Det. Hart (after learning that Jimmy was wired). Jimmy uses a tape of the DA's corrupt threats as leverage to escape the situation. The film ends with Jimmy getting into a stolen Explorer that Little Junior gave him, and he leaves the city with Rosie and his daughter."}