{"mid": "KissMeKate", "IMDB_id": "tt0045963", "title": "Kiss Me Kate", "plot": "Act I\nThe cast of a musical version of William Shakespeare's The Taming of the Shrew is rehearsing for the opening of the show that evening (\"Another Op'nin', Another Show\"). Egotistical Fred Graham is the director and producer and is starring as Petruchio, and his movie-star ex-wife, Lilli Vanessi, is playing Katherine. The two seem to be constantly arguing, and Lilli is particularly angry that Fred is pursuing the sexy young actress Lois Lane, who is playing Bianca. After the rehearsal, Lois's boyfriend Bill appears; he is playing Lucentio, but he missed the rehearsal because he was gambling. He tells her that he signed a $10,000 IOU in Fred's name, and Lois reprimands him (\"Why Can't You Behave?\").\nBefore the opening, Fred and Lilli meet backstage, and Lilli shows off her engagement ring from Washington insider Harrison Howell, reminding Fred that it's the anniversary of their divorce. They recall the operetta in which they met, which included \"Wunderbar\", a Viennese waltz; they end up fondly reminiscing and singing and dancing. Two gangsters show up to collect the $10,000 IOU, and Fred replies that he never signed it. The gangsters obligingly say they will give him time to remember it and will return later. In her dressing room, Lilli receives flowers from Fred, and she declares that she is still \"So In Love\" with him. Fred tries to keep Lilli from reading the card that came with the flowers, which reveals that he really intended them for Lois. However, Lilli takes the card with her onstage, saying she will read it later.\nThe show begins (\"We Open in Venice\"). Baptista, Katherine and Bianca's father, will not allow his younger daughter Bianca to marry until his older daughter Katherine is married. However, she is shrewish and ill-tempered, and no man desires to marry her. Three suitors - Lucentio, Hortensio, and Gremio - try to woo Bianca, and she says that she would marry any of them (\"Tom, Dick, or Harry\"). Petruchio, a friend of Lucentio, expresses a desire to marry into wealth (\"I've Come to Wive it Wealthily in Padua\"). The suitors hatch a plan for him to marry Kate, as Baptista is rich. Kate, however, has no intentions of getting married (\"I Hate Men\"). Petruchio attempts to woo her (\"Were Thine That Special Face\"). Offstage, Lilli has an opportunity to read the card. She walks on stage off-cue and begins hitting Fred, who, along with the other actors, tries to remain in character as Baptista gives Petruchio permission to marry Kate. Lilli continues to strike Fred, and he ends up spanking her. Offstage, Lilli furiously declares she is leaving the show. However, the gangsters have reappeared, and Fred tells them that if Lilli quits, he'll have to close the show and won't be able to pay them the $10,000. The gangsters force her to stay at gunpoint. Back onstage, Bianca and Lucentio dance while the chorus performs \"We Sing of Love\", covering a scene change. The curtain opens, revealing the exterior of a church; Petruchio and Kate have just been married, and they exit the church; the gangsters, dressed in Shakespearean costume, are onstage to make sure that Lilli stays. Petruchio implores for Kate to kiss him, and she refuses. He lifts her over his shoulder and carries her offstage while she pummels his shoulder with her fists (\"Kiss Me Kate\").\nAct II\nDuring the show's intermission, the cast and crew relax in the alley behind the theater. Paul (Fred's assistant), along with a couple other crew members, lament that it's \"Too Darn Hot\" to meet their lovers that night. The play continues, and Petruchio tries to 'tame' Katherine and mourns for his now-lost bachelor life (\"Where Is the Life That Late I Led?\"). Off-stage, Lilli's fiancé Harrison Howell is looking for Lilli. He runs into Lois, and she recognizes him as a former lover but promises not to tell Lilli. Bill is shocked to overhear this, but Lois tells him that even if she is involved with other men, she is faithful to him in her own way (\"Always True to You in My Fashion\"). Lilli tries to explain to Howell that she is being forced to stay at the theatre by the gangsters, but Howell doesn't believe her and wants to discuss wedding plans. Fred insidiously points out how boring Lilli's life with Howell will be compared to the theatre. Bill sings a love song he has written for Lois (\"Bianca\").\nThe gangsters discover that their boss has been killed, so the IOU is no longer valid. Lilli leaves—without Howell—as Fred unsuccessfully tries to convince her to stay (\"So in Love\" (Reprise)). The gangsters get caught on stage and improvise a tribute to Shakespeare in which they explain that knowing Shakespeare is the key to romance (\"Brush Up Your Shakespeare\"). The company prepares for the conclusion of the play, the wedding of Bianca and Lucentio, even though they are now missing one of the main characters. However, just in time for Katherine's final speech, Lilli arrives onstage (\"I Am Ashamed That Women Are So Simple\"). Fred and Lilli wordlessly reconcile on stage, and the play ends (\"Kiss Me Kate\" (Finale)) with them, as well as Bill and Lois, kissing passionately."}