{"mid": "KittyFoyle", "IMDB_id": "tt0032671", "title": "Kitty Foyle", "plot": "Kitty Foyle (Ginger Rogers), a saleswoman in a New York boutique working for Delphine Detaille (Odette Myrtil), faces a life-changing decision: marry doctor Mark Eisen (James Craig) or run away to South America with the man she has loved for many years, the already-married Wyn Strafford (Dennis Morgan). As she wrestles with her decision, the film flashes back to her youth in Philadelphia.\nAs a teenager, Kitty gawks at the city's elite \"Main Liners\" in a parade that precedes their annual Assembly Ball. Her father (Ernest Cossart) warns against getting carried away with her fantasies. Ironically, Kitty meets the embodiment of her dreams in an acquaintance of his: Wynnewood Strafford VI. Wyn offers her a secretarial job at his fledgling magazine. The two fall deeply in love, but when the magazine folds, he does not have the will to defy his social class's strictures by proposing to a woman so far below him socially.\nWith the death of her father and no prospect of marriage with Wyn, Kitty goes to work in New York for Delphine. One day, she presses the burglar alarm button by mistake at Delphine's fashion store. She pretends to faint to cover her blunder and is attended to by Mark. Mark, aware she is faking it, playfully blackmails her into a first date.\nWyn finally breaks down and finds Kitty in New York. The two wed, but agree that the only way their marriage can work is if they do not live in Philadelphia. When he introduces her to his family, she gets a chilly reception. She also learns that Wyn would be disinherited and left penniless if he does not remain in Philadelphia and work in the family banking business. She realizes, though Wyn is willing to try, he is not strong enough to deal with poverty. She walks out and they are divorced.\nKitty returns to New York, where she learns that she is pregnant. When Wyn arranges to meet her, her hopes for a reconciliation are raised, only to be dashed when she sees a newspaper announcement of Wyn's engagement to someone of his own social standing. She leaves without seeing him and receives a further blow when the baby dies at birth.\nSeveral years later, Kitty reluctantly agrees to open a Philadelphia branch store for her friend Delphine. By chance, she waits on Wyn's wife and meets their son. She takes the opportunity to entrust the secret return of a family heirloom ring to the boy.\nThe film returns to the beginning. She decides to marry Mark."}