{"mid": "KittenWithAWhip", "IMDB_id": "tt0058267", "title": "Kitten with a Whip", "plot": "** CONTAINS SPOILERSJODY DVORAK, 17, escapes from a juvenile facility after knifing a MATRON. Hopping a freight, pursued by COPS, Jody gets away. Desperate, she stumbles upon the lavish home of DAVID STRATTON, a senator wannabe, off on a business trip and whose wife, VIRGINIA, is currently away with their child, rethinking their marriage.When Jody spots the newspapers on David's lawn, she knows he's away, and she breaks in, snuggling her way into the bed of David's little girl. That night, David returns home with GRANT, one of his wealthy supporters. As they discuss campaign strategy, David doesn't realize yet that Jody's asleep in the house.David gets up the next morning, attracted by a noise in the room when Jody upends a teddy bear. Angry, David picks up the phone to call the police, but Jody - a compulsive and convincing liar - concocts a story of sexual abuse at the hands of a stepfather. David feels sorry for her, electing not to call the cops, since to do so would mean sending her back to an abusive situation.Instead, David takes her out to buy some new clothes, then drops her off at a bus depot. Meeting with Grant later in a bar, David's about to tell him his adventure when he sees Jody's photo on t.v., realizing that she's a dangerous fugitive. When David gets home, he's shocked to find that Jody has returned. He picks up the phone to call the cops again, but this time Jody extorts him with threats of non-existent statutory rape, just exactly what the senatorial hopeful doesn't need.David agrees to let her stay until evening. Meanwhile, he must fend off Grant, who shows up with his nosy wife, VERA. David begs off with a headache. When night falls, Jody reneges on her promise to leave. Further, she's invited some \"teenage\" pals over, including RON, BUCK and MIDGE.David lets them in reluctantly, hoping they'll party for a while and leave. The more dangerous of the trio, Buck, gets his hands on David's straight razor, and he soon wounds Ron. They know they'll have to get him to a doctor.They head off in David's big car, soon crossing the border into Tijuana. They manage to lose Buck, then dump Ron off at a doctor's. David takes Jody to a motel. Jody swipes his car keys, saying she'll bow out of his life, but she needs a bottle of booze. David goes off to buy it for her, running into Ron, whose wound has been stitched. He's out to get Jody. David also runs into Grant, Vera and some influential political BACKERS, forced to do some fast talking. He calls some COPS on Ron.David heads back to the motel, where, surprisingly, Jody returns his keys. But Buck and Ron show up, determined to get revenge on Jody. As Buck starts to beat her up, David intercedes, but soon Buck's beating him up. Jody hits Buck over the head with the liquor bottle, then holds the shattered bottle at Ron's throat. David and Jody take off in his car, hoping to get David to the hospital from his beating.Buck and Ron pursue, a chase follows, the cars soon careening off a mountain. David awakes in a San Diego hospital, informed by a STATE TROOPER that Jody blamed herself for everything. David's in the clear. Unfortunately, Jody - along with Buck and Ron - are also dead of their injuries. Meanwhile, David's wife Virginia is waiting to see him, and David, having learned a mightily important lesson, agrees to see her, hopefully to re-ignite the struggling spark of their marriage."}