{"mid": "Klute", "IMDB_id": "tt0067309", "title": "Klute", "plot": "The film begins with the disappearance of Pennsylvania executive Tom Gruneman (played by Robert Milli). The police reveal that an obscene letter was found in Gruneman's office, addressed to a prostitute in New York City named Bree Daniels (Fonda), who had received several similar letters from him. After six months of fruitless police work, Peter Cable (Cioffi), an executive at Gruneman's company, hires family friend and detective John Klute (Sutherland) to investigate Gruneman's disappearance.\nKlute rents an apartment in the basement of Daniels' building, taps her phone, and follows her as she turns tricks. Daniels appears to be liberated by the freedom of freelancing as a call girl, but in a series of visits to her psychiatrist (Vivian Nathan), she reveals the emptiness of her life and that she wants to quit. Klute asks Daniels to answer some of his questions, but she refuses. He approaches her again, revealing that he has been watching her. She does not recall Gruneman. She reveals that she was beaten by one of her johns two years earlier, but after seeing a photo of Gruneman, she says she cannot say for sure.\nDaniels takes Klute to meet her former pimp, Frank Ligourin (Scheider), who reveals that one of his prostitutes, Jane McKenna, passed the abusive client on to Bree and another prostitute named Arlyn Page (Dorothy Tristan). McKenna committed suicide and Page became a drug addict and disappeared. Klute and Daniels develop a romance, though she tells her psychiatrist that she fears these feelings and wishes she could go back to \"just feeling numb.\" She admits to Klute a deep paranoia that she is being watched.\nThey find Page, who tells them the customer was not Gruneman but an older man. Page's body then turns up in the Kill Van Kull. Klute deduces a connection between the two \"suicides\" of the prostitutes, surmising that the client probably also killed Gruneman and might kill Daniels next. He revisits Gruneman's contacts to find connections with the case. By typographic comparison, the supposed obscene letters of Gruneman are traced to Cable, with whom Klute has been meeting to report on his investigation.\nKlute asks Cable for an additional $500 to buy the \"black book\" of the first prostitute who apparently committed suicide, telling Cable he is certain the book will reveal the identity of the abusive client. Cable corners Bree and reveals that he sent her the letters, explaining that Gruneman had interrupted him when he was attacking a prostitute. Certain that Gruneman would use the incident as leverage against him within the company, Cable attempted to frame Gruneman by planting the letter in his office. He confesses to the killings. After playing an audiotape he made as he murdered Page, he attacks Daniels. Klute rushes in, and Cable jumps or is thrown out a window to his death (the film uses ambiguous editing).\nDaniels moves out of her apartment with Klute's help, though her voiceover with her psychiatrist reveals her fear of domestic life and a likelihood that the doctor will \"see me next week.\"\nThe film often cleverly uses dim light to make it difficult to identify the characters and what is going on. The music, though clever and tuneful, seems to enhance the built in confusion as to just what is going on. These devices enhance the tension and force of the motions of the characters."}