{"mid": "KnightsOfTheRoundTable", "IMDB_id": "tt0045966", "title": "Knights of the Round Table", "plot": "=== Arthur removes the sword from the anvil ===\nWith the land in anarchy, warring overlords, Arthur Pendragon (Mel Ferrer) and his half-sister Morgan LeFay (Anne Crawford) meet as arranged by the sorcerer Merlin (Felix Aylmer) to discuss how to end the bloodshed. Morgan maintains that as she is the only legitimate offspring of the late king, the throne belongs to her, but Merlin puts the adversaries to a test to determine England's rightful ruler. Merlin leads them to Excalibur, a sword embedded in an anvil, and says that according to legend, whoever can remove the sword shall be England's true sovereign. Morgan's knight champion Modred (Stanley Baker) tries in vain to extract the sword, but Arthur removes it easily. Modred accuses Merlin of witchcraft, and a hearing is arranged with the Council of Kings at the circle of the stone. After advising Arthur that he must prove himself worthy of the throne by his deeds, Merlin instructs him to return the sword to the stone.\n=== Lancelot encounters Elaine, Arthur, Modred and Guinevere ===\nMeanwhile, the French knight Lancelot (Robert Taylor) and his men ride toward the circle of stone, hoping to offer their services to Arthur. On the road, Lancelot encounters a young woman named Elaine (Maureen Swanson), who quickly falls in love with him. They are waylaid by Modred's men, and Lancelot bravely does battle with all of them. Arthur arrives and joins in the battle. Lancelot, claiming he needed no help, challenges Arthur, unaware of his identity. After a long, exhausting fight, Lancelot finally asks his opponent's name, and when he learns that it is Arthur, he breaks his sword against a tree and kneels before him. They are joined by Elaine's brother Percival (Gabriel Woolf), who asks to be Arthur's knight errant.\nLater, at the circle of stone, Arthur and Modred debate before the Council of Kings. When the crowd turns against Arthur and Lancelot, they are forced to flee, vowing to take the kingdom on the battlefield. Arthur and his men lie low throughout the cruel winter, then launch their attack against Modred's men in the spring. Despite being greatly outnumbered, Arthur's men win and he is crowned the King of England. In the interest of peace, Arthur immediately pardons all his former enemies, but when Lancelot objects to Modred's pardon, the two men angrily part ways.\nFollowing the battle, Lancelot discovers that the lovely Guinevere (Ava Gardner) has been kidnapped and rescues her, unaware that she is Arthur's fiancee. Following Arthur and Guinevere's wedding, the king's joy is complete when Lancelot arrives at Camelot and pledges his allegiance anew. Arthur swears to join the select group of knights at the Round Table and England enjoys a period of peace and prosperity. One day, Percival brings Elaine to court and asks Guinevere to make her a lady-in-waiting.\n=== Morgan and Modred plot against Arthur and Lancelot ===\nMeanwhile, Morgan and Modred continue to harbor ill feelings against Arthur, and note with interest the growing warmth between Lancelot and Guinevere. Merlin privately warns Guinevere that Modred will attempt to show her suspicion and love of Lancelot. Because of this, Guinevere tells Lancelot she knows of his secret love for her and urges him to marry Elaine. Lancelot proposes to Elaine and asks Arthur to let him go to fight the Picts on the Scottish borders.\nOne night, Lancelot and Elaine are visited by Percival, who relates how a heavenly vision instructed him to go on a quest for the Holy Grail, the cup from which Christ drank at the Last Supper.\nModred calls a meeting of Arthur's enemies in Scotland and urges them to make peace so that Lancelot will be forced to return to Camelot, where he will eventually be exposed as Guinevere's lover. Word of peace reaches Arthur at Camelot at the same time that Lancelot's infant son Galahad, whose mother, Elaine, died in childbirth, is brought to court with instructions that he be sent to Lancelot's father. Sensing a plot, Merlin argues against bringing Lancelot back to Camelot, but Morgan poisons him, and the knight returns amid great fanfare.\nLate one night, jealous after seeing Lancelot kiss another woman (Lady Vivien), Guinevere goes to his rooms, unaware that is being spied on by Morgan and Modred. Lancelot angrily denounces Guinevere's folly in coming to him, and Modred's men soon arrive to arrest them for high treason. Lancelot fights them off and flees with Guinevere.\nLancelot and Guinevere are tried in absentia at the Round Table and declared guilty. Lancelot suddenly walks in and surrenders, and when he confesses his chaste love for Guinevere, Arthur revokes their death sentence. Over Modred's protest, Arthur orders that Guinevere be confined and banishes Lancelot from England.\n=== Civil war, death of Arthur and Modred, vision of the Holy Grail ===\nOutraged at this show of mercy, Modred succeeds in turning the other knights against Arthur, and civil war returns to the land. Arthur meets with Modred and agrees to his terms for ending the war, which include disbanding the Round Table. When one of Arthur's men draws his sword to kill a snake, however, the battle cry is sounded.\nArthur is mortally wounded, and Lancelot returns from exile to be at his side. With his dying breath, Arthur commands Lancelot to destroy Modred and give Guinevere his love and forgiveness. Lancelot fulfills Arthur's dying wish to hurl Excalibur into a lake. He calls on Guinevere at the convent and conveys Arthur's message, then finally kills Modred after a fierce one-on-one battle.\nLancelot meets Percival at the Round Table and weeps, blaming himself for the noble fellowship's demise. Percival receives another holy vision of the Grail and hears a divine voice telling him that Lancelot's son Galahad will be a worthy knight, and that Lancelot is forgiven and will now know peace."}