{"mid": "Kongo", "IMDB_id": "tt0023101", "title": "Kongo", "plot": "\"Deadlegs\" Flint, an embittered paraplegic who lives in the Kongo, controls the natives by using cheap tricks that appear to be magical. Assisting him with his magic tricks are his fiance Tula, two thugs, Hogan and Cookie, and a loyal native, Fuzzy.\nFlint has spent the last eighteen years planning revenge against a man named Gregg who stole his wife and took her away from the jungle. Flint has built a sixty-mile, fortified encirclement of his compound that prevents anyone from entering or leaving without Flint's consent.\nHaving seen to it that Gregg's daughter Ann is brought up innocently by nuns in a convent in Cape Town, Flint sends Hogan to bring her to his compound. In Cape Town, Hogan, dressed as a missionary, is able to convince Ann to go with him into the Kongo by saying that he will take her to her father.\nWhen she arrives at Flint's compound, Ann is held as a prisoner. After spending months confined to a brothel in Zanzibar, Ann has become a hardened alcoholic, who does Flint's bidding for whiskey, and has no idea why he has brought her to his camp and degraded her.\nWhen a cynical, drug-addicted doctor named Kingsland arrives at the camp, he and Ann fall in love. Flint, who needs Kingsland to be free from drugs in order to perform an operation on his legs, places the doctor in the swamp so that leeches can suck all of the drugs' poison out of his system. Flint also tolerates Ann's relationship with the doctor and its purifying effect, even while he ridicules her.\nSome time after the operation, Gregg arrives at the camp, summoned by Flint, who has stolen a large shipment of his rival's ivory. Flint hopes to have the ultimate revenge against Gregg by showing him his now degraded daughter, then having him killed, and having Ann burned as the sacrifice in the natives' burial ceremony. Flint taunts Gregg until Gregg finally recognizes Flint for the man he once knew as Rutledge. Years before, when Gregg was known as Whitehall, he ran away with Flint's wife after kicking Flint in the back, paralyzing him, and leaving him for dead. From that time, Flint has plotted his revenge against Gregg and the girl who he thought was Gregg's daughter.\nWhen Gregg proves, however, that Ann is actually Flint's own daughter, Flint is stunned, and begs Gregg not to leave the compound or he will be killed (Flint had earlier ordered Fuzzy to shoot Gregg if he tried to leave the compound). Gregg does not listen to his old enemy and leaves, and Fuzzy kills him.\nNow desperate to save Ann from the natives' sacrificial fire, Flint arranges for her and Kingsland to escape though a tunnel in the swamp that only Fuzzy knows. Just before Flint dies trying to keep the natives at bay, he prays that Ann will get away safely with Kingsland. Some time later, Kingsland and Ann are on a boat sailing away from Africa, about to be married by the ship's captain."}