{"mid": "Kontroll", "IMDB_id": "tt0373981", "title": "Kontroll", "plot": "Bulcsú (Sándor Csányi) is a ticket inspector on the Budapest Metro; he spends his nights sleeping on the train platforms, and hasn't left the underground ever since he started working there. His ragtag team of inspectors - consisting of the veteran Professzor (Zoltán Mucsi), the disheveled Lecsó (Sándor Badár), neurotic narcoleptic Muki (Csaba Pindroch) and dimwitted greenhorn Tibi (Zsolt Nagy) - is routinely disrespected and assaulted by the commuters, who continue to evade paying fines in a variety of ways.\nOne of Bulcsú's company rivals, model employee Gonzó (Balázs Mihályfi) challenges him to a \"rail run\": after the last metro leaves a station, the two get on the tracks and try to make it to the next station on foot before the midnight maintenance carriage runs them over. Bulcsú wins the contest, barely saving Gonzó in the last second. During a routine inspection, he is enamored by a girl dressed in a bear suit called Zsófi (Eszter Balla), the daughter of one of the veteran metro drivers, Béla (Lajos Kovács). In another occasion, Bulcsú unsuccessfully attempts to talk to his colleague Laci (László Nádasi) after Laci gets into an altercation with a passenger and takes him hostage; Laci exclaims he can't take it anymore and slits the passenger's throat.\nAfter chasing a repeat offending prankster called Bootsie (Gyalogkakukk, lit roadrunner in the Hungarian original; Bence Mátyássy), Bulcsú witnesses him being pushed on the tracks by a hooded figure, dressed in exactly the same attire as him; another incident in a long line of what people thought were apparent suicides. Because of his recurring nightmare of this figure, Bulcsú fails to apprehend the murderer, and when he's brought to questioning, he refuses to disclose details of the incident to the lead executive (György Cserhalmi) of the company. When the executive threatens to disclose the video footage of the incident, which only shows Bulcsú, he resigns his job. Muki later insinuates him being the murderer, citing his continual nightly absence and accusing him of having the same mental issues as Laci did; an infuriated Bulcsú almost pushes him on the tracks as well.\nDuring an underground costume party, Bulcsú spots and follows the hooded figure and they get into an altercation, after which they start rail running similarly to the contest with Gonzó earlier. Bulcsú wins again; the hooded figure never emerges from the tracks. Bulcsú meets Zsófi, who is now dressed as a butterfly, and the two finally emerge back to the surface."}