{"mid": "KPax", "IMDB_id": "tt0272152", "title": "K-PAX", "plot": "In 1990, a white male is picked up by the New York Police after being found bending over the victim of a mugging at Grand Central Terminal in midtown Manhattan. After responding to the police questions with somewhat strange answers, he is transferred to Bellevue Hospital for evaluation. Although not physically ill, he is found to harbour the strange delusion that he is from a planet called K-PAX in the constellation of Lyra. The patient, who calls himself \"prot\" (intentionally lower-case to reflect the insignificance of an individual life form in the universe), is eventually transferred to the Manhattan Psychiatric Institute (MPI), where he becomes the patient of Dr. Gene Brewer.\nProt is extremely fond of fruit, including banana skins and apple cores, which he eats during each session. He tells Brewer that he is 337 (Earth) years old, that he has visited Earth often, and that on this visit he has traveled to most of the world's countries for the past 4 years and 9 months. He has a good sense of humor (during their first session, he says, \"But don't worry - I'm not going to leap out of your chest,\" an allusion to the film Alien). Brewer discovers that prot also possesses arcane information about astronomy, which, later, astronomers become very excited about; prot appears to be a savant. Prot also claims to understand most human languages (at least enough to get by) as well as the languages of animals, including whale song, and the apparent gibberish of some of the patients with schizophrenia.\nThough prot's dialogue is usually satirical, he turns out to be highly suggestible and easily hypnotized. Once Brewer learns this, he begins more serious therapy.\nBrewer, with the help of a journalist named Giselle Griffin, discovers that prot may be an alter ego (the result of Multiple Personality Disorder) of Robert Porter, whose life has been devastated by the murder of his wife and child and his subsequent killing of the perpetrator. Brewer speculates that the name prot is \"derived, presumably, from Porter.\"\nWhen prot \"returns\" to his own planet, Robert Porter is left in a catatonic state. However, Bess (another patient prot had promised to take with him) disappears along with a box of souvenirs prot has been collecting.\nProt promises to return in \"about five of your years.\""}