{"mid": "KuboAndTheTwoStrings", "IMDB_id": "tt4302938", "title": "Kubo and the Two Strings", "plot": "A woman (voice of Charlize Theron) is riding in a boat through the ocean on a stormy night with her baby boy resting on her back. A huge wave rises, but the woman strums her shamisen and makes the water part to let her pass. Moments later, the wave returns and crashes down on her from behind. The woman hits her head on the rocks underwater and washes up on the shore. She crawls over to her crying child, who only has one eye.Years later, the boy, Kubo (voice of Art Parkinson), takes care of his mother, who is very sick. They live in a cave by the edge of a cliff by a Japanese village. Kubo's eye was taken by his grandfather when he was a baby.Kubo heads into the village with several origami figures he created. The villagers gather around Kubo as he begins to tell a story, bringing his characters to life when he strums his shamisen. The story tells of a samurai named Hanzo who was very heroic and battled countless enemies, vanquishing all of them. Hanzo possessed three elements to a powerful armor - his sword, breastplate, and helmet. As the story draws near an end, Hanzo is set to battle his nemesis, The Moon King, but, before Kubo can finish his story, the sun starts to set and Kubo leaves, disappointing the villagers.When Kubo returns home, his mother tells a story of his father, who happened to be Hanzo. Her father, The Moon King, and her evil sisters wanted to kill Hanzo, but the mother wouldn't allow it, and The Moon King would later take Kubo's eye. Later at night, Kubo's mother talks in her sleep, causing Kubo's papers to come to life. Kubo wakes his mother, and she asks him what happened to his eye.Kubo joins the villagers in honoring the spirits of their loved ones with lanterns. One man, Hosato (voice of George Takei), is honoring the spirit of his mother while explaining the purpose to his own daughter. Kubo tries to honor his father and waits for him to bring him some form of guidance. When Kubo doesn't get an immediate response, he becomes upset and crumples the paper lantern. However, while all this is happening, Kubo has lost track of time and the sun has set without him being back in his cave. Moments later, a cloud of darkness forms around the area. Kubo's aunts, The Sisters (voice of Rooney Mara), emerge and try to get Kubo. Kubo runs to warn the villagers, but The Sisters start attacking. Kubo's mother runs in to save her son. She uses her magic to give him wings to get him out of there. As he starts to go he reaches out but only snatches a strand of her hair before he is gone. She then battles her sisters and disappears in a powerful blast of energy.Kubo awakens to find Monkey (also Charlize Theron) standing over him, saying that his village is destroyed and that he needs to go with her. Monkey brings Kubo inside a whale carcass for shelter. Kubo learns that Monkey was brought to life from a wooden charm that Kubo kept with him. His mother used the last of her magic to bring Monkey to life. She is there to protect Kubo and help him find his father's armor to defeat his grandfather and aunts. When Kubo shows her the hair from his mother, Monkey weaves it into a bracelet for Kubo as a memory of his mother.Kubo and Monkey head off on their quest. He pesters her by making origami birds and mosquitoes sting her. Kubo is then taken into a cave by a mysterious figure. Monkey thinks the creature is trying to harm Kubo, but she learns quickly that this is not the case. They meet Beetle (voice of Matthew McConaughey), a samurai with little memory is his past, only remembering that he trained under Hanzo and was cursed with the form of a beetle. When he learns Kubo is Hanzo's son, he decides to join Kubo and Monkey in finding Hanzo's armor.The first thing Kubo must find is Hanzo's sword. They are guided by one of Kubo's origami figures that represents Hanzo. The three come by another cave that looks like a skull. Inside, they see a sword stuck inside a floating skeletal hand. Beetle pulls the sword out, but this brings to life a massive skeleton monster. Monkey takes the sword and swings it at the monster, but it shatters, proving that this is not the sword they need. They see that the monster has numerous swords sticking in its skull. As they try to avoid the monster, they pull out all the swords and try to fight, but they all shatter. Kubo finally pulls out the right sword, causing the monster to fall apart.Kubo creates a ship from many leaves. The three set sail to find the next piece of armor. On the ocean, Beetle shows Kubo how to use a bow and arrow. They use this skill to catch fish with a rope attached to the bow. Monkey uses the sword to cut the fish up.The Hanzo figure points out that the breastplate is underwater, surrounded by many eyes. Kubo and Beetle head underwater to find the breastplate. Kubo finds it and puts it on, but the creature with many eyes puts Kubo in a trance and tries to consume him. Beetle pierces the eyes as he swims to save Kubo. Meanwhile, one of The Sisters finds the ship and begins to fight Monkey. The Sister calls Kubo's mother a traitor for falling in love with Hanzo and that killing Monkey would bring her no honor. Monkey fights back and defeats The Sister with another powerful magic blast. Beetle then resurfaces with Kubo, who is unconscious. Monkey cradles Kubo and begs for him to wake up. As he does, Kubo realizes that Monkey is really his mother in a new form.The heroes find a place to rest. Monkey tells Kubo the story of how she was sent by her father to kill Hanzo with her sisters, but she and Hanzo fell in love, instead, angering The Moon King, who is said to be incapable of seeing humanity. Kubo then goes to sleep. Beetle sees that Monkey is wounded from the fight with her sister, and she knows she doesn't have much time left, with only a little bit of magic keeping her alive.Kubo dreams that he meets The Moon King (voice of Ralph Fiennes), who is apparently blind. He tells Kubo he will find the helmet at his father's fortress.The heroes continue their quest. They come to Hanzo's fortress, but they are found by the other Sister. Monkey fights her and is mortally wounded. As she lays dying, The Sister reveals that Beetle is really Hanzo. He looks at Monkey and tells her the same words that caused her to fall in love with him - \"You are my quest.\" Beetle vows to protect Kubo, but The Sister impales him with a sword. As she raises the sword to deliver the fatal blow to Monkey, Kubo grabs the shamisen and strums it, breaking 2 of the 3 strings and sets of a huge blast that eliminates The Sister.When the dust has settled, Kubo sees that his parents are now truly gone. The crushed Hanzo oragami points to a paper. When Kubo looks at he, he realizes the helmet is back in his old village. He picks up the word and the string from the broken bow of his father and adds it as another bracelet along with his mothers hair as a memory of him. Then he strums his shamisen, breaking the last string to make wings and flies back to his village.Back in the village, where the townspeople are hiding in fear from The Moon King. Kubo dons his father's completed armor and comes face to face with his grandfather. The Moon King offers Kubo a chance to join him in the heavens and to abandon humanity. Kubo refuses, so The Moon King takes the form of a gigantic creature that tries to kill Kubo. The boy uses his sword to cut into the beast but Kubo is knock into the forest. As he gets up an starts to grab his sword, he stops and looks between the string-less shamisen and the two bracelets on his wrist. Coming to a decision, he uses the bracelets from his mother and father to restring the shamisen. Finally, he pulls out one of his own hairs to make the third and final string. As the Moon King comes to finish him, with the villagers looking from behind the trees, Kubo uses his shamisen with magic powerful enough to summon the spirit memories of the villagers' loved ones. Together, their force is strong enough to hold The Moon King back. The spirits overwhelm The Moon King and leave him without memory of how he got there or who he is. Kubo and the villagers tell his grandfather that he is a kind man beloved by all the people in town, and that his grandson is a hero.Kubo once again joins the villagers in honoring loved ones. He sets lanterns for his parents and tells them his own story. The spirits rise from the lanterns and Kubo is standing alongside both his parents."}