{"mid": "Kuffs", "IMDB_id": "tt0104647", "title": "Kuffs", "plot": "George Kuffs (Slater) is an irresponsible 21-year-old high school dropout from San Francisco who walks out on his pregnant girlfriend Maya Carlton (Jovovich). Having lost his last job and with no prospects he visits his brother Brad (Bruce Boxleitner), who serves as an officer in the San Francisco Patrol Special Police, a civilian auxiliary police unit that sees potential officers assign themselves specific areas and work on a for-hire basis. Brad is not willing to loan George any money, though, and suggests George join him as a Patrol Special and work under him. Before George can decide whether to accept the offer, a man named Kane (Leon Rippy) shoots Brad in a church. George runs into the church to try to help Brad as Kane nonchalantly walks away from the scene, and Brad is rushed to the hospital for emergency surgery.\nGeorge is brought in for a lineup where he identifies Kane as the shooter, but things quickly go from bad to worse as the police are forced to release Kane because George did not actually see him fire the gun. Shortly after this, George is told by Captain Morino (Troy Evans), a friend of his brother's, that Brad has died from his injuries. Morino also tells George that he has been bequeathed the district Brad patrolled. Shortly after a local businessman named Sam Jones (George de la Pena) decides to try and purchase the district so he can control it, but George decides to keep it and train to be a police officer. Predictably, things do not go smoothly as George draws the mocking of his fellow Patrol Specials and the ire of Officer Ted Bukowsky (Tony Goldwyn), a police liaison who has been assigned to work with the Patrol Specials as punishment for having an affair with the police chief's wife (Alexandra Paul).\nAfter George is shot by a suicidal writer, things slowly begin to change. He reconnects with Maya, who has broken up with her new boyfriend, and then manages to kill Kane when the latter tries to ambush him at his apartment. He also cracks a huge criminal enterprise run by Sam Jones out of a Chinese dry cleaner, which gains him the respect and admiration of his fellow police. However, his joy is short lived when Jones decides to drop a bombshell on the Patrol Specials and hand them George's high school transcript, which renders him ineligible to be a police officer because he dropped out of school. Sam then declares he will take control of the district.\nGeorge is eventually kidnapped and seeks out a now-suspended Ted for help. This culminates with a massive rooftop shootout between Sam Jones' goons and the two officers, who are eventually joined by the rest of the unit. George corners Sam in the lowest level of a parking garage and, despite being wounded in the arm, fatally shoots Sam.\nThe movie ends with a much more responsible George having married Maya and now the proud father of a baby girl, named Sarah. At Maya's suggestion, he has passed the high school equivalency exam, allowing him to continue working as an officer, and has taken out a loan to expand his brother's district."}