{"mid": "KullTheConqueror", "IMDB_id": "tt0119484", "title": "Kull the Conqueror", "plot": "Kull battles for the right to join Valusia's elite Dragon Legion until he told General Taligaro that he is a barbarian from Atlantis, the general explaining that only 'noble blood' is accepted. Taligaro then learns that the Valusian King Borna has gone mad and is slaughtering his heirs, riding to Valusia with Kull following. The confrontation that followed ends with Kull mortally wounding Borna, whose final act was naming Kull his successor at dismay of Taligaro and his cousin. Soon after, Kull meets his harem and recognizes the foreseeker Zareta who foretold his kingship. Kull summons her to his chambers and learns from her fortune telling that the fate of his kingdom would depend on a kiss, attempting to kiss Zareta before dismissing her when she reminds him that she is a slave and acts only out of command.\nThe next day, Kull attempts to free his slaves before finding that his rulings are hampered by the stone tablet detailing the laws of Valusia. Furthermore, Taligaro and his cousin secretly attempted to assassinate Kull during his crowning ceremony. Taligaro and his conspirators are then summoned the following night by the necromancer Enaros who offers to aid them by resurrecting Akivasha, the Sorceress Queen of the ancient Acheron Empire which the god Valka destroyed ages before Valusia was built on its remains. Using Taligaro's group to suit her ends to gain power and restore Acheron, Akivasha uses her magic to enchant Kull and become his queen. Akivasha then placed Kull in a death-like slumber, framing Zareta of \"regicide\" while taking Kull to her abode to keep as plaything.\nBut Kull escapes and with the help of the Valkan priest Ascalante, Zareta's brother, frees Zareta as the trio head north via the ship of Kull's untrusting associate Juba to obtain the Breath of Valka to stop Akivasha from regaining her full power. But Akivasha sends Taligaro after them, the general killing Ascalante while leaving Kull to die as he spirits away Zareta. As Zareta took in the Breath of Valka, Taligaro intended to use her to betray Akivasha and take the Topaz Throne. On the day of the eclipse, Kull returns to Valusia as Akivasha gradually begins assuming her true demonic form despite Taligaro's attempt to kill her with Zareta. After Kull wounded Taligaro and killed Enaros, he checks on Zareta and she kisses him. This passes the Breath of Valka to Kull, who kisses Akivasha to transmit Valka's breath and extinguish her flame. Kull then kills Taligaro when he attempts to take Zareta hostage, removing the last opposition to his rule. After being reinstated as king, Kull smashes with his ax against the Tablets of the Law, abolishing slavery in Valusia while naming Zareta his queen."}