{"mid": "KumikoTheTreasureHunter", "IMDB_id": "tt3263614", "title": "Kumiko, the Treasure Hunter", "plot": "Kumiko is a twenty-nine year old office lady who lives in utter solitude in Tokyo. She works a dreadful, dead-end job under a boss she hates, is intimidated by her well-off peers, and nagged by her overbearing mother to find a man and get married. The only joys in her life come from her pet rabbit, Bunzo, and a VHS copy of the film Fargo, which she found in a secluded cave on the shore. Convinced the film is based on a true story, Kumiko obsesses over a scene in which a character played by Steve Buscemi buries a satchel of ransom money along a snowy highway and begins taking notes while watching the worn-out tape. Kumiko even attempts to steal an atlas from a library, only to be caught by the security guard, who pities her and allows her to take the page on Minnesota.\nWith the threat of a young hire usurping her position at work and increasing pressure from her unsympathetic mother to return home, Kumiko abandons Bunzo on a train and boards a plane to Minneapolis using her boss's company card. With a hand-stitched treasure map and a quixotic spirit, Kumiko embarks on a journey over the Pacific and through the frozen Minnesota plains to find the purported fortune. Once there, she quickly finds herself unprepared for the harsh winter, having a weak grasp of English, and, with the card cancelled, lacking funds. She is picked up by an old lady, but sneaks off when the lady tries to convince her to stay at her home.\nA sheriff's deputy picks her up after a passerby reports her wandering through the streets and tries to help her, believing her to be lost. She shows him the film and he attempts to understand her, gaining her trust. The officer takes her to a Chinese buffet restaurant, erroneously believing that someone there would be able to speak Japanese, to explain to her that the film is fiction. While at the restaurant, Kumiko calls her mother from a payphone hoping that she would be able to wire her money only for her mother to accuse her of theft from her workplace and further criticize her for being unmarried. This leads to Kumiko breaking down in front of the officer. While buying her winter attire, Kumiko kisses the officer, but he explains that he is married and tries again to explain to her that the treasure isn't real; she becomes upset, runs from the store and leaves in a taxi. The deaf taxi driver drives towards Fargo and when they stop and she is unable to pay the fare, she flees across a field. She soon wanders across a frozen lake where, while looking through the ice, she sees what appears to be a suitcase. Convinced that this is the treasure, she spends a long time attempting to break the ice, only to find a badly decayed oar.\nThat night, during a snowstorm, Kumiko wanders deeper into the forest and next morning the camera shows only a human-sized mound of snow. In the following scenes, Kumiko emerges from the snow, takes a ski lift to what appears to be the setting of the Fargo scene and sees the marker indicating the location of the treasure. She finds the satchel containing the money. Overjoyed with her triumph, she exclaims \"I was right after all\". She then sees her pet rabbit Bunzo and, reunited with him, proudly walks into the distance."}