{"mid": "LadyInTheLake", "IMDB_id": "tt0039545", "title": "Lady in the Lake", "plot": "Tired of the low pay of his profession, hard-boiled private detective Phillip Marlowe (Robert Montgomery) submits a murder story to Kingsby Publications. He is invited to the publishers’ offices to discuss his work but soon realizes it is merely a ploy. A few days before Christmas, publishing executive Adrienne Fromsett (Audrey Totter) hires him to locate the wife of her boss, Derace Kingsby (Leon Ames).\nOne month earlier, Kingsby’s wife, Chrystal, had sent her husband a telegram saying she was heading to Mexico to divorce him and marry a man named Chris Lavery (Dick Simmons). But, according to Fromsett, Lavery says he hasn't seen Chrystal for two months; she's missing, and the telegram appears to be a fake.\nIt quickly becomes obvious to Marlowe that Fromsett wants her boss for herself (for his money - as she later admits).\nWhen Marlowe goes to see Lavery, the Southerner claims to be unaware of any trip to Mexico. And he has a slip of the tongue and says Mrs. Kingsby WAS a beautiful woman, then revises it to an \"is\". Then Lavery sucker punches the detective. Marlowe wakes up in jail, where he is questioned by Captain Kane (Tom Tully) and a belligerent Lieutenant DeGarmot (Lloyd Nolan). When Marlowe refuses to divulge anything about his case, Kane warns him not to cause trouble in his district and releases him.\nMarlowe learns that the body of a woman has been recovered from a lake owned by Kingsby and Kingsby's caretaker there charged with the murder of his wife Muriel. Fromsett suspects that Chrystal is the real killer, as she and Muriel hated each other. Little Fawn Lake was also where Chrystal was last seen. Marlowe investigates and reports to Fromsett that Muriel was an alias for a woman named Mildred Havelend and that she was hiding from a tough cop – whose description fits DeGarmot.\nMarlowe goes to call on Lavery again. Inside the unlocked house, he instead encounters Lavery's landlady, Mrs. Falbrook, holding a gun she claims to have just found. Upstairs, he finds Lavery dead in the shower, shot several times. He also finds a handkerchief with the monogram \"A F\".\nBefore calling the police, he interrupts a Christmas party at the publishing house to confront Fromsett. In private, she denies killing Lavery. Kingsby comes in and, after learning that Fromsett hired Marlowe to find Chrystal, tells her theirs will be strictly a business relationship from now on. A furious Fromsett fires the private eye. Marlowe immediately gets another job; Kingsby hires him to find his wife.\nMarlowe then informs the police of Lavery's death. At the scene, he suggests that Muriel was hiding from DeGarmot. The two men scuffle, before Kane separates them and sends Marlowe on his way.\nMarlowe obtains more information on Muriel from a newspaper contact. It turns out that Muriel had been a suspect in the suspicious death of her previous employer's wife - a woman named Florence. The investigating detective, DeGarmot, ruled that death a suicide; but the victim's parents strongly disagreed.\nWhen Marlowe goes to question them, he finds they have been intimidated into keeping silent. Afterwards, he is run off the road by DeGarmot. Regaining consciousness after the crash, he manages to get to a telephone and call Fromsett for help. She takes him back to her apartment, where she tells him that they have much in common and that she has fallen in love with him. They spend Christmas Day together while he recovers from his injuries.\nKingsby shows up and informs Marlowe he has received a telegram from his wife, asking for money. Marlowe agrees to drop it off, as Kingsby is being followed by police detectives. Placing his life in Fromsett's hands, Marlowe instructs her to have the police follow him after ten minutes, following a trail of rice he will leave behind.\nThe woman Marlowe meets (and who had asked for money from Kingsby) turns out to be Mildred Havelend, alias Mrs. Falbrook, alias Muriel and is the one who killed Chrystal (the \"lady in the lake\"), Florence (her former employer's wife), and Lavery.\nDeGarmot was in love with Havelend and helped her cover up the first murder, but she fled from him and married Kingsby's caretaker, Mr. Chess.\nDeGarmot tracks down Marlowe and Havelend (having overheard Fromsett speaking to Captain Kane and following Marlowe's trail of rice grains). DeGarmot plans to kill Marlowe and Havelend with Havelend's gun and stage it to look like they shot each other. DeGarmot murders Mildred, but Captain Kane gets there just in time to gun down his own crooked cop. Marlowe and Fromsett leave for New York to start a life together."}