{"mid": "LaHaine", "IMDB_id": "tt0113247", "title": "La haine", "plot": "The film depicts approximately 19 consecutive hours in the lives of three friends in their early twenties from immigrant families living in an impoverished multi-ethnic French housing project (a ZUP – zone d'urbanisation prioritaire) in the suburbs of Paris, in the aftermath of a riot. Vinz (Vincent Cassel), who is Jewish, is filled with rage. He sees himself as a gangster ready to win respect by killing a cop, manically practising the role of Travis Bickle from the film Taxi Driver in the mirror secretly. His attitude towards police, for instance, is a simplified, stylized blanket condemnation, even to individual policemen who make an effort to steer the trio clear of troublesome situations. Hubert (Hubert Koundé) is an Afro-French boxer and small-time drug dealer, the most mature of the three, whose gymnasium was burned in the riots. The quietest, most thoughtful and wisest of the three, he sadly contemplates the ghetto and the hate around him. He expresses the wish to simply leave this world of violence and hate behind him, but does not know how since he lacks the means to do so. Saïd – Sayid in some English subtitles – (Saïd Taghmaoui) is an Arab Maghrebi who inhabits the middle ground between his two friends' responses to their place in life.\nA friend of theirs, Abdel Ichaha, has been brutalized by the police shortly before the riot and lies in a coma. Vinz finds a policeman's .44 Magnum revolver, lost in the riot. He vows that if their friend dies from his injuries, he will use it to kill a cop, and when he hears of Abdel's death he fantasizes carrying out his vengeance.\nThe three go through an aimless daily routine and struggle to entertain themselves, frequently finding themselves under police scrutiny. After Vinz nearly shoots a riot policeman and the group narrowly escapes, they take a train to Paris but encounter many of the same frustrations, and their responses to interactions with both benign and malicious Parisians cause several situations to degenerate to dangerous hostility. A run-in with sadistic plainclothes policemen, during which Saïd and Hubert are humiliated and racially as well as physically abused, results in their missing the last train home and spending the night on the streets. They sleep in a shopping mall and wake to a news broadcast informing them that Abdel is dead. They later travel to a roof-top from which they insult skinheads and policemen, before later encountering the same group of racist anti-immigrant skinheads who begin to beat Saïd and Hubert savagely, now that the balance of power has shifted. Vinz suddenly arrives, and his gun allows him to break up the fight; all the skinheads flee except one (portrayed by Kassovitz himself) whom Vinz is about to execute in cold blood. His dream of revenge is thwarted by his reluctance to go through with the deed, and, cleverly goaded by Hubert, he is forced to confront the fact that his true nature is not the heartless gangster he poses as, and he lets the skinhead flee.\nEarly in the morning, the trio returns to the banlieue and split up to their separate homes, and Vinz turns the gun over to Hubert. However, Vinz and Saïd encounter a plainclothes policeman, whom Vinz had insulted earlier in the day whilst with his friends on a local rooftop. The policeman grabs and threatens Vinz, making reference to the earlier incident on the roof. Hubert rushes to their aid, but as the policeman holding Vinz taunts him with a loaded gun held to Vinz's head, the gun accidentally goes off, killing Vinz instantly. Hubert and the policeman slowly and deliberately point their guns at each other, and as the film cuts to Saïd closing his eyes and cuts to black, a shot is heard on the soundtrack, with no indication of who fired or who may have been hit. This stand-off is underlined by a voice-over of Hubert's slightly modified opening lines (\"It's about a society in free fall...\"), underlining the fact that, as the lines say, jusqu'ici tout va bien (so far so good); i.e. all seems to be going relatively well until Vinz is killed, and from there no one knows what will happen, a microcosm of French society's descent through hostility into pointless violence."}