{"mid": "LaidToRest", "IMDB_id": "tt1228933", "title": "Laid to Rest", "plot": "The film begins with a credits sequence showing women being assaulted, before moving to The Girl (Bobbi Sue Luther) waking up inside a coffin in a funeral home. The funeral director (Richard Lynch) hears this, and exits the room. The Girl manages to knock the coffin over, and crawls out. She crawls to the exit, only to find it locked, but the door to the adjacent room is open, so she goes in there instead.She picks up the phone and dials 911, where she is unable to report what has happened to her due to amnesia. The operator offers to send a police car to her, but she accidentally pulls the phone off the hook before they can find out where she is. She walks over to the door, but Chrome Skull (Nick Principe) sees her and rushes to the door. He tries to get it open, but fails, and she sits down on the floor. When he goes away, she throws the phone down, and the funeral director returns to let her in. He puts the keys in the door, only for Chrome Skull to appear behind him. The Girl attempts to warn him, but he tells her no one is there, and Chrome Skull kills him. Chrome Skull tries the door, but The Girl pushes it into his head and knocks him out, before running away.She runs into the street, where she is picked up by Tucker (Kevin Gage), and she tells him she had been locked in a box. He takes her home, where she meets his wife, Cindy (Lena Headey). At first, Cindy is nasty towards her, but after Tucker explains the situation, she calms down, and allows The Girl to take a shower. She tells The Girl that she doesnt have a phone because the phone company cut them off, but her brother Johnny (Jonathon Schaech) will be over in the morning, and he can take her into town.The Girl goes for a lie down, and gets upset, so Tucker comes in to comfort her. When he has finished, they notice Cindy has disappeared. They go outside to find that Chrome Skull has her. Chrome Skull tries to get Tucker to give The Girl up in exchange for his wife, but he refuses. Tucker tries to attack Chrome Skull, but he stabs Cindy in the head and pins her to the house. The Girl drags Tucker away, but Chrome Skull comes forward. Tucker hits him with his walking stick and he falls down some stairs. Tucker and The Girl get into Tuckers truck and drive away.Meanwhile, Johnny and his girlfriend Jamie (Jana Kramer) arrive at Cindys house. Johnny goes to investigate Chrome Skulls car, and then comes back to his own car, where Chrome Skull cuts off his face. Jamie crawls on to the back seat, and reaches for the phone, but Chrome Skull stabs her in the hand. She gets out of the car, and cannot see him, so she runs into the garden, where he cuts her with his knife. She carries on running only to find that he has cut her stomach open and her intestines are hanging out.Tucker and The Girl arrange to go to the next house, where Steven (Sean Whalen) answers the door. He invites them in and tells them he can use his computer to contact the police. They tell him that Cindy has died and a man with a shiny face has killed them and wants to kill her too. While she goes to the toilet, they report the crime on the computer. They then look for more information on Chrome Skull, and look for missing people that match The Girls description. The site tells them that Chrome Skull has killed over 31 girls so far and filmed their deaths.They go to the police station in Stevens car and look for the Sheriff, who radios in a report. Tucker answers it, and reports the crime. The Sheriff tells them he is locked in the supply closet. The Girl finds a body in a cell with a camera strapped to it, and then they hear someone behind them, and Tucker tells them it isnt the Sheriff. He radios the Sheriff again, who says he is locked in the supply closet. As Steven enters the closet, which is empty, the cell door opens and the camera comes on, just as Chrome Skull appears and dashes towards The Girl. He slices her, but Tucker knocks him over and into the cell. He and The Girl escape, inadvertently locking Steven in, so The Girl goes back to get him and Steven stabs Chrome Skull in the leg.They drive to the funeral home, where Tucker dresses The Girls wounds, and Steven sees his mothers corpse in a hearse next to his car. Tucker reassures The Girl that no one is going to kill her, and hugs her. Chrome Skull arrives and takes Stevens mothers corpse into his lair at the side of the funeral home.Tucker goes home to clear up the mess in case Johnny sees it (he doesnt know Johnny is already dead), and The Girl decides to stop Chrome Skull. She enters his lair and tries to rescue a woman, but he approaches them, so she runs away. He then decapitates the woman. The Girl hides inside a coffin and he drills a hole in the top before putting a camera on there.Tucker arrives back with a gun and shouts at Steven for not looking after The Girl. They enter Chrome Skulls lair and Tucker shoots him twice. They get the girl out of the coffin and steal Chrome Skulls car, where they find a new phone. They go to Stevens house, and The Girl waits in the car. She watches a video of the funeral director telling Chrome Skull that the Sheriff was on to their plan. Then she inputs the destination of the nearest store into the GPS and sets off towards it.Tucker and Steven find her gone and go after her on foot. Meanwhile, Chrome Skull gets into a hearse and syncs the two GPS machines so he can track his car, before driving off to find it. Tucker and Steven attempt to get a lift from Tommy (Thomas Dekker) and Anthony (Anthony Fitzgerald), who drive away.The Girl pulls up at the store and tries to get out, but the doors are locked. She tries to get the attention of the Clerk (Lucas Till), by beeping the horn, but he cant hear her. When Tommy and Anthony arrive she tries to get their attention too, but they ignore her and enter the store. Chrome Skull arrives next and enters the car. He gives her a message to get some tapes, and sends her into the store. She puts the phone on the counter and asks for the tapes, but he sends her a threatening message, which the Clerk sees. The Clerk goes outside with a rifle and threatens Chrome Skull, but Chrome Skull grabs the gun and points it at his head just as he is about to fire it, causing him to shoot himself in the head. Inside, Anthony manages to call the police and reports the crime, before locking the front door.As Tucker and Steven arrive, Anthony goes to check the back exit, and is decapitated by Chrome Skull. Tommy initially refuses to let them in, but The Girl says she knows them. She apologises for driving away, and Tucker hugs her again. Steven then mixes some acid that will cause someones face to burn, before they get a message on the phone. He goes to answer it, but Chrome Skull sprays tyre sealant into his ears, causing his head to explode. Tucker tells Tommy to bring his car to the door and not to leave until The Girl gets out. Tucker fires at Chrome Skull but runs out of ammo, and tells The Girl to leave, but she refuses.She tells him Chrome Skull will never stop, but he tells her (knowing her real identity) that she is somebody great, and not to forget it. He attacks Chrome Skull, but Chrome Skull gets the upper hand and stabs him in the chest. The Girl climbs into the fridge, and Chrome Skull puts a camera in there. She watches the video and it is revealed that she is just a prostitute.Chrome Skull then starts to use the acid, thinking it is glue, to glue his mask back on. When he puts it on, his face begins to melt and he falls to the ground. The Girl climbs out of the freezer and grabs a baseball bat, hitting him in the face and causing his head to smash. She then gets into Tommys car and they go to Atlanta with her in Anthonys place."}