{"mid": "LakeMungo", "IMDB_id": "tt0816556", "title": "Lake Mungo", "plot": "Sixteen-year-old Alice Palmer drowns while swimming with her family at a dam in Ararat, Australia. After she dies her teen brother Matthew uses cameras set about the house to record what seem to be images of Alice's ghost appearing in the family home. It's discovered that Matthew was actually setting up the \"sightings\" of his dead sister to give the family reason to exhume Alice's body and give his mother closure.\nUpon closer review, one of the hoax video tapes captures the Palmer's neighbor Brett in Alice's bedroom looking for something. Alice was often a babysitter for Brett's and his wife's child. After a search, Alice's mother finds a video tape hidden in the bedroom showing Alice in a sexual encounter with Brett and his wife.\nA psychic that the family had contacted earlier, when they were unsure if Matthew's films were real, finally admits that Alice had met with him several months before her death and had told him she was having dreams about drowning, being dead and her mother not being able to see or help her. Alice's boyfriend comes forward with cell phone video footage showing Alice on a school trip to Lake Mungo. The video shows Alice extremely distraught as she frantically digs into the sand at the base of tree with her bare hands.\nAlice's family travels to Lake Mungo and finds the tree seen in the cellphone video. Digging at its base they discover Alice had buried her cell phone. The video footage on Alice's cell phone shows her walking down the darkened shoreline of the lake by herself using her cellphone as a flashlight. She comes upon a figure in the distance and walks up to it. The light from the cellphone reveals the figure is Alice herself but appearing bloated and dead just as Alice's body had been after being recovered from the lake in the beginning of the film.\nAlice's family then goes home and moves out of their house, feeling that Alice had simply wanted them to know who she really was and what she had seen. The film's mid-credit scenes reveal that Alice had actually manifested in Matthew's hoax pictures and videos without anybody noticing."}