{"mid": "LaSoupeAuxChoux", "IMDB_id": "tt0083109", "title": "La soupe aux choux", "plot": "Claude Ratinier (Louis de Funès), known as Le Glaude, is an old man who lives on a small farm across the road from his long-time friend Francis Chérasse (Jean Carmet), known as Le Bombé. The two are described as the last surviving members of their breed, still living in a rural fashion while the rest of the world has modernized. They spend their days getting drunk and eating cabbage soup, while they spend their nights getting drunk and farting.\nOne night, their farting summons an alien (Jacques Villeret) from the planet Oxo while Le Bombé is asleep. Glaude is awake to welcome the alien (who can only communicate in a squealing-siren sound at first). Surprised Glaude communicates with him through rough sign language. Glaude then sends the alien off with a canister full of cabbage soup. The next day, we find out that Bombé had seen the flying saucer and Glaude tells him that there was no such thing. He goes to the police but he is dismissed by them as a loony. When he realizes that no one believes him he becomes very sad and Glaude is worried about him. Glaude then tricks him into hanging himself while he secretly cuts the rope so that he falls when he puts his weight on it. It's to show him that he doesn't want to die.\nThe alien returns several times because of the cabbage soup that he was given. On his planet they eat minerals and to them cabbage soup is the most amazing thing ever. On the second meeting the alien has learned French and we are told that on his planet they live to 200, no more, no less. But trouble brews when the alien arranges to have Glaude's late wife resurrected at the age of 20. She runs away to Paris with a young man within a day of her resurrection. He also duplicates the Glaude's gold coin hundreds of times, making Glaude rich. Finally (because of the effect of the delicious cabbage soup on Oxo), the alien offers Glaude, Bombé, and their cat residence on Oxo so that they could grow their cabbage and make cabbage soup. This would allow them all to live to the age of 200. Glaude initially rejects the proposition outright.\nMeanwhile, the mayor of the rural town decides to modernize. He plans a new housing project directly on the old men's land. Although he threatens to put them in a cage like monkeys, he cannot convince them to give up their land. He decides to simply build around their houses and fence them off from the rest of the neighborhood. They become a thing of curiosity, with people jeering at them and throwing popcorn at them whenever they step outside of their doors. This sad destruction of their peaceful home convinces Glaude to accept the alien's offer.\nHe tells Bombé about their option, who is utterly unconvinced, but opens up to the idea when he sees the communicator left by the alien. Before leaving, Glaude makes a last stop at the post office to send his wife a package containing the gold they were given by the alien. The film ends with Glaude, Bombé, their cat and the alien flying off into space inside the flying saucer, joyous and drinking."}