{"mid": "LastHoliday", "IMDB_id": "tt0042665", "title": "Last Holiday", "plot": "George Bird (Guinness), an ordinary, unassuming salesman of agricultural implements, visits a physician for a routine check-up and is told he has Lampington's Disease, a newly identified condition which allows him only a few weeks to live. He accepts the doctor’s advice to take his savings and enjoy himself in the little time left to him. A bachelor with no family or friends, Bird decides to spend his last days at an up-market residential hotel among its elite clientele.\nBird’s unassuming attitude generates a great deal of interest among the hotel's residents. He is seen as an enigma to be solved, with wild speculations offered as to his identity and possible noble lineage. The hotel's housekeeper (Walsh) guesses the truth, and Bird confides his secret to her. Bird quickly acquires friends and influence, falls in love (possibly for the first time in his life), sets wrongs to right, and is offered lucrative business opportunities. But these successes only serve to make him reflect on the irony that he will have no time to enjoy them.\nDuring a strike by the hotel's staff, Bird comes into contact with Sir Trevor Lampington (Thesiger), the doctor after whom Lampington's disease was named. Lampington insists that Bird cannot possibly have the disease as he has no symptoms, and contacts the hospital to ask them to check. Just as the hospital discover their error Bird enters and it is confirmed that he indeed was given the wrong diagnosis. Overjoyed, he is ready to begin life afresh with his new sweetheart, friends and business opportunities. In a twist ending, however, he is killed in a car accident on the way back to the hotel, whilst taking a short-cut through the sleepy village of Fallow End. Meanwhile, the hotel guests, having learned the truth about Bird's identity and misdiagnosis, quickly begin to cast aspersions on him, but are interrupted with the news that he has died, which silences their gossip."}