{"mid": "LastShift", "IMDB_id": "tt2965466", "title": "Last Shift", "plot": "Jessica Loren, a rookie police officer on her first assignment, is ordered to take the last shift at a police station before it is permanently closed. Her mother pleads with her not to take the job, as her father, also a police officer, was killed while on duty. After assuring her mother that the shift will be uneventful, she reports for duty. After Loren surprises her commanding officer, Sgt. Cohen demands that she turn around. Apparently satisfied, he leads her on a brief tour, during which he explains that a HAZMAT team will be there shortly to collect evidence that is difficult to dispose of. Under no circumstances is she allowed to leave her post. Before Cohen leaves, he gives her his phone number in case of emergency.\nLoren becomes bored and almost falls asleep, though she wakes when she hears knocking. She sees nobody at the door, but when she turns around, a homeless man is standing in the hallway. He urinates on the floor and refuses to leave, so Loren takes him to a holding cell. There, she becomes locked in with him when the door suddenly closes and locks behind her. After the lights go out, a bloody-faced person surprises her in the door's window, and she drops her flashlight. An unidentified person picks it up and taunts her. When the lights come back on, the door opens; nobody else is there.\nLoren becomes further spooked when chairs rearrange themselves, doors open and close on their own, ghostly figures appear out of nowhere, and she hears disembodied singing. She also receives a series of distress calls from a woman who says she has been taken hostage by a cult. The police dispatcher confirms that all emergency calls have been rerouted to the new station. Loren encounters a loiterer named Marigold who tells her that she was in a cell when the police brought in an infamous cult. Marigold says the story told to the public, that the cult was killed at their residence, is untrue; instead, they committed suicide at the station one year ago to the day. Loren is further spooked when Marigold hums the song that she heard earlier.\nOvercome by stress, she calls Sgt. Cohen but thinks better of it at the last second. Officer Price appears at the station, and she accuses him of planning all the events as a hazing ritual. Confused, he insists he has simply come by to check up on her, as he served with her father. Price confirms that the murderous cult was captured alive and tells her that her father, who died apprehending them, would be proud of her. As he turns to leave, Loren is horrified to see a gaping bullet wound in the back of his head. Further paranormal events at the station reveal that the cult worships the King of Hell, a being said to reside in Hell before Satan was sent there. Before committing mass suicide, they threatened to come back and destroy everything the arresting officers love.\nLoren calls Sgt. Cohen again and says that she can not finish her shift; she agrees to stay when he threatens to fire her. A remaining member of the cult takes Loren hostage, only to commit suicide in front of her. After hearing screams from the holding cell, she is attacked by the homeless man, whose body she subsequently finds hanged in the locked cell. Loren leaves the station but returns when she hears the phone ring again. The distressed caller, revealed to have already died, laughs and taunts her. When Loren attempts to leave once again, the doors refuse to open. Her dead father calls her on her cell phone and demands justice for his death. Several cult members assault the station, and she kills them. As she shoots the last one, Cohen appears behind her and shoots her. In a moment of clarity, she realizes that she has murdered the entire HAZMAT team. As she dies, she laughs and sings the cult's hymn to the King of Hell."}