{"mid": "LawnmowerMan2BeyondCyberspace", "IMDB_id": "tt0116839", "title": "Lawnmower Man 2: Beyond Cyberspace", "plot": "The founder of virtual reality, Dr. Benjamin Trace (Patrick Bergin), has lost a legal battle to secure a patent on the most powerful worldwide communications chip ever invented. Touted as the one operating system to control all others, in the wrong hands the \"Chiron Chip\" has the potential to dominate a society dependent on computers.\nWhen corporate tycoon and virtual reality entrepreneur Jonathan Walker (Kevin Conway) takes over development of the Chiron Chip, he and his team discover Jobe Smith (Matt Frewer) barely alive after the destruction of Virtual Space Industries. After having his face reconstructed and his legs amputated they hook him up to their database to have him help them perfect the Chiron Chip.\nSix years later, a now 16-year-old Peter Parkette (Austin O'Brien) is a computer hacker and lives in the subways of Los Angeles with his girlfriend and two other friends. While hooked into cyberspace, Jobe reconnects with Peter and asks him to find Dr. Trace for him. Peter locates Trace living out in a desert and brings him to his hideout to speak with Jobe. Online, Jobe shows Trace his newly constructed cyber world and asks for info on Egypt, a hidden Nano routine in the chip's design. Trace refuses to tell him, noting Jobe to be insane and that he wouldn't understand its power. Enraged, Jobe hacks into the subway's system computer to send another train crashing into the one Trace and the teenagers are in, but Trace causes the runaway car to crash into a construction site instead. However, the group is forced to flee after the entire tunnel is blown out.\nJoining forces with Trace's former lover, Trace, Peter and his friends must go on a race against time to save the world from Jobe's diabolical scheme and face him in one last battle in cyberspace. In the end, Trace defeats the villain with help from Jobe who turns back into his former good self."}