{"mid": "LawsOfAttraction", "IMDB_id": "tt0323033", "title": "Laws of Attraction", "plot": "High-powered divorce attorneys Audrey Woods (Julianne Moore) and Daniel Rafferty (Pierce Brosnan) have seen love go wrong in many scenarios—so, how good could their own chances be? As two of the top divorce lawyers in New York, Audrey and Daniel are a study in opposites. She practises law strictly by the book; he seems to win by the seat of his pants, or by \"cheap theatrics,\" as Audrey says in one scene.\nSoon the two lawyers are pitted against one other in several high-profile divorce cases, including a nasty public split between rock star Thorne Jamison (Michael Sheen) and his dress-designer wife, Serena (Parker Posey). The settlement hinges on an Irish castle, Caisleán Cloiche, or \"Rock Castle,\" that each spouse wants. Audrey and Daniel travel to Ireland to chase down depositions, and both stay in the castle; although Audrey, at least, is reluctant to acknowledge their mutual attraction, they find themselves attending a romantic Irish festival together. After a night of wild celebration, they wake up the next morning to discover they have wed. Audrey is shocked, though Daniel takes their apparent marriage in his stride.\nThe pair return to New York and find news of their wedding printed on Page 6 of the New York Post the following day. Audrey suggests that the two maintain the semblance of a marriage for the sake of their careers, and Daniel moves into the guest room of Audrey’s apartment. Although in the courtroom they continue to fight the Jamisons’ high-profile divorce case with the gusto they have always shown, at home they settle into domestic life together. While disposing of garbage one day, Daniel accidentally discovers some sensitive information about Audrey's client, Thorne Jamison, which he reveals in the next day's court proceedings. Audrey feels betrayed and asks for a divorce, which Daniel agrees to give, citing his love for her.\nNext, their famous clients each return to the castle in Ireland, even though they are not permitted to be there pending division of assets. Judge Abramovitz (Nora Dunn) sends their respective counsellors to Ireland to inform them of this, but on arrival they discover that the celebrity couple has reunited on the anniversary of their wedding. Audrey and Daniel then learn that the “priest\" who performed their own marriage ceremony is in fact the Jamisons' butler, and the “weddings\" he presided over at the festival were simply romantic celebrations.\nDaniel returns immediately to New York, alone, but with Audrey fast on his heels, as she realizes that she has fallen in love with him. Confronting him in the grocery store below Daniel’s Chinatown office, Audrey asks Daniel if he is willing to fight to save their relationship. In the romantic final scenes, the couple are married in a private ceremony in Judge Abramovitz’s chambers, with Audrey's mother as the sole witness."}