{"mid": "LeapOfFaith", "IMDB_id": "tt0104695", "title": "Leap of Faith", "plot": "Faith healer Jonas Nightengale (Steve Martin) makes a living traveling across America holding tent revival meetings and conducting purported \"miracles\". He is helped by his friend and manager Jane Larson (Debra Winger), and an entourage of fellow con artists.\nTheir truck breaks down in the fictional town of Rustwater, Kansas. The place, with its 27 percent unemployment rate, is in desperate need of rain to save its crops. Learning they will be stuck in Rustwater for days waiting for replacement parts to come in for one of the many big trucks of their fleet, Jonas decides to hold revival meetings despite the town's small size in an effort to cut some of their losses while the truck is being repaired. Early on, Jonas meets Marva, a waitress in a local café. She rebuffs his persistent advances.\nLocal sheriff Will Braverman (Liam Neeson) is skeptical and tries to prevent his townspeople from being conned out of what little money they do have. First, he engages in some legal harassment, sending all of the city and county inspectors to examine his facilities. After seeing the excessive pageantry of the first show and the counting of money by the team on Jonas' tour bus, Braverman decides to investigate Jonas' past. He learns that Jonas, claiming to have been born in a humble log cabin in the Appalachians, is in fact Jack Newton, a native of New York City. Between the age of 15 and 18 he lived a life of crime, including petty theft and drug possession. Braverman shares this information with the townspeople who have gathered for another tent revival. Jonas storms off the stage, soon returning to successfully spin Braverman's report, leaving the crowd more energized than ever, much to Braverman's exasperation.\nJonas also gives back the collections for the day, saying he could not take their money in good conscience knowing that they doubted him and that if his faith was strong God would send them a sign. He also has his crew secretly plant an additional $80 among the crowd, setting up the believers for a miracle the next day. The next morning, the huge crucifix forming the backdrop of the revival tent with Jesus' eyes normally closed is found to somehow have his eyes opened. A shocked Jonas, in front of all the townspeople and numerous television cameras from the region's network affiliates, proclaims it a miracle which is amplified as townsfolk who had money planted on them reveal their unexplained fortunes.\nThroughout all of this is a subplot involving Jane and Braverman, who find themselves falling for each other. She becomes enchanted by Braverman's simple farm life and his interest in butterflies. However, after Braverman's disclosure of Jonas' past Jane breaks off their budding relationship. They soon, however, meet again and Jane confesses to Braverman that she is tired of manipulating people. He makes it clear he would like a permanent relationship with her if she will stay.\nMeanwhile, Jonas can't understand why Marva won't date him. Marva points to her brother Boyd who walks with crutches following an auto accident in which also their parents died. Marva explains that doctors couldn't find anything physically wrong with him, so as a last resort she took him to a faith healer who subsequently blamed it on Boyd's supposed lack of faith. Marva now detests faith healers, having had one blame her brother for his own psychosomatic disability.\nBoyd comes to believe that Jonas can make him walk again. He goes to the revival and implores Jonas to heal him. Jonas finishes the show while pretending not to notice the boy, but is compelled to return to the stage after the crowd begins to chant \"one more.\"\nJonas spins the expected failure to heal Boyd by blaming Braverman, who is present, saying that if a failure occurs, it will be due to Braverman's skepticism. Boyd walks to the open-eyed crucifix and touches the feet of Jesus Christ. He drops his crutches and begins to walk unassisted. The awed crowd sweeps the stage. After the show, an enraged Jonas rails to Jane that he was conned and that Boyd upstaged him. Jane doesn't believe it was a con. The production crew are thrilled with all the money that came in as a result of Boyd being healed and want Boyd to join the show. A clearly annoyed Jonas reluctantly agrees and stalks off the bus. Jane follows him out and they argue.\nAfter the revival, Jonas enters the empty, darkened tent and mocks the crucifix and Christianity. Boyd walks in while Jonas is talking. Boyd thanks Jonas for healing him, but Jonas insists angrily that he did nothing. Boyd says it doesn't matter, that the job still got done. Jonas accuses Boyd of being a better con artist than he himself. Boyd wants to join Jonas on the road, telling him a lot of ways he can help out exist and promising to earn his keep. Jonas agrees to meet Boyd the following morning, implying Boyd can come. Then Boyd's sister Marva arrives. She sends him out of the tent saying that people are looking for him. She thanks Jonas, who tells her that he will not be meeting her brother Boyd the next morning. He asks her to tell Boyd that \"just because a person didn't show up doesn't mean that the person doesn't care about them.\" referencing a set up earlier in the movie where Jane defended Jonas by telling Braverman the story of a five-year-old Jonas waiting in vain for four days for his mother to return, for many years while living in an orphanage holding steadfast to the belief that one day she indeed would. (The line is also found in the 1999 film adaptation of Graham Greene's The End of the Affair.)\nJonas leaves the tent and sees the crowd that has gathered just outside it, many praying, some sleeping in groups, and others feeding the crowd that has gathered. He begins to understand that Boyd's miracle, and the faith that enabled it, are real after all. He packs a bag and departs alone under the cover of darkness, leaving behind his entire road show and most of all of the rest of everything that he owns - including his silver-sequined jacket and an envelope for Jane containing his ring that she had long coveted - and hitches a ride on the nearby Interstate from which they had come to Rustwater at the start of the story. Braverman and Jane drive to Jonas' motel room and find him gone.\nJonas hitches a ride with a truck driver bound for Pensacola, Florida. When asked by the driver if he is in some kind of trouble, Jonas replies \"No sir, no sir. Probably for the first time in my life\". As they continue to ride along, the drought, threatening the crop harvest that is the centerpiece of the town's economy, comes to a dramatic end in a miraculous downpour. Jonas laughs silently to himself as he realizes the truth, and the film ends as he rides off into the stormy evening, hanging out the truck window loudly thanking Jesus for the rain."}