{"mid": "LeapYear", "IMDB_id": "tt1216492", "title": "Leap Year", "plot": "Successful real estate stager Anna Brady (Amy Adams) is frustrated that her cardiologist boyfriend Jeremy Sloane (Adam Scott) still has not proposed to her after four years. She decides to travel from Boston to Dublin, to propose to him on February 29, leap day, while he is there at a conference. According to Irish tradition, a man who is proposed to on leap day must accept the proposal. During the flight, a storm diverts the plane to Wales, where Anna hires a boat to take her to Cork. The severity of the storm, however, forces her to be put ashore at Dingle, where she makes her way to Caragh's Tavern and tries to enlist the help of the surly Irish innkeeper, Declan O'Callaghan (Matthew Goode), to taxi her across the country to Dublin. At first he refuses, but after his tavern is threatened with foreclosure, he agrees to drive her for €500, and the two set out in his old beat-up car. Along the way, he makes fun of her fancy Louis Vuitton luggage, which he calls \"Louie\", and her belief in a leap year \"tradition\" of women proposing to men.\nTheir travel is interrupted by a herd of cows blocking the road. After attempts to move the animals, Anna leans on the car to clean her expensive shoes and causes it to roll downhill into a stream. Continuing on foot, Anna flags down a van with three ne'er-do-wells who offer her a lift. Ignoring Declan's warning, Anna accepts the ride and hands them her luggage, but before she can enter the van, they drive off without her. Anna and Declan eventually make their way on foot to a roadside pub, where they discover the three thieves going through Anna's luggage. Declan fights them off and retrieves Anna's bag, before being thrown out by the pub owner.\nAnna and Declan reach a railway station and decide to wait for the next train. While waiting, they hike up a hill to the ruins of a nearby castle, where they get to know each other. He also tells her about a legend of a beautiful young woman promised to a lord she did not love who uses a sleeping potion to put her wedding guests asleep and escapes with another man whom she loves. They lose track of time and miss their train. That night they stay at a bed and breakfast, where they pretend to be married so their conservative hosts will allow them to stay. During dinner, when the other couples kiss to show their love, Anna and Declan are \"forced\" to kiss as well, causing feelings they had not expected. That night, they sleep in the same bed, but do not admit their feelings for each other.\nThe next day on the road, Anna and Declan take shelter from a hailstorm at a church where a wedding is taking place. During the reception, Anna has too much to drink and begins to question her intentions with Jeremy, realizing she loves Declan. Just as the two are about to kiss, Anna vomits and passes out. The following morning while waiting for a bus, Declan reveals that he was once engaged but that his fiancée ran off to Dublin with his best friend and his mother's claddagh ring. Anna encourages him to get his ring back. When they arrive at Jeremy's hotel in Dublin, Jeremy surprises her and proposes to her in the lobby. After hesitating, she accepts, just as a dispirited Declan walks away. At their engagement party in Boston, Anna learns that Jeremy decided to \"commit\" to her only in an effort to impress the manager of the expensive condominium the two were attempting to buy. Dismayed, Anna pulls the fire alarm and leaves after watching Jeremy grab all the electronics—not showing any concern for her. Meanwhile in Dublin, Declan retrieves his mother's ring from his ex-fiancée.\nSometime later, Anna arrives back at Caragh's Tavern at Dingle, where Declan is successfully running his business. She reveals that she broke off her engagement and tells him that all she needs is right here. When she proposes that they get together, Declan leaves the room. Thinking she's been rejected, Anna rushes outside and makes her way to the edge of a nearby cliff overlooking the sea. Declan follows and asks, \"Mrs. O'Brady-Callaghan, where the hell are you going?\" He then gets down on one knee and proposes to Anna, offering her his mother's claddagh ring. Anna accepts, and the two kiss and embrace each other."}