{"mid": "LeaveHerToHeaven", "IMDB_id": "tt0037865", "title": "Leave Her to Heaven", "plot": "Novelist Richard Harland (Cornel Wilde) returns to his remote island home, called Back of the Moon, after two years in prison. His friend and attorney (Ray Collins), narrates how Richard meets beautiful socialite Ellen Berent (Gene Tierney) on a train. She falls in love with him mainly on the basis of his close resemblance to her recently deceased father, to whom she was obsessively attached.\nEllen is previously engaged to an ambitious Boston attorney, Russell Quinton (Vincent Price), who begs her not to marry Richard because of the bad press it would bring to his upcoming political campaign. However, she jilts Russell and marries Richard, who at first is fascinated not only with Ellen's beauty but her exotic and intense manner. It gradually becomes apparent however that Ellen is pathologically jealous towards any other person and activity that her husband cares about.\nRichard's younger disabled brother, Danny (Darryl Hickman), whom Richard dearly loves, comes to live with them at their lodge even though Ellen pleads with the doctor to not allow the move. She becomes increasingly irritated by Danny's presence and the attention he gets from Richard. One day, while she and Danny are out on a rowboat, Danny decides to see how far he can swim. However, Danny's paralyzed legs weigh him down, and Ellen watches heartlessly as Danny struggles to stay afloat. He drowns in front of her as Ellen registers no reaction on her face. When she hears Richard approaching the lake, she only then begins screaming.\nLater, she becomes pregnant, but tells her adoptive sister, Ruth (Jeanne Crain), that she has an active disdain for the \"little beast\" inside of her. She then deliberately causes the miscarriage of the couple's unborn son when she throws herself down a flight of stairs. She returns after a few weeks in the hospital and accuses Ruth of being in love with Richard, especially after the dedication of Richard's new book is to \"the gal with the hoe\" – a reference to Ruth's penchant for gardening. Ruth rebukes Ellen for causing all the misery that is happening to the family.\nOverhearing the conversation, Richard begins to suspect that Ellen is directly responsible for both the death of his brother and his son. He accuses her of letting Danny drown. When Ellen confesses that she did let him drown and would do it again, he leaves her. She decides to poison herself, coldly framing Ruth in jealousy over Ruth's warm but innocent friendship with her husband.\nPosing as a victim, Ellen writes to her ex-fiance (since elected a county district attorney) laying out her claims of murder, which said that Ruth wanted her dead. Ellen conspires with Richard, who is next seen being grilled by Russell, the prosecutor for Ruth's trial. Ruth is then pressured by Russell into admitting she has always loved Richard. In response, the previous recalcitrant Richard resumes the witness chair and testifies about Ellen's insane jealousy and her dual confessions to him. Ruth is acquitted, but Richard is sentenced to two years in prison as an accessory to his brother's death for withholding knowledge of Ellen's actions from investigators.\nWith those two years now behind him, Richard is welcomed home to Back of the Moon by a loving embrace from Ruth."}