{"mid": "LeCercleRouge", "IMDB_id": "tt0065531", "title": "Le cercle rouge", "plot": "In Marseille, a prisoner named Corey is released early for good behaviour. A warder tips him off about a prestigious jewellery shop he could rob in Paris. He goes to the house of Rico, an associate of his with whom his former girlfriend now lives, where he robs Rico of his money and gun. Then he goes to a billiard hall, where two of Rico's men find him. After killing one and taking his gun, Corey buys a large car and, hiding the guns in the boot, starts for Paris. On the way, he stops at a roadside grill to eat.\nThe same morning another prisoner, Vogel, who is being taken on a train from Marseille to Paris by the policeman Mattei, escapes in open country. Mattei orders roadblocks to be set, and returns to face his superiors. Vogel comes upon the roadside grill and hides in the boot of Corey's car. Realising someone is in the boot, with his guns, Corey drives into an open field and orders Vogel to get out. After a tense confrontation, the two decide to co-operate. Shortly after, with Vogel back in the boot, a car with two more of Rico's men forces Corey off the road. They take his money and are about to kill him when Vogel, emerging from the boot, shoots both dead.\nCorey takes Vogel to his empty flat in Paris and starts to plan the robbery. For this he needs a marksman, to disable the security system by a single rifle shot, and a fence to buy the goods. At the same time, Mattei is planning how to locate the murderer of Rico's men and to recapture Vogel. He puts pressure on Santi, a night club owner who knows most of the underworld, to find them.\nCorey recruits Jansen, an alcoholic ex-policeman and a crack shot, together with a fence, and successfully empties the shop one night. However, his fence refuses to take the goods, having been warned off by Rico, and suggests that Corey asks Santi for a lead. Santi tips off Mattei, who poses as a fence and asks Corey to bring the goods to a country house. Corey does so, taking Jansen as backup and leaving Vogel at his apartment with the rose he had earlier received from a waitress at Santi's. After Corey arrives at the country house, Vogel appears from nowhere and tells Corey to run with the jewels, acting on his suspicion that Corey is not safe with this new fence. A bloody confrontation follows in which all three criminals are shot dead by the police."}