{"mid": "LeDoulos", "IMDB_id": "tt0054821", "title": "Le doulos", "plot": "Maurice Faugel, just released from prison after serving a six-year sentence, meets a friend, Gilbert, who is appraising the value of jewels from a recent heist. Maurice is planning a robbery the next day with two accomplices, Silien and Rémy. Maurice kills Gilbert with Gilbert's own gun and steals the jewels as well as a large sum of money. It is later revealed that Gilbert killed Maurice's girlfriend Arlette to keep her from informing the police when Maurice was sent to prison six years prior. Maurice leaves the house just as Nuttheccio and Armand, prominent gangsters, arrive to collect the loot. Maurice buries the jewels, money, and gun under a lamppost.\nMaurice spends the evening at his girlfriend Thérèse's apartment. Silien arrives the next day with Maurice's friend Jean to deliver equipment for the robbery that evening. When Silien leaves, he uses a payphone to call Inspector Salignari.\nThat evening, Maurice and Rémy leave to rob a home in affluent Neuilly. Meanwhile, Silien comes to Thérèse's apartment, then beats her and ties her to a wall radiator, demanding to know the address of the robbery. The police arrive at the robbery. Inspector Salignari corners Maurice and Rémy, fatally shooting Rémy. Maurice and Salignari shoot at one another; Maurice is hit in the shoulder, and Salignari is killed. Maurice leaves the gun in Rémy's hand and continues to run away. He passes out just before a car pulls up to the curb.\nMaurice wakes up in Jean's apartment, but neither Maurice nor Jean's wife Anita know who brought him there. Maurice resolves to find Silien, who he believes informed the police. He leaves Anita with a diagram showing where he buried the jewels, money, and gun, telling her to give it to Jean if something happens to him.\nBecause the police know that Silien called Salignari, they assume he has information on the botched robbery. They question him, hoping to get the name of Rémy's accomplice, but Silien tells them he wasn't the informant. He mentions that he hopes to get out of the criminal underworld and live in a house he has built in Ponthierry. It is revealed that the car that rescued Maurice has been found wrecked, with Thérèse's body inside.\nThe police also suspect Maurice for the murder of Gilbert. They threaten to falsely implicate Silien in a drug case unless he helps them find Maurice. Silien complies and Maurice is found. Maurice claims that Gilbert was killed while Maurice was in another room of the house. The police offer to let him go if he has information on the robbery in Neuilly, but Maurice claims he has no information. He is jailed, where he meets a prisoner named Kern.\nSilien finds the buried jewels, money, and gun beneath the lamppost. He visits Nuttheccio's club and speaks to Fabienne, a former girlfriend. He offers to get her out of her relationship with Nuttheccio if she will testify that Nuttheccio and Armand killed Gilbert. She agrees. Silien kills Nuttheccio and plants the jewels in his safe, while Fabienne calls Armand to tell him Nuttheccio has found the stolen jewels and wants to see him. When Armand arrives, Silien kills him, staging the scene to make it look like they killed one another.\nWith Nuttheccio and Armand dead and framed for Gilbert's murder, Maurice is released from prison. He still believes that Silien informed on him, so Jean and Silien reveal that Silien was not the informant and had in fact been maneuvering to get Maurice out of prison. Though Silien was a friend of Salignari, he did not inform him of the robbery. However, he recognized Thérèse as one of Salignari's informants. The night of the robbery, Silien called Salignari to invite him to dinner, and Salignari revealed that he would be arresting two burglars in Neuilly. Silien got the address from Thérèse and went to Neuilly to avert a disaster. He arrived in time to pick up Maurice and take him to Jean's apartment.\nSilien announces that he will be moving in with Fabienne at his home in Ponthierry, and that he is going there now. However, while in prison, Maurice arranged for his cellmate Kern to kill Silien, promising the money he stole from Gilbert in exchange. Kern is waiting at Silien's home, and Maurice rushes there to tell him that the hit is off.\nMaurice manages to arrive in Ponthierry before Silien but Kern shoots him, apparently mistaking him for Silien. When Silien arrives, he sees Maurice's body on the ground. With his dying breath, Maurice warns him that someone is waiting behind a partition. Silien shoots at the screen, killing Kern, but Silien is also fatally shot."}