{"mid": "LegoScoobyDooHauntedHollywood", "IMDB_id": "tt5548284", "title": "Lego Scooby-Doo!: Haunted Hollywood", "plot": "While trying to solve the mystery of a sea creature haunting a lighthouse, Shaggy complains to Scooby about how Fred, Daphne and Velma always bribe them into being monster bait with Scooby Snacks. As a result, Shaggy and Scooby decide to not eat Scooby Snacks again. After they solve the mystery, the gang goes to the malt shop where Shaggy and Scooby win a hamburger eating contest and win the whole gang a trip to Hollywood.\nOnce they arrive, they first visit Brickton Studios, an old horror film studio that is about to be closed down. The studio's employee Junior, an avid fan of horror films, welcomes them and offers to give them a tour. Joining them on the tour is Atticus Fink, a developer who wants to buy and level the studio. During the tour, they drive their truck through a dark storage facility, causing Fink to leave. After Fink leaves, a Headless Horseman appears and chases the gang.\nAfter they escape, they go to ask the manager, Chet Brickton, about their encounter. Brickton tells them that all the monsters used to be played by an actor named Boris Karnak, who died years ago and that his ghost may have come back to haunt the studios through various costumes of the monsters he played. In addition to the Headless Horseman, there have also been sightings of a mummy and a zombie, which is why he must sell the studio to Fink to avoid bankruptcy. The gang offers to help Brickton solve the mystery.\nFirst, the gang goes to the set of a romantic comedy film that the studio is currently working on, much to Junior's displeasure. Suddenly the Headless Horseman attacks and ruins the set, making Brickton forlorn. The gang offers to help him finish the movie. Brickton appoints Fred as the director and casts Shaggy in the lead. Brickton then casts TV show talk host Drella Diabolique as the female lead, much to Daphne's dismay. After a long film making process, a mummy attacks and destroys the set.\nLater, Fred and Velma go to look for clues, while Drella coaches Daphne on being a movie star. Finding his footage unharmed, Fred decides to continue filming his movie. While shooting a particularly extravagant scene involving a plane, both the Headless Horseman and the zombie appear. After Scooby has a wild ride on the plane and the monsters disappear, Brickton reluctantly signs the studio over to Fink, much to Junior's sadness. Velma mentions that the Headless Horseman and the zombie appeared at the same time, meaning the ghost of Boris Karnak cannot be in two places at once. The gang decides to capture the monsters and solve the mystery.\nThe gang heads back to the studio and with Drella's help and Fred's elaborate trap, they catch the zombie and the Headless Horseman. The Headless Horseman is revealed to be Fink, who used the costume to get a cheap ownership of the studio. Daphne tells Fink that the evidence of fraud violates the terms of his contract, making it null and void. The zombie is revealed to be Junior, who was also the mummy. Junior tells them that he is actually Boris Karnak Jr., and wanted to carry on his father's legacy. Brickton orders the police to take Fink away and allows Junior to go free, but says that the studio will still have to close down due to lack of a movie. They then realize that the security cameras have recorded the gang being chased by the monsters and decide to make a found footage movie. With the studio saved, the movie ends with the gang at the premiere of \"Security Cam Monsters: The Adventure Begins\"."}