{"mid": "Leprechaun4InSpace", "IMDB_id": "tt0116861", "title": "Leprechaun 4: In Space", "plot": "On a remote planet, the Leprechaun attempts to court a princess named Zarina, in a nefarious plot to become king of her home planet. The two agree to marry, with each partner planning to kill the other after the wedding night in order to enjoy the marriage benefits (a peerage for the Leprechaun, the Leprechaun's gold and jewels for the princess) undisturbed.\nA platoon of space marines arrive on the planet and kill the Leprechaun for interfering with mining operations. Gloating over the victory, one of the marines, Kowalski, urinates on the Leprechaun's body. Unbeknownst to Kowalski, the Leprechaun's spirit travels up his urine stream and into his penis, where his presence manifests as gonorrhea. The marines return to their ship with the injured Zarina, whom they plan to return to her homeworld in order to establish positive diplomatic relations. The ship's commander, the cyborg Dr. Mittenhand, explains his plans to use Zarina's regenerative DNA to recreate his own body, which was mutilated in a failed experiment. Elsewhere on the ship, the Leprechaun violently emerges from Kowalski's penis after he is aroused during a sexual act. The marines hunt the Leprechaun, who outsmarts them and kills most of the crew in gruesome and absurd ways.\nWhile pursuing Zarina, the Leprechaun injects Mittenhand with a mixture of Zarina's DNA and the remains of a blended scorpion and tarantula, before initiating the ship's self-destruct mechanism. A surviving marine, Sticks, rushes to the bridge to defuse the self-destruct but is stopped by a password prompt. Mittenhand—now a grotesque monster calling himself \"Mittenspider\"—entangles Sticks in a giant web. Meanwhile, the other survivors confront the Leprechaun in the cargo bay, where they inadvertently cause him to transform into a giant after shooting him with Dr. Mittenhand's experimental growth ray.\nThe ship's biological officer, Tina Reeves, escapes to the bridge and rescues Sticks by spraying Mittenhand with liquid nitrogen. The only other surviving marine, Books, opens the airlock so the giant Leprechaun is sucked into space and explodes. Books joins the others at the helm and they deduce that the password is \"Wizard\", since Dr. Mittenhand previously compared himself to the Wizard of Oz. After stopping the self-destruct sequence, Books and Reeves kiss, while Sticks looks out the window to see the Leprechaun's giant hand giving him the finger."}