{"mid": "LeprechaunInTheHood", "IMDB_id": "tt0209095", "title": "Leprechaun in the Hood", "plot": "Sometime in the 1970s, treasure seekers Mack Daddy O'Nassas (Ice-T) and comrade Slug (Barima McKnight) break into a small room inside of a disco nightclub. The duo come across a trove of gold guarded by the statue of a petrified Leprechaun (Warwick Davis). Mack Daddy only presents interest in a magical flute which is said to hypnotize its listeners into a euphoric trance that has them fall underneath the control of the flute's player.Slug continues to collect the rest of the gold as well as removing an amulet from around the Leprechaun's neck, thus unfreezing him. The Leprechaun sets to work recovering his gold by killing Slug and converging onto Mack Daddy for the highly coveted flute. Mack Daddy outwits the Leprechaun by safely securing the amulet back around his neck in an elaborate manner, therefore re-freezing him.Fast forward to modern day Los Angeles, California. Mack Daddy has used the wealth of the gold and power of the flute to skyrocket in the hip-hop industry earning him the title of a famous record producer and pimp. Three vengeful, aspiring rappers named Postmaster P (Anthony Montgomery), Stray Bullet (Rashaan Nall), and Butch (Red Grant) conspire to rob Mack Daddy of his riches by breaking into his office after Mack Daddy refuses to sign them onto his record label and instead, insults them.Unexpectedly, Mack Daddy walks in on the robbery startling Postmaster P who shoots and presumably kills Mack Daddy. Butch removes the amulet from around the Leprechaun's neck which Mack Daddy kept in his office the ensuing years. The Leprechaun springs to life and orders the three to return his gold. Confused, the three rapidly fire at the Leprechaun in succession before fleeing. Mack Daddy is revealed to have been spared by a golden medallion he was wearing around his neck and also escapes when he discovers the Leprechaun is alive.Mack Daddy arrives at the Golden Parrot, a local bar, where he is confronted in the restroom by the Leprechaun. The Leprechaun severs his finger before Mack Daddy leaves. The Leprechaun, then kills a bartender before hypnotizing three waitresses (Daya Vaidya, Chloe Hunter, & Lori J. Jones) into becoming his Zombie Fly Girls, gorgeous, yet deadly femme fatale who are recruited to do the Leprechaun's evil bidding.The following day, the trio cash the stolen gold on technical equipment to be used to enter an upcoming music competition. Postmaster P is revealed to have secretly taken the flute and begins to discover its hypnotic effects. Unfortunately, the Leprechaun can sense whenever the flute is played and uses this as a tracking device to catch the three hoodlums.Later that night, the Leprechaun kills antique store owners Jackie Dee (Dan Martin) and Chow Yung Pi (Jack Ong) to recover his gold. Meanwhile, Mack Daddy and his bodyguard (Eric Mansker) confront Postmaster P, Stray Bullet, and Butch at a house party. Mack Daddy orders them to hand over the flute, although Stray Bullet and Butch are not aware Postmaster P is in possession of the flute. When Mack Daddy is temporarily subdued due to his injury the trio use this to their advantage by jumping off the rooftop and safely landing onto a fire escape, making a fast getaway. Afterwards, Postmaster P reveals to Stray Bullet and Butch he has the flute, but refuses to give it up believing it holds a strong power.The following night, the trio pay to stay at the apartment of Fontaine Rivera (Lobo Sebastian), a transvestite prostitute. Once the flute is played, the Leprechaun arrives, kills Fontaine, and begins to search the apartment for the flute. Postmaster P, Stray Bullet, and Butch hide in the bathroom while Butch concocts a combustible fluid made by mixing household chemicals. Once the Leprechaun is lured into the bathroom, they combine the concoction with electricity and he is set ablaze. The trio escape and come to the consensus they need sanctuary. They decide to stay at the local church for the night.The next morning, the church's pastor, Reverned Hamson (Ivory Ocean) strikes a deal with the men that if they perform for his morning congregation, they can continue to use the church as their safe haven. Afterwards, Mack Daddy and his bodyguard show up and pursue the trio through the upstairs of the building. The Leprechaun arrives during the ensuing chaos and kills Mack Daddy's bodyguard, disgusting Mack Daddy who runs away.The trio barricade themselves in Rev. Hamson's office while the Leprechaun prepares to break down the door. They wheel a wrought-iron safe over and open the door, prompting the Leprechaun to inadvertently tumble into the safe, thus rendering him powerless. The trio make a deal with Rev. Hamson to watch the safe while they travel to the competition being held in Las Vegas, Nevada.Once they leave, the Leprechaun summons one of his Zombie Fly Girls to kill Rev. Hamson and release him from the safe. The Leprechaun confronts the trio in their dressing room in Las Vegas, resulting in Postmaster P surrendering the flute and ultimately costing Stray Bullet his life.Postmaster P and Butch plan to avenge Stray Bullet's death and recover the flute. Butch finds out the Leprechaun has taken up residence at the Golden Parrot where he has been luring prostitutes up to his lair who eventually find themselves never coming back down. The duo disguise themselves as female prostitutes and subdue the Zombie Fly Girls, thus gaining them access to the Leprechaun. Postmaster P administers a marijuana joint laced with a four-leaf clover knocking the Leprechaun unconscious. They steal the flute and race downstairs where Butch is shot and killed by Mack Daddy.Postmaster P is offered to join alliance with Mack Daddy who brandishes the amulet--the only thing that can stop the Leprechaun. Postmaster P refuses just as the Leprechaun regains consciousness and kills Mack Daddy. The Leprechaun commences in a final showdown with Postmaster P over the flute. Postmaster P successfully outsmarts the Leprechaun and returns the amulet around his neck, freezing him.Sometime later, Postmaster P has gone solo and has made it to the finals of the competition. He raps about his struggles to make it to the top of the hip-hop industry earning him a standing ovation from the audience. After his performance, Postmaster P removes his sunglasses revealing that he is under the Leprechaun's control."}