{"mid": "Leprechaun", "IMDB_id": "tt0107387", "title": "Leprechaun", "plot": "In 1983, Dan O'Grady returns to his home in North Dakota from a trip to his native Ireland, where he stole the pot of gold from a leprechaun. After burying the gold, O'Grady discovers that the evil leprechaun has followed him home and murdered his wife. O'Grady uses a four-leaf clover to suppress the leprechaun's powers and trap it inside a crate. Before he can burn it, he suffers a stroke.\nTen years later, J. D. Redding and his teenage daughter Tory rent the O'Grady farmhouse for the summer. Contract workers Nathan Murphy, his 12-year-old brother Alex, and their dimwitted friend Ozzie Jones help re-paint the farmhouse. While looking around the basement, Ozzie hears the leprechaun's cry for help and mistakes him for a little child. He brushes the old four-leaf clover off the crate, freeing the leprechaun. After failing to convince the others that he met a leprechaun, Ozzie spots a rainbow and chases it, believing he will find a pot of gold at the end. Alex accompanies him for fear Ozzie might hurt himself. A bag of one hundred gold pieces magically appears before Ozzie. After Ozzie tests the gold and accidentally swallows a piece, they stash it in an old well and plot to keep it for themselves, hoping to fix Ozzie's brain.\nAt the farm, the leprechaun lures J. D. into a trap by imitating a cat, biting and injuring his hand. Tory and the others rush him to the hospital, and the leprechaun follows on a tricycle. Alex and Ozzie visit a pawn shop to see if the gold is pure, and the leprechaun kills several townspeople. The leprechaun returns to the farmhouse, where he searches for his gold and shines every shoe. After leaving J. D. at the hospital, the group drives back to the farmhouse. Finding it ransacked, Nathan checks outside, where he is injured by a bear trap set by the leprechaun.\nAfter finding a shotgun in the farmhouse, they shoot the leprechaun several times. When this has no effect, they attempt to flee the farm, but their truck's engine has been sabotaged by the leprechaun. After ramming the truck with a go-kart, the leprechaun terrorizes the group until Ozzie reveals that he and Alex found the pot of gold. Tory recovers the bag from the well and gives it to the leprechaun. Believing the worst to be over, they leave for the hospital. While counting his gold, the leprechaun discovers that he is missing the gold piece Ozzie swallowed. Thinking that they have tricked him, he menaces them until Ozzie tells them about O'Grady, who was taken to a nursing home after his stroke. Tory visits the home to learn how to kill the leprechaun.\nAt the nursing home, the leprechaun pretends to be O'Grady. After he chases Tory to an elevator, the leprechaun throws O'Grady's bloodied body down the shaft as Tory flees. Before dying, O'Grady tells her that the only way to kill the leprechaun is with a four-leaf clover. Tory returns to the farmhouse, where she searches for a clover until she is attacked by the leprechaun; Nathan and Ozzie save her. Alex sets a trap near the well, but the leprechaun almost kills him. Ozzie reveals he swallowed the last gold coin, and the leprechaun critically wounds him to get at it. Before the leprechaun can kill Ozzie, Alex takes a four-leaf clover Tory has found, sticks it to a wad of gum, and shoots it into the leprechaun's mouth, taking away his power. The leprechaun falls into the well, but his skeleton climbs out. Nathan pushes the leprechaun back into the well and blows up both the well and leprechaun with gasoline. The police arrive, and Tory is reunited with her father. As the police investigate the remains of the well, the leprechaun vows he will not rest until he recovers every last piece of his gold."}