{"mid": "LesDiaboliques", "IMDB_id": "tt0046911", "title": "Les diaboliques", "plot": "A second-rate boarding school on the outskirts of Paris is run by the tyrannical and mean Michel Delassalle (Meurisse). The school is owned, though, by Delassalle's teacher wife, the frail Christina (Clouzot). Delassalle also has a relationship with Nicole Horner (Signoret), another teacher at the school. Rather than antagonism, the two women are shown to have a somewhat close relationship, primarily based on their apparent mutual hatred of Michel, who is physically and emotionally abusive to both, as well as unkind to the children.\nUnable to stand his mistreatment any longer, Nicole devises a plan to get rid of Michel forever. Though hesitant at first, Christina ultimately consents to help Nicole. Using a threatened divorce to lure Michel to Nicole's apartment building in a town several hundred kilometers away, Christina sedates him. The two women then drown him in a bathtub and, driving back to the school, dump his body in the neglected swimming pool. When his corpse floats to the surface, they think it will appear to have been an accident. Almost everything goes according to their plans until the body fails to surface. Michel's corpse is nowhere to be found when the pool is drained.\nNicole sees in the paper that the police have found the corpse. However, when Christina goes to the morgue, she finds it is not actually Michel's body. There she meets Alfred Fichet (Vanel), a retired senior policeman now working as a private detective. He becomes involved in the case, much to Nicole's chagrin.\nWhen Christina and Alfred come back, a boy is punished for breaking a window; the boy says it was Michel who punished him. After hearing this, Christina becomes very upset and is unable to join in the school photograph. When it is printed, somebody looking like Michel is seen at a window behind the group. Nicole becomes worried and leaves the school.\nChristina, overcome by fear, tells Alfred everything. He does not believe her, but he investigates the pool. That night, Christina hears noises and wanders round the school. When she realizes that someone is following her, she runs back to her room. There she finds Michel's corpse submerged in the bathtub, which is full of water. Michel rises from the tub, and Christina, who was said to have a weak heart, has a heart attack and dies. It is then revealed that Michel and Nicole have set up Christina from the beginning, with Michel acting as dead to scare Christina to death. However, Alfred hears their celebration and figures out everything, telling them they will get 15 to 20 years, depending on their lawyer.\nSome time later, the same boy who had earlier broken a window breaks another. When asked how he got his slingshot back, the boy says that Christina gave it to him. A final title screen tells the audience not to reveal the ending to others."}