{"mid": "LesVisiteurs", "IMDB_id": "tt0108500", "title": "Les visiteurs", "plot": "In the year 1123, Godefroy Amaury de Malfête, Count of Apremont and Papincourt, saves the life of his beloved sovereign, King Louis VI \"Le Gros\" (\"The Fat\") from the sword of a \"horribilis\" Englishman.\nFor this action of bravery, the King makes him Count of Montmirail and promises him the woman he loves, the beautiful Frénégonde de Pouille. On his way to the castle to marry Frénégonde, Godefroy's drinking flask is drugged by the witch he had earlier taken prisoner. Hallucinating, he believes the Duke of Pouille, father of his future wife, is a ferocious bear, and kills him with a crossbow bolt. During the Duke's funeral, Frénégonde refuses to marry Godefroy because of the tragedy, but Godefroy's servant, the disreputable Jacquouille la Fripouille, steals the Duke's jewels when the funeral ends.\nIn an attempt to repair his mistake, Godefroy asks the wizard Eusebius to send him back in time to a moment before he shot the Duke. The old wizard muddles his magical spell, accidentally sending Godefroy and Jacquouille to the year 1992. There, they immediately run into trouble with the Gendarmerie, then Godefroy is sent to the mental hospital (the police believes that he is suffering from amnesia), and after Godefroy tries to destroy the postman's car (which they mistake for a devil's chariot with a Moor in it), they meet Béatrice de Montmirail, an aristocrat who looks exactly like Frénégonde (being her descendant). Jacquouille, meanwhile, is befriended by Ginette la Clocharde (\"Ginette the Tramp\" in French), an attractive vagrant they meet early in their adventure.\nBéatrice, thinking Godefroy to be her long-lost stuntman cousin Hubert, gets Godefroy out of the mental hospital and takes them back to her home, much to her husband (who greatly dislikes the fact of the two being in their home) Jean-Pierre's dismay. There, various culture-shock comedy ensues as Godefroy and Jacquouille attempt to fathom modern household appliances, such as flooding the bathroom by leaving the tap open, lighting the umbrella (which contains a large piece of meat) on fire, trashing the bathroom during their baths and wasting all of the family's 6,000 FF Chanel No. 5, greatly angering Jean-Pierre.\nSeeing the family seal on Godefroy's hand, Beatrice assumes he stole the jewel from the castle de Montmirail, now renovated into an expensive hotel. They go there and meet the owner of the castle, the effete Jacques-Henri Jacquard, the unwitting descendant and close likeness of Jacquouille (they react to each other with mutual disgust). The jewel on Godefroy's hand starts to burn as they get closer to the castle, where the present-day version of the seal is. The two seals explode and destroy Jacquard's brand new Range Rover.\nGodefroy books a room for the night and finds a secret passage known only to him. There he finds a letter telling him to go to a certain address, where an aged Monsieur Ferdinand, the last descendant of the wizard Eusebius, gives him the potion that will return him to 1123. Jacquouille, however, wants to stay, enjoying Ginette's company and having proved more adaptable than Godefroy in discovering toothpaste (curing the halitosis that made him objectionable in 1123), modern clothing and other amenities of the future. Furious at his behavior, Godefroy finally brings him to the hotel room by force.\nWhile Godefroy is talking with Béatrice, Jacquouille swaps jackets with his descendant, closes the curtains, dims the lights, and puts Jacquard on the bed in his place. In the dark, Godefroy gives Jacquard (thinking it is Jacquouille) the potion which then sends him back to the year 1123. Godefroy equally comes back just in time to stop himself from shooting Frénégonde's father, and the deflected crossbow bolt kills the witch who caused the whole misadventure by drugging Godefroy's flask. The bewildered Jacquard finds himself stranded in the past in the role of Godefroy's servant as Godefroy leaves on horseback with Frénégonde."}