{"mid": "LetItShine", "IMDB_id": "tt6386436", "title": "Let It Shine", "plot": "In Atlanta, Georgia, Cyrus DeBarge (Tyler James Williams) is a musically talented choir director who writes rap lyrics under the pseudonym \"Truth\" because of his father Pastor Jacob's (Courtney B. Vance) disapproval of hip hop music and his shy demeanor compared to his more outgoing best friend Kris McDuffy (Trevor Jackson). Cyrus also secretly works as a busboy at a club, Off the Street, where the music label of their childhood friend, teenage singing sensation Roxanne \"Roxie\" Andrews (Coco Jones), is sponsoring a songwriting contest. Roxie chooses Truth's heartfelt song \"Don't Run Away\" as the winning entry but misidentifies Kris as Truth because the photo Cyrus submitted was of them both. Kris convinces Cyrus to let him take credit for the song because he has feelings for Roxie. As Kris uses Cyrus' verses to get closer to both Roxie's heart and his newfound fame, Cyrus begins to resent his best friend.\nCyrus and Roxie get to know each other and Roxie says she can talk to him better than she can talk to Kris. Cyrus invites Roxie to perform with the choir at his church. Right after their rousing performance, Pastor Jacob humiliates Roxie in front of the congregation by calling out people who are living in \"hip-hop-crisy\". At the urging of his wife, Gail (Dawnn Lewis), Pastor Jacob goes to the club to apologize to Roxie, where he catches his son working at the club, and learns that Cyrus writes rap lyrics. Although furious at first, Pastor Jacob comes to realize his son's raps carry positive messages and rescinds his initial disapproval.\nThe conflict between Cyrus and Kris comes to a head when they have a physical altercation at the club. Levi (Alex Désert), the club owner, convinces the two not to let their friendship die. The two mend their friendship and during a duet with Roxie, Cyrus takes Kris' place on the stage to sing \"Me and You\", revealing through the lyrics that he was Truth all along. Cyrus apologizes and confesses his true feelings, but Roxie storms from the stage and wants nothing to do with either of them. At a hip hop battle contest, Cyrus calls out the winner, an arrogant rapper named Lord of Da Bling (Brandon Mychal Smith). The two battle for the trophy, which Cyrus wins by rapping to the audience that Bling is not in fact rich, but a normal person, which he found out by seeing Bling work his day job as a taxi driver.\nKris eventually tells Roxie that Cyrus is a great person and only pretended he was not Truth for Kris, and they did not try to hurt Roxie: he also says Cyrus is real and that is who she needs to be with. Roxie goes to church and hugs Cyrus and they sing \"Let it Shine\"."}