{"mid": "LetItRide", "IMDB_id": "tt0097731", "title": "Let It Ride", "plot": "Jay Trotter drives a cab. His friend Looney, also a cab driver, has a secret microphone in his taxi to record his passengers' conversations. Looney has a tape of two men talking about a horse race and how one of the horses, due to some unethical practice by its owner, is a sure thing to win big. Jay goes to the track to place a bet—despite the fact that the day before, he told his wife Pam that he would quit betting and be home to \"start their marriage over\" at noon. In the restroom of the bar next door, he prays to God, \"Just one day, that's all I'm asking for, one day, I'm due.\" A man exiting the bathrooms says \"Ya? So's Jesus. Let it ride.\" Jay promptly places a $50 bet. The horse wins in a photo finish and pays $28.40 to win (earning him $710).\nArmed with a newfound sense of confidence, Jay approaches the two men from Looney's cab and generously gives them the tape of their conversation. Out of gratitude, they give him a tip for the next race. He places a bet and wins again.\nSensing that this could be his \"lucky day,\" Jay goes on picking winner after winner, letting it ride (betting all of his winnings each time). As he accumulates more money and uses his new friends' membership in the track's exclusive dining room, he starts coming into contact with other gamblers, including the wealthy Mrs. Davis and a sexy vixen named Vicki. He becomes a hero to the ticket seller (Robbie Coltrane) whose window he uses every time, and to the customers of the track's bar.\nHowever, he has totally neglected his wife Pam. Pam flies into a rage when she confronts her husband at the track. He cannot stop. He takes a survey of the track patrons and, eliminating any selection they give him, bets on the remaining horse—Fleet Dreams, which wins. Jay decides to call it a day and goes home to Pam, buying her a diamond necklace on the way. At home he finds Pam intoxicated and passed out.\nHe heads back to the track to help the patrons of Marty's bar across the street, but when he suggests sharing his luck by betting their money together, they balk at the idea. Disconcerted, he goes for a walk around the track. Vicki offers to \"go to bed with him.\" Jay \"breaks the fourth wall\" by saying to the audience, \"Am I having a good day or what?\" Ultimately, he turns Vicki down by professing his love for his wife.\nJay makes a final bet of $68,000 (his winnings for the day) after Looney advises him not to bet on Hot to Trot. As the race begins, Looney and Trotter argue over everything, and the main characters all make resolutions. In Vicki's case, she vows to give up rich guys and consider a poor one, looking at Looney. The race comes down to a photo finish. While everyone awaits the result, Pam shows up to thank Jay for his lovely gift and to tell him not worry about the money, when the announcer reports the winner: Hot to Trot. The entire racetrack erupts in celebration, and Pam asks, \"Why is everyone cheering?\" Jay replies, \"Because I'm having a very good day.\""}