{"mid": "LifeOfPi", "IMDB_id": "tt0454876", "title": "Life of Pi", "plot": "The novel begins with a note from the author, which is an integral part of it. Unusually, the note describes entirely fictional events. It serves to establish and enforce one of the book's main themes: the relativity of truth.\nLife of Pi is subdivided into three sections:\n=== Part one ===\nIn the first section, the main character, by the name of Piscine Patel, an adult Canadian, reminisces about his childhood in India. His father owns a zoo in Pondicherry. The livelihood provides the family with a relatively affluent lifestyle and some understanding of animal psychology.\nThe narrator describes how he acquired his full name, Piscine Molitor Patel, as a tribute to the swimming pool in France. After hearing schoolmates tease him by transforming the first name into \"Pissing\", he establishes the short form of his name as \"Pi\" when he starts secondary school. The name, he says, pays tribute to the irrational number which is the ratio of the circumference of a circle to its diameter.\nIn recounting his experiences, Pi describes several other unusual situations involving proper names: two visitors to the zoo, one a devout Muslim, and the other a committed atheist, bear identical names; and a 450-pound tiger at the zoo bears the name Richard Parker as the result of a clerical error, in which human and animal names were reversed.\nPi is raised as a Hindu who practices vegetarianism. At the age of fourteen, he investigates Christianity and Islam, and decides to become an adherent of all three religions, much to his parents' dismay, saying he \"just wants to love God.\" He tries to understand God through the lens of each religion, and comes to recognize benefits in each one.\nA few years later in 1977, during the period when Indian Prime Minister Indira Gandhi declares \"The Emergency\". Ultimately, Pi's father decides to sell the zoo and emigrate with his wife and sons to Canada.\n=== Part two ===\nThe second part of the novel begins with Pi's family aboard the Tsimtsum, a Japanese freighter that is transporting animals from their zoo to North America. A few days out of port from Manila, the ship encounters a storm and sinks. Pi manages to escape in a small lifeboat, only to learn that the boat also holds a spotted hyena, an injured Grant's zebra, and an orangutan named Orange Juice. Much to the boy's distress, the hyena kills the zebra and then Orange Juice. At this point, Pi learns that a tiger has been hiding under the boat's tarpaulin: it's Richard Parker, who had boarded the lifeboat with ambivalent assistance from Pi himself some time before the hyena attack. Suddenly emerging from his hideaway, Richard Parker kills and eats the hyena.\nFrightened, Pi constructs a small raft out of rescue flotation devices, tethers it to the stern of the boat and makes it his place of retirement. He begins conditioning Richard Parker to take a submissive role by using food as a positive reinforcer, and seasickness as a punishment mechanism, while using a whistle for signals. Soon, Pi asserts himself as the alpha animal, and is eventually able to share the boat with his feline companion, admitting in the end that Richard Parker is the one who helped him survive his ordeal.\nPi recounts various events while adrift in the Pacific Ocean. At his lowest point, exposure renders him blind and unable to catch fish. In a state of delirium, he talks with a marine \"echo\", which he initially identifies as Richard Parker having gained the ability to speak, but it turns out to be another blind castaway, a Frenchman, who boards the lifeboat with the intention of killing and eating Pi, but is eventually killed by Richard Parker.\nSome time later, Pi's boat comes ashore on a floating island network of algae and inhabited by hundreds of thousands of meerkats. Soon, Pi and Richard Parker regain strength, but the boy's discovery of the carnivorous nature of the island's plant life forces him to return to the ocean.\nTwo hundred and twenty-seven days after the ship's sinking, the lifeboat washes onto a beach in Mexico, after which Richard Parker disappears into the nearby jungle without looking back, leaving Pi heartbroken at the abrupt farewell.\n=== Part three ===\nThe third part of the novel describes a conversation between Pi and two officials from the Japanese Ministry of Transport, who are conducting an inquiry into the shipwreck. They meet him at the hospital in Mexico where he is recovering. Pi tells them his tale, but the officials reject it as unbelievable. Pi then offers them a second story in which he is adrift on a lifeboat not with zoo animals, but with the ship's cook, a Taiwanese sailor with a broken leg, and his own mother. The cook amputates the sailor's leg for use as fishing bait, then kills the sailor himself as well as Pi's mother for food, and soon he is killed by Pi, who dines on him.\nThe officials note parallels between the two stories. They soon conclude that the hyena symbolizes the cook, the zebra the sailor, the orangutan Pi's mother, and the tiger Pi. Pi points out that neither story can be proven and neither explains the cause of the shipwreck, so he asks the journalist which story they prefer: the one without animals or the one with animals. They eventually choose the story with the animals. Pi thanks them and says: \"And so it goes with God.\" The journalist then leaves and files a report."}