{"mid": "LifeOfBrian", "IMDB_id": "tt0079470", "title": "Life of Brian", "plot": "Brian Cohen is born in a stable next door to the one in which Jesus is born, which initially confuses the three wise men who come to praise the future King of the Jews. Brian grows up an idealistic young man who resents the continuing Roman occupation of Judea. While attending Jesus' Sermon on the Mount, Brian becomes infatuated with an attractive young rebel, Judith. His desire for her and hatred for the Romans lead him to join the \"People's Front of Judea\", one of many fractious and bickering independence movements, who spend more time fighting each other than the Romans.\nAfter several misadventures, and escaping from Pontius Pilate, Brian winds up in a line-up of would-be mystics and prophets who harangue the passing crowd in a plaza. Forced to come up with something plausible in order to blend in and keep the guards off his back, Brian repeats some of what he had heard Jesus say, and quickly attracts a small but intrigued audience. Once the guards have left, Brian tries to put the episode behind him, but he has unintentionally inspired a movement. He grows frantic when he finds that some people have started to follow him around, with even the slightest unusual occurrence being hailed as a miracle. Their responses grow in fervor and intensity, making it harder and harder for him to get away from them, yet because of the mob's excitement over the 'miracles' they discover, they ultimately end up completely ignoring Brian himself. Judith is the only one that doesn't leave; Brian and Judith then spend the night together. In the morning, Brian, completely naked, opens the curtains to discover an enormous crowd outside his mother's house which proclaims him to be the Messiah. Brian's mother protests, telling the crowd that \"He's not the Messiah, he's a very naughty boy\" and, \"There's no Messiah in here. There's a mess, all right, but no Messiah.\" All of her attempts at dispersing the crowd are rebuffed. Furthermore, once Brian addresses them, he also finds that he is unable to change their minds. His followers are completely committed to their beliefs in and of Brian's divinity. They immediately seize upon everything he says and does as points of doctrine.\nThe hapless Brian is unable to escape his unwanted 'disciples'; even his mother's house is surrounded by an enormous, enraptured crowd. They fling their afflicted bodies at him, demanding miracle cures and divine secrets. After sneaking out the back, Brian is then finally captured and scheduled to be crucified. Meanwhile, yet another huge crowd has assembled outside the palace. Pontius Pilate (together with the visiting Biggus Dickus) tries to quell the feeling of revolution by granting them the choice of one person to be pardoned. The crowd, however, shouts out names containing the letter \"r\", mocking Pilate's rhotacistic speech impediment. Eventually, Judith appears in the crowd and calls for the release of Brian, which the crowd echoes since the name also contains an \"r\". Pilate agrees to \"welease Bwian\".\nHis order is eventually relayed to the guards, but in a scene that parodies the climax of the film Spartacus, various crucified people all claim to be \"Brian of Nazareth\" and the wrong man is released. Various other opportunities for a reprieve for Brian are denied as, one by one, his \"allies\" (including Judith and his mother) step forward to explain why they are leaving the \"noble freedom fighter\" hanging in the hot sun. Hope is renewed when a crack suicide squad from the \"Judean People's Front\" (not to be confused with the People's Front of Judea) come charging towards the Romans, but rather than fighting to release Brian or the other prisoners, they commit mass suicide as a political protest. Condemned to a long and painful death, Brian finds his spirits lifted by his fellow sufferers, who break into song with \"Always Look on the Bright Side of Life.\""}