{"mid": "LikeFatherLikeSon", "IMDB_id": "tt0442683", "title": "Like Father Like Son", "plot": "Ryota Nonomiya is a successful businessman who is focused so much on work that he neglects his wife, Midori, and son, Keita. Upon his return home one day, Midori tells him that the hospital where Keita was born needs to speak to them urgently, and Ryota senses trouble. After arriving at the hospital, the couple learns that their biological son Ryusei was switched with Keita after birth, and after DNA tests prove the error, they must now make a life-changing decision to either keep Keita, the boy they raised as their own son, or switch him for their biological son.\nRyota and Midori soon meet with the other couple, Yukari and Yudai Saiki, small town folks who lack the money and drive that Ryota possess, but have a better understanding of the importance of child and parent bonds. They share photos, and for the first time, Ryota and Midori see their biological son, Ryusei. After several meetings, they decide to switch children for one Saturday, which goes relatively well for both considering the tense situation. After several more meetings, they finally decide to exchange children. All four parents have difficulty accepting the loss of their previous sons, and the absence of the parents they used to know causes both boys to shut down emotionally, culminating in Ryusei running away from the Nonomiya's home and returning to the Saiki's. Ryota picks up Ryusei and brings him back home.\nRyota and Midori begin to bond with Ryusei, who is also warming up to them. However, while going through the photos on his camera, Ryota discovers a cache of photos of him, mostly sleeping, that Keita took, and he breaks down crying. The three return to the Saiki family so Ryota, who has now understood the errors of his ways, can see Keita, but Keita runs away from him. While following him, he apologizes to Keita, and the two make amends. The film ends with the two returning to the Saiki's, and both families entering the home."}