{"mid": "Lili", "IMDB_id": "tt0046000", "title": "Lili", "plot": "Naive country girl Lili (Leslie Caron) arrives in a provincial town in hopes of locating an old friend of her late father, only to find that he has died. A local shopkeeper offers her employment, then tries to take advantage of her. She is rescued by a handsome, smooth-talking, womanizing carnival magician, Marc, whose stage name is Marcus the Magnificent (Jean-Pierre Aumont). Lili is infatuated with him and follows him to the carnival, where on learning that she is 16, he helps her get a job as waitress. Lili is fired on her first night when she spends her time watching the magic act instead of waiting tables. When Lili consults the magician for advice, he tells her to go back to where she came from. Homeless and heartbroken, she contemplates suicide, unaware that she is being watched by the carnival's puppeteer Paul (Mel Ferrer). He strikes up a conversation with her through his puppets—a brash red-haired boy named Carrot Top, a sly fox, Reynardo, a vain ballerina, Marguerite, and a cowardly giant, Golo. Soon, a large group of carnival workers is enthralled watching Lili's interaction with the puppets, as she is seemingly unaware that there is a puppeteer behind the curtain. Afterwards, Paul and his partner Jacquot (Kurt Kasznar) offer Lili a job in the act, talking with the puppets. She accepts, and her natural manner of interacting with the puppets becomes the most valuable part of the act.\nPaul was once a well-known dancer, but suffered a leg injury in World War II. He regards the puppet show as far inferior to his old career, which embitters him. Lili refers to him as \"the Angry Man\". Although he falls in love with Lili, he can only express his feelings through the puppets. Fearing rejection due to his physical impairment, he keeps his distance by being unpleasant to her. Lili continues to dream about the handsome magician, wishing to replace his assistant Rosalie (Zsa Zsa Gabor).\nSoon, Marcus receives an offer to perform at the local casino and decides to leave the carnival, to the joy of Rosalie, who announces to everyone that she is his wife. Lili is heartbroken and innocently invites Marc to her trailer. His lecherous plans are interrupted by Paul, and he leaves. When Lili finds Marc's wedding ring in the seat cushions and tries to chase him, Paul stops her, calls her a fool, and slaps her.\nTwo impresarios from Paris who have been scouting the show come to see Paul and Jacquot. They recognize Paul as the former dancer and tell him that his act with Lili and the puppets is ingenious. Paul is ecstatic about this and the offer, but Jacquot tells the agents that they will have to let them know. He then tells Paul that Lili is leaving.\nLili takes the wedding ring to Marc and tells him that every little girl has to wake up from her girlish dreams. She has decided to leave the carnival. On her way out, she is stopped by the voices of Carrot Top and Reynardo, who ask her to take them with her. As they embrace her, she finds they are shaking. She remembers somebody is behind the curtain and pulls it away to see Paul. Instead of telling her how he feels, he tells her of the agents' offer. She confronts him about the difference between his real self, seemingly incapable of love, and his puppets. He tells her he is the puppets, a creature of many facets and many flaws. He concludes by telling her, \"This is business.\" \"Not any more,\" retorts Lili, who walks away.\nWalking out of town, she imagines that the puppets, now life-sized, have joined her. As she dances with each puppet in turn, they all turn into Paul. Coming back to reality, Lili runs back to the carnival and into Paul's arms. They kiss passionately as the puppets applaud."}