{"mid": "Limitless", "IMDB_id": "tt1219289", "title": "Limitless", "plot": "Eddie Morra (Bradley Cooper) is a dishevelled unemployed writer. He has a contract to write a book but is more talk than action. He has writer's block. At lunch with his girl Lindy (Abby Cornish), she gives him his keys back and breaks up, frustrated with his lack of career progress while she has recently been promoted to editor.Walking morosely down the New York St, he bumps into his ex-brother in law Vernon (Johnny Whitworth), after nine years. Vernon is friendly and invites Eddie for a drink. They talk about Melissa, who is living upstate. Eddie confesses he is behind schedule on the book. Vern is consulting with a pharmaceutical company, he passes Eddie a new brain drug to come on the market next year. Vern has to leave but leaves his business card. Eddie takes the translucent pill on his way home.In the stairwell he bumps into the landlord's wife, she rags him about late rent and lack of career. The drug begins to take effect and Eddie notices things with clarity. He then starts talking to the woman with confidence about legal studies and a short time later they go and have sex.Back in his slovenly apartment Eddie notices the mess and quickly cleans up, he then gets on his laptop and starts writing. The words fly. The next morning he is back to normal but he has several hundred pages of his book printed out. He brings them to his editor who eyes them warily. At his apt he checks his voicemail, the editor is anxious to talk, she has read 40 pages and is impressed.Eddie goes to visit Vernon. Vern's face is bloody but won't say what happened. Vern explains the drug is called NZT48 and asks Eddie to pick up his dry cleaning and get some food. On returning the door is ajar. Vern is on the sofa, dead and the apartment is turned over. Eddie is stunned and scared. He settles down and calls 911. Then he searches for the NZT48 stash, while waiting for the police he finds a plastic baggie full of the pills inside the oven, along with a wad of cash and an address book.He hides these from the cops who eventually release him after a short interview. At the police station he has a telecon with Melissa, his ex-wife. Back at home he takes another pill and gets a haircut, new clothes and motivation to finish the book in four days. He learns piano, cards, fitness, new languages, new friends and talks like a know-it-all about everything. One of his listeners, Kevin Doyle (Darren Goldstein), gives him a business card. He is invited to a jet-set beach party down south. He zooms around with a babe and a Maserati, then shows off by cliff diving from over 100 ft. He realizes he needs money.He slowly starts day trading but needs more capital. A cafe owner sets him up with a Russian loanshark, Gennady (Andrew Howard). The Russian hands him $100,000 but threatens to skin him alive if he doesn't pay it back.Now he starts stock trading in earnest and rapidly increases his brokerage account to $2M. Job offers and reporters call. Kevin Doyle offers a meeting with Carl Van Loon. At dinner, Lindy is impressed with the new Eddie. They re-connect. Eddie's photo is in the paper as \"mystery trader\". A man in a tan coat (Tomas Arana) seems to be spying on them. At night Eddie is nervous, sensing something.Eddie meets corporate raider Carl Van Loon (Robert De Niro) in a restaurant. He jokingly says his secret is a drug but then expounds on his knowledge and hints at a formula based on mass psychology. In a limo Carl tests Eddie by asking him to review a file of different companies. Eddie guesses there is a major merger in the works, he is dropped off in Chinatown as Carl invites him the next day for another meeting.Walking, Eddie loses track of time. Among disjointed events; In a subway station he recalls Bruce Lee movies to help him battle a gang of muggers. He then ends up in a bar and meets new friends and shags a blonde woman, 18 hours later he finds himself back to normal. His can of NZT 48 is empty and he can't decipher the corporate files anymore. He calls to beg off the meeting with Carl but Kevin convinces him to attend.Carl asks him about Hank Attwood, one of his corporate rivals who came from nowhere 2 years ago. On the TV Eddie notices a news item about the murder of a blonde woman in a hotel the previous day. He excuses himself and vomits outside. He thinks to himself did he kill the girl?Eddie tries to find Vernon's other clients to get more NZT. Each phone call is a dead end. The next call he makes co-incidentally seems to ring the phone of the tan-coat tough guy sitting on the other side of a parkette. Eddie realizes first and makes an escape.He meets his ex wife Melissa (Anna Friel) in a cafe. She is a strungout junkie, admits she took NZT too. She tried to quit it, then found out from Vern other users have died. Now off of it for two years she cannot concentrate for more than 10 minutes and her life is a mess. She urges him to taper off slowly or else he will die.The Russian loanshark finds him and demands his money. In rousting Eddie he finds the NZT and takes it. He feels good and lets Eddie go after getting his $100k back. Eddie, sick and bedraggled, staggers into Lindy's office. He tells her everything and admits he needs the drugs. His main stash is in Lindy's house, she recovers the plastic bag. In the taxi coming back she is attacked by the man with the tan coat from the parkette. He kills two bystanders trying to help Lindy as she runs off and hides in a park. She phones Eddie and he encourages her to take one of the pills. Under the influence, Lindy escapes.Eddie and Lindy sleep together, in the morning she dresses and is sombre. She doesn't want anything more to do with NZT, Eddie says he needs more time with it to set things up. Lindy leaves him.Once again the Russian meets Eddie and wants some of the pills. Eddie then hires two bodyguards. He meets Carl again looking and acting sharp. Now he is charge of brokering the largest takeover in history. Eddie has figured out the proper dosage to take and not to take alcohol with it.He hires a chemist to reverse engineer the NZT pills in 6 months.At a restaurant he notices the police detective who shows him the photo of him in the newspaper, he was identified as being at the hotel of the murdered blonde. Eddie hires a good lawyer, there is only circumstantial evidence. Meanwhile the merger goes on. Eddie wants to move on but Carl wants him to keep working, Carl also reminds him he has a freak ability and hasn't paid his dues.Eddie goes to buy an $8.5M secure condo. He meets the Russian again who wants 20 pills, or else.At the office Carl and Eddie meet Hank Attwood's wife, she tells him he is in the hospital but the deal will close when he gets better. On the street he notices Mrs.Attwood's limo driver is the man with the tan coat and realizes Attwood must be an NZT user also.Eddie has to go to the police station and is put in a ID lineup but his lawyer, Morris Brandt, gets him released.At the office Carl is upset. Attwood is in a coma and Carl wants to know where Eddie has been and thinks Eddie knows what is going on. In the washroom Eddie notices his pills are missing (stolen). A box arrives addressed to him, Eddie grabs the box and leaves a fuming Van Loon. Inside the box are severed hands (his two bodyguards).At the condo Eddie watches TV and sees Mrs. Attwood and her lawyer, Morris Brandt also. He sees the Russians coming on the security video. They start bashing in his steel door. Eddie goes to the balcony edge and is ready to kill himself. He suddenly remembers where one last NZT pill is and tries to retrieve it as the Russians break in. The Russian shoots up the last pill via needle and begins to threaten Eddie with slow painful torture. With one final thrust Eddie manages to turn the tables and kills the Russian. The other two Russian thugs come back in the room and Eddie manages to fight them off after licking the dead Russias's blood, that contains NZT.At the hospital Hank Attwood dies. Eddie realizes that Brandt stole his pills but did not give them to Mr. Attwood. Eddie meets the man with the tan coat in the waiting room, who, now that his boss was dead, allows Eddie to search Brandt's safe (while Brandt is tied and gagged by the tan-coat man) where he finds his pills packet.12 months later Eddie's book is published. He is running for the U.S. Senate (NY) and meets Carl in his campaign office. Carl hints that he knows how Eddie has done it and has shut down his lab. Carl will guarantee a limitless supply in return for some future inside information. Eddie aggressively comes back, showing off his abilities he says he is off NZT and doesn't need it as he pushes Carl away. At an upscale Chinese restaurant Eddie and Lindy are together again."}