{"mid": "Lionheart", "IMDB_id": "tt0100029", "title": "Lionheart", "plot": "A man is buying drugs from a dealer until his men burn the man alive. The man is rushed to the hospital where his wife and daughter are waiting. As he dying, he yells out Leon, his brother's name. Three weeks later Leon, Lion Heart (LH) is shown working in the desert for the French Foreign Legion, when he get's the letter about his brother. He gets in into an argument with his C.O. over being kept in the dark. When the hot headed C.O. decides to put LH in a \"box\", LH escapes in a jeep, headed to the ocean. He makes it to a ship and then to N.Y.C., after a short fist fight with a ship worker that got into his way. Since his brother's wife and daughter live in L.A. and he has no money, he enters a paid fight in a ghetto. After he wins easily, Joshua, who runs the fight ring, takes him to a higher class and higher stakes organizer (Cynthia). LH doesn't want to go along with it, but he eventually agrees to fight in L.A., near his family. When he goes to visit his niece and sister in law Helene, he is cast out. Helene is in serious financial disarray, and thinks that LH is also dealing drugs when he offers money. So, LH has Joshua and Cynthia set up a phantom life insurance policy so Helene can get the money without seeing where it came from. With this in place, LH starts to fight with everything he has. Cynthia, meanwhile tries to seduce him into being her boy toy. When he refuses, she starts to work with the 2 agents that are hot on his trail to bring him back and have him tried as a deserter. After beating those two up, he gets away and then a high stakes match is scheduled. This match is with the unbeaten and colossal Attila, and big investors get involved. Cynthia knows that LH is injured and keeps it a secret when she quietly bets it all on Attila. She double crosses everyone believing the LH has no chance. Finally, Joshua and LH break the truth to Helene and she accepts him into the family. He then gets ready for his final fight. The 2 agents are there to seize him at the end of the match. Attila enters the ring and after taking many blows from LH, delivers a few of his own. Soon, Attila finds out about his injured ribs and tries to exploit that. Shortly afterward LH is down and hurting. Joshua comes to him and tries to talk him out of going on. LH won't hear of it, and his fire burns hotter than ever as he charges the bigger Attila. LH swaps blows until he has the upperhand. Then LH lands kick after kick as the the crowd gets behind him and cheers him on. Soon Attila is finished and the badly injured LH is carried away by the 2 agents. Meanwhile, Cynthia has lost and finds herself in trouble. Then the agent take him back to Helene's to say goodbye. After the heartbreaking and emotional episode, LH gets in their car to go back and face his destiny. But the agents seem to have a change of heart and let him go a block later. He runs back to Helene and her daughter to start his new life with them and Joshua. Thank you for reading! blogmonstermike.word press.com"}