{"mid": "LittleRedRidingRabbit", "IMDB_id": "tt0037022", "title": "Little Red Riding Rabbit", "plot": "Little Red Riding Hood is depicted as a typical 1940s teen-aged girl, a \"bobby soxer\" with an extremely loud and grating voice (inspired by screen and radio comedian Cass Daley, provided by Bea Benaderet). After she sings the first verse of \"Five O'Clock Whistle\" in the opening to establish this fact, Bugs pops out of her basket to ask where she's going. She replies that she's going to \"bring a little bunny rabbit to [her] grandma ta HAVE.\"\nWith this part of the story set up, the wolf is now introduced. The wolf switches a \"Shortcut to Grandma's\" sign, so that Red has to go through a long mountain path, while the wolf uses the real shortcut – a few short steps to the house. Seeing a note on the door that Grandma isn't home (apparently, Grandma is a \"Rosie the Riveter\" type who's working the \"swing shift\" at Lockheed), the wolf sneaks inside and dresses like Grandma, only to find that three other wolves are similarly dressed and waiting in the bed for Red! The wolf (voiced by Billy Bletcher) growls for the others to \"COME ON! COME ON! Take a powder – this is MY racket!\" The other wolves leave, grumbling to themselves, and a small wolf hiding under the pillow sheepishly follows suit, too. Once in bed, the wolf waits for Red to arrive. But in a twist, the wolf isn't interested in eating Red, but rather the rabbit she brings to Grandma.\nThe wolf quickly shuffles Red out the door and tries looking for Bugs in the basket. Bugs, however, gets the better of the wolf and runs around the house, with the wolf in hot pursuit. Along the way, Bugs subjects the wolf to the famous lots-of-doors in-and-out routine (which will be repeated in Buccaneer Bunny). The wolf, however, is constantly interrupted by Red, who continues asking the questions from the actual story. The wolf then yells at her to get out.\nWhen the wolf corners Bugs, Bugs mimics the wolf, eventually distracting him into singing \"Put On Your Old Gray Bonnet (With the Blue Ribbons on It)\". Bugs manages to get a glowing coal from the fireplace and sends the wolf screaming in pain to the ceiling by scorching his backside. When the wolf comes down, Bugs has a large shovelful of coals waiting to scorch the wolf. However, the wolf manages to catch his feet on the ends of two benches just in time, doing the \"splits\". Instead of simply kicking one of the benches away, Bugs proceeds to dump heavy weights into the wolf's arms. After clearing out just about everything in the house (except the kitchen sink), Bugs is about to apply the coup de grace on the wolf – by placing an olive branch on top of the mass of junk and furniture the wolf is holding – when Red comes back in, bellowing \"Hey, GRANDMA!\" (By now, Red has already questioned the wolf on his big eyes, big nose, big ears and sharp teeth, and one wonders what she was planning to ask next.)\nBy this time, even Bugs has had enough of Red's interruptions, prompting him to say, \"I'll do it, but I'll probably hate myself in the morning.\" He descends the ladder, out of frame, there's a shuffling of the furniture... and now RED is the one trying to avoid getting scorched, while Bugs and the wolf, arms around each other's shoulders, share a carrot and self-satisfied looks, and await the inevitable."}