{"mid": "LittleManhattan", "IMDB_id": "tt0412922", "title": "Little Manhattan", "plot": "10-year-old Gabe meets an 11-year-old girl in his grade, Rosemary, who he's known since kindergarten. But after being partnered with her for sparring in self-defense class, he suddenly notices her as a girl, not another face. To Gabe's elation, they begin spending time together and he is completely enamored with not only her, but her life. He takes her on a tour through Central Park, and another day they venture for fun across the city and use their self-defense skills to fight a bully named Daryl Kitzens and try to inspect an apartment for rent, worrying his nervous parents. He discovers that Rosemary is soon leaving for camp for six weeks and won't be back until summer's end and her parents are planning to enroll her in a private school. She lives with her loving upper-class parents, and on the edge of Central Park. Rosemary's parents take him and Rosemary to hear a jazz pianist at The Carlyle, where the young twosome finally hold hands. After the show, Rosemary's parents tell them to say goodnight and her parents go to get milk. After the parents leave, Gabe and Rosemary begin talking, and he interrupts her by kissing her. His daily exploits are followed and encouraged by the friendly concierge at his building.\nRosemary's family's life is in contrast to Gabe's; he lives with his soon-to-be-divorcing parents, who have declared an awkward truce while waiting for their divorce to be finalized. As their relationship progresses, Gabe begins to question what is happening to him and why he is falling in love with Rosemary. When things seem to be going perfectly, Gabe's world is suddenly turned upside down when he and Rosemary are assigned new sparring partners. Gabe is instantly jealous of Rosemary's new partner: a taller blonde boy named Tim Staples, who's much better at self-defense than he is. With their remaining time running out, Gabe tries to move closer to Rosemary, but only drives her away. In a desperate move to win Rosemary back, Gabe attempts to show off for Rosemary, but painfully fractures his hand in the process.\nBeing crushed with what love really is, he learns from his father that the parents' marriage fell apart because of things left unsaid. Realizing he is out of time, Gabe goes to find Rosemary. He interrupts her during the wedding reception she is attending and declares his love. Taken aback, Rosemary replies she doesn't think she is ready for love, but is really happy to see Gabe. She asks for a dance and Gabe agrees. As they dance, Gabe muses that he and Rosemary were on different paths — \"like two ships that passed in Sheep Meadow\". He returns home to find his parents laughing over their honeymoon recollections. Gabe is pleased and surprised when his father says he \"cleared out some old stuff\" and his parents appear to have reconciled. They happily go out for dinner, and as the movie ends, Gabe, narrating, summarizes what Rosemary meant to him: \"...I'm never gonna get another first love. That one's always gonna be her.\""}