{"mid": "LittleMissMarker", "IMDB_id": "tt0025410", "title": "Little Miss Marker", "plot": "The film tells the story of \"Marky\" (Shirley Temple), whose father gives her to a gangster-run gambling operation as a \"marker\" (collateral) for a bet. When he loses his bet and commits suicide, the gangsters are left with her on their hands. They decide to keep her temporarily and use her to help pull off one of their fixed races, naming her the owner of the horse to be used in the race.\nMarky is sent to live with bookie Sorrowful Jones (Adolphe Menjou). Initially upset about being forced to look after her, he eventually begins to develop a father-daughter relationship with her. His fellow gangsters become fond of her and begin to fill the roles of her extended family. Bangles (Dorothy Dell) - girlfriend of gang kingpin Big Steve (Charles Bickford), who has gone to Chicago to place bets on the horse - also begins to care for Marky, and to fall in love with Sorrowful, whose own concern for Marky shows he has a warm heart beneath his hard-man persona. Sorrowful, encouraged by Bangles and Marky, gets a bigger apartment, buys Marky new clothes and himself a better cut of suit, reads her bedtime stories, and shows her how to pray.\nHowever, being around the gang has a somewhat bad influence on Marky, and she begins to develop a cynical nature and a wide vocabulary of gambling terminology and slang. Bangles and Sorrowful, worried that her acquired bad-girl attitude means she won't get adopted by a \"good family,\" put on a party with gangsters dressed up as knights-of-the-round-table, to rekindle her former sweetness. She is unimpressed until they bring in the horse and parade her around on its back. Big Steve, returning to New York, frightens the horse, which throws her, and she is taken to the hospital. Big Steve goes there to pay back Sorrowful for trying to steal Bangles but is roped into giving Marky the direct blood transfusion she needs for her life-saving operation. Sorrowful, praying for her survival, destroys the drug which, administered to the horse, would have helped it win the race but killed it soon after. Big Steve, told he has \"good blood\" and pleased to have given life for a change, forgives Bangles and Sorrowful. They plan to marry and adopt Marky."}