{"mid": "LittleRuralRidingHood", "IMDB_id": "tt0041593", "title": "Little Rural Riding Hood", "plot": "The film opens with a stereotypical hillbilly version of Little Red Riding Hood (voiced by Colleen Collins), telling the audience that she's taking \"nourishment\" (as she holds up a cliché moonshine bottle) to her grandma, who lives on a country farm. At the farmhouse, a wolf (voiced by Pinto Colvig) reveals himself to the audience, but confesses that he doesn't want to eat Red. He's actually in love with her and wishes to kiss her.\nAfter a comical chase around the farmhouse, the wolf catches Red, and both prepare to kiss each other when a telegram arrives for the wolf from his city cousin (voiced by Daws Butler), inviting him to meet the city's equivalent of his Red (the same version seen in Red Hot Riding Hood). Upon seeing her photograph, the country wolf immediately falls in love with her and departs for the city.\nUnlike his cousin, the city wolf is rich and more suave and sophisticated. The city wolf takes his cousin to the club where the city's Red performs her dance routine (this scene was borrowed from Swing Shift Cinderella). The country wolf whistles and leers throughout the performance, becoming completely aroused by Red. However, before he can rush onto the stage to join her, his city cousin stops him (by grabbing his suspenders, placing a hammer in it, then letting go so it would snap back and knock him out), and takes him back to the country, feeling that city life is too much for him.\nUpon their arrival at the farmhouse, they find the country's Red waiting for them. Upon seeing country-Red, the city wolf, surprisingly, becomes wildly attracted to her, and runs to her, but is stopped his country cousin the same way the city cousin had stopped him earlier. Seeing an opportunity to see the city's Red again, the country wolf promptly decides to take his city cousin back home, claiming that he feels the country life is too much for him, and drives off back to the city."}