{"mid": "Lo", "IMDB_id": "tt1047490", "title": "Lo", "plot": "The film opens with Justin (Ward Roberts) sitting inside a pentagram and following the steps in a dark magic book to summon the crippled demon Lo (Jeremiah Birkett). Justin orders Lo to search Hell for his girlfriend April (Sarah Lassez), whom he insists was taken by a demon. Lo becomes angered not only by the demand but the fact that there are countless billions of people in Hell and finding April would be an impossible task. Undeterred, Justin orders Lo to search anyway. Conceding, Lo asks for details about April to narrow down his search. The memory of their first meeting begins to play in the background in the form of a Vaudeville play. April's personality is quirky, endearing, but overall odd.\nAs the flashback ends another demon, Jeez, arrives, whom Justin identifies as the demon who took April and injured him. Jeez has come to see \"the mortal who tamed the beast; it explains that it has felt many emotions (hate, annoyance, embarrassment), but never love, making it confused as to why \"it\" - April - fell in love with Justin. It says the one Justin calls April was once considered to be one of the best killers in Hell but abandoned its kin to experience love.\nJustin refuses to believe that April is a demon, despite insistence from Lo and Jeez. Lo makes a mistake in conversation, revealing that it in fact did know April - as a cold-blooded killer demon. After Justin insinuates that Lo is too weak to bring April back, Lo leaves in anger. While alone, Justin discovers that the cut on his hand from the summoning spell has begun to voice his subconscious thoughts and he begins to argue with it. Lo returns, finding the argument amusing.\nLo tells Justin that April is in \"lock up\" and can't be retrieved so instead it's brought two souls from Hell to describe the tortures they endure after April tricked them into selling their souls.\nLo once again states that it can't retrieve April, going as far as to say its legs were crushed when April returned to Hell. Justin jumps to the conclusion that Lo helped her escape and was punished. Lo tells him to think about her if he wants to see her again, beginning another Vaudeville-style flashback, this time of their first Christmas together.\nJustin hands April a present which she unwraps after some initial confusion to discover a rare copy of Faust. She seems confused by the concept of gift-giving but quickly becomes excited about the prospect of reading as she had never read a book besides her own before, a slip of the tongue she quickly covers up. Justin accepts it as her being quirky and doesn't seem to notice. April becomes confused when Justin asks what she got him and becomes upset when she realizes that he expected a gift as well. Realizing that she only has one thing to give as a gift, April gives him her book on demon summoning, which she explicitly tells him not to open and to burn it if she ever leaves.\nAs the flashback ends, Lo points out that it seems obvious she was a demon. The cut on Justin's hand begins to talk again, questioning April's trust in him and implying that she was using him, and he made it easy to do so. Lo tells Justin that his condition will only worsen the longer he stays in the circle and that he should undo the spell and leave. A waiter (the same one from the flashback about Justin's first encounter with April) then appears and offers Justin a drink. Lo tells Justin that the drink will allow him to travel though Hell to her. Lo asks him if April is truly worth going to Hell for and Justin responds by downing it, an act that causes Lo to laugh uncontrollably before telling him it was poison.\nLo leaves before Jeez arrives, telling Justin that it's a slow-acting poison that can be stopped, but only if he ends the spell, goes to a hospital and gets his stomach pumped. Justin responds by saying that he won't leave without \"her\", a fact that annoys Jeez who tells him that demons are genderless and that April is an \"it\". Out of curiosity, Jeez asks what love is. After a brief and pointless attempt at defining love Justin merely smiles, annoying Jeez to the point of leaving.\nThe hand begins to talk again, this time making the point that it would rather live than die for April. Justin agrees that he doesn't want to die, but wouldn't be able to live without her. Just as he is about to cut off his own hand to stop his inner conflict, Lo interrupts him.\nLo says that April is vile for falling in love and isn't worth any effort on Justin's part. Justin ignores this on the grounds that who she was on Earth isn't who she was in Hell. Lo remains adamant that she was always the same murderer she was in Hell. Justin responds by forcing a flashback while Lo watches.\nIn the flashback, Justin and April are in bed but are both woken up when she has a nightmare, only to be comforted by Justin. April suddenly smells sulfur and is attacked by Jeez. Justin tries to help but is slashed across his chest. As he lays dying, April bargains with Jeez to return to Hell as long as she is allowed to save him first, a condition Jeez agrees to. He reminds her to bring the book, but she brings the book of Faust instead, leaving the demon summoning book with Justin.\nOnce the flashback ends, Lo admonishes Justin for not burning the book as she had asked, saying that Justin had betrayed his love. Justin becomes digressive with Lo and comes to the conclusion that humans are allowed to make mistakes, while demons get satisfaction from torturing them because they don't have a choice. Lo begins to laugh again, accompanied with other demons, while Justin holds his head in pain. After Lo stops laughing at him, Justin becomes infuriated and shouts at a surprised Lo, reiterating that he is the master and that he has power over it. He orders Lo once again to find April in Hell, and then to \"fuck off\". Lo, left speechless, leaves. Once Justin calms down, he looks at a picture of April and begins to cry.\nJustin looks up to see April in front of him. She notes that he didn't burn the book, but she forgives him. Justin again affirms his love for her and his determination to bring her back with him. She kisses Justin, extracting the poison from his body. April tells Justin that she can't go with him as the demons would always find them, putting Justin in danger. Justin offers to stay but April refuses to let him stay in Hell for eternity. As April drags herself away she pauses and,looking back, she becomes Lo, revealing that they were the same person from the start.\nThe next day Justin is shown in his apartment preparing to burn the book. As he sets it on fire, he watches, ending the film."}