{"mid": "LockStockAndTwoSmokingBarrels", "IMDB_id": "tt0120735", "title": "Lock, Stock and Two Smoking Barrels", "plot": "Long-time friends and small-time criminals Eddy, Tom, Soap, and Bacon put together £100,000 so that Eddy, a genius card shark, can buy into one of \"Hatchet\" Harry Lonsdale's weekly high-stakes three card brag games. The game is rigged however, and the friends end up massively indebted to Harry, who fully expects them not to be able to come up with the money before the deadline he gives them. He has his sights set on Eddy's father's bar as repayment, and sets his debt collector Big Chris (who is often accompanied by his beloved son, Little Chris) to work in order to ensure that some form of payment is coming up.\nHarry also has his sights set on a couple of antique shotguns up for auction, and gets his enforcer Barry \"the Baptist\" to hire a couple of thieves, Gary and Dean, to steal them from a private home. The two turn out to be highly incompetent and unwittingly sell the shotguns to Nick \"the Greek\", a local fence. After learning this, an enraged Barry threatens the two into getting the guns back.\nEddy returns home and overhears his neighbours, a gang of robbers led by a brutal man called Dog, planning a heist on some cannabis growers supposedly loaded with cash and drugs. Eddy relays this information to the group, intending for them to rob the neighbours as they come back from their heist. In preparation for the robbery, Tom buys the antique shotguns from Nick the Greek.\nThe neighbours' heist gets under way; despite a gang member being killed by his own Bren Gun, and an incriminating encounter with a traffic warden, the job is a success and they return home with a duffle bag filled with money and a van filled with bags of marijuana. The success is short-lived however, as they get robbed by Eddy and friends before they've even unloaded their cargo. Eddy's group decide to keep the money and, with the help of Nick the Greek, sell the drugs to Rory Breaker, a drug dealer with a reputation for violence. Rory agrees to the deal, but later learns that the drugs were stolen from people in his employ and were in fact his all along. Thinking that Eddy and his friends knowingly concocted a scheme to rob him and sell his own drugs back to him, an enraged Rory threatens Nick the Greek into giving him Eddy's address.\nEddy and his friends go out to celebrate their successful heist, and spend the night at Eddy's father's bar. Meanwhile, Dog's crew accidentally learns that their neighbors are the ones that robbed them, and set up an ambush at Eddy's flat. When Rory and his gang also arrive to exact vengeance they have a shootout with Dog's crew, resulting in the deaths of all but Dog and Winston, one of the robbed drug manufacturers. Winston leaves with the drugs; Dog leaves with the two shotguns and the money, but is waylaid by Big Chris who knocks him out and takes everything. Meanwhile, Gary and Dean, having learned who bought the shotguns and not knowing that Chris works for Harry, follow him to Harry's place. Chris delivers the money and guns to Harry, but discovers when he returns to his car that Dog is hiding inside, holding a knife to Little Chris's throat and demanding Chris recover the money. Chris calmly agrees and starts the car. Meanwhile, Gary and Dean burst into Harry's office, starting a confrontation that ends up killing both of them, and Harry and Barry as well.\nHaving seen the carnage at their flat, Eddy and friends arrive at Harry's to offer their apologies, but when they discover Harry's corpse they decide to take the money for themselves. Before they are able to flee the scene, Chris crashes into their car to disable Dog, and brutally bludgeons Dog to death with his car door in retaliation for threatening his son (who is shown to be unharmed). He then takes the debt money back from the unconscious friends, but allows Tom to leave with the antique shotguns, after a brief standoff in Harry's office.\nThe friends are arrested, but declared innocent after the traffic warden identifies Dog's dead crew as the prime suspects. Back at the bar, they send Tom out to get rid of the last piece of evidence connecting them to the case: the antique shotguns. Meanwhile, Chris arrives to give the friends back the duffel bag. He has taken all the money for himself and his son, and the bag is empty except for a catalogue of antique weapons. After leafing through the catalogue, the friends learn that the shotguns are actually quite valuable, and quickly call Tom. The film ends with Tom's mobile phone, situated in his mouth, ringing as he hangs over the side of a bridge, preparing to drop the shotguns into the River Thames, ending on a cliffhanger."}