{"mid": "Logan", "IMDB_id": "tt3315342", "title": "Logan", "plot": "The film is preceded by a short film:On the streets of New York City, a mugging is taking place. Walking upon the scene is none other than Wade Wilson/Deadpool (Ryan Reynolds). He hops inside a phone booth and starts changing into his costume while the mugger and victim are fighting. Wade takes too long to change, and the victim is shot dead. He steps out of the phone booth and realizes he should have just called 911. He then lays down on the dead man's body and helps himself to some ice cream.The film opens with Logan (Hugh Jackman) (aka: The Wolverine, formerly born as James Howlett) waking up in the back of a limo. He groggily stumbles out and finds a gang trying to vandalize the car. Logan calmly attempts to intervene, but one of the men blasts him with a shotgun. Logan gets back up and breaks the claws out, but one claw doesn't retract all the way. He fights the gang but they start beating him down. Logan becomes enraged and starts slicing off limbs and stabbing the gang members until a few of them get away.The year is 2029. It is El Paso Texas. Being over 170-years-old (but looking no older than 50), Logan is no longer the same fighter he once was. The adamantium in his body is slowly killing him, and his regeneration power isn't working as well as it used to. He is one of the last mutants left alive, and he must make a living as a limo driver. He also carries an adamantium bullet with him in case he ever decides to end it all.Logan is at a funeral with one of his clients. He is approached by a woman named Gabriela Lopez (Elizabeth Rodriguez). She asks for Logan's help but he rudely turns her away. Gabriela drives away, and a young girl looks back at Logan.A man enters Logan's limo one morning. His name is Donald Pierce (Boyd Holbrook). He knows about the killing of the gang members, as well as Logan being approached by Gabriela. Pierce also has knowledge of Logan taking care of Charles Xavier (Patrick Stewart) south of the border. Pierce claims he only wants something of his that Gabriela has. He hands Logan a card and tells him to call him when he finds Gabriela again. The card reads \"Alkali Transigen\", which angers Logan.Logan heads south of the border to an abandoned plant where he and the clairvoyant mutant Caliban (Stephen Merchant) are taking care of Charles. He is senile and suffers from seizures that produce seismic waves as a result of his brain degenerating. Logan must administer a serum to keep Xavier under control. Xavier has become broken since the loss of his school and fellow X-Men, saying that Logan is just waiting for him to die.Logan is out working and gets a notification for two passengers. He goes a motel to pick them up and finds it is Gabriela with the little girl, Laura (Dafne Keen), whom Gabriela says is her daughter. Gabriela implores Logan to help them, but he is uninterested in getting involved in their business. Gabriela offers him $50,000 to help them get across the border from North Dakota to Canada. She gives him an envelope with $20,000 inside and coordinates written on it.Logan receives a text back home from Gabriela. He returns to the motel and finds that Gabriela has been killed, and Laura is nowhere to be found.Upon returning home, Logan sees that Laura has found them. Charles is fascinated by her since he knows she possesses something remarkable. Logan knows they are in danger. Pierce comes by to get Laura. She chucks a pipe at his head and knocks him out. Logan has Caliban take Pierce and dump him in a ditch. When Caliban goes to do so, Pierce wakes up and his team of Reavers show up and capture him. The Reavers then go toward Logan and Charles's location. Two Reavers enter to get Laura. After some commotion, Laura steps out with a Reaver's head and rolls it toward Pierce. Laura then steps forward and has two adamantium claws come out of each hand. She starts slaughtering Reavers left and right, and she even uses a foot claw on an attacker. Logan gets in on the fight and takes Charles and Laura away from there.Caliban is taken by the Reavers and tortured when Pierce exposes him to sunlight (his skin is very sensitive to the light). Pierce orders Caliban to use his tracking powers to locate the trio.Logan, Charles, and Laura stop by a convenience store and look through Gabriela's phone to see a video she took about Transigen's experiments. Led by Dr. Zander Rice (Richard E. Grant) in Mexico, the team was creating mutant children from the DNA of deceased mutants and breeding them to become super soldiers. It turns out Gabriela was Laura's nurse, not mother. The phone dies before Logan can see anymore.In the store, Laura gets some chips, a drink, and sunglasses. The clerk (Dave Davis) attempts to stop Laura from shoplifting, only for her to flip him over and nearly stick her claws in him until Logan steps in. He takes a phone charger and a cigar before heading out.When the phone recharges, Logan watches the rest of the video. Gabriela documented that Rice and his team were creating X-24, a mutant more powerful and unfeeling than the others they created. When the team wanted to eliminate the children, Gabriela helped them escape so they can make it to a mutant sanctuary called Eden. In the video's final moments, Gabriela admits she's not Laura's mother, but she loves her all the same, and she addresses Logan, saying she is his daughter and begging him to take care of her.The trio pass through Oklahoma City and stay in a hotel. Logan discovers that Laura has been reading \"X-Men\" comics and has gotten it in her mind that Eden is real, based on a page in which the coordinates to Eden are the same ones written on the envelope Gabriela gave him. Logan leaves Laura with Charles and tells her to give him two pills. Downstairs, Logan sees that the Reavers have found them. Charles then has another seizure, leading to everyone but Logan and Laura to be stuck in a paralyzed state. Logan struggles to make it to the room and must literally claw his way through the Reavers that have already made it into the room. He stabs them all before injecting Charles with the serum. They escape with Laura.The trio hit the road again. A radio report mentions the incident at the hotel, along with something that happened in Westchester a year ago, but Logan turns it off before Charles can hear anymore. They are nearly run off the road by two trucks that take up the road. Another truck is swerved off to the side, along with the cart of horses they were carrying. The horses start running across the street, so Charles convinces Logan to help them. Charles uses his powers to bring the horses back to the family safely. Logan helps the family push their truck out of the ditch. They introduce themselves as the Munsons - Will (Eriq La Salle), Kathryn (Elise Neal), and Nate (Quincy Fouse). Kathryn invites the trio to have dinner in their home that night, and Charles accepts on behalf of Logan.The trio have dinner with the Munsons. Logan wants to leave immediately, but Kathryn offers them shelter for the night. Logan only agrees for Charles's sake. The water pump is messed up, so Logan joins Will in going to fix it. After they stop the pump from leaking out in the field, they are confronted by a group of hicks that have some control of that part of the land. They try to harass Logan and Will with their rifles until Logan hits one of them in the face with the rifle and breaks it over his knee.Back at the house, someone appearing to be Logan tells Charles they should go, but Charles feels Laura should sleep more. Charles then remembers what happened a year ago in Westchester. It's implied that he suffered a seizure that killed most of his fellow X-Men. Logan then puts his claws through Charles's chest. It turns out this is not Logan, but X-24, a younger clone of Logan. X-24 takes Laura and then kills Nate and Kathryn before Logan and Will get back home. Will runs upstairs but X-24 claws him. Logan runs to get Charles.Outside, the Reavers have arrived with Pierce and Rice, along with the hicks that antagonized Will. They bring a larger group with them to retaliate, but X-24 kills all of them. Meanwhile, Logan sets Charles down as he dies. As X-24 tries to bring Laura to his masters, Caliban, still captive in the Reaver van, sets off two grenades, killing himself and another Reaver, while Pierce is thrown out of the van. Logan fights X-24 and is nearly overpowered until Will rams into X-24 with his van. He shoots him repeatedly and then tries to turn the gun on Logan, but the gun is out of bullets, and Will collapses dead. Logan takes Laura and Charles's body, and they get out of there.In the morning, Rice and his crew take care of the crime scene while helping X-24 regenerate.Logan buries Charles in the woods with Laura standing by his side. He goes over to the truck and starts smashing it in fury before he passes out.Logan wakes up in a clinic. The doctor knows he's a mutant and wants to help him, knowing that the adamantium is killing him. Logan stubbornly refuses his help, and he takes Laura out of there. They go to a new truck that Laura stole. Logan thanks Laura for her help, and she finally speaks by responding in Spanish. Laura then mentions her friends from Transigen and that they must find them so they can all go to Eden.The two make it to Eden, where all the children from Transigen are hiding. Their leader is Rictor (Jason Genao). They give Logan and Laura shelter so that Logan can rest up. The kids prank Logan by trimming his beard while he sleeps. He is not amused. Rictor gives Logan a serum that was used on them at Transigen which can help Logan re-energize.The Reavers track Logan and the children's location. Pierce and his goons start to round up the children. Logan takes all of the serum and runs into the woods to fight. Some of the children use their powers against the Reavers, but the children are outnumbered. Logan and Laura slaughter the Reavers until Rictor and the other kids are held at gunpoint. Rice steps out and introduces himself to Logan and reminds him that he killed Rice's father when he first performed the experiment that turned Logan into Wolverine. As Rice talks, Logan just shoots him dead and then goes after Pierce. Pierce unleashes X-24 on Logan. He tries to escape, but the children use their collective powers (freezing, electrocuting, earth-bending, etc.) to kill Pierce.The serum in Logan's body wears off before he fights X-24. The two claw at each other until X-24 impales Logan on a tree. Laura takes the adamantium bullet Logan gave her and she uses it to blow X-24's head off. She runs to Logan and cuts him down from the tree. Logan looks into Laura's eyes as she tearfully calls him \"Daddy\". And then, he is gone.The children bury Logan, and Laura says some final words for him. They then head off to cross the border. Before she leaves, Laura takes the cross on Logan's grave and turns it sideways so that it can look like an X."}