{"mid": "Lolita", "IMDB_id": "tt0119558", "title": "Lolita", "plot": "Set in the 1950s, the film begins in medias res near the end of the story, with a confrontation between two men: one of them, Clare Quilty, drunk and incoherent, plays Chopin's Polonaise in A major, Op. 40, No. 1 on the piano before being shot from behind a portrait painting of a young woman. The shooter is Humbert Humbert, a 40-something British professor of French literature.\nThe film then flashes back to events four years earlier. Humbert arrives in Ramsdale, New Hampshire, intending to spend the summer before his professorship begins at Beardsley College, Ohio. He searches for a room to rent, and Charlotte Haze, a cloying, sexually frustrated widow, invites him to stay at her house. He declines until seeing her daughter, Dolores, affectionately called \"Lolita\". Lolita is a soda-pop drinking, gum-snapping, overtly flirtatious teenager, with whom Humbert becomes infatuated.\nTo be close to Lolita, Humbert accepts Charlotte's offer and becomes a lodger in the Haze household. But Charlotte wants all of \"Hum's\" time for herself and soon announces she will be sending Lolita to an all-girl sleepaway camp for the summer. After the Hazes depart for camp, the maid gives Humbert a letter from Charlotte, confessing her love for him and demanding he vacate at once unless he feels the same way. The letter says that if Humbert is still in the house when she returns, Charlotte will know her love is requited, and he must marry her. Though he roars with laughter while reading the sadly heartfelt yet characteristically overblown letter, Humbert marries Charlotte.\nThings turn sour for the couple in the absence of the nymphet: glum Humbert becomes more withdrawn, and brassy Charlotte more whiny. Charlotte discovers Humbert's diary entries detailing his passion for Lolita and characterizing her as \"the Haze woman, the cow, the obnoxious mama, the brainless baba\". She has an hysterical outburst, runs outside, and is hit by a car, dying on impact.\nHumbert drives to Camp Climax to pick up Lolita, who doesn't yet know her mother is dead. They stay the night in a hotel that is handling an overflow influx of police officers attending a convention. One of the guests, a pushy, abrasive stranger, insinuates himself upon Humbert and keeps steering the conversation to his \"beautiful little daughter,\" who is asleep upstairs. The stranger implies that he too is a policeman and repeats, too often, that he thinks Humbert is \"normal.\" Humbert escapes the man's advances, and, the next morning, Humbert and Lolita enter into a sexual relationship. The two commence an odyssey across the United States, traveling from hotel to motel. In public, they act as father and daughter. After several days, Humbert tells Lolita that her mother is not sick in a hospital, as he had previously told her, but dead. Grief-stricken, she stays with Humbert.\nIn the fall, Humbert reports to his position at Beardsley College, and enrolls Lolita in high school there. Before long, people begin to wonder about the relationship between father and his over-protected daughter. Humbert worries about her involvement with the school play and with male classmates. One night he returns home to find Dr. Zempf, a pushy, abrasive stranger, sitting in his darkened living room. Zempf, speaking with a thick German accent, claims to be from Lolita's school and wants to discuss her knowledge of \"the facts of life.\" He convinces Humbert to allow Lolita to participate in the school play, for which she had been selected to play the leading role.\nWhile attending a performance of the play, Humbert learns that Lolita has been lying about how she was spending her Saturday afternoons when she claimed to be at piano practice. They get into a row and Humbert decides to leave Beardsley College and take Lolita on the road again. Lolita objects at first but then suddenly changes her mind and seems very enthusiastic. Once on the road, Humbert soon realizes they are being followed by a mysterious car that never drops away but never quite catches up. When Lolita becomes sick, he takes her to the hospital. However, when he returns to pick her up, she is gone. The nurse there tells him she left with another man claiming to be her uncle and Humbert, devastated, is left without a single clue as to her disappearance or whereabouts.\nSome years later, Humbert receives a letter from Mrs. Richard T. Schiller, Lolita's married name. She writes that she is now married to a man named Dick, and that she is pregnant and in desperate need of money. Humbert travels to their home and finds that she is now a roundly expectant woman in glasses leading a pleasant, humdrum life. Humbert demands that she tell him who kidnapped her three years earlier. She tells him it was Clare Quilty, the man that was following them, who is a famous playwright and with whom her mother had a fling in Ramsdale days. She states Quilty is also the one who disguised himself as Dr. Zempf, the pushy stranger who kept crossing their path. Lolita herself carried on an affair with him and left with him when he promised her glamour. However, he then demanded she join his depraved lifestyle, including acting in his \"art\" films, which she vehemently refused.\nHumbert begs Lolita to leave her husband and come away with him, but she declines. Humbert gives Lolita $13,000, explaining it as her money from the sale of her mother's house, and leaves to shoot Quilty in his mansion, where the film began. The epilogue explains that Humbert died of coronary thrombosis awaiting trial for Quilty's murder."}