{"mid": "LoneStar", "IMDB_id": "tt0116905", "title": "Lone Star", "plot": "Sheriff Sam Deeds is the county sheriff in Frontera, Texas. He was born and raised in Frontera, and returned two years ago to be sheriff. Sam's late father had been the legendary Sheriff Buddy Deeds, who is remembered as fair and just. Sam had problems with his father and the pair routinely fought.\nSam is particularly disapproving of efforts by business leader Mercedes Cruz and Buddy's former deputy, Mayor Hollis Pogue, to enlarge and rename the local courthouse in Buddy's honor; he considers it an unneeded waste of taxpayers' money. As a teenager, Sam had been in love with Mercedes's daughter Pilar, but the courtship was strongly opposed by Buddy and Mercedes. After a chance meeting, Sam and the widowed Pilar, now a local teacher, slowly resume their relationship.\nColonel Delmore Payne has recently arrived in town as the commander of the local U.S. Army base. Delmore is the son of Otis \"Big O\" Payne, a local nightclub owner and leading figure in the area's African-American community. The two are estranged because of Otis's serial infidelity and abandonment of Delmore's mother when Delmore was a child. Relic hunters discover a human skeleton on an old shooting range along with a Masonic ring, a Rio County sheriff's badge, and a bullet not used by the military. Sam brings in Texas Ranger Ben Wetzel to help with the case. Wetzel tells Sam that forensics identify the skeleton as that of Charlie Wade, the corrupt sheriff who preceded Buddy. Wade had mysteriously disappeared in 1957, taking $10,000 in county funds, after which Buddy became sheriff.\nSam investigates the events leading up to Wade's murder. He learns that Wade terrorized the local African-American and Mexican communities, including numerous murders where he asks his innocent victims to dig out any weapon they might have, to then justify shooting them for \"resisting arrest\". Wade used this method to murder Cruz's husband, Eladio, in front of Deputy Hollis. Sam visits Wesley Birdsong, a Native American and a roadside tourist stand owner, who reveals that Buddy was a wild young adult who settled down after becoming a deputy sheriff and marrying Sam's mother – though he did have a mistress, whose name Wesley claims to have forgotten. Sam travels to San Antonio, where he visits his marginally mentally ill ex-wife Bunny and searches through his father's things, where he discovers love letters to Buddy's mistress.\nSam confronts Hollis and Otis about Wade's murder. Wade extorted money from a young Otis for running an illegal gambling operation in the bar, then was about to use his \"resisting arrest\" setup to kill Otis. Buddy arrived just as Hollis shot Wade to prevent Otis's murder. The three buried the body and took the $10,000 from the county and gave it to Mercedes – who was destitute after Eladio's recent death – to buy her restaurant. Hollis reveals that Buddy and Mercedes did not take up until some time later. Sam decides to drop the issue, saying it will remain an unsolved mystery. Hollis voices concern that, when the skeleton is revealed to be Wade, people will assume Buddy killed him to take his job, to which Sam states that Buddy's legend can handle it.\nSam learns that Hollis and Mercedes have recruited his own deputy to run against him in the next election. He decides to not run for re-election.\nSam tells Pilar that Eladio died 18 months, rather than \"a few weeks\", before she was born. Sam shows Pilar an old photo of Buddy and Mercedes, revealing that Buddy is her father. Both are hurt over the deception but decide that, since she cannot have any more children, they will continue their romantic relationship, despite the knowledge that they are half-siblings."}