{"mid": "LoneWolfMcquade", "IMDB_id": "tt0085862", "title": "Lone Wolf McQuade", "plot": "The main character, J.J. McQuade (Norris), is a former Marine and a Texas Ranger who prefers to work alone. He lives in an old, run-down house in the middle of nowhere with a pet wolf.\nThe film opens with McQuade involved in an intense battle with Mexican bandits and a gang of horse thieves from which he emerges unscathed (saving several Texas State Troopers). Shaking off the dust, McQuade returns to El Paso, Texas to attend the retirement ceremony of his fellow Ranger and close friend Dakota (Jones). After the party, his commander attempts to curb his \"lone wolf\" attitude by insisting he work with local Texas State Trooper Kayo Ramos (Beltran), a tough but clean-cut and polite Latino.\nAlthough divorced, McQuade is on very good terms with his ex-wife, and loves his teenage daughter Sally. McQuade also seems to like Sally's boyfriend Bobby, who is enlisted in the US Army and is respectful of McQuade being a retired Marine.\nWhile out horseback riding with his daughter, his daughter's horse runs wild and she is saved by Lola Richardson (Carrera). She invites them to a party where Rawley Wilkes (Carradine) displays his prowess in martial arts and some of his thugs get into a fight with Ramos. After settling the fight, Richardson and McQuade leave the party and apparently have a romantic encounter. She shows up at his house and cleans it. Despite McQuade's annoyance that he does not need a woman to take care of him, Richardson seems to start breaking through his rough exterior within the couple of days they are together.\nMeanwhile, Sally and Bobby witness the hijacking of a U.S. Army convoy. Bobby is shot and killed by the hijackers, who then cause Sally to be hospitalized when they shove her car into a ravine. McQuade more readily works with Kayo to find out who did this to his daughter and her boyfriend. Kayo's computer skills allow him to track the errant convoy. At an illegal garment factory, they pick up a young delinquent named Snow (William Sanderson), who is reluctant to talk until Dakota points a Mac-10 in his general direction and empties the magazine.\nIn retaliation for disrupting his operations, Wilkes asphyxiates Dakota in his house and also has Snow killed. Dakota's murder attracts the attention of FBI Special Agent Jackson (Kennedy) who works with Ramos and McQuade. The trail leads them to Wilkes, revealed as an arms merchant who is hijacking U.S. arms shipments for his illicit weapons deals.\nThe three eventually find the arms trading headquarters in the desert. Agents Burnside and Núñez are killed when they attack the headquarters. McQuade and Ramos had tried to stop them, but ended up in the gunfight as well. McQuade is caught and sadistically beaten by Wilkes, who then orders that McQuade be placed in his truck and buried under a truckload of dirt, ignoring Richardson's pleas for mercy for the three men. Using his homemade supercharger system, McQuade charges his truck through the dirt - miraculously breaking himself free - and then rescues Ramos and Jackson. All three men are weakened due to being shot and beaten.\nMcQuade finds that Sally has been taken by Wilkes to Mexico. A rival arms dealer known as Falcon, who has been disguising his illegal business as a pinball machine dealer supplies McQuade with this intelligence, claiming Wilkes has double-crossed him and he would like his competition eliminated. Falcon gives McQuade the exact location in Mexico where Wilkes and his daughter are.\nThough McQuade is intent and tries to head to the location on his own, both Ramos and Jackson have followed him and the three head into the base for the attack. After an intense battle, with Jackson being shot again, and Sally and Richardson escaping, Sally is shot in the leg and both women are sidelined.\nFinally McQuade and Wilkes engage a hand-to-hand fight with the fight leaning in Wilkes' favor, until he strikes Sally (who ran to her father's aide), provoking McQuade into a frenzy of hits and kicks that defeats Wilkes. McQuade is reunited with his daughter, only to be fired upon by an injured Wilkes. Richardson steps into the line of fire to save McQuade and is fatally wounded. Her dying words to McQuade are that Wilkes killed her husband, forced her to be his arm candy, and that she loved McQuade.\nMeanwhile, Wilkes and his remaining thug run into a building. Jackson provides McQuade with a grenade, and McQuade throws it into the building, killing Wilkes and the other man. Falcon then arrives in his helicopter. McQuade, Sally, Ramos and Jackson take it, leaving Falcon to deal with the Mexican \"federales\".\nMcQuade's ex-wife and daughter are at a ceremony where McQuade's commander presents him (as well as Ramos and Jackson) with the Texas Award of Valor, and McQuade congratulates his ex-wife for getting an excellent job in New Mexico. The following day, McQuade has rented a U-Haul and is helping Sally and his ex-wife move. As they are getting ready to leave, Ramos shows up telling McQuade he is needed as a gunman has held up a bank. Figuring he has had enough adventure and wanting to spend more time with his family, McQuade politely declines. However, when Ramos also warns that the robber has taken hostages, McQuade is spurred into action. As the squad car speeds off, his ex-wife bellows \"J.J. McQuade, you will never change!\""}