{"mid": "LonesomeGhosts", "IMDB_id": "tt0029161", "title": "Lonesome Ghosts", "plot": "The Ajax Ghost Exterminators - Mickey, Donald and Goofy - are hired by telephone to drive out four ghosts from a haunted house that has long been abandoned. Unbeknownst to them, they were hired by the ghosts themselves, who are bored because nobody has visited the house they had long been haunting for a long time (either because none of the locals were scared or they had scared them all away, as one ghost puts it: \"Guess we're too good!\"). They wish to play tricks on the living, and do so through a series of inventive, annoying pranks. The exterminators arrive and knock on the front door, which falls down. When they announce themselves, but there is nobody to receive them. Mickey decides they should get to work anyway. When entering, the door lifts up and throws them inside before putting itself back in place. After hearing the ghost's laughter, the three split up to hunt the ghosts individually. The exterminators are toyed with at every turn; The ghost knocks Mickey on the head and puts his fingers in his gun and it explodes. Mickey is driven upstairs and tries to open a door, which falls down and the ghosts (forming a marching band) come out of the fallen door and go into another. Mickey opens the door which causes a splash of water. Donald, meanwhile, is whacked with a wooden board and is scared away by the sounds of banging chains and dishes. Goofy, in a bedroom, becomes tangled in a dresser and stabs his own rear with a pin, mistaking his blue pants for a ghost and is shoved down into the basement. In the end, the three exterminators accidentally become covered in molasses and flour, making them look like ghosts and consequently scaring the actual ghosts out of the house in a panic. The ghost hunters stand victorious, having driven the spirits out of the house, although not exactly certain how. Donald smugly assumes the ghosts fled in capitulation to their superior tactics.\nGoofy says, while warily looking around him: \"I'm brave! But I'm careful.\" Donald observes, \"So you can't take it, you big sissies!\", and Goofy quips, \"I ain't scared of no ghosts!\" (weakly boasting while hiding from a ghost-engineered scare)."}