{"mid": "LookWhosTalking", "IMDB_id": "tt0097778", "title": "Look Who's Talking", "plot": "Mollie is an accountant living in New York City who has an affair with Albert, a womanizing executive who is married with two children, and becomes pregnant. During her pregnancy, Mollie and Albert keep their indiscretion secret, under the idea she was artificially inseminated, and that Albert plans to leave his wife Beth and their two children to be with her. Mollie and her friend Rona happen to catch Albert fooling around with his interior decorator Melissa and he admits he is planning on living with her after his divorce is finalized. Mollie leaves upset, and immediately goes into labor. She gets into a cab where the driver, James Ubriacco, recklessly speeds through downtown traffic in order to get her to the hospital on time, and he is inadvertently a witness to her son Mikey's birth. Mikey then begins to make commentary on his life and interacts with things through an inner voice which can also communicate with other babies.\nHoping to get her life back on track, Mollie becomes a dedicated single mother; refusing to be superficial about hopeful fathers, but rejecting several men over small quirks that may reflect badly upon Mikey in the future. She meets James again at her apartment building and discovers he used her mailing address to set up residency in order to get his grandfather Vincent into a nice care home. She agrees to continue the ruse when he agrees to babysit Mikey, which almost comes to a halt when he takes the baby out to the airport, where he is a part-time commercial pilot while she is taking a nap (leading her to believe he'd kidnapped Mikey). A year passes, and James, realizing his feelings for Mollie cause him to start sabotaging one of her dates, she soon realizes the bond he and Mikey share and decides to give him a chance. After a visit to James' grandfather at his new home, James takes her for flying lessons and she realizes she's falling for him, but when they become intimate, she imagines their life together and resists. James tells Mollie that he loves her, but she says she only wants what is best for Mikey and kicks him out. Back at work, Mollie is forced by her boss to continue to work with Albert, who insists upon seeing Mikey and she agrees. But when Albert visits, he meets James and the two get into an argument, the secret upsetting James he asks Mollie if she loves Albert and she claims she does not know. When he suggests the idea of being the closest thing to a father Mikey has, Mollie tells him that he's like a big kid and is not responsible enough to be a father. James calls her out for using Mikey to push men away including himself and he storms out. At the playground, Mikey is told by his friends what \"daddies\" are, and he realizes he wants James to be his daddy. James comes to the apartment and tells Mikey that he won't be around any more, and Mollie listens over the baby monitor as he pours his heart out to Mikey who admits he will miss James too.\nMollie takes Mikey to Albert's office to meet him, but when Albert claims he doesn't want the responsibility of being a father, Mollie realizes he hasn't changed and she and Mikey ruin several pieces of his furniture before storming out and putting Albert out of their lives for good. Back at home, she receives a call from Vincent's home telling her that he's a disruptive influence and abusive to the staff, and she rushes over to clear up the error, managing to convince them to keep Vincent as he was given a chocolate stash that James had earlier instructed an orderly (who didn't speak English) not to let him have more than one a day or it would cause these outbursts. James arrives and he and Mollie make up. Meanwhile, Mikey wanders off on his own, searching for James when he sees a taxi cab outside. After making his way out to the alley he gets into a car and is towed away while Mollie and James search frantically for him. After spotting him, James and Mollie give chase in his cab and eventually cut off the tow truck, but discover Mikey had gotten out of the car and is now standing in the middle of heavy traffic. James and Mollie run to reach him and take him to safety, where Mikey unofficially asks James to be his father by saying his first word \"Da-da\". James and Mollie realize that Mikey already sees James as his father, and they decide to give it a chance, kissing passionately while Mikey considers telling him he needs a new diaper, before deciding to wait.\nNine months later, Mollie gives birth to her and James' daughter Julie. When Mikey greets his half-sister she \"tells\" him she had a day he wouldn't believe."}