{"mid": "LoveLetters", "IMDB_id": "tt1548296", "title": "Love Letters", "plot": "Alan Quinton (Joseph Cotten), an American soldier in Italy during World War II, has been writing letters for his friend, Roger Morland (Robert Sully), a man who admits he \"never had any standards, manners or taste.\" Alan has never met Victoria Remington, but regards her as a \"pin-up girl of the spirit,\" to whom he can express feelings he has never expressed in person. He realizes that Victoria has fallen in love with the letters and is concerned that she will be disappointed by the real Roger. However, Roger abruptly leaves for paratrooper training in England.\nAlan is subsequently injured on the Italian front and finds out that Roger is dead. He is having trouble readjusting to civilian life and spending time with his fiancée, Helen Wentworth (Anita Louise). He decides to live for a while at his aunt's farm in Essex. In London, his brother takes him to a party at which he meets Dilly Carson (Ann Richards) and Singleton (Jennifer Jones). He drunkenly tells them the story about falling in love with a woman he's never met, and Dilly realizes he is referring to Roger and Victoria. She tells Alan that a murder was committed and the letters were somehow involved.\nAlan and his fiancée realize they aren't in love and part amicably before he moves to the farm. While in Essex, Alan visits Longreach — the road to which he addressed all the letters — and finds out that Victoria died over a year ago. He also learns that Roger was murdered by his wife, and Alan feels guilty for ever writing those letters. Back in London, Dilly informs him that Singleton is suffering from amnesia and is actually the real Victoria. She begs him not to tell Singleton that he was the one who wrote the letters because Victoria fell in love with Roger through the letters and married him solely based on them.\nDilly recounts that one day, she found Roger stabbed to death in the country house on Longreach, but Victoria was completely unable to remember what happened, even though she was holding the murder weapon right beside him. After a trial during which she cannot remember anything, she is sent to a prison psychiatric hospital for a year and then released into the care of Dilly. Victoria never regained her memory, and continues to now live as Singleton. Singleton realizes that Alan is in love with Victoria, but does not realize Victoria is actually herself. Regardless, Alan and Singleton marry after he gets permission from her adopted mother, Beatrice Remington (Gladys Cooper). However, their marriage is constantly scarred by Alan's love of the \"other woman.\"\nBeatrice returns to the farm and while conversing with Singleton, Singleton begins to remember the events of that fateful night: As Roger begins to drink, Victoria rereads the letters to remind herself of the man she loves and not the bitter man she sees in front of her. Roger confesses that he is not the one who wrote the letters, and he becomes abusive. Beatrice takes a knife and is the one to stab him to death as Victoria attempts to save the letters he had thrown into the fireplace.\nAs Alan arrives at the house, Victoria recalls her true identity and they fall into each other's arms."}