{"mid": "LoveAndMercy", "IMDB_id": "tt0903657", "title": "Love & Mercy", "plot": "The movie takes place in two different times. The 1960s and late 1980s and it goes back and forth.In the 1960s, there are scenes of the Beach Boys in the studio recording their music. At a party, Brian (Paul Dano) tells his brothers that he doesn't want to go on tour with them this time, but wants to stay home writing music. They agree to let him do this. He assures them that it will be great. He plays part of God Only Knows for his father who is their former manager before he was fired. Brian wants him to tell him the truth, and his father just tells him the song isn't good.In the studio Brian works with the musicians on Wouldn't It Be Nice and God Only Knows. They all agree that he is a musical genius.When the other band members return home and begin recording, his cousin Mike Love (Jake Abel) is the one to stand up and say that the music isn't good - it's mostly the other musicians playing instruments and they hardly do anything at all. He's not happy with Brian.They have more strife as time goes on. Brian and the other band members aside from Mike are heavily into drugs and LSD. Brian begins hearing voices. Eventually his music and lyrics don't even make sense.During one session, after they all got high, he goes to piano and plays some chords for Mike which becomes Good Vibrations. At a dinner party with his wife and friends, they are celebrating the success of the song when he has an episode. All the sounds of utensils and in his head put him over the edge. His brothers are worried about him as he lays almost comatose in a chair on their balcony.One day in the studio Brian's father comes and tells him that he sold all the music rights for $750,000.Towards the end, we see that Brian has a complete breakdown and stays in bed for three years (which he tells Melinda later).\n-----------------------In the 1980s, Brian (John Cusack) goes to a Cadillac dealership and meets Melinda Ledbetter (Elizabeth Banks), a car saleswoman. He acts very strange tells her he wants the car right from the show room. She doesn't know who he is but then his doctor and guardian Dr. Eugene \"Gene\" Landy (Paul Giamatti) shows up and tells her. Brian leaves her a note that says \"Lonely. Scared. Frightened.\"Brian calls Melinda and asks her out on a date. When he picks her up he is accompanied by Gene, his bodyguard, and their entourage. They are there whenever they go out together. One night at dinner Brian tells Melinda about how his father used to beat him and it caused him to be 99% deaf in one ear. Another time they go to his house in Malibu on the beach. He plays her a tune he just wrote for her in that moment. They seem like they are about to kiss when they are interrupted by Gene telling him he has to take his pills. They go outside to eat hamburgers and Brian, who is highly medicated, keeps saying how hungry he is. Gene yells at him and tells him that Melinda must eat first. She takes one bite and Brian takes the rest, which she laughs at. Gene begins screaming at him must to her dismay.She goes to visit Gene who tells her Brian is a paranoid schizophrenic and he has to take care of him. Gene is out of control, but there's not much she can do. On another date they go on his boat without Gene, but his son is driving the boat. For some privacy they jump off into the water and swim to shore. They make love and after a few hours Brian freaks out saying she has to leave the house, but not his life, because of Gene coming over.Melinda goes to see him one day and he is completely out of it, drugged out of his mind sitting on a piano bench. Gloria, the housekeeper, pulls her aside and shows her a gigantic jar of pills that she stole because Gene gives him way too much. Everyone is afraid of him though. Gene comes out and tells Melinda that she cannot see him anymore.One of the people who travels with Gene and Brian goes to see Melinda. He tells her that Brian wants to see her, away from Gene. He takes her to the studio where Brian is waiting. She tells him that he can walk out of there (Gene is trying to get him to record an album) and away from Gene. They look ready to do it, when Gene shows up. Brian decides he cannot do it and she leaves.Melinda meets with Gloria and tells her that she loves Brian very much, but can't be selfish and want to be with him. However she cannot leave him in that house with Gene. She tells Gloria she needs something on Gene so they can get him away from him. Gloria finds the power of attorney paperwork which has been manipulated by him. Melinda calls Brian's mother and talks to his brother Carl telling them how Brian needs them (he hasn't talked to them in 3 years or his daughters in 2 years as per Gene's orders).Gene shows up at the car dealership to verbally attack Melinda and is served with court papers. He then does verbally attack her through her office door, but leaves when she opens it.Time goes by and while driving one day Melinda almost hits Brian as he walks against the light in the street. They talk and he convinces her to drive him to see his childhood home. When they get there however we see it has been turned into a highway which he didn't know. He tells her that Gene is gone and he wants to be with her.We find out that Gene had his license revoked and Brian had been wrongfully diagnosed and was now getting proper treatment. Brian and Melinda married in 1995 and have five children."}