{"mid": "LoversLane", "IMDB_id": "tt0187251", "title": "Lovers Lane", "plot": "Thirteen years ago, on Valentine's Day at the local lovers lane, Dee-Dee (Diedre Kilgore) and Jimmy (Carter Roy) are making out in their car when a maniac wielding a steel hook attacks them. The pair escape the car and find another couple, Harriet and Ward, slaughtered in the car next to theirs. Soon after, psychiatrist Jack Grefe (Richard Sanders) arrives, along with Sheriff Tom Anderson (Matt Riedy), who is distraught to find his wife, Harriet, is one of the lovers who has been murdered. The killer, Ray Hennessey (Ed Bailey) is caught, and revealed to be one of Jack's patients who had an obsession with Harriet. Ray is incarcerated in a nearby state institution for the criminally insane and gains the nickname 'The Hook'.\nPresent day, Jack's popular daughter Chloe (Sarah Lancaster) and Tom's socially awkward daughter Mandy (Erin J. Dean) attend the local high school together. During a class, Chloe hears her boyfriend Michael (Riley Smith) is planning to break up with her. In a fit of anger Chloe attempts to drown Michael in the pool. Jack is quickly called into the school about his daughters actions where he meets with Principal Penny Lamson (Suzanne Bouchard). Chloe is suspended from the school, while Michael is grounded by his mother, Principal Penny. Soon after, 'The Hook', retrieves his weapon and escapes the mental institution. Upon hearing this news, Sheriff Tom warns Penny, as her husband had been having the affair with Harriet and had been murdered along with her.\nLater that night, Michael sneaks out of his room to meet his friends, including Chloe, Mandy, Bradley (Ben Indra), cheerleader Janelle (Anna Faris), joker Doug (Billy O'Sullivan) and couple Cathy (Megan Hunt) and Tim (Collin F. Peacock) at the bowling alley. Also there is Deputy David Schwick (Michael Shapiro), whom Sheriff Tom has put in charge of keeping Chloe and Mandy safe. After a while, Chloe, in an attempt to make Michael jealous, leaves with Bradley to go to lovers lane. As the pair travel in their car, Chloe enters a store, not realising the owner is swiftly murdered as she departs. Deputy David also enters the shop, only to be stabbed to death. Meanwhile, Penny discovers Michael is missing and alerts Sheriff Tom.\nAfter some time, Mandy, Michael, Janelle, Doug, Cathy and Tim arrive at lovers lane. The group find Bradley's car, only to discover he and Chloe have been murdered, before the hook arrives and stabs Tim to death. As the others try to escape in their car, Doug crashes into a tree, knocking everyone unconscious. Some time later, Mandy and Michael wake up to find the others gone. They travel to a nearby farmhouse where they arm themselves with a gun and find Janelle and Doug, who has broken his leg. While Janelle tends to Doug's injury, Mandy and Michael go to the barn to retrieve the missing owners car. Back inside, Janelle begins to hear noises before the hook smashes through a window. Janelle runs upstairs and barricades herself in a room, but the hook gets in and stabs her to death. The hook also then kills Doug.\nIn the barn, Michael and Mandy manage to get the car started, however as Michael begins to drive he accidentally runs over Cathy, killing her. The pair re-enter the house and find Doug and Janelle dead before the hook attacks them. They lock themselves in the kitchen, and turn the gas on, before escaping out a window. As the hook opens the door, a match is sparked and the house blows up. Meanwhile, Sheriff Tom and Penny go to Jack's house where they find a shrine devoted to Mandy, before rushing to lovers lane. At the farmhouse, Michael and Mandy take the owners car and begin to travel into town. On the way, they find Chloe to still be alive, who urges them to return to lovers lane as Bradley has also survived. Upon arrival, Mandy leaves Michael and Chloe in the car, only to find Bradley is in fact dead, before she is dragged away into a bush. In the car, Chloe attacks Michael with a hook, revealing herself to be a killer. Michael escapes, but as Chloe exits she is slaughtered by an unseen figure.\nMandy is forced into a car by her attacker, revealed to be Jack who tells her he was the one that had killed Mandy's mother, Harriet, and had survived the explosion at the farmhouse. Michael saves Mandy, and as a fight breaks out, Tom and Penny arrive and shoot Jack before Mandy eventually kills him with a hook.\nThe next day at lovers lane, Mandy and Michael are medically checked, before they leave Tom and Penny and enter a police car, that is revealed to be driven by Ray, 'the hook'."}