{"mid": "Lucas", "IMDB_id": "tt0091445", "title": "Lucas", "plot": "Lucas Bly is an intelligent and nerdy 14-year-old high school student. He becomes acquainted with Maggie, an attractive older girl who had just moved to town. After meeting Lucas on one of his entomological quests, Maggie befriends him, spending time with him during the remainder of the summer until school begins.\nLucas, who finds himself a frequent victim of bullying and teasing, has a protector of sorts, Cappie Roew, an older student and football player. Cappie was once one of Lucas' tormentors, until Cappie contracted hepatitis and Lucas, for reasons no one ever knew, brought him his homework every day, ensuring that Cappie didn't fail and have to repeat a year of school.\nEven though Lucas deems it beneath her, Maggie becomes a cheerleader for the football team in order to get closer to Cappie, on whom she has a growing crush. Angered and offended by Maggie continuing to ignore him, Lucas begins to irritate Maggie, continuing to castigate her cheerleading as \"superficial\" and making the incorrect assumption that she will be his date to an upcoming school dance. Maggie complains to Lucas that she's interested in things besides just hanging out with him.\nOn the night of the dance, Cappie is dumped by his girlfriend Alise, who has noticed his attraction to Maggie. A depressed Cappie finds comfort with Maggie at her house—much to the chagrin of Lucas, who has arrived, in tuxedo, to pick her up for the dance. Even though Cappie and Maggie invite him out for pizza, he rebukes them and rides off on his bike. Rina, Lucas' best female friend, encounters him as he sits alone, watching the dance. Even though she has feelings for him, Rina consoles Lucas as he frets about him and Maggie being \"from two different worlds\". Meanwhile, Cappie and Maggie are out for pizza alone. Lucas happens to be riding by and witnesses their first kiss.\nIn a last-ditch attempt to impress Maggie and gain the respect he so desperately craves, the diminutive Lucas joins the football team. In the shower after practice, Lucas endures perhaps another prank from his constant tormentors Bruno and Spike. At the end of the day, Lucas flees in embarrassment to his favorite hiding place and Maggie chases him to talk with him. After she tells him with kindness that she wants him to be her friend, Lucas tries to kiss her. Maggie backs away, and a heartbroken Lucas screams at her to leave.\nThe next day, Lucas removes his helmet during his first football game and is severely injured, requiring hospitalization. Maggie, Cappie, and Rina attempt to contact Lucas' parents, though Maggie discovers that she does not know Lucas as well as she thought she did. Correcting Maggie's misguided impression that Lucas lives in the large luxurious house where she has seen him several times, Rina shows them that Lucas lives in a dilapidated trailer with his alcoholic father and works as a gardener at the large house.\nMeanwhile, Lucas' schoolmates hold a vigil in the hospital for him as he recuperates. Maggie visits Lucas' room that evening and sternly tells him never to play football again. Lucas promises, and the two reconcile, picking up their friendship where they left off. They speculate as to where they will be when the locusts return seventeen years later; both express the hope that they will still be friends when the locusts return again.\nLucas returns to school a short time later, with schoolmates all casting surprised looks at him as he walks through the hall. Upon reaching his locker, he finds Bruno and Spike there waiting for him, but he tries to ignore them as he opens his locker. Inside is a varsity letter jacket, with Lucas' name and number on the back. As Lucas takes it out in shock, Bruno starts the \"slow clap\", and the entire hallway starts applauding. Maggie, Cappie, and Rina are there, too, leading the applause as Lucas raises his arms triumphantly and smiles."}