{"mid": "Luther", "IMDB_id": "tt0137922", "title": "Luther", "plot": "The film begins during a thunderstorm in 1505, as Luther is returning to his home. For fear of losing his life in the storm, Luther commits his life to God and becomes an Augustinian monk.\nIn the next scene, it is 1507 and Luther is a monk in Erfurt. During his time at the monastery, he is constantly troubled by viewing God as a God of hate and vengeance. Martin is encouraged by Johann von Staupitz, an older monk who is his supervisor and mentor. Staupitz tells Luther to look to Christ instead of himself.\nLater Luther delivers a letter for Staupitz to Rome, where he becomes troubled by the wicked lifestyles of those in the city. He also views the skull believed to be that of John the Baptist and purchases an indulgence. It is during this time that Luther begins to question the veracity of indulgences.\nReturning to Germany, Luther is sent to Wittenberg, where he begins to teach his congregation that God is not a God of hate, but a God of love. Luther begins to emphasize the love of God instead of his judgment.\nJohn Tetzel then comes close to Luther's town, where he scares the people into buying indulgences. (The proceeds will be used to build St. Peter's Basilica in Rome, and to recover the Hohenzollern bribes to the Holy See, advanced by Fugger, for the investiture of Archbishop Albert of Mainz and Magdeburg). In his church, Luther denounces the indulgences, calling them \"just a piece of paper.\" He then posts his 95 theses on the door of the church, calling for an open debate regarding the indulgences. For this act, Luther is called to Augsburg, where he is questioned by church officials.\nAfter his excommunication, Pope Leo X orders Luther to be delivered to Rome, but Prince-elector Frederick the Wise of Saxony protects him by moving him into Wartburg Castle. Frederick and Charles V decide that Luther will be tried at the diet of Worms.\nAfter his trial at Worms, Luther is forced into hiding by Frederick the Wise at the Wartburg, while his former professor, Andreas Karlstadt, encourages the Great Peasants' Revolt against the oppressive nobles. Luther, shocked by the revolts, encourages the princes to put them down. Meanwhile, Luther translates the Bible into German.\nAfter Luther marries Katharina von Bora, a former nun, Charles V summons the evangelical Princes of the Holy Roman Empire to the Diet of Augsburg, so he can force them to outlaw Protestantism and the German Bible. The nobles refuse, and Charles is forced to allow the nobles to read their Augsburg Confession.\nThe film ends with the following words:\nWhat happened at Augsburg pushed open the door of religious freedom. Martin Luther lived for another 16 years, preaching and teaching the Word. He and Katharina von Bora enjoyed a happy marriage and six children. Luther's influence extended into economics, politics, education and music, and his translation of the Bible became a foundation stone of the German language.\nToday over 540 million people worship in churches inspired by his Reformation."}