{"mid": "MacAndMe", "IMDB_id": "tt0095560", "title": "Mac and Me", "plot": "A NASA spacecraft has landed on an unknown planet and begins to take rock and soil samples. Four aliens discover it and are sucked up through its vacuum, after which it makes its way back to Earth. The aliens are able to escape from a military base by using their powers (with which they can destroy or heal anything they touch). During the escape, the youngest one hides in a passing van, occupied by a wheelchair-bound boy named Eric Cruise, his older brother, Michael, and their single mother, Janet, who are moving to California from Illinois.\nShortly after the Cruise family arrives at their new home, Eric becomes suspicious of the alien's presence. The next morning, he finds that the creature ends up ruining much of the house and learns its identity, but is blamed alongside his brother by their mother for what has happened. After seeing the creature again, Eric tries to catch up to him, but ends up sliding down a hill and falls into a lake, where he nearly drowns, but is rescued by the alien. Eric is not believed at all when he tries to tell his family about the creature's actions.\nLater that night, he sets a trap with the help of his new friend, Debbie, who had also seen the alien. The two trap him inside a vacuum cleaner, which malfunctions and causes the entire neighborhood to suffer a power surge. After the alien is released, Michael now believes Eric, but it leaves before Janet can be convinced. Eric's behavior towards the alien changes after he fixes all of the damage he caused to the house, and leaves behind several newspaper clippings which Eric believes are an attempt to communicate.\nFBI agents Wickett and Zimmerman, who had been present when the four aliens had escaped from the base, have tracked down the youngest one to the Cruise residence. The two are immediately recognized by Eric and Michael. Eric is forced to take the alien, whom he has now named MAC (Mysterious Alien Creature), to a birthday party at the McDonald's where Debbie's older sister, Courtney, works. Wickett and Zimmerman follow, but, now disguised in a teddy suit, MAC starts a dance number as a distraction and escapes with Eric on his wheelchair. After Wickett and Zimmerman chase them through a nearby neighborhood and shopping mall with additional help, they are rescued by Michael. After catching up with the agents, Janet inadvertently learns from Wickett that MAC is indeed real.\nEric, Michael, Debbie, and Courtney decide to help reunite MAC with the other three aliens, revealed to be his family. With MAC's help, they travel towards the outskirts of Palmdale, California and manage to find them in an abandoned mine. While stopping at a gas station, they accidentally alert security. After MAC's father steals a gun from a security guard, the police arrive and an unintended shootout takes place in the parking lot followed by an explosion, with Eric being caught in the crossfire and killed. Once Wickett, Zimmerman, and Janet arrive by helicopter, MAC and his family use their powers to bring Eric back to life.\nFor saving Eric, MAC and his family are granted citizenship, with the Cruise family, their neighbors, as well as Wickett and Zimmerman in attendance at the ceremony.\nThe final scene shows MAC's father driving his family, along with the kids who helped them. MAC, who is chewing gum, blows a bubble that bears the message, \"We'll be back!\" (The planned sequel was later cancelled.)"}