{"mid": "MadLove", "IMDB_id": "tt0026663", "title": "Mad Love", "plot": "Tordesillas, 1554. Seventy four years old, Queen Joanna of Castile, called Juana La Loca (Joanna the Madwoman), is still mourning the loss of her husband who died a half century before. Joanna remembers with emotion the man she loved passionately, but who brought her ruin. She does not fear death, she says, because death would allow her to be reunited with her husband. Their story goes back almost 60 years.\nIn 1496, Joanna, the third child of the Catholic Monarchs Ferdinand II of Aragon and Isabella I of Castile, is leaving Spain through the port of Laredo. She is headed to Flanders to marry the Archduke of Austria, Philip, nicknamed the Handsome, a man she has never laid eyes on. The marriage has been arranged for political purposes. Joanna's siblings and her mother, Queen Isabella, bid her farewell.\nOnce in Flanders, Joanna, young and inexperienced, is immediately smitten by her handsome fiancé. He is equally pleased with his beautiful bride and orders the marriage to take place at that very moment so they can consummate their marriage without any delay. Their union is initially a great success. The political alliance between their two countries has been consolidated and Joanna and Philip are very attracted to each other. With his good looks and bed manners, Philip completely captivates his wife. Their passionate love making soon produces results. Joanna has a daughter, followed shortly after by a son. She gives birth to her son in an emergency bathroom delivery without any assistance, cutting the umbilical cord afterwards with her teeth.\nA combination of love, lust and emotional dependency make the passionate Joanna deeply attached to her husband. Her love becomes consuming, but the intensity of her passion turns Philip away. He is a restless man who finds entertainment in going hunting and in the arms of other women. The deaths of Joanna's brother, the stillbirth of her brother's daughter, her older sister's death and her sister's son's death unexpectedly make her heir of the Castilian and Aragones crowns. However, she is not interested in government. Obsessed with her husband, Joanna surprises him in bed with a lover, who Joanna later successfully identifies as Ines de Brabante, one of the court ladies. In a fit of jealousy, Joanna cuts the long red hair of her rival. While Joanna despairs at her husband’s unfaithfulness, she receives further bad news. Her mother has died. Joanna thus becomes Queen of Castile and has to return to her kingdom. Her tantrums over her husband’s infidelities have made her start to become known as Joanna the Mad.\nAt the Castilian court in Burgos, the Queen is happily greeted by her subjects, but her marital life is still in turmoil. Philip is soon bewitched by the charms and spells of Aixa, a Moorish prostitute who uses her sexual attraction and black magic to secure Philip's favor. With this new lover, the King becomes noticeably indifferent toward his wife, which adds to her increasingly insane jealousy.\nAgainst the background of this troubled marriage, there are two opposed political parties at court, one Flemish, the other Castilian. The conspiring Flemish usurpers are headed by Señor de Veyre, Philip's right-hand man. Their objective is to have Joanna declared insane and for Philip to take power away from her. Joanna has her own set of supporters, the loyal Castilian royalists, headed by the Admiral of Castile. The Admiral and the Queen's friend and confidant, Elvira, try unsuccessfully to rescue Juana from her marital obsessions.\nHowever, it is not the government that is on the Queen's mind; she is fixated on retaining her husband’s love. To avoid any temptations at court, she hires only ugly-looking maids of honor to serve her, but in fact Aixa has been brought to court by Philip, passing as one of the court ladies under the name of Beatriz de Bobadilla. Unaware of this, the Queen relies on Beatriz to find a spell to help her retain her husband's love. Joanna is equally misguided in her attempt to regain Philip's attention by simulating a love affair with Captain Álvaro de Estúñiga, a close friend from her childhood. The Queen’s lack of control permits the manipulation of her enemies to have her declared incompetent to rule. The King, encouraged by Señor de Veyre, resolves to take the rule of the kingdom for himself and shove Joanna out of the way. He finds an unlikely ally in Joanna's own father, king Fernando, who has remarried and has no further interest in either the fate of his daughter or in the kingdom of Castile.\nWhile her fate is decided at a court assembly, Joanna is able to successfully make her case, counting on the unquestionable support of her subjects. However, her powerful speech coincides with Philip falling gravely ill. Although she devotedly takes care of her husband, the doctors are unable to do anything for him. On his death bed, Philip apologizes to his wife for his past excesses. After the death of her husband Joanna, heavily pregnant, takes on a long journey to the south of the country to bury her husband. She does not go far. Forced to stop to give birth to a daughter, Joanna never reaches her destination. Although she retains her title as queen, at the age of 28 she is locked as a madwoman in the castle of Tordesillas for the rest of her long life.\nPhilip's body was laid to rest in a nearby monastery, which Joanna was allowed to visit from time to time."}