{"mid": "MadMaxFuryRoad", "IMDB_id": "tt1392190", "title": "Mad Max: Fury Road", "plot": "Max Rockatansky (Tom Hardy) explains in a voice-over narration that he was once a cop and road warrior and is now trekking through post-apocalyptic Australia, running from haunting thoughts of his dead wife and child and other people he's failed to save. As he stands on a ridge looking around, a two-headed lizard crawls near Max and he stomps on it before eating it. He drives off and is quickly pursued by a group of scavengers called the War Boys, who are all pale and covered in blisters due to radiation sickness. They chase Max through the desert and cause him to crash before they capture him.The War Boys take Max to their lair in the Citadel, a system of caves in a very tall mesa. They shave his head and face. They tattoo his back with a notice saying he is a universal blood donor (Type O negative) because they intend to use him as a blood supply. They cover the lower part of his face with a trident-shaped iron muzzle. Max is nearly branded with an image of a skull engulfed in fire but he breaks free and runs from the War Boys. The chase through the caves shows that the Citadel is extensive and has an ample water supply. As he runs, Max continues to see images of the dead before he makes it to an exit high above the ground. He jumps out and latches onto a swinging hook, but he keeps swinging back toward the War Boys and they manage to pull him back into the tunnel.In the Citadel, there is a large community of survivors lorded over by the leader of the War Boys, Immortan Joe (Hugh Keays-Byrne, who also played the villain Toecutter in the original Mad Max film). Joe wears a grotesque face mask made of horse teeth set in a large pair of jaws, with air hoses attached to a bellows system on his back to help him breathe (his lungs are damaged). As he addresses a crowd on the ground below the Citadel, he supplies the people with some water, making everyone go crazy and fight for it once Joe shuts it off after a few seconds. He warns the people not to become addicted to water so that they do not go mad over its absence. Joe then sends his commander Imperator Furiosa (Charlize Theron) out in a huge war rig to collect fuel from Gas Town, with an escort of War Boys in smaller vehicles. Furiosa has a metal prosthesis in place of her lower left arm and hand.On the road, Furiosa diverts from the path to Gas Town (glimpsed as a distant group of oil refineries) and heads east. Joe is alerted to the change and runs to the locked chambers where he keeps his five wives (young women chosen to breed his children). They're all gone, and writing on the walls says \"Our children will not be warlords\" and \"Who killed the world?\" An old woman tells Joe that he cannot own a human. Furiosa is taking the women away from Joe, prompting him to rally the War Boys and go after her. All the War Boys are eager to join the chase, but one called Nux (Nicholas Hoult) is so weak that he needs a \"blood bank\" -- which means Max goes along for the ride, chained to Nux and connected to the driver via a central line transfusion tube. The War Boys believe that Immortan Joe can deliver them to the gates of Valhalla, so Nux is willing to risk death.The War Boys ride after Furiosa's war rig, which is attacked by another desert tribe, the Buzzards. Nux straps Max to the hood of his car like the figurehead on a ship and eagerly chases Furiosa alongside the others. They attempt to get close to the rig, but Furiosa shakes most of them off. Nux gets close to the rig as Max attempts to break free. Furiosa drives toward a huge oncoming sand storm. Nux continues to chase her, even as they head into treacherous sand tornadoes. A few War Boys get killed in the storm, while Nux and Max are spun out of control and they crash.Max awakens to find himself still chained to an unconscious Nux and still wearing his muzzle. He grabs a shotgun and tries to shoot off Nux's wrist, but the gun misfires. He walks around the rig to see five beautiful women -- the Splendid Angharad (Rosie Huntington-Whiteley), Toast the Knowing (Zoë Kravitz), Capable (Riley Keough), Cheedo the Fragile (Courtney Eaton), and the Dag (Abbey Lee) -- cleaning themselves with a hose and removing their chastity belts with bolt cutters. Angharad is nine months pregnant with Joe's child, and Dag is also carrying his baby. Max points the shotgun at the women and demands the hose. He drinks, then tells them to use the cutters to break off his chain. Dag tries to but cannot break it. Furiosa sees in the distance that Joe has gathered reinforcements from the other towns that supply gas and ammunition to the Citadel. The approaching forces are led by the People Eater (John Howard) and the Bullet Farmer (Richard Carter). Max and Furiosa fight as he tries to break the chain that ties him to Nux. Nux wakes up and helps Max fight Furiosa, who is assisted by the other women. Nux cuts the chain and Max tries to take the rig for himself. However, it stalls because Furiosa installed a kill switch and only she knows how to keep it going. Max lets her back on the rig but he doesn't want to take the rest of the women. Furiosa insists that they come along, as she is guiding them to a location she calls the Green Place. When Furiosa explains that Joe's \"gratitude\" toward Max will probably be a slow, painful death, Max gives in and as they ride off in the war rig, Nux sneaks on board.Furiosa drives the rig into a canyon where she has an arrangement with a group of biker bandits: they'll close the pass behind her with a rockfall to foil her pursuers in exchange for 3000 gallons of fuel, which she's towing in a trailer. She teaches Max the sequence of switches to throw to defeat the kill switch, then asks his name. He doesn't want to tell her, so she says \"When I yell fool, drive out of here fast.\" They spot Joe and his forces closing in. Furiosa gets out and shouts to the bikers that she's brought the 3000 gallons of fuel, as agreed, and she'll detach the trailer. One of the bikers complains that she said there would be a few pursuers, but there are three large parties. Furiosa, dodging to put the rig between herself and the bikers, yells Fool! and manages, between bullets, to climb back on as Max drives the rig away. Though she never did detach the fuel trailer, the the bikers blow up the overpass, temporarily halting Joe's pursuit.Immortan Joe, in his large-wheeled, off-road vehicle, is able to climb over the rockfall. Another chase ensues through the desert. (During this part of the chase, Max removes his mask using a metal file Furiosa gave him.) The War Boys keep trying to overtake the rig while Joe is catching up. He attempts to shoot at the rig until Angharad steps out as a human shield, and Joe cannot do a thing without hurting his potential son. Nux attempts to help Joe, who sprays chrome paint on Nux's mouth with the promise of bringing him to the gates of Valhalla if Nux succeeds. Almost immediately, Nux loses his gun in front of Joe, who continues driving with disappointment. Angharad tries climbing back to the front of the rig, but she falls off and is run over by Joe's car. The women tell Max to turn back, but when he tells Furiosa that Angharad went under the wheels, Furiosa says they must keep going. The others cry for Angharad.Nux slips back into the rig with the promise of helping the women evade Joe. He lies on the floor, distraught that he has failed Joe yet again and has lost his chance of joining his personal army. Capable consoles him. At the front, Furiosa tells Max of the Green Place and how she was taken from it as a child.As they continue driving through the night, the rig gets stuck in a big mud hole. The Bullet Farmer is not far behind them. Max shoots at him but misses, and then Furiosa gets a clean shot, taking out the Bullet Farmer's lights and blinding him.Meanwhile, Joe's lieutenant the Organic Mechanic (Angus Sampson) takes Angharad's body, as she is near death, and he cuts the baby out of her stomach. The baby is dead too, but he tells Joe that it was a boy. Joe tells his adult son Rictus (Nathan Jones) that he had a brother. Rictus screams proudly. The women continue trying to get the rig out of the mud while Max goes out to face the Bullet Farmer himself. He returns with the Bullet Farmer's blood on his face, along with a nice supply of guns and ammo.In the morning, the rig comes up to a tower where a naked woman, the Valkyrie (Megan Gale), is screaming for help. Max thinks it's a trap, but Furiosa steps out and tells the Valkyrie her mother's name and her affiliation with this clan. The Valkyrie climbs down the tower and puts on a robe. More older women, the Vuvalini, emerge. The eldest, Keeper of the Seeds (Melissa Jaffer), recognizes Furiosa. Furiosa tells them that she is taking the women from the Citadel to the Green Place, but Keeper of the Seeds informs her that the muddy swamp they passed through was the Green Place, and has long since become uninhabitable. Furiosa walks into the sand and falls on her knees, screaming in despair. The Vuvalini agree to help the women from the Citadel ride across the salt flats (the dried up ocean) in search of a home. Max, still haunted by the images of his wife and child, decides to help the women go back to the Citadel since Joe's greenery and water supply are currently unguarded. They also plan to trap Joe and his army in the canyons.The whole group rides back in the direction of the Citadel. Joe sees them with his telescope, knowing full-well what their plan is. He gathers his army and gives chase. The Vuvalini help fight back. The Valkyrie shoots at the War Boys while defending one of her own until she is run over. Max and Furiosa kill some of the War Boys, while Max gets Joe to kill the People Eater by using him as a human shield. Keeper of the Seeds is also killed when one of the War Boys cuts her neck. Toast is captured by Joe and held hostage. Furiosa is stabbed on Joe's vehicle and gets weaker as Joe and Rictus gain momentum. Toast distracts Joe long enough to give Furiosa an opportunity to hook Joe's mask onto the wheels of his car. She growls, \"Remember me?\" to him as the wheels rip the mask and Joe's face off, killing him. The rig then heads toward the canyon, with Rictus still trying to kill the group. The women get off safely while Nux says goodbye to Capable and swerves against the canyon, sacrificing himself to kill Rictus and collapse the overpass to put an end to Joe's army.On the way back to the Citadel, Furiosa's lungs nearly collapse. Max punches a small hole in her side to give her air. She starts to lose consciousness, and Max gives her a transfusion of his own blood. He tells her his name as she closes her eyes.The group arrives at the Citadel. Max presents the people with Joe's mouthless corpse, making everyone cheer. They rip Joe's corpse apart and feed off him. The water supply is brought out, giving the people as much water as they need. Furiosa rises and apparently becomes the new leader. She and Max acknowledge each other with respect once more before he slips away into the crowd to continue down his own path."}