{"mid": "MagicalMysteryTour", "IMDB_id": "tt0061937", "title": "Magical Mystery Tour", "plot": "The situation is that of a group of people on a British mystery tour in a 1967 coach, focusing mostly on Mr Richard Starkey (Ringo Starr) and his recently widowed Aunt Jessie (Jessie Robins). Other group members on the bus include the tour director, Jolly Jimmy Johnson (Derek Royle); the tour hostess, Miss Wendy Winters (Miranda Forbes, credited as Mandy Weet); the conductor, Buster Bloodvessel (Ivor Cutler); and the other Beatles (John Lennon, Paul McCartney and George Harrison).\nDuring the course of the tour, \"strange things begin to happen\" at the whim of \"four or five magicians\", four of whom are played by the Beatles themselves and the fifth by the band's long-time road manager Mal Evans.\nDuring the journey, Ringo and his Aunt Jessie argue continually. Aunt Jessie begins to have daydreams of falling in love with Buster Bloodvessel, who displays increasingly eccentric and disturbing behaviour. The tour involves several strange activities, such as an impromptu race in which each of the passengers employs a different mode of transportation (some run, a few jump into cars, a group of people have a long bike they pedal, while Ringo ends up beating them all with the bus). In one scene, the tour group walk through what appears to be a British Army recruitment office and are greeted by the army drill sergeant (Victor Spinetti). (McCartney appears briefly as \"Major McCartney\", on whose desk rests a sign reading \"I you WAS\".) The sergeant, shouting incomprehensibly, appears to instruct the assembled onlookers on how to attack a stuffed cow.\nThe tour group also crawl into a tiny tent in a field, inside which is a projection theatre. A scene in a restaurant shows a waiter (played by Lennon) repeatedly shovelling spaghetti onto the table in front of Aunt Jessie, while arriving guests step out from a lift and walk across the dining tables. The film continues with the tour's male passengers watching a strip show (Jan Carson of the Raymond Revuebar). The film ends with the Beatles dressed in white tuxedos, highlighting a glamourous old-style dance crowd scene, accompanied by the song \"Your Mother Should Know\".\nThe film is interspersed with musical interludes, which include the Beatles performing \"I Am the Walrus\" wearing animal masks, Harrison singing \"Blue Jay Way\" while waiting on Blue Jay Way Road, and the Bonzo Dog Doo-Dah Band performing Vivian Stanshall and Neil Innes' \"Death Cab For Cutie\" sung by Stanshall."}