{"mid": "MajorLeagueII", "IMDB_id": "tt0110442", "title": "Major League II", "plot": "In the previous season, the Cleveland Indians won the division title by beating the New York Yankees in a one-game playoff, but were defeated in the ALCS by the Chicago White Sox.\nThe success of last season has changed the attitudes of the Indians. Pitching sensation Rick \"Wild Thing\" Vaughn has become a media sensation and as such is now more concerned about his public image than his pitching, causing him to lose the edge on his fastball. Instead, he begins to rely on highly ineffective breaking balls, to which he gives nicknames such as \"Eliminator\" and \"Humiliator.\" Home run hitter Pedro Cerrano becomes a Buddhist and adopts a more placid, carefree style as opposed to the angry and aggressive player he was before. Center fielder Willie Mays Hayes is still as fast as ever but is more concerned with hitting home runs and his movie career, which saw him star in an action film that was a flop and resulted in him spraining his knee. Aging catcher Jake Taylor has also returned and conceited third baseman Roger Dorn has retired and purchased the team from its previous owner, Rachel Phelps. One of his first acts as owner is to sign Oakland Athletics all-star catcher Jack Parkman, which forces Jake to compete for his old position. Jack Parkman is an arrogant jerk who thinks this team is a joke. To further complicate things, minor-league catcher Rube Baker has also been invited to camp despite his inability to throw the ball back to the pitcher with any consistency.\nAs the team breaks camp, Taylor discovers that although he has made the team, he believes there is no way that manager Lou Brown is going to carry three catchers as Parkman and Rube have also made the team. Lou, after being confronted by Jake, informs Taylor that he is not going to carry him as a player but as a coach. While initially upset over being forced into retirement and with the small amount of job offers he gets, Jake elects to take Lou's offer and join the coaching staff.\nOnce again, the Indians start slow as Cerrano's religious conversion causes him to struggle, Hayes refuses to play even with the slightest injury, Vaughn's control problems continue to plague him and Parkman's ego poisons the clubhouse. To make matters worse, Dorn has been unable to keep up with the franchise's finances and is forced to do strange things to bring in money, such as covering the outfield walls with advertising. Eventually, Lou reaches the end of his tolerance regarding Parkman and decides to suspend him after Parkman criticizes the team in the local papers. Parkman then informs Lou that the suspension is moot as he has been traded to the White Sox. Lou confronts Dorn for not consulting him about the trade. Dorn explains that he could no longer afford to pay Parkman's salary and had no choice but to trade him. In return, Japanese import Isuro \"Kamikaze\" Tanaka, a gifted left fielder with a penchant for crashing into the fence, is sent to the Indians.\nFinally out of options, Dorn sells the Indians back to Rachel Phelps. Rachel keeps Dorn on as the Indians general manager and his first order of business is to re-activate himself as a player. Rachel doesn't need the money; she has more than enough. She bought the team back as revenge for ruining her plan to move the team to Miami and now since this team is in last place, she has another chance to bring it back and watch them go down in flames for good. Lou suffers a heart attack in the clubhouse due to his frustration over the team's performance and Jake is given the reins of the team.\nThings come to a head during a doubleheader against the Boston Red Sox. Rube is hit by a pitch in his ankle and Hayes is called upon to run for him. Hayes refuses to do it, which angers Jake. Vaughn chimes in, which causes Hayes to bring up his own struggles and the two begin fighting. Soon, the entire team gets involved and begins fighting each other, resulting in everyone being ejected. After the game, Tanaka criticizes Cerrano for not having any \"marbles\" due to his struggles and Hayes makes a wisecrack at Baker about his injury, while Rube chastises Hayes and the rest of the team for their lack of passion. Inspired by the speech, Hayes volunteers to run for the injured Baker in the bottom of the ninth inning of the second game and promptly steals second, third and home to tie the score. Cerrano, also inspired, demands that Jake insert him into the game to pinch hit and he responds by hitting the game-winning home run.\nThe win sparks a hot streak that the Indians ride all the way to a second straight division title, clinched by beating the Toronto Blue Jays on the last day of the season. Despite the team's hot streak, Vaughn continues to slump as his ineffective breaking pitches have caused him to lose confidence in his best pitch, his fastball. To make matters worse, he refuses to finish games he starts and has allowed the fans to get into his head.\nIn the ALCS, the Indians square off in a rematch with the White Sox and win the first three games of the series. This inspires Rachel to give the team a phony pep talk before Game 4, which is purposely designed to get in the heads of the players and distract them. It works, as a still struggling Vaughn gives up a game-winning home run to Parkman in the bottom of the ninth. The White Sox then defeat the Indians in the next two games, forcing a seventh game in Cleveland.\nThe night before the game, Jake goes to visit Vaughn at his home and tells him that he might be called on to pitch in relief in Game 7. Vaughn nonchalantly tells Taylor he will be ready, which infuriates Jake to the point where he lashes out at Vaughn. He calls Vaughn out for having lost his edge and not having his head in the game and tells him that he is of no use to the team if he continues playing the way he is. Before Taylor leaves, he tells Vaughn to find his edge if it has not already escaped him.\nThe White Sox jump out to an early 2–1 lead in Game 7 after Parkman bowls over Rube on a play at the plate, taunting him as he struggles to get up. With the Indians down by one, Hayes reaches base on a walk and taunts Parkman by saying he is going to score on the play without sliding. Rube then lines a drive to the left field corner and Hayes rounds the bases and heads for home. The ball gets to Parkman first, but Hayes, making good on his promise not to slide, hurdles over Parkman and lands on home plate. Parkman responds, however, by hitting a three-run home run in the seventh inning and the White Sox take a 5–3 lead into the bottom of the eighth.\nAlthough the Indians get a runner on, two quick outs are recorded and Jake is forced to make a strategic move he had tried to avoid the whole season. Although Dorn is still on the active roster, up until this point, Jake refuses to put him into a game and even mocks him for signing himself. The pitcher on the mound for the White Sox has had great success against Dorn in his career, but always pitched him inside. Based on that, Jake sends Dorn to pinch hit and \"take one for the team\" so the tying run can get on base. Dorn takes a pitch in the back and is pulled for a pinch runner, eventually being forced to the bench despite his best efforts to stay in.\nCerrano steps in, having apparently reverted to his more placid self. He greets Parkman, who reminds him that his team is still losing the game. After taking two pitches and being impressed by them, Cerrano's teammates begin shaking little bags of marbles at him. The Cuban slugger amazingly is able to find a balance between the calmer and the more angry sides of him and drills the next pitch over the fence to give the Indians a 6–5 lead. As he steps on home plate, Cerrano emphatically tells Parkman, \"Look at the scoreboard now, grasshopper!\"\nThe game is not over yet, as the go-ahead runs reach base with two outs in the top of the ninth. Jake calls on Vaughn to get the final out and to everyone's amazement, Vaughn takes Jake's message to heart and has apparently rediscovered his edge. To further this, he tells Jake that he does not want to pitch to the batter he was called upon to face. Instead he wants another shot at Parkman, who is on deck. Jake cannot believe what Vaughn is suggesting, as an intentional walk will load the bases. Vaughn states again that he wants to face his old nemesis one more time. Convinced, Jake hands Vaughn the ball and he walks the batter ahead of Parkman to bring him to the plate with a chance to drive in the go-ahead runs.\nVaughn throws a fastball that Parkman swings through for strike one, then follows with another fastball that Parkman fouls straight back. With two strikes on him, an impressed Parkman dares Vaughn to throw it a third time. Vaughn fearlessly complies telling him that if he gets a piece of it he can rename it, while Rube attempts to get back at Parkman and taunt him the same way he had been taunted earlier. Vaughn delivers one more fastball and Parkman swings through it, striking out to end the game and send the Indians to the World Series. Phelps' plan to get rid of the players and move the team to Miami fails once again."}