{"mid": "MajorDundee", "IMDB_id": "tt0059418", "title": "Major Dundee", "plot": "During the American Civil War, Union cavalry officer Major Amos Dundee (Charlton Heston) has been relieved of his command for an unspecified tactical error at the Battle of Gettysburg (it is implied that he showed too much initiative) and sent to head a prisoner-of-war camp in the New Mexico Territory. After a family of ranchers and a relief column of cavalry are massacred by an Apache war chief named Sierra Charriba (Michael Pate), Dundee seizes the opportunity for glory, raising his own private army of Union troops (black and white), Confederate prisoners led by his former friend and rival from their days at West Point, Captain Ben Tyreen (Richard Harris), several Indian scouts, and a gang of civilian mercenaries to illegally pursue Charriba into Mexico. Tyreen bears a grudge against Dundee. Before the war, Dundee cast the deciding vote in Tyreen's court-martial from the U.S. Army for participating in a duel, leading to Tyreen later becoming an officer in the Confederate Army. However, having given his word of honor, the chivalrous Tyreen binds himself and his men to serve loyally, but only until Charriba has been dispatched.\nWhen the diverse factions of Dundee's force are not fighting each other, they engage the Apaches in several bloody battles. Though they rescue several young children captured by the Apaches, the Americans lose most of their supplies in an ambush, forcing them to raid a village garrisoned by French troops supporting Emperor Maximilian of Mexico. However, there is little to loot, and Dundee ends up sharing some of his dwindling food with the starving Mexicans. Beautiful resident Teresa Santiago (Senta Berger), the Austrian widow of a doctor executed for his support of the rebels under Benito Juárez, causes further tensions between Dundee and Tyreen.\nDundee makes it easy for his French prisoners to escape. When they return with reinforcements as he had expected, Dundee surprises them in a night attack and makes off with badly needed supplies. Teresa and Dundee have a brief affair. In an unguarded moment with her, he is attacked by the Apaches, and wounded in the leg, forcing him to seek medical help in French-held Durango. The doctor successfully removes the arrow, but Dundee has to remain there to recuperate. He is tended by a pretty Mexican, whom he eventually takes to bed. When Teresa comes upon them unexpectedly, her relationship with Dundee comes to an abrupt end. Dundee starts drinking heavily as a result. Tyreen has to sneak into town and shame Dundee into resuming his mission.\nCharriba proves difficult to pin down, so Dundee pretends to give up and starts back for the United States. The Apaches give chase and end up in a trap. Charriba is finally killed. With their bargain concluded, Dundee and Tyreen prepare to resume their personal battle, but the vengeful French appear, forcing the two men to set aside their differences. With the French having positioned a portion of their force on the American side of the Rio Grande, blocking Dundee's forces from crossing into U.S. territory, the two cavalry forces charge each other at the Rio Grande, with major loss of life on both sides. Tyreen sees a French soldier seize the U.S. regimental colors, and seemingly moved by a patriotism he had thought dead, he takes back the captured American flag, and hands it over to Dundee – only to be hit in the stomach. With his last strength, he rides off to singlehandedly delay a second detachment of French cavalry while the others escape across the Rio Grande, and set out for home, greatly reduced in number.\nAs Dundee's force heads home, the narration notes that it's now April 16, 1865, and the soldiers are still unaware that the Civil War is over and President Lincoln has been assassinated."}