{"mid": "Manhunt", "IMDB_id": "tt0386616", "title": "Manhunt", "plot": "The game is set in dilapidated rust-belt Carcer City in November 2003. Death-row prisoner James Earl Cash has been sentence to execution by lethal injection, after three years of being on death row. As he is taken over to the bed to be injected, he struggles to get free but is overwhelmed. Cash is later woken up by a mysterious voice over a speaker. The first words he hears are: \"Hey tough guy, wake up. You're not dead. Well, not yet, anyway. You're getting a second chance, another throw of the dice. As far as the world is concerned, you died back in the chamber. Justice was served; James Earl Cash is rotting in hell.\" Clearly still dazed Cash tries to escape from the room. The voice instructs him to insert the ear piece; still not sure of his surrounding Cash spots a surveillance camera and attempts to take it out. It is at this point that he is \"You've had an unexpected reprieve...do exactly as I say, and I promise, this will be over, before the night is out.\" As Cash inserts the ear peace, the door opens and Cash is freed upon Carcer City.Little does Cash know but this is just the beginning of the longest night of his life. The voice in his ear is that of Lionel Starkweather, a once big shot in Hollywood that now deals in snuff movies. Starkweather is working in conjunction with Darkwoods Penitentiary to cast his leading man. It is at this point that Cash is instructed as to what Starkweather is asking of him, hundreds of cameras have been set up throughout the city filming every movement that Cash makes. What Cash must do is eliminate anyone that comes in his path, the bloodier and more brutal the execution the better, all for the sake of Starkweathers sick videos.A spanner is thrown into the works when the local news reporter catches on to Starkweathers game. She discovers that something is up and is out to reveal the true identity behind Valiant Video Enterprises and take them down. In order to do so she has to track down and talk to Cash.In the opening scene, Starkweather decides to test Cash, instructing him to kill the first gang member. He has set the hunter up to see if Cash has what it takes to be his leading man, Starkweather proceeds to direct Cash through the basics of surviving the streets of Carcer, upon learning the basics Cash jumps down a shoot, landing to an alleyway.The alleyway leads to another abandoned section of Carcer City that is cordoned off in order for Starkweather to create his illicit movies. Cash is forced to take to the shadows, taking anyone out that comes in his way via the means of stealth. Cash finds himself stood in front of a set of locked gates. Forced to look for away past the gate Cash comes up against a hood packing a crowbar; Cash quickly takes the crowbar wielding hood out and proceeds beyond the gate to the Abandoned Library.Continuing on his way to the abandoned library, Cash finds himself passing through building to building, taking out hoods as they appear, along his way passing through a cellar. Once back on the streets Cash must use a crowbar to open the locked gate, the Cerberus are waiting on Cashs arrival from the alleyway, Starkweather says to them Get ready boys hes coming After pointing a gun in Cashs face one of them hits the back of his legs, knocking him down, they then beat Cash until he can't move, they waste little time taking him to the next scene.The Cerberus drop Cash off at the local junkyard that is being patrolled by the Skinz, whom are brought in by Ramirez, when one of the Skinz gets in Ramirez face he breaks their neck, demonstrating his dominance, he proceeds to instruct them to take Cash out.Cash makes his way through the junkyard avoiding death only to find himself blocked in by another gate, however this time it is blocked off by members of the Skinz wielding nail-guns. Cash quickly takes them out and proceeds to the next area of the junkyard, the security is heavy, the Skinz are everywhere. Cash must cut the power in order to proceed past the Skinz member that is watching porn. Up ahead there is away out, however this is not without problem as it has been blocked of by fridges, there is a huge crane near by but it is out of gasoline. Cash finds himself forced to fill the crane up with gasoline, forcing a way through, along the way taking out tens of Skinz. As Cash sneakily makes his way out of the junkyard, he is ambushed by the Cerberus, one of which sneaks up from behind and puts him in a chokehold.Some other Cerberus are shown feeding some crazed man wearing a pigs face on his head that is chained up in the attic. The Cerberus proceed to drop Cash off at Carcer City Zoo, the zoo is being patrolled by the deadly Wardogs, headed by Ramirez, who once again instructs his men as to what to do. Cash must make his way from one end of the zoo to the other, leaving a bloody path of death along the way. Cash finds himself passing through the gates only for a bombshell to be dropped on him, his family has been tied up and in order to move onto the next scene Cash must save at least one of them. Along the way we discover Cash and his family arent really close, he even calls one of them an idiot.After Starkweather is pleased the Cerberus once again shows up and captures Cash, one aggravated Cerberus member can be heard uttering the words 'you just wont fucking die will you' towards the ever charismatic Cash.Ramirez is shown rounding up the troops, he splits the Innocentz up into packs, sending some of them to the mall and the others to the graveyard. Cash is given a series of orders, first get a video camera and then the tape, he is then told that the video camera is broken and that he should use the TV in the bar within the mall to view the tape. The tape has footage of his family being killed, Cash is not pleased and lashes out, smashing the TV. Starkweather proceeds to tell you that he couldn't let them escape and that he is the only family you need now. You are soon informed that Starkweather has a partner for you, however he has been locked up by the Innocentz, Cash must free the bum and take him to through a serious of gates which Starkweather has locked and is viewing from a camera. The only way for Cash to get through is to get the bum out alive. Once arriving at the graveyard, Cash must take out the remaining Innocentz and enter the tomb.Cash finds himself in a not so abandoned factory, the factory is polluted with Cerberus but fortunately Cash is now wielding a shotgun and is more than a match for them. As Cash is about to leave the factory he is ambushed by the Cerberus, they sedate Cash and take him off to Darkwoods Penitentiary that is the local nut house to me and you.We are told that there are over 1000 inmates, and unfortunately for Cash they have broken free and are packing heat. Cash makes his way through the penitentiary and hits a road block, Starkweather wants the head of the dress wearing lunatic, upon providing Starkweather with his head he gives Cash the gift of a shotgun and allows him to proceed. Not long after giving Cash the gift he asks that Cash give it back as he must drop all weapons and jump down through the hole in the floor to the abandoned lock up below.Cash then has to play a game of simon-says as Starkweather gives out commands as to the various gruesome ways he wants Cash to take out the crazies that roam the corridors. Starkweather has the place on lockdown so the only way to advance is to do as he says, once he has had his fill he allows Cash to proceed. Cash no sooner thinks he is regaining control of his sanity than it is taken away from him. There is a crazed killer stood up ahead in a white rabbit suit, that wants to play chase. The White Rabbit holds the prison key and Cash wants it, the rabbit leads Cash through the prison where Cash takes out dozens of Smilies, with no where to go the rabbit runs for the control tower outside. As Cash leaves the cells it becomes apparent that Starkweather didnt have too much faith in the Smilies as he has the Cerberus monitoring the whole operation. Forced to take on the Cerberus, Cash heroically takes them all down, not before stripping the rabbit of both the key and his head. Ramirez is shown getting informed that Cash has slipped his leash and that he has to be brought to heal, under Starkweathers command.Just as Cash believes he finally might be out of this mess, the Wardogs intervene. Ramirez takes Cash by surprise and throws him a beating, once again stripping him of his weapons. The Wardogs then allow Cash to regain his balance and run for his life. Ramirez has strength in numbers and is out for a game of hide and seek, weaponless Cash takes to the shadows slowly but surely eliminating every last member of the Wardogs, sensing death Ramirez takes refuge in an abandoned apartment complex where he is able to call for backup. Cash attempts to take Ramirez out the same way he did all his dominions, stealthily and quietly but Ramirez is to strong and throws Cash over his shoulder. Ramirez runs out from the building and hides in the roughage outside. With the place heaving with more Wardogs Cash resorts to taking Ramirez out with a sniper shot to the head.As Cash runs away from the gunfire from the Wardogs a car pulls up with a journalist insisting get in you idiot, get in confused by the whole situation Cash instructs her to pull over so she can fill him in. It is here that Cash finds out Starkweathers name, the reporter informs Cash that she was at his execution and has been following Starkweather for months, building a report on him. Cash insists they make their way to her apartment so that she can get the report, file it and take Starkweather down. Starkweather communicates with Gary Schaffer, the chief of the Carcer City Police Department, over the phone instructing him that it is there job to take care of the citys mess, obviously referring to Cash being on the loose. The corrupt CCPD have surrounded the reporter's apartment and secure the surrounding streets by order of Starkweather. Anticipating the ambush Cash instructs the reporter to pull over two blocks from her apartment that way they can have the element of surprise. Cash instructs the reporter to hide as he battles his way up to her apartment, once in the apartment Cash decides that he will go and thank the Director personally for his second chance, leaving the reporter behind. Cash then takes to the streets heading in the direction of the subway station.Cash exits via the subway after a battle with the Carcer SWAT, in the process killing most of them off. Piggsy is shown escaping captivity from an unknown area. Cash then exits the subway at the other side to find himself at the train tracks where he again is forced to battle with yet more Swat and CCPD.At the end of the scene it looks as though it is all over for Cash as he is surrounded by SWAT team members, then from no where the Cerberus come from behind the SWAT and kill them all, taking Cash with them.They pull up inside a garage near by Starkweathers mansion, to discover that Piggsy has broken free and is on a killing spree. The Cerberus contemplates finishing Cash off just as they become aware of the disturbance and are forced to leave to investigate. They leave Cash outside the van, within the garage; from here Cash escapes from the garage and makes his way through Starkweathers mansion, he enters the cellar door and navigates his way through the mansion, slaying Cerberus as if they where nothing.Cerberus guards hear of Cash's arrival and lock down the elevator, the lead Cerberus member demands that he be given the key from another and instructs him to go down and turn the elevators motor off. Cash kills them and turns the power back on then escapes to the attic using the elevator.Cash quickly finds himself under attack as Piggsy is attempting to rip him apart with his chainsaw. Cash is forced to escape through the roof of the elevator, in the process dropping his weapons. He now finds himself in an attack with a madman with murder on his mind, Cash is forced to take to the shadows once again and use whatever weapons he can find to take Piggsy out. After a few select attacks Piggsy runs off with his tail between his legs, Cash gives chase but soon finds himself once again under attack by the madman. Cash discovers a way to take Piggsy out via a loose vent on an upper level of the attic, Cash runs over the vent with Piggsy not far behind, as he steps on the vent he falls through the floor dropping his chainsaw, as Piggsy holds on for his life Cash quickly grabs the chainsaw and finishes Piggsy off once and for all.Cash attempts to get to Starkweather behind the locked door, Starkweather immediately sends the Cerberus out after Cash, forcing Cash back down into the attic. Cash uses the chainsaw to take the Cerberus out once and for all before heading back up for Starkweather. As Cash opens the door Starkweather opens fire, Cash takes cover before taking Starkweather out via cutting him up with the chainsaw, not before Starkweather pleads for his life.Afterwards, the reporter is shown doing a news report on TV, revealing to the public exactly what has went on in Carcer City, revealing Starkweathers psychotic ways. She also informs that Carcer City's police chief Gary Schaffer was linked to the snuff film ring and will be trialed before the court. His lawyer states that he will plead \"not guilty\".Two weeks later The journalist is locked up in a psychiatric ward, undergoing therapy. The state is trying to cover the whole situation as she is a thorn in their side. Cash is still out there, his whereabouts unknown."}