{"mid": "Mannequin", "IMDB_id": "tt0093493", "title": "Mannequin", "plot": "In Ancient Egypt, Ema \"Emmy\" Heshire (Kim Cattrall) hides in a pyramid from her mother, who wants her daughter to marry against Emmy's will. Emmy prays for the gods to get her out of the mess and to find her true love. The gods answer her prayer by making her disappear.\nPhiladelphia, 1987; young would-be artist Jonathan Switcher (Andrew McCarthy), takes a number of odd jobs. The first job, where he assembles a beautiful, perfect mannequin, portends the rest of the movie and is representative of his efforts. In each of these jobs, Jonathan painstakingly expresses his artistic self; but each of these early employers dismisses him for taking too much time or deviating from a set pattern.\nOne night, Jonathan is driving in the rain when he passes the Prince & Company department store and recognizes his \"perfect\" mannequin in a display window. He declares that she is the first work he's ever done that made him feel like an artist. The next morning he manages to save the owner, Claire Timkin (Estelle Getty), from being hit by a falling sign. The grateful Claire hires Jonathan, much to the chagrin of Vice President Richards (James Spader), who assigns Jonathan to be a stock boy. Jonathan hits it off with flamboyant window dresser Hollywood Montrose (Meshach Taylor). That night, Hollywood and Jonathan construct a window display starring Jonathan's mannequin. They have a run-in with the store's night security chief, Captain Felix Maxwell (G. W. Bailey). When Jonathan is alone, the mannequin he is obsessed with comes to life as Emmy.\nTo the surprise of his detractors, Jonathan's window-dressing for Prince & Company attracts large audiences. Jonathan's arrogant ex-girlfriend Roxie (Carole Davis) and president B.J. Wert (Steve Vinovich), both of rival department store Illustra, learn about it as well. It is revealed that Richards is a corporate spy for Wert. At their board meeting, Richards wants to fire Jonathan, who is showing off with the window displays. In contrast, the board members promote Jonathan to visual merchandising.\nEmmy and Jonathan's relationship thrives over the following week. Every night, she helps him to create window displays which dazzle everyone at Prince & Company. As a result, Claire promotes Jonathan to a vice presidency.\nAs the window designs are bringing a tremendous amount of customers and profit for Prince & Company, people from Illustra plan to steal Emmy—not knowing that she is alive—and put her on display at Illustra. The next day, Roxie offers Jonathan work at Illustra, but is refused as he and Emmy are in love.\nMaxwell and Richards break into Prince & Company and search for Emmy. The next morning, Hollywood and Jonathan discover Emmy and other mannequins missing. Jonathan suspects Illustra and goes there, where he confronts Wert, who is dismissive regarding the stolen property. Roxie storms out of the office, swearing that Jonathan will never see Emmy ever again. Jonathan chases Roxie while being pursued by a dozen security guards. Hollywood bombards the guards with water from a fire hose as Roxie loads Emmy along with the other mannequins into a trash compactor. When Jonathan rescues Emmy, she comes to life, and stays human in front of other people for the first time.\nMaxwell and his fellow guards rush in, followed by Wert, who attempts to have Jonathan arrested for trespassing. Claire arrives, accusing Richards and Maxwell of breaking and entering, conspiracy, kidnapping Emmy, and grand theft. Wert, Richards and Felix are arrested instead and hauled away. Wert fires Roxie as he is being dragged out.\nEmmy and Jonathan are married in the shop window of Prince & Company, with Claire as a bridesmaid, and with Hollywood as best man."}