{"mid": "ManosTheHandsOfFate", "IMDB_id": "tt0060666", "title": "Manos: The Hands of Fate", "plot": "While on vacation near El Paso, Texas, Michael, Margaret, their young daughter Debbie and their dog, Peppy, drive through the desert in search of a hotel called \"Valley Lodge.\" Margaret insists they are lost, and Michael claims they are not. They are then pulled over by a local deputy for a broken taillight, but are let go after Michael asks them for mercy since they are on vacation. After long shots of driving through farmland and the desert, intercut with scenes of two teenagers making out in a car and being caught by the deputies, the family finally reach a house, tended by the bizarre, satyr-like Torgo, who says he takes care of the place \"while The Master is away.\" The house seemed to appear out of nowhere, and Torgo acts very strange. Apprehensive, Michael and Margaret ask Torgo for directions to the Valley Lodge; Torgo denies having knowledge of such a place. Frustrated, Michael asks Torgo to let him and his family stay the night, despite objections from both Torgo and Margaret.\nInside the house, Michael and Margaret find a disturbing painting of a dark, malevolent-looking man and a black dog with glowing eyes; Torgo says the man it depicts is The Master. Margaret becomes frightened upon hearing an ominous howl; Peppy breaks away from Debbie and runs outside after the howl. Michael investigates, retrieving a flashlight and revolver from his car, and finds Peppy lying dead on the ground. Michael buries the dog in the desert, and goes back to the house. Meanwhile, Torgo reveals his sudden attraction to Margaret and tells her that although The Master wants her to become his bride, he intends to keep her for himself. Torgo then spends the next few minutes trying to grope her shoulder. Margaret threatens to tell Michael of Torgo's advances, but Torgo convinces her not to say anything by promising to protect her. Michael returns and is unable to start the car. Torgo tells them there is no phone in the house, so the family reluctantly decides to stay the night.\nAfter another scene of Torgo peeping in on Margaret changing clothes, Michael and Margaret find Debbie is gone and go to look for her. Debbie returns, holding the leash of a big black dog, the same dog from the painting. Following Debbie, Michael and Margaret stumble upon The Master and his wives, sleeping around a blazing fire. The wives are dressed in diaphanous nightgowns, The Master in a robe with two red hands on it. Margaret and Debbie run back to the house to get their things and escape. As Michael runs behind them, Torgo appears and uses a stick to knock him out and then ties him to a pole. The Master awakens and summons his wives, telling them that Michael must be sacrificed to the deity Manos, and Margaret and Debbie will become his new wives. He then leaves.\nThe other wives argue among each other about whether Debbie should become a wife or be sacrificed as well. This turns into a catfight, where the wives tumble around in the dirt. The Master returns and breaks up the fight, and decides to sacrifice Torgo and his first wife instead. Meanwhile, Michael wakes up and unties himself, going back to the house to collect Margaret and Debbie. The family leaves the house and runs off into the desert to escape. The Master summons Torgo and hypnotizes him, ordering the wives to kill him. The wives \"kill\" him by running their hands over his face, The Master then severs and burns Torgo's left hand. Torgo runs off into the darkness, and The Master then sacrifices his first wife.\nAs Michael, Margaret and Debbie run through the desert, Margaret falls and says she can't go any farther. A rattlesnake appears in front of them and Michael shoots it, the noise attracting the attention of the deputies, who think the noises come from Mexico and leave it at that. Margaret convinces Michael to return to the house, as the cult would never think to look for them there. They go back and find The Master and his dog waiting for them. As The Master comes towards them Michael fires several shots into The Master's face at point-blank range, but they have no effect.\nThe film then cuts to another pair of travelers, two women starting their vacation. They drive through a rainstorm, searching for a place to stay. After more driving they end up at The Master's house. An entranced Michael greets them, telling them \"I take care of the place while The Master is away.\" The ending scene shows Margaret and Debbie have become wives of The Master, and all are asleep."}