{"mid": "ManOfLaMancha", "IMDB_id": "tt0068909", "title": "Man of La Mancha", "plot": "In the late sixteenth century, failed author-soldier-actor and tax collector Miguel de Cervantes has been thrown into a dungeon by the Spanish Inquisition, along with his manservant. They have been charged with foreclosing on a monastery. The two have brought all their possessions with them into the dungeon. There, they are attacked by their fellow prisoners, who instantly set up a mock trial. If Cervantes is found guilty, he will have to hand over all his possessions. Cervantes agrees to do so, except for a precious manuscript that the prisoners are all too eager to burn. He asks to be allowed to offer a defense, and the defense will be a play, acted out by him and all the prisoners. The \"judge\", a sympathetic criminal called \"the Governor\", agrees.\nCervantes takes out a makeup kit from his trunk, and the manservant helps him get into a costume. In a few short moments, Cervantes has transformed himself into Alonso Quijano, an old gentleman who has read so many books of chivalry and thought so much about injustice that he has lost his mind and now believes that he should go forth as a knight-errant. Quijano renames himself Don Quixote de La Mancha, and sets out to find adventures with his \"squire\", Sancho Panza. (\"Man of La Mancha (I, Don Quixote)\")\nDon Quixote warns Sancho that the pair are always in danger of being attacked by Quixote's mortal enemy, an evil magician known as the Enchanter. Suddenly he spots a windmill. Seeing its sails whirling, he mistakes it for a four-armed giant, attacks it, and receives a beating from the encounter. He thinks he knows why he has been defeated: It is because he has not been properly dubbed a knight. Looking off, he imagines he sees a castle (it is really a rundown roadside inn). He orders Sancho to announce their arrival by blowing his bugle, and the two proceed to the inn.\nCervantes talks some prisoners into assuming the roles of the inn's serving wench and part-time prostitute Aldonza and a group of muleteers who are propositioning her. Fending them off sarcastically (\"It's All The Same\"), she eventually deigns to accept their leader, Pedro, who pays in advance.\nDon Quixote enters with Sancho, upset at not having been \"announced\" by a \"dwarf\". The Innkeeper (played by The Governor) treats them sympathetically and humors Don Quixote, but when Quixote catches sight of Aldonza, he believes her to be the lady Dulcinea, to whom he has sworn eternal loyalty (\"Dulcinea\"). Aldonza, used to being roughly handled, is flabbergasted, then annoyed, at Quixote's strange and kind treatment of her, and is further aggravated when the Muleteers turn Quixote's tender ballad into a mocking serenade.\nMeanwhile, Antonia, Don Quixote's niece, has gone with Quixote's housekeeper to seek advice from the local priest, who realizes that the two women are more concerned with the embarrassment the knight's madness may bring than with his welfare (\"I'm Only Thinking of Him\").\nThe mock-trial's prosecutor, a cynic called \"The Duke\", is chosen by Cervantes to play Dr. Sanson Carrasco, Antonia's fiancé, a man just as cynical and self-centered as the prisoner who is playing him. Carrasco is upset at the idea of having a madman in his prospective new family but the padre cleverly convinces him that it would be a challenge worthy of his abilities to cure his prospective uncle-in-law, so he and the priest set out to bring Don Quixote back home (\"I'm Only Thinking of Him [Reprise]\").\nBack at the inn, Sancho delivers a missive from Don Quixote to Aldonza courting her favor and asking for a token. Instead, Aldonza tosses an old dishrag at Sancho, but to Don Quixote the dishrag is a silken scarf. When Aldonza asks Sancho why he follows Quixote, he can come up with no explanation other than \"I Really Like Him\". Alone, Aldonza ponders the Knight's behavior and her inability to laugh at him (\"What Do You Want of Me?\") In the courtyard, the muleteers once again taunt her with a suggestive song (\"Little Bird, Little Bird\"). Pedro makes arrangements with Aldonza for an assignation later.\nThe priest and Dr. Carrasco arrive, but cannot reason with Don Quixote, who suddenly spots a barber wearing his shaving basin on his head to ward off the sun's heat (\"The Barber's Song\"). Quixote immediately snatches the basin from the barber at sword's point, believing it to be the miraculous \"Golden Helmet of Mambrino\", which will make him invulnerable. Dr. Carrasco and the priest leave, with the priest impressed by Don Quixote's view of life and wondering if curing him is really worthwhile (\"To Each His Dulcinea\").\nMeanwhile, Quixote asks the Innkeeper to dub him knight. The innkeeper agrees, but first Quixote must stand vigil all night over his armor. Quixote asks to be guided to the \"chapel\" for his vigil, and the Innkeeper hastily concocts an excuse: the \"chapel\" is \"being repaired\". Quixote decides to keep his vigil in the courtyard. As he does so, Aldonza, on her way to her rendezvous with Pedro, finally confronts him, but Quixote gently explains why he behaves the way he does (\"The Impossible Dream\"). Pedro enters, furious at being kept waiting, and slaps Aldonza. Enraged, Don Quixote takes him and all the other muleteers on in a huge fight, (\"The Combat\"). Don Quixote has no martial skill, but by luck and determination – and with the help of Aldonza and Sancho – he prevails, and the muleteers are all knocked unconscious. But the noise has awakened the Innkeeper, who enters and kindly tells Quixote that he must leave. Quixote apologizes for the trouble but reminds the Innkeeper of his promise to dub him knight. The Innkeeper does so (\"Knight of the Woeful Countenance\").\nQuixote then announces he must try to help the muleteers. Aldonza, whom Quixote still calls Dulcinea, is shocked, but after the knight explains that the laws of chivalry demand that he succor a fallen enemy, Aldonza agrees to help them. For her efforts, she is beaten, raped, and carried off by the muleteers, who leave the inn (\"The Abduction\"). Quixote, in his small room, is blissfully ruminating over his recent victory and the new title that the innkeeper has given him – and completely unaware of what has just happened to Aldonza (\"The Impossible Dream\" – first reprise).\nAt this point, the Don Quixote play is brutally interrupted when the Inquisition enters the dungeon and drags off an unwilling prisoner to be tried. The Duke taunts Cervantes for his look of fear, and accuses him of not facing reality. This prompts a passionate defense of idealism by Cervantes.\nThe Don Quixote play resumes (\"Man of La Mancha\" – first reprise). Quixote and Sancho have left the inn and encounter a band of Gypsies (\"Moorish Dance\") who take advantage of Quixote's naiveté and proceed to steal everything they own, including Quixote's horse Rocinante and Sancho's donkey Dapple. The two are forced to return to the inn. The Innkeeper tries to keep them out but finally cannot resist letting them back in out of pity. Aldonza shows up with several bruises. Quixote swears to avenge her, but she angrily tells him off, begging him to leave her alone and flinging her real, pitiful history in his face and blaming him for allowing her a glimpse of a life she can never have. She begs him to see her as she really is but Quixote can only see her as his Dulcinea (\"Aldonza\").\nSuddenly, another knight enters. He announces himself as Don Quixote's mortal enemy, the Enchanter, this time appearing as the \"Knight of the Mirrors\". He insults Aldonza, and is promptly challenged to combat by Don Quixote. The Knight of the Mirrors and his attendants bear huge shields with mirrors on them, and as they swing them at Quixote (\"Knight of the Mirrors\"), the glare from the sunlight blinds him. The attacking Knight taunts him, forcing him to see himself as the world sees him – as a fool and a madman. Don Quixote collapses, weeping. The Knight of the Mirrors removes his own helmet – he is really Dr. Carrasco, returned with his latest plan to cure Quixote.\nCervantes announces that the story is finished at least as far as he has written it, but the prisoners are dissatisfied with the ending. They prepare to burn his manuscript when he asks for the chance to present one last scene.\nThe Governor agrees, and we are now in Alonso Quijano's bedroom, where he has fallen into a coma. Antonia, Sancho, the Housekeeper, the priest, and Carrasco are all there. Sancho tries to cheer up Quijano (\"A Little Gossip\"). Alonso Quijano eventually awakens and when questioned reveals that he is now sane, remembering his knightly career as only a vague dream. He realizes that he is now dying and asks the priest to help him make out his will. As Quijano begins to dictate, Aldonza forces her way in. She has come to visit Quixote because she has found that she can no longer bear to be anyone but Dulcinea. When he does not recognize her, she sings a reprise of \"Dulcinea\" to him and tries to help him remember the words of \"The Impossible Dream\". Suddenly, he remembers everything and rises from his bed, calling for his armor and sword so that he may set out again. (\"Man of La Mancha\" – second reprise) But it is too late – in mid-song, he suddenly cries out and falls dead. The priest sings \"The Psalm\" (Psalm 130 in Latin) for the dead. However, Aldonza now believes in him so much that, to her, Don Quixote will always live: \"A man died. He seemed a good man, but I did not know him ... Don Quixote is not dead. Believe, Sancho ... believe.\" When Sancho calls her by name, she replies, \"My name is Dulcinea.\"\nThe Inquisition enters to take Cervantes to his trial, and the prisoners, finding him not guilty, return his manuscript. It is his (as yet) unfinished novel, \"Don Quixote de la Mancha\". As Cervantes and his servant mount the staircase to go to their impending trial, the prisoners, led by the girl who played Dulcinea, sing \"The Impossible Dream\" in chorus."}