{"mid": "ManOfTaiChi", "IMDB_id": "tt2016940", "title": "Man of Tai Chi", "plot": "Tiger Chen is the sole student of Ling Kong Tai Chi style under his elderly master Yang. While Tiger excels in the physical aspects of his training, he has yet to understand its philosophical aspects, which worries Master Yang. Determined to prove the effectiveness of the style, Tiger competes in the local Wulin (武林) Competition.\nHKPD officer Sun-Jing Shi leads an investigation into Security System Alliance (SSA), a private security firm owned by the mysterious Donaka Mark. Suspecting Donaka of hosting an illegal fighting operation, Sun-Jing turns one of Donaka's fighters into a mole, but Donaka discovers and personally kills him. Without any evidence, Superintendent Wong orders the case closed, but Sun-Jing secretly continues investigating.\nWhile searching for his next fighter, Donaka sees Tiger at the Wulin Competition. Intrigued by the relative obscurity of the style, as well as Tiger's immaturity, he sends Tiger a job offer at SSA. Tired of his menial courier job, Tiger flies to Hong Kong for the job interview. The \"interview\" turns out to be a test of Tiger's combat ability, which he passes. Donaka welcomes Tiger offers him great financial rewards for joining his underground fighting ring. Tiger refuses as fighting for money would compromise his honor, and leaves.\nSoon after, land inspectors arrive and declare the Tai Chi temple structurally unsafe. They announce the plan to evict its occupants, including Master Yang, and demolish the temple for real estate development. Tiger seeks help from Qing Sha, a paralegal friend. With her help, he finds a means to save the temple through historic preservation and government protection. However, because of the temple's deteriorated condition, it requires repairs within a month's time. Desperate for money, Tiger accepts Donaka's offer.\nAfter each fight, which is a form of modern gladiatorial combat enjoyed by rich individuals, Tiger wins larger sums of money. He quits his job, buys his parents presents, and begins having the temple repaired. However, the challenges became more difficult, with the stakes raised against him, forcing Tiger to develop a style that is more efficient but also more brutal. Noticing the change in him, Master Yang warns Tiger; however, intoxicated with the new life, Tiger ignores the warning.\nIn the Wulin Competition, Tiger viciously injures his opponent, and is disqualified. When Tiger comes back to train with his master, the usual respectful spar devolves into an intense fight. Master Yang is forced to use his internal chi energies to palm-strike Tiger, reminding him that he has not yet completely mastered Tai Chi. He advises Tiger to return to the path of peace, but Tiger rejects his teachings and leaves. Tiger finds out that the authority has rejected his petition to gain historical protection for the temple. A disappointed Qing-Sha tells Tiger that the decision is in part due to his actions at the Wulin Competition, which are in contrast to the claimed honor and nobility of his temple's philosophy.\nStill enraged, Tiger demands a fight and Donaka has him face a mercenary named Uri Romanov. Using his rage, he quickly defeats Uri and almost kills him, but relents at the end. Donaka finishes off Uri. Realizing how much he has changed, Tiger declares his intention to stop participating in underground fighting. Donaka scoffs at Tiger belief that he can just quit. Tiger decides to reach out to the police, and Sun-Jing contacts him. However, unbeknownst to Tiger, Donaka had put him under constant surveillance for a long time, and knows of his every action.\nDonaka sets up a private tournament for a death match, which Tiger is to participate. Sun-Jing trails Tiger's escort, but her car is run off the road. Surviving the crash, Sun-Jing calls for assistance and discovered Superintendent Wong has been working for Donaka and disrupting investigations against him.\nAt the tournament, Donaka shows a video to his audience. Composed of surveillance footage, the video reveals how Tiger Chen has been manipulated and \"corrupted\" by Donaka, and has transformed from an innocent martial arts practitioner to a ruthless fighter. In the death match, Tiger refuses to fight his assigned opponent, and challenges Donaka instead. The tournament is interrupted by the HKPD, who storm the compound and arrest participants and audience. Donaka escapes capture.\nDonaka waits for Tiger back at his temple, and the two begin fighting. Donaka taunts Tiger, and pushes him to reveal his \"true nature\". Being formidable fighter himself, Donaka has the upper hand, but Tiger re-embraces his Tai Chi training and holds his own. Donaka pulls out a knife and stabs Tiger. Despite the wound and pressure, Tiger achieved what his master has been trying to teach him, and uses his Chi to fatally strike Donaka. A dying Donaka smiles, pleased for having pushed Tiger to become a killer.\nSome time later, Tiger repairs his relationship with his master. Sun-Jing has been promoted to Superintendent. Tiger reaches out to both Qing Sha's law firm and the real estate developers and all three parties reach a compromise. The temple will be part of a historical cultural village. Not only will the government protect the village, but tourists can come and visit to learn more about the 600-year history of the Ling Kong Temple. Finally putting that chapter of his life behind him, Tiger tells Qing-Sha that he intends to return to the city and open his own Tai Chi school to continue the legacy of the Ling Kong Tai Chi."}