{"mid": "MansfieldPark", "IMDB_id": "tt0178737", "title": "Mansfield Park", "plot": "Frances \"Fanny\" Price, at age 10, is sent from her family home to live with her uncle and aunt in the country in Northhamptonshire. It is a jolting change, from the elder sister of many, to the youngest at the estate of Sir Thomas Bertram, husband of her mother’s older sister. Her cousin Edmund finds her alone one day and helps her. She wants to write to her older brother William. Edmund provides the writing materials, the first kindness to her in this new family. Her cousins are Julia, age 12, Maria, age 13, Edmund, age 15 and Tom age 17. Her aunt is kind but her uncle frightens her with his authoritative demeanor. Fanny’s mother has another sister, Mrs Norris. She is the wife of the clergyman at Mansfield parsonage. Mrs Norris has no children and takes a great interest in her nieces and nephews. Mrs Norris keeps up a strict difference between her Bertram nieces and lowly Fanny. Sir Thomas helps the sons of the Price family find occupations as they are old enough. William joins the Navy as a midshipman not long after Fanny is at Mansfield Park. He visits them once before going to sea, and writes to his sister.\nFive years after Fanny arrives, Aunt Norris is widowed and moves into a cottage of her own. Her visits to Mansfield Park increase, as does her mistreatment of Fanny. Tom Bertram incurs a large debt and to pay it, Sir Thomas sells the living of the parsonage, freed up by the death of Uncle Norris, to clergyman Dr Grant.\nWhen Fanny is 16, Sir Thomas leaves to deal with problems on his plantation in Antigua. He takes Tom along and trusts to Aunt Norris for the others. Mrs Norris takes on the task of finding a husband for Maria and finds James Rushworth, with income of ₤12,000 a year, but weak-willed and stupid. Maria accepts his marriage proposal, subject to Sir Thomas's approval on his return. After a year in Antigua, Sir Thomas sends Tom home to Mansfield Park.\nWhen Fanny is 17, the fashionable, wealthy, and worldly Henry Crawford and his sister, Mary Crawford, arrive at the parsonage to stay with Mrs. Grant, their half-sister. The arrival of the Crawfords enlivens life in Mansfield and sparks romantic entanglements. Mary and Edmund begin to form an attachment. She is disappointed to learn that Edmund will be a clergyman. Fanny fears that Mary's charms and attractions have blinded Edmund to her flaws. On a visit to Mr Rushworth's estate Sotherton, Henry deliberately plays with the affections of both Maria and Julia. Maria believes Henry is falling in love with her and treats Mr Rushworth dismissively, provoking his jealousy. Fanny observes this while Aunt Norris, blinded by her own self-importance and Edmund, infatuated with Mary, fail to perceive the various flirtations.\nEncouraged by Tom and his friend Mr Yates, the young people decide to put on an amateur performance of the play Lovers' Vows. Edmund objects, believing Sir Thomas would disapprove and feeling that the subject matter of the play is inappropriate for his sisters. Edmund reluctantly agrees to take on the role of Anhalt, the lover of the character played by Mary Crawford. The play provides a pretext for Henry and Maria to flirt in public. Fanny observes this, but again Aunt Norris, caught up in the excitement of staging a play, does not.\nSir Thomas arrives home earlier than expected, while all are in the midst of rehearsal. He stops the theatricals. Henry, from whom Maria had imminently expected a marriage proposal, instead takes his leave, and she is not pleased. She goes ahead with marriage to Rushworth, with her father's permission. They honeymoon in Brighton and then settle in London, taking Julia with them. Fanny's improved appearance and gentle disposition endear her to Sir Thomas. With Maria and Julia gone, Fanny and Mary Crawford visit often.\nHenry returns to Mansfield parsonage, intending to entertain himself by making Fanny fall in love with him. He does not succeed but falls in love with Fanny himself. To further his suit, he uses his family connections to help Fanny's brother William gain promotion as a naval lieutenant, to her great joy and gratitude. When Henry proposes marriage, Fanny however, rejects him out of hand. Sir Thomas is astonished at her refusal. He reproaches her, accusing her of ingratitude, and encourages Henry to persevere.\nTo bring Fanny to her senses, Sir Thomas sends her for a visit to her parents in Portsmouth, hoping that the contrast will awaken her to the value of Henry's offer. She sets off with William and sees him in his first berth as a commissioned officer. At Portsmouth, she develops a firm bond with her younger sister, Susan, but is taken aback by the contrast between her dissolute surroundings — noise, chaos, unpalatable food, crude conversation, and filth everywhere — and the harmonious environment at Mansfield. Henry visits her there. Although Fanny still refuses him, her attitude begins to soften, particularly as Edmund and Mary seem to be moving toward an engagement.\nHenry leaves for London, and shortly afterward, Fanny learns that scandal has enveloped him and Maria. The two happened to meet at a party and rekindle their flirtation, which leads to an affair. An indiscreet servant makes the affair public and the story is in the newspapers. Maria runs away with Henry. Mr Rushworth sues Maria for divorce, and the proud Bertram family is devastated. At the same time, Tom has fallen gravely ill as a result of his dissolute lifestyle, and Julia, fearing her father's anger for her part in concealing Maria's affair, has eloped with Tom's friend, Mr Yates.\nEdmund takes Fanny back to Mansfield Park along with Susan. A repentant Sir Thomas now realises that Fanny was right to reject Henry's proposal all-along, and now regards her as his own daughter. During an emotional meeting with Mary Crawford, Edmund discovers that Mary does not condemn Henry and Maria's adultery, and regrets only that it was discovered. Her view is to cover it up, and even places blame on Fanny for failing to accept Henry right away. Edmund is devastated to discover her true principles (or lack-there-of). He breaks off the relationship and returns to Mansfield Park.\nEdmund slowly gets over his love for Mary. Then he comes to realise how important Fanny is to him. He declares his love for her, and they are married and eventually move to Mansfield parsonage, in the circle of those they love best. Tom recovers from his illness, a steadier and better man for it, and Julia's husband, Mr Yates, proves to be a respectable husband. Henry Crawford refuses to marry Maria. Her shame gives her no other options, so her father sets her up in a house with Aunt Norris (for the role she had played as an ineffectual guardian and role model), the both of them out of his sight. Mary Crawford is forced to move in with her half-sister, Mrs. Grant, hoping for a husband."}