{"mid": "MargaritaWithAStraw", "IMDB_id": "tt2929690", "title": "Margarita with a Straw", "plot": "Laila (Kalki Koechelin) is a teenager with cerebral palsy who uses a wheelchair. She is a student at Delhi University and an aspiring writer who writes lyrics and creates electronic sounds for an indie band at the university. Laila falls for the lead singer of the college band and is heartbroken when she is rejected.\nShe soon overcomes this phase, when she gets a scholarship for a semester at New York University and moves there with her traditional Maharashtrian mother Shubhangini(Revathi). Living in Manhattan, she meets an attractive young man named Jared (William Moseley) in her creative writing class, who is assigned to help her in typing. She also meets the fiery young activist Khanum (Sayani Gupta), a blind girl of a Pakistani Bangladeshi descent, whom she later falls in love with. As she embarks on a journey of sexual discovery, she figures out she is bisexual, as she feels attracted to men like Jared while also being with Khanum. She has sex with Jared and she doesn't tell Khanum. Laila's mother, believing the two are like best friends and oblivious to the fact that Khanum is her daughter's lover, invites her to Delhi to spend the winter break with the family. It is during that time that Laila finds the courage to tell her mother about her sexuality and her relationship with Khanum, which her mother initially disapproves. She also tells Khanum that she had sex with Jared and asks her to forgive her. Khanum thinks that she was being used by Laila and leaves her.\nAfter a short while Laila's mother falls sick and she learns that her mother had fourth stage colon cancer which has fallen into relapse after previous treatments. Later Laila and her mother patch up and come to terms with each other. After her mother dies Laila plays a recorded speech at her mother's funeral telling how much she loved her and how she was the only one who ever understood her.\nThe story ends with Laila going on a date, with herself, signifying that she now has taken control of her life and doesn't need anyone else to love and care for her. The movie revolves around very delicate aspects of this modern life and teaching society how its better to adhere and accept the changing rituals."}