{"mid": "MariaLabo", "IMDB_id": "tt5180118", "title": "Maria Labo", "plot": "The film revolves on Maria (Kate Brios) a loving and dutiful life wife to her husband, Ermin, a police officer (Jestoni Alarcon) with whom she has two children named Pablo (Miggs Cuaderno) and Rosalinda (Lenlen Frial). Facing financial problems, Maria was convinced to become an Overseas Filipino Worker after she learned that her high school friend Emily (Sam Pinto) applied to become an overseas worker. Ermin was hesitant with his wife's plans initially but eventually gave his consent. Maria then went to Dubai in the United Arab Emirates to work as a domestic worker.\nIn Dubai, Maria befriends Nanay Leng a fellow Filipino who is also working in the emirate. In one instance in the streets after buying groceries for her employer she was raped on a van and was later found wandering. Maria was brought to a hospital by people who found her loitering around and at the hospital she was recommended to be brought back to the Philippines. While hospitalized, her Filipino friend passes a curse to Maria. The cursed turned to Maria into an aswang.\nIn the Philippines, she was transferred to her province's provincial hospital, where the medical personnel found something wrong with her. They conclude that she has amnesia and took note of her aggressive behavior. Ermin came to bring her back to their home, but a hospital employee discouraged him due to their findings and said that his spouse might not even recognize him. Ermin eventually convinced the hospital to take her back to their home saying that it might bring her memories back.\nBack at the Maria's family residence, Maria seemingly is back to normal. This is until Maria threatened her children with a knife who were running around their house before she pointed the knife. Shortly, Ermin became aware of the incident with Maria claiming that the action was not within her control. Alone, her aswang persona begins to take control over her and one day she killed her children and cooked them. When Ermin found out what she did, Maria was shot repeatedly by her husband but escaped outside their home.\nErmin then buries the remains of her children. Shortly, he witnessed a remorseful Maria crying nearby whose aswang persona then takes over once again. Maria receives a wound on her face after her husband hacked her face with a bolo knife and escapes once again.\nThen rumors of an aswang causing terror throughout the town spread. Ermin tried to consult an albularyo who said that there is nothing that can be done to return Maria back to normal. The police then pursues the aswang that is said to have been causing problems to the town. After some encounters, Maria was killed. The film ends with an embalmer who is working on Maria's body. The embalmer then founds out that Maria's supposed corpse was nowhere to be found, only to find her to be still alive."}