{"mid": "Marlowe", "IMDB_id": "tt0064638", "title": "Marlowe", "plot": "Los Angeles private eye Philip Marlowe is hired by a Kansas woman named Orfamay Quest, who desperately wants him to find her brother Orrin. As Marlowe follows Orrin's trail to a hotel, he meets the manager, Hayden Glossen, and a guest named Grant W. Hicks, who deny any knowledge of Orrin's whereabouts. After Marlowe has investigated Orrin's former hotel room, he finds Glossen murdered with an ice pick and a page missing from the register book. Soon afterwards, Marlowe receives a call from Hicks, who nervously implores him to hold onto something for a day. When Marlowe arrives at his location, he finds Hicks with an ice pick buried in his neck, and a masked woman who manages to escape; Hicks is also revealed to be a former mob runner. With these occurrences, Marlowe begins to suspect that there is more to this case than a mere missing person.\nMarlowe traces the few clues he could find to a movie star, Mavis Wald, and her friend, exotic dancer Dolores (\"with an O\") Gonzales. He accuses Wald that she murdered Hicks because he blackmailed her with a set of photographs showing her in the midst of a rendezvous with mobster boss Sonny Steelgrave. Steelgrave sends Kung Fu expert Winslow Wong to warn Marlowe off the case, while Police Lieutenant French also cautions the detective to stay out of the police's way. When Marlowe refuses to relent and even provokes Steelgrave by taking his girlfriend to the mobster's restaurant, Steelgrave instructs Wong to either coerce him into giving up for one last time, or else kill him. Luring Wong to the edge of the restaurant's roof, Marlowe taunts him into attempting to jump-kick him, thus causing Wong to accidentally leap off the building to his death.\nMarlowe visits Wald's advertisement agent Crowell and, after much persuasion, gains his cooperation. With his backing, he manages to get Wald to reveal that neither she nor Sonny were responsible for Hick's murder, suggesting a third party behind the blackmailing, but she refuses to tell him more details. Then he backtracks Orrin's trail to child psychologist Dr. Vincent Lagardie, who denies any knowledge of him. However, as Marlowe begins to confront him with his suspicions that he, Orrin and the murder victims are the perpetrators in the blackmail case, Lagardie knocks him out with a drugged cigarette and flees.\nWhen Marlowe comes around during the night and searches the clinic, he stumbles upon a mortally wounded Orrin attacking him with an ice pick and a picture, showing him that Wald, Orrin and Orfamay are actually siblings and that he was the blackmailer and murderer, though in league with another party. After returning to his office and destroying the pictures and their negatives, he gets a surprise visit from Dolores, who takes him to Steelgrave's mansion, where he finds Steelgrave dead and Wald next to him. He quickly finds, however, that Wald did not kill him but was lured into a trap; he therefore sets up things to make them look as if Steelgrave committed suicide, in order to protect Wald's reputation. A subsequent harsh reunion between Wald and Orfamay reveals that Orfamay knew about Orrin's scheme and wanted to stop him for his own safety - including hiring Marlowe to find him -, but she didn't commit any of the murders.\nWith Wald's secret safe, Marlowe meets Dolores at the club where she is working. Having pieced all the clues together, he confronts her with his knowledge that she was Orrin's organizer and partner in crime because she was in love with Steelgrave and wanted to force Wald away from him. Hicks and Glossen were murdered by Orrin because Hicks wanted to take over the scheme for his own profit, while the drug-addicted Glossen would have made a dangerous witness. Dolores confesses but remains defiant; but in the midst of her performance she is shot by Lagardie, who then kills himself. Just before the police arrives, Marlowe quietly leaves and drives away into the night."}