{"mid": "Marmoulak", "IMDB_id": "tt0416960", "title": "Marmoulak", "plot": "Reza Mesghaly, known as Reza the Lizard, is a thief known in criminal circles for his ability to bare-handedly climb all walls (from which he derives his name, \"the Lizard\", or \"Marmoulak\" in Persian). At the very beginning of the film, he is arrested and charged with armed robbery, a crime that as revealed near the ending of the film, he did not commit. Nonetheless, he is sentenced to life in prison, and is met at the jailhouse by a strict warden, who says that his intention is to \"make a person out of prisoners\"; thus they will be led into heaven; \"by force,\" if necessary.\nReza is very restless at the prison, to the point where he steals medicine from the infirmary with and commits suicide. He is unable to go through with the act, however, and is stopped by his cellmate, who in the course of fighting with Reza causes the medicine bottle to break and cut open his arm. Reza is sent to the hospital to recover, where he meets a cleric, also staying in the hospital, also by the name of Reza. During his stay, the two become friends, and Reza Marmoulak overcomes his dislike of the Islamic clergy to accept the mullah after he is told a profound statement which stays with him for the rest of the film - \"There are as many ways to reach God as there are people in the world.\"\nBefore he is discharged back into the prison, Reza Marmoulak steals the cleric's clothing, and impersonating him, is able to escape the prison and contact one of his friends, who tells him to go to a small border village and contact a man who will give him a fake passport to cross the border with. In the meantime, the warden is informed that Reza has escaped, and seeing this as a personal blemish on his record, pursues the criminal to the border village. Arriving by train at the village, Reza is taken in by the villagers who mistake him as the new mullah who was supposed to join their mosque.\nThe remainder of the film documents Reza's attempts to get in contact with the criminal underworld to obtain his false passport, while the police pursue him at the behest of the warden; and all along Reza tries to avoid tipping off the villagers to his actions. In the course of this, he becomes something of a hero in the eyes of the villagers, who misinterpret his attempts to track down his false passport as his visiting the homes of poor people and giving them charity. These actions continue to draw the praise of the villagers, convincing those who have abandoned faith in their religion to come to the mosque once again to hear the sermons of Reza Marmoulak, most of which are derived from his brief contact with the cleric in the prison's hospital.\nThrough this several speeches it is that Reza eventually yet gradually comes to an understanding of the phrase the real Mullah told him; and how all men will always own a path, bringing them to God.\nAt the end of the film, Reza is finally tracked down by the warden, and on the night of a religious celebration at the mosque, he is arrested, without the villagers noticing. He hands over his robes to a small boy who had watched him over the course of the entire film, possibly the only person in the village who had guessed his identity all along, and goes peacefully with the warden and the police officer back to the prison in Tehran. As they are entering the car, the officer attempts to handcuff Reza, an attempt stopped by the warden and followed by his famous line, \"Not necessary any more\".\nThe film ends with a shot inside the mosque, now being finally full of eager prayers because of Reza. as the police car leaves for Tehran, the prayers look at it; probably wondering about the petty thief in it, while waiting for the great Mullah. This frame is frozen, and the same words spoken by the mullah in the hospital and the most important message of the film are heard for one last time; this time expressing Reza's destiny.\n\"There are as many ways to reach God as there are people in the world.\""}