{"mid": "Marooned", "IMDB_id": "tt0064639", "title": "Marooned", "plot": "Images of natural scenery. Then cut to the launch of a space rocket. Three astronauts go in that rocket: Jim Pruett (Richard Crenna), Clayton Stone (James Franciscus) and Buzz Lloyd (Gene Hackman). Back at base, Charles Keith (Gregory Peck) wonders if after eight months in space they could perform the easiest manual tasks. Once in space the astronauts take off their helmets. They lose backup for some reason. Keith decides to bring them down. A journalist (Vincent Van Lynn) explains about the retro-fire and their return. The mission Director (George Gaynes) decides that they need to use the primary thrust, because the secondary is damaged. The communications officer (Tom Stewart) tells the astronauts that. They use the retro-fire.There's a tropical storm and the weather specialist (George Smith) says it'll complicate things. Keith wants to give the mission for lost, and gives an officer 48 hours to rescue the astronauts. They only have another aircraft which has never been tasted and an inexperienced crew. The rules say there should be no rescue mission.Oxygen is scarce, and that's their main concern. Keith tells them not to do anything stupid... like trying to repair the engine!!! The astronauts take sleeping pills because the less movement and anxiety they have, the less oxygen they'll use. Buzz hesitates to have his.The three wives arrive to say goodbye to the astronauts. Celia Pruett (Lee Grant) can't say that she loves him, although he says so. She talks about insurance and the house. For goodbye, they stayed silent. She caresses the screen. Teresa Stone (Nancy Novack) talks about his mission and a project she wants to do. Betty Lloyd (Mariette Hartley) tries to console Buzz, who becomes hysterical. She starts reading a letter she's written to the President (John Forsythe). He interrupts her and says everybody blames him because everything's falling apart.The launch of the rescue mission can't be accomplished because of the bad weather. Keith speaks to the media. Journalists like Hardy (Mauritz Hugo) and Walter Brooke ask about another possible plan, and Keith says there aren't. An PR officer (Scott Brady) explains it.Another plan is thought of. The computer technician (Bruce Rhodewalt) is already working on it. The astronauts are dizzy. The XRV has already been launched. It's insinuated that they should kill one of them so that the other two can survive. Before killing anyone, they'll try to mend the engine.[A funny moment in MST3k 401 when the robots decide that Joel will be the one to die in a case like that on the film because they are cute robots which don't need oxygen. Joel is left feeling lonely and depressed.]Jim's suit gets torn and he dies. Keith tells the news to Celia. A VIP (George R. Robertson) is tense. Rescue is close, so Buzz and Clayton decide to go for it and open the hatch door, although Huston disagrees. Clayton pushes Buzz towards rescue, but he seems to pass it; and Clayton falls dizzily back inside the rocket.Ted Dougherty (David Janssen) rescues Buzz. Another astronauts gives oxygen to Clayton. He and Buzz have survived.--written by KrystelClaire"}