{"mid": "Marty", "IMDB_id": "tt0048356", "title": "Marty", "plot": "Marty Piletti (Ernest Borgnine) is an Italian American butcher who lives in The Bronx with his mother (Esther Minciotti). Unmarried at 34, the good-natured but socially awkward Marty faces constant badgering from family and friends to settle down, pointing out that all his brothers and sisters are already married with children. Not averse to marriage but disheartened by his lack of prospects, Marty has reluctantly resigned himself to bachelorhood.\nAfter being harassed by his mother into going to the Stardust Ballroom one Saturday night, Marty connects with Clara (Betsy Blair), a plain schoolteacher who is quietly weeping on the roof after being callously abandoned at the ballroom by her blind date. They spend the evening together dancing, walking the busy streets, and talking in a diner. Marty eagerly spills out his life story and ambitions, and they encourage each other. He brings Clara to his house, and they awkwardly express their mutual attraction, shortly before his mother returns. Marty takes her home by bus, promising to call her at 2:30 the next afternoon, after Mass. Overjoyed, he punches the bus stop sign and weaves between the cars, looking for a cab.\nMeanwhile, his cranky, busybody widowed Aunt Catherine (Augusta Ciolli) moves in to live with Marty and his mother. She warns his mother that Marty will soon marry and cast her aside. Fearing that Marty's romance could spell her abandonment, his mother belittles Clara. Marty's friends, with an undercurrent of envy, deride Clara for her plainness and try to convince him to forget her and to remain with them, unmarried, in their fading youth. Harangued into submission by the pull of his friends, Marty doesn't call Clara.\nThat night, back in the same lonely rut, Marty realizes that he is giving up a woman whom he not only likes, but who makes him happy. Over the objections of his friends, he dashes to a phone booth to call Clara, who is disconsolately watching television with her parents. When his friend asks what he's doing, Marty bursts out saying:\nYou don't like her, my mother don't like her, she's a dog and I'm a fat, ugly man! Well, all I know is I had a good time last night! I'm gonna have a good time tonight! If we have enough good times together, I'm gonna get down on my knees and I'm gonna beg that girl to marry me! If we make a party on New Year's, I got a date for that party. You don't like her? That's too bad!\nMarty closes the phone booth's door when Clara answers the phone. In the last line of the film, he tentatively says \"Hello... Hello, Clara?\"."}