{"mid": "MarthaMarcyMayMarlene", "IMDB_id": "tt1441326", "title": "Martha Marcy May Marlene", "plot": "Early one morning, Martha flees from an abusive cult on a farm in the Catskill Mountains led by their enigmatic leader, Patrick and his subordinates Watts and Katie. After escaping pursuers, Martha is caught at a diner by Watts, who attempts to take her back, but she refuses and not wanting to cause a scene, Watts leaves while staring one last time at her, unsettling Martha. Martha worriedly phones her sister Lucy, eventually asking for her help. Lucy picks up Martha at a nearby bus station and takes her to a lake house in Connecticut which Lucy shares with her husband, Ted. Martha only tells Lucy that she had been living with her boyfriend in the Catskills and broke up due to him lying, leaving out all mention of the cult.\nMartha integrates her life with Ted and Lucy, but begins to show odd behavior while out at a public lake by stripping naked and casually going for a swim before Lucy forces her to get out, much to Ted's amusement. Martha, Lucy, and Ted go boating on the lake where Lucy confesses that she in essence abandoned Martha when she went to college and is attempting to reconnect with her.\nIn a flashback, Martha is seen meeting Patrick for the first time. He declares that she \"looks like a Marcy May.\" It is explained to Martha that the group is working toward being self-sufficient on their farm and is told to open herself up and be a part of things as she is closed up due to her family abandoning her. Later, Martha awakens from being drugged in the middle of being raped by Patrick, and afterward Katie, the seemingly alpha female of the cult assures her that it is good what happened which is reaffirmed by her close personal friend Zoe (Louisa Krause). Later, Patrick sings Jackson C. Frank's song \"Marcy's Song\" in front of the group, and now addresses Martha as Marcy May. Martha begins a relationship with Patrick.\nAfter Martha is left with Ted for a day as Lucy goes to \"the city\", Ted reveals to Martha that he and Lucy are attempting to have a baby, to Martha's amusement as she doesn't believe Lucy has any motherly instincts. The discussion slowly turns sour when Ted berates Martha for not contacting anyone in the family for two years where Martha casually shakes it off and goes swimming and another flashback reveals that the cult always went swimming naked at a waterfall. Martha begins to show signs of paranoia that the cult followed her and is watching her, which is coupled with Martha constantly sleeping to Ted and Lucy's confusion. Martha is also staying awake at night listening for signs of the cult. Martha walks into Lucy and Ted's room while they are having sex and gets into bed with them. A horrified Lucy explains that this is not \"normal\" behavior, and Ted is furious about the incident. Martha didn't think she did anything wrong as it was simply a \"big bed\". Ted berates Lucy for enabling Martha and begins to show a lack of patience for Martha's behavior while Lucy informs Ted that she wants to be there for Martha.\nIn another flashback to her time on the farm, at Katie's urging Martha \"handles\" a new girl, Sarah, to life on the farm. She explains that they all help out with Katie and Patrick's babies. When Sarah comments that all the infants in the community are boys, Martha ominously replies that \"he only has boys\". Katie helps Martha to prepare Sarah for her \"special night\" with Patrick, presumably the same ritual of rape that Martha experienced. The preparation includes drinking a drugged drink. After giving the drink to Sarah and putting Sarah into the same room Martha was raped in, Martha waits outside the room to give the same speech Katie gave Martha when she was first raped.\nDuring another flashback while teaching Martha to shoot, Patrick asks her to kill a sick cat to prove that she is \"a teacher and a leader,\" but she refuses. He then asks her to shoot another cult member; she refuses to do this as well, which angers Patrick, who then instructs Zoe to rape Martha, who proceeds to do so. One night, Martha, Watts, and Zoe break into a house and steal valuables to sell to fund the farm. In another scene, Martha and several cult members have sex in one room while Patrick watches from a stairway.\nIn the present, while having dinner, Martha and Ted get into an argument about how to live life where Martha repeats the cult's philosophy that they should just \"live\" rejecting Ted's urging that she needs to start thinking about a career to provide necessities in life and berates her for being a freeloader and lacking any values for dropping off the face of the earth for two years which ends with Martha lashing out exclaiming he doesn't \"knowing anything about it\" and then leaves the table. Martha attempts to call the cult one night, but loses her nerve when the girl on the other end deduces it is Martha and calls her Marcy. Martha hangs up and disconnects the phone when it rings again. Martha's paranoia takes a turn for the worst at Ted and Lucy's party, where Martha has a panic attack when she claims she recognizes the bartender (as a cult member) and begins to create a scene and breaks down and has to be sedated by Ted and Lucy. Ted suggests they seek help for Martha, to Lucy's agreement, but goes further by telling Lucy that she needs to be moved to a mental health facility; Lucy refuses to send her away, with both showing varying degree signs of contempt for Martha's behavior.\nIn a flashback, Martha, Watts, and Zoe break into another house but are found by the owner. They start to leave, but Patrick appears and confronts the owner, questioning whether he will call the police. The man orders the group out and promises not to call the police, but Katie, who was hiding, stabs him in the back. They quickly leave, with Martha clearly in shock. Martha is later shown answering the phone, using the name \"Marlene Lewis\" — a name that all the women use on the phone to conceal their identities, and follows an answering procedure on the wall next to the phone that includes asking the name of the girl on the other end three times. Watts eventually appears and agrees to pick the girl up in the next few days. Martha continues to struggle in the aftermath of the attack, and Patrick tries to convince her that death is actually a good thing per the cult's philosophy as \"death is love\". Furthermore, Zoe reaffirms the cult's philosophy to Martha as she attempts to confide that the stabbing has troubled Martha. It is later shown Martha being over worked by the cult and is later hit by Katie with a utensil for eating when she's not supposed to (the cult only eats once a day where the men eat first followed by all the women). Martha has a breakdown in the bathroom and Zoe betrays Martha to open the door for Patrick who physically assaults her and berates her for not learning anything. Martha apologizes and obtains Patrick's forgiveness for her lack of adhering to the cult's philosophy.\nAfter a nightmare at the lake house, Martha has another panic attack and kicks Ted, who was trying to help her in her confusion, down the stairs. This leads Lucy to confront Martha, but Martha refuses to explain what happened to her. Lucy informs Martha that she needs \"help\", which Martha deduces as being sent away, which Lucy affirms and states she doesn't feel safe with Martha around granted they are trying to start a family, which leads to Martha coldly telling Lucy that she will be a \"terrible mother.\" Lucy sobs, then makes Martha admit she has no money, but informs her she will pay for her treatment.\nThe next morning, Martha goes swimming in the lake and sees a man watching her from the opposite shore. Ted and Lucy then drive Martha to her treatment facility when the same man from the lake runs in front of Ted's car. He gets into a car parked on the side of the road and appears to follow them. Martha nervously looks back as they drive on, but doesn't say anything."}