{"mid": "MaryShelleysFrankenstein", "IMDB_id": "tt0109836", "title": "Mary Shelley's Frankenstein", "plot": "In 1794 Captain Walton leads a troubled expedition to reach the North Pole. While their ship is trapped in the ice of the Arctic Sea, the crew discovers a man, Victor Frankenstein, traveling across the Arctic on his own. Victor proceeds to tell Walton and the crew his life story.\nVictor grows up in Geneva with his adopted sister, Elizabeth Lavenza, who will become the love of his life. Before he leaves for the university at Ingolstadt, Victor's mother dies giving birth to his brother William. Victor vows on his mother's grave that he will find a way to conquer death.\nAt university, Victor's interest in the works of alchemists make him unpopular with professors. He finds a friend in Henry Clerval and a mentor in Professor Waldman. Victor comes to believe that the only way to cheat death is to create life. Professor Waldman warns Victor not to follow through with his theory; he tested it once, but ended his experiments because they resulted in an \"abomination.\"\nWhile performing vaccinations, Waldman is murdered by a patient, who is later hanged in the village square. Victor breaks into Waldman's laboratory, takes his notes, and begins to work on a creation. Victor gives his creature dead body parts from various sources, including the body of Waldman's murderer and Waldman's own brain. He is so obsessed with his work that not even a cholera outbreak tears him from it. Victor finally gives his creation life, but he recoils from it in horror and renounces his experiments.\nThe creature escapes, running off to the wilderness with Victor's coat which contains Victor's journal. He spends months living in a family's barn without their knowledge, gradually learning to read and speak. He attempts to earn the family's trust by anonymously helping them with their failing farm, and eventually converses with the patriarch, an elderly blind man, after aiding him and his granddaughter against violent debt collectors. But when the blind man's family returns, they mistakenly think the creature committed the assaults against the patriarch and granddaughter, and chase the creature away and abandon the cottage. The creature reads Victor's journal, learning of the circumstances of his creation. He vows revenge on his creator.\nVictor, who believes the creature has died of cholera, returns to Geneva to marry Elizabeth. He finds his younger brother William has been murdered. Justine, a servant of the Frankenstein household, is framed for the crime by the creature and hanged by a lynch mob.\nVictor is approached by his creation demanding that Victor make a companion for him, promising that if Victor does, he will disappear with his mate. Victor begins gathering the tools he used to create life, but when the creature insists he use Justine's body to make the companion, Victor breaks his promise and the creature vows revenge.\nVictor and Elizabeth are married. Shortly after, unknown to them, the creature silently kills Baron Frankenstein in his own bedroom. Victor takes every precaution to defend his wife on their honeymoon, but the creature gains access to their bedroom and tears out Elizabeth's heart, killing her.\nMaddened with grief beyond measure, Victor races home to bring Elizabeth back to life. He stitches Elizabeth's head onto Justine's fully intact body, and she awakes as a re-animated creature. The two are briefly and happily reunited until the creature appears. Victor and the monster fight for Elizabeth's affections, but Elizabeth, horrified by what she has become, commits suicide by setting herself on fire, burning the mansion to the ground.\nThe story returns to the Arctic Circle. Victor tells Walton that he has been pursuing his creation for months to kill him. Soon after relating his story, Victor dies from pneumonia. Walton discovers the creature weeping over Victor's body. The crew prepares a funeral pyre for Victor, but the ceremony is interrupted when the ice around the ship cracks. Walton invites the creature to stay with the ship, but the creature insists on remaining with the pyre. He takes the torch and burns himself alive with Victor's body. Walton, having seen the consequences of Victor's obsession, puts his own obsession aside and orders the ship to return home."}