{"mid": "MaryQueenOfScots", "IMDB_id": "tt0067402", "title": "Mary, Queen of Scots", "plot": "Mary, Queen of Scots, awaits her execution by order of Queen Elizabeth I of England. Mary composes a letter to Elizabeth, to whom she feels a close kinship as her cousin and a fellow female monarch. Through flashback, Mary narrates to Elizabeth the events of her life, starting from her birth in Scotland to the French Mary of Guise, who sends her to France as a child for her protection.\nMary is raised in French court, where she had for companions her Scottish ladies Mary Beaton, Mary Seton, Mary Fleming and Mary Livingston, as well as the Italian musician David Rizzio. Upon reaching adulthood Mary is married to the Dauphin, Francis, who becomes King of France when his father dies. News arrives that Queen Mary I of England has died and her sister, Elizabeth, has become Queen despite her official status as a bastard. Mary is aware of her own legitimate claim to the English throne; although she writes to Elizabeth promising not to challenge her, she insists on using the English coat of arms and the title \"Queen of France, Scotland and England\".\nAfter Francis's early death, Mary returns to Scotland with her ladies and Rizzio. There, she is treated with suspicion and skepticism by her half-brother, Lord Moray, the Protestant clergyman John Knox and other Scottish lords. Mary struggles to ingratiate herself to them, but ends up isolating herself further by relying on Rizzio for political advice, marrying Englishman Darnley without the Lords' consent, and supporting the controversial Scottish border Lord Bothwell. Mary's love for Darnley fades when she learns of his extremism in pursuing the English throne; Mary has strong affection for Elizabeth, and wants to be her heir instead of usurping her.\nDarnley conspires with Moray and the Scottish Lords to murder Rizzio in cold blood in front of a heavily pregnant Mary. Afterwards Mary begins to see visions of Rizzio, who warns her of worse things to come. Mary gives birth to her and Darnley's heir, James, but she is effectively separated from Darnley and has a new passion for Bothwell, with whom she has an affair. Soon afterward Darnley is killed in a gunpowder explosion, and Mary marries Bothwell because she is pregnant with his child. The marriage is heavily protested, with the Scottish Lords taking up arms against Mary and Bothwell. Eventually Mary and Bothwell are outnumbered, and Bothwell flees from Scotland while Mary travels to England in the hopes of getting protection from Elizabeth. Instead, Elizabeth has Mary incarcerated, and decades later Mary is executed by order of the cousin she has never met."}