{"mid": "MaryPoppins", "IMDB_id": "tt0058331", "title": "Mary Poppins", "plot": "In Edwardian London, 1910, Bert entertains a crowd when he senses a change in the wind. Afterwards, he directly addresses the audience and gives them a tour of Cherry Tree Lane, stopping outside the home of the Banks family. George Banks returns home from his job at the bank to learn from Winifred that Katie Nanna has left their service after Jane and Michael ran away \"again\". They are returned shortly after by the local constable, who reveals the children were chasing a lost kite. The children ask their father to help build a better kite, but he dismisses them. Taking it upon himself to hire a nanny, George advertises for a stern, no-nonsense nanny. Instead, Jane and Michael present their own advertisement for a kinder, sweeter nanny, but when George rips up the letter and throws the scraps in the fireplace, the remains of the advertisement magically float up and out into the air.\nThe next day, a queue of elderly, sour-faced nannies appear outside. However, a strong gust of wind blows the nannies away, and Jane and Michael witness a young nanny descend from the sky using her umbrella. Presenting herself to George, Mary Poppins calmly produces the children’s now restored advertisement and agrees with its requests, but promises the astonished banker she will be firm with his children. As George puzzles over the return of the advertisement, Mary is forced to hire herself and meets the children, then helps the children to tidy their nursery through song, before heading out for a walk in the park.\nOutside, they meet Bert who now works as a screever. Mary uses her magic to transport the group into one of the drawings. While the children ride on a nearby carousel, Mary Poppins and Bert go on a leisurely stroll and are served tea by a quartet of penguin waiters. Mary enchants the carousel horses and participates in a horse race which she wins. While being asked to describe her victory, Mary announces the nonsense word \"Supercalifragilisticexpialidocious\". However, the outing is ruined when a thunderstorm demolishes Bert's drawings, returning the group back to London. On another outing, the four meet Uncle Albert who has floated up in the air due to his uncontrollable laughter; they join him for a tea party on the ceiling, telling jokes.\nGeorge becomes increasingly annoyed by the cheery atmosphere of his family and threatens to fire Mary. Instead, Mary inverts his attempt by convincing him to take the children to the bank for a day. George takes Jane and Michael to the bank, where they meet Mr. Dawes Sr. and his son. Dawes aggressively attempts to have Michael invest his tuppence in the bank, snatching the money from him. Michael demands it back, causing other customers to misinterpret and all demand their money back, causing a bank run.\nJane and Michael flee the bank, getting lost in the East End until they run into Bert, who is now a chimney sweep, then escorts them home. The three and Mary venture onto the rooftops where they have a song-and-dance number with other chimney sweeps until George returns home, receives a phone call from his employers and speaks with Bert who tells him he should spend more time with his children before they grow up. Jane and Michael give their father Michael’s tuppence in the hope to make amends.\nGeorge walks through London to the bank, where he is given a humiliating cashiering and is dismissed. Looking to the tuppence for words, he raucously blurts out \"Supercalifragilisticexpialidocious!\", tells one of Uncle Albert's jokes, and happily heads home. Dawes mulls over the joke, but finally \"gets\" it, and floats up into the air, laughing.\nThe next day, the wind changes, which means Mary must leave. A happier George is found at home, having fixed his children’s kite, and takes the family out to fly it. In the park, the Banks meet Mr. Dawes Jr, who reveals his father died happily laughing from the joke and re-employs George as a junior partner. With her work done, Mary flies away with Bert bidding her farewell, telling her not to stay away too long as the film ends."}