{"mid": "MaryReilly", "IMDB_id": "tt0117002", "title": "Mary Reilly", "plot": "Mary Reilly was put into service by her mother at age 12 in order to avoid contact with her tormenting father. She works in the home of Dr. Henry Jekyll, who has a laboratory out back separate from the house. A rapport develops between her and the doctor. Mr. Poole, the head of the household staff, distrusts their familiarity but the doctor calls on her for help particularly when the doctor hires an assistant who is to work in the laboratory.\nMary gets locked in the laboratory one night when she spies on the new assistant, Mr. Edward Hyde, what is going on in the laboratory and hides but Mr. Hyde is not as disapproving as she imagines he might be and lets her out.\nBy Mary's second visit to delivery another letter from the doctor to Mrs. Faraday, a madam, Mary learns that a bloody mess at the whorehouse was caused by Mr. Hyde.\nMary finally meets the enigmatic Edward Hyde and finds herself drawn towards his passionate nature. However, she is also upset when he reveals that he knows intimate details about her conversations with the Doctor. In turn, Mary challenges the Doctor about this and the doctor claims that he made notes about their conversations out of habit: thus, Hyde looked at the Doctor's notes without his knowledge. The next day, when Mary delivers Jekyll's breakfast, he asks her to accompany Hyde on an errand. They visit the slaughterhouse yard to collect organs for the doctor's research. Upon their return, Hyde torments Mary, asking if she is aware of how much Jekyll longs to touch her.\nWhile fetching tea for Hyde, she answers the door to find Mrs. Farraday, who insists on seeing Jekyll. Jekyll is not pleased to see Farraday, who demands more money for her continued silence. Mary leaves them alone, but while watering the garden, she notices the lights in the lab go out. Investigating, she discovers a small pool of blood on the theater table. She does not see Hyde, who is hidden and has killed Mrs Farraday.\nMary is told by letter the passing of her mother and returns home to plan her funeral. While returning to the home of the doctor, Mr. Hyde grabs Mary in the alley while he is pursued by, but hidden from, the mounted police. The police eventually question Mary about the death of Sir Danvers Carew when she returns to the home of the doctor. Mary denies having seen Hyde that day and Hyde eventually warns Mary that she should not have lied to the police. He reveals that he has dismissed Hyde and bribed him to disappear.\nDays later, Mary is surprised to discover Hyde in the doctor's bed. She tries to raise the alarm, but he stops her. Hyde then reveals to her his true nature. He explains that the doctor injects himself with a serum; a cure for his depression, and that Hyde is the resulting cure. He in turn injects the 'antidote' to resume being Jekyll. He said that he now has the ability to appear without the aid of Jekyll's serum. Hyde then tries to persuade her to have sex with him. Shocked, Mary wishes to leave. He releases her, and she joins her colleagues in the kitchen. They are interrupted by Jekyll, who orders Poole to take a sample of a potion to the chemists and ask them to analyze it. He is to wait until they are successful, as this is a matter of life and death. Unfortunately, Poole returns unsuccessfully.\nMary packs her things to leave, but on her way out, she decides to visit the lab. Hyde attacks her, smashing items in the laboratory. He holds a knife to her throat, but does not kill her. He says that he always knew that Mary \"would be the death of us.\" He then injects himself with the antidote, and Mary is forced to witness the horrific transformation between one man to the other. Jekyll reveals that Hyde has mixed a poison with the antidote. He then dies in Mary's arms. In the morning, Jekyll, although dead, has transformed into Hyde one last time, awake and smiling, as Mary walks into the fog."}