{"mid": "Masterminds", "IMDB_id": "tt0119630", "title": "Masterminds", "plot": "Oswald \"Ozzie\" Paxton (Vincent Kartheiser) begins an unauthorized download of a soon-to-be-released movie. His download is interrupted when his younger stepsister enters his room without permission. The resulting squabble between them results in their respective parents intervening. In the process, Ozzie's father discovers the illicit download.\nOzzie is forced to take his stepsister to her private school as punishment, but before he can get out of the school, Bentley (Patrick Stewart) and his crew of \"security guards\" use a variety of firearms and tranquilizer dart guns to subdue several staff members, lock down the school, and hold the children hostage. Bentley has planned stages of a ransom scheme involving their parents' corporations. Ozzie attempts to alert his stepsister to the danger. She does not believe him, and he is subsequently chased by one of the gunmen. Using a bunsen burner and a vial of acid he is able to subdue his pursuer. He subsequently begins wreaking havoc with Bentley's computerized security system.\nThe police make several attempts to breach the school's perimeter, only to run into automatic gunfire, rocket launchers, and mines. As a concession, Bentley releases most of the children, but keeps the ten richest (and Ozzie's stepsister) and demands a very large ransom for their return. Ozzie locates ten of the eleven children and rescues them, but his stepsister has been taken by Bentley. He then places an improvised time bomb at the bottom of the school's indoor pool. He attempts to stop the ransom payment, but finds out too late that the man designated to deliver it was actually Bentley's confederate. Bentley ties Ozzie to a chair and leaves with his men, keeping Ozzie's sister as an insurance policy. They intend to escape through the sewer pipes using ATV's.\nWhile Ozzie is struggling to free himself, the bomb explodes, flooding the school's lower levels and neutralizing nearly everyone there. Ozzie and his friend, K-Dog (Jon Abrahams), seize an abandoned ATV and pursue Bentley. They rescue Ozzie's stepsister, but Bentley escapes with the ransom. However, Ozzie is able to blow the whistle on the man who delivered the money with a little help from the school principal (Brenda Fricker) who also witnessed the man's actions. Through his cellphone, the police trace him to the CEO of a rival corporation, who masterminded the plot so that the money used for the bidding would be given to terrorists so he could win a bidding war against the corporation employing Ozzie's father. Soon afterward, Bentley sees a light at the end of the tunnel, only to discover that the light leads to a sewage reclamation plant. The money begins to sink as police cars come to arrest him."}