{"mid": "Matango", "IMDB_id": "tt0057295", "title": "Matango", "plot": "In Tokyo, a man travels to visit university professor Kenji (Akira Kubo) who is being held in the psychiatric ward of a hospital. He tells the man that what happened to him sounds crazy, but that he is actually not insane.\nA Japanese yacht on a day trip encounters a nasty storm that nearly capsizes it. The crew and passengers include Kenji; skipper Naoyuki (Hiroshi Koizumi); his shipmate assistant Senzô (Kenji Sahara); writer Etsurô Yoshida (Hiroshi Tachikawa); celebrity Masafumi Kasai (Yoshio Tsuchiya), the owner of the yacht; and two female passengers, professional singer Mami (Kumi Mizuno) and student Akiko (Miki Yashiro). The storm leaves their ship in ruin. Without a rudder or sails to steer by, they are forced adrift. A few days after hearing a radio announcement that they were lost at sea, the group arrive at a seemingly deserted island. After spending a day in search of food and water, they come across ponds that seem man-made, full of fresh rain water, along with a seemingly endless forest of mushrooms. However, Naoyuki warns them not to eat the mushrooms, as they may be poisonous.\nAs they cross the island, they come across a shipwreck on the shore. Although it seems to have only been there about a year, the sails are rotted and the ship's interior is covered with a mysterious fungus and mold that has spread throughout the ship. Noticing that the mold succumbs to strong cleansing products, they work to clear it from the ship. In doing so, they begin to suspect that the ship had been involved in some sort of nuclear testing of the polluted waters, forcing gross mutations on various objects, including mushrooms. As the days pass, the group begins to grow restless as their supply of food stores start to run low. They try to acquire turtle eggs and birds, though this proves difficult, as birds seem to actively avoid the island. With Kasai refusing to help find a way off the island and instead stealing from the food stores, Yoshida begins to get edgy, eventually eating the mushrooms on the island instead of eating the potatoes and seaweed they are able to find to sustain themselves.\nOne night, as Kasai is raiding the food stores, he is attacked by a grotesque-looking man who promptly disappears after encountering the group, leading them to believe that something is very wrong with the island. Shortly after Yoshida and Kasai fight over Mami's affections, Yoshida goes crazy as a direct result of the mushrooms' influence. He pulls a gun on the men, but is locked in Kasai's room. Naoyuki decides that they must leave the island in order to survive, but the others disagree, so he departs on his own. Mami frees Yoshida and they attempt to take over the ship, shooting and killing Senzô in the process. Kenji and Akiko manage to wrest control from them and force them off the ship. Kasai travels out to the yacht only to find Naoyuki missing and a note left behind, explaining that Naoyuki is responsible for the deaths of the group and that he has jumped overboard. On his way back, Kasai is confronted by Mami, who entices him to follow her into the forest. Perpetual rainfall had caused wild fungal growth, and Kasai realizes that those who had been eating the mushrooms turned into mushrooms themselves. Due to its addictive nature, no one can escape the mushrooms once they take a bite. Kasai is last seen collapsing as mushroom beings swarm him.\nMeanwhile, Akiko and Kenji are attacked in force by the mushroom people. They are separated and Akiko is kidnapped. As Kenji tracks her down, he discovers that she has been fed mushrooms and is under their influence along with Mami, Yoshida and Kasai. Kenji attempts to rescue Akiko, but he is overwhelmed by the mushrooms and flees without her, making his way onto the yacht and escaping the island.\nSeveral days pass before Kenji is finally rescued. As he waits, he begins to wonder if he should have stayed with Akiko on the island. He turns toward the audience, his face covered in fungal growth, and states that it wouldn't have made a difference if he had stayed or not, but he would have been happier there with his love. The screen fades as Kenji notes that humans are not much different than the mushroom people, and the camera pans over a night-lit Tokyo."}