{"mid": "Maverick", "IMDB_id": "tt0110478", "title": "Maverick", "plot": "The story, set in the American Old West, is a first-person account by wisecracking gambler Bret Maverick (Mel Gibson) of his misadventures on the way to a major five-card draw poker tournament. Besides wanting to win the tournament for the prize money, he also wants to prove, once and for all, that he is the best card player of his time.\nMaverick rides into the fictional town of Crystal River intending to collect money owed to him, as he is $3,000 short of the tournament entry fee of $25,000. While in Crystal River, he encounters three people: an ill-tempered gambler named Angel (Alfred Molina), a young con artist calling herself Mrs. Annabelle Bransford (Jodie Foster), and lawman Marshal Zane Cooper (James Garner). The first two are also rival poker players.\nMaverick, Bransford and Cooper share a stagecoach, the driver of which dies at the reins at full gallop. They later help a wagon train of migrant evangelist settlers who have been waylaid by ruffians. The settlers offer Maverick a percentage of the money they have collected to start a mission, but Maverick cannot bring himself to accept it. The three are later headed off by a troop of Indians led by Joseph (Graham Greene). Unknown to his companions, Joseph and Maverick are good friends, and Maverick allows himself to be \"captured.\" Joseph is another one of his unreliable debtors, and in and around his tribal grounds they collaborate on a scheme to swindle a Russian Grand Duke, with Maverick collecting the $1,000 that Joseph owes him.\nAngel receives a mysterious telegram ordering him to stop Maverick from reaching the tournament. He also learns that Maverick had conned him in Crystal River. Angel catches up with Maverick, beats him up, and attempts to hang him from a tree. Maverick escapes after the tree branch breaks under his weight, and makes it to the poker tournament aboard the paddle steamer Lauren Belle. Angel already has a seat in the game, while Cooper has been engaged to oversee its security. Learning that Bransford is still short $4,000 of the entry fee, and still being $2,000 short himself, Maverick finds the Grand Duke on board and cons him out of the money they both need.\nAfter the others are eliminated, the four finalists are Maverick, Bransford, Angel, and Commodore Duvall (James Coburn), the boat's owner and the tournament organizer. Maverick almost fails to reach the final table by the 5:00 AM deadline, having had his stateroom door chained shut (by an unknown person) after a tryst with Bransford. The game proceeds, with Bransford the first eliminated. A \"fixed\" hand is dealt to the three remaining players: four eights to Duvall, a low straight flush to Angel, and Maverick needing either the nine of spades to complete a king high straight flush, or the ace of spades to complete an unbeatable royal flush. Noticing that the dealer has bottom-dealt to the other two on the discard, Maverick protests, then agrees to accept one card dealt by Angel from the top of the deck. Duvall and Angel each bet \"all in,\" and Maverick calls without looking at his new card. When the three reveal their hands, that card turns out to be the ace of spades, giving Maverick the championship. An enraged Angel (who thinks Maverick cheated) draws his gun, but he and his stooges in the audience are gunned down by Cooper and Maverick.\nInstead of presenting the $500,000 grand prize to Maverick, Cooper steals it and escapes from the boat; Maverick stops Duvall from shooting him. During a nighttime meeting in the woods, Cooper and Duvall discuss the scheme they have just carried out: Angel was working for Duvall, and Cooper's job was to steal the money and split it with Duvall and Angel if anyone except either of those two won the tournament. Duvall overpowers Cooper and prepares to shoot him, but they are interrupted by Maverick, who steals the money back and leaves them with a single gun to settle their argument. It turns out to be unloaded; Cooper beats up Duvall, but stops short of killing him and sets out after Maverick.\nLater, in a bathhouse, Cooper catches up to a relaxing Maverick and briefly threatens to shoot him. The two then drop their pretense, acknowledging each other openly as father and son; they had in fact conspired all along to get the $500,000. As Cooper enjoys a bath of his own, Bransford enters and robs the two, having surmised the relationship from their similar mannerisms. After she escapes, Maverick tells Cooper that she only got half the money, the rest being hidden in his boots. He admits that he allowed Bransford to steal from him so that he can enjoy chasing her down to recover that money."}