{"mid": "MaxPayne", "IMDB_id": "tt0291337", "title": "Max Payne", "plot": "On a cold stormy winter night, an N.Y.P.D helicopter flys over the Hudson River towards the city, Two police cars drive to where the helicopter is heading: The Aesir Corporation Head-Quarters. A man is standing on the ledge with a sniper rifle in his hand, looking down on the nightmare that changed his life... His name is Max Payne.Max is a detective with the N.Y.P.D., Three years prior to the present, Max and his DEA friend, Alex Balder are talking in his office, Alex offers him an oppritunity to join the DEA but Max declines, choosing his family before work. On his way home, Max sees all the children playing on a hot summer evening. When Max enters his house, he calls out to his wife but there's no answer. Max walks through the entry way and notices a black \"V\" with a syringe going through it painted on the wall. The phone rings and Max answers, instructing the caller to dial 911, she hangs up. Max hears screaming and noises upstairs, When he reaches the top, two gun shots go off and his wife is screaming. When Max tries to go through the doorway in the bathroom but it's barricaded. Max decides to go through the baby's room but two men come out and Max kills them, He enters the room and sees his baby girl dead, on the floor. Max gains access to his bedroom and his wife is lying dead on their bed. As a result in loosing his family, Max decides to join the DEA where he goes on an undercover assignment to infiltrate the mafia.It is now present day and a winter storm has just began. Max is at a diner waiting to hear from his partner \"B.B\" who instructs him to meet with Alex at the Roscoe Street subway station. Max gets off the train and finds a dead security guard in a room, Max gets back to the platform and two mobsters are waiting for the next train to come. Max kills them and makes his way to the lower level of the Subway. Once their, Max seeks a \"subway personnel\" room and enters. He saves a technician from being killed off by a mobster. The technician takes Max to the upper level where he can call for help in the security office. The guard is killed and Max takes out the mobsters in the room. Max turns on an unused inspection car and uses it to go down a dark tunnel leading him to a closed off 1940's subway station. Once he gets there he feels a rumble and everything begins to shake for a couple of seconds. Max goes through the station until he finds a giant hole in the wall leading to the vault of the Roscoe Bank. A group of mobsters planned to take a large sum of money along with \"Aesir Corporation\" bonds. Max also finds some detonators on a table. He takes them and finds a door rigged with explosives. Max uses the detonators and the doors blows off it's hinges. Alex runs to a locked gate and Max meets up with him. Max tells Alex that it was a bank job and it was Jack Lupino's men. Before Alex can make another plan, he is shot to death in front of Max's eyes. With nothing to do to save his friend, Max leaves the subway and heads for Lupino's hotel.While sitting at the bar waiting for Lupino to show up, Max is greeted by the Finito brothers, Lupino's enforcers. They discover Max is a cop and try to kill him in their office, but Max is able to kill both of them. Before leaving the office, Max finds a letter to the Finito's written by Vinnie Gognitti, underboss to Don Angelo Punchinello. The letter explains that a \"V\" deal is going down at the hotel and the Finito's along with Chicago mobster Rico Meurte are to see the deal through. Max finds Meurte's room number written on the letter and he heads to his room. On the way, Max hears a newscast on the radio explaining he is wanted for the murder of Alex Balder. Max reaches Rico Meurte's room and finds a letter written by Don Punchinello asking him to back up the deal as a major favor repaid to him. Max heads down to the basement of the hotel making his way to the entry-hall.On his way their, Max seeks a hooker's hotel room with a diary entry recently written in her book. Max finds the room where the deal is taking place and kills the mobsters inside. Max finds a case of Valkyr on the table along with $5,000 in dirty money. Max goes to the bar and finds Rico Meurte getting a blow-job by the hooker, Candy Dawn. Max kills the both of them as they open fire on him. Before leaving the hotel, Max seeks a switchboard in the reception area, he overhears a conversation between a dying Meurte and Vinny Gognitti, the mafia is now aware Max is out and to be ready for anything.As Max leaves the hotel, a bomb goes off in one of Lupino's tenament buildings and a black volkswagon drives down the road, Max sees the man riding shot-gun is Vladimir Lem, the head of the russian mob and enemy of Don Punchinello. Max goes to the recently destroyed tenament building and looks for Vinnie Gognitti. Making his way through the building, a pay-phone rings and Max answers. The caller reveals himself as Alfred Woden and tells Max the police are on their way. Max guns it through what's left of the building until he reaches Gognitti's office. Gognitti grabs his gun and fires off a shot at Max and Max dodges and shoots Gognitti in the chest. Gognitt's men try to kill Max but don't succeed. Max chases Gognitti on foot over rooftops and alley ways until Gognitti reaches a dead end and Max fires another shot at him. Max interrogates Gognitti on where to find Jack Lupino and Gognitti gives up and tells Max he's at Ragna Rock, a gothic night club owned by Lupino.Max drives to Ragna Rock and takes on the mobsters hiding out in the club. Max gathers clues as to discover Lupino's true form. He finds a book that is about the world coming to an end, and over hears conversations of mobsters explaining Lupino's violent behavior. Max reaches the backstage area leading to Lupino's hideout. Max finds a letter with bloody fingerprints on them addressed to Lupino from Punchinello telling him to get his act together or \"The Trio\" will pay him a visit. Max reliazes the Trio is the Don's most violent infamous henchmen. Max finds papers on Lupino's table with lists of demons and dark gods of the underworld, along with a journal entry of a dark sermon Lupino preaches. Max finally meets Lupino eye to eye and is ready for a final showdown. Lupino is loaded with Valkyr and is functioning unstably. Max is able to kill him and unloads clips of ammo into the body for the murder of his family. A woman comes out from the curtains and draws a gun at Max.Max aims back and learns the woman is Mona Sax, the twin sister of Lisa Punchinello, Don Punchinello's wife. Mona tells Max that it was Punchinello who had Alex killed and not Lupino. Max and Mona lower their guns and she offer him and drink. Max downs the whisky and passes out on the floor.After Max has a horrible dream showing him killing his wife, he wakes up tied to a chair with a man holding a baseball bat. The man introduces himself as Frankie \"The Bat\" Niagra. With no way to escape, Max gets Niagra irratated with a remark about his name, as a result Max is hit across the head three times with the bat. Frankie remarks that he's gonna take a break and get something to drink. After he leaves, Max breaks free out of the chair and goes through the basement looking for his weapons to continue his quest. Max reaches the first floor of the hotel and makes his way to the bar where Frankie is. The bar had been taped off and secured. Before Max continues to the bar, he overhears a mobster talking on the phone regarding Mona and The Trio. Max kills the man and hears a radio broadcast explaining his body was found by \"reliable sources\" and finds a note written to Frankie by Punchinello to take care of him good. Max goes to the bar and sees Frankie having a beer. They go through a fierce gun fight with Frankie having his last swing at bat for good. Max leaves the hotel and sees that he's being tailed by Vladimir. Max gets an offer from Vladimir in return that he'll get help going after Punchinello, Max hears him out.Vladimir's cargo ship \"Charon\" is taken under siege by Boris Dime, working for Punchinello. The ship is loaded with guns, ammo and hardware. If Max can retake the ship and take out Dime, the guns are his and he'll be ready for the fight against Punchinello and his men. Max agrees to the offer and they drive to the docks where the ship is located. Max goes through the dock killing off any of Dime's crew until he reaches the ship. When Max boards the ship, Punchinello calls for Dime on the phone in the ship. Max answers and suggests they should get together for a talk which infuriates Punchinello. Max goes to the lower deck of the ship and finds Dime waiting for him armed with a shotgun. Max kills him and goes to the Stock room and takes all the ammo and guns he needs. He then meets up with Vladimir who offers to help him but Max declines his request.While walking down a street. Max spots a pay-phone and calls Punchinello who wants to have a meeting. Punchinello tells Max to meet with him at his restaurant in one hour. Max gets to the restaurant but no ones there. A match is thrown onto the floor of the restaurant and the place is engulfed in flames, trapping Max inside. He goes through the back ways towards the kitchen until he reaches the sewer entrance and escapes to the street. Vladimir picks him up and drops him off at the Punchinello Manor.Max arrives at the Manor, and makes his way to the basement entrance in the back. The door had already been unlocked and Max thinks Mona is there. He then finds a room with a body on the table with a knife through his chest. Max makes his way to the kitchen where Pilot Providence, third member of the trio and his men are waiting for Max. He sucessfully kills them all and continues through the Manor. Max reaches the entry way and finds the second member of the trio, Joe \"Dead-Pan\" Salem waiting for him, Max kills him and heads for Punchinello's bedroom. Max sees the body of a woman on Punchinello's bed, He is unable to tell whether it's Mona or her sister because the body was badily tortured. Leaving the bedroom, Max answers a ringing telephone. The caller is Alfred Woden who warns Max that a helicopter has landed on the Manor grounds and that he must escape. Max isn't leaving until he finds Punchinello. However Vince Minonauno, first and last member of the Trio tries to kill Max but is unsucessful. Max hears Punchinello on the phone in his locked office begging for help. Max kicks down the door and Punchinello begs him not to kill him. Suddenly three suited men carrying assualt rifles enters Punchinello's office and kills Punchinello while Max fights off the hitmen. Max leaves the Don's office but runs into a group of suited men aiming their rifles at him. A women walks by the men and shows Max a syringe full of Valkyr and injects him with it until he falls down unconsious.The men and their leader leave after commanding them \"Take Me to Cold Steel!\" Max has another horrible dream, even worse than the last one. When he wakes up, Max is sick and throws up and is finally able to climb back to his feet. Max remembers the women's last words before storming out of the manor, and remember's Cold Steel being a factory outside New York. Max drives out there to find out whats going on. He infiltrates the factory dodging fire from patrolling guards. The women's men take over the base and initate the Self-Destruct protocol. With nothing more to go on, Max finds a computer explaining \"Project Valhalla\". The project was a top-secret operation to save Aesir Corporation during the Gulf War. Max's research shows that the project was involved in the use of Valkyr and went through three phases. The last phase was to be iniated at his home address, three years ago. Max also remembers his wife telling him that she found files under the name Valhalla while working at the D.A's office. With the self-destruct countdown winding down fast, Max is able to escape and heads back to the city.Max goes to an all night diner drinking coffee to replenish his energy when he gets a call from \"B.B\" to meet him at the Choir Communications garage at 2:30 AM.Max takes the time reliaze that with the murder of Alex and the frame-up that it had to been an inside job. Max shows up seeing \"B.B\" waiting for him, and Max accuses him of being a corrupt cop who sold out Alex and had him killed. B.B's car drives fastly towards Max as he dodges the car. B.B gets in the car and tries to escape the garage. His men go after Max and a long fire fight goes on in the garage. Max reaches the fourth level of the garage and B.B's car crashes into a van, leaving B.B and Max to have a final standoff. Max kills B.B and then answers a ringing pay-phone. The caller is once again Alfred Woden who instructs Max to meet him at the Asguard Building right away.Max arrives and sees Alfred Woden waiting for him. They enter the building and Woden introduces Max to \"The Inner Circle\". Woden tells Max that they can help him with unknown information about the Valhalla project and how they want to exploit the project's evidence to the government. While the meeting continues. Woden shows Max a picture of the woman at the Punchinello Manor known as \"Nicole Horne\" the CEO founder of Aesir Corporation and the leader of the Valhalla project. Woden makes a deal with Max that if he takes Horne out, the charges against him will be dropped. Suddenly Horne's men storm in and kill the members of The Inner Circle. Max escapes through a window and fights his way towards the security office where on a video monitor, he sees Alfred Woden stand up after supposidly being dead. Max heads to Woden's office and finds a video tape on the desk. The tape came from Nicole Horne showing Candy Dawn with Woden. Max takes it for blackmail against Woden if the deal was back-fired. After a big gun battle in the building's lobby, Max escapes.While driving around the city, Max builds up his rage and gets ready for what he has to do. He finally drives to Aesir Corporation Towers and begins the last part of his mission. Max runs into Mona in an elevator guns pointed at each other. Horne comes over the loudspeaker and instructs Mona to kill Max. She refuses and decides to team up with Max when suddenly, Horne's men show up and kill Mona. Max retailiates and kills them all. After Max call for the elevator and it comes down, Mona's body has vanished with only blood laying on the floor. Max takes the elevator up to the penthouse where Horne's hiding. While in the elevator, Max loads his weapons and takes the time to think about his wife and daughter before making the kill. The elevator doors open on the floor and Horne is looking out the window with a gun in her hands waiting for Max. She orders another group of men to take him out while she makes a run for it. Max takes them out and then a helicopter shows up and sweeps the floor, missing Max. Max makes his way up towards the top floors of the building until he finds Horne at the top of the stairs of the roof. She throws a grenade at him to stop him from coming after her. Max reaches the roof and sees Horne getting into the helicopter behind a locked gate. With less than a minute before take-off, Max must think of a way to kill her before she escapes, Max sees that the large antenna of the building has snapped two cables because of the harsh stormy winds. With the other two cables holding it up, Max shoots out the cables with a sniper rifle. The Antenna becomes loose and Max shoots it down with a grenade launcher. The Antenna snaps off the roof and comes crashing down on the helicopter. The platform the helicopter was resting on falls apart and Horne and the helicopter come falling down forty-five stories to the ground below. Max stands at the edge looking down at the wreckage with a grin look on his face as SWAT members surround him.A police helicopter circles the roof and is instructed to drop his weapons and surrender. Max is taken into custody and before being pushed into a police car, he sees Alfred Woden standing in the crowd of on-lookers with a smug grin on his face as Max is pushed into the car. Max grins in the same manor."}