{"mid": "MccabeAndMrsMiller", "IMDB_id": "tt0067411", "title": "McCabe & Mrs. Miller", "plot": "In 1902 Washington State, a gambler named John McCabe (Warren Beatty) arrives mysteriously and mumbling to himself in the town of Presbyterian Church (named after its only substantial building, a tall but mostly unused [in the film] chapel). McCabe quickly takes a dominant position over the town's simple-minded and lethargic miners, thanks to his aggressive personality and rumors that he is a gunfighter.\nMcCabe establishes a makeshift brothel, consisting of three prostitutes purchased for $200 from a pimp in the nearby town of Bearpaw. British cockney Constance Miller (Julie Christie) arrives in town and tells him she could run a brothel for him more profitably; unknown to him she is addicted to opium. The two become financially successful business partners, open a higher class establishment, including a bathhouse for hygiene, and a love interest develops between the two.\nAs the town becomes richer, Sears (Michael Murphy) and Hollander (Antony Holland), a pair of agents from the Harrison Shaughnessy mining company in Bearpaw, arrive to buy out McCabe's business, as well as the surrounding zinc mines. Shaughnessy is notorious for having people killed when they refuse to sell. McCabe does not want to sell at their initial price of $5,500, but he overplays his hand in the negotiations in spite of Mrs. Miller's warnings that he is underestimating the violence that will ensue if they do not take the money.\nThree bounty hunters—Butler (Hugh Millais), Breed (Jace Van Der Veen) and Kid (Manfred Schulz)—are dispatched by the mining company to kill McCabe, as well as make an example of him, but he refuses to abandon the town. Clearly afraid of the gunmen when they arrive in town, McCabe initially tries to appease them. Reflecting back to early in the film when he's reputed to be a gunfighter (aka Pudgy McCabe), who shot someone in a card game, Butler confronts McCabe about the incident. After hearing McCabe's story, with the addition that the gun was a Derringer, Butler proclaims that McCabe has never killed anyone in his life. McCabe later tries to find Sears and Hollander to try to settle on a price, but upon learning that they have left the area, he visits lawyer Clement Samuels (William Devane) to try to obtain legal protection from Harrison Shaughnessy. Although the lawyer agrees to help McCabe bust the mining company's monopoly on the area, McCabe returns to town convinced that he must face the bounty hunters on his own.\nWhen a lethal confrontation becomes inevitable, McCabe arms himself and hides in the chapel during the early morning hours, but is evicted by the armed pastor, who is then shot by Butler in a case of mistaken identity. A broken lantern starts a fire in the church and the townspeople rush to help extinguish it. McCabe continues his evasion and, by shooting them in the back from hidden positions, kills two of the would-be assassins, one of whom wounds McCabe as he falls. As the townsfolk mobilize to fight the chapel fire, McCabe plays cat-and-mouse with the last gunman, Butler. McCabe is shot in the back and mortally wounded but feigns death and kills Butler with a Derringer when he approaches to confirm McCabe's identity. While the townspeople celebrate extinguishing the fire, McCabe dies alone in the snow and Mrs. Miller visits an opium den."}