{"mid": "MchalesNavy", "IMDB_id": "tt0119640", "title": "McHale's Navy", "plot": "The basic plot revolves around McHale's crew's wacky schemes to make money, get girls, and have a ball, and the efforts of Captain Binghamton (McHale's superior) to rid himself of the PT-73 crew for good, either by transfer or court martial. Although they are forever getting into trouble, they (almost always unwittingly) get out of trouble. Despite their scheming, conniving, and often lazy and unmilitary ways, McHale's crew is always successful in combat in the end. The entire show is based on only two locations, one in the South Pacific at a fictional base called Taratupa (the inferred location is in the Solomon Islands) and an equally fictional town in Italy called Voltafiore. The first few episodes merely indicate it is \"somewhere in the South Pacific 1943\". While in the South Pacific, McHale's crew lives on \"McHale's Island\", which is described as across the bay from Taratupa. It keeps them away from the main base, where they are free to carry out their antics and even fight the war. In the final season, Binghamton and the entire PT-73 crew move to the liberated Italian theater to the town of Voltafiore \"in Southern Italy\" \"in late 1944\".\n=== Regular characters ===\n==== Lieutenant Commander McHale ====\nLieutenant Commander Quinton McHale (Ernest Borgnine) — A principal character of the series, he is also a former captain of a tramp steamer who is familiar with the South Pacific and is especially knowledgeable about the islands and natives around Taratupa, which often helps him in combat situations and makes him a favorite with the admirals (Borgnine actually served in the U.S. Navy during World War II) unlike his greedy superior. Like his crew, he is lazy unmilitary in many ways, but always a strong and competent leader who is very protective of his crew. Also like his crew, McHale likes to wear Hawaiian-style clothing when off duty and to use the PT-73 to go deep-sea fishing and water skiing (as Gruber says in the 1964 movie, \"That's no officer, that's our skipper\"). Gruff but lovable, he often calls his crew \"schlockmeisters\" and goofballs. He is called \"Skip\" by his crew. Although he very often bellows at them and tries to put his foot down, he loves his crew too much to be all that hard on them.\nMcHale's catchphrases are \"Knock it off, you eight-balls\", and when trying to come up with an excuse, a rapid \"Well a, well a, well a\". He speaks Japanese, Italian, and local island dialects. In the 1964 movie, he briefly speaks fluent French. When the crew is in Italy, McHale's knowledge of Italian serves him quite well, and his mother is Italian (both of Borgnine's parents were from Italy). In a dual role, Borgnine played his lookalike Italian cousin, Giuseppe, who does not speak English in \"Giuseppe McHale\" and \"The Return of Giuseppe\".\n==== Ensign Parker ====\nEnsign Charles Beaumont Parker (Tim Conway) — McHale's likable, but goofy second-in-command, he is referred to by McHale as \"Chuck\" and by the crew as \"Mister Parker\" (in the U.S. Navy, officers ranking from warrant officer to lieutenant commander who are not in command are often referred to as \"Mister\"). Tim Conway's bashful, unassertive, naïve, mildly gung-ho bungler often succeeds in spite of clownish ineptitude (a theme that was career-defining). Like Conway, Ensign Parker is from Chagrin Falls, Ohio. Parker was born between about 1916 and 1920 and worked for the Chagrin Falls Gazette.\nAlthough he tries to be military, he is too much of a dimwitted klutz to command too much respect, and many of the episodes involve Parker getting into trouble because of his bumbling and ineptitude such as accidentally firing depth charges or shooting down Allied aircraft. Even before becoming a member of McHale's crew, Ensign Parker's personnel file is a laundry list of major foul-ups, including crashing a destroyer escort into a dock, doing something to the heavy cruiser USS Minneapolis, and calling in a naval airstrike on a Marine gasoline dump. Because of his considerable bumbling, the crew tries to protect Parker, whom they feel will not survive as an officer without their help. Also, he is very slow to catch on and does not know when to keep his mouth closed (McHale usually gives Parker a discreet kick or stomp on the foot to get him to shut up). For instance, when Binghamton says \"the cat is out of the bag\", Parker says, \"I'm sure it's around here somewhere, Sir. Here, kitty kitty\".\nParker's catchphrase is \"Gee, I love that kind of talk\" and he loves to cite naval regulations which he knows by heart, but somehow can never remember his serial number correctly. In the episode entitled \"The Great Impersonation\", Ensign Parker impersonates British General Smythe-Pelly (Conway in a dual role) in Noumea, New Caledonia (where he dodges assassins) while the actual general leads an invasion against Japanese forces. In another Conway dual role, Parker impersonates Admiral Chester \"Rockpile\" Beaty in \"The Seven Faces of Ensign Parker\". In \"H.M.S. 73\", Parker poses as a phony British rear admiral, Sir Reggie Grother-Smyth and impersonates British Admiral Clivedon Sommers in \"The British Also Have Ensigns\". From time to time, Parker is called upon to fool Captain Binghamton with a voice impersonation of President Franklin D. Roosevelt (Parker also does an impersonation of Roosevelt in McHale's Navy Joins the Air Force).\n==== Captain Binghamton ====\nCaptain Wallace \"Wally\" Burton Binghamton USNR (Joe Flynn) McHale's perpetually frustrated, sarcastic, greedy, selfish, cantankerous and exasperated commanding officer who dreams of getting the only reward he wants a promotion all for himself, he is referred to as \"Old Leadbottom\" (usually behind his back – a nickname he received from a bullet wound to the posterior), but in the first episode (\"An Ensign For McHale\"), he calls himself \"Square Rig Binghamton\" and in another \"Forty Knot Binghamton\". He is a married naval reservist, and his job before the war was as the commodore of a yacht club on Long Island (possibly the South Bay Yacht Club) and the editor of a yachting magazine. His wife, whom he calls by the pet name \"Pumpkin\" (played by Ann Doran in \"Pumpkin Takes Over\"), lives in San Diego and calls him \"Teddy Bear\". In the 1964 movie, Binghamton implies he is from Youngstown, Ohio, which is where Joe Flynn was born. He was born in 1902.\nCantankerous and cross, Binghamton often dreams of a promotion to admiral or occasionally military glory, but is much too inept, cowardly, and a bit of a goof himself (early in the series, Binghamton is a rather serious officer, but becomes goofier as the series progresses). Binghamton does come close to a promotion to Admiral Rogers's staff in \"The Balloon Goes Up\", but because Binghamton took too long in getting things squared away (because of McHale's crew), someone else gets the promotion. The one time Binghamton leads the PT-73 into battle, he only succeeds in \"sinking\" an enemy truck on land with a torpedo (a gag used in the Cary Grant movie Operation Petticoat ), based on an actual attack conducted by the USS Bowfin.\nBinghamton is constantly trying to \"get the goods\" on \"McHale and his pirates\" to send them to prison or get them transferred, and he comes close just about all the time, only to have McHale's crew get out of trouble, usually by having some kind of military success, through some form of blackmail (such as telling the admiral what really happened), or because Binghamton wants some kind of a favor from McHale. When he isn't complaining about McHale and his crew to his superiors Binghamton constantly tries to impress superior officers, VIPs, or people with connections for personal gain – which usually backfires, making him look foolish. As a running gag, Binghamton is forever being knocked down (usually by Parker or Carpenter) or covered with something messy (also usually because of Parker). Blind without his glasses, Binghamton also has his glasses knocked or taken off (to keep him from seeing something) a number of times. Occasionally, he is seen throwing darts at a picture of McHale.\nHis catchphrases are: \"What in the name of the Blue Pacific\" or \"What in the name of Nimitz (or Halsey)?\" (as when he sees gambling or native dancing girls on McHale's Island), and \"What is it, wha', wha', wha', what?!\" (usually in response to McHale's \"Well a, Well a, Well a\"). A running gag has a frustrated Binghamton looking up and saying, \"Why me? Why is it always me?\" (also used by Tinker in one episode) or \"Somebody up there hates me!\" His favorite catchphrase is \"I could just scream!\", which was once used by McHale and once by Carpenter. The only time Binghamton ever gets even with the PT-73 crew is in McHale's Navy Joins the Air Force when he orders the crew under the command of Ensign Parker to jump off a dock into the water. In the Pilot Episode, \"An Ensign for McHale\", the sign outside Binghamton's office reads \"Capt. R. F. Binghamton, U.S.N.R.\" even though his name is later established to be Wallace Burton Binghantom.\n==== Lieutenant Carpenter ====\nLieutenant Elroy Carpenter (Bob Hastings, a veteran of The Phil Silvers Show) — Binghamton's sycophantic aide, he is in many ways, like Ensign Parker. He is a bumbler and tries to be military, but is too inept to be taken seriously by anyone. He is slow to catch on and does not know when to keep his mouth shut. Like Parker, (as in many slapstick routines), he often knocks down, or causes Binghamton to be knocked down because of his clumsiness and dimwittedness. However, again like Parker, Carpenter is also subjected to Binghamton's tirades and mild physical abuse also used in slapstick routines. He was born circa 1912. and McHale calls him \"Carpy.\" Early in the first season, Lt. Carpenter commands a PT boat, the 117, but soon drifts into less responsibility. In McHale's Navy (1964), Carpenter says he is from Cleveland. In the spin-off movie McHale's Navy Joins the Air Force, Carpenter is in charge of PT-116, which is promptly sunk in the first few minutes of the movie.\n==== PT-73 crew ====\nQuartermaster George \"Christy\" Christopher (Gary Vinson, also starred in the dramatic pilot \"Seven Against the Sea\") — Whenever McHale is not personally steering the -73, it will be Christy at the helm. Besides Binghamton, he is the only married man and the only one with any children. Christy marries Lt. Gloria Winters (Cindy Robbins) early in the series in \"Operation Wedding Party\", and she moves to San Diego. They have a daughter not long afterwards in \"The Big Raffle\" episode. Because his crew helped them get married, their daughter is named Quintina Charlene Leslie Wilhelmina Harriet Virginia Hetty Fujiana after the crew (for Quinton, Charles, Lester, Willy, Harrison, Virgil, Happy and Fuji).\nRadioman Willy Moss (John Wright, also starred in \"Seven Against the Sea\") — a good-natured Southerner from Tennessee, he operates the crew's still and is in charge of radio and telephone communication for the crew. He also serves as the -73’s sonar operator. In \"The British Also Have Ensigns\", he is revealed to have 9 brothers and sisters.\nTorpedoman's Mate Lester Gruber (Carl Ballantine) — a hustler and hack magician, his get-rich-quick schemes (such as promoting gambling and selling moonshine and war souvenirs) often get the crew in trouble (when the crew is not stealing supplies or equipment). Gruber hails from Brooklyn, worked in a used car sales lot, and frequently references the Dodgers and Ebbets Field. Carl Ballantine entertained troops with his comedy and magic during World War Two.\nMotor Machinist Mate Harrison James \"Tinker\" Bell — (Billy Sands, \"Pvt. Paparelli\" on Bilko) — a top notch mechanic, he is in charge of keeping the -73 running.\nGunner's Mate Virgil Edwards (Edson Stroll) — the handsome and well built lover boy is a crack shot with a .50-caliber machine gun. According to the episode \"The Truth Hurts\", Virgil has been in the service at least 6 years.\nSeaman Joseph \"Happy\" Haines (Gavin MacLeod, later of The Mary Tyler Moore Show and The Love Boat) — MacLeod left the series before the third season to appear in the movie The Sand Pebbles. He also appeared in the 1959 movie Operation Petticoat, which has a few similarities to McHale's Navy.\nChristy, Willy, and even the still were carryovers from the original dramatic pilot.\nIn the first season, the crew members are on an equal social footing, but in later seasons, a \"pecking order\" is established with Gruber at the head, although three of the crewmen outrank him. Based on their shoulder patches on their dress white uniforms, Christy, Virgil, and Bell are all petty officers, 1st class, Willy and Gruber are petty officers, 2nd class, and Happy is a seaman (he does not wear a patch). However, none of them wears patches for their particular designation (quartermaster, radioman, etc.).\nSometimes, the crewmen wear crazy disguises to carry out elaborate schemes, such as when McHale needs to stage a phony Japanese attack, Fuji, along with Gruber, Bell, and Parker, dress up in Japanese uniforms using Gruber's war souvenirs (which he is forever trying to sell). When they are in Italy, several of the crewmen and even Fuji dress in German uniforms for similar reasons. In several of the episodes in the South Pacific, the crew dresses up to look like \"native savages\", with Gruber playing the part of a witchdoctor or a chief. When a situation calls for a disguise as a woman, usually Tinker or Ensign Parker dresses in drag.\n==== Fuji ====\nSeaman 3rd Class Fuji Kobiaji' (Yoshio Yoda) — perhaps the most unusual character in the series, he is the lovable, boyish, Japanese prisoner of war and deserter from the Imperial Japanese Navy whom the PT-73 crew takes on as a de facto comrade - and keeps hidden from Binghamton and almost everyone outside of McHale's gang. In the episode entitled \"A Letter For Fuji\", his name is given as Fujiwara Takeo; in \"The August Teahouse of Quint McHale\" and the movie McHale's Navy Joins the Air Force, it is given as Takeo Fujiwara. Although Fuji is a member of the Japanese military and has a girlfriend in Japan (Mioshi, whom he finds out is married), his only loyalty is to the PT-73 crew and not the Japanese war effort. In the episodes \"The Truth Hurts\" and \"The Vampire of Taratupa\", Fuji is revealed to be from Yokohama. In the tag of one of the fourth season episodes set in Italy, he is revealed to have a second cousin who is a lieutenant in the 442nd Regimental Combat Team.\nIn exchange for being given a safe house instead of imprisonment in a prisoner-of-war camp, Fuji gladly \"serves time\" as the crew's houseboy and cook at their camp on \"McHale's Island\". Keeping Fuji's presence and identity a secret from Captain Binghamton and others is a running gag, with wacky consequences throughout the series. For instance, to avoid detection during an inspection by Binghamton, Fuji disguises himself and poses as a Polynesian chief (Binghamton remarks: \"With a Japanese accent?\") in the premiere episode (\"An Ensign For McHale\"); in the first episode set in Europe (\"War, Italian Style\"), he is passed off as a member of the 442nd Japanese-American Regiment (where he finds a second cousin through his mother's family of Kobayashi). In \"The Mothers of PT-73\" and \"Orange Blossoms for McHale\", he is presented as a Filipino houseboy; in \"Fuji's Big Romance\", he is a part-Hawaiian sailor.\nFuji is involved in a frequent scenario on the show. Whenever Binghamton is seen approaching the island unannounced, the crew converges on McHale for instructions. Naturally, the primary concern is to get Fuji out of sight before he is spotted. So invariably, the first order out of McHale’s mouth is, “Fuji. Head for the hills!”, whereupon he takes off for the other side of the island. This scenario is played out so often, in one episode in the later seasons, McHale begins, “Fuji…” and Fuji finishes, “I know. Head for hills.”\nFuji's seemingly fluent yet awkward command of the English language serves as a comic device; particularly humorous is the unexpected and arbitrary use of American colloquialisms and ethnic phrases, all spoken with a thick Japanese accent - personal catchphrases include the Yiddish lament Oy vey and the Italian exclamation Mamma mia!. He fondly calls Commander McHale \"Skippa-san\" and Ensign Parker \"Parka-san\" (see Japanese honorifics).\n=== More information ===\nThe first episode, entitled \"An Ensign For McHale\", sets the tone for the entire series. It involves Ensign Parker's assignment to McHale's crew after they already had gone through several ensigns who could not put up with their unmilitary, slovenly, and insubordinate ways. One of them even suffered a nervous breakdown. Parker is given one week by Binghamton to reform the crew or be given the worst reassignment possible. At first, the crew treats Parker as badly as they treated the other ensigns, but after McHale sees Parker has integrity, he decides to help Parker out by having his crew be much more like regular Navy.\nThe final season had a total change of scenery as Binghamton, Carpenter, and the entire PT-73 crew, along with Fuji (who hid in the -73 as it was being transported), move to the liberated Italian theater in \"late 1944\" to the coastal town of Voltafiore in \"Southern Italy\", where Binghamton becomes the military governor and they become members of PT Boat Squadron 19. Moneymaking schemes of the wacky and somewhat crooked Mayor Mario Lugatto (Jay Novello) and the looney antics of the citizens introduce many more plot twists and gags. For instance, when McHale and his crew first arrive in Voltafiore, they are greeted by the newly liberated citizens with the Nazi salute Sieg Heil. While Binghamton and Carpenter live nicely in the city hall, McHale and his men are forced by Binghamton to bivouac in tents near the beach. However, they stumble on an abandoned wine cellar, which becomes their secret underground hideout where they hide Fuji (and of course Binghamton nearly discovers it several times). They later add a submarine-style periscope and fancy furnishings. Colonel Douglas Harrigan (Henry Beckman) of the U.S. Army is, as the overall military commander of the area, Binghamton's superior and a thorn in Binghamton's side. A schemer, Harrigan is sometimes on McHale's side, sometimes on Binghamton's side, or plays one against the other—whatever suits his purposes. Beckman also played Colonel Platt in McHale's Navy Joins the Air Force.\nIn \"McHale the Desk Commando\", McHale learns what a tough job it is when he replaces Binghamton as base commander of Taratupa so Binghamton does not have to face tough-as-nails Admiral \"Iron Pants\" Rafferty (Philip Ober), who is inspecting naval installations (an episode with a young Raquel Welch as Lt. Wilson). About the only other time Binghamton betters the PT-73 crew is in McHale's Navy Joins the Air Force. He does so by pushing them off the dock one at a time (except Parker, who jumps off after the others were pushed off – McHale and Gruber were not in the movie).\nSometimes, Binghamton tries to use legitimate means to get rid of McHale and/or his crew (although usually in an underhanded way). In \"All Chiefs and No Indians\", Binghamton tries to get the whole crew promoted to chief petty officers so they will be split up and reassigned. When they deliberately fail the exams after they find out what Binghamton is up to, he gives them all passing grades anyway. Another example is in the episode entitled \"Little Red Riding Doctor\" in which Don Knotts is Army psychiatrist Lt. Pratt, whom Binghamton tries to con into believing McHale's crew is suffering a terrible case of combat fatigue and should be sent back to the States.\nThe two movies with the same basic cast, McHale's Navy and McHale's Navy Joins the Air Force (both in color), have the same basic plot scheme as the show in the South Pacific, and in many ways were merely extensions of the show. Even parts of the filming location for New Caledonia in the first movie are the identical to episodes from the show.\nAt the end of the fourth season in 1966, low ratings and repetitive story lines brought McHale's Navy to an end.\n=== More characters ===\n==== Urulu ====\nMany of the episodes in the South Pacific involve interactions with native islanders. The most colorful is Polynesian chief and witchdoctor, Pali Urulu (Jacques Aubuchon), who is as shifty and scheming as McHale and his men. When McHale and the crew are in Urulu's village, the chief displays a portrait of President Franklin D. Roosevelt; when the Japanese troops arrive, Urulu turns it over to reveal a portrait of Japanese Emperor Hirohito (in another episode he does the same thing with the Japanese and American flags). Though \"primitive\", Urulu is like Gruber (from whom he learns a lot, usually to Gruber's regret) - a hustler who is always looking for ways to make money or swindle money from the Navy. In the episode entitled \"We Do The Voodoo\", after Binghamton refuses to pay Urulu for damage to his coconut grove, Urulu uses his powers to put a curse on Binghamton, who then has a streak of bad luck. In \"The Balloon Goes Up\", Urulu displays the sign \"Gone Headhunting\" when he leaves his hut and is called a cannibal by Binghamton and McHale (no indication that it is meant to be taken literally). Aubuchon also played the Russian sailor Dimitri in McHale's Navy Joins the Air Force.\n==== Big Frenchy ====\nAnother shifty character is Big Frenchy, played by George Kennedy in episodes entitled \"French Leave For McHale\" and \"The Return of Big Frenchy\". He is a thieving French smuggler, captain of a small boat, and an old friend of McHale's who knows better than to turn his back to him. In \"The Return of Big Frenchy\", he convinces Binghamton and Parker that he is a member of the \"French Underground\" (Free French) so he can steal supplies. Kennedy also played businessman Henri Le Clerc of New Caledonia in the 1964 movie. Kennedy began his career in showbiz as a technical adviser on the 'Bilko' show.\n==== Senior officers ====\nThe show has its share of admirals. Admiral Rogers is played by Roy Roberts in 22 episodes. In some episodes, his first name is John while in others, it is Bruce. Herbert Lytton played Admiral Roscoe G. Reynolds in 11 episodes. Bill Quinn played Admirals Benson, Slocum, and Bruce Elliott in six episodes. Willis Bouchey played Admiral Hawkins in three episodes. Admiral Rafferty was played by Philip Ober in \"McHale, the Desk Commando\" and \"McHale's Floating Laudromat\". Ted Knight played Admiral \"Go-Go\" Granger in \"The Fountain of Youth\" and \"One of Our Engines is Missing\". In \"Uncle Admiral\", Harry Von Zell played Ensign Parker's uncle Vice Admiral Tim \"Bull Dog\" Parker. Simon Scott played General Bronson 9 times when the show is in Italy.\n==== Multiple character roles ====\nPeggy Mondo played several roles in the series. She played the heavyset daughter of a Polynesian chief, Little Flower, who is always looking for a husband such as Ensign Parker or even Binghamton. Mondo also played Fifi in \"French Leave for McHale\" and a few episodes as Mama Giovanni and Rosa Giovanni when the crew is in Italy. Stanley Adams played a native chief, the Shah of Durani, and political boss Frank Templeton in the last episode \"Wally for Congress\". Richard Jury played Lt. Plowright in \"Parents Anonymous\" and a goofy dentist in \"The Novocain Mutiny\". Both Syl Lamont, who played Yeoman Tate, and Clay Tanner, who played a Marine guard, appeared in the series a number of times. Tony Franke also appeared in the series several times and as Sgt. Frank Tresh in the movie McHale's Navy Joins the Air Force. Dick Wilson played Voltafiori citizen and partner of the mayor, Dino Baroni. Walter Brooke and Nelson Olmstead each played several different naval officers. Among the actors who repeatedly played Japanese soldiers and sailors are Dale Kino (who also played a Nisei sergeant), John Fujioka and Mako (who starred in the movie The Sand Pebbles for which Gavin MacLeod left the series).\n==== Guest stars ====\nIn \"The Missing Link\", Marlo Thomas played Binghamton's niece, Cynthia Prentice, who takes an interest in Ensign Parker, although it turns out entirely for anthropological reasons. In \"Camera, Action, Panic\", Arte Johnson played the bumbling Cameraman Sweeney who is making a movie of the PT-73 crew in action. In \"Is There a Doctor in the Hut\", Bernie Kopell (who starred with Gavin MacLeod on The Love Boat) played Colonel Pryer, who is the obnoxious manager of the movie star Rita Howard played by Lisa Seagram. In \"Hello McHale? Colonna!\", McHale finagles to have comic Jerry Colonna do an unscheduled Special Services show. Pat Harrington, Jr. played the thieving Guido Panzini in \"McHale's Country Club Caper\". Steve Franken played the snooty Lt. Jason Whitworth III in \"Birth of a Salesman\", whom Binghamton hopes will give him a job selling insurance after the war. George Furth played the self-centered Roger Whitfield III, who tries to take advantage of Binghamton's hopes to get his old job back at the yacht club owned by Whitfield's father in \"Dart Gun Wedding\". Marvin Kaplan played the MIT electronics genius Ensign Eugene J. Kwazniak in \"All Ahead, Empty\" in which the -73 is wired for remote control. Bernard Fox played the clumsy Sub-Lieutenant Cedric Clivedon in \"The British Also Have Ensigns\". Susan Silo played Virgil's stowaway girlfriend Babette in \"Babette, Go Home\". Jesse Pearson played singing idol Harley Hatfield in \"The Rage of Taratupa\". In \"Make Room for Orvie\", Michael Burns played 18-year-old Seaman Orvie Tuttle, who is the newest member of the PT-7 crew, but who does not go with the crew when they move to Italy in the next episode. Ann McCrea was cast as Carol Kimberly in \"Beauty and the Beast\" (1963). In \"The Comrades of 73\", in which the -73 is slated to be sent to the Soviet Union as part of Lend Lease, Sue Ane Langdon played Russian Commander Krasni and Cliff Norton played Russian Admiral Gurevitch (Norton also played an Australian sergeant major in the 1964 movie and Major Bill Grady in McHale's Navy Joins the Air Force).\n==== PT-73 crew love life ====\nMcHale's always hopeful love interest while the show is in the South Pacific is Navy Nurse Molly Turner (Bilko's Jane Dulo), a New Jersey gal who is always trying to corner the ever romantically elusive McHale. Another love interest of the reluctant McHale is an old friend and a bit of a wildcat Kate O'Hara (Joyce Jameson). At first, his crew tries to get McHale interested in her, then Kate tries to blackmail McHale into marrying her, and then Binghamton tries to blackmail her into marrying McHale when she tries to back out herself. Yet another love interest of the always reluctant McHale is Maggie Monohan (Jean Willes) in \"The Return of Maggie\", the owner of a gambling joint in New Caledonia and an old flame of McHale's who wants him back, but he does not want her back (Willes played a very similar role as Margot Monet in the 1964 movie). Willes also played Congresswoman Clara Carter Clarke in \"Send Us a Hero\".\nThough painfully shy around women, Ensign Parker's love interest in the South Pacific is a lovely French girl from a nearby island, Yvette Gerard, played by Claudine Longet (who also played an almost identical character, Andrea Bouchard of New Caledonia, in the 1964 movie). In \"A Medal for Parker\", his girlfriend back home in Chagrin Falls is Mary (Kathleen Gately), who is more interested in dating a war hero than Parker. While the very bashful Parker is shy around women, women are not always shy around Parker, such as in \"The Happy Sleepwalker\" when Lt. Nancy Culpepper (Sheila James) finds Parker irresistible. In \"The Vampire of Taratupa\", Parker dates Lt. Melba Benson (Ann Elder), who is as big a klutz as he is. In the episode entitled \"36-24-73\", situated in Italy, hints are given of a relationship developing between Parker and by-the-book female Ensign Sandra Collins (Maura McGiveney) after he sternly corrects her about in what sections certain regulations are (they then talk about what regulations are their favorites). Along with other WAVES clad in bathing suits, they provide valuable (albeit totally unwitting) assistance in capturing a German U-boat when its captain runs the U-boat aground trying to get a better look. McGiveney also played the part of Judy in \"The Stool Parrot\" episode.\nAlthough the crew (especially the lover-boy Virgil) is forever chasing women (Navy nurses, native island girls, or local Italian women), certain women gain their interest more than others. After receiving a \"Dear John letter\", shy and broken-hearted Willy's love interest becomes Southern belle Nurse Cindy Bates (Brenda Wright). Tinker tries to impress and win over fickle Nurse Betsy Gordonlove (Barbara Werle) in \"Scuttlebutt\". Happy's love interest in \"The Happy Sleepwalker\" is Lt. Anne Wright (Lois Roberts). When Gruber's girlfriend Ginger (Jean Hale) shows up to surprise him in \"Lester, the Skipper\", McHale is talked into letting Gruber pretend he is the lieutenant commander of the -73 while she is there. In \"Fuji's Big Romance\", the lonely prisoner of war falls for lovely Sulani (Yvonne Ribuca), the daughter of a Polynesian chief, when the crew sympathetically takes him along on one of their social outings to a luau with the native islanders, .\nOther than Binghamton and Christy, none of the regular characters on the show is married, and only Christy has any children.\n=== Cast ===\nExcept where noted, the actors appeared on the show in every season:\nErnest Borgnine as Lieutenant Commander Quinton McHale\nTim Conway as Ensign Charles Parker\nJoe Flynn as Captain Wallace B. Binghamton (\"Old Leadbottom\")\nBob Hastings as Lieutenant Elroy Carpenter\nGary Vinson as George \"Christy\" Christopher, quartermaster\nBobby Wright as Willy Moss, radioman\nCarl Ballantine as Lester Gruber, torpedoman's mate\nBilly Sands as Harrison \"Tinker\" Bell, engineman and motor machinist mate\nEdson Stroll as Virgil Edwards, gunner's mate\nGavin MacLeod as Joseph \"Happy\" Haines, seaman (1962–1964)\nYoshio Yoda as Fuji Kobiaji, cook, seaman 3rd class, Japanese POW; in season 2, episode 13 (\"A Letter for Fuji\"), he is given the name Fujiwara Takeo.\n=== Historical inaccuracies ===\nLike most comical shows about war, at least some historical inaccuracies are likely, including typically no one ever getting killed or seriously injured (even when a bomb explodes right next to them) and the enemy willing to surrender very easily (which in the case of the Japanese is very much historically inaccurate). Also, PT boats were made mostly of wood and very vulnerable to enemy fire, but other than a few bullet holes (which usually disappear by the next scene) and easily repairable damage to the engine or fuel tanks, the PT-73 is in the series rather invulnerable - even the 'bridge' where bullets are seen to strike forward of where the actors were standing, shots that would, in real life, have penetrated the thin wood construction, leaving all on the command-bridge dead or severely wounded from the bullets or shrapnel. Despite this, the series was known as being fairly historically accurate, at least more so than the series Hogan's Heroes and F Troop.\nIn the first episode, \"An Ensign for McHale\", Binghamton points to a map of New Zealand and the surrounding ocean areas. He indicates that the Japanese are all around New Zealand and that the Taratupa base is located immediately below New Zealand's South Island. Although Japanese submarines and even sometimes German U-boats were a threat to shipping in and out of New Zealand, the Japanese never seriously threatened New Zealand or controlled areas near New Zealand. The only American military forces stationed in New Zealand were on the North Island and the Navy would have had very little reason to have a military base at the south end of New Zealand. In \"The Ghosts of 73\", Binghamton indicates on a map that McHale's Island (and Taratupa) are located just off the west coast of New Zealand's North Island. Here again, the U.S. Navy had no PT boat bases in New Zealand and New Zealand was relatively far from any combat zone as depicted in the series. A map of the area around Guadalcanal in the Solomon Islands that hung on Binghamton's office wall behind his desk would imply Taratupa's fictional location (a goof in \"Alias PT 73\" has the map upside down early in the episode and then correctly hung later in the episode). In the episode \"One Enchanted Weekend\", McHale points on a map of the Solomon Islands to an island along the Indispensable Strait and indicates that it is not far from the fictional Taratupa. Also, the Solomon Islands were the closest war zone in the Pacific Theatre to New Caledonia, which is referred to on numerous occasions as where the PT-73 crew would go for R&R. The island of Tulagi, just north of Guadalcanal, was used by the U.S. Navy during World War II as a PT boat base for year and may have served as a role model for the fictional Taratupa. However, in \"McHale and his Schweinhunds\", Binghamton and McHale point on a map to an island northwest of Borneo in what was then the Dutch East Indies as not far from Taratupa, but this would be very far into Japanese territory for 1943 and very far from Tulagi.\nDespite the fact that during World War II, the front line constantly moved forward, and according to the series, the crew had been together about three years, the entire series is based on only two locations, one on a fictional island in the South Pacific and the other in a fictional liberated town in Southern Italy. Also, much of what takes place is, in some ways, as if it were peacetime, with the crew permanently stationed in one location and concerns about peacetime duties rather than fighting the war. In reality, PT boats and squadrons were moved several times to new bases as the front moved forward.\nIn the final year of the series, the entire crew and ship are transferred from the Pacific theatre to the European theatre in \"late 1944\". While it was not uncommon for larger vessels to be transferred from one theatre to the other, transferring very small vessels like PT boats, as well as the entire crew, would have been rather strange, particularly to the European theatre. After the invasion of France in the summer of 1944 and the Allies started winning the War of the Atlantic, the U.S. Navy then shifted its emphasis to winning the war in the Pacific and sent men and ships to that theatre of the war.\nAccording to the episode \"War, Italian Style\", when Binghamton, Carpenter, and the Pt-73 crew move to Voltafiore, they are part of \"PT Boat Squadron 19\". This squadron was assigned to the Pacific Fleet and never served in Europe. Only two U.S. PT boat bases were established in Italy during World War II. The first was as an advanced base in September 1943 in Capri on the Island of Anacapri in the Bay of Naples in Southern Italy, and the other in the city of Livorno (Leghorn in English) in Northern Italy in October 1944 (Livorno had been liberated a few months earlier in July 1944).\nIn \"The August Teahouse of Quint McHale\", several items McHale's crew stole from supplies are labeled U.S.A.F., United States Air Force. However, the U.S. Air Force during World War II was part of the U.S. Army and was known as the United States Army Air Forces or U.S.A.A.F. The U.S. Air Force did not become a separate branch of the U.S. military until 1947.\nThe series depicts Japanese submarines and German U-boats trying to hit the fast-moving PT-73 with a torpedo. PT boats were too fast and maneuverable to be hit by a torpedo all that easily. The more likely scenario would involve the submarine or U-boat surfacing and then shelling the PT boat with its deck gun.\nAlthough the series is set during World War II, women on the series do not have hairstyles common during the war, but rather have hairstyles common during the early 1960s when the series was produced. Several references are made to nurses wearing bikinis. The modern bikini was not invented until 1946 and was named after Bikini Atoll after it was used for numerous atomic bomb tests after World War II.\nIn several interviews, Ernest Borgnine said that the U.S. Navy sent over a technical adviser, but after the filming of the first episode, the adviser walked off the set in disgust because of the show's farcical and comical portrayal of the Navy, saying, \"Don't call us; we'll call you\".\nAs a note of clarity, in the episode entitled \"The Comrades of 73\", situated in the South Pacific in 1943-1944, the United States and the Soviet Union are correctly portrayed as allies without any suggestion that they are allies against Japan. The Soviet Union did not declare war against Japan until August 8, 1945 — two days after the U.S. dropped the first atomic bomb on Hiroshima. Japan surrendered on August 14, 1945. By the end of the series, the PT-73 and crew are fighting in Italy, and Germany surrendered on May 8, 1945 - well before the Soviet Union declared war on Japan.\n=== The real-life PT-73 ===\nThe real-life PT-73 was finished on August 12, 1942, by Higgins Industries, Iinc., New Orleans. It was 78 feet long, weighed 56 tons, and had a top speed of 40 knots. It was assigned to Motor Torpedo Boat Squadron 13 under the command of Commander James B. Denny, USN. The squadron participated in the Aleutian Islands Campaign from March 1943 to May 1944. The squadron was then transferred to the Southwest Pacific, where the squadron saw action at Mios Woendi, Dutch New Guinea; Mindoro, Philippine Islands; and Brunei Bay, Borneo. The squadron was also based for a time at Dreger Harbor, New Guinea, and San Pedro Bay, Philippine Islands, but saw no action from these bases. Overall, the real PT-73 did not have the kind of illustrious combat record depicted in the series. On January 15, 1945, it ran aground off Lubang Island in the Philippine Islands after delivering supplies to Filipino guerrillas and was destroyed by the crew to prevent it from falling into enemy hands."}