{"mid": "MeanGuns", "IMDB_id": "tt0119642", "title": "Mean Guns", "plot": "Vincent Moon (Ice-T) is the leader of a crime syndicate that has just built a new prison. The day before it is to open, he brings together 100 people who have wronged the syndicate in various ways, provides them with weapons and ammunition, and gives them six hours to fight each other to the death. A $10 million cash prize is hidden in the prison, to be split by the last three survivors, but Moon's men will move in and kill everyone when time runs out.\nA loose alliance forms between Cam (Van Valkenburgh), an accountant who was intercepted while trying to give photographic evidence of the syndicate's crimes to the authorities, and Marcus (Halsey) and D (Warren), two professional killers. They are soon interrupted by another killer, Lou (Lambert), who briefly holds Marcus at gunpoint before being reluctantly accepted into the group. Lou is the informal guardian of a little girl named Lucy (Doughty), whom he has left in his car outside the prison. Cam is badly shaken by the violence raging around her and cannot bring herself to kill anyone.\nThe four broadcast an announcement over the prison's public address system, claiming that they have found the money and daring everyone to fight them for it. Cam slips away as dozens are killed in the ensuing melee, and D abandons the group only to be strangled to death by Lou. After Moon announces the actual location of the money, Marcus finds two briefcases placed in that spot and takes them, leaving behind a third one rigged with a bomb. Marcus brings Lucy into the prison to help him take out the cash; a woman, who wandered into the prison before the game began, finds the bomb and is killed when it blows the top of her head off.\nDuring these events, Lou reveals that he took Lucy into his care after her mother and stepfather were killed, and that he is participating in the game in order to provide for her future. Cam retrieves the pictures she was trying to turn over and shows them to Marcus, saying that she had not realized the extent of the syndicate's money laundering in which she was involved until she saw them. Marcus reveals that Moon brought him into the game in the hope that he would be the only survivor.\nMoon summons the final three survivors - Cam, Lou, and Marcus - to a four-way showdown. He gives each of them a gun and keeps a fourth for himself, but deliberately fails to load the one given to Lou. Marcus shoots Cam and then Lou, whom Moon dismisses as a liability due to his violent nature and desire for revenge against Marcus for raping his daughter. Marcus then kills Moon when Moon tries to quick-draw on him. The wounded Lou admits that Lucy is his biological daughter before he and Marcus kill each other.\nCam wakes up to find Lucy standing over her. Marcus had killed Lou at Lucy's request and only grazed Cam with his shot so she could fake her death. Cam drives off in Lou's car with Lucy and the prize money."}