{"mid": "MeBeforeYou", "IMDB_id": "tt2674426", "title": "Me Before You", "plot": "The movie starts off with Will Traynor (Sam Claflin) being blissfully happy with his beautiful fiancé. It's obvious that he's rich and high-society. It's raining, he leaves for work, and she tells him he can't take his motorcycle. He doesn't and starts walking to work while talking on his cell phone. He's distracted and gets hit by... a motorcycle. He ends up paralyzed from the neck down.A few years later, we see Lou Clark (Emilia Clarke), a young waitress in a café. She's super nice and chatty and helpful to everybody. At the end of the day, the owner gives her a final paycheck, says he's sorry, and closes the café (as in out-of-business).Losing her job is bad because Lou lives with her parents, her sister, and her sister's child. She's the only one who has a job at the moment. In the next few scenes, we're introduced to Lou's family. Her sister Katrina \"Treena\" (Jenna Coleman) and Lou's boyfriend Patrick (Matthew Lewis). It's pretty obvious that he's a tool and they aren't a good match.Lou goes to the unemployment office and has witty banter with the person there about how she lacks any skills. He finds a job for a caregiver and sends her off for an interview, but tells her to wear some conservative clothes. The interview is with some people who are fabulously wealthy. Lou interviews with Will's mother who doesn't seem to like her initially but Lou's witty banter impresses Will's mom and she gets the job. During the interview, we also meet Will's dad, and it's clear there is tension between Will's parents. Will's mom (Janet McTeer) tells her Will isn't to be left alone for more than 15 minutes. During the interview, Lou's skirt rips up the side and she tries to hide it.Will's mom takes Lou to meet Will. He's with Nathan (Stephen Peacocke), a nurse who stays with him at night. Basically, Lou's job is to be with Will all day until Nathan gets back from other patients. Will does a \"my left foot\" impression to show that he's a jerk, but behaves after that. He says something about her skirt being ripped and dismisses her. Nathan gives her a quick run-down of some of the medications Will takes.Lou comes back the next day and Will is mean to her. He says they should just leave each other alone. She tries, hates her job, and cries about it with Treena at home. Treena gives her a pep talk and turns her around. Treena also lets Lou know that she's going off to college again and the family needs Lou's job.With a new vigor, Lou goes to work, does witty banter with Will, and starts to win him over. He slowly starts to open up to her. This is the point where the movie turns into Pretty Woman. He gets her to watch a subtitled foreign film and she loves it (a la the opera). She tries to get Patrick to see a foreign film at the theater and he poo-poos the idea.At some point, Will's old girlfriend stops by with her new fiancé who happens to be Will's old best friend. Will is understandably mean to them. There's some of the, \"I tried,\" and, \"It just happened,\" talk. The movie doesn't make the happy couple look like really bad people, which is nice.At some point, Will and Lou talk about her fashion sense and Lou tells Will a story about having black and yellow striped leggings as a young girl and never taking them off. (This is important for later.)Eventually, Lou finds out that Will wants to die via assisted suicide in Switzerland, because he used to be very active and now he can't move. He told his mom that he'd wait six months. Lou is bummed by that and takes it as a challenge to try to get him to change his mind. She starts planning all kinds of outings for Will.The first outing is to the horse races. Lou does a video call with Treena to decide what to wear. They settle on a red dress that really impresses Will. Lou bets on a horse that Will says won't win. She's very optimistic, until the horse gets stuck coming out of the gate and seems to wander around the racetrack like a drunkard.The next outing is to a Mozart concert. It appears that Will had a good time because when they get home he wants to sit in the car for a while and, \"be a man who was just at concert with a girl in a red dress\".Lou gets Will to go other places. She gets him to let her shave his beard. He surprises her by having his mangy hair cut neatly.Lou's birthday comes around and her parents invite Will to their house for dinner which he accepts. They're all nice during dinner and have witty banter. When it's time for gifts, Lou's parents give her a photo album of pictures from when she was growing up. She loves it. Patrick gives her a specially made necklace that has his name on it. She's polite about it. Then Will gives her a gift that's black and yellow leggings. Well, she goes crazy over them and goes to put them on right away. It's pretty obvious that she likes them the most of anything. Patrick starts to think that she and Will like each other.Will and Lou go to the old fiancé/old best friend's wedding. He drives her around the dance floor on his wheelchair and they talk about her boobs. The two of them are seen racing away from the party on his wheelchair and getting home the next morning. Will's mom says something and he replies that he's a grown man and can spend the night in a hotel if he wants.Will gets sick and can't go on this big trip that Lou had planned. Lou is sad, but plans another trip that the doctors agree to. Nathan goes with them. They all have lots of fun. Will forces Lou to try scuba diving and she loves it. Nathan even finds romance. At the end of the trip, Will tells Lou about Switzerland. She yells at him and leaves.Treena talks Lou into going to Switzerland to be with Will for his assisted suicide. She makes it in time to talk with him.The final scene is Lou sitting in a café in Paris and reading a note from Will. It was one of his favorite places that he wouldn't go back to after his accident because it would only make him sad. He tells her to be happy and go see the world. He's left her some money. She heads off to her next stop and is wearing the back and yellow striped leggings."}