{"mid": "MediumCool", "IMDB_id": "tt0064652", "title": "Medium Cool", "plot": "John Cassellis is a television news cameraman. In one of the opening scenes, a group of cameramen and journalists are discussing the ethical responsibilities within their profession: When should filming a gruesome scene end and human responsibility to try to save a life begin? As viewers we are presented with issues such as violence as spectacle, political and social discontent, extreme racism, and class divisions. The film is constantly juggling documentary footage with feature film image. Among his sources, Wexler uses footage from military training camps in Illinois for military troops preparing for planned demonstrations by students and anti-war activists during the Democratic National Convention later that summer.\nCassellis is seemingly hardened to ethical and social issues; he is more concerned with his personal life and pursuing audience-grabbing stories. Yet once Cassellis finds out that his news station has been providing the stories and information gathered by the cameramen and news journalists to the FBI, he becomes enraged. The news station creates an excuse to fire him, and Cassellis is let go. But he soon finds another job free-lancing at the Convention.\nIn the course of his television job Cassellis meets Eileen and her son, Harold, who had moved from West Virginia to Chicago. Eileen is a single mother whose husband according to their son is in \"Vietnam.\" Eileen tells Cassellis that her husband is dead, but it is unclear whether she really knows that to be the case. While unemployed, Cassellis spends a lot of time with them and grows fond of them both.\nThe film climaxes with a scene in which Eileen is walking through rioting crowds, based on Wexler's footage of students in Chicago demonstrating during the Democratic National Convention in the summer of 1968. Her son has gone missing and she is desperately seeking Cassellis for help, but he is filming the convention. As a result, the fictional story and real-life brutality merge. The director explained that he planned his principal filming schedule to coincide with the convention, expecting that a riot would occur. The 1968 Democratic National Convention protest activity resulted in a riot. A study team of the President's National Advisory Commission on Civil Disorders concluded (in its report Rights in Conflict) that the events \"can only be called a police riot\" based on massive evidence that \"some policemen lost control of themselves under exceedingly provocative circumstances.\" Following this, Cassellis's and Eileen's paths converge in the middle of a protest, and Cassellis escorts Eileen to his car. As they drive to an undisclosed location, unaware that Harold has returned home, Cassellis accidentally crashes the car into a tree, killing Eileen and critically injuring himself. The final scene, echoing the first, is of a passing driver stopping to photograph the accident, after which he leaves the heavily damaged car behind."}