{"mid": "MeetTheFeebles", "IMDB_id": "tt0097858", "title": "Meet the Feebles", "plot": "The eponymous theatre troupe is rehearsing the title song with hopes of finding success through being picked up for a syndicated television show. Heidi (a hippopotamus), the star of the show, is insulted by pornographic director Trevor (a rat) and complains to her boss and lover, Bletch (a walrus), who is actually in an adulterous relationship with Samantha (a cat). Meanwhile, Robert (a hedgehog), the newest member of the team, arrives at the theatre and immediately falls in love with another newcomer, Lucille (a poodle). Samantha confronts Heidi, insults her, and reveals her relationship with Bletch. Robert confesses his love to Lucille, and the two become engaged. Sid (an elephant) receives a visit from his ex-wife Sandy (a chicken) with his alleged son Seymour (an improbable-looking elephant/chicken hybrid). Sandy informs him she will be preparing a paternity case against him.\nAt the toilet, the second most important star of the show, Harry (a hare), is suffering from a mystery disease. Meanwhile, drug-addicted knife thrower Wynyard (a frog) tells Robert his story of Vietnam, and convinces Robert to give him $50 to buy drugs from Trevor. After seeing Trevor's latest porno film, Bletch decides they need a new porn star, and Trevor chooses Lucille; he drugs her and tries to rape her as an audition but is caught by Robert. When he walks in on the scene Robert thinks that Lucille was drinking and throwing herself at Trevor, and tells her he never wants to see her again.\nAfter a good beginning – the Feebles sign with a TV chain to appear in a prime-time television show – Bletch confesses to Heidi that he actually hates her and wants to give the main role to Samantha. After trying unsuccessfully to attempt suicide, Heidi goes on a shooting spree and kills many of the cast.\n=== Sub-plots ===\nLove Triangle\nA distraught Heidi runs to Bletch after being insulted by Trevor. Bletch is having sex with Samantha, but hides the tryst. Although Bletch is physically disgusted by Heidi, he insincerely comforts her since he needs her talent on the show.\nLater Samantha insults Heidi, claiming Bletch really wants Samantha. Distraught, Heidi drowns her sorrows in an entire chocolate cake, as she reminisces about her past romance with Bletch in a black-and-white flashback to her days as a lounge singer. Belching caused by the cake causes Heidi to lay waste to the set during the rehearsal of a feature number; Sebastian (a fox) then lambasts her. Heidi rushes to Bletch for emotional affirmation, but he is unable to spare her the sight of Samantha performing oral sex on him. Heidi locks herself in her room and refuses to perform, but relents after Bletch has make-up sex with her.\nHeidi's performance helps secure the Feebles a syndicated series. Shortly afterwards, Heidi attempts to seduce Bletch in his office, but Bletch completely disowns her since Samantha is now to be the star of the show. Unfortunately, Bletch is unaware of Heidi's extremely fragile mental state.\nRobert and Lucille\nRobert shows up for his first day as a cast member, and is accosted by F.W. (a fly), who tries to corrupt Robert into informing on the cast.\nArthur (a worm) rescues Robert and shows him around, where Robert sees Lucille for the first time. Although he is romantically terrified of her at first, he later summons up enough courage to ask her out and they fall in love. Later Trevor drugs Lucille to manipulate her into performing in his pornographic films. Robert walks in on the drugging, but misinterprets it as Lucille's decision, and disowns her for being a drunk. They make up later after Robert saves her from Heidi's crazed gun rampage, and they eventually get married and have two children.\nThe Big One\nDennis (an aardvark) is shown peeping on Harry in a threesome with two female rabbits. Harry feels physically ill after this episode and is accosted by F.W., who assumes he has a sexually transmittable disease (STD) and wants to publish the scandal. Dr. Quack (a duck) diagnoses Harry with \"The Big One\". F.W. publishes the scandal in a local tabloid – to the dismay of Bletch, who presumably wants to avoid negative press on the cast. Trevor lures F.W. into the bathroom, where Bletch tears his wings off and flushes F.W. down the toilet. After vomiting all over the stage in the live performance, Harry finally learns that he only has 'bunny pox'. Unfortunately, while rejoicing in the news that \"The Big One\" will not cause his death, Harry's head is blown apart by a gunshot during Heidi's rampage.\nSexcapades\nTrevor is shooting a porn film in the basement with the Masked Masochist (a weta) and Madam Bovine (a cow). They are interrupted by Robert, who mistakes the scene for torture and tries to save Bovine, who in turn accidentally crushes the Masked Masochist, suffocating him. Trevor later replaces him with Dennis (who has a snout resembling male genitalia) to perform 'nasal sex' on Bovine.\nDrug Running\nTrevor is approached by a sniveling Wynyard looking for his fix, but the drugs have not yet been delivered. Bletch is later shown on a golf course consummating a deal with Cedric (a warthog). However, after testing on Dennis, the drugs provided by Cedric turn out to be household borax, infuriating Bletch. Cedric's agent Louie (a dog) is literally liquefied after being force-fed some of the borax by Bletch's henchmen.\nBletch and his cronies venture to the docklands to fight Cedric and his crab-crewmen. Bletch's side prevails after killing Cedric and the crabs, maneuvering past a huge spider, and driving through the insides of Cedric's boss Mr. Big (a whale). However, the spider eats the head of Barry (a bulldog).\nWhen the drugs finally arrive at the theatre, Wynyard is finally able to get his fix, which puts him into a stupor.\nThe Show\nWhile the cast performs an opera number, Sebastian lambasts Robert for not failing his part as an extra on the stage. As punishment, he assigns Robert the task of replacing Wynyard's assistant, who has just been killed by Wynyard's knife throwing while going through drug withdrawal. Wynyard guilt-trips Robert into giving him money for drugs, after telling him a horror story about his time in Vietnam (shown as a flashback parodying The Deer Hunter). He eventually gets his fix from Trevor and injects himself into a deep slumber.\nThe acts gradually disintegrate – Heidi nearly destroys the set by botching a swing, Abi the Indian mystic (a humanoid) incapacitates himself by contorting himself into a ball, and Sid's tribble-like pets are crushed by a barrel. Seeing his show in shambles, Sebastian tries to convince Bletch to feature his personal performance, the sexually explicit number \"Sodomy\" (which he claims to have done before). This is summarily rejected by Bletch, who physically throws Sebastian out of his office who curses Bletch for his inaction. Sebastian later decides to use the number anyway when the situation gets worse and performs it in front of the silent and unamused live audience, much to Bletch's horror (who then schemes to have him eliminated when he gets the chance).\nThe Elephant and the Chicken\nSandy accuses Sid of being the father of their chicken-elephant child, to his dismay and denial. During the live show, Sandy again accosts Sid on stage with the paternity suit, declaring she wants everyone to know. During a later tragic crossfire scene, Sid braves the crazed Heidi's automatic fire to save his son. His heroism costs the elephant two bloody knee wounds, and he accidentally crushes Sandy's shot-off head (when she demanded the crazed Heidi to shoot Sid, but was shot by Heidi instead) after it squawks out one final invective.\nThe Climax\nWhile the live show is proceeding elsewhere, Heidi attempts suicide by hanging, but her weight breaks the chandelier from the ceiling and she falls through the floor. She makes her way to Bletch's machine gun and tries to kill herself, but at the last moment, Samantha shows up and taunts her. Heidi, fed up with the cat's taunting and meddling with her life, drops all thoughts of suicide and responds by killing Samantha with the gun. Meanwhile, Wynyard, in a drugged stupor, tries to kill Robert before accidentally killing himself with his own knife (and the cheering audience not knowing it is real). Sebastian does his \"Sodomy\" number before getting injured by a prop, while Heidi rampages over the entire set on a killing spree (even shooting down any cameras near her). She finally finds Bletch and pumps many rounds into him as well. Bletch lies to Heidi about loving her having regret for all his actions, which distracts and brings her back to her senses and into dropping her gun and defenses before he then orders Trevor to kill her. Trevor fires at Heidi and grazes her shoulder, but he then prepares to deal the finishing shot. However, Robert swings in just in the nick of time to kick Trevor, giving Heidi the chance to get her gun back first and shreds the rat. Heidi then literally blows Bletch's brain out when he tries to escape. Realizing that she killed her love and ruined her career, she gives up her gun (promising to turn herself over to the authorities) and sadly sings \"Garden of Love\", leading into the epilogue and the credits.\n=== Epilogue ===\nThe epilogue reveals the fates of only six survivors: Sid gets extensive repair on his kneecaps after being shot by Heidi and works in an orchard as a struggling horticulturist with Seymour. Arthur received an OBE for his lifelong service at the theater and retires to the country. Sebastian recovers from his injuries and achieved worldwide fame for his best seller The Feeble Variety Massacre: One Man's Act of Heroism! and is negotiating film rights. Robert, now an award-winning fashion photographer for a women's magazine, and Lucille are married with two children. Finally, Heidi, whose spree resulted in her imprisonment in a women's penitentiary for ten years (implying that, although released in 1989, the film's events occurred in the 1970s), has been rehabilitated under the community and now works under a new identity on the check-out counter of a large supermarket."}