{"mid": "Melancholia", "IMDB_id": "tt1527186", "title": "Melancholia", "plot": "The film begins with an introductory sequence (like an operatic overture) involving the main characters and images from space and introducing many of the film's visual leitmotifs. These are motifs of virtually still images revealing the key elements of the film: Justine the bride in deep melancholy with birds falling behind her; of a lawn with trees and sundial with two different shadows; Pieter Brueghel's The Hunters in the Snow (often used as interpretation of an idealised nostalgia) burning; and the black horse collapsing in slow motion; Justine as a bride being swept along by a river; her wedding dress tangled in plant matter; and finally Justine and her nephew building their magic cave before Melancholia crashes into Earth.\n=== Part One: \"Justine\" ===\nA clumsy, oversized limousine struggles and fails to negotiate a curve in the road. Newlyweds Justine and Michael arrive two hours late for their own reception at the estate of Justine's sister, Claire, and her husband, John. Justine notices a particularly bright red star in the night sky, which John identifies as Antares. Justine and Michael enter their reception, being asked by a butler to guess how many beans are in a bottle (one of many party events planned by Claire). Justine leaves before she can answer, Michael says 2 million and six. When asked to give an answer for his wife, he replies that he \"daren't do that\".\nJustine has a dysfunctional family: brother-in-law John appears to resent having to pay for the wedding; father Dexter is hedonistic and selfish to the point of narcissism, while mother Gaby is brutally honest and jaded to the point of getting herself thrown out of the wedding. No one asks what Justine wants, or why she is unhappy, but throughout her wedding she is praised for being beautiful. Claire urges Justine to hide her debilitating melancholy from her new husband Michael. Justine flees the wedding reception despite being held back by her wedding dress, which tears. She goes to the golf course and watches the night sky, squatting and urinating on the 18th hole.\nJustine's boss, Jack, is ruthless, greedy, and gluttonous. During the most personal part of his wedding speech, he is hustling her to meet a work deadline (she writes copy) on the night of her wedding. He pushes her throughout the evening to create a tag line to promote a campaign based on a modern facsimile of Bruegel’s The Land of Cockaigne (mythical land of excess). She later opens a book at this picture. During a critical part of the wedding, the cake cutting, Justine and Gaby independently escape to have baths.\nJustine's boss's nephew, Tim, is given the chance to exploit the opportunity to get the tag line at all costs to promote his career, a task similar to what Justine was previously so successful at. He reluctantly, but doggedly, pursues Justine throughout the wedding reception. She cannot consummate her marriage with her husband and goes out onto a sand trap and has sex with Tim. Tim is later fired for his failure, and Justine aggressively resigns. Justine and Michael talk and decide that their marriage was a failure. Michael departs. Early the following morning, while horseback riding with Claire, Justine notices Antares is no longer visible in the sky.\n=== Part Two: \"Claire\" ===\nJohn explains that the reason for Antares' disappearance was because the newly discovered planet Melancholia was blocking the star from view. Melancholia, a rogue planet that entered the Solar System from behind the Sun, becomes visible in the sky as it approaches ever closer to Earth. John is excited about the planet and looks forward to the \"fly-by\" predicted by scientists.\nJustine's depression has worsened. Her sister is unable to wash her in the bath. Justine says she is so numb that even her favourite dish tastes of ash. As Justine loses ground, her connection to the black horse becomes more remote and frustrated. On two occasions, the horse refuses to cross a bridge over a river. Justine becomes more brutal as her frustration builds, finally mercilessly whipping the horse to the ground.\nClaire is very fearful that the end of the world is imminent, despite her husband's assurances. She searches the Internet and finds an article predicting that Melancholia and the Earth will in fact collide. Justine tells her sister that she \"knows\" some things, like the number of beans in the bottle (at the wedding reception); she is certain that the two planets will collide, and moreover that this is a good thing since life on earth itself is \"evil\".\nOne night, Melancholia passes closely as predicted by the scientists, to great relief. The next day, however, Claire realizes that Melancholia is circling back as predicted by the Internet article. John is found dead in the black horse’s stable, having poisoned himself. Claire releases the horse. Justine, appearing to recover, has a bath, stating that she is now all clean. Claire begins to panic and tries to escape the estate with her son but the golf cart she is riding shuts down as she attempts to cross the same bridge as Justine did earlier. Returned to the lodge, Claire begins to accept the inevitable and suggests getting together on the terrace with wine and music. Justine dismisses her idea with brutal honesty.\nClaire's son is frightened, but is reassured by Justine who says that they can be safe in a \"magic cave\", something she has promised several times to build. The three of them sit in a sort of unfinished tepee as Melancholia fills up the sky and the world comes to an end."}