{"mid": "MemphisBelle", "IMDB_id": "tt0100133", "title": "Memphis Belle", "plot": "In May 1943, the crew of the Memphis Belle, a Boeing B-17 Flying Fortress of the US Army Air Force, are grounded in England while their aircraft is repaired.\nThe group is under the command of Col. Craig Harriman (David Strathairn), a no-nonsense, stoical leader, tasked with keeping the pressure on Nazi targets. An Army publicist, Lt. Col. Bruce Derringer (John Lithgow) is visiting the base, to interview the Belle crew in anticipation of their flying their 25th mission, a requirement to complete their tour of duty.\nDerringer is eager to use the crew on a war bonds tour stateside. He believes their success would help the war effort, and confides to Harriman that many people back home are upset at the losses the Air Force has suffered. Some are beginning to think daylight bombing is ineffective, while Harriman openly favors it.\nThe officers of the squadron are informed the target for the day will be Bremen, Germany. After a delay due to poor weather over the target, the Memphis Belle and her squadron are airborne. They are soon assembled in formation with bomb group and their escort of North American P-51 Mustang fighters. They face frequent harassment by defending German Messerschmitt Bf 109 fighters along the way. Eventually the escorting fighters, low on fuel, turn away, while the bombers continue alone.\nBack at the base, Harriman and Derringer have harsh words after the latter starts decorating the mess hall for a celebration upon the Belle's return. Derringer accuses Harriman of being cold-hearted and concerned only with advancing his military career. In response, Harriman brings Derringer into his office and angrily dumps a pile of letters on his desk and forces Derringer to read some of them. They are replies Harriman received from the grieving families of lost airmen.\nMeanwhile, the bombers have suffered significant losses. The German interceptors focus their attacks on the leading aircraft in the formation. The first lead bomber, Windy City, loses its engines and explodes in front of the Belle, piloted by Captain Dennis Dearborn (Matthew Modine) and co-pilot 1st Lt. Luke Sinclair (Tate Donovan). More attacks ensue, and the replacement lead bomber, C Cup, is forced to break formation when its nose is crippled by a Bf 109. The crew of the Belle watch in horror when they see an airman fall out of the stricken aircraft without a parachute. The Belle is then tasked to lead the formation to the target.\nFinding the target – an aircraft assembly plant – becomes difficult as bombardier 1st Lt. Val Kozlowski (Billy Zane) can't see the target because of a smokescreen the Germans have created. Dearborn aborts the initial bomb run and orders the formation to circle around for a second attempt, which frustrates the Belle crew who have had to endure the ongoing attacks from the Germans. On the second run, Kozlowski spots the assembly plant through a gap in the smokescreen and the bombers successfully hit their target. Once clear of the anti-aircraft fire, they are again attacked by fighters. Staff Sgt. Richard \"Rascal\" Moore's (Sean Astin) ball turret is destroyed, but he is saved by the safety strap. The attacks continue, blasting a hole in the fuselage, tearing off a large chunk of the tail, and setting the number four engine on fire. Radio operator Staff Sgt. (T/3) Danny \"Danny Boy\" Daly (Eric Stoltz), is wounded in the attacks, which puts Kozlowski in a difficult position when the crew enlists his self-exaggerated medical \"expertise\" to save the injured radioman. Meanwhile, Dearborn and Sinclair skillfully drop the aircraft into a steep dive and put the fire out, despite great risk of losing the aircraft.\nAs the B-17 limps closer to base, Dearborn orders the landing gear dropped. Only one wheel descends due to electrical failure caused by battle damage, but the crew are able to manually lower the malfunctioning wheel just before landing. The ground crew and a humbled Lt. Colonel Derringer race to greet them with jubilant cheers. The crew exits the battered bomber and celebrate their victory with Daly on an ambulance."}