{"mid": "MenaceIISociety", "IMDB_id": "tt0107554", "title": "Menace II Society", "plot": "Caine Lawson and his best friend Kevin Anderson (O-Dog) enter a local store to buy malt liquor, but are suspiciously watched and goaded by a Korean storekeeper and his wife to hurriedly pay and leave. As they leave, the storekeeper makes a remark to O-Dog about his mother, angering O-Dog. An argument begins, but soon turns deadly as O-Dog shoots and kills the Korean couple. He then takes the store video surveillance tape and empties the cash register. In a flashback, it is revealed that Caine’s father was a drug dealer who was killed in a drug deal when Caine was 10, and his mother was a heroin addict who later died of a drug overdose, as a result he went to go live with his grandparents. Later, Caine and his cousin Harold are carjacked and Harold is killed, with Caine shot. O-Dog tells Caine he's discovered who and where the carjackers are. To avenge for Harold, O-Dog and Caine find and kill the assailants.\nCaine and O-Dog are hired by a local hood Chauncey, for a car insurance scheme but are caught in the process and arrested by police. A detective attempts to link Caine to the store killings by matching fingerprints, but is unsuccessful and Caine is released. During the film, Caine's grandfather and Mr. Butler (Sharif's father and a school teacher) tell Caine to change his ways or he'll end up either in prison or dead. Stacy and Sharif also try to keep Caine away from further trouble by convincing Caine to leave with them to Kansas, but Caine is dismissive towards everyone's advice. Caine begins his hustler lifestyle by buying a new car from a chop shop and robbing a local for his Dayton wheels. Caine then purchases a large quantity of cocaine to cook into crack cocaine in order to sell. Caine also meets a local girl named Ilena while with his crew at a BBQ. Caine and Sharif are driving 1 night until the police stop and pull them over. The police take them to the wrong neighborhood and engage police brutality on Caine and Sharif. While in the hospital Caine's friend Ronnie tells him that she has found a job in Atlanta and invites him to come with her. Caine is hesitant at first, but later agrees to go to Atlanta with Ronnie. During a prison visit, Pernell encourages Caine to leave with Ronnie to Atlanta. At a party, a drunken Chauncey makes moves towards Ronnie, angering Caine. As a result, Caine lunges at and starts pistol-whipping Chauncey. Stacy and Sharif intervene and restrain Caine. Chauncey, in turn, sends a copy of the videotape to the police.\nBefore leaving for Atlanta, Caine gets a visit at his house from Ilena's cousin. They have a small exchange with Ilena's cousin berating Caine for the way he's treated Ilena. During the altercation, Caine beats Ilena's cousin. Shortly after, Caine's grandparents kick him out of their house. Moments later, it is shown that Ilena's cousin is seeking revenge on Caine.\nJust as Caine is packing up the car to move to Atlanta, Georgia, Ilena's cousin and a gang of gunmen execute a drive by on the house during which Sharif is killed and Caine is fatally wounded. As Caine slowly dies in Stacy's arms, he sees flashbacks of the events that led to this final moment, and recalls his grandfather asking him 1 if he cares whether he lives or dies; he realizes he does, but now it's too late. O Dog is last seen getting arrested by the police, presumably for the convenience store robbery/murder."}