{"mid": "MenInBlack3", "IMDB_id": "tt1409024", "title": "Men in Black 3", "plot": "The Men in Black are a secret law-enforcement agency that is responsible for policing the extraterrestrial life hidden on Earth, as well as protecting the world from any aliens who attempt to destroy/invade the planet.The film begins on LunarMax, a MiB prison situated on the moon. A one-armed criminal, a Boglodite named Boris the Animal, stages a jailbreak (along the way killing Obadiah Price, a fellow inmate he'd made a deal with). His intention is to rewrite history, with Agent K, the one who arrested and imprisoned him, being a major factor in his plan...On Earth, Agent K and his partner Agent J cover up an arrival of an alien spacecraft, and hear of the prison break. At a Chinese restaurant thats a local haunt for aliens, Agent K discovers Boris (who had previously gone to see Obadiah's son Jeffrey) and the two fight, with J joining in. K is upset that the alien he should have killed is out loose again; he deems it his own affair and forbids J to help him, suspending him. A puzzled J checks up on Boris: he appeared in 1969 to stop the prevention of the ArcNet Shield, a device that K deployed to protect the world from harm (but which killed off the Boglodites, as they can only survive by feeding off worlds). He managed to kill on 15 July 1969 an alien named Roman the Fabulous and on the following day... at this point O cuts him off and tells him not to investigate any further. That night, as K waits for Boris with a gun in his hand, he suddenly vanishes...The next morning, J discovers that he has a new partner, the liberated Agent AA, and that K has been dead for forty years (having been killed by Boris the Animal on 16th July 1969). O notices he is suffering from headaches and craves chocolate milk, which she explains are symptoms of time-fracture (aka the crime of interfering with history, which Obadiah Price was imprisoned for). At this point a Boglodite armada appears; J learns that there was nothing to hold them at bay, with no K to deploy the ArcNet. He theorizes that Boris went back in time to 1969 to kill K, thus changing history to what it was, and proposes to follow him; he heads to Jeffrey Price, who had provided Boris a time-jump device, and gets another one from him, and activates it by jumping off the Chrysler Building just as the Boglodites begin their assault...J arrives in 15 July 1969, with the intention to catch Boris as he is about to murder Roman the Fabulous. However, he is delayed from navigating the era of 1969 (most notably by an altercation with two racist cops), and gets there too late to stop Romans murder by 1969 Boris. He encounters 1969 Agent K, who subdues him and brings him to MiB headquarters. J tells K nothing, but when threatened with getting his memory erased he tells K part of the truth: he came from the future in pursuit of another time-traveler whos trying to change history.K and J follow a trail of clues to Andy Warhols Factory complex, where Warhol is revealed to be MiB Agent W. He notifies them of Griffin, an Arcanian being who has the ability to foresee all timelines and futures; Griffins planet was destroyed by the Boglodites, so he came to live on Earth and brought with him a device which will prevent the Boglodites from consuming the Earth. 1969 Boris arrives at the Factory in search of Griffin, who makes a quick exit with Boris in fast pursuit (to Js displeasure, although K doesnt seem to get too worried).J and K eventually track down Griffin at Shea Stadium, where he is foreseeing the future victory for the Mets baseball team. 1969 Boris appears and captures Griffin, but J and K are able to rescue Griffin, although Boris gets away. Griffin gives them the ArcNet and explains it can only work in zero gravity: K gets the idea to head to Cape Canaveral on 16th July 1969 (the day the Apollo 11 ship launched), and attach it to the spacecraft. He is immovable in this plan, so J reveals to him his imminent death, to Ks shock. Griffin explains to J that for history to work out fine K must be the one to deploy the ArcNet; J asks if there is any chance K will survive, and Griffin is affirmative, but somberly notes that at any point of death occurring, it will occur. Meanwhile, present Boris arrives in 1969 and meets his younger self...K, J and Griffin arrive at Cape Canaveral, where they are accosted by a Colonel guarding the facility. Griffin instructs them to tell the truth to succeed, which they do; the Colonel doesnt believe them, but when Griffin shows him the future he changes his mind and assists J and K in reaching the shuttle. Griffin takes his leave at this point, advising J that when K blows Boriss arm off the timeline will be restored back to normal and he can return home.J and K confront the two Borises, who were waiting for them at the shuttle launching pad. K and 1969 Boris fight, while J takes on the current Boris. J is mortally wounded by Boris, but manages to knock Boris into the launching shuttles exhaust blast; he then time-jumps to before Boriss attack, managing to repeat himself and avoid Boriss attacks. Meanwhile, K blows off 1969 Boriss arm and manages to attach the ArcNet to the shuttle as it launches.In the aftermath of the launch, as J is about to time-jump home he witnesses from afar K thanking the Colonel for his assistance and offering him a job with MiB. Then 1969 Boris appears and kills the Colonel, but K kills him instantly (1969 Boris expected to be arrested for the next 40 years and then go back in time, but J had previously advised K to straightaway execute Boris when he surrenders). Then K witnesses a young boy, the Colonels son, arrive looking for his father; K sadly neuralyzes the boy and takes him for a walk. A shocked J realizes that that boy was him, and that K has played a vital part in his life. Upon returning to the present, he tells K he knows what happened and understands, and K says it was a privilege to have J as his partner.The film ends with Griffin happily observing that alls well that ended well... then he sees K forgot to leave a tip, and foresees a meteor smashing into the Earth. Then K returns and leaves the tip, and with relief Griffin foresees a satellite appear in the meteors path, halting it and keeping the Earth safe."}