{"mid": "MenOfWar", "IMDB_id": "tt0110490", "title": "Men of War", "plot": "Nick Gunar, an ex-soldier, is down and out in Chicago in a typically cold winter. When two men offer him a job on a tropical island, he reluctantly agrees and gathers together a group of soldier friends also down on their luck. They arrive in the Far East and come up against the evil Keefer, who was with Nick in Angola. He now owns the local police force and shows Nick and the others who's boss. Afterwards, Nick and his crew go to the island, which they find is occupied by peaceful natives—natives who the mercenaries are supposed to convince to abandon the island. Nick respects them, but there is friction caused by a few mercenaries who want to kill natives to persuade them to leave, or, alternatively, to get them to divulge where a suspected treasure might be. Nick stops them and finds out the \"treasure\" they are after is guano (which does have value in sufficient quantities). The two men paying the mercenaries intend to strip mine the island to get it, leaving the natives and their homes as casualties. The group divides up, with half wishing to finish the job for which they were paid, and the other half, led by Nick, wishing to protect the islanders. Nick hands the former group their pay and orders them to leave the island as he refuses to kill the natives to do the job.\nMeanwhile, Keefer and the Colonel, who suspect there is money to be made, join the group Nick kicked out. They then storm the island with many new mercenaries, hoping to force off or exterminate Nick, his soldiers, and the natives. Many of the invaders are shot, stabbed, blown up, and worse in the ensuing battle. Though poorly armed, the natives make up for this in trickery and local knowledge. Nick has a bazooka-style weapon (a Carl Gustav), which causes mayhem. After a number of attacks by both sides, many are dead and there is a final showdown between Nick and Keefer; Keefer gains the upper hand in the fist fight and attempts to strangle Nick to death while drowning him. Nick manages to grab a nearby bone and stab Keefer in the neck, then proceeds to drown him. As the natives bury their dead, the few surviving mercenaries leave, but Nick stays behind."}