{"mid": "MenWomenAndChildren", "IMDB_id": "tt3179568", "title": "Men, Women & Children", "plot": "The film opens with a narration about the Voyager satellite before proceeding to tell the story of several families and the various ways the internet affects their lives. Donald and Helen Truby are married couple who have become sexually unsatisfied. Their teenage son Chris has been viewing pornography since the age of 10 with his preferences becoming more and more extreme to the point he is unable to become aroused by material deemed \"normal\" by society. Tim Mooney is a high school student and football star, of which his father Kent is very proud, who has become depressed in the wake of his parents' divorce and abandonment by his mother. He quits the football team and begins to spend all his time playing an MMORPG. He has also come to believe, referencing Carl Sagan's reflections about the Pale Blue Dot, that human life is insignificant in context of the universe. Hanna is a high school girl who wishes to be famous one day. Her mother Joan helps her maintain an online modeling site where she posts inappropriate pictures of herself in lingerie for subscribers who request private photo sessions. Brandy Beltmeyer is a classmate of Tim's who is introverted and has her online content constantly monitored by her overprotective mother Patricia. Unbeknownst to her mother, Brandy has a separate SIM card she switches while away from home and a secret Tumblr account she uses to express herself. Allison Doss is a friend of Hannah's who feels sexually inexperienced compared to Hannah and wishes to have sex with a boy named Brandon Lender. To make herself seem more attractive, she turns to dietary articles online to drastically lose weight.\nAfter seeing a television ad for the website Ashley Madison one night, Helen creates an account and begins having multiple affairs, while Donald starts to regularly visit escorts after failing to initiate sex with Helen for almost two months. Chris enters a relationship with Hannah over the course of doing a school project together, and tries to condition himself to become aroused by \"traditional means\" of simply seeing her many sexts with him. Hannah meanwhile has auditioned for an acting competition that will land her a television role. Kent, feeling distant from his son, attends an online content awareness meeting held by Patricia in order to better understand Tim's interest in video games, while Joan also attends the meeting to learn more about what she is legally allowed to put on her daughter's website. Both are amused by Patricia's obvious paranoia and begin a relationship. Meanwhile, Tim and Brandy also begin a relationship, but Patricia initially intercepts their messages while Brandy is at home. Brandy tells Tim about her Tumblr account, and they soon become a couple, with Tim confessing that she makes him feel that everything is not pointless. While playing online with his friends, Tim sees a Facebook post by his mother showing pictures of her being happily remarried. When he shares this with his friends, they begin to post lewd comments, which he ignores. Allison is successful in having sex with Brandon while visiting a friend's house, but he treats the whole affair as casual and is clearly not interested in a relationship.\nAllison collapses during school and is brought to the hospital, where she learns she had a miscarriage due to malnourishment, both facts which shock her parents. When she informs Brandon, his only concern is people discovering they had sex. Hannah and Chris start to initiate sex, but Chris fails to become aroused. Hannah later tells her friends that they had sex, causing Chris to confront her. She admits she only saw him as her \"best shot\" to lose her virginity, and claims he has \"sexual issues\", causing them to break up. Joan learns that the competition has disqualified Hannah because of the website, even though her audition was the best. Donald accidentally discovers Helen's Ashley Madison account, and goes to the same bar she is having an affair at. Seeing she has been caught, she tries to discuss it with Donald the next morning, only for him to admit he has also been having affairs, and says it is better if they just ignore what they have done. Joan confesses to Kent about the website, and is distraught that her daughter's real chance to be famous has been ruined because of her poor parenting. Kent, shocked by the news, says it is best of they do not see each other. Patricia discovers Brandy's Tumblr page, and after scrolling through her conversations with Tim and seeing his own page covered in video game content, is overwhelmed with fear and confiscates all of her online privileges. Kent reads all the lewd comments on Tim's game, and confronts him about it. Tim brings up the pictures his mother posted on Facebook, causing Kent to say she abandoned the both of them. He deletes the game and demands Tim play football next year, causing Tim to have a break down.\nJoan tells Hannah about being disqualified from the competition, and says she has taken down the site, admitting she was wrong to support it. Hannah is furious, but Joan says she is still the parent. Allison is made to walk two miles to Brandon's house in the middle of the night in order to talk to him, but when she arrives she realizes how selfish he is and throws a rock through his window before leaving. When Tim attempts to reach out to Brandy for support, Patricia poses as Brandy, claiming she is bored of him and says she will block him if he texts her again. Despondent, Tim overdoses on his antidepressants. Brandy rushes to Tim's house, where she and Kent find him on the floor. They rush him to the emergency room, where he is successfully revived. While searching for Brandy, Patricia finds her at the hospital and figures out what happened. Bursting into tears after realizing her actions nearly caused Tim's death, she returns home and deactivates the surveillance device she uses to monitor Brandy. After reconciling with Tim and realizing how hard being a single parent is, Kent reconnects with Joan. The narrator closes the film by quoting The Pale Blue Dot while showing the Voyager satellite drifting through space."}