{"mid": "Mermaids", "IMDB_id": "tt0100140", "title": "Mermaids", "plot": "The film is narrated by Charlotte Flax, a quirky and awkward 15-year old girl living in Oklahoma with her single, eccentric mother, Rachel (whom she calls \"Mrs. Flax\"), and her sweet nine-year-old sister, Kate. Rachel's daughters have different fathers—Charlotte is a product of a teenage romance and Kate is from an affair with an athlete.\nThe narration begins in early fall of 1963. Just as Rachel's latest fling with her married employer ends, she decides to relocate with Charlotte and Kate once again. This time, they move to a new home near a convent in the small town of Eastport in Massachusetts. Charlotte has an unusual obsession with Catholicism and is always reminded by Rachel that they are Jewish. She idolizes the nuns living in the convent, wanting to become one herself. Kate, on the other hand, loves oceans and swimming. She apparently learned to do so when she was a baby, giving her Olympic potential and allowing her to win many competitions.\nIn Eastport, Charlotte becomes especially interested in Joe Poretti, the 26-year-old handsome caretaker of the convent and local school bus driver, while Rachel falls in love with a local shop owner named Lou Landsky. After the assassination of John F. Kennedy, Charlotte believes she is comforting Joe in mourning, and they end up kissing in the bell tower where he rings the church bell. After the encounter, she begins fasting in order to purge her sinful thoughts, but eventually passes out from hunger and starts eating again.\nSoon fearing that God may be punishing her by making her pregnant through immaculate conception and unable to talk to her mother about it, she steals Rachel's car and runs away. She stops at the house of a \"perfect nuclear family\" in New Haven, Connecticut, asking to spend the night, telling them her name is Sal Val and other wild stories, which they don't seem to completely believe. Later on, she is picked up by Lou and taken home, where Charlotte immediately receives a harsh scolding from Rachel.\nWhen Rachel calms down after drinking some Scotch liquor, she tells Charlotte that she was worried sick about her safety, and, thinking that it's her fault that Charlotte ran away from home, admits that even though she's not an expert in parenting, she's willing to compromise and try her best to take care of both Charlotte and Kate. The next day, Charlotte makes an appointment at the nearest hospital under the name Joan Arc, where she goes to see an obstetrician and is told she is still a virgin. Relieved, she goes home, dispelled of her assumption that \"one kiss can get you pregnant\".\nAt a New Year's Eve costume party, Lou asks Rachel to move in with him but she declines, reminding him that they're both still married to different spouses. However, she's not willing to break up with him nor let their relationship progress either. They have a big fight which ends with Lou calmly leaving in disappointment. Rachel then asks Joe for a ride home, before she wishes him a happy New Year and kisses him. Charlotte sees this and feels that her mother is trying to steal him away.\nThe night after the incident, Charlotte dresses up in Rachel's clothes and makeup, and she and Kate get drunk on wine. Hearing the church bells ringing, she then takes Kate to the convent to see Joe. Kate decides to stay behind and collect rocks while Charlotte goes up to the bell tower to find Joe and they have sex. Unbeknownst to them, Kate falls into a river and almost drowns, but is saved by the nuns and is taken to the hospital.\nVery angry at the turn of events, Rachel has a big altercation with Charlotte, as she is wanting to move again to avoid embarrassment since the whole town is talking about Charlotte and Joe. Eventually, the two have a heart-to-heart conversation and Charlotte convinces Rachel to stay in Eastport for at least another year.\nTime passes in the small town and Rachel's relationship with Lou progresses. Joe moves to California and opens up a plant nursery, but keeps in touch with Charlotte via postcards. Charlotte, in turn, gains a reputation in high school due to her sexual encounter with Joe and replaces her Catholicism obsession with Greek mythology, with Rachel now reminding her that they are not Greek. Kate recovered and is swimming again, although the accident left her hearing sometimes \"sounding fuzzy\". The film ends with all three of them dancing while setting the table for dinner."}