{"mid": "Metropolis", "IMDB_id": "tt0017136", "title": "Metropolis", "plot": "In the futuristic year of 2026, in the city of Metropolis, wealthy industrialists reign from high-rise tower complexes, while underground-dwelling workers toil to operate the underground machines that power the city. Joh Fredersen is the city's master. His son Freder idles away his time in a pleasure garden, but is interrupted by the arrival of a young woman named Maria, who has brought a group of workers' children to witness the lifestyle of the rich. Maria and the children are ushered away, but Freder, fascinated, goes to the machine rooms to find her. Witnessing the explosion of a huge machine that kills and injures several workers, he hurries to tell Fredersen about the accident. Grot, foreman of the Heart Machine, brings to Fredersen secret maps found on the dead workers. Freder secretly rebels against Fredersen by deciding to help the workers, after seeing his father's cold indifference towards the harsh conditions they face.\nFredersen takes the maps to the inventor Rotwang to learn their meaning. Rotwang had been in love with a woman named Hel, who left him to marry Fredersen and later died giving birth to Freder. Rotwang shows Fredersen a robot he has built to \"resurrect\" Hel. The maps show a network of catacombs beneath Metropolis, and the two men go to investigate. They eavesdrop on a gathering of workers, including Freder. Maria addresses them, prophesying the arrival of a mediator who can bring the working and ruling classes together. Freder believes that he could fill the role and declares his love for Maria. Fredersen orders Rotwang to give Maria's likeness to the robot so that it can ruin her reputation among the workers, unaware that Rotwang plans to use the robot to kill Freder and bring down Metropolis. Rotwang kidnaps Maria, transfers her likeness to the robot and sends her to Fredersen. Freder finds the two embracing and, believing it is the real Maria, falls into a prolonged delirium. Intercut with his hallucinations, the false Maria unleashes chaos throughout Metropolis, driving men to murder and stirring dissent amongst the workers.\nFreder recovers and returns to the catacombs. Finding the false Maria urging the workers to rise up and destroy the machines, Freder accuses her of not being the real Maria. The workers follow the false Maria from their city to the machine rooms, leaving their children behind. They destroy the Heart Machine, which causes the workers' city below to flood. The real Maria, having escaped from Rotwang's house, rescues the children with the help of Freder. Grot berates the celebrating workers for abandoning their children in the flooded city. Believing their children to be dead, the hysterical workers capture the false Maria and burn her at the stake. A horrified Freder watches, not understanding the deception until the fire reveals her to be a robot. Rotwang chases the real Maria to the roof of the cathedral, pursued by Freder, and the two men fight as Fredersen and the workers watch from the street. Rotwang falls to his death. Freder fulfills his role as mediator by linking the hands of Fredersen and Grot to bring them together."}