{"mid": "MiamiBlues", "IMDB_id": "tt0100143", "title": "Miami Blues", "plot": "Frederick Frenger, Jr. (who asks to be called \"Junior\"), a violent psychopath recently released from a California prison, starts a new life in Miami. Before leaving the airport, he steals luggage and kills a Hare Krishna after breaking his finger.\nJunior checks into a hotel and hooks up with Susie Waggoner, a naive prostitute who is a student at a community college. They become romantically involved and take a house together, with Susie blissfully unaware of Junior's criminal activities and harboring fantasies of living happily ever after.\nAn investigation of the Hare Krishna murder leads grizzled cop Sgt. Hoke Moseley to come knocking on their door. Moseley shares a home-cooked dinner with the couple, upon Susie's suggestion, and plays it cool while seemingly indicating to Junior that he's on to him. He overtly suspects Junior has been in prison and wants him to come to the police station for a lineup. Being a proactive criminal, Junior goes to Moseley's home the next day, assaults him, and steals his gun, badge and dentures.\nOne interesting scene is when Junior is with Susie and she is busy taking a bath and working on a haiku. He decides to break into a nearby apartment. He steals a Desert Eagle handgun and a steak. As he is doing this, he speaks aloud a haiku of his own, \"Breaking entering. The dark and lonely places. Finding a big gun\".\nJunior begins using the badge, demanding bribes as rewards after breaking up robberies, only to keep the loot for himself. He's highly enjoying his new role as criminal with a badge and the perks it holds for him.\nSusie happily cooks for him. While at a grocery store, Junior witnesses an armed robbery and decides to break it up. He lectures the gunman about avoiding a life of crime, but the gunman runs a truck over him. Junior complains to Susie that the \"straight life\" has made him too soft.\nMoseley tracks down the couple through a utility account opened up in Susie's name. He pretends to run into her at the grocery store, where they swap recipes. After she lies that she has left Junior, Moseley tells her that Junior is a murderer and that he and the police are looking for him.\nBack home, to test whether he will lie to her, Susie deliberately ruins a pie by adding too much vinegar to it. To her disappointment, Frenger compliments the dessert and eats it with gusto.\nThe next day, Junior asks Susie to drive him around town on errands. Their first stop is a pawn shop, which he robs. In the course of the robbery, the pawnbroker chops off several of Frenger's fingers before being killed by him.\nBadly injured, he limps to the car, but Susie drives away upon realizing what he's done. Moseley pursues him to the house, where he shoots and kills Junior. Junior, being ironic with his last words, tells Moseley, \"Susie's gonna get you, Sarge.\" Susie then arrives and Moseley asks why she stayed with him for so long. She explains that he ate everything she ever cooked and never hit her."}