{"mid": "MichelVaillant", "IMDB_id": "tt0307156", "title": "Michel Vaillant", "plot": "For decades, the Vaillant family has been successfully involved in various kinds of motor racing competitions. Their most notorious driver is Michel, the son of the team's founder and owner Henri and younger brother of Jean-Pierre, the team's manager. One night, Michel's mother Elizabeth has a nightmare involving his death in an accident at the 24 Hours of Le Mans, racing against a car bearing the number 13 from Leader, a team with which the Vaillants had a historic rivalry for more than a quarter of a century. Henri conforts her, assuring that they are not planning to race at Le Mans, that Leader has been out of competition for 5 years and that no one has ever used the number 13 at the race. Meanwhile, in Canada, Michel and his best friend and teammate Steve Warson are both competing in WRC cars. Michel's victory spikes the wrath of Bob Cramer, a ruthless competing driver who is blocked by Vaillant's cars during the race. Cramer ends up threatening Michel's co-pilot, David. A few days later, Henri announces that Vaillant will have an engine at time for Le Mans, and promotes David to the driver's seat at the Rally of Italy, promising him a seat at Michel's car in the 24 hour race if he does well. In Italy, Cramer forces David out of the road, causing him to crash. David is caught in the car's explosion and dies. At the funeral, Michel meets Julie Wood, David's wife. She asks him for his husband's place at Le Mans, and Michel convinces his brother to let her on the team. Meanwhile, the Leader team returns to the competition, by the hand of Ruth, Leader's daughter. They announce that they will race at Le Mans with the number 13, hiring Bob Cramer as one of the drivers. Élisabeth worries that her nightmare can become a reality and tries to dissuade Henri from competing, but he refuses to do so. The weekend at Le Mans starts, and Ruth is determined to stop Vaillant from winning, so she sabotages the car delivery. The Vaillants barely make it on time to compete. This doesn't stop Ruth, and she kidnaps Henri, threatening to kill him if his team wins. Michel initially complies, losing a lot of time each lap. He finally tells Jean-Pierre about Ruth's plan and decides to go and save his father, asking Julie to pose as him during the race. Michel tracks his father's location through the GPS in Ruth's car, but she finds him. Michel is forced by Ruth to drive the Leader, posing as Bob Cramer after an accident puts him out of competition. Ruth and Michel find each other on the track and end up colliding violently, just like in Élisabeth's nightmare. Even though the crash was horrific, they both come out of the wreckage unharmed, and Michel goes with Steve and Julie to rescue Henri from Ruth's henchmen, who start shooting as they flee and injure Steve. The race ends with Steve's Vaillant crossing the line with a flat tire, inches before Leader's car, which had an engine failure and is being pushed by its driver. Unbeknownst to everyone, Michel was posing as Steve in the final laps. They all celebrate yet another Vaillant victory, while Ruth stares blankly in defeat."}