{"mid": "MichaelCollins", "IMDB_id": "tt0117039", "title": "Michael Collins", "plot": "In 1922, Joe O'Reilly attempts to console Kitty Kiernan, who is mourning the death of Michael Collins.\nAt the end of the Easter Rising in 1916, Collins, Harry Boland, Éamon de Valera, and other survivors surrender to the British Army. As the Dublin Metropolitan Police's \"G\" Division identifies the leaders, Collins tells Boland that next time, \"We won't play by their rules, Harry. We'll invent our own.\" All the other leaders die by firing squad, but de Valera, an American citizen, is imprisoned in England. Collins, Boland, and the others are sent to Frongoch internment camp.\nAfter his release, Collins gives a speech at an election rally at the South Longford by-election, 1917. Collins is injured when the Royal Irish Constabulary break up the rally, but is rescued by Boland. While recovering on a friend's farm, they meet Kitty, who begins a romance with Boland. Collins is tipped off by Detective Ned Broy that the British plan to arrest de Valera and his Cabinet. However, de Valera forbids anyone to go into hiding, stating that the ensuing public outcry will force their immediate release. Only Collins and Boland escape arrest and imprisonment, and there are no protests. Boland and Collins travel to England and break de Valera out of Lincoln prison. Angry that Collins has overshadowed him, de Valera announces that he will travel to the United States to seek recognition from Woodrow Wilson, and orders Boland to accompany him. Before they depart, Collins suggests to Boland his belief that de Valera fears leaving them alone together.\nLeft in command, Collins orders the IRA to begin raiding police barracks for weapons. He also issues a statement that all collaboration with the British will be punished by death. Collins then recruits a squad from the IRA's Dublin Brigade, which, on Bloody Sunday, assassinates fourteen British agents. In retaliation, the Black and Tans fire into the crowd at a Gaelic football match at Croke Park. Broy is caught burning documents, and is tortured and killed.\nAfter returning from America empty-handed, de Valera decrees that the IRA must make a formal military attack on The Custom House. Collins argues that fighting conventionally will allow the British to win, but the Cabinet votes to support de Valera. The attack fails catastrophically, leaving six men dead and seventy captured. In the aftermath, Collins declares that the IRA can only hold out for a month. In private, he tells Boland that the IRA will be lucky to hold out for another week. To his surprise, however, the British soon call for a cease fire.\nDe Valera orders Collins to go to London to participate in negotiations with the British, despite Collins's objections that he is not a diplomat. After the signing of the Anglo-Irish Treaty in December 1921, de Valera erupts upon learning that the terms have been published without his agreement. Collins argues that the Treaty gives them the freedom to achieve the Republic, albeit at the expense of six of the nine Ulster counties. De Valera and his supporters resign in protest after the Dáil approves the Treaty 64–57. Both Collins and de Valera try to sway the Irish people in their respective directions. Collins is attacked by an anti-Treaty Republican during a rally, but escapes. In the aftermath, he successfully proposes to Kitty.\nWhen the people vote to approve the Treaty, de Valera refuses to accept the results and orders the IRA to seize the Four Courts in Dublin. Ordered by the Cabinet to retake the Four Courts, Collins (now Chief of Staff of the National Army) is appalled at having to fight former comrades. Arthur Griffith informs him that, if the Irish Free State Army will not deal with the IRA, the British Army will. In the subsequent Battle of Dublin, the IRA is driven from the city. Despite Collins' attempts to capture him, Boland is shot by a sentry while trying to swim the Liffey.\nDevastated by Boland's death, Collins travels to County Cork. He reaches out to de Valera through an intermediary, asking for a peace conference. Without de Valera's knowledge, the intermediary informs Collins that de Valera will meet him at Béal na Bláth the following day. As a convoy of Irish Army vehicles approaches they find a cart laid across the road and IRA men open fire from a nearby hillside. Collins is shot after breaking cover from behind an armoured car. Joe O'Reilly tries to revive Collins but is unsuccessful. Kitty is informed of his death just after trying on her wedding gown.\nCompleting his story, O'Reilly tells Kitty that Collins would not want her to mourn as long as she has."}