{"mid": "MickeysTwiceUponAChristmas", "IMDB_id": "tt0424279", "title": "Mickey's Twice Upon a Christmas", "plot": "The narrator recites the first 10 words of The Night Before Christmas before saying, \"Oh, wait. Different story, but we'll still see a mouse\". The narrator announces new tales of giving and loving, and a book opens to show pop-up elves.\n=== \"Belles on Ice\" ===\nThis first segment tells the story of Minnie Mouse and Daisy Duck, who are competing in an ice skating competition. The girls each are joined by their boyfriends, Mickey and Donald, as they prepare to take the ice. Daisy becomes envious of crowd's reaction to Minnie and attempts to steal the spotlight for herself. Minnie performs several daredevil stunts to regain the spotlight, Daisy summons the Fantasia Hippos, who become her backup skaters, while her counterpart summons the Alligators from the same film. Fed up, Daisy and Minnie argue and shove each other, putting each other at risk, and then try pulling dramatic stunts to draw the attention of the crowds. When Minnie accidentally slipped on a fallen handbell while landing from a stunt blindfolded, Daisy helps Minnie up feeling sorry for her actions. Minnie also feels the same way, and they perform a grand finale.\n=== \"Christmas: Impossible\" ===\nThe second segment tells the story of Huey, Dewey, and Louie Duck celebrating Christmas Eve at their Uncle Scrooge's mansion in Duckburg. Donald Duck and Daisy Duck also join in the festivities. The boys know that they are on the \"naughty list\" for sure, so they travel to the North Pole to write their names on Santa's \"good list\". At Santa's workshop, the trio cause much trouble, such as messing the elves' jobs up, but they and the elves help clean up the mess and save Christmas. Before they leave, they luck into an opportunity to add their names to the \"good list\"; however, they add Uncle Scrooge's name instead, mindful of the fact that he was never written onto the list either. On Christmas, Santa leaves them a note that explains that their actions have caused them to be put on the Good List, too.\n=== \"Christmas Maximus\" ===\nThe third segment's focus is about Max Goof and Goofy celebrating the holidays. A college-age Max brings home his girlfriend Mona to meet Goofy. However, Max is unsure whether or not he wants Mona to meet his dad. Most of the story takes place within the song \"Make Me Look Good\". Max at first is embarrassed by his dad, who shows baby pictures to Mona, but after noticing that his scarf is made by him, he realizes that Goofy is always goofy, and that is why he loves him. Max forgets about being embarrassed and decides to join in the fun when the popcorn making machine goes haywire and causes the house to explode popcorn like a volcano and Mona reveals to have the same kind of teeth like Goofy and Max.\n=== \"Donald's Gift\" ===\nThe fourth segment's focus is about Donald Duck and his Christmas wish of peace and quiet. Daisy Duck and Huey, Dewey, and Louie also appear. As Donald returns home from Christmas shopping, he daydreams and misses his bus. He runs to catch after it, but he is slowed down by a series of well-wishers. Donald becomes increasingly annoyed by the joyous people, and, at home, he is annoyed to hear the same Christmas carols on his radio. When Daisy and his nephews arrive, Donald becomes annoyed that they want to go out so soon after he returned home, but Daisy drags him out. Donald finds that is stuck with the song \"We Wish You a Merry Christmas\", and he inadvertently vandalizes a windows display. After he is kicked out of the mall by a policeman, he feels guilty for his lack of Christmas spirit and helps off-key carolers. Daisy and the boys join him, and Donald sings from his heart.\n=== \"Mickey's Dog-Gone Christmas\" ===\nThe final segment stars Mickey as he makes decorations for the Christmas party, which Pluto keeps interrupting. Pluto attempts to put the star on the tree, but when he destroys all the decorations, an angry Mickey sends Pluto to the dog house. Pluto then gets upset himself feeling unappreciated and decides to run away from home and finds himself shipped to the North Pole, where the reindeer adopt him. At home, Mickey attempts to reconcile, only to find Pluto missing. Mickey posts several \"lost dog\" posters and eventually turns to a department store Santa, who turns out to be the real one. Meanwhile, Pluto becomes homesick, and the reindeer and Santa help Pluto to return home. As Mickey's friends arrive, Pluto completes the Christmas tree decorations, and everyone celebrates Pluto's return, even Donald and Daisy Duck, who had just showed up with Huey, Dewey and Louie, Uncle Scrooge, Max, Goofy and Minnie Mouse. Minnie is also entranced by the decorations. The film concludes with a medley of various carols."}