{"mid": "MickeysChristmasCarol", "IMDB_id": "tt0085936", "title": "Mickey's Christmas Carol", "plot": "On Christmas Eve in 19th-century London, Ebenezer Scrooge, a surly money-lender, does not share the merriment of Christmas. He dismisses two gentlemen's collecting money for charity and declines his nephew Fred's invitation to Christmas dinner. His loyal employee Bob Cratchit requests to have Christmas Day off, since there will be no business for Scrooge on the day, to which he reluctantly agrees.\nScrooge continues his business until just before midnight and then leaves for home. In his house, Scrooge is visited by the ghost of his deceased business partner Jacob Marley, who warns him to repent his wicked ways or he will condemned in the afterlife like he was, informing him that three time-travelling spirits will visit him during the night. As Marley leaves, he falls down the stairs after he avoids tripping over Scrooge's cane.\nScrooge is visited by the Ghost of Christmas Past, who takes him back in time to his early life. They visit his time as an employee under Fezziwig. Fezziwig throws a Christmas party, Scrooge attends and meeting a young woman named Isabelle, whom he falls in love with. However, the Ghost shows Scrooge how Isabelle left him when he chose his wealth over her. A distraught Scrooge dismisses the Ghost as he returns to the present.\nScrooge next meets the gigantic, merry Ghost of Christmas Present. Scrooge and the Ghost visit Bob's house, learning his family is surprisingly content with their small dinner, Scrooge taking pity on Bob's ill son Tiny Tim. The Ghost informs that Tiny Tim will likely not survive until next Christmas and he fades away.\nSmoke fills the streets, revealing the Ghost of Christmas Yet to Come, who appears as a silent, cloaked figure; the Ghost takes Scrooge into the future. Escorted to a cemetery, Scrooge discovers that Tiny Tim has died. He then overhears two gravediggers who are amused that no one attended the funeral of an unnamed colleague while digging a grave. After the weasels leave to take a break from their work, the ghost points out Scrooge's own grave, revealing that he was the man who died. Realizing this, Scrooge vows to mend his ways as the ghost shoves him into his empty coffin sitting in a deep grave atop the fires of Hell.\nAwakening in his bedroom on Christmas Day, Scrooge decides to surprise Bob’s family with a turkey dinner and ventures out to spread happiness and joy around London. He donates much of his money to the charity workers and wishes his nephew Fred a Merry Christmas as well. Scrooge then goes to the Cratchit house, at first putting on a stern demeanor, but reveals he intends on raising Bob’s salary and making him his partner in his counting house. Scrooge and the Cratchets celebrate Christmas."}