{"mid": "MickeyDonaldGoofyTheThreeMusketeers", "IMDB_id": "tt0371823", "title": "Mickey, Donald, Goofy: The Three Musketeers", "plot": "The story begins with Troubadour, a French speaking turtle who loves songs, backstage of a show trying to remind the narrator that he promised to use one of Troubadour's songs. The narrator ignores the turtle and accidentally falls through a trapdoor just as the show is about to begin. Consequently, Troubadour is ushered to tell the audience the story at the very last minute. Panicking, Troubadour quickly picks up The Three Musketeers and begins reading.\nMickey Mouse, Donald Duck, Goofy, and Mickey's dog Pluto are street urchins, who, while being robbed by masked bandits (played by the Beagle Boys) are saved by the Royal Musketeers, Athos, Aramis, Porthos and D'Artagnan. Mickey is gifted one of their hats, inspiring them to follow their example and become musketeers; however, in the present day, Mickey, Donald and Goofy are lowly janitors for the musketeers' headquarters. Unfortunately, they are very clumsy and constantly cause messes. After an incident disturbs the captain of the musketeers, portrayed by Pete, he tells the trio that they cannot become musketeers because Donald is a \"coward\", Goofy a \"doofus\" and Mickey \"just too small\", leaving the three downhearted.\nMeanwhile, Minnie Mouse, princess of France, and her lady-in-waiting, Daisy Duck, are in a palace discussing Minnie's obsession with finding her \"one true love\". Daisy says that she must marry someone who is of royal blood, and Minnie insists that she cannot marry someone she does not love. Minnie says she will know \"the one\" when he makes her laugh. Minnie then takes a walk in the palace garden and barely survives an attempt on her life as the Beagle Boys attempt to drop a safe on her.\nThe Beagles run to tell their boss, revealed to be Captain Pete, that they were not successful in dropping the safe on Minnie. In response, Pete clobbers them, saying he wanted her \"kept 'safe'\" until he can take over the kingdom. Pete is summoned by princess Minnie, who demands he produce musketeer bodyguards. Realizing that skilled musketeers will jeopardize his plan to overthrow the princess, Pete quickly goes to the janitor room, and tells Mickey, Donald and Goofy that they passed his test and have what it takes to become musketeers. After meeting each other, Minnie falls in love with Mickey.\nWhile Minnie and Daisy, protected by Mickey, Donald, and Goofy, go on a journey, they are ambushed by the Beagle Boys. Donald hides and is eventually thrown off the carriage, and Goofy is easily defeated, leaving Mickey to fight the intruders. Mickey is also defeated, leaving the three heroes stranded. Mickey encourages his friends not to lose hope and they rush to rescue Minnie and Daisy. Mickey, Donald and Goofy manage to save Minnie and Daisy in a tower where the Beagles are keeping them. Afterwards, Mickey manages to make Minnie laugh and the two mice fall in love and spend time alone with each other.\nPete is furious that the Beagle Boys failed in their task and realizes that the three protagonists are more of a threat than he originally anticipated. He then plans to get rid of them one by one. While on night duty, Goofy is lured away from the palace by Clarabelle and subdued. The Beagle Boys attack Donald, scaring him into hiding, before Pete traps him and puts Donald to the guillotine. Donald escapes his execution at the last second, causing Pete to lose his peg leg as he dove under the guillotine's blade to stop him. Donald returns to the castle and tells the whole story to Mickey (who doesn't understand him at first) before running off in fear, leaving Mickey by himself. Mickey is then captured by Pete, who chains him up in a dungeon in Mont Saint-Michel that will flood when the tide comes in. Goofy is meanwhile chained by Clarabelle and is about to be thrown off a bridge over a river to drown, but Goofy falls in love with Clarabelle and wins her heart with his \"numbskull charm\". As Clarabelle reveals Pete's true intentions, the bridge crumbles and Goofy and Clarabelle fall to the river below. Donald, who is rowing across the river to escape France, breaks their fall. Goofy fails to convince Donald to help him save Mickey, but thanks to an insulting song from Troubadour, the duo save Mickey and the trio eventually escape and reconcile with each other and set off to rescue Daisy and Princess Minnie.\nMinnie and Daisy are captured in a theater and locked in a chest by the Beagle Boys who then impersonate them, announcing to the public that control is now being handed over to \"King Pete the Magnificent\". Mickey, Donald and Goofy arrive and battle Pete and the Beagle Boys onstage, finally defeating them and saving Daisy and the Princess. Mickey and Minnie finally declare their love for one another, as do the others. At the end, Princess Minnie dubs Mickey, Donald and Goofy royal musketeers."}