{"mid": "MidnightSun", "IMDB_id": "tt4836846", "title": "Midnight Sun", "plot": "The Earth's orbit has been perturbed, causing Earth to slowly fall into the sun.\nA prolific artist, Norma, and her landlady, Mrs. Bronson, are the last people in their New York apartment building. All their neighbors have either moved North, where it is cooler, or perished from the extremely high temperatures. At twenty minutes to midnight, it is 110 °F (43 °C) and sunny as high noon. Norma and Mrs. Bronson try to support each other as they watch life as they know it erode around them. The streets are deserted, water usage is limited to an hour a day, and their electricity is gradually being turned off. Food and water are scarce. A radio reporter announces that the police have been moved out of the city, and that citizens must defend themselves against looters, then angrily goes off script, joking that you can \"fry eggs on your sidewalk and heat up soup in the oceans\". The reporter is forcibly taken off air.\nAs the temperature rises to 120 °F (49 °C), the two women grow weaker. Norma burns her hand on a windowsill. Mrs. Bronson becomes psychologically unstable, beseeching Norma to paint a picture of a cool subject, rather than Norma's usual paintings of the sun and burning cities, screaming, \"Don't paint the sun anymore!\". A looter enters the building through the roof access door, which Mrs. Bronson neglected to lock. They hide in Norma's apartment. The looter calls from outside, demanding entry. Norma threatens him with a cocked revolver, and they hear him walk away. Against Norma's pleas, Mrs. Bronson unlocks the door, and the stranger forces his way in, pulls the revolver from Norma and drinks their water. He calms down after seeing their distress and begs for their forgiveness, claiming that he is an honest man driven insane by the heat. He throws away the revolver and describes the recent death of his wife and newborn child from overheating and complications during labor. He insistently begs for forgiveness until Norma acknowledges him with a nod, then leaves the apartment building.\nIn an attempt to console Mrs. Bronson, Norma shows her an oil painting of a waterfall cascading into a lush pond. Mrs. Bronson deliriously claims that she can feel the coolness and delightfully splashes in the imaginary waters before collapsing to the floor. Norma sits in shock as the thermometer surges past 120 °F (49 °C) and shatters. The paint on Norma's oil paintings begin to melt before her eyes, and she screams and collapses to the ground.\nThe scene cuts to the apartment at night with heavy snow outside the windows. The thermometer reads −10 °F (−23 °C). Norma is bedridden with a high fever and is tended to by Mrs. Bronson and a doctor. The Earth moving closer to the sun is revealed to be only a fever dream. In reality, the Earth is moving away from the sun, and the world is freezing to death. Norma tells Mrs. Bronson about her nightmare, adding, \"Isn't it wonderful to have darkness, and coolness?\" Mrs. Bronson face stiffens in dread, and she replies, \"Yes, my dear, it's... wonderful.\""}