{"mid": "MidnightInTheGardenOfGoodAndEvil", "IMDB_id": "tt0119668", "title": "Midnight in the Garden of Good and Evil", "plot": "This panoramic tale of Savannah's eccentricities focuses on a murder and the subsequent trial of Jim Williams (Kevin Spacey): self-made man, art collector, antiques dealer, bon vivant, and semi-closeted homosexual. John Kelso (John Cusack), a magazine reporter, finds himself in Savannah amid the beautiful architecture and odd doings to write a feature on one of Williams' famous Christmas parties.\nKelso is intrigued by Williams from the start, but his curiosity is piqued when he meets the violent, young Billy Hanson (Jude Law), Williams' lover. Later that night, Hanson is dead, and Kelso stays on to cover the murder trial. Along the way he encounters the irrepressible The Lady Chablis, a transsexual stand-up comedienne; Sonny Seiler, lawyer to Williams, whose famous dog \"Uga IV\" is the official mascot of the Georgia Bulldogs; a man who keeps flies attached to mini leashes on his lapels and threatens daily to poison the water supply; Serena Dawes, a former silent-film actress; the Married Ladies Card Club; and Minerva, a spiritualist and voodoo practitioner.\nBetween becoming Williams' friend, cuddling up to a torch singer, meeting every eccentric in Savannah, participating in midnight graveyard rituals, and helping solve the mysteries surrounding Hanson's murder, Kelso has his hands full. The judge and jury later find Williams not guilty, much to the pleasure of Kelso and the witnesses. Williams congratulates Kelso on proving his innocence.\nAs depicted in the film, Williams suffers a heart attack and dies a week after the trial concludes. As he dies on the floor near where Hanson died from his wounds, Williams sees an apparition of the hustler in death, then momentarily alive. The camera cuts away from the scene, showing both Hanson and Williams dead and only a few feet from each other. Following the funeral and visiting Hanson's grave once more with Minerva, Kelso, Mandy and the Lady Chablis go off together for a picnic with Uga."}