{"mid": "MightyJoeYoung", "IMDB_id": "tt0120751", "title": "Mighty Joe Young", "plot": "As a child, Jill Young witnesses the death of her mother, Ruth Young and the mother of Joe, an infant mountain gorilla, at the hands of poachers led by Andrei Strasser, who loses his right thumb and trigger finger to Joe, swearing revenge.\nTwelve years later, Jill has raised Joe, now grown to a height of 15 feet (4.6 m) and weighing 2,000 pounds (910 kg). As a result, other gorillas will not accept him and they are both now living in relative peace until a wildlife refuge director, Gregg O'Hara, convinces Jill they would be safer from poachers if they relocated to the United States.\nThe trio goes to Los Angeles, and win the hearts of the refuge staff at the conservancy, who put Jill in charge of Joe. Jill is approached by Strasser, who is now running a fraudulent animal preserve in Botswana, while actually selling animal organs on the black market. After seeing a news report about Joe, he is eager for revenge. At first Jill does not recognize Strasser, since Strasser's right hand is concealed in his coat pocket. He attempts to convince Jill that Joe would be better off in his wildlife refuge back in Africa. During a gala, Strasser's henchman, Garth, uses a poacher's noisemaker to scare Joe into a frenzy. Joe trashes the gala, with the intention of attacking Strasser, but is captured, and imprisoned in a concrete bunker.\nWhen Jill discovers that Joe may be euthanized, she accepts Strasser's offer. She and the refuge staff smuggle Joe out in a truck. Before their departure, Gregg has fallen in love with Jill and kisses her goodbye. On the way to the airport, Jill notices the half-glove covering Strasser's missing fingers and recognizes him. She fights Strasser and Garth, then jumps from the truck onto Hollywood Boulevard, leading to several automobile accidents. Joe sees her and tilts the truck over onto its side and flees.\nGregg discovers that Strasser is a poacher and goes after Jill and Joe. He finds Jill, who reveals to Gregg that Strasser killed her mother and now plans to kill Joe. They track Joe to a carnival where he is playfully wreaking havoc. Strasser arrives as well and attempts to shoot Jill, but Garth, appalled at Strasser's ruthlessness, turns against him and saves Jill, causing Strasser to misfire at a spotlight, starting a fire and causing the Ferris wheel to break down. After knocking Garth unconscious, Strasser attempts to kill Jill in person, but Joe sneaks up behind them and throws Strasser onto a power line over a transformer. Short two fingers on the hand holding the wire, Strasser loses his grip and falls onto the transformer, where he is electrocuted to death.\nLater, at the Santa Monica Pier, Joe attempts to save a child from atop the burning wheel, but the fire burns it down and Joe and the child fall to the ground, where Joe jumps off of the burning wheel, protecting the boy and knocking himself unconscious. Joe survives the fall and awakens and Jill mentions that they need to raise money to open a preserve for him. The young boy named Jason donates some change to Jill after hearing this, prompting the rest of the crowd to contribute.\nJoe is returned to Uganda where Jill and Gregg open the \"Joe Young Preserve.\" Finally free, Joe runs off into the jungle."}