{"mid": "MightyMorphinPowerRangersTheMovie", "IMDB_id": "tt0113820", "title": "Mighty Morphin Power Rangers: The Movie", "plot": "The Power Rangers participate with Bulk and Skull in a charity skydive for the Angel Grove observatory, in anticipation of Ryan's Comet which is scheduled to pass by in two days.\nBulk and Skull miss the target landing zone and accidentally land on a construction site where a giant egg has been unearthed. Lord Zedd, Rita Repulsa, Goldar, and Mordant arrive at the construction site and crack open the egg, releasing Ivan Ooze after 6,000 years, a morphological being who ruled Earth with an iron fist before he was overthrown by Zordon and a group of young warriors. Ivan lays siege to the Rangers' Command Center and incapacitates Zordon, robbing the Rangers of their powers. As the Rangers return to the Command Center, they find it destroyed and Zordon dying.\nZordon's assistant Alpha 5 sends the Rangers to the distant planet Phaedos to obtain the Great Power and save Zordon. On Earth, Ivan usurps Rita and Zedd, trapping them in a snow globe. Ivan sends his Tengu warriors to Phaedos and begins building an army. He uses his ooze to hypnotize the adults, forcing them to be his workforce to dig up his Ecto-Morphicon Titans, twin war machines built during his reign. When Fred Kelman, a friend of the Rangers', discovers his father missing, he finds him working at the construction site and discovers Ivan's plans.\nOn Phaedos, the Rangers are almost killed by the Tengu, but are rescued by Dulcea, Phaedos' Master Warrior. After hearing of Zordon's plight, she agrees to help them and takes them to an ancient ruined temple where the Rangers will have to overcome obstacles to acquire the power of the Ninjetti. Dulcea awakens each Rangers' animal spirit: Aisha is the bear, Billy is the wolf, Rocky is the ape, Kimberly is the crane, Tommy is the falcon, and Adam is the frog. The Rangers make their way to the Monolith housing the Great Power, defeat its four guardians, and retrieve the Great Power.\nOn Earth, Ivan's Ecto-Morphicons are completely unearthed, and he unleashes them on Angel Grove, ordering the parents to commit suicide at the construction site. Fred, Bulk, Skull and other students head to the construction site to save their parents. The Rangers return with their new animal-themed Ninja Zords and destroy one of Ivan's Ecto-Morphicons. Ivan takes control of the other and battles the Rangers himself. The Rangers lead Ivan into space right into the path of Ryan's Comet, which destroys him. His destruction breaks the hypnosis and the parents are reunited with their children. The Rangers then use the Great Power to restore the Command Center and resurrect Zordon.\nIn a mid-credits scene, Goldar briefly lounges in Zedd's throne being served by Mordant only to panic when Zedd and Rita appear having been released after Ivan was destroyed."}