{"mid": "MightyMax", "IMDB_id": "tt0140749", "title": "Mighty Max", "plot": "The series follows Max, an adventurous preteen boy who receives in the mail a small statue of a fowl, inscribed with Egyptian hieroglyphs whereof the translation states: \"You have been chosen to be the cap-bearer. Go to the mini-mart and wait for a sign, Mighty Max\". Shocked by the message, Max drops the statue, shattering it and revealing a red baseball cap emblazoned with a yellow \"M\", which he dons.\nUpon arriving at the mini-mart, Max is chased by a lava-monster sent by antagonist 'Skullmaster'. As Max flees, the cap teleports them to the Mongolian desert, where he befriends Virgil, a nearly omniscient Lemurian whose appearance is that of an anthropomorphic \"fowl\" (a running gag in the series is that Max refers to Virgil as a \"chicken\" to which the Lemurian replies \"Fowl, actually\"), who explains that Max's reception of the cap was prophesied c. 3000 B.C. Thereafter Max, Virgil, and Norman, his Viking bodyguard, travel together around the world, defending Earth against the minions of Skullmaster, who is responsible for the downfall of the Lemurians and the people of Atlantis. Norman is supposedly immortal and identified as or with Sir Lancelot, Thor, Samson, and Hercules. Most plot-driving episodes involve Skullmaster or one of his monstrous followers; but in many episodes, Max is required to stop an independent villain. While all episodes involve travel across Earth, one involves time travel, and the portal can even extend into the astral plane (as seen in the episode \"Souls of Talon\").\nWhile generally lighthearted and comical, the show's violence and descriptions of violent acts were considered excessive by some viewers. Many episodes began with a depiction of the story's principal monster killing a victim; whereas the series finale featured Max, Norman, and Virgil pitted against Skullmaster and their previously defeated foes. Both Norman and Virgil are killed, leaving Max to defeat Skullmaster. Unable to do so, Max uses the cap in order to time travel to the events of the first episode, creating a time paradox. At first, he experiences déjà vu; but after he reads Virgil's modified letter, he recalls everything, and decides to set it right in order to defeat the Skullmaster."}