{"mid": "Mikey", "IMDB_id": "tt0104870", "title": "Mikey", "plot": "A young boy, Mikey, sets newspapers on fire in his basement. He blames his younger sister, Beth, when his foster mother admonishes him. His foster mother Grace Kelvin disciplines him and he yells at Beth, taking her doll and throwing it in the pool. When Beth reaches to get it, Mikey causes her to fall into the pool and drown. Mikey is secretly taping everything. He goes upstairs and overhears his mother telling a friend on the phone that adopting Mikey was a bad idea while she takes a bath. The phone dies and Mikey walks in. Startled, his mother yells at him to get out. Mikey picks up her blow dryer and turns it on, and begins to taunt her. He throws it and she is instantly electrocuted. Mikey goes downstairs and pours a bunch of marbles onto the floor. When his foster father Harold arrives home, he rushed out to greet him as if nothing has happened. They sit and chat for a moment when he sees his dead daughter floating lifeless in the pool. In a frantic state he rushes towards the door but slips on the marbles Mikey had laid down earlier. Mikey proceeds to beat him in the head with a baseball bat. Soon after, the police have arrived to find Mikey \"hiding\" in a closet. He tells them a man came in and killed his family.\nA psychiatrist recommends that Mikey get fostered as soon as possible. His foster mother's sister is put forward as a prospective foster carer, but she does not want anything to do with Mikey. She states that he was adopted and that it was suspected that he was abused by members of his family. She does not present as somebody who is overly interested in taking care of a young child.\nHe is then sent to a new family, Neil and Rachel Trenton, who don't know anything about Mikey's past. Mikey presents himself as an amiable and loving child. For example, when he first meets his foster parents he asks, \"Are you going to be my new mommy and daddy?\" At first, he does not behave as if he is disturbed and he exhibits caring behavior towards his new mother's fish. He also manifests behavior which is not out of the ordinary in his desire to succeed in a game which his class at school plays. However, the harmony is short lived. Mikey begins to draw pictures of his murders. Something his new parents don't recognize. He also begins to self-mutilate his arm with a thumbtack at school. His teacher notices, and tells his parents who refuse to believe it. Mikey has a horrible tantrum when his new mother sells the baby fish he was in charge of feeding. He yells that she doesn't really love him and that she's not his real mother and Neil is not his real father. Another incident occurs shortly after when Mikey walks in on his mother in the bath. He says he was bringing her flowers for being such a great mom. He then sets the flowers down and picks up her curling iron. He tells her he knows that if he threw it in the water, it would electrocute her like an electric chair. She tells him to unplug it and get out. He does so without complaint.\nMikey then falls in love with his new best friend, Ben's older sister, Jessie. She, however, is not interested in him as she is 15 years old and is dating a young man named David. One night, after Mikey had slingshot rocks at Jessie's window, David is told to leave. Mikey murders Jessie's cat, Rosie, and makes it look David accidentally murdered her. Depressed and angry, Jessie dumps David. It is short lived however, and when Mikey discovers this he tricks Jessie into leaving David alone in the hot tub. Mikey yells at David for killing Rosie. He then proceeds to kick the stereo into the water and David is killed instantly. Once again, Mikey films his murders.\nThe next day, Mikey is allowed to stay home from school. He is sitting with Jessie telling her not to be sad David deserved it for killing Rosie. Jessie tells that's sick and Mikey responds, \"Now you can just love me!\" She tells Mikey to go away and leave her alone when he tries to embrace her. Suspecting Mikey killed David, Jessie goes to his mother and tells her there's something wrong with Mikey and that she was in danger. Assuming it was Jessie's stress over David, Rachel politely asks her to leave.\nMikey's teacher Shawn, who is also a family friend, found out the connection between Mikey's previous foster mother and David. She informs the principal who tells her he'll go with her to talk to the family. He finds a gun in her purse and immediately takes it.\nBack at Mikey's house, he has just heard the argument between Rachel and Jessie. Rachel goes upstairs and find Mikey watching a movie. He tells her he's watching Mikey's Funniest Home Movies. She realizes that it's the murder of his previous family. Mikey slowly stands holding a hammer. Rachel demands that Mikey give it to her and he agrees. He pretends to hand it over before smashing her hand. He begins to beat her with the hammer. She pushes him down and says it's over. He continues to beat and she begs \"NO MORE\"; she manages to get herself locked in her bedroom. She tries to call for help, but the phone does not work. Mikey smashes through the patio door. He picks up a shard of glass and rushed Rachel with it. They both fly off the balcony and are soon discovered by Shawn and the principal. Rachel's throat is slit and Mikey appears to have no pulse. The both walk outside for a moment. The principal says he will go in and call the police and Shawn says she'll wait. When he goes in, he realizes Mikey is not there. He sets his gun on the counter to call the police. Mikey comes in with a bow and arrow; the principal tries to shoot, but Mikey took the bullets from the gun. Mikey then shoots him through the heart with an arrow. Shawn comes in and Mikey starts to sling marbles at her with his slingshot. He tells her he really liked her marble game and then proceeds to take a larger than average marble and hit her in the head. She dies instantly.\nMikey begins to take all the dead bodies and put them at the dinner table. He also turns all the oven dials on high. His father calls and tells him he'll be home soon. Mikey then showers and goes over to Jessie's house. He asks if Ben is home. She tells him no and to go home. She slams the door and runs upstairs only to be greeted by Mikey who climbed in through his \"secret\" way. She tells him to use the front door to leave and locks her door. Whens she opens the door, Mikey shoots an arrow at her. It misses and hits a picture that once had her and David on it, but Mikey puts a photo of himself in David's place.\nHearing his dad's car pull in, Mikey rushes to greet him. Jessie's tries to yell from the window, but Neil doesn't hear her and goes inside. Once inside, they chit chat for a moment. Mikey then grabs his dad's arm telling him there's a surprise. His father sees all of the murder victims along with a skeleton. Speechless and unable to move, Neil's last vision is that of Mikey throwing fire into the house and the house exploding. Jessie is seen talking to cops who assure her they found the remains of a 12-year-old male.\nLater, another couple is about meet their adoptive child, Josh, who was found wandering and suffering from complete amnesia. Josh is revealed to be Mikey who again asks, \"Are you going to be my new mommy and daddy?\""}