{"mid": "Mindwarp", "IMDB_id": "tt0100152", "title": "Mindwarp", "plot": "As with the other serials from Season 23, Mindwarp's present is the trial of the Doctor by the Valeyard, accusing him of meddling in other species' affairs, in a way unbecoming of a Time Lord. The Valeyard provides evidence to the Inquisitor and presiding through a screen linked to the Matrix, showing the details of the Doctor's actions on the planet Thoros Beta. The bulk of the episode centres on recorded narrative.\nAs shown by the video, the Doctor and Peri arrive on Thoros Beta, the Doctor's curiosity piqued on the availability of advanced weaponry by the Warlords of Thordon. As they explore a cave system, the Doctor discovers Sil, an arms dealer for the Mentors that are supplying the weapons. Exploring further, they find that the scientist Crozier in Sil's employ is attempting to perfect the ability to transplant the brilliant mind of Kiv, Sil's superior, into another body to overcome Kiv's pending death. When discovered, the two make their escape with the warlord King Yrcanos, one of Crozier's test subjects.\nThe Doctor, Peri, Yrcanos and his men plan an attack on Sil, but the Doctor betrays by abandoning them at the last minute and warns the Mentors, causing Peri and Yrcanos to flee in different directions. Peri happens across one of the Mentors' servant woman, and with her help, disguises herself to get close to the Doctor. The Doctor reveals Peri to the Mentors and requests he be allowed to interrogate her alone, a request Sil allows. Away from the others, the Doctor tells Peri his betrayal was all a ploy to learn more of Sil's plan, and has discovered that they will transplant Kiv's mind into his body if he does not cooperate.\nCrozier interrupts the interrogation, believing he can extract more information from Peri, but then Yrcanos arrives, ready to kill the Doctor. Peri stops Yrcanos, and together they escape, regrouping with Yrcanos' men. As Kiv's body is dying, Crozier is forced to transplant his brain with the Doctor's help into the body of one of the Mentors' servants, keeping the mind alive but affected by the simple thoughts of the former consciousness. Yrcanos, Peri, and his men launch another attack, this time on a weapons stash, but are stunned and captured. Sil and Crozier decide to use Peri as a more suitable body for Kiv's brain, despite the Doctor's objections. As the operation is being prepared, the Doctor sneaks away and frees Yrcanos, urging him on for Peri's safety.\nPeri is strapped down and gagged as the operation is prepared and Crozier gives the order for her head to be shaven. The Doctor attempts to return to save her but is suddenly drawn hypnotically into the TARDIS, which appears in the hallway; it is later revealed that he travelled directly to this trial from that point. Despite the Doctor claiming that the Time Lords' interference has put Peri's life in danger, the Valeyard rebuffs this, stating that the Doctor shouldn't have become involved in the first place, and Peri's life is the cost of his involvement. Events on Thoros Beta continue after the Doctor's removal, as it is shown that Ycranos was placed in a time bubble by the Time Lords to hold his arrival back at the lab until after Kiv's mind was successfully transplanted into Peri; when Ycranos is freed of the bubble, he is distraught at the results of the operation, and fires wildly, killing Peri. The Valeyard insists that the interference of the Time Lords was to prevent a greater disaster befalling the universe due to the mistakes in the Doctor's actions. The Doctor insists that the present trial appears to be serving a greater cause, and resolves to determine what it is as the trial continues.\n=== Continuity ===\nSil appeared in the previous season in the serial Vengeance on Varos. Before the Trial season was conceived, Sil was set to return in story called Mission to Magnus. Over 20 years later, Nabil Shaban returned to help resurrect this story for Big Finish Productions' Mission to Magnus audio adaptation.\nThe Doctor meets Peri again in two spin off stories. She features in the Virgin New Adventures novel Bad Therapy by Matt Jones. A post-Mindwarp hallucination of Peri appears in the Big Finish Productions play Her Final Flight. The relationship of spin off media to the television series is open to interpretation by the individual."}