{"mid": "MinistryOfFear", "IMDB_id": "tt0037075", "title": "Ministry of Fear", "plot": "In wartime England during the Blitz, Stephen Neale (Ray Milland) is released from Lembridge Asylum. While waiting for a train to London, Neale visits a village fête hosted by the Mothers of Free Nations charity. He guesses the weight of a cake for a shilling, apparently failing to guess the cake's true weight, and is urged to go to the palm reader's tent to have his fortune told by Mrs. Bellane (Aminta Dyne), an older woman. He asks her to ignore the past and tell the future, which startles her. She cryptically tells him to take another guess at the weight of the cake at 4 pounds 15½ ounces. Neale does so and wins the prize, the cake itself. Then a young blond man hurries to see Mrs. Bellane. People try to persuade Neale to give the cake to the blond man, but Neale refuses, as his initial guess was closer to the cake's true weight than the blond man's guess, by a few ounces.\nNeale departs Lembridge with only a blind man (Eustace Wyatt) sharing his compartment. Neale offers him some cake. Neale sees the blind man crumbling his portion. When the train stops during a Luftwaffe air raid, Neale's companion turns out not to be blind after all. He strikes Neale with his cane, steals the cake, and flees, with Neale in pursuit. The man shoots at him, but is killed by a German bomb. Neale finds his revolver and continues on to London.\nNeale hires private detective George Rennit (Erskine Sanford) to help him investigate the Mothers of Free Nations. Neale meets Willi Hilfe (Carl Esmond) and his sister Carla (Marjorie Reynolds), refugees from Nazi Austria who run the charity. Willi takes him to Mrs. Bellane's London mansion (followed by Rennit). Neale is shocked to discover that this Mrs. Bellane (Hillary Brooke) is a beautiful young medium. She invites them to stay for her séance. Among the other attendees are artist Martha Panteel (Mary Field), psychiatrist Dr. Forrester (Alan Napier), and Mr. Cost (Dan Duryea), the blond man at the fête. After the lights are dimmed, a mysterious voice claims she was poisoned by Stephen, disconcerting Neale. Then a shot rings out – Cost is found shot dead. Neale admits to having the blind man's gun. He flees with Willi's help.\nNeale goes to Rennit's office, only to find it ransacked. He talks to Carla. An air raid forces the two to shelter in an Underground station, where Neale reveals that he had planned to euthanize his terminally ill wife. He changed his mind, but she committed suicide anyway, using poison he had bought. Due to the circumstances, Neale received a light sentence of two years at the asylum. He confides that he is still unsure if in buying the poison for his wife he had made the right decision.\nThe next morning, Carla hides Neale at a friend's bookstore. Neale spots a book by Forrester, The Psychoanalysis of Nazidom. Carla reveals that Forrester is one of her volunteers as well as a consultant for the Ministry of Home Security. Neale is convinced that Carla's organization is a front for Nazi spies. Carla finds out that almost all the people Neale suspects are charity volunteers, but all recommended by Forrester. She tells Willi about her discovery, and admits that she loves Neale.\nThat afternoon, Neale goes to Panteel's flat, only to find Mrs. Bellane. The two verbally spar. He flees when Panteel returns and begins screaming for the police.\nLater, Carla tells Neale what she has learned. The bookseller asks the couple to deliver some books in a suitcase since they are leaving. When they arrive at the address, they discover that no one lives there. Suspicious, Neale opens the suitcase. The bomb inside explodes, but Neale's quick reaction saves them both.\nNeale awakens in the hospital, the prisoner of Scotland Yard Inspector Prentice (Percy Waram). Neale persuades Prentice to search the bombed-out cottage for evidence. About to be taken to jail, at the last minute Neale finds a microfilm of military secrets inside a portion of the cake hidden in a bird's nest. Officials insist that the top secret documents have only been taken out of a safe twice, the second time when Forrester's tailor, a man named Travers, was present. Neale recalls that the empty flat was leased in Travers' name.\nPrentice and Neale go to the tailor's shop, and find that Travers is Cost. Travers pretends not to recognize Neale, and calls a client about a suit. Then, seeing he is trapped, he commits suicide. When Neale dials the number he saw Travers use, Carla answers.\nNeale slips away to confront Carla. Willi emerges, armed with a pistol, and admits he is the head of the spy ring. Another copy of the microfilm is sewn into the suit he received from Travers. Carla throws a candlestick, striking her brother's gun hand. The two men struggle, and Carla picks up the gun. When she refuses to hand it over to Willi, he tries to flee, but she shoots him dead. Forrester and several other Nazi agents chase Neale and Carla onto the roof. Inspector Prentice arrives and kills the remaining Nazis.\nLater, Carla and Neale drive in the country, talking about their wedding. Neale is comically horrified when she mentions planning the \"cake\"."}