{"mid": "MiracleMile", "IMDB_id": "tt0097889", "title": "Miracle Mile", "plot": "The film takes place in a single day and night. The film opens with the two main characters, Harry (Anthony Edwards) and Julie (Mare Winningham), meeting at the La Brea Tar Pits and immediately falling in love. After spending the afternoon together, they make a date to meet after her shift ends at midnight at a local coffee shop, but a power failure means Harry's alarm fails to wake him and Julie leaves for home.\nWhen Harry awakes that night he realizes what's happened and rushes to the shop, arriving at 4 AM. Harry tries to call Julie on a pay phone, but only reaches her answering machine, where he leaves an apology. When the phone rings moments later he picks it up, hearing a frantic man (presumed to be in a missile silo) telling his dad that nuclear war is about to break out in less than seventy minutes. When Harry finally gets a chance to talk and asks who's calling, the caller realizes he has dialed the wrong area code. Harry then hears him plead with Harry to call his father and apologize for some past wrong before he is being confronted and presumably shot. An unfamiliar voice picks up the phone and tells Harry to forget everything he heard \"and go back to sleep\" before disconnecting.\nHarry, confused and not entirely convinced of the reality of the information, wanders back into the diner and tells the other customers what he's heard. As the patrons scoff at his story, one of them, a mysterious businesswoman (Denise Crosby) named Landa, calls a number of politicians in Washington on her wireless phone and finds that they are all visiting South America at the same time. Convinced of the danger, she immediately charters several private jets out of LAX to a compound in a region in Antarctica with no rainfall. Most of the customers and staff leave with her in the owner's delivery van. When the owner refuses to make any stops, Harry, unwilling to leave without Julie, arranges to meet the group at the airport and jumps from the truck.\nHarry is helped and hindered by various strangers, who are initially unaware of the impending apocalypse. In the process he inadvertently causes several deaths and is deeply shaken by that, yet still he goes on. When he finds Julie and later tells her, she notes that there is no confirmation of the attack. Desperate to reach the airport and not having a car, Harry finds a helicopter pilot (Brian Thompson) and tells him to meet them on the roof of the Mutual Benefit Life Building. Julie has also tried to find a pilot on her own, and in the moments it takes to find her, Los Angeles descends into violent chaos. There is still no confirmation any of this is real, and Harry wonders if he has sparked a massive false panic in the example of Chicken Little. However, when he uses a phone booth to contact the father of the man who called him (using the number of the booth and the area code the man was trying to use) he reaches a man who says his son is a soldier. Harry tries to pass on the message he was given, but the man hangs up before Harry finishes.\nWhen they reach the top of the Mutual Benefit building they find the pad empty, and the roof manned only by a yuppie (Kurt Fuller) taking every drug he can find. Any doubts about a false alarm are eliminated when a warhead can be seen streaking across the sky. As they fear the end, the helicopter suddenly returns with the pilot badly wounded but fulfilling his promise to come back for them. After they lift off from the roof, several warheads hit and the EMP from the detonations causes the helicopter to crash into the La Brea Tar Pits.\nAs the helicopter sinks and the cabin fills with natural asphalt tar, Harry tries to comfort a hysterical Julie by saying someday they will be found and they will probably be put in a museum, or maybe they will take a direct hit and be turned into diamonds. Julie, accepting her fate, calms down and takes comfort in Harry's words, and the movie fades out as the tar fills the compartment. A final explosion seems to imply a direct hit has taken place."}