{"mid": "MiracleOn34ThStreet", "IMDB_id": "tt0039628", "title": "Miracle on 34th Street", "plot": "Kris Kringle (Edmund Gwenn) is indignant to find that the man assigned to play Santa in the annual Macy's Thanksgiving Day Parade (Percy Helton) is intoxicated. When he complains to event director Doris Walker (Maureen O'Hara), she persuades Kris to take his place. He does so well, he is hired to play Santa at Macy's flagship New York City store on 34th Street.\nIgnoring instructions to steer parents to buy from Macy's, Kris directs one shopper (Thelma Ritter) to a competitor. Impressed, she tells Julian Shellhammer (Philip Tonge), head of the toy department, that she will become a loyal customer.\nAttorney Fred Gailey (John Payne), Doris' neighbor, takes the young divorcée's second-grade daughter Susan (Natalie Wood) to see Santa. Doris has raised her to not believe in fairy tales, but Susan's lack of faith is shaken after seeing Kris speak in Dutch with a girl who does not know English. Doris asks Kringle to tell Susan that he is not Santa, but he insists that he is.\nWorried, Doris decides to fire him. However, Kris has generated so much positive publicity and goodwill for Macy's that a delighted Macy (Harry Antrim) promises Doris and Julian bonuses. To alleviate Doris's misgivings, Julian has Granville Sawyer (Porter Hall) administer a \"psychological evaluation\". Kris passes, but questions Sawyer's own mental health.\nThe store expands on the concept. To avoid looking greedy, competitor Gimbels implements the same policy, forcing Macy's and others to escalate. Eventually, Kris does the impossible: he reconciles bitter rivals Macy and Gimbel (Herbert Heyes).\nPierce (James Seay), the doctor at Kris' nursing home, assures Doris that Kris is harmless. Kris makes a pact with Fred – he will work on Susan's cynicism while Fred does the same with Doris, disillusioned by her failed marriage. When Susan reveals she wants a house, Kris reluctantly promises to do his best.\nKris learns that Sawyer has convinced young employee Alfred that he is mentally ill simply because he is kind-hearted. Finding Sawyer unwilling to budge, Kris hits him on the head with his cane. Sawyer exaggerates his pain in order to have Kris confined to Bellevue Hospital. Tricked into cooperating, and believing Doris to be in on the deception, Kris deliberately fails his examination and is recommended for permanent commitment. However, Fred persuades Kris not to give up.\nAt a hearing before Judge Henry X. Harper (Gene Lockhart), District Attorney Thomas Mara (Jerome Cowan) gets Kris to assert that he is Santa Claus and rests his case. Fred argues that Kris is not insane because he actually is Santa. Mara requests Harper rule that Santa does not exist. In private, Harper's political adviser, Charlie Halloran (William Frawley), warns him that doing so would be disastrous for his upcoming reelection bid. The judge buys time by hearing evidence.\nDoris quarrels with Fred when he quits his job at a prestigious law firm to defend Kris. Fred calls Macy as a witness. When Mara asks if he believes Kris to be Santa, Macy starts to equivocate, but when pressed, he considers the business repercussions as well as the good Kris has done and states, \"I do!\" Afterward, Macy fires Sawyer. Fred then calls Mara's own young son (Bobby Hyatt), who testifies that his father told him that Santa was real. Mara concedes the point.\nMara then demands that Fred prove that Kris is \"the one and only\" Santa Claus on the basis of some competent authority. While Fred searches frantically, Susan writes Kris a letter to cheer him up, which Doris also signs. When a mail sorter (Jack Albertson) sees Susan's letter, he suggests they deliver the many letters to Santa taking up space in the dead letter office too. Fred presents Judge Harper with three of them, addressed simply to \"Santa Claus\" and delivered to Kris, asserting the Post Office has thus acknowledged that he is the Santa Claus. After mailmen dump another 21 full mailbags before him, Harper dismisses the case.\nOn Christmas morning, Susan is disappointed that Kris could not get her what she wanted. Kris gives Fred and Doris a route home that avoids traffic. Along the way, Susan sees her dream house with a \"For Sale\" sign in the front yard. Fred learns that Doris had encouraged Susan to have faith and suggests they get married and purchase the house. He then boasts that he must be a great lawyer since he proved Kris was Santa. However, when they spot a cane inside that looks just like Kris's, he is not so sure."}