{"mid": "MissionImpossible", "IMDB_id": "tt0117060", "title": "Mission: Impossible", "plot": "Ethan Hunt (Tom Cruise) is an agent and \"point man\" of an Impossible Missions Force (IMF) team, an unofficial branch of the CIA, led by Jim Phelps (Jon Voight). In Kiev, the team is working on a mission: a disguised Hunt is interrogating a Russian agent who has been tricked by the team into thinking he murdered fellow IMF agent Claire Phelps (Emmanuelle Béart), Phelps' wife. Claire has been given a drug to make her appear dead but the team doesn't have much longer before Claire will be beyond reviving. The Russian finally gives up the name they're looking for and is taken away after the name checks out. Claire is revived, asking if the ruse was successful; Ethan assures her it was.While in flight, Jim Phelps is passed a tape containing a covert mission for his team. The team assembles in Prague to prevent an Eastern European diplomat, Golitsyn, from stealing a Non-official cover (NOC) list - a comprehensive list of all covert agents in Eastern Europe.The mission runs very smoothly, everyone achieves their mission goals and the team obtains video evidence of Golitsyn stealing the NOC list and exiting the building. Unfortunately, that's when everything goes inextricably wrong. Over their radio frequency, Ethan hears his teammate, Jack, being killed by a spike while he controls the elevator Golitsyn uses to escape. Hannah Williams and Claire are killed near the Charles Bridge when their car is blown up with them inside. Jim himself is killed by an unseen assassin that he had reported was following him on the Charles Bridge. Sarah follows Ethan's order to pursue Golitsyn but finds him being stabbed to death; the assassin grabs her and kills her in the same fashion. Ethan finds them both and discovers the disc Golitsyn had used is gone.Fleeing the scene, Hunt stops at a pay phone to call his agency and alert them of the tragic outcome of their mission. Eugene Kittridge (Henry Czerny), the CIA-based director of the IMF, tells Ethan to meet him at a café. Ethan is surprised to find Kittridge is in Prague too. Ethan, very much in shock, meets with Kittridge but soon realizes that they're not alone; another IMF team is surrounding them. A team Hunt recalls seeing at the embassy surrounding his own team. When he questions Kittridge, Hunt is disturbed to learn that a mole has infiltrated the IMF with a cover name known only as \"job 3:14\" and that the Prague operation was meant to ferret out the mole by allowing him to acquire the NOC list and attempt to sell it to Max, an illegal arms dealer known for corrupting IMF agents. The NOC list in Prague was a fake, the real list being held in CIA headquarters in Virginia. With Hunt the sole survivor, Kittridge believes he is the mole. Realizing he'll be taken into custody before he can clear his name, Hunt mounts a daring escape from the café using exploding \"red light/green light\" chewing gum on a fish tank, fleeing into Prague's Old Town Square.Ethan returns to the IMF safe house, where he uses the internet to find Job. Looking over the screen of his laptop, he sees a Bible on a bookshelf above the screen and deduces that \"job 3:14\" actually means the Book of Job, chapter 3, verse 14. Ethan begins to email as many web entities with the name Job 3:14 as he can before falling asleep. Suddenly, he awakes to find an intruder in the apartment and discovers it's Claire, still alive having survived the mission. She reveals she wasn't in the car when it exploded. He tells her about the mole mission, how he's been disavowed by the Agency and that he needs to contact Max to seek out the mole called \"Job\".In London, Ethan meets with Max, finding that she's actually a woman. Ethan tells her that the list likely has a tracking device in it and activating it will allow the IMF to find them. Ethan's hunch is correct and they flee Max' apartment, narrowly escaping Kittridge and his team of agents. Ethan offers to retrieve the real NOC list for Max in exchange for a cash advance and arranging a meeting with Job, Max agrees to the deal. Ethan uses Max' money to assemble a team of blacklisted or disavowed intelligence agents, including computer expert Luther Stickell (Ving Rhames) and pilot Franz Krieger (Jean Reno).Disguised as a team of firefighters, they infiltrate the heavily fortified headquarters of the CIA in Langley, Virginia and successfully steal a copy of the full NOC list before escaping to a safe house in London. Once there, Hunt accidentally finds out that the Bible belongs to the hotel, where Phelps claimed to have stayed for a \"recruitment\". After discovering that his uncle and mother have been falsely arrested for drug trafficking in an attempt to lure him out, Hunt is infuriated, and contacts Kittridge, who offers to drop the false charges the moment Hunt surrenders to authorities. Hunt hangs up, after allowing Kittridge to trace him to the London area, turns around and walks right into Jim Phelps.Phelps, presumed dead in the Prague operation, reveals that Kittridge is the mole and is tying up loose ends by trying to apprehend Hunt. Hunt reflects on this, while in reality piecing together the clues he discovered leading up to his operation and realizes that Phelps is Job himself. Hunt realizes that Krieger is also involved when he remembers a tidbit from the mission in Prague that Krieger uses the same kind of knife that was used to kill both Golitsyn and Sarah/ Hunt pretends to accept the story while being uncertain about Claire's involvement in the conspiracy. He pretends to buy Jim's story and keeps their meeting a secret.The next day, Max and Ethan arrange to meet aboard the high-speed TGV train en route from London to Paris, with Claire and Luther aboard to provide backup. Kittridge is also aboard, having recently arrived in London and receiving tickets for the TGV and a video watch from Hunt. In the train, Ethan delivers the supposed NOC list to Max, who directs him to the luggage compartment to find his money, and Job. Max then attempts to transmit the NOC list to a server, an operation hindered by Luther, who activates a jamming device to prevent the upload. Claire, observing Kittridge's presence aboard the train, vacates her seat and meets with Phelps in the luggage car, confirming that she really is part of the conspiracy. A silent \"Jim\" slowly peels away his mask... revealing to be Ethan. Suddenly, the real Phelps appears, armed and demanding the NOC list money. Ethan surrenders it before pulling out a pair of glasses. He slides them over his eyes, activating the camera inside and transmitting Phelps's image to Kittridge, proving beyond doubt that Phelps is still alive.Phelps, now revealed as the traitor, shoots and kills Claire in anger when she speaks against killing Ethan. He then subdues Ethan before escaping to the roof of the train, where Krieger, also a traitor, waits to extract him with a helicopter. Ethan recovers and follows Phelps, impeding his efforts to escape and tethering Krieger's helicopter to the train as it heads into the Channel Tunnel. The fight continues, with the helicopter now following the train inside the tunnel. The two fight atop the wind-swept train before Phelps disconnects the helicopter from the train and attempts to escape. Ethan follows, leaping onto the helicopter's landing skids and attaching explosive \"red light/green light\" gum to the windshield. The ensuing explosion destabilizes the helicopter which crashes killing Phelps and Krieger while Ethan narrowly escapes. Kittridge, now in possession of the NOC list and Max's true identity, reinstates Luther as an IMF agent and drops his investigation against Ethan, who resigns from the IMF.In the final scene, as Ethan flies home, a flight attendant approaches him and through a coded phrase offers him a new mission."}