{"mid": "Mistress", "IMDB_id": "tt0104892", "title": "Mistress", "plot": "A young woman is torn between the affections of her two lovers. One is a young bachelor who brings passion into her life. The other is a married old man who has kept her as his mistress for years.\nArchitect JD (John Lloyd Cruz) has a chip on his shoulder about his businessman father Rico (Ronaldo Valdez) never really accepting him as his son. Seamstress Sari (Bea Alonzo) struggles to take care of her family. The two meet by chance, and JD aggressively pursues Sari’s affections. Though the two are clearly a good match, there is a problem standing in the way of their bliss: Sari is the mistress of JD’s father. Against his better judgment, JD continues to court Sari even after finding out this difficult fact. He hides his true identity as Rico’s son, and fights to win Sari’s heart.\nUpon their struggles, Rico's wife was angrily dismayed to see Sari which is his mistress as both his son JD and himself had a rivalry for Sari's heart. When they travel through the province to deliver a wedding formal suit to her relative in the province, both Sari and JD finally show their true feelings with each other as they watch the wedding ceremony despite her relationship to JD's father, Rico as Sari finally gives in to JD's feelings and both became romantically involved as they make love.\nAfter their travels in the province, they were found by JD's father Rico who is furious to see his son became close to her mistress making both having a fistfight as Sari tried to stop them until Rico suffers from a stroke.\nAt the hospital, JD finally apologizes to his father, Rico who is dying and bedridden and he gives his position to his son on their family business before he dies. In the end of the movie after JD makes his speech towards his father's business employees about his father's life and his business, he watches Sari who fixes the formal suits she had sew in the tailor shop as she saw him before JD drove his car away this implies that their romantic relationship is finally rekindled."}