{"mid": "MommieDearest", "IMDB_id": "tt0082766", "title": "Mommie Dearest", "plot": "Joan Crawford (Faye Dunaway) is a driven actress and compulsively clean housekeeper who tries to control the lives of those around her as tightly as she controls herself. To prepare for a work day at MGM Studios, she rises at 4:00 a.m. and engages in a strict morning ritual: scrubbing her face and arms with soap and boiling hot water, then plunging her face into a bowl of rubbing alcohol and ice to close the pores. When Helga (Alice Nunn), a new maid, thinks she has Joan's living room in spotless condition, Joan finds one minor detail that she overlooked and loses her temper.\nJoan is in a relationship with Hollywood lawyer Gregg Savitt (Steve Forrest), but her career is in a bit of a downswing. Despite desperately wanting a baby, she is unable to get pregnant: seven pregnancies when she was married to actor Franchot Tone have all ended in miscarriages. When she is denied an application for adoption, she enlists Gregg's help to secure a baby. Joan adopts a girl whom she names Christina (Mara Hobel), and later a boy, Christopher (Jeremy Scott Reinholt). Joan sometimes lavishes Christina with attention and luxuries such as an extravagant birthday party, but also enforces a very stern code of denial and discipline. When Christina is showered with gifts, Joan allows her to choose only one she likes best that she can keep, then donates the rest to charity.\nAs Christina rebels against her mother, confrontations ensue. Joan overtakes Christina in a swimming-pool race and laughs at the child. Joan becomes enraged when Christina reacts with anger and locks her in the pool house. Later, Joan discovers Christina wearing her makeup and imitating her. Even though Christina openly denies it and despite her protests, Joan - thinking that Christina is making fun of her, always rummaging through her drawers, trying to find a way to make people look at her, and always looking at herself in the mirror - hysterically cuts off chunks of Christina's hair to humiliate her.\nJoan resents Gregg's allegiance to studio boss Louis B. Mayer (Howard Da Silva) and argues with Gregg after a dinner at Perino's restaurant. Joan guzzles down glasses of vodka and throws a drink in Gregg's face after he tells her she is getting old. A physical altercation ensues and Gregg breaks up with Joan. The next day, Joan cuts Gregg out of the family photos. Joan's tantrums grow more bizarre and violent; when Mayer forces Joan to leave MGM after theater owners brand her \"box office poison\", she hacks down her prize rose garden with a pair of large gardening shears and an axe.\nOn another occasion, Joan, her face slathered in cold cream, goes into Christina's bedroom in the middle of the night, meaning to return a dress to her closet, but discovers one of Christina's dresses hanging on a wire hanger. Enraged, she screams at the girl, waking her up in horror, then yanks dresses from Christina's closet, throwing them all over the girl's room and beating her with the hanger. Afterwards, Joan wrecks the bathroom as well. Believing the perfectly clean floor is still dirty, Joan throws cleaning powder all over the bathroom before striking Christina across the back with the can of cleanser and then screams at her to clean it up. Christopher offers to help but Christina tells him to return to his own bed as she fears Joan will kill her if she finds out.\nLater, Joan sends Christina to the Chadwick School. Years later, when a teenage Christina (Diana Scarwid) is caught in a compromising position with a boy, Joan brings her home. Barbara Bennett (Jocelyn Brando), a reporter from Redbook magazine, is writing a puff piece on Joan's home life. After Joan lies about Christina being expelled from Chadwick, Christina confronts her in front of the reporter. In the ensuing argument, Joan slaps Christina twice across the face. Christina questions her mother as to why she was adopted, and Joan confesses that it was partially a publicity stunt, but then says that she did not really mean it. After the outraged Christina yells, \"I am not one of your fans!\" Joan throws her to the floor, then throttles Christina, who pleads with her to stop. Joan's live-in assistant and the reporter pull her away.\nJoan sends Christina to Flintridge Sacred Heart Academy; under the academy's strict rules, Christina can have no contact with the outside world. Joan then marries Alfred Steele (Harry Goz), CEO of Pepsi Cola, moves to New York City and pressures him to shoulder a great deal of debt to fund their lavish lifestyle. After his death, the all-male board tries to force her to resign, but Joan coerces them into letting her retain her seat by threatening to publicly condemn Pepsi.\nAfter graduating from Flintridge, Christina rents an apartment in Manhattan, where she acts in a soap opera. When Christina is hospitalized for an ovarian tumor, she is temporarily replaced on the show by her visibly drunken mother. Joan dies of cancer in 1977, whereupon Christina and Christopher (Xander Berkeley) learn their mother has disinherited them in her will. When Christopher says their mother has managed to have the last word, Christina questions that."}