{"mid": "MomsGotADateWithAVampire", "IMDB_id": "tt0250593", "title": "Mom's Got a Date with a Vampire", "plot": "Divorced, ex-rockabilly singer Lynette Hansen [Caroline Rhea] comes home from work to\nfind her 15-year old daughter Chelsea [Laura Vandervoot] on the phone with her boyfriend,\ninstead of doing her homework. Thirteen-year old Adam [Matthew O'Leary] is entranced in \"The\nReturn of Count Krelski,\" and 8-year-old Taylor [Myles Jeffrey] is hiding behind the\ncouch. Ah, the joys of being a single Mom.As luck would have it, Adam's friend Duffy gets backstage passes to\nthe Headless Horsemen concert at Saturday night's Harvest Festival, the\nvery weekend that Adam is grounded for not writing his history essay and\ntrying to pass off some story from the Weekly Secret tabloid about vampire\nhunter Malachi Van Helsing. To make matters worse, Chelsea (who had a hot\ndate on Saturday night) is also grounded for smarting off. What to do? The\nsolution is obvious--get Mom a date for Saturday night. Where to find a\ndate for Mom with only one day to go? Again, the answer is simple. Match\nher up with someone from the Personals column in the Weekly Secret. This\nsounds like a good one: Continental gentleman, handsome, debonair, suave.\nEnjoys long strolls beneath the full moon. Loves adventure, travel, wild animals,\nand women who long for romantic nights that will never end. Hates Italian food and turtlenecks. Wolfsbane@netherlink.pro.Adam sends Wolfsbane an email asking him to meet Mom at the\nFoodmaster at 8 pm. Now to get Mom there. Easy. Remind her how the family\nused to have chocolate chip pancakes together every Saturday morning. Make\nher feel guilty enough to go to the store for chocolate chips.\nOK. Got her to the store. Now to find Wolfsbane. No, it's not the guy\nbuying spaghetti. No, it's not the guy buying the cake that says, \"Happy\nAnniversary.\" Maybe it's the guy in the long overcoat with the pulled down\nhat who appears to be looking for someone? He certainly looks like a\nWolfsbane. Before Chelsea and Adam can link up with Wolfsbane, however,\nLynette bumps carts with someone else--Dr Dimitri Dentatos [Charles Shaughnessy] from Romania.\nThey get to talking and, not long after that, Mom's got a date with a\nvampire...but the only one who knows it is Taylor, because he saw Dimitri\nturn into a bat after leaving the store.It's Saturday night. Dimitri has arrived, and Adam has invited him\nin. Dimitri has a nice evening planned. First, dinner at Renfield's, then\ndancing, and finally a romantic carriage ride in the park.\nMeanwhile, Taylor is trying to convince Adam that Dimitri is a\nvampire, but Adam only knows about vampires in the movies. If it's a real\nvampire, you have to call someone like Malachi Van Helsing, so Taylor\ndoes. Unfortunately, Van Helsing isn't answering his phone, so Taylor\npedals over to Renfield's to bring Mom home. Since that would spoil Adam\nand Chelsea's plans, they go after Taylor. Taylor refuses to go home\nwithout telling Mom that Dimitri is a vampire, so Dimitri performs the\nTransylvania spoon test to assure Taylor that he is not. On the way out of\nthe restaurant, however, Adam happens to glance in a mirror and realizes\nthat Dimitri casts no reflection. He really IS a vampire.\nWhat to do now? First, take Taylor home to the babysitter. Then\nfollow Mom. She and Dimitri have left the restaurant and gone for a walk.\nSince dancing was next on Dimitri's list, Lynette takes him into a\nrockabilly place where she used to sing. Next, they go to the Harvest\nFestival, all the while it is apparent that Dimitri hates every dance,\nevery song, every ride, and wants only to get Lynette alone. Fortunately,\nAdam and Chelsea are never far behind, until Dimitri catches Adam and\nwarns him to follow no more or die.Lynette has come to the conclusion that she and Dimitri aren't right\nfor each other, so Dimitri mesmerizes her, and they leave the festival\ntogether. Chelsea and Adam figure that Dimitri is taking Mom to his lair,\nwhich is the old Mather house out by the lake, because he told them\nearlier that he was renovating that place. Adam and Chelsea on the way!Meanwhile, Van Helsing [Robert Carradine] hasn't been able to get through to the Hansen\nresidence because the babysitter has been tying up the phone, so he goes\nover to Taylor's house. Taylor remembers Van Helsing as the guy in the long\novercoat with the pulled down hat from Foodmaster, and Taylor offers to\ncome along to help look for his Mom. When Van Helsing refuses (\"I work alone\"),\nTaylor hides in the back seat of his car until they're well on the\nway...but to where? Well, they don't know where Dimitri and Mom are going,\nbut they do know where they'll end up...at Dimitri's house, probably some\nbig old mansion somewhere out by the lake, of course. All the old mansions\nare out there. Now Taylor and Van Helsing are on the way.Chelsea and Adam get there first and haul Dimitri's coffin down to\nthe lake. When Dimitri arrives, he discovers his coffin floating on the\nwater with Adam sitting on top. Adam tries to make a deal--Mom for the\ncoffin--but Dimitri grabs Chelsea and changes the deal--the coffin for\nChelsea. Adam has no choice but to return the coffin.\nTaylor and Van Helsing finally find the house. Dimitri manages to knock out\nVan Helsing. Then he turns on Chelsea and Adam, who start screaming for their Mom.\nLynette comes out of the trance (Love is stronger than any vampire\ntrance), pushes Dimitri into his coffin, and Van Helsing rivets it shut with silver\nnails. Dimitri will be shipped to the South Pole for the winter and then\nto Finland for the summer. And tomorrow morning, Van Helsing will join the\nHansens for chocolate chip pancakes. [Original Synopsis by bj_kuehl.]"}