{"mid": "MoneyTrain", "IMDB_id": "tt0113845", "title": "Money Train", "plot": "On Christmas, we meet foster brothers John and Charlie. They work as transit cops patrolling the New York City subway. When a mugging occurs, John and Charlie chase the mugger into a subway tunnel, and all trains traveling in their direction are halted. But their harsh transit captain Donald Patterson, allows the money train to continue. John and Charlie avoid getting hit by the train; however, when transit police at the next station witness the mugger running toward the money train, they shoot him dead. The mugger is revealed to be a young teenage boy, which triggers a brawl between John, Charlie, and the other transit officers. Patterson blames the two for causing his money train to arrive late.\nCharlie asks John to borrow $300 to buy a Christmas present, but Charlie instead uses the money to pay off some of his gambling debts to the sleazy night club owner Mr. Brown. Brown intends to have Charlie killed by throwing him off a building, but John bursts in and interrupts, telling Brown that he has the money Charlie owes him. Brown reveals to John that Charlie is $15,000 in debt, so John offers to have the money delivered in a few days. Brown accepts and lets Charlie live.\nDuring their night shift, John and Charlie are introduced to Grace Santiago, a decoy transit officer newly assigned to their unit. Both brothers immediately take a liking to her. During their patrol, a serial killer known as the Torch robs a token booth and sets it on fire. John and Charlie rescue the booth worker and put out the fire, but the Torch manages to escape.\nAt a local bar, Charlie reveals a plan to rob the money train in order to pay off their debts, but John, judging the caper impossible, rejects the idea. Later that night, the two brothers and Grace are assigned to patrol the money train. As Charlie discovers a grate in the floor and a ladder leading to Central Park, a brawl breaks out between John and another officer, quickly involving the entire squad. Patterson again blames the two for the incident and also accuses them of taking some train money, but even after it is found that a collection agent miscounted, Patterson continues to insult them. At the bar, Charlie tells John that the best time to rob the money train would be on New Year's Eve because of looser subway security and because the subway makes the most money on that date: up to $500,000. The plan involves entering the train through the metal grate when the train has stopped, driving it to the maintenance ladder, and escaping into Central Park. John remains reluctant to attempt the theft.\nJohn gives Charlie the $15,000 he needs to pay back Mr. Brown, but on the train, Charlie loses it to a thief. He goes to Brown to explain but is brutally beaten by his men. When Charlie comes back home, he looks at John's house from his window and he sees Grace and John sleeping together. Charlie later tells John that he's happy for him, but he's clearly saddened by Grace's rejection.\nTo nab Torch, an ambush is arranged for which Grace is disguised as an attendant at a station token booth. Torch notices this and, to distract the police, pushes a man in front of a moving train, killing him. Torch sprays gasoline on Grace, but before he can light it, Charlie alerts the other officers, who shoot at Torch. John pursues him into another station, where they fight. Torch is burned by the gasoline he's carrying and pushed under a moving train, killing him. Patterson fires Charlie for ruining the ambush, and when John tries to defend Charlie, he's fired as well.\nJohn then heads to the strip club of the mobsters who beat up his brother and were threatening him for failing to pay up his gambling debts and, after storming inside, beats them all up utilizing his Kung-Fu skills,including knocking down the criminal boss of the organization, Brown, with a 360-degree kick.\nCharlie decides to go ahead with his robbery plan. John is reluctant to do anything about this, but Grace persuades him to save Charlie from trouble. When the money train stops at one of the stations, Charlie enters the train from beneath and drives it to the maintenance ladder, but he can't escape with the money due to the presence of a group of policemen. Meanwhile, John reaches the train and persuades Charlie to drive further to prevent their arrest. Knowing that Patterson will direct his team to trip the train's brakes, the duo bleeds the brakes. Patterson then orders a steel barricade erected to stop the train, but John increases the speed of the money train to its maximum so that it smashes through the barricade. Transit control officer Kowalski declares the money train a runaway and starts clearing tracks, but Patterson diverts the money train onto a track occupied by a passenger train to keep it from having a clear path, putting innocent people at grave risk. The money train rams into the passenger train and then slows down, but speeds up again because it's in full throttle and rams the train again. It repeatedly keeps ramming the passenger train with the increasing risk of derailing it and killing everyone on board.\nSince the money train now had no braking power and the throttle lever is jammed at full power, the brothers decide to throw it into reverse, derailing it and killing both of them but allowing the passengers to live. Charlie comes up with an idea and positions an iron bar in such a way that when the money train rams the other train once more, the bar trips the reverse lever. Both of them climb on top of the train and proceed to the front. When the trains collide one more time, the reverse lever is activated and both brothers jump across to the other train as the money train derails tumbles around several times knocking over several support beams (much to the horror of Patterson who witnesses the whole crash) before finally screeching to a stop on its side just before the station.\nThe brothers try to escape during the commotion but are spotted by Patterson. They pretend to have come to help him, but Patterson rudely insults them. Fed up with his constant abuse, the brothers punch him in the face. As he shouts out to his team to arrest them for assault, Grace comes rushing in and arrests Patterson for endangering the lives of the people on the passenger train. When the two brothers exit the station, they are in Times Square as the countdown for the New Year begins. During the celebration, John realizes Charlie is carrying a money bag containing over $500,000, much to his dismay. The film ends with John and Charlie walking into the distance arguing over the money."}