{"mid": "Mongol", "IMDB_id": "tt0416044", "title": "Mongol", "plot": "The story starts in 1192 (\"Year of the Black Rat\") with Temüjin (Tadanobu Asano) as a prisoner in the Tangut kingdom. He conveys his memories about his earlier life through a series of flashbacks.\nIn the first flashback, embarking on an expedition as a young boy (age 9) twenty years earlier (1172), Temüjin (Odnyam Odsuren) is accompanied by his father Yesügei (Ba Sen) to select a girl as his future wife. Temüjin meets and chooses Börte (Bayertsetseg Erdenebat), although his father wishes him to choose a mate from the Merkit tribe. Temüjin convinces his father to allow him to choose Börte. He promises to return after five years to marry her. On their way home, Temüjin's father is poisoned by an enemy tribe. As he lies dying, he tells Temüjin that he is now Khan. However, one of his father's warriors, Targutai (Amadu Mamadakov), orders the other tribesmen to loot the dead Khan's camp. Targutai spares Temüjin's life, declaring a Mongol does not kill children. After falling through the ice of a frozen lake, Temüjin is found lying down in the snow by a young boy called Jamukha (Amarbold Tuvshinbayar). The two quickly become friends and perform a traditional ceremony declaring themselves blood brothers. Targutai later captures Temüjin, holding him in captivity. Temüjin however, escapes late one night and roams the countryside. Temüjin is later seen again as a young man (Tadanobu Asano) in 1186. He once again is apprehended by Targutai, who wishes to kill him now that he is grown. Temüjin escapes a second time finding Börte (Chuluuny Khulan), and brings her back to his family. Later that night, they are attacked by the Merkit tribe led by Chiledu (Sai Xing Ga), since Temüjin's father had years before stolen his wife from one of their tribesmen. While being chased on horseback, Temüjin is shot with an arrow. Börte whips the horse which Temüjin is on, telling it to go home. Börte is captured by the Merkit leader, as Temüjin returns safely to his family.\nTemüjin goes to Jamukha (Sun Honglei), who is now a Khan himself. Jamukha agrees to help him get his wife back and attack the Merkit tribe, though only after a year passes. The attack on the Merkit tribe is a success, and Temüjin finds Börte alive and Chiledu dead. However, Börte is pregnant. Despite knowing that he is not the father, Temüjin takes the son as his own. Temüjin and his men leave early the next morning, and two of Jamukha's soldiers choose to join Temüjin because he distributes more plunder to his warriors than Jamukha. Jamukha chases down Temüjin, but Temüjin refuses to send back Jamukha's combatants and horses because he explains a Mongol warrior is free to choose his leader. Jamukha warns him that his actions will lead to future conflict. Taichar (Bu Ren), Jamukha's brother, is later killed while attempting to steal back Jamukha's horses; Jamukha and Temüjin go to war. Outnumbered, Temüjin's army is quickly defeated. Jamukha declares victory and decides to make Temüjin a slave rather than execute him.\nTemüjin is sold to a Tangut Garrison Chief (Zhang Jiong), despite the dire warning given to the man by a Buddhist monk (Ben Hon Sun) acting as his advisor, who senses the great potential the warrior carries and his future role in subjugating the Tangut state. While Temüjin is imprisoned, the monk pleads with him to spare his monastery when he destroys the Tangut kingdom sometime in the future. In exchange for delivering a bone fragment to Börte indicating that he is still alive, Temüjin agrees. Thereafter, the monk succeeds in delivering the bone and the message, though at the cost of his life. As a means of getting to Tangut, Börte becomes a merchant's concubine, bearing a daughter along the way. Once Börte arrives in Tangut, she abandons the merchant and bribes the guard for the key to Temüjin's cell, and the two manage to escape back to their homeland.\nTemüjin, upset by the increasing loss of traditional values in Mongol society, leaves his family once more and pledges to make the Mongols abide by the law. Visiting a holy site in the mountains, Temüjin prays to \"The Lord of the Great Blue Sky\" and declares three rules by which Mongols must live: never kill women and children, always honor your promises and repay your debts, and never betray your Khan. Subsequently, he gathers an army to unify all of the Mongols. In 1196, Temüjin declares war over Jamukha. By 1206, Temüjin engages Jamukha, in league with his old enemy, Targutai, in battle. However, a thunderstorm arises on the steppe, terrifying Jamukha's troops and causing their unconditional surrender, as Temüjin stands triumphant (as he is the only Mongol alive who does not fear lightning). Having defeated his \"blood brother\", Temüjin allows Jamukha to live, while Targutai is killed by his own soldiers while attempting to flee the battle. The traitorous men are ordered to be executed by Temüjin (as they betrayed their Khan). Jamukha's surviving troops are spared and integrated into Temujin's army. Afterwards, Temüjin is designated the Khan of all the Mongols – Genghis Khan of the Great Steppe.\nA postscript indicates that Genghis Khan would later go on to invade and conquer the Tangut Empire by 1227, fulfilling the monk's prophecy. While the entire civilization was destroyed by the Mongol horde, a single Buddhist monastery was left untouched, as Temüjin honored his debt to the monk."}