{"mid": "MonkeyShines", "IMDB_id": "tt0095652", "title": "Monkey Shines", "plot": "Allan Mann (Jason Beghe) is an athlete who is rendered quadriplegic when struck by a truck. Mann fails to adjust to his condition, becoming suicidal and despondent. When Geoffrey, a scientist friend of his (John Pankow), who has been experimenting with the injection of human brain tissue into monkeys, learns this, he is prompted to supply one of the experimental monkeys, named \"Ella\" (played by Boo, and voiced by Frank Welker), to Allan as a helper.\nTheir relationship is amicable at first, with Mann's life being made much easier, and the two bond deeply, even sharing poignant moments with moving music. But soon their interaction takes a decidedly sinister turn. The monkey seems to become a telepathic receptacle for Mann's anger at his state and his desire for revenge against friends and family for slights both real and imagined. Simultaneously, Mann develops a romantic relationship with Melanie Parker (Kate McNeil), a specialist in quadriplegia and helper monkeys.\nElla's protectiveness turns to savage jealousy, even as Allan is informed that his condition may be reversible. First, she kills Allan's former girlfriend Linda Aikman (Janine Turner), who is now in a relationship with his former doctor John Wiseman (Stanley Tucci), by setting their romantic hideaway on fire. Ella then kills Allan's jealous, overbearing mother Dorothy (Joyce Van Patten), by electrocuting her in the bathtub. Ella then kills Geoffrey by injecting him with the very syringe of sodium pentobarbitone he had intended to use on her, and disables Melanie, before trying to light her on fire. Allan, helpless and alone, is able to summon the strength to turn on the tape player with the romantic music, summoning Ella to cuddle close to him. When Ella cradles Allan's head, Allan, rightfully betraying Ella's trust, bites and thrashes his head back and forth in a violent manner, hitting Ella into the handles of his wheelchair before finally relinquishing his bite and throwing her toward the open deck of his tape machine, killing Ella.\nLater, Allan undergoes surgery. While resting after the operation, he has a nightmare that he flatlines and Ella leaps out of his back while the doctor is making an incision. Afterwards, Allan regains his ability to walk with the aid of crutches."}