{"mid": "MonOncle", "IMDB_id": "tt0050706", "title": "Mon oncle", "plot": "M. Hulot (Jacques Tati) is the dreamy, impractical, and adored uncle of nine-year-old Gérard Arpel, who lives with his materialistic parents, M. and Mme. Arpel, in an ultra-modern geometric house and garden, Villa Arpel, in a new suburb of Paris, situated just beyond the crumbling stone buildings of the old neighborhoods of the city. Gérard's parents are entrenched in a machine-like existence of work, fixed gender roles, the acquisition of status through possessions, and conspicuous displays to impress guests, such as the fish-shaped fountain at the center of the garden that, in a running gag, Mme. Arpel activates only for important visitors.\nEach element of Villa Arpel is stylistically- rather than functionally-designed, creating an environment completely indifferent to the comfort, or lack of comfort, of its occupants. In choosing modern architecture to punctuate his satire, Tati once stated, \"Les lignes géométriques ne rendent pas les gens aimables\" (\"geometrical lines do not produce likeable people\"). From inconveniently-located stepping stones, to difficult-to-sit-on furniture, to a kitchen filled with deafeningly loud appliances, every facet of Villa Arpel emphasizes the impracticality of a dedication to superficial aesthetics and electrical gadgets over the necessities of daily living.\nDespite the superficial beauty of its modern design, the Arpels' home is entirely impersonal, as are the Arpels themselves. In fact, M. and Mme. Arpel have completely subordinated their individuality to maintain their social position and their shiny new possessions. Tati emphasizes his themes surrounding the Arpel lifestyle (as well as M. Arpel's automatonic workplace, Plastac) with monochromatic shades and cloudy days.\nBy contrast, Monsieur Hulot lives in an old and run-down city district. He is unemployed, and gets around town either on foot or on a VéloSoleX motorized bicycle. Gérard, utterly bored by the sterility and monotony of his life with his parents, fastens himself to his uncle at every opportunity. Hulot, little more than a child himself at times, is completely at home with Gérard, but also completely ineffectual at controlling his horseplay with his school friends, who take delight in tormenting adults with practical jokes. Exasperated at their relative's perceived immaturity, the Arpels soon scheme to saddle him with the twin yokes of family and business responsibilities."}