{"mid": "MonsieurVerdoux", "IMDB_id": "tt0039631", "title": "Monsieur Verdoux", "plot": "Henri Verdoux had been a bank teller for thirty years before being laid off. To support his wife and child, he turns to the business of marrying and murdering wealthy widows. The Couvais family becomes suspicious when Thelma Couvais draws all her money and disappears, only two weeks after marrying a man named \"Varnay\", whom they only know through a photograph. As Verdoux (Chaplin) prepares to sell the residence of the murdered Thelma, widowed Marie Grosnay visits the residence. Verdoux sees her as another \"business\" opportunity and attempts to charm her, but she refuses. In the following weeks, Verdoux has a flower girl repeatedly send Grosnay flowers. In need of money to invest, Verdoux, as M. Floray, visits widow Lydia Floray (Hoffman), who complains that his engineering job has kept him away too long. That night, Verdoux murders her for her money.\nVerdoux develops a poison untraceable by autopsy to use as a better means to kill. He meets The Girl (Nash) on a rainy night on the street, takes her in, and gives her poisoned wine along with eggs and toast. She thanks him for his kindness, remarks about love, her dead husband (who served in the war), and how she still believes in love. Verdoux changes his mind as she is about to sip the wine, and he spares the girl. She leaves unknowing of his cynical intentions.\nVerdoux makes several attempts to murder Annabella Bonheur, including by strangulation while boating, and by poisoned wine, but she manages to escape unknowingly while putting Verdoux himself in danger or near death. Grosnay eventually relents to the continual flowers from Verdoux and invites him to her residence. Verdoux convinces her to marry him, and Grosnay's friends hold a large public wedding to Verdoux's disapproval. Unexpectedly, Bonheur shows up to the wedding. Panicking, Verdoux fakes a cramp to avoid being seen and eventually deserts the wedding.\nBefore the Second World War breaks out, the European markets collapse, and Verdoux loses his assets. The Girl, now well-dressed and chic, once again finds Verdoux on the street. She invites him to an elegant dinner at a high-end restaurant as a gesture of gratitude for his actions earlier. The girl has married a man she doesn't love to be well-off. Verdoux reveals that he has lost his family. At the restaurant, members of the Couvais family recognize Verdoux and attempt a pursuit. Verdoux is able to bid the girl farewell before being captured by investigators.\nVerdoux is exposed and convicted of murder. Before being led to the guillotine, he dismisses his killing of a few, for which he has been condemned, as no worse than the killing of many in war, for which others are honored."}