{"mid": "MonsterAGoGo", "IMDB_id": "tt0059464", "title": "Monster a-Go Go", "plot": "A space object is circling Earth - it looks like a helicopter. Col. Steve Connors (Phil Morton) tries to communicate with it. They speak to a radio dispatcher. They find that the capsule of Frank Douglas, the astronaut has fallen down to Earth. Ginny (Lois Brooks) visit Ruth Douglas (June Travis), Frank's wife. Dr Chris Manning (Peter M. Thompson) visit them when they are worried about Frank's disappearing.Connors, Ginny and other policeman look at the scenery where the capsule fell: there is no proof that Frank Douglas is dead. Analysis by Dr Logan shows that there is radioactivity. Nobody wants to speak with Ruth or her son Jimmy. Manning visits the area. He's the civilian responsible for the case.A girl (Lorri Perry) is dancing the night away with her friends. She wants to dance with everybody, not only her boyfriend. They leave because he gets jealous. They make out in their car in the night. A dog barks. She screams. Connors et allii see that the girl is alive, but the man isn't. They take her away.An alien - or maybe mutated Douglas - attacks a scientist - Lucas - which is measuring up radioactivity. Ruth had an intuition that everything was gonna go wrong. She, Ginny, Connors and Manning search the area.In the morning, two men discuss the situation. They asks Dr Bergman (Aviva Crane) about Lucas' murder and the radioactivity. The monster is calculated to be extremely strong and tall. At the lab, scientists conduct some tests. Dr Bergman leaves for her weekend, but Dr Logan's brother - also called Dr Logan - realises that the danger is not over, and that time is running out. Radiation made Douglas mutate onto something much bigger. Frank has gone with the antidote, but Logan didn't want to say. Dr Brand says that Logan may have jeopardized the whole project, but Logan says he couldn't avoid it.Girls sunbathing in bikinis. The alien monster arrives, it has a deformed scarred face, surrounded by a weird sound. They ran from the monster. Dr Logan is told immediately. They want to inject an antidote to the Douglas monster. Plenty of money was thrown in by humans to kills the monster. They also discovered they they can't leave. Two soldiers talk from behind a stone pillar.The monster enter the area where the Army and the lab are. The monster and the emergency services are running from one another. It leads a legacy of radioactivity. The police find a huge whole, and the monster may have risen from there. They use a decontamination spray.They can't find the monster who looks dazed walking around in a tunnel. Radioactivity increases after the monster, but they can't find him.Suddenly, the monster disappears; the narrator (Bill Rebane) concludes that never was t here a monster. Frank Douglas appears alive and well in the Pacific with a normal size. We can see the first scene of the film again - Frank Douglas dressed as a kind of astronaut walking superimposed on a scene of stars. .>>Summary by KrystelClaire"}