{"mid": "MonstersUniversity", "IMDB_id": "tt1453405", "title": "Monsters University", "plot": "Michael \"Mike\" Wazowski, a six-year-old monster, visits Monsters Inc., a scaring company, on a school field trip. During the visit, the class meets Frank McCay, an employee of the company who works as a \"scarer\", entering the human world to scare children at night and harvesting their screams as energy to power the monster world. Mike, enchanted with the idea of being a scarer, slips through Frank's door before anyone can stop him, where he watches Frank's scare performance, then follows him back through the door to the monster world. Frank scolds Mike, but is impressed with his ability to have followed him unnoticed, and gives him his Monsters University hat as a souvenir. Oblivious to his teacher's later admonishments, Mike dreams of being a scarer when he grows up.Approximately eleven years later, Mike is a scare major at Monsters University. On his first day, he meets his new roommate, Randall \"Randy\" Boggs, a nerdy monster that can turn invisible. During the first class of the scare program, as Mike is answering a question, he is interrupted by another scare student, an arrogant large blue monster named James P. \"Sulley\" Sullivan. The class is also informed by Abigail Hardscrabble, the strict Dean of the scare program, that they must pass their final exam of the semester to continue in the program. While Mike is studying one night, Sulley inadvertently barges into his room to hide the pig mascot he stole from their rival college, Fear Tech. While the two bicker, the pig steals Mike's MU hat and escapes. Mike and Sulley give chase, but when Mike finally manages to capture it, Sulley takes credit, and is invited to join Roar Omega Roar, the elite fraternity on campus. Mike wishes to join, but is rejected, magnifying the rivalry between the two.Mike studies hard and repeatedly answers questions in class correctly, while the privileged Sulley, convinced all he needs is his natural scaring ability, begins to falter. At the final exam, Mike and Sulley's rivalry causes Hardscrabble to fail them both and dropping them from the program, which prompts Roar Omega Roar to remove Sulley from the fraternity. Dissatisfied in his boring new major, Mike decides to prove himself by entering the Scare Games, an extracurricular scaring competition. As the games are only for fraternity or sorority members, Mike joins Oozma Kappa, a small fraternity of misfit monsters. When Mike and Oozma Kappa are denied entry as they are one team member short, Sulley offers to join, seeing the competition as his ticket back into the scare program, and Mike eventually reluctantly accepts. Mike also makes a deal with Dean Hardscrabble, who remains skeptical, to re-admit their entire team to the scaring program if they win, whereas if they lose, Mike must leave Monsters University. Sulley expects to carry the team by himself, but Mike believes that with enough training, the whole team can succeed.With the last-placing team in each round of the Games being eliminated from the competition, Oozma Kappa fails the first challenge miserably but miraculously advances when another team is disqualified. They then attend a party at Roar Omega Roar house where initially the other competitors appear to accept them, but the fraternity pranks and humiliates them instead. The group is discouraged as they are now the laughingstock of the entire campus, so Mike arranges a secret visit to Monsters, Inc. to lift their spirits. After that, Oozma Kappa uses their wits and training to advance to the final round against Roar Omega Roar. Even having advanced so far, Sulley does not think that Mike can be a true scarer because of his lack of natural ability. After the team wins the final round, Mike discovers that Sulley manipulated the equipment to improve Mike's score. Mike is heartbroken and wants to prove that he is capable of becoming a scarer, so he breaks into the school's door lab and enters a door to the human world, but discovers that the door leads to a summer camp and he is unable to scare the cabin full of children.Back at the university, Sulley confesses to The Dean, Hardscrabble, that he cheated, just as she is notified of the break-in. Realizing what happened, Sulley enters the door to look for Mike. After finding Mike and reconciling, the pair, now being pursued by human adults, attempt to return, but find themselves trapped in the human world, as Hardscrabble has deactivated the door waiting for the authorities arrive. Mike realizes that the only way to get back into the monster world is to generate enough scream energy to power the door from their side. Working together, Sulley and Mike terrify the adults, generating an overwhelming amount of scream energy and allowing them to return to the lab. Their actions lead to their expulsion from the university, but the other members of Oozma Kappa are accepted into the scare program the next semester as Hardscrabble was impressed with their performance in the games. They share goodbyes and as Sulley and Mike leave, Hardscrabble tells them they are the first to have surprised her, and wishes them luck for the future. Mike and Sulley work at Monsters, Inc. in the company mailroom with the Abominable Snowman as the mailroom's manager. Working their way up through the company, the two eventually become part of the Scarer Team."}