{"mid": "MortalKombatDefendersOfTheRealm", "IMDB_id": "tt0122355", "title": "Mortal Kombat: Defenders of the Realm", "plot": "The series takes place in a fictional universe consisting of eighteen surviving realms which, according to in-game backstories, were created by the Elder Gods. The Mortal Kombat: Deception manual described six of the realms as: \"Earthrealm, home to such legendary heroes as Liu Kang, Kung Lao, Sonya Blade, Johnny Cage, and Jax, and also under the protection of the Thunder God Raiden; Netherrealm, the fiery depths of which are inhospitable to all but the most vile, a realm of demons and shadowy warriors such as Quan Chi and Noob Saibot; Outworld, a realm of constant strife which Emperor Shao Kahn claims as his own; Seido, the Realm of Order, whose inhabitants prize structure and order above all else; the Realm of Chaos, whose inhabitants do not abide by any rules whatsoever, and where constant turmoil and change are worshipped; and Edenia, which is known for its beauty, artistic expression, and the longevity of its inhabitants.\" The Elder Gods decreed that the denizens of one realm could only conquer another realm by defeating the defending realm's greatest warriors in ten consecutive Mortal Kombat tournaments.\nThe first Mortal Kombat game takes place in Earthrealm (Earth) where seven different warriors with their own reasons for entering participated in the tournament with the eventual prize being the continued freedom of their realm, threatened with a takeover by Outworld. Among the established warriors were Liu Kang, Johnny Cage and Sonya Blade. With the help of the thunder god Raiden, the Earthrealm warriors were victorious and Liu Kang became the new champion of Mortal Kombat. In Mortal Kombat II, unable to deal with his minion Shang Tsung's failure, Outworld Emperor Shao Kahn lures the Earthrealm warriors to the Outworld where the Earthrealm warriors eventually defeat Shao Kahn. By the time of Mortal Kombat 3, Shao Kahn revives Edenia's (now a part of his Outworld domain) former queen Sindel in Earthrealm, combining it with Outworld as well. He then attempts to invade Earthrealm but is ultimately defeated by the Earthrealm warriors again. After Kahn's defeat, Edenia was freed from Kahn's grasp and returned to a peaceful realm, ruled by Princess Kitana. The following game, Mortal Kombat 4, features the former elder god Shinnok attempting to conquer the realms and attempting to kill the thunder god Raiden. However, he is also defeated by the Earthrealm warriors.\nIn Mortal Kombat: Deadly Alliance, the evil sorcerers Quan Chi and Shang Tsung join forces to conquer the realms. By Mortal Kombat: Deception, after several fights, the sorcerers emerge victorious having killed most of Earthrealms' warriors until Raiden steps forth to oppose them. The Dragon King Onaga, who had been freed by Reptile at the end of Mortal Kombat: Deadly Alliance, had deceived Shujinko into searching for six pieces of Kamidogu, the source of Onaga's power. Onaga then confronted the alliance of Raiden, Shang Tsung, and Quan Chi and thus obtained Quan Chi's amulet, the final piece of his power. Only a few warriors remained to combat against the Dragon King and his forces. Shujinko eventually triumphed over the Dragon King and removed his threat to the Mortal Kombat universe.\nIn Mortal Kombat: Armageddon the catastrophe known as Armageddon starts. Centuries before the first Mortal Kombat, Queen Delia foretold the realms would be destroyed because the power of all warriors from all the realms would rise to such greatness it would overwhelm and destabilize the realms, triggering an all-destructive chain of events. King Argus had his sons, Taven, and Daegon, put into incubation who would one day be awakened to save the realms from Armageddon by defeating a firespawn known as Blaze. In the end, however, Shao Kahn is the one who defeats Blaze, causing Armageddon.\nIn Mortal Kombat (2011), it is revealed that the battle between the warriors of the six realms culminated into only two survivors: Shao Kahn and Raiden. Badly beaten, Raiden had only one last move he could make to prevent Shao Kahn from claiming the power of Blaze. He sends last-ditch visions of the entire course of the Mortal Kombat timeline to himself in the past right before the tenth Mortal Kombat tournament (first game). This transfer of information to his former self causes a rift in time, causing a new \"reboot\" timeline to be introduced that splits off from the original Armageddon timeline, with a new outcome of Mortal Kombat history to be written. But this story leads to even worse unforeseen events. It ends with many of the main game characters dying at the hands of Queen Sindel and Raiden accidentally killing Liu Kang in self-defense. Eventually, the Elder Gods aid Raiden in killing Shao Kahn and saving Earthrealm. But as the scene goes on it is later revealed that this was all a plan by Shinnok and Quan Chi.\nMortal Kombat X sees Shinnok and Quan Chi enacting their plan, leading an army of undead revenants of those that were killed in Shao Kahn's invasion against the realms. A team of warriors led by Raiden, Johnny Cage, and Sonya Blade oppose Shinnok, and in the ensuing battle, Shinnok is imprisoned, Quan Chi escapes, and various warriors are resurrected and freed from Shinnok's thrall. Twenty-five years later, Quan Chi resurfaces and allies himself with the insect-like D'Vorah in manipulating events that lead to Shinnok's release. Though Quan Chi is killed by a vengeful Scorpion in the process, Shinnok resumes his assault against the realms. After a grueling, protracted battle, Shinnok is defeated by Cassandra Cage representing the next generation of Earthrealm's warriors. With both Quan Chi and Shinnok gone, the undead revenants of Liu Kang and Kitana assume control of the Netherrealm and Lord Raiden now protects the Earthrealm not defensively but offensively with the help of the remaining revenants."}