{"mid": "MortalEngines", "IMDB_id": "tt1571234", "title": "Mortal Engines", "plot": "The book mortal engines starts with a traction town of London chasing and catching a town called Salt-Hook. Tom Natsworthy is in the \"Gut\" of London when this happens, along with the head of the Historians, Valentine, and his daughter, Katherine. One of Salthook's Citizens, Hester Shaw, tries to kill Valentine, but Tom inteferes and chases her. She reveals a huge scar on her face and claims Valentine dealt it, before dropping out of London through a chute. Tom tells Valentine everything she said, and Valentine promptly pushes him down after her. They recover outside of London, and after an argument start following its tracks to try and catch up. Katherine begins investigating events in London, along with Bevis Pod, who she befriends. They discover that the guild of engineers in London have managed to salvage an ancient weapon called MEDUSA, and reassembled it inside Saint Paul's Cathedral. The Cathedral transforms to reveal the weapon, which is then used to destroy a much larger city pursuing London. Meanwhile, Tom and Hester meet an airship pilot called Anna Fang, who takes them to the flying city of Air Haven. However, they are then attacked by a semi-robotic resurrected human called Shrike, who was sent after them by London's engineers. Tom and Hester narrowly escape to another town, with Shrike in pursuit. They learn that Ana Fang was a member of the Anti-traction league, a group opposed to Traction cities. After many encounters they are confronted by Shrike again, who nearly kills Tom. Shrike, who had looked after Hester in the past before coming to London, explains that the engineers had agreed to resurrect Hester as a similar semi-robotic being to him after he brings back her body. She agrees to this, however Tom intervenes by stabbing Shrike in the chest, shutting him down and saving her life.\n=== Part Two ===\nWith MEDUSA finally launched, the mayor begins guiding London east towards the Anti Traction League. His intention is to use the weapon to destroy their defenses and devour all of their settlements. Katherine learns from Valentine that the weapon was originally found by Hester's mother, and that he had killed her to steal it for London. He also admits that Katherine was likely Hester's half sister. Disilusioned, and horrified by the destructive power of the weapon, Katherine and Bevis conspire to plant a bomb on Medusa to try and stop it from being used. Meanwhile, Ana Fang, having witnessed the first firing of Medusa, takes Tom and Hester to the Anti Traction League to warn them of London's plans. The League decides to use their airships to make a bombing run on London, much to Tom's dismay. Before they can, Valentine is revealed to have infiltrated the league disguised as a monk, and despite Tom recognising him and attempting to sound the alarm, he succeeds in crippling their entire fleet of airships. Valentine duels with and kills Ana Fang, before escaping in his own airship. Tom and Hester take Ana Fang's ship, and fly it back to London in the hope of stopping Valentine and MEDUSA themselves. Katherine and Bevis are caught in their attempt to bomb MEDUSA, but the historians guild come to their aid, battling with the Engineers. Tom and Hester arrive, and the latter attempts to fight her way to Valentine in order to avenge her mother, but is captured. Tom is attacked by Valentine's personal airship above London and shoots it down. Bevis is killed, but Katherine reaches Saint Paul's Cathedral with her bomb. Inside, she sees Hester brought before Valentine. When he attempts to kill her, Katherine jumps in the way and is fatally wounded. She falls onto a keyboard, interrupting the firing sequence of MEDUSA, and causing it to malfunction. Valentine and Hester, briefly putting aside their differences, try to take Katherine to Tom to get help, but she dies before they can. Hester leaves with Tom in the airship, while Valentine chooses to stay behind in London. MEDUSA finally misfires, obliterating most of the city. Hester tries to comfort a grief stricken Tom as they fly away in the airship, apparently the only survivors of the incident."}