{"mid": "MotelHell", "IMDB_id": "tt0081184", "title": "Motel Hell", "plot": "Farmer Vincent Smith and his younger sister Ida live on a farm with an attached motel, named “Motel Hello” (but the neon ‘O’ flickers). Vincent's renowned smoked meats are actually human flesh--he sets traps on nearby roads to catch victims. He buries the victims up to their necks in his \"secret garden\", then cuts their vocal cords to prevent them from screaming. They are kept in the ground and fed until ready for harvest. Ida helps Vincent, as she sees the victims as only animals.\nVincent shoots out the front tire of a couple's motorcycle. The male, Bo, is placed in the garden, but Vincent brings the female, Terry, to the motel. Sheriff Bruce, Ida and Vincent's naïve brother, arrives the next morning. Vincent tells Terry her boyfriend died in the accident and was buried: a trip to the graveyard shows his crude grave marker. Terry, with nowhere to go, decides to stay at the motel. Vincent and Ida continue to capture more victims for the garden. Terry gradually becomes attracted to Vincent's honest manner and folksy charm, much to Bruce's dismay, who tries to woo her himself without success.\nVincent captures more victims by placing wooden cutouts of cows in the middle of the highway to cause his victims to stop, allowing him to capture them. He also places a fake ad and lures in a pair of swingers, believing the hotel to be a swing joint. The next day, Vincent suggests he teach Terry to smoke meat. Ida becomes jealous and attempts to drown Terry, but Vincent arrives to save her. This causes Terry to fall completely in love with him, and she tries to seduce Vincent. Vincent denies her advances, saying they must first marry. She agrees to marry the following day.\nBruce comes to the motel to protest Terry's choice. He tells Terry that Vincent has \"syphilis of the brain\". Vincent arrives and drives off his brother with a shotgun. To prepare for the wedding, Vincent, Terry, and Ida drink champagne, but Ida drugs Terry's glass and she faints. Ida and Vincent then prepare some victims for the wedding. Meanwhile, Bruce investigates the disappearances and becomes suspicious of his brother.\nVincent and Ida kill three victims and take them to the slaughterhouse. In removing the other three, the dirt around Bo loosens and he begins to escape. Bruce sneaks back to the motel to rescue Terry, but Ida returns. She ambushes Bruce and knocks him out, then takes Terry at gunpoint to the meat processing plant where Vincent tells her his secret. Terry is horrified by the prospect of smoking human flesh. Meanwhile, Bo escapes and frees the other victims from the garden. Vincent sends Ida back to the motel to fetch his brother, but the victims attack her and knock her out. Terry tries to escape, but Vincent gasses her, and then ties her to a conveyor belt. He is interrupted by Bo, who crashes through a window, but Vincent strangles the weakened Bo.\nBruce awakens, finds one of his brother's shotguns, and goes to the plant, but finds that his brother has armed himself with a giant chainsaw and placed a pig's head over his own as a gruesome mask. Vincent disarms his brother, but Bruce grabs his own chainsaw and duels Vincent. During the fight, the belt restraining Terry is activated, sending her slowly to a cutting blade. Despite his wounds, Bruce drives the chainsaw deep into Vincent's side. Bruce frees Terry, and then returns Vincent, who gasps his final words, leaving the farm and \"secret garden\" to Bruce, and lamenting his hypocrisy by using preservatives.\nBruce and Terry go to the \"secret garden\" and find only Ida, who is buried head first. They leave the motel; Bruce comments he is glad he left home when he was eleven. Terry suggests burning the motel, claiming it is evil. The neon sign saying “Motel Hello” fully shorts out, permanently darkening the ‘O’."}