{"mid": "Mouchette", "IMDB_id": "tt0061996", "title": "Mouchette", "plot": "The film opens with a gamekeeper, Mathieu (Jean Vimenet), watching a poacher, Arsène (Jean-Claude Gilbert), as he sets his snares in the sunlit woods. Mouchette (Nadine Nortier), whose name means \"little fly,\" lives in an isolated French village with her alcoholic father and bedridden mother, where she takes care of her infant brother and does all the housework.\nShe is first introduced at her school, in bedraggled clothes and oversized clogs, where she is mocked by her classmates and chastised by her teacher, first for refusing to sing, and then for singing off-key. To correct this, her teacher grabs her by the head, orienting Mouchette's ear toward the piano keys, while striking the correct note several times. Later, Mouchette throws mud at several girls in her class who run away.\nLater, in a contrast to the misery of her daily life, Mouchette goes to the fair and rides on the bumper cars. She meets a young man who bumps his car into hers several times. She bumps into his a few times. Despite the physical shocks incurred upon her during the activity, Mouchette seems to overlook them, and even likes the young man. Afterwards her father abruptly intervenes, slapping her on the face before she can speak to the boy.\nWhile walking home from school one day, she gets lost in the woods and must seek shelter under a tree when a fierce rainstorm falls. Arsène, an alcoholic epileptic, stumbles upon her and takes her to his hut. He fears he has killed a man with whom he had fought and attempts to use Mouchette as an alibi to disabuse him of the blame. After she agrees to repeat the story he gives her, Arsène rapes her. By early morning, Mouchette gets away and walks home. Returning home and finding her mother's condition worsening, she attempts to assuage her fears by comforting her. After her mother eventually succumbs to this sickness, Mouchette goes on an excursion for milk. On the way she has several encounters with the townspeople, in each of which she is insulted and dehumanized.\nLater on, when confronted about the events of the previous night in the woods, she tries to offer the story agreed upon with Arsène. Reluctantly she states that she was at Arsène's house through the night because they were lovers. Finally, she is invited into the house of an elderly woman, who gives her several dresses and a shroud to cover her mother upon her mourning. The elderly woman is very condescending to Mouchette. On her way out, Mouchette insults her and damages the elderly woman's carpet. She goes to a nearby lake. Mouchette waves to a man on a tractor, is ignored, covers herself in the shroud and rolls downhill into the water."}