{"mid": "Mousehunt", "IMDB_id": "tt0119715", "title": "Mousehunt", "plot": "When once-wealthy string magnate Rudolf Smuntz (William Hickey) dies, he leaves his outdated string factory and a run-down mansion to his two sons, Lars (Lee Evans) and Ernie (Nathan Lane). When Lars refuses a proposal by representatives from the large Zeppco conglomerate to purchase their string factory, his wife April (Vicki Lewis) throws him out. Meanwhile, Ernie serves Mayor McKrinkle (Cliff Emmich) at his restaurant in anticipation of becoming a famous chef for serving such a high-profile guest. However, the mayor is poisoned by a cockroach (which came from Rudolf's old box of Cuban cigars that Ernie took for himself) and suffers two heart attacks, with the latter fatal. As a result, Ernie's restaurant is closed down by the Board of Health.\nFinding blueprints of the mansion that they decide to live in, Ernie and Lars discover that it is a lost masterpiece designed by famous architect Charles Lyle LaRue. LaRue collector Alexander Falko (Maury Chaykin) makes a proposal, but Ernie refuses under the belief they can make a larger profit by restoration and auction. However, the brothers have already realized that the house has one stubborn occupant: a tiny and treacherous mouse. Lars is initially dismissive of the mouse but Ernie, remembering the cockroach incident, is determined to rid the house of any vermin that could potentially ruin their plans.\nWhen a single mousetrap proves to be useless against the mouse, Ernie and Lars cover the entire kitchen floor with a number of mousetraps, but end up trapped in the kitchen when the door is locked. The mouse slips through the maze of traps with ease and drops a cherry, setting off the mousetraps in a dominoes effect. The brothers attempt to kill the mouse with a vacuum cleaner, but are covered with sewage. To make matters worse, the brothers are then served with a repossession notice by the bank, who warn them that they will lose the house unless they make an overdue mortgage payment of $1200 within two days. They initially attempt to raise the money by withholding the pay of the workers at the factory but this suggestion triggers an angry response from the workers who then go on strike. In desperation, Lars tries to run the factory on his own but ends up losing his clothes after accidentally feeding a loose thread from his jacket into the machinery while damaging the fuse box. He is then unexpectedly reunited with April, who has learned of the auction and the brothers' plans to get rich.\nThe brothers purchase a monstrous cat named \"Catzilla\" to deal with the mouse. Catzilla chases the mouse throughout the house while destroying everything, but gets tricked onto the house's dumbwaiter as the mouse sends him on a one-way trip down to his demise. They then hire an eccentric exterminator named Caesar (Christopher Walken) to handle the mouse, though he is severely injured and hospitalized after the mouse attaches him to the winch of his own truck which then violently drags him out of the house and destroys the plumbing. Meanwhile, Ernie goes behind Lars' back and tries to revive the deal to sell the factory to Zeppco but his meeting with them is thwarted when he is hit by a bus while trying to impress two Belgian hair models. As Ernie is taken into hospital, Lars arrives (while wearing April's coat and hat) and informs him that April has given them the $1200 to pay off the mortgage.\nAfter getting back to the house and witnessing the damage caused by Catzilla and Caesar, Ernie chases the mouse up a chimney and gets stuck, and Lars attempts to light a match while the mouse starts a gas leak, creating an explosion that blasts Ernie out of the chimney and into the lake where he and Lars lost a tub that they were trying to bring in. Ernie takes a shotgun to fire at the mouse, accidentally shooting a compressed can of pesticide that Caesar left behind, blowing a huge hole in the floor. The brothers then get into an argument after an answerphone message from Zeppco reveals to Lars Ernie's attempt to sell the factory, which culminates with Lars throwing an orange at Ernie, but accidentally knocks the mouse unconscious. Unable to finish him off, they instead seal the mouse in a box and mail him to Fidel Castro in Cuba. The brothers reconcile again and finish renovating the house.\nWhen the night of the auction arrives, Lars discovers the mouse's box in the snow returned due to insufficient postage and with a big hole gnawed through it. Lars and Ernie panic upon seeing the mouse return, but attempt to maintain their composure as the auction continues. The mouse also devours Rudolf's \"lucky string,\" which he gave to the brothers before his death, making their vendetta even more personal. The brothers desperately attempt to flush out the mouse by feeding a hose into the wall. As the auction reaches a record $25 million bid, the house rapidly floods through the walls and the floors, causing everyone to be washed out of the house as it promptly collapses. The brothers' only consolation is the fact that the mouse must finally be dead as their father's \"lucky string\" is found in the wreckage.\nWith nowhere else to go, the brothers return to the factory and fall asleep, with only a single chunk of cheese for food. Having followed them, the mouse restarts and feeds the cheese into the machinery inventing the world's first string cheese, which inspires Ernie and Lars. Ernie and Lars end their war with the mouse and have successfully rebuilt the factory as a novelty string cheese company. Lars has begun a relationship with one of the Belgian hair models, Hilde, and Ernie puts his culinary skill to work in developing new cheese flavors with the mouse as his personal taste-tester."}