{"mid": "MouseInManhattan", "IMDB_id": "tt0037929", "title": "Mouse in Manhattan", "plot": "Jerry has enough of the country life and decides to leave to the city. He writes a goodbye letter to Tom saying he's off to see the city sights. In a series of antics in New York City, he gets stuck in gum on the floor of Grand Central, ends up as a makeshift shoe polisher, admires the towering skyscrapers, and even attempts to literally climb the Empire State Building, but to no avail, and gets scared when he sees a statue and runs into a woman's green heeled shoes. As Jerry passes through, he sees the woman's large toe and polished toenail at the bottom of her shoe and he uses it as a mirror to make him look nice. After he's done grooming, he walks away and accidentally falls into a stream beside the sidewalk and floats away on a bottle cap.\nHe admires beautiful girls wearing pretty shoes and also Times Square before falling down the sewer, has a close shave with oncoming traffic, gets nauseated in an elevator, moves under the carpet to the Starlite Room and moves again where he bumps into a doorway, crawls into a room and comes out all blushed. He looks up at the sign which says Powder Room and runs to the Check Room near the Powder Room he passed. As he tries to fix the top hat he was on, it pops up fast squishing him down and down again before he bounced out of the room. After he fixes his hat, he sees a woman pass by and he jumps on the back of the train dress behind her legs and takes a ride. He almost falls down a drain and gets knocked off by a plant pot handle in the way, gets back up and follows the direction where she went but instead heads toward the table and dangles precariously over the city on an ever-breaking candle. Later, he dances with several placecards (in the form of attractive women).\nWhile dancing, Jerry loses his balance and gets stuck in a champagne bottle which pops him out of the building and he falls all the way to the ground with the help of a sock on a clothesline which becomes his parachute. He lands in a dark alley in a puddle; sneezes and is heard and scared off by an alley full of hungry vicious cats. He then hurtles across the city on trash cans, one of which hits a fire hydrant and sends him flying through a jewellery shop window, after which he is shot at by the police. As Jerry escapes the city (while nearly being run over by an uptown express train on one of the Interborough Rapid Transit lines in the process), he quickly races over the George Washington Bridge and railroad tracks back to the countryside (having decided that the city life is not for him). There, he finds Tom still asleep (apparently unaware that Jerry was gone). He tears his unread note and kisses Tom, waking him up in the process, before placard nailing a sign reading \"Home Sweet Home\" above his mousehole, and entering afterwards."}