{"mid": "MouseTrouble", "IMDB_id": "tt0037090", "title": "Mouse Trouble", "plot": "A mailman delivers a box in the mailbox. Tom opens the box and finds a book on how to catch mice and for the rest of the cartoon, he takes its advice to attempt to catch the mouse (Jerry).\nThe first thing the book suggests is to locate the mouse. Tom \"locates\" the mouse, but when he tries to grab Jerry, the mouse steps off the book and slams Tom's nose in it.\nTom sets out a simple mouse trap and tests it by snapping it by touching it with a feather. Jerry, however, succeeds in freeing the cheese from it without setting off the trap. Shocked at the trap's failure, Tom tests it, and the trap snaps as soon as he touches it, causing him to scream in pain. Tom then sets a snare trap around a piece of cheese and gets ready to pull the string but Jerry sneakily replaces the cheese with a bowl of cream. When Tom peeks back at the trap, he sees the cream and drinks it, completely distracted by it as Jerry activates the trap, sending the cat out to the tree himself.\nTom's next attempt at catching Jerry is to guffaw while reading the book. A curious Jerry ventures out of his hole and Tom eventually captures Jerry by shutting him into the book. But when Tom grabs him, Jerry pulls the same trick on him with his fists. Tom inspects them only to get punched in the eye and leaving Jerry to escape. (This trick was pulled again in Safety Second.) After reading in the book that \"A Cornered Mouse NEVER FIGHTS\", Tom pounces onto Jerry, but Jerry fights back and beats Tom offscreen. Afterwards, Tom, now bruised and battered, drones \"Don't you believe it!\" - a cultural reference to the distinctive jingle on the 1940s radio show Don't You Believe it! (Voiced by Harry E. Lang.) (This was repeated at the conclusion of the episode The Missing Mouse).\nAt this point, Tom stops reading from chapter-to-chapter and skims the book, trying suggestions that he likes or thinks one of them will work. Upon reading Chapter VII: \"Be scientific in your approach\", Tom uses a stethoscope to listen for Jerry within the walls of the house. This backfires when Jerry screams into the microphone, almost deafening Tom. Tom then forces a double-barreled shotgun into Jerry's mousehole. However, the barrels of the gun bend upwards, protrude out of the wall and point straight at Tom's head as the cat fires and ends up shooting himself in the head, rendering himself bald.\nIn the next scene, Tom, wearing a dodgy, orange toupée, sets a bear trap and sticks it inside Jerry's hole. Jerry walks outside from another hole behind Tom and puts then trap behind him. Just as Tom sits down, the trap triggers. Tom screams in pain and is sent up into the ceiling. Tom then tries to use a mallet to flatten Jerry. Jerry pops out of a hole behind a picture right above Tom, grabs the mallet, and hits him, knocking him out.\nTom then attempts to hide inside a large gift box before knocking on Jerry's wall. Jerry, seeing the box, knocks on it. With no response, Jerry returns with a bunch of pins and sticks them inside the box while Tom whimpers in pain before sawing the box in half. Hearing nothing inside, Jerry looks inside the box, and in horror, he gulps and displays a sign reading \"IS THERE A DOCTOR IN THE HOUSE?\"\nNow covered in bandages (including one wrapped around his bisected torso), Tom reads the twelfth chapter of the book, \"Mice are Suckers for Dames\", which makes him wind up a female toy mouse which repeatedly says \"come up and see me some time\". Jerry, noticing the toy, walks with it. Tom attempts to lure Jerry into a mouse-sized pretend hotel which is named \"cozy arms\", the door of which leads into Tom's open mouth. But to Tom's dismay, Jerry ushers the toy mouse into the hotel first, which causes Tom to eat it and breaking it (shattering his teeth in the process). After hiccuping twice (which triggers the swallowed toy's voicebox), Tom looks at his decrepit teeth in a mirror. This infuriates the cat as he shatters the mirror and angrily rips off and destroys the book.\nTom goes insane and gets revenge by attempting to blow away Jerry with dozens of explosives (TNT, gunpowder, dynamite and a massive block buster that resembles the atom bomb Fat Man). When Tom ignites a piece of dynamite cautiously, it doesn't start the fuse enough, so he blows the fuse too hard. This causes the fuse to be fired immediately, and explosives erupt, killing Tom. Nothing at all remains of the house except Jerry (who remains unharmed after the explosion) and the part of his mousehole, while a fed-up Tom, this time with a spirit form, is seen on a cloud floating to heaven with a harp and a halo, all the while, repeatedly hiccuping \"come up and see me some time\" ad infinitum."}