{"mid": "Movie43", "IMDB_id": "tt1333125", "title": "Movie 43", "plot": "Movie 43 is a series of different sketches containing different scenes and scenarios.\n=== The Pitch ===\nProduced and directed by Peter Farrelly and written by Rocky Russo, Jeremy Sosenko, and Ricky Blitt\nThe film is composed of multiple comedy shorts presented through an overarching segment titled \"The Pitch\", in which Charlie Wessler (Dennis Quaid), a mad screenwriter, is attempting to pitch a script to film executive Griffin Schraeder (Greg Kinnear). After revealing several of the stories in his script, Wessler becomes agitated when Schraeder dismisses his outrageous ideas, and he pulls a gun on him and forces him to listen to multiple other stories before making Schraeder consult his manager, Bob Mone (Common), to purchase the film. When they do so, Mone's condescending, humiliating attitude toward Schraeder angers him to the point that, after agreeing to make the film \"the biggest film since Howard the Duck\", he confronts Mone in the parking lot with a gun and tries to make him perform fellatio on the security guard (Will Sasso) (Wessler had gotten on the lot by doing the same thing) and kill him if he does not make the film. Wessler tries to calm Schraeder down with more story ideas to no avail, but Mone pulls out a gun and shoots Schraeder to death. The segment ends with it being revealed that it is being shot by a camera crew as part of the movie, leading into the final segments.\nCast\nDennis Quaid as Charlie Wessler\nGreg Kinnear as Griffin Schraeder\nCommon as Bob Mone\nCharlie Saxton as Jay\nWill Sasso as Jerry\nOdessa Rae as Danita\nSeth MacFarlane as himself\nMike Meldman as himself\n=== Alternative version (The Thread) ===\nDirected by Steven Brill and written by Rocky Russo and Jeremy Sosenko\nThe structure of the film released in some countries, like the United Kingdom and the Netherlands, differs. Instead of a pitch, the films are connected by a group of three teenagers searching for the most banned film in the world, Movie 43, which will ultimately lead to the destruction of civilization. Calvin Cutler (Mark L. Young) and his friend J.J. (Adam Cagley) make a video in the style of MTV's Jackass and upload it on YouTube where it instantly reaches over 1,000,000 views. This turns out to be an April Fool's prank from Calvin's younger brother Baxter (Devin Eash), who cloned YouTube and hyper-inflated the views while working on his science project. Calvin and J.J. attempt to get revenge. They tell Baxter of a film that's so dangerous it will cause the annihilation of the world. The movie is known as Movie 43. While J.J. and Baxter look for Movie 43 on Google, Calvin retrieves Baxter's laptop and loads it with viruses from porn sites, and masturbates to a strip tease video on the porn sites in a bathroom. Baxter finds hundreds of results for Movie 43 on a website referred to by him as a dark corner of the Internet. They find the sketches starting from the 43rd search on the list of results. As he and J.J. keep watching videos, they are interrupted by a man known as Vrankovich (Fisher Stevens) and a group of Chinese mobsters (Tim Chou and James Hsu) who are tempted to find Movie 43, even going as far as to take J.J.'s classmate Stevie Schraeder (Nate Hartley), film executive Griffin Schraeder's oldest son, hostage. Vrankovich warns them that if they find Movie 43, civilization will be left to ruins. They ignore his claims and keep searching. They eventually find the real, the one and only Movie 43, which turns out to involve Baxter as a profane commando who leads a group of recruits to survive after the world has ended. As Calvin finishes ruining Baxter's laptop, their mother (Beth Littleford) enters, wearing the same shirt and shorts that the woman in the strip tease video wore, causing Calvin to flip out after realizing that he had masturbated to a video of his mother. He also has visions, and finds semen from his erect crotch on his hand causing him to stare at his hand in shock and horror. Afterward, a deadly earthquake rumbles and mankind is lost. However, a few years later the only survivor, a crippled Calvin, finds Baxter's laptop still working despite viral infections. He watches the last remaining skits on the laptop. This version of the film was released in the U.S. as part of the Blu-ray Disc of Movie 43 as an unrated alternate cut of the film.\nCast\nMark L. Young as Calvin Cutler\nAdam Cagley as J.J.\nDevin Eash as Baxter Cutler\nFisher Stevens as Vrankovich/Minotaur\nTim Chou as Chinese Gangster #1\nJames Hsu as Chinese Gangster #2\nNate Hartley as Stevie Schraeder\nLiz Carey as Sitara\nBeth Littleford as Mrs. Cutler\n=== Segments ===\n==== The Catch ====\nProduced and directed by Peter Farrelly and written by Bill O'Malley and Rocky Russo & Jeremy Sosenko\nBeth (Kate Winslet) is a single businesswoman who goes on a blind date with Davis (Hugh Jackman), the city's most eligible bachelor. When the two arrive together at a restaurant, Beth is shocked when he removes his scarf, revealing a pair of testicles dangling from his neck. Over dinner it confuses her that Davis fails to acknowledge his anatomical abnormality, and that nobody seems to be surprised by it. When two friends of Davis (Roy Jenkins and Katie Finneran) come by, one of them convinces him to give Beth a kiss. Davis agrees, but when he kisses her, his neck-testicles are dangling near Beth's mouth, causing her to scream and budge out of the kiss.\nCast\nHugh Jackman as Davis\nKate Winslet as Beth\nRoy Jenkins as Ray\nRocky Russo as Waiter Jake\nAnna Madigan as Abby\nJulie Claire as Pam\nKatie Finneran as Angie\n==== Homeschooled ====\nDirected by Will Graham and written by Will Graham & Jack Kukoda\nHaving recently moved, Sean (Alex Cranmer) and Clare (Julie Ann Emery) have coffee with their new neighbors. The neighbors, Robert (Liev Schreiber) and Samantha (Naomi Watts) have a teenage son, Kevin (Jeremy Allen White), whom they have home-schooled. Sean and Clare begin inquiring about the homeschooling, and the numerous manners in which Robert and Samantha have replicated a high school environment within their home, going as far as hazing, bullying, and giving out detentions, are revealed. They also throw high school parties and Samantha instigates Kevin's \"first kiss\" with him. Visibly disturbed, the neighbors end up meeting Kevin, who says he is going out and gives them the impression that all is fine: until he reveals a doll made of a mop with Samantha's face on it, referring to the doll as his girlfriend.\nCast\nJeremy Allen White as Kevin Miller\nLiev Schreiber as Robert Miller\nNaomi Watts as Samantha Miller\nAlex Cranmer as Sean\nJulie Ann Emery as Clare\n==== The Proposition ====\nDirected by Steve Carr and written by Rocky Russo & Jeremy Sosenko\nJulie (Anna Faris) and Doug (Chris Pratt) have been in a relationship for a year. When he attempts to propose to her, she reveals to him that she is a coprophiliac, and asks him to defecate on her in the bedroom. Urged by his best friend Larry (J.B. Smoove) and others to go along with it, he eats a large meal and drinks a bottle of laxative prior to the event. Wanting foreplay, Julie is angered when Doug wants to finish, and she runs into the street. Chasing after her, he is then hit by a car and graphically evacuates his bowels everywhere. She cradles him and apologizes; covered and surrounded by his excrement on the road, she exclaims that it is the \"most beautiful thing\" she has ever seen and accepts his marriage proposal. (In the end credits, Julie and Doug are mistakenly renamed Vanessa and Jason by Rocky Russo, Jeremy Sosenko, Steve Carr, Peter Farrelly, and Charles B. Wessler).\nCast\nAnna Faris as Julie (aka Vanessa)\nChris Pratt as Doug (aka Jason)\nJ. B. Smoove as Larry\nJarrad Paul as Bill\nMaria Arcé as Christine\nAaron LaPlante as Friend\n==== Veronica ====\nDirected by Griffin Dunne and written by Matthew Alec Portenoy\nNeil (Kieran Culkin) is working a night shift at a local grocery store. His ex-girlfriend, Veronica (Emma Stone), comes through his line and the two begin arguing, which soon turns into sexual discussion and flirtation as they lament over their relationship; unbeknownst to them, Neil's intercom microphone broadcasts the entire explicit conversation throughout the store, where various elderly people and vagrants tune in. After she leaves in tears, the customers agree to cover his shift while he goes after her.\nCast\nKieran Culkin as Neil\nEmma Stone as Veronica\nArthur French as Old man\nBrooke Davis as Tall lady\nJosh Shuman as Short man\n==== iBabe ====\nDirected by Steven Brill and written by Claes Kjellstrom & Jonas Wittenmark & Tobias Carlson and Rocky Russo & Jeremy Sosenko\nA developing company is having a meeting in their headquarters over their newly released product, the \"iBabe\", which is a life-sized, realistic replica of a nude woman which functions as an MP3 player. The boss (Richard Gere) listens to his various workers (Kate Bosworth, Aasif Mandvi and Jack McBrayer) argue over the placement of a fan that was built into the genital region of the iBabe, which is dismembering the penises of teenage boys who attempt to have sex with them. The board members then agree to strongly emphasize the dangers of the product via its new commercials.\nCast\nRichard Gere as Boss\nKate Bosworth as Arlene\nJack McBrayer as Brian\nAasif Mandvi as Robert\nDarby Lynn Totten as Woman\nMarc Ambrose as Chappy\nCathy Cliften as iBabe #1\nCherina Monteniques Scott as iBabe #2\nZach Lasry as Boy\n==== Superhero Speed Dating ====\nCo-edited and directed by James Duffy and written by Will Carlough\nRobin (Justin Long) and his cohort Batman (Jason Sudeikis) are in Gotham City at a speed dating establishment seeking out a bomb threat by their nemesis, Penguin (John Hodgman). While Robin attempts to connect with various women through speed dating including Lois Lane (Uma Thurman) and Supergirl (Kristen Bell), Batman encounters his ex Wonder Woman (Leslie Bibb) and attempts to stop Penguin from detonating Supergirl, who later turns out to be the Riddler (Will Carlough) in disguise, which Batman already knew and was screwing with Robin, who kissed \"her\" moments before unveiling.\nCast\nJustin Long as Robin\nJason Sudeikis as Batman\nUma Thurman as Lois Lane\nBobby Cannavale as Superman\nKristen Bell as Supergirl\nJohn Hodgman as The Penguin\nLeslie Bibb as Wonder Woman\nWill Carlough as Riddler\nKatrina Bowden as Stacey\n==== Machine Kids ====\nWritten, co-edited, and directed by Jonathan van Tulleken\nA faux-Public service announcement about children stuck in machines and how adults' criticism of these particular machines affect the feelings of the children stuck inside the machines. This commercial was paid for by the \"Society for the Prevention of Cruelty to Children Inside Machines\".\n==== Middleschool Date ====\nDirected by Elizabeth Banks and written by Elizabeth Wright Shapiro\nNathan (Jimmy Bennett) and Amanda (Chloë Grace Moretz) are watching television after school at Nathan's house as their first \"middle school\" date. When they begin to kiss, his older brother Mikey (Christopher Mintz-Plasse) enters the living room and makes fun of them. Amanda then discovers she is menstruating and tries to hide it, and when Nathan sees blood on her pants, he panics and believes her to be bleeding to death, causing a debacle, which would later have Nathan and Mikey's father Steve (Patrick Warburton) and Amanda's father (Matt Walsh) involved. Amanda calls them out on their stupidity and feels embarrassed to know that she's getting her first period in front of them and they don't know what to do about it. When she leaves with her father, Nathan yells that the process of keeping the lining of her internal organs intact by inserting his erect phallus into her vagina is much too complicated and Mikey agrees. Steve cheers them up by farting in front of them. As Mikey goes to the bathroom, Nathan and Steve watch a game on television, which has a very graphic Tampax commercial in which a girl gets eaten by a shark due to her menstruating.\nCast\nChristopher Mintz-Plasse as Mikey\nChloë Grace Moretz as Amanda\nJimmy Bennett as Nathan\nPatrick Warburton as Steve (Nathan and Mikey's father)\nMatt Walsh as Amanda's father\n==== Tampax ====\nDirected by Patrik Forsberg and written by Patrik Forsberg & Olle Sarri\nAnother faux-commercial involving two women who go swimming in the sea. As the women submerge into the water, a great shark suddenly appears and eats one of the women. A tagline appears, reading: \"Tampax. Now Leak-Proof\"\n==== Happy Birthday ====\nDirected by Brett Ratner and written by Jacob Fleisher\nPete (Johnny Knoxville) captures a leprechaun (Gerard Butler) for his roommate Brian (Seann William Scott) as a birthday present. After tying the leprechaun up in the basement, they demand he give them a pot of gold. The obscene leprechaun threatens that his brother is coming to save him. When he arrives, Brian and Pete are shot at but ultimately kill both leprechauns. At the end of the segment, Pete reveals he has also caught a fairy (Esti Ginzburg) who performs fellatio for gold coins.\nCast\nGerard Butler as Leprechaun #1, Leprechaun #2\nJohnny Knoxville as Pete\nSeann William Scott as Brian\nEsti Ginzburg as Storybook fairy\n==== Truth or Dare ====\nProduced and directed by Peter Farrelly and written by Greg Pritikin\nDonald (Stephen Merchant) and Emily (Halle Berry) are on a date together at a Mexican restaurant. Tired of typical first dates, Emily challenges Donald to a game of truth or dare. She dares him to grab a man’s buttocks, and he follows with daring her to blow out the birthday candles on a blind boy’s cake. The game rapidly escalates to extremes, in which both of them get plastic surgery and tattoos, and humiliate themselves. When Donald and Emily arrive back at Emily's apartment, they praise their date. Donald tries to kiss her, but she rejects him, claiming she's not attracted to Asian men (which he was surgically altered to resemble). It is revealed that she was joking and invites him to have sex with her as she shows him her enlarged breasts.\nCast\nHalle Berry as Emily\nStephen Merchant as Donald\nSayed Badreya as Large man\nSnooki as Herself\nCaryl West as Waitress\nRicki Noel Lander as Nurse Elizabeth\nPaloma Felisberto as Bachelorette party girl\nJasper Grey as Patron\nBenny Harris as Blanco the bartender\nZen Gesner as Stripper\n==== Victory’s Glory ====\nDirected by Rusty Cundieff and written by Rocky Russo & Jeremy Sosenko\nSet in 1959, Coach Jackson (Terrence Howard) is lecturing his all-black basketball team before their first game against an all-white team. Worried about losing the game, the timid players are lectured by the coach about their superiority in the sport over their white counterparts, which he expresses vulgarly. When the game ensues, the all-white team loses miserably yet rejoices in a single point they earn.\nCast\nTerrence Howard as Coach Jackson\nAaron Jennings as Anthony\nCorey Brewer as Wallace\nJared Dudley as Moses\nLarry Sanders as Bishop\nJay Ellis as Lucious\nBrian Flaccus as White guy #1\nBrett Davern as White guy #2\nEvan Dumouchel as White guy #3\nSean Rosales as White guy #4\nLogan Holladay as White guy #5\nMandy Kowalski as Cheerleader\nEric Stuart as Narrator\n==== Beezel ====\nWritten and directed by James Gunn\nPlayed mid-credits, Amy (Elizabeth Banks) worries that her boyfriend Anson’s (Josh Duhamel) cat, Beezel (an animated cartoon), is coming between their relationship. Beezel seems to detest Amy and anyone who comes between him and Anson, but Anson only sees Beezel as innocent. One day, Amy witnesses Beezel masturbating to summer vacation photos of Anson in a swimsuit. Beezel attacks her and violently urinates on her. Anson still finds his pet innocent but Amy threatens to leave if he doesn't get rid of Beezel. Caring more about his relationship, Anson agrees to find a new home for him. That night, from a closet, Beezel tearfully watches the couple make love (whilst sodomizing himself with a hairbrush and dry humping a stuffed teddy bear). The next day when it comes time to take Beezel away, he is nowhere to be found. Amy goes outside to look. Beezel then runs her over with a truck and attempts to shoot her to death with a shotgun, but she chases him into the street and begins beating him with a shovel, which is witnessed by a group of children attending a birthday party at a neighboring house. When Anson approaches to see what is happening, Amy tries to explain Beezel’s motives. Beezel acts innocent and Anson sides with his cat. The children of the party then attack and murder Amy for beating up Beezel, stabbing her with plastic forks. Anson grabs Beezel, as Beezel again fantasizes about French kissing his owner.\nCast\nElizabeth Banks as Amy\nJosh Duhamel as Anson\nEmily Alyn Lind as Birthday girl\nMichelle Gunn as Mommy\nChristina Linhardt as Party clown\n==== Find Our Daughter ====\nWritten and directed by Bob Odenkirk\nIn this segment that was cut from the film, Maude (Julianne Moore) and George (Tony Shalhoub) are looking for their breast-flashing daughter Susie (Jordanna Taylor) with the help of the private eye (Bob Odenkirk), who is behind the camera with only one clue which is a small video that features their daughter. The scene was included as an extra on the DVD and Blu-ray release.\nCast\nJulianne Moore as Maude\nTony Shalhoub as George\nJordanna Taylor as Susie\nBob Odenkirk as Private Investigator\n==== The Apprentice ====\nWritten and directed by Steve Baker and Damon Escott\nThe second segment that was cut from the film follows Wayne (Anton Yelchin), a shy apprentice mortician who is secretly a necrophiliac at the hospital he works at. One night, a body he's having sex with is brought back to life from the pressure of his thrusts. His supervisor Bob (Shane Jacobson) suddenly walks in and mistakenly believes that Wayne has performed a life-saving operation of some kind. The staff at the hospital and the media congratulate him while a news reporter asks what he did to save her. Unable to conjure an answer, one of the cops on scene tells everyone else they can just watch the security tapes to find out. As they rush to the security room, Wayne is given a personal thanks by the girl (Maria Volk) he revived, upon which he responds with an awkward \"Your Welcome\". Unlike Find Our Daughter, this segment was not included in the DVD or Blu-ray release and instead premiered at the 2014 LA Comedy Festival.\nCast\nAnton Yelchin as Wayne\nShane Jacobson as Bob\nMaria Volk as Girl\nChristopher Kirby as Cop"}