{"mid": "MrBugGoesToTown", "IMDB_id": "tt0033727", "title": "Mr. Bug Goes to Town", "plot": "Hoppity the Grasshopper, after a period spent away, returns to an American city (Manhattan, New York). He finds that all is not as he left it, and his insect friends (who live in the \"Lowlands\" just outside of the garden of a cute bungalow belonging to down-on-his-luck songwriter Dick Dickens and his wife Mary) are now under threat from the \"human ones,\" who are trampling through the broken-down fence, using it as a shortcut.\nInsect houses are being flattened and burned by cast away cigar butts. Old Mr Bumble and his beautiful daughter Honey (Hoppity's sweetheart) are in grave danger of losing their Honey Shop to this threat. To compound their problems, devious insect \"property magnate\" C. Bagley Beetle has romantic designs on Honey Bee himself, and, with the help of his henchmen Swat the Fly and Smack the Mosquito, Honey is tricked into marrying the Beetle for the good of the insect community.\nHoppity discovers that the Songwriter and his wife are waiting for a \"check thing\" from the Famous Music publishing company for the songwriter's composition, \"We're the Couple in the Castle.\" But C. Bagley Beetle and his henchmen \"steal\" the check. Hoppity threatens to expose C. Bagley Beetle's nefarious scheme, but Beetle and his henchmen seal Hoppity inside the envelope and hide it in a crack in a wall.\nAs the wedding is going on Smack and Swat discover that a construction company is going to be erecting a skyscraper on the property of the former home of the Songwriter (now foreclosed by the property owners because of the \"lost\" check), and therefore also on C. Bagley Beetle's property where the Lowlanders moved in thanks to Beetle's \"generosity.\"\nAs Swat and Smack try unsuccessfully to get Beetle out of danger at the wedding, a weight from a surveyor's level rips through the chapel causes the bugs to flee in terror back to the Lowlands (not realizing the whole parcel is endangered by the construction crew).\nDuring the chaos C. Bagley Beetle and his henchmen try to kidnap Honey. Meanwhile, Hoppity escapes when the construction crew demolishes the wall, freeing the envelope. Hoppity comes to Honey's rescue, battles Beetle and his henchmen, and wins.\nHoppity tells the citizens all about C. Bagley Beetle's finding the check and hiding it, but Hoppity's story doesn't actually change anything; they are still in danger and are angry at Hoppity. He leaves, dejectedly, but then overhears the Songwriter and his wife (watching the demolition of their old property wistfully) talking about wishing that the publishers had bought his song and reflecting on their now-dashed dreams and how they would have built a penthouse on top of the new skyscraper.\nHoppity drags the letter containing the check to give it to the Songwriter, but pauses with the envelope under a mailbox.Someone picks up the letter and Hoppity realizes, to his relief, that it is the mailman who is collecting the mail from the box.\nWhile the building is being built, the check finally arrives in the hands of the Songwriter and \"We're the Couple in the Castle\" becomes a massive hit. Meanwhile, Hoppity leads an exodus from the Lowlands to the top of the skyscraper, where he is sure the Songwriter has built a home and invited the bugs to live there. They get to the top, which at first appears to be barren. The bugs are angry, and Hoppity is mocked by Mr Creeper until Buzz, Ambrose, and little Murgatroyd look a little farther over a wall and call the others over to see the new penthouse and its \"Garden of Paradise\" that Hoppity had been describing. Honey and the rest of the Lowlanders live there happily ever after in their new home. And as Ambrose looks over the edge, he remarks, \"Look at all the human ones down there. They look just like a lot of little bugs!\""}