{"mid": "MrHolmes", "IMDB_id": "tt3168230", "title": "Mr. Holmes", "plot": "In 1947, the long-retired Sherlock Holmes, aged 93, lives in a remote Sussex farmhouse with his widowed housekeeper Mrs Munro and her young son Roger. Having just returned from a trip to Hiroshima, he starts to use jelly made from the prickly ash plant he acquired there to try to improve his failing memory. Unhappy about his Watson's fictionalisation of his last case, The Adventure of the Dove Grey Glove, he hopes to write his own account, but has trouble recalling the events. As Holmes spends time with Roger, showing him how to take care of the bees in the farmhouse's apiary, he comes to appreciate Roger's curiosity and intelligence and develops a paternal liking for him.\nOver time, Roger's prodding helps Holmes remember the case (shown in flashbacks); he knows he must have failed somehow, as it resulted in his retirement from the detective business. About 30 years earlier, after the First World War had ended and Watson had married and left Baker Street, Thomas Kelmot approached Holmes to find out why his wife Ann had become estranged from him after suffering two miscarriages. Holmes followed Ann around London and observed her seemingly preparing to murder her husband - forging cheques in her husband's name and cashing them, confirming the details of his will, buying poison, paying a man, and checking train schedules. Holmes, however, deduced her true intentions: to have gravestones made for herself and her miscarried children (the man she paid was a stonemason) and then commit suicide with the poison. Confronting her, he confessed he had the same feelings of loneliness and isolation, but his intellectual pursuits sufficed for him. Ann asked Holmes if they could share the burden of their loneliness together. Holmes was tempted, but instead advised her to return to her husband. She poured the poison on the ground, thanked Holmes, and departed. Holmes later learned that she killed herself by stepping in front of an oncoming train. Blaming himself, he retires and falls into a deep depression. Watson briefly returns to care for him and, discovering the details of the case, rewrites the tragedy into a success.\nA second series of flashbacks recounts Holmes's trip to Japan, where he met a supposed admirer named Tamiki Umezaki who had told him of the benefits of prickly ash. In fact, Umezaki had a hidden motive for meeting Holmes. Years before, Umezaki's anglophile father had traveled to England. In a letter, the father wrote that he had been advised by the brilliant Holmes to remain in England permanently, abandoning his wife and son. Holmes bluntly told Umezaki that his father simply wanted a new life for himself and that Holmes had never met him. Umezaki was crushed.\nIn the present, Mrs Munro gradually becomes dissatisfied with her work, and Holmes's overall health deteriorates and he spends more time with her son. After he becomes unconscious from an experiment with the prickly ash, he requires more physical care. She accepts a job at a hotel in Portsmouth, planning to take Roger to work there as well. Roger does not want to go. He is unhappy with his barely literate mother and his family's working-class status, and tension develops between mother and son.\nHolmes and Mrs Munro later discover Roger lying unconscious near the house, a victim of multiple stings, and he is rushed to a hospital. Distraught, Mrs Munro tries to burn down the apiary, blaming Holmes for caring only about himself and his bees. Holmes stops her, having realised that Roger had been stung by wasps; Roger found their nest and tried to drown them to protect the bees, but they swarmed on him instead. Holmes and Mrs Munro burn down the wasp nest together, and Roger regains consciousness. Holmes tells Mrs Munro that she and Roger will inherit the house and grounds after his death, encouraging her to stay.\nHolmes writes his first work of fiction: a letter to Umezaki, telling him that his father was a brave, honourable man who worked secretly and effectively for the British Empire. As Roger begins to teach his mother how to care for the bees, Holmes emulates a tradition he saw being practiced in Hiroshima: creating a ring of stones to serve as a place where he can recall the loved ones he has lost over the years."}