{"mid": "MrPoppersPenguins", "IMDB_id": "tt1396218", "title": "Mr. Popper's Penguins", "plot": "Mr. Popper is a house painter of modest means, living with his wife and two children (Bill and Janie) in the small town of Stillwater, Oklahoma. He has a happy life, but he is also a restless dreamer, spending his time reading of famous explorers in faraway places.\nOne day, the Popper family tunes in to a radio broadcast by an Admiral exploring polar regions. Mr. Popper had previously sent the Admiral fan mail, and the Admiral promises Mr. Popper a surprise. The surprise turns out to be a penguin, which comes in a large box. Mr. Popper names the penguin \"Captain Cook\" after the famous James Cook. Mr. Popper cleans out the icebox so that the penguin can sleep inside. As time goes by, the Poppers find that Captain Cook is growing large, but his health is failing. Mr. Popper writes to the curator of a large aquarium, asking for help. The curator replies that the aquarium has a female penguin, Greta, who unfortunately is also experiencing the same symptoms, and he suggests that perhaps the penguins are simply lonely. Soon after, the Poppers receive their second penguin in the mail.\nThe pair of penguins are revitalized by each other's presence. As both birds cannot fit into the icebox together, Mr. Popper opens the window to let in the cold winter air, creating a snow-covered habitat. As this solution will not work in springtime, Mr. Popper has the main things moved upstairs and a freezing plant installed in the basement for the birds. This makes for happy penguins, but strains the family budget.\nAs time passes, Greta lays eggs. She continues laying a new egg every three days until the total reaches ten. As penguins do not normally lay so many eggs, Mr. Popper attributes this to the change in climate the birds have experienced. When the eggs hatch, the Popper family now has twelve penguins to feed, and the contractor is looking for payment on the household changes.\nMr. Popper decides to raise money by training the twelve penguins and turning them into a circus act. The act debuts at the local theater, and soon the \"Popper's Performing Penguins\" are featured throughout the country. But in the theater in New York City, the penguins cause trouble; what's worse, they've accidentally shown up at the wrong theater. The manager of the wrong theater is extremely angry and has Mr. Popper arrested, along with the penguins.\nAdmiral Drake, having arrived to see Popper's Performing Penguins for himself, posts bail for Mr. Popper. After speaking with the Admiral, Mr. Popper decides that show business is no life for a penguin. Drake lets all of the twelve penguins go with him on his expedition to the North Pole, where they will be released experimentally into the Arctic. The Poppers are sad to see the penguins go, especially Mr. Popper himself — that is, until Admiral Drake invites Mr. Popper to accompany him on the trip. The Poppers wave goodbye as Mr. Popper and his penguins sail away towards the North Pole and Mr. Popper promises to be back in a year or two."}