{"mid": "MrsDoubtfire", "IMDB_id": "tt0107614", "title": "Mrs. Doubtfire", "plot": "Daniel Hillard (Robin Williams) is a cartoon voice actor in San Francisco who quits his job at a local TV studio after a dispute with the director. As a father, Daniel is extremely passionate about his 3 children: 14-year-old Lydia, 12-year-old Chris, and 5-year-old Natalie. However his wife, Miranda (Sally Field), is frustrated with his lack of discipline. With Miranda still at work, Daniel hires a mobile petting zoo and throws a wild block party for Chris' 12th birthday, despite Chris being grounded for a bad report card. The party creates a major disturbance in the neighborhood. Miranda arrives, having been notified of the incident by a neighbor, and is furious with Daniel for planning and throwing the party behind her back. The couple have a heated argument which leads to a divorce. At their first custody hearing, the judge acknowledges that Daniel is a devoted father, but is currently unemployed with no place to live, so Miranda receives full custody of the children. Daniel's visitation rights are limited to Saturdays; however, the judge tells him that if he can find a steady job and residence within three months, he will consider a joint-custody arrangement.\nWith the help of a court liaison, Daniel gets a menial job at his old TV station. When Miranda seeks a housekeeper/nanny to spend time with the children, Daniel uses his voice-acting skills to \"respond\", having changed the phone number on Miranda's wanted ad. He calls several times pretending to be undesirable candidates before calling as an elderly Scottish-accented widow, referring to himself as Mrs. Euphegenia Doubtfire and presenting strong credentials. Miranda is impressed and asks Mrs. Doubtfire to come for an interview. Daniel enlists his brother Frank, a makeup artist, and his partner Jack to transform him into a 60-year-old woman.\nMiranda hires Mrs. Doubtfire on the spot. The children initially struggle adjusting to their new nanny, but soon come around and thrive, while Miranda is able to become closer with them. Daniel learns several household and parenting skills as part of the role. One day, Chris accidentally walks in on him in the bathroom and sees what appears to be Mrs. Doubtfire standing to urinate. Alarmed, Chris reveals what he saw to Lydia and they panic until Daniel reveals the truth, telling them the only reason for the Mrs. Doubtfire persona is to spend more time with them. They are happy to have their father back, but Daniel warns them to make sure Miranda does not find out, and also not to tell Natalie, who is too young to understand.\nSoon, Miranda becomes reacquainted with an ex-boyfriend, Stuart \"Stu\" Dunmeyer (Pierce Brosnan). As Miranda and Stu become closer, Daniel begins to resent Stu, especially after Stu calls Daniel a \"loser\". While working at the station, Daniel is seen by CEO Jonathan Lundy playing with toy dinosaurs on the set of a children's show. Impressed, Lundy invites Daniel to dinner to hear more of his ideas. Meanwhile, Stu invites the family, including Mrs. Doubtfire, out for Miranda's birthday at the same place, date, and time as the dinner with Lundy. Unable to reschedule and unwilling to let the family down, Daniel attempts to rotate back and forth between the two commitments, alternately changing his persona back and forth between himself and Mrs. Doubtfire.\nAfter many drinks at both tables, Daniel becomes intoxicated; puts cayenne pepper, which Stu is allergic to, on his entree; and returns to Lundy's table still dressed as Mrs Doubtfire. He covers by introducing Mrs. Doubtfire as the host for a new children's show, impressing Lundy. At that moment, Daniel notices Stu choking on his dinner, has a change of heart, rushes over, and administers the Heimlich maneuver. Daniel is able to resuscitate Stu, but the top of his mask comes off, revealing his true identity, to Miranda's horror.\nAt their next custody hearing, Daniel explains that he has a suitable job and home, and gives a heartfelt explanation for his behavior. The judge is touched by Daniel's explanation, but disturbed by his actions, and grants Miranda full custody, with Daniel limited to supervised visitation every Saturday, much to his dismay. Without Mrs. Doubtfire, Miranda and her children become depressed, recognizing how much Mrs. Doubtfire improved their lives. They are surprised when the local station starts airing a new children's show, \"Euphegenia's House\" hosted by Daniel as Mrs. Doubtfire. The show becomes a hit and is syndicated across the country.\nMiranda visits Daniel on set and admits that everything he did as Mrs. Doubtfire was enough to convince her that the children need to have their father back in the picture. Soon after, a joint custody agreement is reached, allowing Daniel to see the children every day after school. As Daniel takes the children out, Miranda watches an episode in which Mrs. Doubtfire answers a letter from a young girl whose parents have separated, saying that no matter what arrangements families have, love will prevail."}