{"mid": "MrsWinterbourne", "IMDB_id": "tt0117104", "title": "Mrs. Winterbourne", "plot": "In flashbacks, Connie Doyle's (Ricki Lake) early life gives an idea of her mindset. At 18, she meets womanizer Steve DeCunzo (Loren Dean), moves in with him and winds up pregnant. He kicks her out, denying responsibility. A destitute Connie, trying to find a shelter, gets inadvertently swept aboard a train at Grand Central Terminal. With no ticket and no money, Connie is rescued by Hugh Winterbourne (Brendan Fraser) and taken to his private compartment. She meets his wife, Patricia, who is also pregnant. When the train crashes, Connie is mistaken for Patricia because she is wearing Patricia's wedding band, which has the couple's names engraved on the inside. In the hospital, no longer pregnant, she learns Patricia and Hugh both died in the crash.\nSeeing the wrong name on the wristband on a child, Connie thinks the hospital has messed up until she sees the wedding band still on her finger. She tries to explain but is prevented from doing so by nurses, who believe she is just hysterical. She meets Hugh's mother, Grace (Shirley MacLaine), who has a bad heart. With nowhere else to go, Connie believes it is best for her and her baby to accept the offer to go to Grace's home. Connie there meets Bill (also played by Fraser), Hugh's identical twin brother. When the initial shock wears off, she nervously begins her new life. This world is very different, and she finds it difficult to adjust.\nBill, a bit wary of Connie, questions her identity, believing she is after the family's money. He investigates, learning her real identity. They walk around Boston and begin to bond. Bill prepares to expose Connie when he learns that Grace plans to change her will to include Connie and baby Hughie. He changes his mind when Connie becomes upset and begs Grace not to include her and Hughie in the will. Connie's protests make Grace want to include them even more. A drunk Paco, the family's chauffeur, demands that Bill and Connie dance a tango. They do so and end up sharing several kisses.\nConnie bonds with Grace. Feeling guilty for taking advantage of Grace's kindness, she decides to leave with Hughie. Bill attempts to convince her to stay, proposing to her. He tells her think about it overnight. Connie decides to run away anyway. Paco follows her to the train station, tells her about his own shady past, and makes her realize she and the baby are just as valuable to Grace as Grace is to them.\nConnie returns home to find Grace has had a heart attack because of her absence. She decides to let things go and marry Bill as Patricia Winterbourne. Steve discovers Connie's good fortune and tries to blackmail her. In the confusion that ensues, Steve is shot. Bill and Connie flee the scene, and think each one is the one who shot Steve. It is then that Bill reveals that he knows Connie's true identity, and that he loves her anyway. Both believe they are home free, until their wedding day. When the priest tells Bill and Connie that Grace is confessing to the murder, both of them hurry to her side and confess to the murder themselves.\nShocked, the police tell them they already have the murderer in custody, and it is not any of them, it was the woman Steve started seeing after dumping Connie. Like Connie, Steve had gotten her pregnant and abandoned her. The police only came to question about the check Connie had written out to Steve. Connie confesses the whole story to Grace, who says she'll get over it, adding that she'd like more grandchildren. The wedding goes ahead as planned, and Bill presents Connie with a wedding ring with their names engraved on the inside, just like the real Patricia's ring."}