{"mid": "MulhollandFalls", "IMDB_id": "tt0117107", "title": "Mulholland Falls", "plot": "In the early 1950s, a four-man squad of unorthodox Los Angeles Police Department detectives begins throwing its weight around by tossing Jack Flynn, an organized crime figure from Chicago, off a cliff on Mulholland Drive, nicknamed \"Mulholland Falls\" for all the men they have thrown off it.\nDetective Lieutenant Maxwell Hoover and his partners Coolidge, Hall, and Relyea are called to investigate a suspicious death of a young woman found at a construction site. The evidence shows that every bone in her body is broken. A coroner deduces that she looks like she \"jumped off a cliff,\" although there are no cliffs nearby. The woman turns out to be someone Hoover knew very well, Allison Pond.\nThe detectives receive a film of Allison having sex in a motel room, taken by a secretly hidden camera behind a two-way mirror. Allison's gay friend Jimmy Fields admits to making this film and more, including one with Hoover in it. Fields is murdered while being guarded by Hall and Relyea.\nRadioactive glass is found in Allison's foot, which leads the detectives to the Nevada Test Site, where they illegally break in and investigate. Colonel Fitzgerald threatens to lock up the police officers, warning them that they have no authority here. The man in the film with Allison proves to be the civilian commander of the secret base, retired General Thomas Timms, now head of the Atomic Energy Commission, who admits the affair to Hoover but has an alibi for the day of her death.\nMax's marriage to Kate is jeopardized by someone desperate to retrieve the film. An FBI agent fails to persuade the LAPD's Chief to drop the case, so Lt. Hoover's house is ransacked by FBI men with a search warrant, but no film is found. Hoover brutally assaults the FBI agent, after which a film is delivered to Kate showing her husband and Allison having sex in the motel.\nThe blackmailer turns out to be Colonel Fitzgerald, who demands the film of Timms with Allison be brought to him. Hoover realizes that Jimmy Fields' film footage of Allison also includes images of \"atomic soldiers\" used as guinea pigs for A-bomb tests, now dying in a secret hospital ward on Timms' military base. Hoover and partner Ellery Coolidge fly to the base, where Max brings the film to Timms, who is terminally ill with cancer himself.\nFor their return trip to Los Angeles, Max and Coolidge board a C-47 cargo plane, where they are joined by Colonel Fitzgerald and his aide. During the flight, Max realizes that Fitzgerald is going to kill them by throwing them off the airplane in mid-air, the same way that Allison Pond died. In a vicious struggle, the detectives fight for their lives. Coolidge charges the aide as gunshots go off. Coolidge and Max are able to throw the aide and Fitzgerald out of the plane, both falling to their death. The pilot is also accidentally shot but manages to crash land before he dies. Coolidge celebrates the landing until realizing that he, too, has been shot, also dying at the scene.\nMax cannot reconcile with his wife at Coolidge's funeral because she feels betrayed and heartbroken. At the cemetery, where he explains that his unit has been disbanded, she walks out on Max for good."}