{"mid": "MuppetClassicTheater", "IMDB_id": "tt0213096", "title": "Muppet Classic Theater", "plot": "It consists of six stories from the fairy tale tradition, all performed by the Muppet characters and narrated by Rizzo and Gonzo at the Muppet Theater:\n=== The Three Little Pigs ===\nPapa Pig tells his three children Andy, Randy, and Sandy (played by Miss Piggy) that it's time for them all to live on their own. Papa tells Andy and Randy that they are strong smart boys who can take care of themselves, but they need to look after their sister Sandy. While the two dumb brothers build flimsy homes of straw and sticks, Sandy constructs a state-of-the-art brick house. The Big Bad Wolf comes and blows down Andy and Randy's houses. The siblings turn to Sandy for shelter, and she only lets them stay if they promise to show her some respect. The Big Bad Wolf returned the next day demanding that Sandy lets him in and reminds the pigs that they are supposed to say \"Not By the Hair of My Chinny Chin Chin.\" Sandy opens up the door and karate chops the Big Bad Wolf when she accuses him of his claim that Sandy has facial hair. The Big Bad Wolf then starts to blow Sandy's house down which has no effect. Then the Big Bad Wolf disguises himself as the pizza delivery man only for Sandy to take the pizza. The Big Bad Wolf's latest plan involves dressing up as Santa Claus and going down the chimney. Andy and Randy almost fall for this until Sandy reminds them that it's the middle of summer. When Andy and Randy think that Santa Claus came early, Sandy ends up lighting a large firecracker in the chimney which launches the Big Bad Wolf into the sky.\n=== King Midas ===\nKing Midas (played by Kermit the Frog) spares the life of a Satyr (played by Gonzo the Great) that was sleeping in his garden after the Satyr offers to grant King Midas a wish. When King Midas wants world peace, Queen Midas (Played by Piggy) wanted money and they are granted the Golden Touch. King Midas then uses his talents to turn people's items into gold. When King Midas accidentally turns himself to gold upon reacting to his food being turned to gold, Queen Midas tries various attempts to get him back to normal. The Satyr tells Queen Midas that the effects of the Golden Touch can be undone if Queen Midas renounces her interest in gold. The Satyr then offers to give King Midas and Queen Midas another wish for free. While King Midas still wanted world peace, Queen Midas wanted a Slice-O-Matic in green. Rizzo the Rat narrated that King Midas, Queen Midas, and the Satyr used the Slice-O-Matic to throw fabulous dinner parties for everyone in the kingdom.\n=== The Boy Who Cried Wolf ===\nThe repeated overreactions of a young shepherd (played by Gonzo) cause the villagers and their mayor (played by Kermit) to doubt his word when he has made claims of sensing earthquakes and tsunamis. When the wolf shows up and challenges the shepherd to obtain help within 24 hours before he eats his sheep, the shepherd goes through every attempts to prove that the wolf is threatening the sheep. After all attempts have failed, the sheep state that the shepherd learned his lesson and protested to end the story before the wolf arrives. Rizzo the Rat narrates that the story is not over yet despite the protests of the sheep and that the wolf would return in one hour. One of the rams mentions to the shepherd and his fellow sheep about his cousin Norman and they come up with a plan. When the wolf arrives, the shepherd stated that the wolf was right about the drop in his credibility as his final quote to him is \"big sheep.\" The wolf ends up being surprised by the arrival of a large ram named Norman who ends up crushing the wolf. The wolf briefly gets up by quoting \"That's what you mean about really big sheep\" and ends up crushed again. The shepherd and the sheep then chant Norman's name. The mayor gives the shepherd a medal for \"not crying wolf except when an actual wolf was present\". The townspeople and the sheep rejoiced and lived happily ever after while the wolf is still trapped under Norman. When Rizzo asks the shepherd if he has learned his lesson, the shepherd states that he won't overreact again....until Rizzo states that they'll be taking an intermission with Rizzo having to explain to Gonzo what an intermission is (American Version). Gonzo and Rizzo signing off the viewers and it's time to polka (European Version).\n=== Rumpelstiltskin ===\nA sad and lonely King (played by Kermit) turns to his Loyal Royal Advisor to find him a fair young maiden to be his queen....someone who is special. The King also tells his Loyal Royal Advisor that he will be given his own castle if he succeeds. All the fairest maidens in the land were brought to the King's castle so that one of them can become queen. Wanting the attention of the King, a miller (played by Papa Pig) claims to the Loyal Royal Advisor that his daughter Piggy can spin straw into gold when he brings her to the King's Castle. Piggy is placed in a room full of straw where the Loyal Royal Advisor (who still wants to fulfill getting his own castle from the King) orders her to demonstrate her gift that her father claims that she has or she will be spending the rest of her life in the dungeon. She ends up receiving the assistance of Rumpelstiltskin (played by Gonzo) who spins the straw into gold upon Piggy giving him her necklace. The next morning, the Loyal Royal Advisor discovers the golden straw and states that he'll keep an eye on the gold that is present while Piggy spins the second batch of straw into gold. When Rumpelstiltskin returns that night and wants a fee to convert the straw into gold, she is forced by fate to give up her firstborn upon becoming queen in return for the desperately needed services of Rumpelstiltskin. The next morning, the King and the Loyal Royal Advisor came in and found the golden straw. The King married Piggy and the Loyal Royal Advisor got his own castle. When Queen Piggy finally had her child, Rumpelstiltskin came in and states that he will let her keep her child if he can guess his name. If she can't guess his name by tomorrow, then the child will end up in the possession of Rumpelstiltskin. Piggy called the King, the Loyal Royal Advisor, and her father where she told them the whole truth about her having help in converting straw into gold. The King mentioned that he married Piggy because he loved her which surprised the Loyal Royal Advisor and her father. The four of them get to work at guessing Rumpelstiltskin's name. When the deadline is up, Rumpelstiltskin returns to see if Piggy has guessed his name and nearly gave it away. Upon recalling that Rumpelstiltskin went to \"Camp Weido,\" he has her father and the Loyal Royal Advisor grab him while stating to the King that \"a good mother always sews their child's name in their clothes before sending them off to camp.\" Piggy finds the label that lists Rumpelstiltskin's name and reads it out loud. Rumpelstiltskin declares it an outrage while Piggy, the King, the Loyal Royal Advisor, and the Miller celebrate.\n=== The Emperor's New Clothes ===\nIn the kingdom of Fozzalia, three rat tricksters (played by Rizzo the Rat, Yolanda the Rat, and Montague the Rat) are in the town square showing off their Curative Elixirs. Robin the Frog doubts Rizzo's claim while another man stated that the Curative Elixir \"cured his baldness\" as a rat is seen on top of his head. The young boy states that the rat is on the man's head which the man notices. The rat jumps off the man's head as the rat tells Rizzo that the jig is up. Rizzo is arrested by the Police Chief (played by Officer Fuzzy from Dog City) and is taken to Emperor Fozzie Bear. Upon being brought to Emperor Fozzie, Rizzo claims to him that the rest of his wardrobe is shabby due to it not being special enough. Rizzo states that he happens to be the finest tailor in all the land. Emperor Fozzie then asks for Rizzo to make him some new clothes as Rizzo sends the Emperor to obtain gold for payment and to meet him in the Royal Dressing Room for a fitting. Rizzo has Yolanda take measurements in preparation for his new clothes while Montague weaves the finest fabric in all the land. Rizzo claims that the special fabric can only be seen by elegant people such as the Emperor. Emperor Fozzie then \"sees\" the fabric in question. Members of the Emperor's Court claim to not see it until they do after the Emperor claims that they aren't \"elegant enough.\" The rats then present Fozzie with his \"new clothes\" that are on the hanger that Rizzo gives him. Before Rizzo can lead Yolanda and Montague to their next business in Tarzana, Emperor Fozzie states that he will hold a celebration to show off his new clothes with the rats being his guests of honor. At the celebration, Rizzo gives the crowd a heads up stating that Emperor Fozzie's new clothes can only be seen by the elegant. When Emperor Fozzie goes out to show his new clothes, Robin notices that Emperor Fozzie is wearing nothing but his boxers. Emperor Fozzie notices this as the members of his Court end up using their bodies to cover him. The citizens of Fozzalia think that since Emperor Fozzie isn't wearing clothing and that public nudity must be the latest fad Emperor Fozzie tells his people that they should stop doing things just because he does them, and that they should start thinking for themselves. As Rizzo, Yolanda, and Montague try to take their leave, they are caught by the Police Chief. Gonzo narrates that the Emperor and his kingdom learned that it's best to think for themselves and follow their own fashion. As for Rizzo, Yolanda, and Montague, they are serving 10 years in the dungeon. When Rizzo states that they should visit a Sultan who is so gullible when they get out, Yolanda and Montague end up kicking Rizzo.\n=== The Elves and the Shoemaker ===\nA shoemaker (played by Kermit) and his nephew Robin the Frog are visited by the local banker (played by Officer Fuzzy from Dog City) who demands his money by tomorrow or he will toss them into the street. The shoemaker states that they haven't been having good business lately since they've been making ugly shoes and all will be lost if there is nothing else to do about it. When the shoemaker and his nephew Robin go to sleep, their house is visited by a group of philanthropic entertainer elves (played by The Elvises). Unfortunately, they can only make blue suede shoes. The next morning, the shoemaker and Robin woke up to find the blue suede shoes and a bunch of customers outside of their store. By the time night had fallen, every shoe in the shop has been sold and the banker takes the money stating that he'll be back for the other half of the \"his money.\" When Robin hopes for another miracle that involves whoever helped them to return, the shoemaker states that they will be ready to find out who has been helping them. Once the shoemaker and his nephew have fallen asleep, they awoke in time to see the elves working on the blue suede shoes. When morning comes, the store is packed with eager customers and the banker takes the other half of the money. Upon watching the elves at work, the shoemaker tells Robin that it's time he thanked them for their kindness. Rizzo ends up coming on stage to suggest a gift to give to the elves. The shoemaker and Robin worked through the night to make a special gift to thank the elves. When the elves arrived at midnight, the shoemaker and Robin present them with white sequined jumpsuits. While the shoemaker and Robin live happily ever after, the elves relocated to Las Vegas where they perform two shows.\nNote: During this story, Rizzo walks onstage to speak to Kermit and Robin about a gift to give the Elvises. As Steve Whitmire was already performing Kermit, he could not puppeteer for Rizzo at the same time and Rizzo's voice is recognizably that of Dave Goelz.\n=== Finale ===\nAs Gonzo and Rizzo close out the show while dancing with Kermit and Robin, the Elvises sing \"Blue Suede Shoes\" during the credits."}