{"mid": "MuppetsFromSpace", "IMDB_id": "tt0158811", "title": "Muppets from Space", "plot": "The Great Gonzo has always been identified as a \"whatever\"; but, after having disturbing dreams of abandonment and rejection, he begins to realize just how alone he is in the world. One of his nightmares involves his being denied entry onto Noah's Ark by Noah. The next morning, Gonzo tells Kermit the Frog that he is getting tired of being referred to as a \"whatever.\" After an alien race appears to be trying to send him a message through his bowl of cereal, Gonzo realizes that he may not be so alone after all and climbs to the rooftop to start watching the sky. Using a bolt of lightning, Gonzo communicates with a pair of cosmic fish, revealing to him that he is an alien from outer space.\nUnable to convince Kermit and his friends of the aliens' existence, Gonzo is lured into the clutches of K. Edgar Singer of C.O.V.N.E.T., a government organization disguised as a cement factory. Singer has also taken note of the aliens' attempts to communicate and thinks that Gonzo is his key to convincing his superiors that aliens do in fact exist. Gonzo and Rizzo the Rat are arrested by C.O.V.N.E.T. Agents and Agent Rentro (Bobo The Bear). Rizzo's antics cause himself to be flushed down a tube by the Man in Black (Hollywood Hulk Hogan). Rizzo ends up having to go through C.O.V.N.E.T.'s rat training and medical research held by Dr. Tucker, alongside the other rats like Bubba the Rat, Shakes the Rat, Fast Eddie, Troy, and The Bird Man. After Miss Piggy interrogated Agent Baker, she, Kermit, Fozzie Bear, Pepe the King Prawn, and Animal spring into action to rescue Gonzo and Rizzo from C.O.V.N.E.T., using such inventions as a door in a jar, a rubber duck that sprays invisibility spray, and mind control gas from Bunsen Honeydew and Beaker, which Miss Piggy uses on a gate guard).\nA talking sandwich asks Gonzo where the alien ship can land, and Gonzo suggests Cape Doom (a beach), unaware that Agent Rentro is listening. At the military base, the gang arrives to rescue Gonzo and Rizzo. While on their rescue, everyone uses invisible spray but eventually becomes visible when Fozzie washes his hands upon exiting the restroom as Animal is unleashed upon a female guard. Rizzo frees Gonzo from the dissection table while the rats attack Dr. Phil Van Neuter, where Singer and General Luft witness the attack. General Luft leaves declaring that Singer \"needs help.\" When Singer discovers Gonzo's escape, he has Agent Rentro prepare the Subatomic Neutro-Destabilizer to use on the aliens and heads to his car. When Agent Rentro informs him that the car has been impounded due to the parking tickets that Agent Rentro forgot to take care of, Singer and Agent Rentro end up taking the company car which happens to be a cement truck.\nThe Muppets go to Cape Doom after rescuing Gonzo and, along with a crowd of alien-happy spectators, await their arrival. The ship comes to Earth and the aliens, who all resemble Gonzo, explain that many years ago they lost him but welcome him back into the fold. Singer shows up and tries to kill the Aliens, but thanks to Agent Rentro (who has disabled his Subatomic Neutro-Destabilizer by stealing the part that fires the weapon), he is unable and is laughed at. Gonzo considers going into space with his long-lost family but chooses not to. While grateful for his family for going through the trouble of locating and visiting him on Earth, he decides not to go with them, as he wants to stay with his fellow Muppet Show cast-mates. Singer is invited by the aliens to go with them and leaves as Earth's ambassador.\nAs the Muppets are watching the stars on the roof, Gonzo tells Kermit he wonders why his family asked him to build a Jacuzzi. Pepe chuckles because he and Rizzo had pretended to be them and asked him to do it."}