{"mid": "MurderParty", "IMDB_id": "tt0878695", "title": "Murder Party", "plot": "Christopher, a lonely and plain man, finds an invitation to a Halloween costume party entitled \"Murder Party\", on the street. Constructing a knight costume out of cardboard, he makes his way to Brooklyn to attend the party, only to discover it is actually a trap set by a group of deranged art students. The art students, in costume, include Paul (a gothic vampire), Macon (a werewolf), Sky (a zombie cheerleader), Lexi (Daryl Hannah's replicant character from Blade Runner), and Bill (a Baseball Fury from The Warriors). They intend to commit a murder as a piece of artwork to impress Alexander, their wealthy and sinister patron, in the hopes that they will receive a large arts grant from Alexander. Christopher has brought along a loaf of pumpkin raisin bread, which Sky starts to eat. She then reveals that she is allergic to non-organic raisins, and didn't know about them. The group asks if she'll be OK, and she agrees explaining she's only a little dizzy and needs to sit down, however she falls over and hits her head on some old machinery and dies. The group hides the body, as they are embarrassed and don't want their patron to see it when he arrives. After dumping the body in a deep freezer, Macon blames Christopher for Sky's death and attempts to murder him before Alexander arrives by pouring a jar of acid on him. The acid has no effect as it is only a jar of Acetic Acid (vinegar).\nThe patron finally arrives to the Murder Party with a friend Zycho (who is unknown to the group), and his dog Hellhammer. Alexander is also dressed as a gothic vampire, but his costume is considerably cheaper than Paul's. Out of jealousy, Alexander forces Paul to completely remove his vampire costume while Zycho holds him at gunpoint. Alexander reveals that Zycho is his drug dealer and he was only joking with Paul, telling him the gun wasn't real. Each member of the Murder Party then gives their input on how they will commit the murder. Drugs and alcohol fuel the group as they decide to wait for the witching hour, at which time they will all stab Christopher in unison. While Macon leaves to pick up some pizza, Alexander has sex with Lexi. Macon arrives back to see the two having sex and this makes Macon visibly upset. Macon begins binge drinking hard alcohol in response and ends up covering himself in alcohol in the process. Paul, a photography artist, begins taking pictures of Christopher and is frustrated that no one will assist him.\nZycho, visibly bored with the party, asks Alexander if they could leave and Alexander whispers something in his ear in response. Alexander then suggests that the group play a game of ultimate truth or dare. They will all take a shot of Sodium Pentothal (truth serum) and divulge their most inner secrets. All eventually take a shot from the same needle, except for Alexander, who injects his shot into a slice of pizza. Each reveals mostly trivial truths about their lives and attempt to force Alexander to confirm that he indeed does have grant money to give. During this time, Bill who has mostly kept to himself playing a PSP and shown little visible interest in the proceedings, asks the group what they say about him behind his back. They tell him they make fun of him and plan on throwing him out of the group, but only because his work is so much better than theirs. This angers Bill and he goes back to playing his PSP. Macon confesses his long time love for Lexi and recounts a story of when they were in high school and ate a popsicle together on a water tower. Macon shows he kept the leftover popsicle stick as a token but is rebuffed by Lexi. Alexander sends Zycho out to get him some Crank. Macon is now extremely inebriated and goes outside to smoke a cigarette. Still covered in alcohol, Macon is engulfed in flames as he lights the cigarette, and only Christopher notices.\nFrustrated with not having anyone to assist in his photographs, Paul calls his professional assistant to aid him. The group is not happy as the assistant is not aware of the murder party. An argument breaks out and Paul injects Alexander with a dose of Sodium Pentothal. The groups asks him about the grant again and discover Alexander is actually a fraud. He is a fry cook who plans on killing the group, stealing their art, and selling it as he assumes it will be worth more. Lexi discovers Macon on fire and she and the assistant extinguish him. Zycho returns with a bag of crank and Alexander immediately tells Zycho to kill everyone. Paul is shot in the head but doesn't realize and seems to only be annoyed that someone interrupted his shot. The assistant is also shot in the head and Zycho attacks Lexi. Macon, badly burned but still alive, gets his chainsaw and uses it to attack Zycho, killing him and passing out shortly afterward. Lexi immediately begins to untie Christopher, but Bill, who has now completely snapped, decides everyone has to die and kills Lexi with an axe. In the excitement Hellhammer eats the bag of crank and then attacks Alexander. Bill finishes off the wounded Alexander with a baseball bat and begins hunting down the last survivor, Christopher, who has now escaped. Macon awakes and pursues Bill with an electric chainsaw to take revenge for Lexi. The chase leads them to an Arts student party. Chris attempts to hide in a performance art exhibit and Bill is approached by the organizer and asked if has seen Alexander as a grant was promised to him. Bill is further enraged and vows to murder the whole scene. He enters the art exhibit and murders all the artists before cornering Christopher. Macon, who has arrived at the party and has found an outlet to plug in the chainsaw, falls off the roof while plugging it in. The plugged in chainsaw is conveniently left hanging in front of a window where Christopher is trapped. Christopher uses the chainsaw to stop Bill (by killing him), and leaves the exhibit as partygoers assume the murder scene is an art piece.\nChristopher arrives home and his cat, Sir Lancelot, finally gives him his chair back. Christopher sits down and turns on his television.... still wearing his blood soaked Knight costume."}