{"mid": "MurderByDeath", "IMDB_id": "tt0074937", "title": "Murder by Death", "plot": "A group of five renowned detectives, each accompanied by a relative or associate, is invited to \"dinner and a murder\" by the mysterious Lionel Twain. Having lured his guests to his mansion managed by a blind butler named Jamessir Bensonmum, who is later joined by a deaf-mute, illiterate cook named Yetta, Twain joins his guests at dinner. The house is then sealed off. Twain announces that he is the greatest detective in the world. To prove his claim, he challenges the guests to solve a murder which will take place at midnight; a reward of $1 million will be presented to the winner.\nBefore midnight the butler is found dead and Twain disappears, only to re-appear dead from a stab wound immediately after midnight; the cook is also discovered to have been an animated mannequin, now packed in a storage crate. The party spends the rest of the night investigating and bickering. They are manipulated by a mysterious behind-the-scenes force, confused by red herrings, and baffled by the \"mechanical marvel\" that is Twain's house, and they ultimately find their own lives threatened. Each sleuth presents his or her theory on the case, pointing out the others' past connections to Twain and their possible motives for murdering him.\nWhen they retire to their guest rooms for the night, each of the guests are confronted in their rooms by things that threaten to kill them: a snake, a venomous scorpion, a descending ceiling, poison gas, and a bomb. They all survive, and in the morning they gather in the office, where they find the butler waiting, very much alive and not blind. Each detective presents a different piece of evidence with which they each independently solved the mystery, and in each case, they accuse the butler of being one or another of Twain's former associates.\nAt first the butler plays the part of each of the persons, male or female, with whom he is identified, but then he pulls off a mask to reveal Lionel Twain himself, alive. Twain disparages the detectives, and metafictionally, the authors who created them, for the way their adventures have been handled, including such misdeeds as introducing crucial characters at the last minute for the traditional \"twist in the tale\" (something the assembled detectives had been doing a few minutes earlier) and withholding clues and information to make it impossible for the reader to solve the mystery. Each of the detectives departs the house empty handed, none of them having won the million dollars. When asked whether there had been a murder, Wang replies, \"Yes: killed good weekend.\"\nAlone in his home, Twain pulls off yet another mask to reveal Yetta, who smokes a cigarette and laughs diabolically while rings of cigarette smoke fill the screen."}