{"mid": "MurderAt1600", "IMDB_id": "tt0119731", "title": "Murder at 1600", "plot": "In a restroom in the White House in Washington, D.C., a janitor finds White House secretary Carla Town (Mary Moore) dead. Metropolitan Police homicide Detective Harlan Regis (Wesley Snipes), whose apartment house is awaiting demolition in favor of a parking lot, is put on the case. At the White House, Regis is introduced to U.S. Secret Service Director Nicolas \"Nick\" Spikings (Daniel Benzali), U.S. National Security Advisor Alvin Jordan (Alan Alda) and Secret Service agent Nina Chance (Diane Lane). Spikings assigns Chance, a former Olympic gold-class sharpshooter, to keep an eye on Regis.\nParallel to this, the White House has to deal with an impending international crisis: U.S. President Jack Neil (Ronny Cox) has been trying to deal with a situation where Americans are being held hostage in North Korea, and some people—including several members of his inner circle, led by Vice President Gordon Dylan—think the President is not handling it the right way. Some people think Neil should send troops to North Korea to rescue the hostages; he does not want to start a potential 2nd Korean War, and is disgusted that a high-ranking military official says that the main reason to act decisively is to send a message to North Korea's only ally, China.\nWhite House janitor Cory Allen Luchessi (Tony Nappo) was apparently unaccounted for on the night of the murder and had once attempted to make a pass at Carla; he is arrested and questioned, but his testimony and a clearly set-up piece of evidence lead Regis to suspect that the Secret Service may be involved. That night, Regis finds his apartment burglarized; the culprit escapes, and in a subsequent search, a hidden bug is found.\nIn a picture of Carla, Regis sees Secret Service agent Burton Cash (Nigel Bennett), the Secret Service agent assigned to Kyle Neil (Tate Donovan), the son of President Neil and First Lady Kitty Neil (Diane Baker). Regis figures out that it was Kyle who had sex with Carla on the night of the murder. At the dance club, Regis talks to a young woman who says that Kyle once bragged that he shared Carla with his father. Carla's uncle's company, Brookline Associates, is President Neil's leading East Coast fundraiser and Brookline also owns the apartment Carla lived in.\nRegis eventually discovers that Chance once used to be Kyle's bodyguard herself. When he confronts her, Chance explains that one night, she heard noises coming from Kyle's apartment, went in, and found Kyle beating up his girlfriend. The Secret Service covered up the beating for Kyle so he would not be arrested for assault and battery, and Chance asked to be reassigned and was replaced by Burton Cash. This sparks Regis's suspicion that Kyle may actually be Carla's murderer.\nRegis confronts Kyle with his suspicions, who claims that he did not murder Carla, but is able to provide a special piece of information: among the bookings she made, Carla has supposedly also ordered a car - with the only hitch being that she had had no driver's license. Later on, Regis and Chance discover that the most recent entries in Carla's appointment book were forged. With some clues left by Alvin Jordan, Regis manages to find out that Spikings has withheld several surveillance video tapes from the night of the murder. Regis goes to Spikings' residence to question him, and Spikings is willing to show him the tape but is suddenly killed by a sniper.\nRegis and Chance escape the gunfire with Spikings' tape, and when it is played, they discover that Jordan is behind everything. Things get more difficult for them as the National Security Advisor has now framed the detective and the agent as traitors. Jordan wants Neil to resign so Dylan (Chris Gillett) can take over as President, because Dylan would not be afraid to send troops to North Korea to rescue the hostages, and Jordan believes that Neil's refusal to rescue the hostages by force makes Neil unfit to be President.\nRegis, Chance, and Regis's partner and friend Stengel (Dennis Miller) enter the White House tunnels while Jordan still tries using fabricated evidence to blackmail Neil into resigning as President. In the tunnels, the sniper who killed Spikings for Jordan pursues them and wounds Stengel, but Chance manages to kill him. Pursued by the Secret Service, Regis just barely manages to get in contact with the President and present him with the evidence of Jordan's conspiracy. Jordan attempts to shoot the President, only for his shot to be intercepted by a handcuffed Chance, and he is killed by the Secret Service.\nChance and Stengel are brought to a hospital, where they recover from their injuries. In gratitude for his rescue, the President promises Regis to look into the commission who bought Regis's building."}