{"mid": "MurderMySweet", "IMDB_id": "tt0037101", "title": "Murder, My Sweet", "plot": "Marlowe is in a police station, a bandage over his eyes. He explains what happened in a flashback.Moose Malloy comes in to Marlowe's office. He's just got out of prison and wants Marlowe to find his ex-girlfriend, who he's not seen in eight years. Malloy takes him to a place called Florian's, where his ex used to work. They go into the bar. The bar goes quiet as they walk in. The boss comes over and warns them that he wants no trouble. Malloy walks over to a girl in the bar but the boss warns him not to bother the customers. The man throws the boss across the room. Marlowe tries to intervene, but Moose doesn't remember him. The take a couple of bottles from the bar and leave. Malloy tells Marlowe that they were to be married. Her name was Velma Valento.Marlowe traces the wife of the previous owner of Florian's. She appears to be very drunk. She gives him a file of clippings but tries to hide a picture of Valento. Marlowe takes it. Mrs. Florian tells him she's never heard of Moose Malloy and demands that he leave. He does, but then watches her through the window as she makes a phone call, apparently not as drunk as she seemed.Marlowe returns to his office to find Lindsay Marriott waiting in his office. He hires Marlowe to accompany him to a rendezvous to make a business transaction, exchanging a jade necklace for cash. Arriving at the spot, Marlowe gets out to look around. Gun drawn, he walks some distance into the bushes. Finding nothing but a deer, he returns to the car, where he is coldcocked by a blackjack.When he awakens, a woman asks if he is all right, then, apparently recognizing him, runs. Marriott has been killed and dumped in the back seat.Cut to a police station where Marlowe is being interrogated about the murder. They argue and then Marlowe is released, but tell Marlowe they think Jules Amthor is mixed up in this.This time, returning to his office, a woman is waiting. She tells him her name is Miss Allison, but he grabs her purse and finds she is actually Ann Grayle. She tries to storm out but he's locked the door. She tells him the jade belonged to her father.They go to visit her father in a palatial mansion. His wife, a stunning blonde, is also there. He explains that the necklace had been taken from his wife at gunpoint, and retires. Mrs. Gayle tells Marlowe that Marriot had been assigned to buy it back. As they talk, Amthor is shown in. They arrange an interview.Cut to Marlowe's home. Mrs. Grayle walks in behind a laundry boy and gives him a retainer. They go to a nightclub. Miss Grayle is there and talks to Marlowe privately. She offers him more money to make him go away. Moose is there too. He asks Marlowe to come and meet someone, and Miss Grayle disappears before he can make excuses. Moose takes him to a highrise and takes his gun. The person he is meeting turns out to be Amthor. He claims to be a psychic healer that the police are after. Marlowe accuses him of blackmailing women. Amthor thinks Marlowe has the necklace, which he wants. Moose causes a ruckus, wanting Marlowe to tell him where Velma is. They fight and Marlowe is kncked out and drugged, causing hallucinations.He wakes up on a cot. After shaking off the effects of the drug, he escapes, and confronts a doctor, who tells him he's been out for three days. Moose finds him and gets him a cab. Marlowe goes to see Ann. She asks him what happened, and he remembers that she was the girl at the rendezvous.The police come in and Marlowe gives them the story.Marlowe and Ann go back to the mansion and talk to her father. The police have been there, interested in his beach house. Mr. Grayle asks Marlowe to drop the case for money. Marlowe agrees, but tells Ann he's going to the beach house anyway.At the beach house, they find Mrs. Grayle. Ann, angry, leaves to tell her father. Marlowe accuses Mrs. Grayle of having Amthor shake him down for the necklace. She tells him Amthor is blackmailing her after she went to him for treatment. She was supposed to give him the jade, but it was stolen before she could give it to him. She thinks it was Marriot. She asks him to help her kill Amthor to stop him from blackmailing her further, and Marlowe agrees. They plan to lure Amthor to the beach house where Mrs. Gayle will shoot him.Marlowe goes to Amthor's place to set up the plot, but finds Amthor dead with his neck snapped, obviously by Moose. He returns to the office, where Moose finds him. Marlowe tells him the picture was a fake, but that he can take Moose to her. They agree to meet the next day.Marlowe takes him to the beach house and tells him to wait outside for a signal. He goes in to meet Mrs. Gayle, who still thinks the original plan is in place. She gives Marlowe the jade necklace, which she has had all along. She had told Marriot it had been stolen to throw them off the trail. Marlowe accuses her of killing Marriot, and tells her that Moose is waiting outside. She is actually Velma Valento. She had been supporting Marriott, Amthor, and Mrs. Florian with her blackmail money, but Moose's return had fouled the plan, and they were attempting to get rid of Marlowe before he could discover the plot.Mrs. Gayle pulls a gun on him. Ann and her father show up. Mrs. Gayle tells Mr. Gayle to take the gun. He does, but then shoots her. Moose hears the shot and comes upstairs, to see Velma's dead body. He attacks Mr. Gayle. Marlowe dives for Grayle's gun just as he fires, is blinded by the powder, and blacks out.Cut to the police station. Marlowe is wearing a bandage over his eyes. They explain that Gayle and Moose killed each other struggling for the gun. An officer leads him to a cab and he talks about Ann the whole way, without realizing that Ann was there all along. She gets in the cab with him and he realizes it's her. The end."}