{"mid": "MurielsWedding", "IMDB_id": "tt0110598", "title": "Muriel's Wedding", "plot": "A socially awkward, fat, naïve \"ugly duckling\", who is obsessed with the music of ABBA, Muriel Heslop (Toni Collette) is the target of ridicule by the more fashion-conscious girls she considers her friends. She also is a perpetual daydreamer who yearns for a glamorous wedding and marriage to a man who will help get her out of the fictional dead-end seaside tourist town of Porpoise Spit, Queensland, improve her personal life, and free her from a tedious life dominated by her demanding and often psychologically abusive father Bill (Bill Hunter), a corrupt politician who verbally lashes out at his weak and subservient wife Betty and their unambitious children at every opportunity. Her former friends Tania, Nicole and Janine shun Muriel because they see her as a directionless no-hoper, as well as due to embarrassment over her past awkward antics. They proceed to continue planning a holiday to Hibiscus Island, without her.\nWhile at dinner with some property developers, Heslop runs into her father's mistress, Deidre Chambers, who has done well in a cosmetics pyramid marketing scheme and she recruits Muriel. The following day Muriel's mother writes a blank check to cash intending for the money to let Muriel buy into the scheme. Instead, Muriel uses the blank check to defraud her parents, draining their bank account of $12,000, which she uses to go follow her former friends to Hibiscus Island. While on the Island, Muriel's former friends confront her over her stalking, requesting that she leave them alone. Later in the evening, Muriel runs into Rhonda Epinstock (Rachel Griffiths), a fellow social outcast from her high school days who is also more outgoing. Rhonda confronts Muriel's former social-group who also bullied her in high-school. As Rhonda and Muriel catch up, Muriel invents a grandiose fantasy of a fiancé.\nAt the end of her holiday, Muriel returns home only to be confronted by her mother over the fraud. Muriel immediately leaves the house and moves to Sydney where she shares a flat with Rhonda and changes her name to 'Mariel'. Several months later on a typical night, Rhonda and Mariel go to a nightclub. Rhonda meets two American sailors while Muriel takes a nice man, Brice Nobes, she met at her minimum wage job in a local video store. Later, while engaged in foreplay, Muriel and her companion break a window. The sailors that were in Rhonda's bedroom go out to investigate and assume that Muriel's companion is attempting to rape her. It is during this episode that Rhonda falls down, apparently paralyzed.\nWhile waiting overnight in the emergency room in Sydney, Muriel calls her family home where she learns that the Australian Federal Police are investigating her father for corruption. Rhonda discovers she has a malignant tumour pressing on her spine and requires urgent surgery. Muriel then co-opts Rhonda's health crisis as the basis of a deception to obtain a free photo shoot from a bridal shop. During one of Rhonda's rehab sessions, Muriel promises that she will take care of Rhonda and that they will never need to return to their hometown. Rhonda discovers that Muriel has tried on every wedding dress in Sydney and confronts her, forcing Muriel to confess the depth of her deception.\nRhonda's cancer returns, necessitating more severe surgery and leaving her permanently paralyzed. Desperate to get married, Muriel enters into a conspiracy to commit visa fraud marrying South African swimmer David Van Arkle so that he can stay in Australia and compete in the upcoming Olympics. Muriel agrees to marry David for $10,000 hoping to pay her father off. At Muriel's elaborate wedding, her former friend group serve as the bridesmaids, while Rhonda bound to her wheelchair is relegated to being a guest. Muriel had asked Rhonda to be a bridesmaid but Rhonda turned her down. Muriel's father is accompanied by his mistress and Muriel's mother arrives late to the wedding, missing the actual ceremony. Muriel doesn't notice her mother at the back of the church and just walks past. Rhonda moves back to Porpoise Spit with her mother as she can no longer live in Sydney without any help, as Muriel moves in with her new husband.\nAfter the ceremony, Muriel and David return to David's apartment and he gives her a perfunctory tour of place. After showing Muriel to her bedroom, David makes his contempt for Muriel known asking \"what kind of person marries someone they don't know?\" to which she replies \"you did.\" His face shows contempt when she says that she too wants to win. Realizing that their relationship will always be platonic, Muriel sits on her bed and contemplates the view.\nMeanwhile, back in Porpoise Spit, Muriel's distraught mother accidentally shop-lifts a pair of sandals from a supermarket. Bill arranges with the police for the charges to disappear and takes Muriel's mother home where he announces his intention to divorce Betty and marry his mistress, Deidre Chambers. Betty sets the backyard on fire, then commits suicide by taking sleeping pills.\nRealising that Betty lived only for her family and that her constant marginalization and being married to a man that didn't really love her broke Betty's will to live, Muriel breaks down and realizes that all the frauds, falsehoods and lies only lead to pain. David comforts Muriel and they finally consummate their marriage. Muriel realizes that she can move beyond her family-of-origin issues, that her actions have consequences and that her choices matter. The next morning Muriel asks David, who has decided that he likes having her around, for a divorce. However, she leaves him at the hotel wishing him good luck in the games.\nBill asks Muriel to stay and help raise the kids; she refuses and returns to Sydney. She repays $5,000 of the $12,000 she stole, saying that she will repay the rest when she gets a job back in Sydney. She also states that she will no longer put up with his rude and emotionally abusive treatment of her and her siblings. Although a little taken aback by her new more assertive personality at first, he nonetheless respects her decision and gives her his blessing to move back to Sydney.\nMuriel visits Rhonda at her mother's house and offers to take her back Sydney. Rhonda accepts who in turn tells off Muriel's former friends. When one of them tries to make an insulting comeback Muriel and Rhonda just laugh it off as Muriel with her more confident attitude no longer cares about what they think of her. They take a taxi cab to the airport and along the way they say goodbye to various Porpoise Spit \"attractions\" (such as the shopping mall, the beach, the tourists, and the condos) and ride off to a more promising future."}