{"mid": "Mustang", "IMDB_id": "tt3966404", "title": "Mustang", "plot": "The film starts with Lale, the youngest of the five sisters and the protagonist, bidding an emotional farewell at school to her female teacher, who is moving to Istanbul. The sisters decide to walk home instead of taking a van, to enjoy the sunny day. Along the way, they play in the water at the beach with their classmates. For one game, they sit on boys' shoulders and try to knock each other off. When they reach home, their grandmother scolds and hits them for their having this kind of bodily contact with boys and thus \"pleasuring themselves\" with them. Their uncle Erol is equally furious. From then on, the girls are forbidden from leaving the house, even for school.\nThe sisters feel stifled in their home as their grandmother tries to make them suitable for marriage. When in public they must now dress in drab, conservative clothing. Instead of attending school, they must stay home, where they are taught how to cook, clean and sew by their female relatives. Even so, the oldest sister, Sonay, sneaks out occasionally to meet her lover, and Lale looks for various ways to escape.\nLale, who loves football, is forbidden from attending Trabzonspor matches. She resolves to go to a match from which men have been banned due to hooliganism. A friend tells her that the girls in the village are going together on a bus. The sisters, who are happy for an opportunity to leave the house, sneak out of the house with Lale. When they miss the bus, they hitch a ride with a passing truck driver, Yasin, who helps them catch up to it. They’re ecstatic in the exuberant atmosphere of the all-female crowd cheering for their team. Back home, their aunt catches a glimpse of them at the match on TV, just as their uncle and other village men are about to tune in. To prevent the men from finding out, she cuts the house's, and then the whole village's, electricity.\nWhen the girls return, their grandmother decides to start marrying the sisters off. They’re taken to town, ostensibly \"to get lemonade\", which is actually an opportunity to show them off to potential suitors. Soon enough, a suitor and his family arrive to meet them. Sonay vows to only marry her lover and refuses to meet the prospective suitor and his family. Selma is sent instead and becomes engaged. Sonay gets engaged a short while later to her lover. At the two sisters' joint wedding, Sonay is clearly happy while Selma is not. On the night of her wedding, Selma's in-laws come to view the bed sheets in a traditional ritual to establish that Selma was a virgin before her wedding night. Because there is no blood on the sheet, her in-laws take her to a physician to have her virginity tested.\nNext in line for marriage is Ece. It’s revealed that her uncle is sexually abusing her at night. In Lale’s words, she starts acting “dangerously.” When the three remaining girls stop with their uncle near a bank, Ece allows a boy to have sexual contact with her in their car. She makes jokes at the lunch table, inciting loud laughs from her sisters, and is told to go to her room, where she shoots herself and dies. The surviving sisters and their family attend the funeral.\nNow it is just the two youngest sisters, Nur and Lale, at home. Lale continues sneaking out. On one impulsive attempt to walk to Istanbul alone she is encountered by Yasin, the truck driver, who is kind to her. At Lale's request, he later teaches her how to drive. When she is caught on the way back into her house, the house is again reinforced to try to make it impossible for them to leave.\nIt becomes evident that the uncle starts abusing Nur as well and that their grandmother knows about it. She says that now it is time for her to be married off. Though she is young, she is found a suitor and engaged to be married. On the night of Nur's wedding, Lale convinces her to resist, and the girls bar themselves inside the house while the whole wedding party is outside, much to the embarrassment of their family. As the wedding party disperses, their uncle violently tries to get inside. Lale finds the phone hidden in a cupboard and plugs it in to call Yasin for help. The girls gather up money and a few supplies, grab the uncle's car keys, and sneak out of the house. They manage to escape in the car, crashing it close to their house. They hide and wait for Yasin, who picks them up and takes them to the local bus station. The girls take the bus to Istanbul, where they find their former teacher, who greets them warmly."}