{"mid": "MutinyOnTheBounty", "IMDB_id": "tt0056264", "title": "Mutiny on the Bounty", "plot": "One night in Portsmouth, England in 1787, a press gang breaks into a local tavern and presses all of the men drinking there into naval service. One of the men inquires as to what ship they will sail on, and the press gang leader informs him that it is the HMS Bounty. Upon inquiring as to who the captain is, another of the men is told the captain is William Bligh (Charles Laughton), and attempts to escape, as Bligh is a brutal tyrant who routinely administers harsh punishment to officers and crew alike who lack discipline, cause any infraction on board the ship, or in any manner defy his authority. The Bounty leaves England several days later on a two-year voyage over the Pacific Ocean. Fletcher Christian (Clark Gable), the ship's lieutenant, is a formidable yet compassionate man who disapproves of Bligh's treatment of the crew. Roger Byam (Franchot Tone) is an idealistic midshipman who is divided between his loyalty to Bligh, owing to his family's naval tradition, and his friendship with Christian.\nDuring the voyage, the enmity between Christian and Bligh grows after Christian openly challenges Bligh's unjust practices aboard the ship. When the ship arrives at the island of Tahiti, where the crew acquires breadfruit plants to take home, Bligh punishes Christian by refusing to let him leave the ship during their stay. Byam, meanwhile, sets up residency on the island, living with the island chief, Hitihiti (William Bambridge), and his daughter, Tehani (Movita Castaneda), and compiling an English dictionary of the Tahitian language. Hitihiti persuades Bligh to allow Christian a day pass on the island. Bligh agrees but quickly repeals the pass out of spite. Christian disregards the order and spends his one-day off the ship romancing a Tahitian girl, Maimiti (Mamo Clark). Christian promises her he will be back someday.\nAfter leaving Tahiti the crew begins to talk of mutiny after Bligh's harsh discipline leads to the death of the ship's beloved surgeon, Mr. Bacchus (Dudley Digges), and Bligh cuts water rationing to the crew in favor of providing water for the breadfruit plants. Christian, although initially opposing the idea, decides he can no longer tolerate Bligh's brutality when he witnesses crew members shackled in iron chains, and he approves the mutiny. The crew raids the weapons cabinet and seizes the ship. Bligh and his loyalists are cast into a boat and set adrift at sea with a map and rations to ensure their survival. Due to Bligh's steady leadership, they are able to find their way back to land.\nMeanwhile, Christian orders that Bounty return to Tahiti. Byam, who was in his cabin during the mutiny, disapproves of what Christian has done and decides the two can no longer be friends. Months later, Byam is married to Tehani and Christian has married Maimiti and has a child with her, while the rest of the crew are enjoying their freedom on the island. After a long estrangement, Byam and Christian reconcile their friendship. However, when the British ship HMS Pandora is spotted approaching, Byam and Christian decide they must part ways. Byam and several crew members remain on the island for the ship to take them back to England, while Christian leads the remaining crew, his wife and several Tahitian men and women back on board Bounty in search of a new island on which to seek refuge.\nByam boards the Pandora and, much to his surprise, discovers that Bligh is the captain. Bligh, who suspects that Byam was complicit in the mutiny, has him imprisoned for the remainder of the journey across the sea. Back in England Byam is court-martialed and found guilty of mutiny. Before the court condemns him, Byam speaks of Bligh's cruel, dehumanising conduct aboard Bounty. Due to the intervention of his friend Sir Joseph Banks (Henry Stephenson) and Lord Hood (David Torrence), Byam is pardoned by King George III and allowed to resume his naval career at sea.\nMeanwhile, Christian has found Pitcairn, an uninhabited yet sustainable island that he believes will provide adequate refuge from the reach of the Royal Navy. After Bounty crashes on the rocks, Christian orders her to be burned."}