{"mid": "MyBestFriendsGirl", "IMDB_id": "tt1046163", "title": "My Best Friend's Girl", "plot": "Kamryn Matika is a thirty-two-year-old national marketing manager for a department store, who lives in Leeds. On her birthday, she receives a card—not a birthday card—from her former best friend, Adele Brannon, which says that she is in hospital and she is dying. Kamryn is reluctant to see her. Two years previously, she discovered that her partner and her best friend conceived a child together three years earlier. Kamryn had vowed never to speak to them again. However, she visits London anyway but when at the hospital she discovers that Adele has terminal cancer and is going to die soon. She is shocked when Adele says that she wants Kamryn to adopt her daughter Tegan.\nKamryn thinks about it and reflects when she met Adele in university for a couple of hours before she goes to collect Tegan from Adele's father and step-mother, who have abused and neglected both Adele and Tegan. They let Tegan go as a) they would be glad to see the back of her b) Kamryn had threatened to phone the police. Tegan is somewhat quiet and is rather scared, but Kamryn reassures her everything will be ok. In the hotel room, Kamryn is shocked to see how much abuse Tegan had suffered at the hands of her grandparents. Kamryn decides to stick to a plan: bath, food, bed. This actually works in a bizarre way. A few days later, Kamryn receives a knock on her door to say that Adele had died during the night. This shocks Kamryn and she tries to tell Tegan but she refuses to believe it.\nA few weeks later, Kamryn and Tegan move back up to Leeds. At first, there were issues such as they don't know what shampoo to get for Tegan. Kamryn is under suspicion as she is a black woman with a white child.\nKamryn once forgets Tegan and leaves her at a play group while she is having dinner with her new boss, Luke. The next day, Luke comes round and Tegan asks him to come to the zoo with her and Kamryn. Kamryn and Luke become closer and then they become lovers.\nJust as they are settling in, Kamryn's former partner (and Tegan's father), Nate, comes back on the scene. Kamryn tells Nate about his daughter, to which he is now becoming used to even helping with her sixth birthday party, which goes badly wrong when Tegan has an allergic reaction. In the hospital, Kamryn and Nate share a kiss which is seen by Luke, resulting in a massive break-up between him and Kamryn.\nAbout eighteen months later, Luke meets up with Kamryn and Tegan in a café and seems to have forgiven Kamryn. Tegan is now Kamryn's adopted daughter and says that they are going to get a cat."}