{"mid": "MyDarlingClementine", "IMDB_id": "tt0038762", "title": "My Darling Clementine", "plot": "In 1882 (in reality, the gunfight at the O.K. Corral happened on October 26, 1881), Wyatt, Morgan, Virgil, and James Earp are driving cattle to California when they cross Old Man Clanton. When they learn about the nearby boom town of Tombstone, the older brothers ride in, leaving the youngest brother James to watch over the cattle. The Earps soon learn that Tombstone is a lawless town without a marshal. Wyatt is the only man in the town willing to face the drunk Indian shooting at the townspeople. When they return to their camp, they find the cattle rustled and James murdered.\nSeeking to avenge his brother's murder, Wyatt returns to Tombstone. To identify the perpetrator, he takes the open position of town marshal and meets with Doc Holliday and the Clanton gang several times. During this time, Clementine Carter, Doc's ex-love interest from his hometown of Boston, arrives in town on the stagecoach, having searched for him for some time, and is given a room at the same hotel where both Wyatt and Doc Holliday are residing.\nDoc Holiday has a female friend, Chihuahua, who sings in the local saloon. Doc tells Clementine to return to Boston, or he will leave Tombstone. Clementine stays, and Doc leaves, much to the displeasure of Chihuahua. Chihuahua and Clementine have an argument. Wyatt walks in on the two and breaks up the women. Chihuahua then reveals a silver cross that belonged to James Earp. She claims Doc gave it to her. Wyatt then chases down Doc, who is headed for Tucson. Wyatt catches Doc and shoots a pistol out of Doc's hands. The two return to Tombstone, where Doc asks Chihuahua why she claimed he gave her the silver cross. After being questioned, she reveals that the silver cross was actually given to her by Billy Clanton. Billy hears this and shoots Chihuahua thru a window. Billy takes off on horse back, but is shot by Wyatt. Billy keeps riding and Wyatt tells Virgil to chase him down. Virgil chases Billy to the Clanton's homestead, where Billy dies of his wounds. Old Man Clanton then kills Virgil. Back in Tombstone, Doc operates on Chihuahua, but she dies afterwards. The Clantons arrive in Tombstone, toss Virgil's body on the street, and announce they will be waiting at the O.K. Corral for Wyatt. Wyatt, Morgan, and Doc arrive at the O.K. Corral at sun up. The Clantons and Doc are all killed.\nWyatt and Morgan then resign as law enforcers. Morgan heads out in a horse and buggy. Wyatt confronts Clementine telling her, if he is ever this way again, he will look her up at the school house. Mounting his horse, Wyatt says, \"Ma'am, I sure like that name..........Clementine.\" and rides off after his brother."}