{"mid": "MyFavoriteBrunette", "IMDB_id": "tt0039645", "title": "My Favorite Brunette", "plot": "The story is told in flashback from Death Row as Ronnie Jackson (Hope) relates to a group of reporters the events that lead to his murder conviction. Jackson is a San Francisco baby photographer who dreams about being a real private detective like his office neighbor Sam McCloud (Ladd). One day he is mistaken for a detective by mysterious lady in distress Carlotta Montay (Lamour), who claims that her wheelchair-bound husband was kidnapped at the pier as they arrived from overseas. A sinister figure (Lorre) listens at the office door. Carlotta gives Ronnie her address, and a coded map. Ronnie hides the map in the cups next to his office water cooler. Ronnie then drives to the address, which is a mansion down the Peninsula. Kismet (Lorre) greets him at the door. Carlotta tells Ronnie that the missing man is her uncle, not her husband. He entered the country on some secret mission, she says. The mansion belongs to Major Montague, she says, who was a former partner of her uncle. Major Montague enters the room, and calls Carlotta away for a phone call. Major Montague also believes that Ronnie is a private detective, as he had Kismet follow him from the office. When Carlotta is out of the room, Montague tells Ronnie that Carlotta is mentally ill. He introduces Ronnie to a wheelchair-bound man in the next room as Carlotta's uncle,who tells Ronnie that he obviously has not been kidnapped. Ronnie tells Montague that Carlotta had given him a map to hold. Carlotta reenters the room, and when alone with Ronnie, tells him that the call was from her uncle, who told her he was safe. \"He was forced to make that call\", opines Carlotta. Now she suspects Montague, because he lied to Ronnie about her. She tells him to guard the map with his life.\nAs Ronnie leaves the mansion, he remembers that Kismet has kept his handgun. Ronnie climbs up a tree and looks into a window, and sees the \"Uncle\" stand up out of the wheelchair and walk around the room. As Ronnie snaps a photo of this fake uncle through the keyhole, Kismet, who has followed him, throws a knife at him. Ronnie flees to his car and roars out of the mansion grounds. The others chase him by car and shoot out his tire. Ronnie runs into an apartment and intercoms himself in by saying the he is \"Joe\", and many women buzz him in.\nBack at his office, Ronnie develops the keyhole photo showing the \"Uncle\" walking about. Kismet has followed him there, and as Ronnie is calling the police, slugs him over the head, and burns the photo and what he thinks is the negative. When Ronnie comes to, a lady customer arrives to pick up her baby's photograph, and Ronnie gives her what he thinks is her baby's negative.\nRonnie summons the police and drives back to the mansion with them. The mansion is deserted, and Kismet poses as the gardener for the owners, who are out of the country. The police apologize to Kismet for the interruption. (This scene would be repeated years later by Alfred Hitchcock in his film \"North By Northwest\" with Cary Grant.) Montague gives Kismet Carlotta's ring with a note attached to leave as a 'clue' for Ronnie to discover. Ronnie returns to the mansion and finds the clue, which is a card for the Seacliffe Lodge in Carmel. Ronnie drives to the Lodge, which is really a sanitarium. After a bizarre golf match with an inmate and an imaginary golf ball, Ronnie is captured by the Montague gang and locked in a room at the sanitarium. Carlotta is also prisoner there. Montague explains that Carlotta's uncle had turned down his offer to buy mineral rights in some land. Carlotta's real uncle is then wheeled into the room to prove he is unhurt. He asks Carlotta to light his cigarette,then puts it out and gives her the cigarette. Ronnie refuses to reveal the whereabouts of the coded map, so Kismet slugs him. Carlotta tells them falsely that the map is in a water cooler cup at the Ferry Building, about an hour away. Montague sends a stooge to the Ferry Building to get the map. In her room Carlotta unwraps the cigarette from her uncle and the note on the paper says to see a 'James Collins', a scientist. Ronnie and Carlotta are able to knock out a nurse and flee from the sanitarium. Back at his office Ronnie gives Carlotta the map. They call James Collins' office and arrange to meet him at a restaurant that night. (Why didn't they call the police and tell them that Carlotta's uncle was being held at the sanitarium?) A stooge for the bad guys has followed them and overhears their arrangements.\nThey meet the scientist, James Collins, at the restaurant and show him the map. Collins says that he made the coded map, which depicts cryolite deposits from which uranium can be mined. He says that Carlotta's uncle had scheduled an important meeting with the government at the Pilgrim Hotel in Washington. Collins takes the map and Ronnie drives him to the police station. As Ronnie drives up to the police station, Kismet, who is hiding in the back seat with Ronnie's gun, shoots Collins and takes the map out of his pocket. Ronnie and the dead Collins are spotted by the police, and Ronnie flees the scene. He is now wanted for the Collins murder.\nCarlotta and a disguised Ronnie fly to Washington and go to the Pilgrim Hotel. They answer a help wanted ad and sign up as a bellboy and a maid at the hotel. In the gang's suite, they record the gang's confessions on a recording machine, including Kismet's confession that he murdered Collins. But when the police are called, Kismet switches the records and throws the incriminating record out the window. Montague points out to the police that Ronnie is wanted for the Collins murder in San Francisco. Ronnie is arrested and taken away; the gang still has the map and Carlotta's real uncle.\nThe flashback ends. Ronnie is on death row, and curses Carlotta for disappearing and not testifying at his trial for Collins' murder. When the prison warden comes to get Ronnie from his death row cell, Ronnie faints. When he comes to, Carlotta is there, and tells him that he is a free man. Ronnie had mistakenly given the keyhole photo negative to his customer. The photo from that negative revealed the uncle to be an imposter. Carlotta said that detective Sam took that lead, and 'the rest was routine'. Ronnie was cleared. Carlotta's uncle was saved.\nThe warden tells the executioner that the execution was cancelled. The executioner (Bing Crosby) curses and walks away. Ronnie and Carlotta embrace."}