{"mid": "MyGirl", "IMDB_id": "tt0102492", "title": "My Girl", "plot": "In the summer of 1972, Vada Sultenfuss is an 11-year-old girl and a hypochondriac. Harry Sultenfuss, Vada's father, is an awkward widower and funeral director who does not understand his daughter, so he constantly ignores her. Their house, which operates as the town funeral home, has led his daughter to develop an obsession with death. Vada regularly tends to her grandmother, ‘Gramoo’, who suffers from Alzheimer's disease and whose wandering mind likewise affects Vada. Her Uncle Phil lives near by and frequently stops by to help the family.\nVada hangs out with her best friend Thomas J. Sennett, an unpopular boy her age who is allergic to \"everything.\" However, other girls except Judy tease the two, thinking they are more than just friends. Thomas J. often accompanies Vada when she visits the doctor, who assures her that she is not sick and that she has no chicken bone stuck in her throat.\nVada's summer begins well. She befriends Shelly DeVoto, the new makeup artist at her father's funeral parlor, who provides her with guidance. She also develops a crush on her fifth-grade school teacher, Mr. Bixler, and hears about an adult poetry writing class that he is teaching. Vada steals some money from the cookie jar in Shelly's trailer to cover the cost of the class. When advised to write about what is in her soul, Vada fears that she killed her mother, who died two days after giving birth to her. Soon things start to fall apart.\nWhen Harry and Shelly start dating, this affects Vada's attitude towards Shelly. One night, Vada follows Harry and Shelly to a bingo game and brings Thomas J. along to disrupt it. On the Fourth of July, when Shelly's ex-husband Danny arrives, Vada hopes that he is there to take Shelly back, but to no avail. Vada becomes even more shocked when Harry and Shelly announce their engagement at a carnival, which she contemplates into running away with Thomas J.\nVada is starting to see changes within herself, as she is running around screaming that she is hemorrhaging. Shelly politely explains to Vada that her first period is a completely natural process. As Vada realizes this only occurs with girls, she doesn't want to see Thomas J., who happens to come by shortly afterward. A couple of days later though, Vada and Thomas J. are sitting under a tree by the river, where they share an innocent first kiss.\nVada and Thomas J. come across a bee hive hanging from a tree, which Thomas J. decides to knock down. Vada loses her mood ring in the process, so they start looking for it, but the search is cut short as the bees start swarming, making them run away. Thomas J. later returns by himself and finds the ring. Unfortunately, because he kicked the bee hive beforehand, the bees begin to swarm Thomas J. just as he finds the ring. Unable to escape he dies from an allergic reaction.\nHarry is left to deliver the tragic news to Vada, which devastates her so much that she will not even leave her bedroom. When she attends Thomas J.'s funeral, her emotions become so strong that she runs away. Vada hurries to Mr. Bixler's house, wanting to stay with him, and discovers that he is about to get married to someone else. She then runs to her and Thomas J.'s hangout spot near the tree to reflect on what has happened. When Vada returns home, everyone is relieved, including Shelly, whom Vada begins to accept as her future stepmother. Her grief also manages to mend the rift between her and her father. Harry explains to Vada that her mother's death wasn't her fault and things like that can happen without explanation.\nToward the end of summer, Vada and her father see Mrs. Sennett, who still struggles with her son's death. She gives Vada her mood ring back that Thomas J. had found and Vada gives Mrs. Sennett some comfort. On the last day of writing class, Vada reads a poem summoning the loss of her best friend before going out to spend time with her new friend Judy."}