{"mid": "MyNameIsNobody", "IMDB_id": "tt4018316", "title": "My Name Is Nobody", "plot": "Jack Beauregard (Henry Fonda) is an aging gunslinger who wants to retire peacefully to Europe. The film opens with three gunmen attempting to ambush him in a barbershop. After he has dispatched them, the barber's son asks his father if there is anyone in the world faster than Beauregard, to which the barber replies, \"Faster than him? Nobody!\"\nBeauregard pauses on his way to watch a bum (Terence Hill) catching fish. He then carries on to an old goldmine, only to find a dying acquaintance (Red), who has just been shot by a gang. Beauregard asks about the whereabouts of a certain Nevada, but Red only manages to disclose Nevada's village.\nAt a horse relay station, the bum is asked by three men to deliver a basket to someone inside who turns out to be Beauregard. The bum impresses Beauregard with his knowledge of the latter's track record, and then throws the basket outside. This contained a bomb and explodes. The bum identifies himself as ‘Nobody’. He idolizes Beauregard and wants him to end his career in beauty by facing off the 150 members of the Wild Bunch single-handed. The bandits are using a fake goldmine to launder their gold train loot. The mine owner (Sullivan) thinks Beauregard is out to kill him, and so tries to get him first. The Wild Bunch, however, want Sullivan to focus on keeping his reputation clean.\nAt Nevada’s village, Beauregard is awaited by ‘Nobody’, who reveals that Nevada is dead. It turns out that Nevada was Beauregard's brother. Again ‘Nobody’ challenges him to face the Wild Bunch. Again Beauregard declines, and chides ‘Nobody’ for drawing attention to himself with his shining saddle decorations.\n‘Nobody’ arrives at a saloon town where Sullivan tries to bribe him to kill Beauregard. Instead he helps Beauregard to do away with Sullivan's men. Then the Wild Bunch rides into town to collect sticks of dynamite, caching them in their saddles bags. Later an old resident tells Beauregard that he was bought out of a derelict gold mine by Nevada and Red, only to find the mine producing prodigious amounts of gold afterwards. Beauregard hurries off to the mine and catches Sullivan loading sacks of gold powder. Sullivan offers Beauregard Nevada's share in the mine but Beauregard tells him he couldn't care less about his brother, and just takes two sacks, as well as $500 out of Sullivan's wallet to pay for his passage to Europe. He then leaves to catch a train to New Orleans.\nA train is being loaded at a station with bars of gold, under the protection of US troops, when ‘Nobody’ arrives, tricks the engineer and steals the train. Beauregard is waiting down the line when the Wild Bunch advances over the desert. ‘Nobody’ arrives with the stolen train but refuses to rescue Beauregard until he ‘makes his name in the history books’. Remembering the mirrored conchas on the gang’s dynamite-filled saddlebags, Beauregard aims at them. One by one they explode, blowing up most of the charging gang until ‘Nobody’ allows him to escape.\nIn New Orleans, Beauregard and Nobody finally face each other in a street duel, with a photographer on hand and lots of spectators. ‘Nobody’ draws faster and Beauregard falls to the ground. A sign is put up reading \"Jack Beauregard, 1848–1899, Nobody was faster on the draw”, which the remaining members of the Wild Bunch see and transfer their search to the anonymous ‘Nobody’. Three days later ‘Nobody’ walks by the ship that was to take Beauregard to Europe. However, it is revealed that Beauregard is in his cabin writing ‘Nobody’ an affectionate farewell and leaving him to survive in his own playful and unheroic way."}