{"mid": "MysteryTeam", "IMDB_id": "tt1237838", "title": "Mystery Team", "plot": "The Mystery Team consisting of \"Master of Disguise\" Jason Rogers (Donald Glover), \"Boy Genius\" Duncan Wheeler (DC Pierson), and \"The Strongest kid in town\" Charlie Day (Dominic Dierkes) began with three children who styled themselves as detectives, solving mostly kid-related mysteries such as missing cats or a lost baseball, but also gaining some local fame. Somehow, the trio have remained as naïve as ever, although they are about to graduate from high school. They have continued the same mindset and antics even though they are teenagers, focusing on children's infractions, although adults (such as their parents) wonder when the teens will grow out of this attitude.\nTo prove to themselves and the town at large that they can be \"real detectives\", the Mystery Team take it upon themselves to solve a double homicide when they are hired by a young girl named Brianna (Daphne Ciccarelle) to discover why her parents were killed. Although Duncan and Charlie reluctant to help her, Jason convinces them to help to her stating that it is their chance to prove they can be real detectives and earn everyone's respect. Then they meet Brianna's older sister Kelly (Aubrey Plaza), whom Jason becomes attracted to, and tells them let the cops handle it. They ignore her, and go to the local grocery store, where they are told by their Jordy (Bobby Moynihan) that a hobo named Sam know may know something. They given stuff from Kelly's house from Sam and find a card from a local bowling alley with symbol engraved in it. They go to the bowling alley where they meet a clerk who has a grudge against them and refuses to scan the card. However, they spot a guy named Dougie who the card belongs to and see that he's wearing Kelly's ring. They follow Dougie to a local gentlemen's club were a bouncer attempts to throw them out for spying on Dougie and a stripper with him. However, they escape from the bouncer and Jason overhears Dougie saying that someone named Leroy gave him Kelly's ring and the ring is now in the stripper's vagina. He, Duncan and Charlie then retrieve the ring from the toilet the stripper urinated it into and escape from the gentlemen's club before the bouncer catches them.\nAfter returning the ring to Kelly, they go back to Jordy, who tells them about Dougie and who Leroy is. Leroy Maddox (Peter Saati) is a dangerous drug dealer used to work at the local lumber yard. After learning his address at the lumber yard, they go to his house claiming to want to buy drugs from him. Jason sneaks away hears Leroy arguing with someone on the phone about finding some papers. After going to Kelly's house to find the papers. He finds Kelly there and they both find a paper that states something called Iphedolene is extremely toxic. However, Leroy, who become suspicious of Duncan and Charlie, shows up at Kelly's house and takes them hostage but they manage to escape. After Kelly thanks Jason, who promises to tell everything to the police, he, Duncan and Charlie return the lumber yard to where find they find Leroy and his girlfriend's dead bodies. A horrified Duncan then decides to give up despite Jason's objections. He and Charlie then reveal to Jason that they are going to college and leaving him, as he didn't apply. After a fed up Duncan and Jason get into a fight, he and Charlie abandon Jason. After going to talk to Kelly and Brianna, their dad's friend Robert Finney, who they have been staying with since parents' death, helps fix his damaged bike. However, Jason realizes that Robert was the one he heard Leroy arguing on the phone with and quickly leaves.\nAfter going to a police officer, who tells Jason he needs proof to believe him, he goes to the Holden and Charles Corporation, where Robert works and Kelly's father worked, but not before attempting to warn Kelly about Robert on a walkie-talkie he give her, not knowing that Robert has it. At Holden and Charles, Jason bonds with two employees Jim and Frank, who get him drunk and give advice on asking Kelly out. After sneaking into Robert's office and learns that Robert is trying to treat wood with the toxic substance Iphedolene. Kelly's father, who was lawyer, learned this and was going to ruin the company and Robert, which is the reason Robert hired Leroy to scare him, not kill him. When Leroy kept asking for money he killed him too. Duncan and Charlie, who heard Jason talking about Robert on a walkie-talkie, also show up to help him. The three are then confronted by Robert, but they manage to escape. After Jason makes up with Duncan and Charlie, Robert, who has taken Kelly hostage, uses the walkie-talkie to contact them into bringing the papers he needs to the lumber yard. After they give him the papers, Robert holds them at a gunpoint to kill them. When Jason tries to reason with Robert, he shoots him, but Charlie attacks him allowing the others escape. When Jason, who admits his feelings for Kelly and kisses her, finds a firecracker Jordy gave to him earlier and gives it to Duncan who lights it and shoots it at Robert with his slingshot severely damaging his face. The police show up and Jason has wound tended to (off screen).\nMonths later, Jason is recovering from his gunshot wound, and thanks to Jim has a job in medical technologies and his parents have adopted Brianna. While Kelly is at Dartmouth College, but is still together with Jason. After Jason says goodbye to a departing Duncan and Charlie, a man comes out of the woods needing help. The film ends the guys getting ready for another mystery in excitement while the man shouts in anguish."}