{"mid": "MysteryOfTheWaxMuseum", "IMDB_id": "tt0024368", "title": "Mystery of the Wax Museum", "plot": "Ivan Igor (Lionel Atwill) is a sculptor who operates a wax museum in 1921 London. He gives a private tour to a friend and an investor, showing them sculptures of Joan of Arc, Voltaire, and his favorite, Marie Antoinette. Formerly a stone sculptor who did wax modeling as a hobby, he explains he turned to wax sculpting completely because he felt more \"satisfied\" that he could reproduce \"the warmth, flesh, and blood of life far better in wax than in cold stone\". The investor, impressed by his sculptures, offers to submit Igor's work to the Royal Academy after he returns from a trip.\nUnfortunately business at the museum is failing due to people's attraction to the macabre (a nearby wax museum caters to that). Igor's partner Joe Worth (Edwin Maxwell) proposes to burn the museum down for the insurance money of £10,000. Igor won't have it, but Worth starts a fire anyway. Igor tries to stop him, and he and Worth get into a fight. As they fight, wax masterworks are melting in the flames. Worth knocks Igor unconscious, leaving the sculptor to die in the fire. Igor survives, however, and reemerges 12 years later in New York City, reopening a new wax museum. His hands and legs have been badly crippled in the fire, and he must rely on assistants to create his new sculptures.\nMeanwhile, spunky reporter Florence Dempsey (Glenda Farrell), on the verge of being fired for not bringing in any worthwhile news, is sent out by her impatient editor, Jim (Frank McHugh), to investigate the suicide of a model named Joan Gale (Monica Bannister). During this time, a hideous monster steals the body of Joan Gale from the morgue. When investigators find that her body has been stolen, they suspect murder. The finger initially points to George Winton (Gavin Gordon), son of a powerful industrialist, but after visiting him in jail, Florence thinks differently.\nFlorence's roommate is Charlotte Duncan (Fay Wray), whose fiancé Ralph (Allen Vincent) works at Igor's new wax museum. While visiting the museum, Florence notices an uncanny resemblance between a wax figure of Joan of Arc and the dead model. At the same time, Igor spots Charlotte and remarks on her resemblance to his sculpture of Marie Antoinette.\nIgor employs a couple of shady characters: Prof. Darcy (Arthur Edmund Carewe), a drug addict, and Hugo (Matthew Betz), a deaf-mute. Darcy also works for Joe Worth, now a bootlegger in the city, among whose customers is none other than Winton.\nWhile investigating an old house where Worth keeps his bootlegged alcohol, Florence discovers a monster connected with the museum, but cannot prove any connection with the disappearance of Joan Gale's body. Darcy is seen running from the house and is caught by the police. When brought to the station, he eventually breaks down and admits that Igor is in fact the killer and that he has been murdering people (including a missing judge whose watch was found on Darcy's person), stealing their bodies, and dipping them in wax to create lifelike statues.\nCharlotte, visiting Ralph at the museum, is trapped there by Igor, who it is revealed can still walk. When Charlotte tries to get away, she pounds away at his face, breaking a wax mask that he has made of himself, to reveal that he had been horribly disfigured. He also shows her the dead body of Joe Worth, whom Darcy had been tracking down for him for some time. When she faints, he ties her up and sets her on a table, intending to douse her with molten wax and make her his lost Marie Antoinette. Florence leads the police to the museum just in time: for a man supposedly crippled by fire, Igor moves with surprising speed and agility, successfully fighting off the police, but is finally gunned down. He falls into a giant vat of wax, which was intended for Charlotte. Charlotte is saved when Ralph moves away the table she is tied to from where the wax is about to pour onto her.\nWhen Florence reports her story to her editor, Jim, he proposes to her. Having to choose between money (Winton) and happiness (Jim), she picks the latter."}