{"mid": "MySuperPsychoSweet16", "IMDB_id": "tt1488584", "title": "My Super Psycho Sweet 16", "plot": "Madison Penrose (Julianna Guill) prepares for her sweet sixteen. She wants to have her birthday party at the Roller Dome, a once popular roller skating rink with a violent history to match. She and her parents go so far as to hire a party planner (Jacob Gentry). A few days before the party, while alone in the roller rink, the party planner hears a strange noise. The scene then flashes back to 1999, where Charlie Rotter (Alex Van) is the owner and entertainer of the Roller Dome (he is known as \"Lord of the Rink\" and dresses in costume attire). One day, Rotter is humiliated by an ungrateful teenage boy named Craig (Damien Haas), who slaps a cake out of Rotter's hands and rips his mask off in front of everybody, including his six-year-old daughter, Skye (Lauren Eichner).\nLater that night, Craig and his girlfriend, Karen, break into the Roller Dome, where they are brutally murdered by the \"Lord of the Rink\". Young Skye witnesses the murders and calls the police. They find him in the basement and, upon arresting Rotter, discover that four more bodies have been dismembered and stuffed into an oil bin. While on his way to prison, the van crashes and burns, and Rotter appears to have died.\nTen years later, Skye Rotter (Lauren McKnight) is an outcast, tortured by her classmates because of what happened a decade ago. One day, she has a \"moment\" with Madison's ex-boyfriend, Brigg (Chris Zylka). That same day, after swimming class, Skye finds out that her gym locker has been trashed by Madison and her friends Olivia (Maia Osman) and Chloe (Susan Griffith). Madison's friend Lily (Leandra Teranzzano) tells Skye who trashed her locker. Lily admits that she actually dislikes Madison, and that the reason why Madison is attacking Skye is because Skye flirted with Brigg. She tells Skye to hook up with Brigg to get revenge on Madison at her sweet sixteen party.\nSkye, in nothing but a towel and a one-piece bathing suit, tries to leave the building, but she is interrupted by Madison, Olivia, and Chloe. In addition to warning Skye about staying away from Brigg, Madison calls Skye a nobody and says that the yearbook would not waste space on her if she died. Afterward, Skye begins walking home in her swimsuit and towel. Brigg drives by her, slows down, and offers her a ride home. While driving, Brigg asks Skye to hang out Saturday night.\nThe next day, Madison hands out invitations to her Sweet Sixteen. Having invited Brigg, it interferes with his plans with Skye. Brigg goes to Skye's house and explains to her that he has to go because he and Madison have history, and that he will make it up to Skye. Skye tells him that they both know that this isn't going to work because he is popular and she is not. Brigg kisses Skye and lets her know that he wants to spend more time with her after the party, and he promises that they will go out. When Brigg leaves, Skye's best friend Derek walks out onto Skye's porch and asks if she was just talking to Brigg. Skye then asks Derek if he still wants to crash Madison's party.\nLily leaves a secret opening for Skye and Derek behind the roller rink, and the two sneak in without a hitch. Things seem fine at first, until the party planner is killed by Charlie Rotter, who survived the crash. Skye finds Brigg and they skate together. Derek and Lily are chatting, and she asks him to go get some fruit punch to mix with her vodka so they can party. Derek walks off to go get the punch, but Brigg's friend Kevin (Joey Nappo) sees him and locks him in the basement. After warning Madison of Derek and Skye's appearance, Kevin takes Rotter's \"Lord of the Rink\" costume and decides to play a trick on Skye by standing up in the mezzanine of the Roller Dome. Skye spots Kevin, thinks that he is actually her father, and then runs to him. Kevin laughs and mocks her as he starts to leave the mezzanine. He is then choked and bludgeoned to death by Rotter, who then finds his mask on the floor and puts it on.\nDerek, still locked in the basement, is let out by Lily, who is drunk and ends up making out with him. Chloe has a plan of hiding in the bathroom stall with a fire extinguisher and assaulting Skye with it. Olivia proceeds to dump one of her drinks on Skye's lap so that she will have to wash up in the bathroom that Chloe is hiding in. Brigg, trying to find Skye, ends up in the VIP room and is ambushed by Madison, who throws herself at him and kisses him. Skye walks in on them and leaves the room upset. Brigg then tells Madison that he doesn't want her and leaves. Meanwhile, Chloe is waiting for Skye, and hears who she thinks is Skye walking in. She comes out, spraying the extinguisher at Rotter instead. Annoyed, he takes the extinguisher out of her hand and beats her to death with it.\nLily decides to key Madison's car for a birthday present. While she is keying the words \"Happy Sweet 16\" into the hood, the car revs up and starts chasing after her. She is rammed into a brick wall but escapes. She runs up to a stairwell, and tries to escape to the street ahead by trying to climb over a gate. Rotter catches up to Lily and kills her by slitting her throat with a sword. Skye runs off to her father's old office and calls Derek, letting him know that she wants to leave. Brigg then finds Skye and tries to explain what happened, but Skye wants to hear none of it.\nWhile Madison's birthday cake is being brought out, Olivia goes to the bathroom to find Chloe, thinking that she's hooking up somewhere. Upon entering the stall next to where Chloe was murdered, Olivia discovers Chloe's body on the floor. She tries to warn everyone else, but Rotter appears and decapitates her, and her headless body skates and collides with Madison's birthday cake. Frightened, everyone leaves, except for Madison and Skye. Madison accuses Skye of ruining her party because of her relation to Rotter. While running, they find that Rotter has gutted the party planner. Brigg runs back in for Skye, and they run up to the mezzanine with Rotter in pursuit. Derek flashes the spotlight in Rotter's face, temporarily blinding and distracting him while Skye and Madison escape. As the girls reach the dance floor below, Brigg is thrown from the mezzanine above. As Skye, Derek, and Madison run out, Rotter grabs Madison and slams her head into a party table, knocking her out. Rotter catches up to Skye and Derek at the door and strangles Derek. Skye begs her father to spare him, and Rotter does so by throwing him out of the door, locking Madison, Skye, and himself inside.\nMadison wakes up in the basement with Skye, their hands both tied to a table. Skye tells Madison that she is a \"bully.\" Rotter unties Skye, gives her a knife, and tells her to kill Madison, wanting her to be a killer like him. But Madison manipulates Skye into refusing and stabbing Rotter in his leg with the knife, then dropping a cabinet on him, injuring and stunning him. She then tries to untie Madison. Madison insults her while they try to escape. Once untied, Madison selfishly knocks over Skye in order to get to the door, but Rotter reaches out and trips her. Learning Madison's evil heart, Skye locks Madison in with Rotter, telling her, \"Have a super birthday, Madison.\" As Rotter gets up, Madison furiously screams insults at Skye as she goes up the steps. Rotter then slits Madison's throat, and he places her body in a chair with a party hat on her head and a very small cake with a lit candle in front of her. Skye leaves the building and meets Derek outside, who is excited to see that she is okay. Skye leaves town in Madison's new car as police arrive at the scene but Rotter is gone by the time they get there.\nA few days later, Brigg has a bad dream that he wakes up injured in the hospital. Skye tells him that he's been out for days, and that she came back for him. Then she stabs him to death while crying to her father. He frantically awakes from the nightmare in the hospital. He says that he wants to see Skye, but the nurse tells him that no one has seen her. Saddened, he turns over on his side, only to see a picture that Skye drew on the table next to him, revealing that she was in the room while he was unconscious."}