{"mid": "MyWinnipeg", "IMDB_id": "tt1093842", "title": "My Winnipeg", "plot": "Although ostensibly a documentary, My Winnipeg contains a series of fictional episodes and an overall story trajectory concerning the author-narrator-character \"Guy Maddin\" and his desire to produce the film as a way to finally leave/escape the city of Winnipeg. \"Guy Maddin\" is played by Darcy Fehr but voiced by Maddin himself (in narration): Fehr appears groggily trying to rouse himself from sleep aboard a jostling train as Maddin wonders aloud \"What if?\" What if he were able to actually rouse from the sleepy life he lives in Winnipeg and escape? Maddin decides that the only possible escape would be to \"film my way out,\" thus motivating the creation of the \"docu-fantasia\" already underway.\nMaddin then describes Winnipeg in general terms, introducing it to the viewer, noting primarily its location at the junction of the Red and Assiniboine rivers, a place known as \"the Forks\". Maddin equates this Y-like junction to a woman's groin and associates it with his mother. Maddin also notes the apocryphal aboriginal myth of a secret \"Forks beneath the Forks,\" an underground river system below the aboveground river system—the superimposition of these two sets of rivers has imbued the site and Winnipeg itself with magical/magnetic/sexual energy. Maddin also notes that Winnipeg is the geographical centre of North America, and thus these secret rivers are \"the Heart of the Heart\" of the continent and of Canada. Maddin regales the viewer with one of the film's many suspect historical \"facts\" about Winnipeg: \"the Canadian Pacific Railway used to sponsor an annual treasure hunt [that] required our citizens to wander our city in a day-long combing of the streets and neighbourhoods. First prize was a one-way ticket on the next train out of town.\" No winners in a hundred years could bring themselves to leave the city after coming to know the city so closely over the course of the treasure hunt. Maddin then posits an alternative explanation for Winnipeggers never leaving Winnipeg: sleepiness. He notes that Winnipeg is the sleepwalking capital of the world, with ten times the normal rate of sleepwalking, and that everyone in Winnipeg carries around the keys to their former homes in case they return while asleep. Winnipeg by-laws require that sleepwalkers be allowed to sleep in their old homes by the new tenants.\nMaddin rents his own childhood home at 800 Ellice Avenue for a month, hiring actors to play his family (including Ann Savage as his mother) in order to recreate scenes from his childhood memories, excluding his father and himself. The \"family\" gathers to watch the television show LedgeMan, a fictional drama in which \"the same oversensitive man takes something said the wrong way, climbs out on a window ledge, and threatens to jump.\" His mother, in the next window, convinces him to live. Maddin's mother is noted as the star of the show. The film recounts the conditions of the 1919 Winnipeg General Strike, a real-world event with international significance, before returning to the family re-enactments, including Mother's suspicion of Janet Maddin, who hit a deer on the highway but is accused of covering up a sexual encounter. Maddin announces that this, like \"everything that happens in [Winnipeg] is a euphemism.\" The film then recounts the city's history of Spiritualism, including a visit by Sir Arthur Conan Doyle in 1923. The film next examines Winnipeg architectural landmarks, including the Eaton's building and the Winnipeg Arena, both of which are demolished (while the arena is being destroyed, Maddin becomes the last person to urinate in its washroom). Maddin imagines the arena's salvation by the \"Black Tuesdays,\" a fictional team of hockey heroes \"in their 70s, 80s, 90s and beyond,\" then re-enacts a family scene where Mother is harassed to cook a meal.\nThe film recounts a racetrack fire that drove horses to perish in the Red River—the horse heads reappear, ghostly, each winter, frozen in the ice. Further Winnipeg landmarks, including the Golden Boy statue atop the provincial legislative building, the Paddle Wheel restaurant, the Hudson's Bay department store, and the Manitoba Sports Hall of Fame, make appearances in distorted versions of themselves, as does the Sherbrook Pool. The film then recalls If Day (an actual historical event when a faked Nazi invasion of the city was mounted during World War II to promote the sale of war bonds), and a buffalo stampede set off by the mating of two gay bison. Time is now running out for Guy Maddin, who fears he will never leave Winnipeg, since the family re-enactments have failed to free him fully. To accomplish this feat of leaving, Maddin imagines a pinup girl for the 1919 strike's newsletter The Citizen: dreaming up this \"Citizen Girl\" allows Maddin to leave Winnipeg in her capable hands, guilt-free. The final family re-enactment then involves Maddin's brother Cameron, who in real life committed suicide, rationalizing this death calmly in a discussion with Maddin's \"Mother.\""}