{"mid": "NakedFear", "IMDB_id": "tt0943326", "title": "Naked Fear", "plot": "The story begins with a naked woman in the middle of nowhere, obviously under duress. She falls after being shot. A man walks up behind her and executes her with a pistol.\nThe story then shifts to Diana, a young and gorgeous dancer starting a new job in a nightclub. She's lured to a small town in New Mexico with promises by club owner Jack to pay her well for performing on stage at his club with later prospects of working in Las Vegas. Fred, Jack's agent, pays for her airfare, puts her up in a motel, takes her driver's license, charges her back for his expenses with interest, and threatens her references should she flee. Unable to make enough money dancing, she falls deeper into debt until she is forced into prostitution. Soliciting her first \"client\" Colin Mandel, she gets in his jeep but at the last minute she changes her mind, only for Mandel to choke her unconscious.\nDiana wakes up naked in a field. She spots an airplane nearby and walks towards it. As she gets closer, she sees Mandel stowing his gear, so she hides behind a tree trunk. Hearing her approach, he tells her that he's giving her a fifteen-minute start. He fires a bolt near her as a warning and she turns and runs into the wilderness.\nThe boomtown population is highly transient and it's not unusual for people to go missing. However, Dwight Terry, a recently hired sheriff deputy—who had lost a previous job due to arresting a prominent person—is concerned about the disappearance of Diana (and other women from the club), and begins to question Jack. Jack denies any involvement, saying he has enough trouble getting girls to perform at his club.\nDwight begins to question the club owner's business, but is warned off by Sheriff Tom Benike. He realizes that he's on his own in solving the case. His wife is similarly unsupportive, fearing he might lose his job over \"some slut.\" He breaks into Mandel's home, whom he suspects of being responsible for the disappearance. He is stopped by Benike, who had been alerted to a possible break-in by a neighbor.\nDiana is spotted by Mandel multiple times but she manages to lose him over and over. He even shoots a poisonous snake before it can strike her, denying her the \"easy way out\". She climbs up a cliff. Mandel sees her and begins to climb up after her. As he reaches the top, she appears holding a large rock over her head, which she throws down on Mandel, causing him to fall.\nShe stumbles upon a man and his two sons who are out hiking. Diana collapses, unable to speak. The father takes her to their tent, where she falls asleep. He sees her wounds and realizes that something happened to her. After praying with his sons, he leaves to seek help.\nMeanwhile, Mandel has regained consciousness and resumes his hunt, following Diana to the camp. After attempting to persuade the boys to allow him to take Diana with him (ostensibly to fly her to the hospital in his plane), Mandel kills them. Diana takes Mandel's gun, only to discover it's uncocked. He advances on her, but Diana stabs him in the leg, bites his ear off and runs off again, finding the father's corpse along the way.\nDiana finds a road and is hit by two young men driving a van. Following a brief skirmish, she manages to run down and finally kill Mandel with the van. After driving back to town, she is taken to a hospital, but the experience has left her much like a dangerous animal, wary of human kindness. Dwight brings her flowers and is told that she's chewed through her restraints and escaped.\nTen months later, posing as a prostitute, Diana lures a man and kills him, stepping out of his car and walking away. A news report attributes the resulting dozens of killings of sex offenders to a Vigilante dubbed \"The Southwest Slayer.\""}