{"mid": "NationalLampoonsEuropeanVacation", "IMDB_id": "tt0089670", "title": "National Lampoon's European Vacation", "plot": "The Griswald family competes in a game show called Pig in a Poke and wins an all-expenses-paid trip to Europe. In a whirlwind tour of western Europe, chaos of all sorts ensues. They stay in a fleabag London hotel with a sloppy, tattooed Cockney desk clerk. While in their English rental car, a yellow Austin Maxi, Clark drives the family around the busy Lambeth Bridge roundabout for hours, unable to maneuver his way out of traffic. His tendency to drive on the wrong side of the road causes frequent accidents, including knocking over a bicyclist, who reappears throughout the film. At Stonehenge, Clark backs the car into an ancient stone monolith, toppling all the stones like dominoes, which they do not even notice as they happily leave the scene.\nIn Paris, the family wears stenciled berets, causing Rusty to be teased by young women at the Eiffel Tower observation deck. Clark offers to get rid of the beret for Rusty, but when he throws it away, another visitor's dachshund mistakes it for a Frisbee and jumps off the tower after it. Later, Rusty meets an exotic dancer at a bawdy Paris can-can dance show. The family's video camera is stolen by a passerby whom Clark had asked to take a picture of the family. Clark also angers a French waiter with his terrible French, making him say, in French \"Go fuck yourself\".\nNext, in a West German village, the Griswalds burst in on a bewildered elderly couple, who they mistakenly think are relatives but who end up providing them dinner and lodging anyway, not being able to understand the other's language. Clark turns a lively Bavarian folk dance stage performance into an all-out street brawl, after which, while fleeing, he hastily knocks down several street vendors' stands and gets their Citroën DS stuck in a narrow medieval archway.\nIn Rome, the Griswalds rent a car at a travel office, but unknown to them, the men in charge are thieves, holding the real manager captive. The lead thief gives them a car with the manager in the trunk, claiming he lost the trunk keys. The next day Ellen is shocked to discover that private, sexy videos of her from the family's stolen video camera have been used in a billboard advertising porn, leaving her completely humiliated. After screaming angrily at Clark (who had told her he had erased the video), Ellen storms off to their hotel, where she encounters the thief who rented them the car. She confesses her recent troubles, still unaware that he is a criminal. The man then tries to get the car keys, which are in her purse, but fails. When the police arrive at the hotel, he kidnaps Ellen, prompting Clark to rescue her. On the flight back to the U.S., Clark accidentally causes the plane to knock the Statue of Liberty's torch upside down."}