{"mid": "NationalLampoonsVacation", "IMDB_id": "tt0085995", "title": "National Lampoon's Vacation", "plot": "Clark Griswold (Chevy Chase) is a food processing salesman living in Chicago, Illinois who wants to spend more time with wife Ellen (Beverly D'Angelo) and his teen children Rusty (Anthony Michael Hall) and Audrey (Dana Barron). So, he decides to lead the family on a cross-country expedition from Chicago to the Los Angeles amusement park, \"Walley World\", billed as \"America's Favorite Family Fun Park\". In the opening scene, Clark and Rusty drive to a local car dealer lot where he decides to purchase a new sports wagon for the cross-country drive. But the conniving salesman Ed (Eugene Levy), tells him that the car he ordered never arrived and scams Clark into taking in its place a more gas-guzzling, technicaly failing, behemoth station wagon called the Wagon Queen Family Truckster. Clark refuses to be conned, but after his old station wagon is \"accidentally\" crushed by a compacter machine, Clark is left with no choice but to take the Family Truckster.At home, although Ellen tells Clark that she wants to fly to California for their two-week vacation, he insists on driving, so he can bond with his family. The next day, the family packs into their new car for the long drive to California, only to have all their luggage chained to the top of the station wagon fall off after they back out of the garage... a bad omen of things to come.During the first day's drive, Clark and Ellen try to ease the boredom by singing old folk songs including the so-called Wally World National Anthem. Rusty and Audrey take their escape by listening to their radio walkmans of their favorite rock group The Ramones. While stopping for a fill up at a gas station, Clark cannot find the gas tank opening, and accidentally tears off the station wagon's license plate to search for it.Later that same day, the family arrives in St. Louis, Missouri, but after crossing the Mississippi River into the city, they get lost and end up in a rough ghetto area where some local street hoodlums steal their hubcaps and spray paint graffiti on one side of their car while giving them sham directions back onto the local expressway.While driving late at night on the interstate west of St. Louis, all of the family falls asleep... including Clark driving in which their car exits the road and drives through a residential neighborhood before stopping for the night at a local motel.On the second day of the vacation (Day 2), the family arrives in Dodge City, Kansas without further incident where Clark falls victim to another tourist trap when he insults the local bartender at a tavern, and gets shot with a round of blanks. Back on the road, Clark is tempted by a hot young woman (Christie Brinkley) driving a flashy red 1983 Ferrari 308 GTS.That afternoon, the Griswalds arrive at a farm outside of Coolidge, Kansas to visit Ellen's cousin Catherine (Miriam Flynn) and her eccentric husband Eddie Johnston (Randy Quaid), and their five kids, plus one on the way, but this creates more tension among the Griswalds. Catherine and Eddie foist crotchety old Aunt Edna (Imogene Coca) and her vicious dog, Dinky, on the Griswolds, asking them to drop her off at her son Normy's home in Phoenix, Arizona. Eddie also asks for a loan of $500 to help him out with numerous debits he owns the local bank and many bill collectors. The kids have better experiences with Eddie and Catherine's eldest kids. Cousin Vicki (Jane Krakowski) shows Audrey her secret pot stash, while Cousin Dale (John Navin) shows Rusty his secret porn magazine collection.The next day (Day 3), the Griswalds along with Aunt Edna and Dinky drive off. During a picnic stop in Colorado, Clark has another encounter with seeing the young woman in the red Ferrari whom is parked and dancing to dance music. The Griswalds stop for the night in a run-down campground in South Fork, Colorado where they survive another tourist trap for the night as well as deal with the vicious dog Dinky.The next day (Day 4), the Griswalds and Aunt Edna pack up and leave the campground for Arizona. But while packing the car, Clark forgets to untie the nasty Dinky from the car's rear bumper before leaving. Clark does not realize his error until he is pulled over by a local motorcycle cop (James Keach) to angrily inform him of his mistake that has led to the apparent death of the dog. Never less, the policeman allows Clark to proceed on his way. During the drive, Clark has another encounter with the young woman driving the red Ferrari while everyone else is asleep, but nearly gets into an accident. But the result has one of the suitcases falling off the car, which contains all of Ellen's credit cards.The next day (Day 5), the family gets lost on a back road somewhere in Arizona where while Clark and Ellen argue, they accidentally drive off the road and get into an accident, damaging the Wagon Queen Family Truckster. Clark hikes off into the desert and spends many hours wondering aimlessly in the hot and aried desert until he finds a gas station... only to find the family there after they were rescued by some local Indians whom had a camel to tow their car to the very station. But after making some half-hearted repairs, the redneck mechanic (Mickey Jones) scams Clark out of all the money he has on him (over $500 for the repairs). But they manage to get to the Grand Canyon Village to check in for the night.The next day (Day 6), the frustrated Clark realizes that in reporting Ellen's lost credit cards to their hometown bank, the bank had frozen Clark's credit cards by accident, and Clark cannot convince the stuffy hotel clerk to take a check to pay for their rooms for the night. With the desk clerk distracted for a few minutes, Clark steals all the cash in the hotel's cash register, leaves behind the $1,000 check, and flees the hotel like a Wild West bank robber, grabs the family away from the scenic sight of the Grand Canyon, and speeds away.During the drive through Arizona, they find that Aunt Edna passed away in her sleep. With little options, they decide to drive to Phoenix anyway and deliver her to her son Normy's house (with the dead Aunt Edna tied to the roof of their car). When they reach Normy's home that evening in a raging thunderstorm, they discover he is out of town, and leave Edna's rigor mortised body on a lawn chair in the backyard.Despite all the events and the begging of Ellen and the kids, Clark is more determined to get to Walley World. They check into a motel for the night where after another argument with Ellen, Clark hangs out at the motel's bar where he has a face-to-face-encounter with the beautiul young woman from the red Ferrari and they make small talk about things. The woman beckons Clark to go skinny dipping with her in the motel's swimming pool, but upon diving in, Clark screams over his reaction to the cold pool water... thus waking up the entire motel, including Ellen, Rusty, and Audrey. When the woman takes her leave, Clark goes back to apologize to Ellen who demands that Clark repay the favor by taking him back to the pool to skinny dip with her.The next day (Day 7), the family finally arrives in Los Angeles, California and arrives at Wally World... only to find that the park is closed for repairs. Clark, slipping into madness, buys a realistic-looking BB gun from a local sporting goods store, returns to Wally World, and demands to a overweight and geekish park security guard named Russ Lasky (John Candy) to take them through the park; Ellen and kids follow him, attempting to placate their father.Eventually a SWAT team arrives along with park owner Roy Walley (Eddie Bracken) and they arrest the whole family. Clark manages to talk to Roy who suprisingly understands Clark's impassioned epitome of the American Vacation, bringing back memories of his own childhood years ago. Roy does not file charges against the Griswolds, and lets the family enjoy the park as his guests, along with the police and SWAT team who are seen riding on the park's top roller coaster attraction in the final shot of the movie.The end credits show various still photographs of the Griswolds enjoying the rest of the vacation at all the various stops they made over the course of the movie, including a final frame of them returning to Chicago via plane... having abandoned their gas-guzzling car in California."}