{"mid": "NearDark", "IMDB_id": "tt0093605", "title": "Near Dark", "plot": "One night, Caleb Colton (Adrian Pasdar), a young man in a small town, meets an attractive young drifter named Mae (Jenny Wright). Just before sunrise, she bites him on the neck and runs off. The rising sun causes Caleb's flesh to smoke and burn. Mae arrives with a group of roaming vampires in an RV and takes him away. The most psychotic of all the vampires, Severen (Bill Paxton), wants to kill Caleb, but Mae reveals that she has already turned him. Their charismatic leader Jesse Hooker (Lance Henriksen) reluctantly agrees to allow Caleb to remain with them for a week to see if he can learn to hunt and gain the group's trust. Caleb is unwilling to kill to feed, which alienates him from the others. To protect him, Mae kills for him and then has him drink from her wrist.\nJesse's group enters a bar and kills or injures the occupants. They set the bar on fire and flee the scene. After Caleb endangers himself to help them escape their motel room during a daylight police raid, Jesse and the others are temporarily mollified. Meanwhile, Caleb's father (Tim Thomerson) searches for Jesse's group. A child vampire in the group, Homer (Joshua John Miller) meets Caleb's sister Sarah (Marcie Leeds) and wants to turn her into his companion, but Caleb objects. While the group argues, Caleb's father arrives and holds them at gunpoint, demanding that Sarah be released. Jesse taunts him into shooting, but regurgitates the bullet before wrestling the gun away. In the confusion, Sarah opens a door, letting in the sunlight and forcing the vampires back. Burning, Caleb escapes with his family.\nCaleb suggests they try giving him a blood transfusion to attempt to cure him. The transfusion successfully reverses Caleb's transformation. That night, the vampires search for Caleb and Sarah. Mae distracts Caleb by trying to persuade him to return to her while the others kidnap his sister. Caleb discovers the kidnapping and his tires slashed, but gives chase on horseback. When the horse shies and throws him, he is confronted by Severen. Caleb commandeers a tractor-trailer and runs Severen over. The injured vampire suddenly appears on the hood of the truck, manages to rip apart the wiring in the engine. Caleb jackknifes the vehicle and jumps out as the truck explodes, killing Severen. Seeking revenge, Jesse and his girlfriend Diamondback (Jenette Goldstein) pursue him, but are forced to flee in their car as dawn breaks.\nNot wanting Sarah to become another childlike monster, Mae breaks out of the back of the car with Sarah. Mae's flesh begins to smoke as she's burned by the sun but carries Sarah into Caleb's arms, taking refuge under his jacket. Homer attempts to follow, but as he runs he dies from exposure to the sun. Jesse and Diamondback, their sun-proofing ruined, also begin to burn. They attempt to run Caleb and Sarah over but fail, dying as the car blows up. Mae awakens later, her burns now healed. She too has been given a transfusion and is cured. She and Caleb comfort each other in a reassuring hug as the film ends."}