{"mid": "Nebraska", "IMDB_id": "tt1821549", "title": "Nebraska", "plot": "An old man walks along the snowy roads of Billings, Montana. A police officer stops him. The man seems aimless.David picks up the old man, his father Woody, at the police station. Woody explains that he was walking to Lincoln, Nebraska, to collect a million dollars he won in a mail order sweepstakes. David explains that these sweepstakes are scams, but Woody says this one must be genuine.When they arrive at Woody's house, his wife Kate scolds him for believing in the contest.David, who sells stereo equipment at a local store, later comes back to his parents' house because his mother and older brother Ross are distressed that Woody has again wondered off on a long walk. Ross tries to convince David that Woody needs to be put in a nursing home, and David thinks he just needs more family support.David's ex-girlfriend stops by his apartment to drop off a few things. He asks her to move back in, but she is frustrated by his lack of direction in their relationship.Kate calls David to go searching for Woody, who is again out walking the streets of Billings. They argue, and Woody asks David to drive him to Nebraska.Kate yells at David for planning to go through with this plan.David and Woody drive southeast into Wyoming. While David gets gas at a stop, Woody wonders off to a bar. David finds him and chastises him for drinking.David and Woody drive further into South Dakota, where David suggests they stop to see Mount Rushmore. Woody stands and looks at the monument, but he is unimpressed.They stop that night at a motel. Woody goes out and comes back drunk. He falls, revealing a wound in his forehead.David takes Woody to a hospital for stitches. Woody realizes he lost his false teeth. The doctor tells him he needs a few days to rest and be monitored.David tells Woody that they can stay in Hawthorne with Uncle Ray and Aunt Martha. Woody does not want to go.David and Woody find his false teeth along some railroad tracks where he fell the night before. They joke about whether they are his real teeth.They make it to Hawthone, Nebraska, Woody's hometown, with a population of 1,358. They have not been there in a few decades. Aunt Martha is welcoming, but Woody's brother Ray and his two degenerate sons, Bart and Cole, are not very excited to see them. David discusses driving distances and travel times with Bart and Cole.They all make small talk and watch television.David walks into the dying downtown with Woody. They stop at a garage that Woody used to own, but he does not know the current workers. They go to a bar, where Woody has a beer and David complains about his drinking, saying he has tried to give it up himself. David relents and has a few beers with Woody as more customers come in.David tells Woody that he broke up with his girlfriend. David asks his father about his marriage, and Woody has little to say. David complains more about Woody's drinking, and Woody defends himself, getting angry and walking out.Woody sees another bar and David follows him in. They meet Ed, a gregarious man whom Woody claims stole his air compressor years ago. David warns Woody to not mention the sweepstakes to Ed and the guys, but he promptly does anyway. Ed and the guys tell Woody he is buying the next round of drinks.They drive home, and Woody boasts about how impressed the guys were.The two have breakfast with the family the next morning, and they have heard about the sweepstakes. David tries to dispel the rumor, but they still assume it is true.Kate arrives by bus and scolds David and Woody for their misadventure.The three go out to a cemetery and look at grave markers. Kate tells many critical stories about dead family members. She comes across the grave of an old suitor, pulls up her skirt, and shows him what he could have had.A boy from the local newspaper comes by to take Woody's photograph for a news story.David goes to the newspaper office to explain to the editor that Woody did not actually win any sweepstakes. She happens to be Woody's ex-girlfriend from their youth, and chats up David, allowing him to look in a very old edition about his dad's service in the Korean War. She says she'll just write a simple story about Woody and Kate visiting town.David goes to dinner with Woody and Kate, where they see Ed singing karaoke. Ed calls out to Woody to stand up, and the whole restaurant applauds. Later Ed approaches David in the bathroom and makes it clear that he expects to be repaid for money he loaned Woody years earlier. David insists that Woody did not win any money, but Ed does not believe him.Some of Woody's many brothers come over to visit the next day and watch football. Ross arrives, and everyone has dinner. Ross and Kate try to dispel the rumor that Woody won a million dollars. Woody says that all he wants is a new truck and an air compressor.An aunt and cousin approach David and Ross to ask for money that they loaned to Woody over the years, then Cole and Bart join in. Ross once again tries to explain that Woody did not win any money, and the cousins begin fighting. Kate walks out and tells them off.David and Ross drive their parents out to the old family homestead, which is an abandoned house on a barren farm. They walk around the empty rooms, and Woody recalls growing up there.As they drive outside of town, Kate says she sees Ed's house. David and Ross get the idea of looking in his barn and taking back Woody's compressor. After they load the compressor in the car, Woody tells them they went to the wrong house, so they take it back. Just then, as David and Ross hide in their barn, the homeowners show up, surprised to find Woody and Kate. They make small talk, and Kate drives away, leaving their sons to chase after them on foot.David and Woody go to a bar in town. Ed confronts Woody and asks him to pay back $10,000. Woody says he does not have the money yet, and Ed tells the story of when Woody wanted to leave Kate early in their marriage.Cole and Bart, poorly disguised, mug David and Woody outside the bar, stealing Woody's sweepstakes letter. David confronts them back at the house, and they say they threw it away when they realized it was bogus.David tries to make Woody feel better by looking for the letter back in town. They go into the bar and find Ed reading the sweepstakes letter to a small crowd, with everyone laughing. Woody takes the letter back from Ed, who realizes that Woody believes it. Before he leaves, David slugs Ed in the face.David finds Woody outside, dizzy and having breathing trouble. David tells him they are not going on to Lincoln. Woody says he just wanted the money for a new pickup truck, and to leave something for his sons. David drives Woody to the hospital after he faints.Ross and Kate meet David at the hospital, who tells them Woody will be kept overnight. Ross says he will drive Kate home in the morning. David spends the night in Woody's hospital room.David wakes up to find Woody missing, then discovers him walking along the road outside the hospital. He picks him up, and the two drive on to Lincoln.They make their way to the nondescript marketing office for the sweepstakes, where a secretary informs them that Woody does not have a winning number. She offers Woody a complementary hat. David asks the secretary if this happens a lot, and she says usually with older people.She asks David, \"Does he have Alzheimer's?\" David replies, \"He just believes stuff that people tell him.\" She responds, \"Oh, that's too bad.\"David stops at a car dealer on the way out of town and trades in his car for a pickup truck. Then he drives Woody to a store and buys him a new air compressor.On the way back west, they drive into Hawthorne. David stops in the middle of the main street and tells his dad to drive the truck, which he has put in his name. Woody drives through the dying downtown, and tells David to hide. He sees an old friend, and Ed with a welt on his face, as well as his old girlfriend from the newspaper. He drives past his brother Albert and waves.On the edge of town, Woody gets out of the truck and lets David continue driving them westward."}