{"mid": "Nekromantik2", "IMDB_id": "tt0102522", "title": "Nekromantik 2", "plot": "The film opens with a scene showing the protagonist of the first Nekromantik, Rob (Daktari Lorenz), committing suicide. The film then goes to a churchyard in the evening where Monika (Monika M) is searching for a way in. She finds her way in and after quite some digging she absconds with the remains of Rob. Once back at her apartment she unwraps her new found interest and sits and smokes a cigarette while watching him. A short vignette follows showing Mark (Mark Reeder), a future interest of Monikas attempting to catch his train to work but missing it. The film then jumps back to Monika attempting to have sex with the corpse by straddling him. She gives up, frustrated and unable to reach a climax the scene ends. Mark then is seen on the phone with a woman she is trying to meet for a movie. He states explicitly that he despises lateness and that she must be punctual. After he waits a few minutes in front of the theater he asks Monika if shed like to join him. She agrees and after the film, which consists of two people eating soft-boiled eggs naked on a roof top, they adjourn to his place for eggs. They meet again at an amusement park for a day out and get along very well. After their day out she decides to destroy the remains of Rob. After his dismemberment she decides to keep a few mementos of Rob: His head and penis. She continues her relationship with Mark but is disappointed after the first time that they have sex. This is due to the fact that he is moving and must be dominated in order for her to get any pleasure. Their relationship begins to take a weird turn when Mark awakes the next day. He discovers the rotting penis that belonged to Rob in the refrigerator and is perplexed to say the least. He returns the penis to the refrigerator and the film goes back to Monika who is having a dream. This dream consists of her singing a song in French next to a pianist (John Boy Walton) playing a piano. Soon after he is seen hanging upside down with Monika photographing him. After these events he begins to question her nature and whether it is perverse. He meets up with a friend at a coffee shop and he tells her about his worries about Monika in a very vague manner and she assures him that he is overreacting. He tells a man at a bar (Florian Koerner Von Gustorf) about his troubles as well. The man assures him that he is, again, overreacting. He then returns to Monika with a fresh pizza in hand for the two of them and is met by a group of women congregated in her living room. He arrives when she is watching a seal autopsy video with her friends. He does not see the video initially but after asking her what they have been doing all afternoon she tells him that they were watching a movie. He asks to see it and is repulsed after being shown it. Monika becomes defensive and he storms off. They talk on the phone later and she asks him to come over and talk it out. He does and in a burst of passion they begin to have sex. She then begins to ride him and pins his arms down. Unaware of his fate he closes his eyes and enjoys the experience. Monika then reaches under the bed and pulls out a bone-saw and slams it into his neck. He writhes in pain but it is too late. She begins to cut his head off and then secures his erection with a cock-ring and leaves the view of the camera. She quickly returns with the head of Rob which she places on the shoulders of Mark. The scene ends and the next shot that is seen is the back of an ambulance. The film ends with a doctor walking down a long corridor. He approaches the camera, in real-time, in a single shot and tells Monika that she is pregnant."}