{"mid": "Nell", "IMDB_id": "tt0110638", "title": "Nell", "plot": "When stroke victim Violet Kellty dies in her isolated cabin in the North Carolina mountains, Dr. Jerome \"Jerry\" Lovell, the town doctor, finds a terrified young woman hiding in the house rafters. She speaks angrily and rapidly, but seems to have a language of her own. Looking at Violet's Bible, Jerry finds a note asking whoever finds it to look after Violet's daughter Nell. Sheriff Todd Peterson shows Jerry a news clipping that Nell was conceived through rape.\nJerry seeks the help of Dr. Paula Olsen, a researcher working with autistic children. Paula and her colleague Dr. Alexander \"Al\" Paley are interested in studying a \"wild child\" (feral child), and Al continues calling Nell this even after studying films showing that Nell does not fit the \"wild child\" profile. Paula and Al get a court order to institutionalize Nell for further study. Jerry hires lawyer Don Fontana and prevents it. The judge gives Jerry and Paula three months to interact with Nell and discover her needs. Paula shows up on a houseboat with electronic equipment to monitor Nell's behavior while Jerry chooses to stay in Nell's cabin and quietly observe.\nPaula discovers that Nell's seemingly indecipherable language is English, based partly on her mother's aphasic speech after a stroke, and partly on the secret language she shared with her decades-deceased identical twin sister. Jerry and Paula begin a grudging friendship.\nNell sleeps during the day or works inside her home and is active outdoors only after sunset. She explains to Jerry that her mother told her about the rape and warned her that men were evildoers. As Nell comes to trust Jerry, she sees him as a friend, the \"gah'inja\" her mother promised would come. Jerry later realizes that \"gah'inja\" is Nell's phrase for \"guardian angel.\" Using popcorn as an incentive, Jerry is able to lead Nell outside and into the sun. Nell leads Jerry and Paula to the decayed remains of her identical twin sister, May, who died in a fall while the two were playing in the woods.\nMike Ibarra, a reporter, learns of Nell's existence and visits her cabin. Nell is curious of the visitor at first, but when he snaps a photo, the flash frightens Nell. Jerry arrives and throws the reporter out. Paula believes that Nell would be safer in a hospital, while Jerry feels that Nell should be left alone and allowed to live as she pleases. The two decide that Nell should be shown a little of the world, and they make the decision to bring Nell into town.\nWhile in town, Nell befriends Mary, Todd's depressed wife, but also encounters some raunchy boys in a pool hall until Jerry gets her out. With increased intrusion by the press, Jerry and Paula take Nell to a hospital for her protection. There, Nell becomes extremely despondent and unresponsive. Jerry removes her from the hospital and hides her in a hotel. Paula joins him, and the two admit that they love each other.\nAt the court hearing the next day, Al, who wants to study Nell in a controlled environment, delivers his opinion that Nell has Asperger syndrome and belongs in an institution. Nell then comes forward and, with Jerry interpreting, speaks for herself. Five years later, Jerry and Paula bring their daughter, Ruthie, to visit Nell in her house. It is Nell's birthday, and friends surround her."}