{"mid": "Network", "IMDB_id": "tt0074958", "title": "Network", "plot": "The following synopsis has mostly been taken from the film's wikipedia page:Howard Beale (Peter Finch), the longtime anchor of the Union Broadcasting System's UBS Evening News, learns from the news division president, Max Schumacher (William Holden), that he has just two more weeks on the air because of declining ratings. The two old friends get roaring drunk and lament the state of their industry. The following night, Beale announces on live television that he will commit suicide on next Tuesday's broadcast. UBS fires him after this incident, but Schumacher intervenes so that Beale can have a dignified farewell. Beale promises he will apologise for his outburst, but once on the air, he launches back into a rant claiming that life is \"bullshit\". Beale's outburst causes the newscast's ratings to spike, and much to Schumacher's dismay, the upper echelons of UBS decide to exploit Beale's antics rather than pull him off the air. In one impassioned diatribe, Beale galvanises the nation, persuading his viewers to shout out of their windows \"I'm as mad as hell, and I'm not going to take this anymore!\"Diana Christensen (Faye Dunaway) heads the network's programming department; seeking just one hit show, she cuts a deal with a band of radical terrorists (a parody of the Symbionese Liberation Army called the \"Ecumenical Liberation Army\") for a new docudrama series called the Mao Tse-Tung Hour for the upcoming fall season. When Beale's ratings seem to have topped out, Christensen approaches Schumacher and offers to help him \"develop\" the news show. He says no to the professional offer, but not to the personal one, and the two begin an affair. When Schumacher decides to end the Howard as the \"Angry Man\" format, Christensen convinces her boss, Frank Hackett, to slot the evening news show under the entertainment division so she can develop it. Hackett agrees, bullies the UBS executives to consent, and fires Schumacher at the same time. Soon afterward, Beale is hosting a new program called The Howard Beale Show, top-billed as \"the mad prophet of the airwaves\". Ultimately, the show becomes the most highly rated program on television, and Beale finds new celebrity preaching his angry message in front of a live studio audience that, on cue, chants Beale's signature catchphrase en masse: \"We're as mad as hell, and we're not going to take this anymore.\" At first, Max and Diana's romance withers as the show flourishes, but in the flush of high ratings, the two ultimately find their way back together, and Schumacher leaves his wife of over 25 years for Christensen. But Christensen's fanatical devotion to her job and emotional emptiness ultimately drive Max back to his wife, and he warns his former lover that she will self-destruct at the pace she is running with her career. \"You are television incarnate, Diana,\" he tells her, \"indifferent to suffering, insensitive to joy. All of life is reduced to the common rubble of banality.\"When Beale discovers that Communications Corporation of America (CCA), the conglomerate that owns UBS, will be bought out by an even larger Saudi Arabian conglomerate, he launches an on-screen tirade against the deal, encouraging viewers to send telegrams to the White House telling them, \"I want the CCA deal stopped now!\" This throws the top network brass into a state of panic because the company's debt load has made merger essential for survival. Hackett takes Beale to meet with CCA chairman Arthur Jensen, who explicates his own \"corporate cosmology\" to the attentive Beale. Jensen delivers a tirade of his own in an \"appropriate setting\", the dramatically darkened CCA boardroom, that suggests to the docile Beale that Jensen may himself be some higher power describing the interrelatedness of the participants in the international economy and the illusory nature of nationality distinctions. Jensen persuades Beale to abandon the populist messages and preach his new \"evangel\". But television audiences find his new sermons on the dehumanisation of society depressing, and ratings begin to slide, yet Jensen will not allow UBS executives to fire Beale. Seeing its two-for-the-price-of-one value, solving the Beale problem plus sparking a boost in season-opener ratings. Christensen, Hackett, and the other executives decide to hire the Ecumenical Liberation Army to assassinate Beale on the air. The assassination succeeds, putting an end to The Howard Beale Show and kicking off a second season of The Mao Tse-Tung Hour.The film ends with the narrator stating:\"This was the story of Howard Beale, the first known instance of a man who was killed because he had lousy ratings.\""}