{"mid": "NewYorkNewYork", "IMDB_id": "tt0076451", "title": "New York, New York", "plot": "The story opens on V-J Day in 1945. A massive celebration in a New York City nightclub is underway, music provided by the Tommy Dorsey Orchestra. While there, selfish and smooth-talking saxophone player Jimmy Doyle (De Niro), meets small-time USO singer Francine Evans (Minnelli), who, although lonely, still wants nothing to do with Jimmy, who keeps pestering her for her phone number.\nThe next morning, they end up sharing a cab, and, against her will, Francine accompanies Jimmy to an audition. There he gets into an argument with the club owner. Francine, to get the audition back on track, begins to sing the old standard, \"You Brought a New Kind of Love to Me\"; Jimmy joins in on his sax. The club owner is impressed and, to Francine's astonishment, they are both offered a job—a boy-girl act. From that moment on, Jimmy and Francine's relationship deepens into a mix of obsession and love. But there are problems—mainly, Jimmy's tendency to fight with his co-workers, and his increasingly violent arguments with Francine, who becomes pregnant with his child. An especially bad shouting match between them results in Francine going into labor. Jimmy rushes her to the hospital, where she delivers a baby boy. But Jimmy is not ready to be a father, or a good husband, and he abandons his wife, declining even to see his newborn son as he leaves the hospital.\nSeveral years later, in a recording studio, Francine records \"But the World Goes Round\", a powerful anthem which makes the charts and turns her into a popular entertainment figure. In the years that follow, Jimmy and Francine both find success in the music industry; he becomes a renowned jazz musician and club owner, while she becomes a successful singer and film actress.\nJimmy records a song of his on his saxophone which tops the jazz charts, and Francine cements her stardom after singing that same song, \"New York, New York,\" for which she has provided the lyrics. Her performance, received by a wildly appreciative audience, takes place in the same nightclub where, years earlier, she and Jimmy had met. After the show, Jimmy telephones his ex-wife, suggesting they get together for dinner. Francine is tempted, heads toward the stage door exit, but at the last moment changes her mind. Jimmy, waiting on the sidewalk, realizes he has been stood up and heads off down the street, accompanied by the song he has written—the \"Theme from New York, New York\".\nAn alternate ending sees the pair reunite and walk off to dinner, sharing conversation about their son."}