{"mid": "NicholasNickleby", "IMDB_id": "tt0309912", "title": "Nicholas Nickleby", "plot": "Nicholas Nickleby's father dies unexpectedly after losing all of his money in a poor investment. Nicholas, his mother and his younger sister, Kate, are forced to give up their comfortable lifestyle in Devonshire and travel to London to seek the aid of their only relative, Nicholas's uncle, Ralph Nickleby. Ralph, a cold and ruthless businessman, has no desire to help his destitute relations and hates Nicholas, who reminds him of his dead brother, on sight. He gets Nicholas a low-paying job as an assistant to Wackford Squeers, who runs the school Dotheboys Hall in Yorkshire. Nicholas is initially wary of Squeers (a very unpleasant man with one eye) because he is gruff and violent towards his young charges, but he tries to quell his suspicions. As Nicholas boards the stagecoach for Greta Bridge, he is handed a letter by Ralph's clerk, Newman Noggs. A once-wealthy businessman, Noggs lost his fortune, became a drunk, and had no other recourse but to seek employment with Ralph, whom he loathes. The letter expresses concern for him as an innocent young man, and offers assistance if Nicholas ever requires it. Once he arrives in Yorkshire, Nicholas comes to realise that Squeers is running a scam: he takes in unwanted children (most of whom are illegitimate, crippled or deformed) for a high fee, and starves and mistreats them while using the money sent by their parents, who only want to get them out of their way, to pad his own pockets. Squeers and his monstrous wife whip and beat the children regularly, while spoiling their own son. Lessons are no better; they show how poorly educated Squeers himself is and he uses the lessons as excuses to send the boys off on chores. While he is there, Nicholas befriends a simple boy named Smike, who is older than the other \"students\" and now acts as an unpaid servant. Nicholas attracts the attention of Fanny Squeers, his employer's plain and shrewish daughter, who deludes herself into thinking that Nicholas is in love with her. She attempts to disclose her affections during a game of cards, but Nicholas doesn't catch her meaning. Instead he ends up flirting with her friend Tilda Price, to the consternation of both Fanny and Tilda's friendly but crude-mannered fiancé John Browdie. After being accosted by Fanny again, Nicholas bluntly tells her he does not return her affections and wishes to be free of the horrible atmosphere of Dotheboys Hall, earning her enmity.\nFanny uses her new-found loathing of Nicholas to make life difficult for the only friend he has at the school: Smike, whom Squeers takes to beating more and more frequently. One day Smike runs away, but is caught and brought back to Dotheboys. Squeers begins to beat him, but Nicholas intervenes. Squeers strikes him across the face and Nicholas snaps, beating the schoolmaster violently. During the fight, Fanny steps in and attacks Nicholas, hating him for rejecting her love. Nicholas ignores her and goes on to beat Squeers bloody. Quickly packing his belongings and leaving Dotheboys Hall, he meets John Browdie on the way. Browdie finds the idea that Squeers himself has been beaten uproariously funny, and gives Nicholas money and a walking staff to aid him on his trip back to London. At dawn, he is found by Smike, who begs to come with him. Nicholas and Smike set out towards London. Among other things, Nicholas wants to find out what Squeers is going to tell his uncle.\nMeanwhile, Kate and her mother are forced by Ralph to move out of their lodgings in the house of the kindly portrait painter Miss LaCreevy and into a cold and drafty house Ralph owns in a London slum. Ralph finds employment for Kate working for a fashionable milliner, Madame Mantalini. Her husband, Mr Mantalini, is a gigolo who depends on his (significantly older) wife to supply his extravagant tastes, and offends Kate by leering at her. Kate proves initially clumsy at her job, which endears her to the head of the showroom, Miss Knag, a vain and foolish woman who uses Kate to make herself look better. This backfires when a client prefers to be served by the young and pretty Kate rather than the ageing Miss Knag. Kate is blamed for the insult, and as a result, Kate is ostracised by the other milliners and left friendless.\nNicholas seeks out the aid of Newman Noggs, who shows him a letter that Fanny Squeers has written to Ralph. It viciously exaggerates the events of the beating and slanders Nicholas. They suspect Ralph secretly knows the truth, but is latching onto Fanny's account to further persecute Nicholas. Noggs tells Nicholas, who is intent on confronting his uncle, that Ralph is out of town and advises him to find a job. Nicholas goes to an employment office, where he encounters a strikingly beautiful girl. His search for employment fails, and he is about to give up when Noggs offers him the meagre position of French teacher to the children of his neighbours, the Kenwigs family, and Nicholas is hired under the assumed name of \"Johnson\" to teach the children French.\nRalph asks Kate to attend a dinner he is hosting for some business associates. When she arrives she discovers she is the only woman in attendance, and it becomes clear Ralph is using her as bait to entice the foolish nobleman Lord Frederick Verisopht to do business with him. The other guests include Verisopht's mentor and friend, the disreputable nobleman Sir Mulberry Hawk, who humiliates Kate at dinner by making her the subject of an offensive bet. She flees the table, but is later accosted by Hawk. He attempts to force himself on her but is stopped by Ralph. Ralph shows some unexpected tenderness towards Kate but insinuates that he will withdraw his financial help if she tells her mother about what happened.\nThe next day, Nicholas discovers that his uncle has returned. He visits his mother and sister just as Ralph is reading them Fanny Squeers' letter and slandering Nicholas. He confronts his uncle, who vows to give no financial assistance to the Nicklebys as long as Nicholas stays with them. His hand forced, Nicholas agrees to leave London, but warns Ralph that a day of reckoning will one day come between them.\nThe next morning, Nicholas and Smike travel towards Portsmouth with the intention of becoming sailors. At an inn, they encounter the theatrical manager Vincent Crummles, who hires Nicholas (still going under the name of Johnson) on sight. Nicholas is the new juvenile lead, and also playwright, with the task of adapting French tragedies into English and then modifying them for the troupe's minimal dramatic abilities. Nicholas and Smike join the acting company and are warmly received by the troupe, which includes Crummles's formidable wife, their daughter, \"The Infant Phenomenon\", and many other eccentric and melodramatic thespians. Nicholas and Smike make their debuts in Romeo and Juliet, as Romeo and the Apothecary respectively, and are met with great acclaim from the provincial audiences. Nicholas enjoys a flirtation with his Juliet, the lovely Miss Snevellici.\nBack in London, Mr Mantalini's reckless spending has bankrupted his wife. Madame Mantalini is forced to sell her business to Miss Knag, whose first order of business is to fire Kate. She finds employment as the companion of the social-climbing Mrs Wittiterly. Meanwhile, Sir Mulberry Hawk begins a plot to humiliate Kate for refusing his advances. He uses Lord Frederick, who is infatuated with her, to discover where she lives from Ralph. He is about to succeed in this plot when Mrs Nickleby enters Ralph's office, and the two rakes switch their attentions from Kate's uncle to her mother, successfully worming their way into Mrs Nickleby's company and gaining access to the Wittiterly house. Mrs. Wittiterly grows jealous and admonishes Kate for flirting with the noblemen. The unfairness of this accusation makes Kate so angry that she rebukes her employer, who flies into a fit of hysterics. With no other recourse, Kate goes to her uncle for assistance, but he refuses to help her, citing his business relationships with Hawk and Verisopht. It is left to Newman Noggs to come to her aid, and he writes to Nicholas, telling him in vague terms of his sister's urgent need of him. Nicholas immediately quits the Crummles troupe and returns to London.\nNoggs and Miss La Creevy confer, and decide to delay telling Nicholas of Kate's plight until it is too late at night for him to seek out Hawk and take violent action. So, when Nicholas arrives, both Noggs and Miss La Creevy are out. Nicholas is about to search the city for them when he accidentally overhears Hawk and Lord Frederick rudely toasting Kate in a coffeehouse. He is able to glean from their conversation what has happened, and confronts them. Hawk refuses to give Nicholas his name or respond to his accusations. When he attempts to leave, Nicholas follows him out, and leaps onto the running board of his carriage, demanding his name. Hawk strikes him with a riding crop, and Nicholas loses his temper, returning the blow and spooking the horses, causing the carriage to crash. Hawk is injured in the crash and vows revenge, but Lord Verisopht, remorseful for his treatment of Kate, tells him that he will attempt to stop him. Later, after Hawk has recovered, they quarrel over Hawk's insistence on revenging himself against Nicholas. Verisopht strikes Hawk, resulting in a duel. Verisopht is killed, and Hawk flees to France. As a result, Ralph loses a large sum of money owed to him by the deceased lord.\nNicholas collects Kate from the Wittiterlys, and with their mother and Smike, they move back into Miss LaCreevy's house. Nicholas pens a letter to Ralph, refusing, on behalf of his family, a penny of his uncle's money or influence. Returning to the employment office, Nicholas meets Charles Cheeryble, a wealthy and extremely benevolent merchant who runs a business with his twin brother Ned. Hearing Nicholas's story, the brothers take him into their employ at a generous salary and provide his family with a small house in a London suburb.\nRalph encounters a beggar, who recognises him and reveals himself as Brooker, Ralph's former employee. He attempts to blackmail Ralph with a piece of unknown information, but is driven off. Returning to his office, Ralph receives Nicholas's letter and begins plotting against his nephew in earnest. Wackford Squeers returns to London and joins Ralph in his plots.\nSmike, on a London street, has the misfortune to run into Squeers, who kidnaps him. Luckily for Smike, John Browdie is honeymooning in London with his new wife Tilda and discovers his predicament. When they have dinner with Squeers, Browdie fakes an illness and takes the opportunity to rescue Smike and send him back to Nicholas. In gratitude, Nicholas invites the Browdies to dinner. At the party, also attended by the Cheerybles's nephew Frank and their elderly clerk Tim Linkinwater, Ralph and Squeers attempt to reclaim Smike by presenting forged documents to the effect that he is the long-lost son of a man named Snawley (who, in actuality, is a friend of Squeers with children at Dotheboys Hall). Smike refuses to go, but the threat of legal action remains.\nWhile at work, Nicholas encounters the beautiful young woman he had seen in the employment office and realises he is in love with her. The brothers tell him that her name is Madeline Bray, the penniless daughter of a debtor, Walter Bray, and enlist his help in obtaining small sums of money for her by commissioning her artwork, the only way they can help her due to her tyrannical father.\nArthur Gride, an elderly miser, offers to pay a debt Ralph is owed by Walter Bray in exchange for the moneylender's help. Gride has illegally gained possession of the will of Madeline's grandfather, and she will become an heiress upon the event of her marriage. The two moneylenders persuade Bray to bully his daughter into accepting the disgusting Gride as a husband, with the promise of paying off his debts. Ralph is not aware of Nicholas's involvement with the Brays, and Nicholas does not discover Ralph's scheme until the eve of the wedding. He appeals to Madeline to cancel the wedding, but despite her feelings for Nicholas, she is too devoted to her dying father to go against his wishes. On the day of the wedding, Nicholas attempts to stop it once more but his efforts prove academic when Bray, guilt-ridden at the sacrifice his daughter has made for him, dies unexpectedly. Madeline thus has no reason to marry Gride and Nicholas and Kate take her to their house to recover.\nSmike has contracted tuberculosis and become dangerously ill. In a last attempt to save his friend's health, Nicholas takes him to his childhood home in Devonshire, but Smike's health rapidly deteriorates. On his deathbed, Smike is startled to see the man who brought him to Squeers' school. Nicholas dismisses it as an illusion but it is later revealed that Smike was right. After confessing his love for Kate, Smike dies peacefully in Nicholas's arms.\nWhen they return to Gride's home after the aborted wedding, Ralph and Gride discover that Peg Sliderskew, Gride's aged housekeeper, has robbed Gride, taking, amongst other things, the will. To get it back, Ralph enlists Wackford Squeers's services to track down Peg. Noggs discovers this plot, and with the help of Frank Cheeryble, he is able to recover the will and have Squeers arrested.\nThe Cheeryble brothers confront Ralph, informing him that his various schemes against Nicholas have failed. They advise him to retire from London before charges are brought up against him, as Squeers is determined to confess all and implicate Ralph. He refuses their help, but is summoned back to their offices that evening and told that Smike is dead. When he reacts to the news with vicious glee, the brothers reveal their final card. The beggar Brooker emerges, and tells Ralph that Smike was his own son. As a young man, Ralph had married a woman for her fortune, but kept it secret so she would not forfeit her inheritance for marrying without her brother's consent, and wait for the brother to die. She eventually left him after bearing him a son, whom he entrusted to Brooker, who was then his clerk. Brooker, taking the opportunity for vengeance, took the boy to Squeers' school and told Ralph the boy had died. Brooker now repents his action, but a transportation sentence kept him from putting the matter right. Devastated at the thought that his only son died as the best friend of his greatest enemy, Ralph commits suicide. His ill-gotten fortune ends up in the state coffers because he died intestate and his estranged relatives decline to claim it.\nSqueers is sentenced to transportation to Australia, and, upon hearing this, the boys at Dotheboys Hall rebel against the Squeers family and escape with the assistance of John Browdie. Nicholas becomes a partner in the Cheerybles' firm and marries Madeline. Kate and Frank Cheeryble also marry, as do Tim Linkinwater and Miss LaCreevy. Brooker dies penitent. Noggs recovers his respectability. The Nicklebys and their now extended family return to Devonshire, where they live in peace and contentment and grieve over Smike's grave."}