{"mid": "NightAndTheCity", "IMDB_id": "tt0105001", "title": "Night and the City", "plot": "Harry Fabian (Widmark) is an ambitious American hustler and con man operating in London, always looking for a better deal. He maintains a fractured relationship with the honest Mary Bristol (Tierney), nightclub owner and businessman Phil Nosseross (Sullivan), and Helen (Withers), who is Phil's estranged wife. While attempting a con at a wrestling match, Fabian witnesses Gregorius (Zbyszko), a veteran Greek wrestler, arguing with his son Kristo (Lom), who has organised the fight, and who effectively controls all wrestling in London. After denouncing Kristo's event as tasteless exhibitionism that shames the sport's Greco-Roman traditions, Gregorius leaves with Nikolas (Richmond), a fellow wrestler. Fabian catches up with the two and befriends them, having realised that he can host wrestling in London without interference from Kristo if he can persuade his father to support the enterprise.\nFabian approaches Phil and Helen with his proposal, then asks for an investment. Incredulous, Phil offers to provide half of the required £400, if Fabian can equal it. Desperate, Fabian asks Figler, a panhandler and unofficial head of an informal society of street criminals, Googin, a forger, and Anna, a Thameside smuggler, but none can offer any help. Fabian is eventually approached by Helen, who offers the £200 in exchange for a licence to continue running her own nightclub, having obtained the money by selling an expensive fur Phil recently bought for her. Fabian agrees, but tricks Helen by having Googin forge the licence. Meanwhile, Phil is visited by associates of Kristo, who warn him to keep Fabian away from London's wrestling scene. Already suspecting Helen of duplicity, Phil neglects to warn Fabian, who proceeds to open his own gym with Gregorius and Nikolas as the stars, and Phil as a silent partner.\nA furious Kristo visits the gym, only to discover that his father is supporting Fabian's endeavour. Meeting with Phil, the two plot to kill Fabian, but realise that they can only do so if Gregorius leaves Fabian. Phil meets with Fabian and removes his backing, suggesting that Fabian get Nikolas and The Strangler (Mazurki), a showy wrestler favoured by Kristo, into the ring together to keep the business going, knowing that Gregorius would never allow it. Finding The Strangler's manager, Mickey Beer (Farrell), Fabian convinces him to support the fight, and taunts The Strangler into confronting Gregorius and Nikolas. Gregorius agrees to the fight, convinced by Fabian that it will prove that his style of wrestling is superior. Beer asks Fabian for £200 to cover his fee, so Fabian asks Phil for the money. Instead, Phil calls Kristo, informing him that The Strangler is in Fabian's gym.\nBetrayed, Fabian steals the money from Mary, and returns to the gym. However, The Strangler goads Gregorius into a prolonged and brutal fight, during which Nikolas' wrist is broken. Gregorius eventually defeats The Strangler in the ring as Kristo arrives, but dies minutes later in his son's arms from exhaustion. Seeing that both his business and protection are lost, Fabian flees.\nIn revenge of his father's death, Kristo puts a £1,000 bounty on Fabian's head, sending word to all of London's underworld. Fabian is hunted through the night, first by Kristo's men, then by Figler, who attempts to trap Fabian for the reward. Convinced that her licence is authentic, Helen leaves Phil, only to discover that the work is a worthless forgery. She returns to Phil in desperation, only to discover that he has committed suicide, leaving everything to Molly (Reeve), the club's elderly cleaner and flower stand operator.\nFabian eventually finds shelter at Anna's, but has already been tracked down by Kristo. Mary arrives, and Fabian attempts to redeem himself by shouting to Kristo that Mary betrayed him, so that she will get the reward. As he runs towards where Kristo is standing on Hammersmith Bridge, he is caught and killed by The Strangler, who throws his body into the Thames. The Strangler is arrested moments later, and Kristo walks away from the scene."}