{"mid": "NightWatch", "IMDB_id": "tt0070444", "title": "Night Watch", "plot": "In the prologue, which is set in medieval times, the audience is introduced to humans with special powers called The Others (Иные, иной; Inyye, Inoy). The Others are divided into two camps, with each Other either allied with the forces of Light or the forces of Darkness, and the prologue recounts a great battle between the two sides. Geser, the Lord of the Light, realized that the two forces would eventually annihilate each other. He stopped the battle and offered a truce to the forces of Darkness, led by Zavulon. To make sure each side honored its side of the agreement, the Light would have a \"Night Watch\" to monitor the forces of Darkness at night, and the Darkness would have a \"Day Watch\" to police the forces of Light during the day. This agreement maintained balance for centuries to come.\nIn modern-day Moscow, Anton Gorodetsky (Russian: Антон Городецкий) visits a witch named Daria and asks her to cast a spell to return his wife to him, agreeing that she should miscarry her child as part of it. Just as the spell is about to be completed, two figures burst in and restrain Daria, preventing her from completing the spell. When they notice that Anton is able to see them, they realize that he is an Other.\nTwelve years later, Anton has become a member of the Night Watch and is working with the same team. On Anton's request, Kostya, his neighbor, takes him to see his father, a butcher, to get blood for Anton to drink. The father does this reluctantly, and then tells Kostya that members of the Night Watch only drink blood when they hunt vampires like themselves.\nA twelve-year-old boy, Yegor, hears \"The Call\", a psychic call by a vampire who intends to feed on him. Anton tracks Yegor, being able to hear the call as he gets closer to Yegor, due to the blood he drank. On the way he sees a blond woman that terrifies him. Realizing she is under a deadly curse, Anton uses an ultraviolet flashlight to see if she is a vampire, but she is not. Two vampires are about to feed on Yegor when Anton arrives, and Anton kills one of them while being badly injured. A member of the Day Watch arrives and reveals that the Day Watch is aware of the murder of one of their Dark members.\nAnton is healed by Geser, who notes that he could have solved things more easily by entering into the Gloom—a shadow world only accessible by the Others. After Anton tells him about the woman in the subway, he reveals a legend about a virgin who is cursed so that people and animals around her die or sicken, and that she is accompanied by a \"vortex of damnation\". It is now clear that the virgin, now reborn, will soon die, unless the Night Watch finds the one who cursed her. Geser gives Anton an assistant, a stuffed owl named Olga. Anton laughs and refuses, until he sees Geser throw Olga out the window, whereupon she turns into a living owl and flies away. At Anton's apartment, the owl arrives and shape shifts into a woman.\nKostya arrives and says he knows that Anton killed the vampire Dark Other. Anton and Olga track Yegor to his home, where they must enter the Gloom, as Yegor is there hiding from the female vampire. The Gloom almost consumes Yegor, but a blood sacrifice from Anton satisfies it enough for them to escape. Emerging from the Gloom, Anton sees a photo of Yegor and his mother, who is apparently Anton's ex-wife, thereby revealing that Yegor is his son. The Night Watch members, Tiger and Bear, stay behind to protect Yegor, but as soon as they are distracted, the boy escapes and follows the call of the female vampire. During this time, Zavulon is seen working on a computer prediction in which he is fighting with someone, constantly losing.\nAnton and Olga arrive at a command and control center set up near the apartment of Svetlana, the cursed woman from the subway train. A vortex capable of immense destruction has appeared over her apartment and bad things have been happening to those near her. Just before Anton goes into speak with her, Svetlana tells her neighbor Gregori that his mother has died, and this sets off a series of events that will shortly cause a nuclear meltdown unless the curse is abated. Anton enters Svetlana's apartment under the guise of needing medical care and talks to her, revealing that she cursed herself on her own, which also means she is an Other. As soon as this is revealed, the curse ends and the vortex disappears. Yegor escapes the grip of the female vampire, but is caught by Zavulon, who appears on the roof. During a duel, Anton attempts to stab Zavulon, but Zavulon sidesteps the swipe just as Yegor runs up. Zavulon stops Anton's momentum, both saving Yegor's life and making it appear as if Anton were attempting to kill his son. Zavulon's assistant reads Anton's personal file aloud. When Yegor finds out that Anton tried to kill him before he was born, and that he has special powers that the prophecy says are held by the Great One, he willingly turns to the Darkness, to Anton's great dismay. An afterword describes that as Yegor has chosen the Dark, he will lead the world into Darkness, but as long as there are those who choose to fight the Darkness all around them, there is hope."}