{"mid": "NightOfTheCreeps", "IMDB_id": "tt0091630", "title": "Night of the Creeps", "plot": "In 1959, on board a spacecraft, two aliens race to keep an experiment from being released by a third member of the crew. The seemingly possessed third alien shoots the canister into space where it crashes to Earth. Nearby, a college man takes his date to a parking spot when they see a falling star and investigate. It lands in the path of an escaped criminally insane mental patient. As his date is attacked by the axe-wielding maniac, the boy finds the canister, from which a small slug-like thing jumps out and into his mouth.\nTwenty-seven years later, Chris Romero pines over a love lost, supported by his disabled friend J.C. During pledge week at Corman University, Chris spots a girl, Cynthia Cronenberg, and falls instantly in love. To get her attention, he decides to join a fraternity. Cynthia's boyfriend, who heads the Beta Epsilon fraternity, tasks them with stealing a cadaver from the university medical center and depositing it on the steps of a sorority house. Chris and J.C. find a frozen corpse in a secret room, but when it grabs them, they flee.\nMeanwhile, Detective Ray Cameron, a haunted cop, is called in to the cryogenics lab break-in, where he discovers one of the bodies – the boy who discovered the alien experiment in 1959 – is now missing, set free by Chris and J.C. The corpse makes its way back to the sorority house where he picked up his date twenty-seven years ago. There, his head splits open and releases more of the slugs. Called to the scene, Det. Cameron finds the body, interpreting the condition of the head as the result of an axe wound in the face.\nThe next day, the fraternity brothers confront Chris and J.C., who they believe to be responsible for the previous night's incident. They are then taken in for questioning by the police. Based on the testimony of a janitor that witnessed them running out of the university medical center, \"screaming like banshees,\" they confess to breaking in but deny moving the corpse. That night, a dead attendant rises from his slab and runs into the same janitor.\nCynthia attempts to convince Chris and J.C. that the attacks are zombie-related, but they are skeptical. When J.C. sees Cynthia leaning on Chris' shoulder, J.C. leaves the two alone and is attacked by the possessed janitor. As Chris walks Cynthia back to the sorority house, he runs into Det. Cameron, who has overheard everything. At his house, Det. Cameron explains to Chris that the escaped lunatic's 1959 victim was his ex-girlfriend, and that he secretly hunted down and killed the axe-murderer in revenge. After Det. Cameron reveals that he buried the body under what is now the sorority house, he gets a call that the same axe-wielding lunatic has killed the house mother. Det. Cameron blows off the corpse's head with his shotgun, which releases more slugs.\nThe next night, while everyone prepares for a formal dance, Chris finds a recorded message that J.C. posthumously left for him. J.C. says that the slugs have incubated in his brain, but he has discovered that they are susceptible to heat. Chris recruits Det. Cameron, who was in the midst of a suicide attempt, and they retrieve a flamethrower from the police armory. They arrive at the sorority house just as Cynthia breaks up with Brad, who has become possessed. After killing him, the Beta fraternity brothers show up, despite having been killed in a bus crash. Cynthia and Chris team up to destroy the outside zombies, and Det. Cameron clears the house.\nAfter they stop the horde, Chris spots more slugs racing toward the basement; Cynthia explains that a member of the sorority had received specimen brains for biology class. In the basement, they find an enormous pile of slugs, and Det. Cameron, tape across his mouth, prepping a can of gasoline. Det. Cameron begins counting down as he splashes gasoline, and Cynthia and Chris count down in sync with him as they race out of the house. Just as several slugs leap at him, he flicks his lighter, and the house goes up in a fiery explosion. Chris and Cynthia share a kiss as they watch the house burn. The scene ends when the dog who caused the bus accident returns, opens its mouth, and a slug jumps out.\n=== Alternate ending ===\nThough not shown theatrically upon its original release, the original ending showed Chris and Cynthia standing in front of the burning sorority house, then moved to the street where police cars race down the street. The charred and 'zombified' Cameron is shuffling down the street when he suddenly stops and falls to the ground. His head explodes and the slugs scamper out and head into a cemetery, as the spaceship from the beginning of the film has returned with the aliens intending to retrieve their experiment, proposing a sequel.\nThis original ending is on the official DVD and Blu-ray release of the film, and can be seen in some television broadcast versions of the film, via Crackle's online streaming service, some US VHS copies, and on bootleg DVD copies.\n=== Unofficial sequel ===\nZombie Town was marketed in some regions as a sequel, being alternatively titled Night of the Creeps 2: Zombie Town in Germany."}