{"mid": "NightTrainToLisbon", "IMDB_id": "tt1654523", "title": "Night Train to Lisbon", "plot": "Walking over a bridge in Bern, Raimund Gregorius, a Swiss professor of ancient languages, notices a young woman in a red coat standing on the railing, about to leap. Dropping his briefcase, he runs and pulls her down. She helps him gather the papers that have spilled from his briefcase and accompanies him to the school where he teaches. But instead of waiting to talk, she leaves during the middle of his class, without her coat.\nConcerned, Raimund grabs the coat and runs after her, but in vain. He checks her pockets for identification. All he finds is a small book, a memoir of sorts, by Amadeu do Prado. It is stamped with the address of the bookstore, so he goes there. The bookseller remembers the girl's purchasing this obscure book and, as he leafs through it, a train ticket to Lisbon falls out. The train is, in fact, leaving in 15 minutes. Confused and doubtful, Raimund rushes to the station, but the woman is nowhere in sight. At the last moment he decides to use the ticket himself, and during the journey he reads the book.\nAmadeu do Prado lived in Lisbon, so Raimund searches for him, hoping that this will lead to the woman. He finds Amadeu's home, where the writer's sister, Adriana, welcomes Raimund; she gives the impression her brother still lives there. Raimund learns that Amadeu was a doctor, and that only 100 copies of his book were printed. When Raimund asks what happened to their father, Adriana's reaction is hostile. As Raimund is leaving, the maid informs him that he can find Amadeu in the town's cemetery. Raimund finds the tomb: Amadeu died in 1974.\nIn the street, a bicyclist runs into Raimund and smashes his glasses. While obtaining new glasses from a local optician, Mariana, Raimund narrates his experiences. When he returns to collect the glasses, Mariana tells Raimund her uncle knew Amadeu de Prado well and is willing to talk to Raimund.\nRaimund and Mariana both go to the nursing home where her uncle João Eça resides, and Raimund learns João and Amadeu were both in the resistance against the Salazar dictatorship, which story is told in continuing flashbacks as the film continues. Raimund then visits the priest who taught and later buried Amadeu de Prado. The priest explains that Amadeu, a smart young boy from an aristocratic background, befriended Jorge O'Kelly, another bright boy in the school though of lowly means. The boys bonded through their love for knowledge, particularly the philosophical and political knowledge not permitted under Salazar. Amadeu gave a graduation speech that reflected his contempt for the regime, much to the chagrin of his father, a well respected judge.\nRaimund returns to Adriana and asks for her side of the story, and then he revisits João to obtain more information. Raimund learns that Amadeu died of an aneurysm, which he knew he had, but had not told Adriana about. As a doctor, Amadeu never refused a patient, and when Mendez, a powerful member of the Salazar regime, called \"the Butcher of Lisbon\", was brought to Amadeu's clinic, he saved the man's life. Amadeu's friends were shocked by this, especially Jorge, who at that time was already in the resistance. Later, Amadeu confronted Jorge and declared that he too would join the resistance. Jorge introduced Amadeu to João and to Estefânia, a beautiful woman who helped the resistance by memorizing people's names and contact information, and whom they were both attracted to. When the revolution against Salazar began, Amadeu was able to smuggle Estefânia to safety in Spain. Raimund learned where she went and went there to see that she was still alive.\nRaimund finally meets the woman from the bridge again, in Lisbon; she had felt suicidal because she had just learned from the book that her beloved grandfather was the Butcher of Lisbon, but she is learning to accept this.\nThe events become a catalyst to Raimund's life, in a gentle sort of way. He informs the school that he is now returning to his job. Mariana goes to the railway station with him and, at the last moment, suggests he could instead stay."}