{"mid": "NightMoves", "IMDB_id": "tt0073453", "title": "Night Moves", "plot": "Harry Moseby (Gene Hackman) is a retired professional football player now working as a private investigator in Los Angeles. He discovers that his wife Ellen (Susan Clark) is having an affair with a man named Marty Heller (Harris Yulin).\nAging actress Arlene Iverson (Janet Ward) hires Harry to find her 16-year-old daughter Delly Grastner (Melanie Griffith). Arlene's only source of income is her daughter's trust fund, but it requires Delly to be living with her. Arlene gives Harry the name of one of Delly's friends in Los Angeles, a mechanic called Quentin (James Woods). Quentin tells Harry that he last saw Delly at a New Mexico film location, where she started flirting with one of Arlene's old flames, stuntman Marv Ellman (Anthony Costello). Harry realizes that the injuries to Quentin's face are from fighting the stuntman and sympathizes with his bitterness towards Delly. He travels to the film location and talks to Marv and stunt coordinator, Joey Ziegler (Edward Binns). Before returning to Los Angeles, Harry is surprised to see Quentin working on Marv's stunt plane.\nHarry suspects that Delly may be trying to seduce her mother's ex-lovers and travels to the Florida Keys, where her stepfather Tom Iverson (John Crawford) lives. In Florida, Harry finds Delly staying with Tom and a woman named Paula (Jennifer Warren). Harry, Paula, and Delly take a boat trip to go swimming, but Delly becomes distraught when she finds the submerged wreckage of a small plane with the decomposing body of the pilot inside. Paula marks the spot with a buoy, and when they return to shore, she appears to report the find to the Coast Guard.\nHarry persuades Delly to return to her mother in California. After he drops her off at her California home, he still is uneasy about the case, but focuses on patching up his own marriage. He tells his wife he will give up the agency, something she has wanted him to do for a long time, but then he learns that Delly has been killed in a car accident on the set of a movie.\nHarry questions the driver of the car, Joey, who was injured. Joey lets him view footage of the crash, which raises Harry's suspicions about Quentin the mechanic. He goes to the home of Arlene Iverson and finds her drunk by the pool, not particularly grief-stricken over the death of her daughter. Arlene now stands to inherit her daughter's wealth. Harry tracks down Quentin, who denies being the killer, but tells him that Marv Ellman was the dead pilot in the plane and that Ellman was involved in smuggling. Quentin manages to escape before Harry can learn more.\nHarry returns to Florida, where he finds the body of Quentin the mechanic floating in Tom's dolphin pen. Harry accuses Tom of the murder, they fight, and Tom is knocked unconscious. Paula admits she did not report the dead body in the plane because the aircraft contained a valuable sculpture that they were smuggling piecemeal to the United States. Harry and Paula set off to retrieve the sculpture. While Paula is diving, a seaplane arrives and the pilot strafes the boat, machine-gunning Harry in the leg. The seaplane lands on the ocean, but when the pilot sees Paula surface with the sculpture, he charges the plane at her and she is killed. The impact of the pontoons on the surfaced sculpture shatters the seaplane, and as the cockpit submerges into the ocean, Harry is able to see through the glass window beneath his boat that the drowning pilot is Joey Ziegler.\nHarry unsuccessfully tries to steer the boat which is now travelling in circles.\n=== My Night at Maud's ===\nAn often quoted line from Night Moves occurs when Moseby declines an invitation from his wife to see the movie My Night at Maud's: \"I saw a Rohmer film once. It was kinda like watching paint dry.\" The exchange from Night Moves was quoted in director Éric Rohmer's New York Times obituary in 2010. Penn himself was an admirer of Rohmer's films; Jim Emerson has written that, \"Harry's remark, as scripted by Alan Sharp, is a brittle homophobic jab at a gay friend of his wife's.\" Bruce Jackson has written an extended discussion of the role of My Night at Maud's (1970) in Night Moves; viewers familiar with the earlier film may recognize that its protagonist and Moseby have related opportunities for infidelity, but respond differently."}