{"mid": "NightmareAlley", "IMDB_id": "tt0039661", "title": "Nightmare Alley", "plot": "Stanton Carlisle watches the geek show at a Ten-in-One where he has recently begun working. He later asks the carnival's talker Clem Hoately where geeks come from. Clem explains that geeks are \"made\": a sideshow owner finds an alcoholic bum and offers him a temporary job with a steady supply of liquor. Initially, the bum is only asked to pretend to be a geek, using a razor blade to slice chickens' necks and then faking the drinking of the blood. After a few weeks, the owner threatens to end the job and replace the bum with a \"real\" geek, and the fear of sobering up terrifies the bum into actually biting the chickens. Thus, a geek is made.\nStan performs sleight of hand tricks in the sideshow but studies under the carnival's mentalist Zeena to learn a refined \"code\" act, where performers memorize verbal cues that allow them to appear psychic by accurately answering written audience questions. Stan also begins to pick up Zeena's talent for cold reading. He eventually leaves the carnival with beautiful and naïve electric girl. Molly Cahill to perform a team code act.\nTheir act becomes very successful, but Stan grows bored and transforms himself into Reverend Carlisle, an upstanding Spiritualist preacher offering séance sessions with the help of his medium (Molly, appearing as \"Miss Cahill\" to obfuscate their relationship). Stan gains a devoted following, but the stress of leading a false life leads him to seek the help of psychologist named Lilith Ritter, who seduces and then begins controlling him. Stan pleads constantly for them to go away together, and Lilith eventually agrees, suggesting the Rev. Carlisle swindle a rich man for the getaway money. They settle on Ezra Grindle, a ruthless auto tycoon with a skeptical interest in the occult. Stan manages to convince Grindle of his powers, and the businessman becomes a devoted spiritualist.\nStan keeps Grindle hooked by promising to reunite him with his deceased college sweetheart Dorrie, who died in a botched back-alley abortion Grindle convinced her to seek. A reluctant Molly plays \"Dorrie\" in a series of sessions but eventually breaks character, destroying the illusion, and Grindle vows revenge for Stan's lies. Stan tells Molly to go back to carnival life. At Lillith's suggestion he decides to go into hiding with Grindle's money but discovers that Lillith has stolen it. When he confronts her, she threatens to have him committed to a mental institution, and he narrowly escapes. He flees and resorts to performing as a mentalist at increasingly shoddy venues, barely evading the men Grindle continually sends after him. Eventually he becomes a hobo, staying afloat by giving Tarot readings and selling horoscopes. He descends into alcoholism and depression.\nHis life in shambles, Stan finds a carnival owner and asks to join the sideshow as a palm reader. The owner gives Stan some whiskey but refuses his proposal, saying the show is full. But as Stan begins to drunkenly stumble out, the owner changes his tune and invites Stan back in with a job offer: \"Of course, it's only temporary – just until we get a real geek.\""}