{"mid": "Nikita", "IMDB_id": "tt1592154", "title": "Nikita", "plot": "Nikita (Anne Parillaud) is a teenage junkie who participates in the robbery of a pharmacy owned by a friend's parents. The robbery goes awry, erupting into a gunfight with local police, during which her accomplices are killed. Suffering severe withdrawal symptoms, she murders a policeman. Nikita is arrested, tried, and convicted of murder and is sentenced to life in prison.\nIn prison, her captors fake her death, making it appear that she has committed suicide via a tranquilizer overdose. She awakens in a nondescript room, where a well-dressed but hard-looking man named Bob (Tchéky Karyo) tells her that, although officially dead and buried, she is in the custody of a shadowy government agency known as \"the Centre\" (possibly part of the DGSE). She is given the choice of becoming an assassin, or of actually occupying \"row 8, plot 30\", her fake grave. After some resistance, she chooses the former and gradually proves to be a talented killer. She is taught computer skills, martial arts, and firearms. One of her trainers, Amande (Jeanne Moreau), transforms her from a degenerate drug addict to a beautiful femme fatale. Amande implies that she was also rescued and trained by the Centre.\nHer initial mission, killing a foreign diplomat in a crowded restaurant and escaping back to the Centre from his well-armed bodyguards, doubles as the final test in her training. She graduates and begins life as a sleeper agent in Paris (under the name Marie). She meets Marco (Jean-Hugues Anglade) in a supermarket, and he becomes her boyfriend, knowing nothing of her real profession. Marco is curious about her past and why she has no family or other friends. Nikita then invites Bob to dinner as \"Uncle Bob.\" Bob tells stories about \"Marie\"'s imaginary childhood, and gives the couple tickets for a trip to Venice as an engagement gift.\nNikita and Marco go on the trip and during their preparation to make love, the phone rings. She thinks it's the room service they just ordered, but it is instructions for her next job. She goes to the bathroom and as she prepares the rifle, Marco is attempting to talk to her though the door. The instructions on who to shoot take longer than expected and she can't answer him. She finally gets the instructions and takes out her target. She is barely able to conceal the rifle before Marco walks in, against her wishes. By then, she is distraught because she has ignored and hurt him due to her job.\nStill, her career as an assassin goes well until a document-theft mission in an embassy goes awry. The Centre sends in Victor \"The Cleaner\" (Jean Reno), a ruthless operative, to salvage the mission and destroy all the evidence of the foul-up. When one of the operatives turns on him, Nikita is forced to take his place. They make it most of the way through the mission when it goes bad. The gate is closed and he takes on a bunch of guards before being fatally wounded, but drives them to safety before succumbing to his wounds. Marco reveals that he has discovered Nikita's secret life, and, concerned over how her activities are affecting her psychologically, persuades her to disappear. Upon discovering that she abandoned the Centre, Bob goes to their apartment where he meets with Marco. Bob says she can't be out of danger because she still has the documents, after which Marco hands them over. They agree that they will both miss her."}