{"mid": "NineDead", "IMDB_id": "tt0959329", "title": "Nine Dead", "plot": "The nine characters are revealed to be: 1 — a petty criminal (Christian), 2 — a police officer (Jackson), 3 — an illegal gun seller (Leon), 4 — a strip club owner and loan shark (Sully), 5 — an Assistant District Attorney for LA County (Kelley), 6 — a pedophile and rapist (Coogan), 7 — a priest (Father Francis), 8 — a health insurance executive (Eddie), and 9 — a Chinese store owner who does not know English (Nhung Chan).\nAfter a string of kidnappings, these nine people are locked inside a room and handcuffed to pipes. Then a masked man enters and explains each of them are there for a reason, and to survive, they must figure out how they are all connected. He further explains that he will kill one of them every ten minutes until they figure it out. The shooter leaves and a countdown begins. The group begins introducing themselves, and a few early connections are made. Christian says he once borrowed money from Sully, but paid it back. Coogan mentions he has been in multiple prisons. Kelley and Jackson are former lovers. Just as the group begins to think it is all a hoax, the shooter enters and kills Christian. After the masked man leaves, Leon has Sully stomp on his hand until it breaks, freeing himself from his handcuffs. He attempts to escape, but is caught and brought back by the shooter. The shooter then kills Coogan, who has mentioned earlier that he is dying anyway. Before he shoots him he whispers the reason in Coogan's ear. Then Coogen attacks the masked man and is shot. The shooter tells Leon he will be the next to die.\nWith seven people left, Mrs. Chan recognises Kelley as her former lawyer after Mrs. Chan's store was robbed two years earlier. The group begins to see connections between themselves and the robber, Wade Greeley. The shooter returns, but as the seven only know part of the story, he shoots Leon. With the theory in doubt, it becomes clear that Father Francis knows more than he is admitting, but refuses to give further information. Eventually, it is determined that Greeley did not rob the store; the real robber, Christian, confessed to Father Francis that he committed the robbery in order to gain enough money to pay back Sully. However, when shown a line-up, Mrs. Chan mistakenly identified Greeley as the robber, and Kelley prosecuted him. At this point, the shooter reenters, and since not all of the connections have been establish, he tries to kill Eddie, but Father Francis puts himself in the path of the bullet and is killed instead. When Kelley calls him Wade, he denies being Wade Greeley and leaves. Once the shooter leaves, Sully realizes that before Christian robbed Mrs. Chan's store, he didn't have a gun, and must have bought one from Leon. Mrs. Chan is the next to be shot. As she begs for her life however, he speaks to her in Chinese, and the father-son relationship between the Shooter and Wade Greeley is revealed to viewers who understand Chinese. Kelley begs to be let go to be with her son, but the shooter is visibly angry Kelley used her son as an excuse, and leaves, but not before hinting Jackson is the father of Kelley's baby.\nKelley confirms that Jackson is the father of her son, and also reveals she fabricated evidence to convict Greeley, saying she needed to win a case after many losses. She also reveals that Jackson unknowingly helped her falsify evidence, and that she once murdered a man who raped her, and swept it under the rug when the man's body was found. Eddie realizes the shooter must be Greeley's father, exacting revenge, and the remaining four begin to wonder what happened to Greeley after he went to prison. The shooter returns and kills Sully, who has no regret for his actions. With only Kelley, Jackson, and Eddie left, the three struggle to establish connections for Eddie and Coogan. Eddie supposes that Coogan was earlier referring to being infected with AIDS, and, as he has been in multiple prisons, could have raped Greeley and infected him. Then the final connection is made; Greeley applied for an experimental drug treatment (run by Eddie's company) for HIV, but Eddie would have had to reject him due to his criminal conviction. They explain this to the shooter, Greeley's father, who agrees to let them all go. Kelley is released, but, having slowly revealed her true nature, steals the shooter's gun and shoots Greeley's Father, Eddie, and Jackson. Greeley's father, who was wearing a kevlar vest, recovers momentarily to reveal that the whole time \"everybody has been watching\" and that they now know \"who the real Kelley Murphy is\". He is then shot in the head, and Kelley escapes as the police arrive."}