{"mid": "NineteenEightyFour", "IMDB_id": "tt0087803", "title": "Nineteen Eighty-Four", "plot": "Winston Smith is a man who lives in Airstrip One, the remnants of Britain broken down by war, civil conflict, and revolution. A member of the middle class Outer Party, Winston lives in a one-room London apartment flat. His sustenance consists of black bread, synthetic meals, and \"Victory\"-branded gin. Telescreens in every building, accompanied by microphones and cameras, allow the Thought Police to identify anyone who might compromise the Party's regime. Children are encouraged to inform the officials about potential thought criminals, including their parents.\nWinston works at the Ministry of Truth, or \"Minitrue\", as an editor. He is responsible for historical revisionism; he rewrites records and alters photographs to conform to the state's ever-changing version of history itself, rendering the deleted people \"unpersons\"; the original documents are destroyed by fire in a \"memory hole\". Despite being good at his job, Winston becomes mesmerized by the true past and tries to get more information about it. In a place beside his flat's telescreen where he believes he cannot be seen, he begins writing a journal criticizing the Party and its enigmatic leader, Big Brother. By doing so, he commits a crime that, if discovered by the Thought Police, warrants certain death. Julia, a young woman who maintains the novel-writing machines at the ministry and whom Winston loathes, surreptitiously hands Winston a note confessing her love for him. Winston and Julia begin an affair after Winston realizes she shares his loathing of the Party, first meeting in the country, and eventually in a rented room at the top of an antiques shop. They believe that the shop, being located in a proletarian neighbourhood of London, is safe, as the room has no telescreen.\nWeeks later, Winston is approached by O'Brien, an Inner Party member whom Winston believes is an agent of the Brotherhood—a secret underground society that intends to destroy the Party. They arrange a meeting at O'Brien's flat where both Winston and Julia swear allegiance to the Brotherhood. A week later, O'Brien clandestinely sends Winston a copy of \"The Book\", The Theory and Practice of Oligarchical Collectivism by Emmanuel Goldstein, the publicly reviled leader of the Brotherhood. The Book explains the concept of perpetual war, the true meanings of the slogans \"War is peace\", \"Freedom is slavery\", and \"Ignorance is strength\", and how the Party can be overthrown through means of the political awareness of the proles (proletarians).\nIn a surprising turn, the Thought Police capture Winston along with Julia in their rented room. The two are then delivered to the Ministry of Love (Miniluv) for interrogation. Mr. Charrington, the shopkeeper who rented the room to them, reveals himself as a Thought Police agent. O'Brien is also an agent of the Thought Police. He is part of a special sting operation used by the police to find and arrest suspected thoughtcriminals. O'Brien interrogates and tortures him with electroshock, telling him that Winston can \"cure\" himself of his \"insanity\"—his manifest hatred for the Party—through controlled manipulation of perception. Winston confesses to crimes that O'Brien tells him to say that he has committed, but O'Brien understands that Winston has not betrayed Julia. O'Brien sends him to Room 101 for the final stage of re-education, a room which contains each prisoner's worst nightmare. Winston shouts \"Do it to Julia!\" as a wire cage holding hungry rats is fitted onto his face, thus betraying her.\nAfter being put back into society, Winston meets Julia in a park. She admits that she was also tortured, and both reveal betraying the other. Later, Winston sits alone in the Chestnut Tree Cafe, troubled by memories which he is sure are lies. A raucous celebration begins outside, celebrating Oceania's \"decisive victory\" over Eurasian armies in Africa, and Winston imagines himself as a part of the crowd. Winston feels he has at last ended his \"stubborn, self-willed exile\" from the love of Big Brother—a love Winston returns quite happily as he looks up in admiration at a portrait of Big Brother."}