{"mid": "Nixon", "IMDB_id": "tt0113987", "title": "Nixon", "plot": "The movie starts in 1972 with the “plumbers” breaking into The Watergate and subsequently getting arrested. 18 months later (Dec.1973). Nixon's’ Chief Of Staff, General Alexander “Al” Haig (Powers Boothe) brings Pres. Richard “Dick” M. Nixon (Anthony Hopkins) tapes to listen to. The two men talk about The Watergate Scandal, and about what a mess it has become. After talking about the death of J Edgar Hoover. Nixon goes on to curse out John Dean James McCord and others involved in Watergate. As Haig turns to leave, Nixon asks Haig why he hasn't been given a pistol to commit suicide like an honorable soldier.\nNixon starts the taping system which trigger memories that start a series of time jumps. The first, takes us back to June 23, 1972 about a week after the break in. To a meeting with Halderman( James Woods) Erlichman(J.T Walsh) And Dean (David Hyde Pierce). Ehrlichman and Dean leave, Nixon speaks the “Smoking Gun” tape to Halderman.\nThe film covers most aspect of Nixon's life and political career. The film implies that Nixon and his wife abused alcohol and prescription medication. Nixon's health problems, including his bout of phlebitis and pneumonia during the Watergate crisis, are also shown in the film, and his various medicants are sometimes attributed to these health issues. The movie also hints at some kind of responsibility, real or imagined, that Nixon felt towards the John F. Kennedy assassination through references to \"the Bay of Pigs\", the implication being that the mechanisms set into place for the invasion by Nixon during his term as Dwight D. Eisenhower's vice-president spiraled out of control to culminate in the assassination and, eventually, Watergate.\nThe film ends with Nixon's resignation and famous departure from the lawn of the White House on the helicopter, Army One. Real life footage of Nixon's funeral in Yorba Linda, California plays out over the extended end credits, and all living ex-presidents at the time, Gerald Ford, Jimmy Carter, Ronald Reagan, George H. W. Bush, and then-president Bill Clinton, are shown in attendance."}