{"mid": "NobodysFool", "IMDB_id": "tt0091642", "title": "Nobody's Fool", "plot": "Donald \"Sully\" Sullivan (Newman) is a worn yet spry hustler living in the peaceful, snowy northern New York state village of North Bath. He free-lances in the construction business, usually with his dim-witted friend Rub (Vince) by his side. He is often at odds with Carl Roebuck (Willis), a local contractor, suing him at every opportunity for unpaid wages and disability. Sully's one-legged lawyer Wirf (Saks) is inept, and his lawsuits are repeatedly dismissed. As a way to irritate him, Sully flirts with Carl's wife Toby (Griffith) openly at every opportunity (which she enjoys). He is a regular at the Iron Horse Saloon, where he often has drinks and plays cards with Wirf, Carl, Rub, and the town sheriff.\nA running joke is the repeated theft of Carl's snowblower. Sully steals it to get back at Carl for his latest failed lawsuit. Carl steals it back, placing it in the yard at his construction business guarded by his doberman pinscher guard dog. Sully, after drugging the dog, steals it a second time. Carl takes it back a final time, and leaves the dog, who is now skittish due to his drugging, at Sully's childhood home for him to find.\nSully is a tenant in the home of the elderly Miss Beryl (Tandy), whose banker son Clive (Sommer) strongly urges her to kick him out and sell the house. Family complications of his own develop for Sully with a visit from Peter (Walsh), his estranged son who is a jobless professor at odds with his wife. While he and Sully reconstruct their relationship, Sully begins a new one with young grandson Will (Alexander Goodwin). Peter’s sudden everyday presence does not sit well with Rub, but Sully tells him that although Peter is his son, Rub is still his best friend. Meanwhile, Clive is on the verge of a lucrative deal to build an amusement park in North Bath. However, the deal unexpectedly falls through when the promoter turns out to be a con man, and Clive quietly skips town in shame since he used his bank's resources to help finance the amusement park.\nAfter being jailed for punching a police officer named Raymer (Hoffman) who has been persecuting him, Sully's luck seems to be all bad. But his son and grandson start to warm up to him, and his fortune takes a turn for the better when his horse racing trifecta ticket wins. Even the lovely Toby expresses a willingness to leave Carl, mostly due to his constant womanizing, and run away with Sully to Hawaii. Sully realizes he can’t leave his grandson and thanks Toby for considering him, just before she leaves for the airport. In the end, Sully is pretty much back where he began, boarding at Miss Beryl's. But now he is a little richer, both financially and in his soul, he's a new dog owner, and he has become the picture of contentment."}