{"mid": "NoDepositNoReturn", "IMDB_id": "tt0074968", "title": "No Deposit, No Return", "plot": "Siblings Tracy and Jay begin their Easter holidays with disappointment as they hear their mother, Carolyn, whom they had expected to pick them up from school, is instead in Hong Kong. Before she left, she made plans that the two children spend the vacation with their grandfather, Los Angeles billionaire J.W Osborne. Neither the children nor Osborne are enthused. Osborne, who has bad experiences with the children, takes steps to ensure the same level of chaos is not repeated.\nDuring the plane trip, Jay realizes he has mislaid his pet skunk, Duster. In the horror and panic ensuing from the loss, Osborne's loyal butler, Mr. Jamieson, fails to meet them at the airport, and the children make their escape in a taxi. Meanwhile, at the same airport, safe-crackers and robbers Duke and Bert sneak their way into the airport offices to crack the airport safe. However, after opening it, Bert accidentally locks it. Out of time, they escape out of the airport, only to discover their escape vehicle has been towed. They scramble for a taxi, shared with Tracy and Jay.\nAt Duke and Bert's apartment, Duke attempts to shake them off but, through Tracy's excellent play acting, his better nature prevails and he invites the children to spend the night. Unawares to the children, Osborne caught sight of them as they left the taxi, and followed them all the way to Duke and Bert's. Because the children appear to be in no immediate danger, Osborne leaves them where they are.\nThe next day, Tracy devises a plan to follow Carolyn to Hong Kong in which they pay for their plane travel by mailing Osborne a fake ransom note, demanding $100,000 by 4:00pm that same day. Meanwhile, Duke and Bert receive a visit from Big Joe, a local gangster to whom they owe money. The amount owed has shot up considerably since the three last spoke, and Joe reminds Duke he has 72 hours to pay it back. Desperate, they go along with Tracy's plan but fail to get any money, as Osborne knows about the scam.\nTracy does not give up and makes a bogus call to the police insinuating a kidnapping. This puts Sergeant Turner on the case, an officer hell-bent on catching Duke, who is known for the safe-cracking method and for having not stolen anything. It also brings Carolyn back to America, demanding an explanation as to how the children have gone missing. Time is running out for Duke and Bert. After several negotiations, the ransom is considerably lower, and a meeting is arranged by the docks, exchanging money for the children. However, the police only have ideas of catching the kidnappers and are completely unaware Osborne knows the children's location. Duke clocks on to their plan before they are caught, and a frantic car chase through the docks ensues. Carolyn leaps into the back of Duke and Bert's car as they speed off and is then made aware that her children are in no immediate danger. The chase ends in Sgt Turner's deputy, Detective Longnecker, writing off the police cruiser and driving it into the water.\nTracy and Jay make it back to Osborne's, having averted Big Joe. They go into his safe and hide when they hear him coming but find themselves in big trouble when Jamieson shuts the safe and locks it. Duke, Bert, and Carolyn trace the children back to the house and find Jamieson, who claims the children are not in the house. Carolyn is not convinced, and a sighting of Duster proves her theory. None of them know the combination to the safe however, and have only a short amount of time before the air in the safe runs out. Its then up to Duke to use his safe-cracking skills to open the safe. Sgt. Turner then arrives at the house and, upon witnessing Duke crack a safe to save the children, declines to arrest him. Osborne then pays off Duke and Bert's debts and reconciles with his children. Duke also manages to set up his own garage; the film ends hinting romance between Duke and Carolyn."}