{"mid": "NoneButTheLonelyHeart", "IMDB_id": "tt0037135", "title": "None But the Lonely Heart", "plot": "Ernie Mott (Cary Grant) is a restless, irresponsible, wandering Cockney with a good musical ear. On Armistice Day, Ernie visits the tomb of the Unknown Warrior in Westminster Abbey, which memorializes those who died in World War I, including his father. Ernie wants a better life but does not want to settle down or work for it. When he returns home, Ma Mott (Ethel Barrymore) asks why he has returned after so long, and she gives him an ultimatum that he must stay home now or leave forever. He informs her that he will then be leaving next morning, and goes out to get a drink. He meets fellow musician Aggie Hunter (Jane Wyatt) outside the bar, but instead prefers the company of a gangster's fickle former wife, Ada Brantline (June Duprez). However, when Ernie becomes smitten with Ada she rejects his offer of a date when he tells her he will be leaving town tomorrow.\nThe next morning, Ma Mott tells her pawnbroker friend, Ike Weber (Konstantin Shayne), that she has cancer. Ma and Ernie get into another fight, but after he storms out, Ike shares with him that his mother needs him in her battle with cancer. Ernie returns and says that he will stay with her at home and help her run her shop.\nA month passes, and Ernie continues to pursue Ada. However, when gangster Jim Mordinoy (George Coulouris) informs him that she's still his wife, Ernie doesn't believe Ada when she says that's a lie and he cuts her off socially. Ernie begins to notice the poverty surrounding him in London, and chooses to accept Mordinoy's offer to join his activities, even against Ada's pleas. Ernie begins to steal cars, and he is involved in a police chase until his car collides with a truck and explodes into flames. Ada implores him to run away with her, but he does not want to leave his dying mother.\nWhen Ernie is eventually bailed out of jail by Ike, he finds out that after the police find Ernie's platinum cigarette case—his birthday gift from Ma—was stolen, the police arrest her and put her in prison. She begs for forgiveness for shaming the family, and dies in prison hospital. When he returns home, he learns via a letter from Ada that she decided to stay with Mordinoy because that would make her life easier. Ernie is crushed, and walks along the street until he gets to Aggie's door and walks in."}