{"mid": "NoOneWouldTell", "IMDB_id": "tt0117191", "title": "No One Would Tell", "plot": "Stacy Collins (Candace Cameron) is a shy 16-year-old high school student who has secretly been in love with Bobby Tennison (Fred Savage) for two years. She is surprised when he starts to show a romantic interest in her, considering he is a senior wrestler and the most popular guy in school. They soon start dating and find out that both their fathers had abandoned them. She is upset that her mother, Laura (Michelle Phillips), is dating a man named Rod who treats her very badly, and she is often urging her to leave him and treat herself better. After a few weeks of dating, Bobby starts showing possessive behavior. He is jealous whenever another guy approaches or talks about her inappropriately, and doesn't want her to hang out with her friends when they are together. At first, she doesn't suspect that there is anything wrong, because he immediately apologizes after getting mad at her and tells her that he loves her and gives her gifts to show his remorse.\nStacy soon promises to him that they will be together forever. She also agrees not to hang out with other people anymore if he is not present. At school, boys start to notice her after her best friend, Nicki (Heather McComb), convinces her to wear a mid-thigh high skirt for Bobby. In the boys' locker room, one of his friends makes a comment about her looking hot, which outrages him. After this, he furiously calls her a slut and demands that she wear proper clothes and forces her to change the skirt in the school bathroom and into some track pants. She tries to explain that she was only dressing up for him, but he becomes more furious before throwing and slamming her into the wall. Back at home, Laura worries that she is spending too much of her time with him, but she assures her that he loves her and she requites these feelings. Meanwhile, Nicki and her friend, Val (Justina Machado), also grow concerned about her relationship with him. Nicki soon learns from his cousin, Donna (Paige Moss), that he has a history of hitting his old girlfriends and being abusive in his former relationships. Her worry only gets stronger when she notices that Stacy has several unexplained bruises on her body. She talks to her about what she heard, but Stacy, frustrated, assures her that she can take care of herself.\nBy accident, Stacy meets Bobby's mother; he catches them talking to each other and becomes furious and violent. Upset, she refuses to see him again and later takes it out on Laura, calling her irresponsible. He later wins her trust back by telling her about the alcoholism that runs in his family. They are happy for a while, but trouble begins again when he sees her talking to another guy at the school dance. He pulls her outside into the parking lot and slaps her, all of which is being watched by Nicki nearby. She quickly confronts her about how badly he is treating her, but she defends him, saying he's been through a lot. When Nicki flat out says that he doesn't love her, she angrily says, \"Then you don't know what love is!\" before taking off with him in his car. After Nicki helps her see the truth, she accepts that he isn't treating her right and ends their relationship. When he doesn't take the break-up well, she offers for them to just be friends, but they are soon estranged when he hears that she was talking to another boy at a birthday party and slaps her again despite them no longer dating.\nLater that night, Bobby, accompanied by his friend, Vince Fortner (Eric Balfour), convinces Stacy to get into his car for a ride. He drives to the lake and walks off with her to be alone. The next day, she goes missing. Most people guess that she hitchhiked and was murdered, but Laura suspects that Bobby has something to do with it after she finds Stacy's purse in his room. Nicki is also convinced that he is responsible for her disappearance and asks Carla (Martha Romo), a witness on the night that she disappeared, for information. Her reluctance to tell what happened frustrates Nicki. Accompanied by Laura, she goes to the police, informing Laura and Detective Anderson how abusive Stacy's relationship with Bobby was. Carla eventually talks to them as well, admitting that Bobby and Vince took Stacy to the lake.\nBobby and Vince are arrested and Bobby blames Stacy's disappearance on Vince, who, when confronted by this lie, admits that Bobby was the one last seen with her and later reveals that when he came back alone, he said that \"if he can't have her, no one's gonna\". Vince was free to go, since he told Detective Anderson the truth that he was unaware Bobby killed Stacey. Detective Anderson is then convinced he killed her when she ended the relationship and refused to get back together. When he confronts him, he realized he was cornered and shortly admits that he slit her throat when she refused to get back together with him and then disposed of her body in the lake. It is soon found in there wrapped in a trash bag with duct tape and tied down with cinder blocks. Laura and Nicki are left in tears. A court trial soon follows with the district attorney asking everyone if they ever saw him hit her. Carla says she did, but that it was because Stacy wouldn't listen to him. Donna and his other friends also admit that they witnessed the abuse, but figured she would leave him eventually. Val, Vince, Nicki and her boyfriend expose the abusive ways that he treated her, with Nicki saying how she desperately wanted to oust him, but was afraid of losing Stacy's friendship if she were to say what he was doing to her. He is eventually found guilty and sentenced to life in prison without the possibility of parole. The judge (Sally Jessy Raphael) tells the witnesses to tell someone next time they see a friend being abused instead of standing by and doing nothing, implying how it could have saved her from ultimately getting killed.\nLater, a distraught Nicki cleans out Stacy's locker and cries as she looks at the pictures of them, remembering their friendship and guiltily wishing that she had acted sooner to have saved her. The film ends with Nicki and her boyfriend leaving a bouquet of roses on the sand at the lake in memory of Stacy."}