{"mid": "NoRetreatNoSurrender2RagingThunder", "IMDB_id": "tt0097991", "title": "No Retreat, No Surrender 2: Raging Thunder", "plot": "In Moc Hoa, Vietnam, a group of prisoners are executed under the watchful eye of General Ty (Hwang Jang Lee). Meanwhile, Scott Wylde (Loren Avedon), an American college student, visits the country to visit his former teacher and best friend Mac Jarvis (Max Thayer), meeting Terry (Cynthia Rothrock), Mac's former lover, in the process. Terry tells Scott that Mac may be in Patpong, a seedy area of Bangkok. Scott leaves the gym and heads for his hotel.\nAt the hotel, Scott is harassed by a pimp. Once he makes his way into his room, he calls his girlfriend Sulin Nguyen (Patra Wanthivanond), inviting her to have dinner with him. During their date, Sulin's father (Perm Hongsakul) receives a disturbing phone call and leaves his house. A group of thugs crash into Scott's room and kidnap Sulin. Scott fights and kills the two thugs left behind to murder him. He heads to Sulin's house, where it is revealed that her entire family except her father has been killed. Scott is framed for the murders and drug possession. Despite Mr. Nguyen's pleas, the American consulate suggests sending Scott to Singapore and keeping him detained for three months. He escapes, heading to Patpong.\nAt Patpong, Scott finds Mac at the Super Star bar, arm wrestling with a local man. When Mac wins, his opponent attacks him with a broken bottle, but Scott intervenes. He tells a concerned Mac of his recent problems. When the duo go to dinner at a local marketside area, they are threatened by Sulin's kidnappers. They force one of the thugs to tell them where Sulin is located, learning she has been taken to Cambodia. They head to Mac's private warehouse, an artillery factory. Mac tells Scott of Sulin's father's history. Mr. Nguyen was a Vietnamese general who, for the sake of his family, stopped a deal with a Soviet militia. Mac is convinced that the Soviets have joined forces with the Vietnamese army and have set up base in Cambodia. Scott decides he must rescue Sulin. The next morning, Mac and Scott prepare, awaiting a helicopter, but they are surrounded on their way out by the Thai police. However, Terry comes to aid and Mac and Scott narrowly escape by helicopter.\nMeanwhile, the leader of the Soviet Army, Yuri (Matthias Hues), has arrived. Yuri challenges a Chinese refugee held with the recent prisoners of war to fight for his freedom. He uses his brute strength to defeat the fighter, but tells him he is free to leave. As the fighter starts walking away, Yuri shoots him twice and kills him by throwing him into a pit full of alligators. He subsequently meets Sulin and threatens to send her in the pit if her father doesn't arrive soon.\nWhen Scott, Terry, and Mac arrive in Cambodia, they ask Colonel Tol Nol (Nirut Sirijunya), an old customer of Mac's, for assistance. Mac offers artillery in exchange for help, but Tol Nol refuses. However, Scott makes a deal on a new tank and Tol Nol accepts under the condition that Terry stays behind as well. Tol Nol's camp is then bombed; Scott injures his arm in the process. Scott, Terry, and Mac leave by foot the following day and come upon a Buddhist temple. When the monks are revealed to be spies, the trio use their martial arts skills to fend them off. The Vietnamese army arrives and kidnaps Terry. They shoot Scott and Mac with a rocket launcher, believing to have killed them. However, Scott and Mac escape the blast. Meanwhile, Mr. Nguyen is murdered by a mysterious assassin hiding in a manhole in Bangkok.\nLater that night, Scott and Mac begin to secretly plant explosives and other weaponry in the Soviet camp. The next morning, Sulin and Terry are slated to be executed in the alligator pit. Scott, noticing what has happened, uses his crossbow to begin the full-fledged assault, while Mac works towards rescuing Terry and Sulin. They successfully kill all the soldiers except Yuri, who arrives with a machine gun as Scott is heading towards his friends. Terry sacrifices herself to save Scott from being gunned down. Scott distracts Yuri with an arrow to his arm. As Mac attempts to save Terry, he finally professes his love for her. However, it is too late as Terry dies from her wounds.\nScott and Yuri begin to fight with Yuri's strength getting the best of Scott. Scott, in an effort to lure Yuri away, hides in his office. When Yuri follows, he notices no one is inside. That is, until Scott jumps off a platform and begins to use his kicking skills on Yuri. Yuri catches Scott's foot and throws him to his desk and moves it towards Scott's legs to crush them. However, Scott grabs a painting behind him and crashes it on Yuri's head. Scott begins to fight and throws the Soviet flag around Yuri's head and ties a rope around his neck. Scott ties Yuri to a jeep and drags him to the alligator pit. When Yuri attempts to pull Scott in the jeep, an alligator gets Yuri and Scott jumps out of the jeep in time. Scott finds a machine gun and blasts the alligator pit. He is reunited with Sulin but is given the news that Terry is dead. Together, Scott, Sulin, and Mac, holding Terry, walk away to the camp."}