{"mid": "NormaRae", "IMDB_id": "tt0079638", "title": "Norma Rae", "plot": "Norma Rae Webster is a minimum-wage worker in a cotton mill that has taken too much of a toll on the health of her family for her to ignore their poor working conditions. She is also a single mother with two children by different fathers, one dead and the other negligent, and frequently has flings with other men to alleviate her loneliness and boredom. Initially, management tries to divert her frequent protests by promoting her to \"spot checker,\" where she is responsible for making sure other workers are fulfilling work quotas. She reluctantly takes the job for the pay hike, but when fellow employees, including her own father, shun her for effectively being a \"fink\" to the bosses, she demands to be fired; instead she is demoted back to the line.\nTwo men enter her life that change her perspective. A former co-worker, Sonny, asks her out after earlier causing trouble for her at the mill. Divorced with a daughter, he proposes marriage after a short courtship; recognizing how long it has been since she met a non-selfish man to keep company with, she accepts his offer. And after a few charged encounters with a New York union organizer, Reuben Warshowsky, Norma Rae listens to him deliver a speech that spurs her to join the effort to unionize her shop. This causes conflict at home when Sonny observes she's not spending enough time in the home, and is frequently exhausted when she is present. When her father drops dead at the mill, a death that could have been averted had he been allowed to leave his post early instead of wait for his allotted break, she is more determined to continue the fight.\nManagement retaliates against the organization efforts, first by rearranging shifts so that workers are doing more work at less pay, and then by posting fliers with racial invective in the hope of dividing white and black workers and diluting the momentum. Warshowsky demands she copy down the racist flier word for word in order to use it as evidence for government sanctions against her mill. When she attempts to transcribe the flier, management attempts to stop her, then fire her on grounds of creating a disturbance, and call the police to remove her from the plant. While awaiting the sheriff, Norma Rae takes a piece of cardboard, writes the word \"UNION\" on it, stands on her work table, and slowly turns to show the sign around the room. One by one, the other workers stop their mill machines, and eventually, the entire room becomes silent. After all the machines have been switched off, Norma Rae is taken to jail but is freed by Reuben.\nUpon returning home to her family, Norma decides to talk to her children and tell them the story of her life, their questionable parentage, and recent arrest, so that they are prepared for any smears that may come from those hoping to discredit her efforts. After a tense exchange with Reuben, Sonny asks her if they have been intimate; she says no, but acknowledges \"he's in my mind.\" Sonny in turn tells her there's no other woman in his mind and he will always remain with her.\nAn election to unionize the factory takes place, with Norma and Reuben listening as best as possible from outside the mill as reporters and TV cameras observe the vote count. With a difference shy of 100 votes, the result is a victory for the union. Shortly after, Reuben says goodbye to Norma; despite his being smitten with her throughout the movie, they only shake hands because he knows she is married and loves her husband, and Reuben heads back to New York."}