{"mid": "NorthwestHoundedPolice", "IMDB_id": "tt0038786", "title": "Northwest Hounded Police", "plot": "The film opens with a view of \"Alka-Fizz Prison\", clearly based on the Alcatraz Federal Penitentiary. A prison sign informs viewers that \"No Noose is Good Noose\", a pun involving the phrase \"no news is good news\" and the use of the noose in executions by hanging. The Wolf is depicted as a prisoner in his prison cell. He uses a pencil to draw a \"crude door on the wall outside his cell\", then opens that door and escapes, making his way from the United States to Canada.\nThe scene shifts to the police headquarters of Mounty County, where a sign explains that \"We Aim to Police\". The chief of the Royal Canadian Mounted Police addresses a gathering of Mounties, seeking a volunteer who is willing to hunt the escaped convict. Sgt. McPoodle (Droopy) is effectively volunteered when all the other Mounties step back. Later, somewhere in the Yukon, the Wolf is running through the snow. He stops to read a series of Burma-Shave-style signs which contain a warning message for him: \"Don't Look Now/ Use Your Noodle/ You're Being Followed/ by Sgt. McPoodle\". He turns around, and the camera shifts left to reveal that McPoodle is indeed approaching his target. This sets the pace for most of the short, where the shifting perspective of the camera exposes the presence of Droopy in yet another location. He remains unnoticed and effectively invisible until that reveal.\nThe Wolf attempts to hide in a seemingly vacant cabin in the woods. He shuts the front door and seven more on top of it. He feels secure behind these eight doors, but then the camera shifts to reveal the presence of McPoodle within the cabin. The Mountie occupies a chair by the fireplace, calmly reading a comic strip. The Wolf reacts by re-opening all eight doors, only to find McPoodle waiting behind them. The Wolf manages to flee through the back door, though he finds McPoodle also standing behind that door.\nThe Wolf climbs the highest mountain of the area and finds refuge in its summit, within a bird nest. Only a single egg shares the nest with him. The egg then cracks and McPoodle emerges from inside. The Wolf immediately dives towards a lake in the vicinity of the mountain. He feels momentarily safe underwater, until he notices McPoodle among the schooling fish. Following several failed attempts to escape the pursuit, the Wolf ends up in a tiny atoll of the Pacific Ocean. There are only two rocks on its surface. The Wolf breaks the fourth wall to speak to the movie audience, explaining that he has caught on to the pattern of McPoodle's appearances and fully expects the Mountie to emerge from under the larger rock. At this point, McPoodle surprises him by appearing from under the smaller rock instead.\nThe Wolf proceeds to swim his way towards New York City. He runs in the streets of the City, and an accidental turn causes him to nearly run off the edge of the film. He saves himself and then seeks refuge in a movie theater, hiding among the audience. The film screened is a product of the Metro-Goldwyn-Mayer cartoon studio, and McPoodle greets him from the screen. causing the Wolf to again flee. The Wolf next seeks the services of a plastic surgeon and requests a new face. First he finds his new face to be a replica of McPoodle's and asks the surgeon to restore his original face. Then he thanks the surgeon for doing so, only to notice that the man's face has also changed to now look like McPoodle.\nAn increasingly desperate Wolf next attempts to commit suicide by feeding himself to a lion in the local zoo. Alive in the \"belly of the beast\", he finds himself sharing the space with McPoodle. His next attempt to escape is his final one, as he ends up back in a prison cell. He then speaks to the audience again: he realizes that McPoodle got him, but now that he has some time to recall the events of the pursuit he wonders whether \"there coulda been more than one of them little guys\". At this point, the camera shifts to the corridor outside his cell where hundreds of McPoodle look-alikes have gathered. They answer his question with one of their own, \"What do you think, brother?\""}