{"mid": "NorthSeaHijack", "IMDB_id": "tt0081809", "title": "North Sea Hijack", "plot": "Misogynist freelance marine counter-terrorism consultant Rufus Excalibur ffolkes (Moore) is asked by Lloyd's of London to develop a contingency plan should any of the North Sea oil installations they insure be threatened.\nMonths later, Esther, a North Sea supply ship, takes on board a group of men posing as reporters who are visiting the oil production platform Jennifer. The leader of this group, Lou Kramer (Anthony Perkins), along with his second-in-command, Harold Shulman (Michael Parks), hijacks the ship, and two scuba diving henchmen attach limpet mines to the legs of Jennifer and its oil drilling rig, Ruth. From the bridge of Esther, Kramer issues a ransom demand for £25 million or he will blow up Ruth; then, if the ransom is still not paid, he will destroy Jennifer. For good measure, he rigs Esther with explosives and has all the charges wired to a control panel that never leaves his side.\nLord Privy Seal Dennis Tipping (Jeremy Clyde) informs the British Prime Minister (Faith Brook) of the situation. The British government is opposed to yielding to terrorist blackmail, but Tipping suggests that, as a compromise, Lloyd's could pay the ransom. After Lloyd's is consulted, the Prime Minister is shown a video of ffolkes practising a rescue mission aboard a mock-up ship. He has anticipated that terrorists might hijack a supply ship and has worked out a plan. Flying out to Jennifer, ffolkes first proposes that, to buy time, a large explosion should light up the night sky, fooling Kramer into thinking Ruth has exploded by accident so that he won't push the button at the deadline. ffolkes and Admiral Sir Francis Brindsen (James Mason) are to meet with Kramer on board Esther. ffolkes makes Brindsen practice accidentally dropping cigarettes on the floor, the idea being that the admiral should distract Kramer, giving ffolkes the opportunity to kill him before he sets off the bombs; his team of commandos will in the meantime take out the guards posted on the vessel.\nA sub-plot involves the imprisoned crew trying to poison their captors using the ship's medicine supply. A reporter who came with Kramer's men offers to do this, but the crew quickly suspects him to be a plant, so they tie him up. Unfortunately, Kramer has been spying on them, and when the food is delivered he forces one of the \"conspirators\" to drink the poisoned coffee; Sanna (Lea Brodie), the other main participant and the only woman on board, flees and apparently falls overboard.\nLater, Kramer demands that Brinston and King (David Hedison), Jennifer's manager, join him on Esther, unintentionally going along with ffolkes' plan. However, Kramer doesn't trust ffolkes when he meets him and orders him to leave the ship. The reporter who got the blackmailers onto the ship gets cold feet and wants to leave, so Kramer agrees to release him. At the last moment, Kramer shoots him in the back as he is being winched aboard the helicopter.\nWith time running out, the Prime Minister considers paying the ransom, but ffolkes replies angrily that that would send a message that \"anyone with a rowing boat and a stick of dynamite could hold this country to ransom.\" ffolkes still thinks he can rescue the hostages. However, to save the lives of the 697 men and women aboard Jennifer, ffolkes urges that Esther be obliterated with a bomb if his team cannot rescue the hostages in time.\nFfolkes' men storm Esther, bringing down the guards. ffolkes joins them wearing a borrowed vermilion scuba suit, but is forced to throw overboard his second-in-command, who has mistaken him for a terrorist. Sanna, who had been hiding in a lifeboat, manages to take out one of the terrorists who tries to take a shot at ffolkes. ffolkes races for the bridge as the helicopter carrying the bomb approaches. At the appointed time, Brindsen offers a cigarette to Kramer, drops them on the floor and bends down to pick them up. ffolkes appears at the window and shoots the distracted Kramer with a spear gun, pinning him to his chair. Seeing armed men running by, Schulman races for the detonator switch, but he gets impaled at the controls with a spear in each side. Just as the Royal Navy helicopter drops the bomb down its rear loading-ramp, ffolkes fires his signal flare into the sky; the helicopter pilot desperately pulls away and the bomb narrowly misses Esther, falling harmlessly into the sea.\nHowever, Kramer isn't quite dead, and he slowly reaches for the detonator. ffolkes pulls the wires out and watches him die. Before he slumps over, Kramer's last words are, \"I — still — don't — like — your — face\".\nA ceremony is held at ffolkes' castle to celebrate the end of the hijack. Among those present are the former hostages, the oil rig staff and the commandos. ffolkes has expressed his disdain for medals, so the Prime Minister presents the cat-loving eccentric with a new litter of kittens, named Esther, Ruth, and Jennifer. For once moved, and a little at a loss for words, ffolkes leaves amidst a round of applause to give his new kittens a saucer of milk."}