{"mid": "NothingInCommon", "IMDB_id": "tt0091653", "title": "Nothing in Common", "plot": "Happy-go-lucky advertising executive David Basner, who recently got a promotion at his Chicago ad agency, returns to work from a vacation. He is carefree, until his parents split up, after 36 years of marriage. It soon becomes apparent that he must care for his aging, bitter father Max, as well as support his emotionally fragile mother Lorraine, especially since his father has also just been fired from his 35-year career in the garment industry. Although his girlfriend, Donna, is sympathetic, she also tells him he needs to \"grow up\", but Max fears that if he tried to be less child-like, his advertising work could be adversely affected. At work, David is developing a commercial for Colonial Airlines, owned by the rich and bullish Andrew Woolridge. A successful ad campaign would likely gain David a promotion to partner in his company. David develops a relationship with Woolridge's daughter, Cheryl Ann Wayne. His father is well aware of David's playboy nature. Asking at one point whether his son is in bed with a woman, Max adds: \"Anybody you know?\"\nThe parents separately each begin to rely more on David, frequently calling him on the phone. His mother needs help moving to a new apartment. His father needs to be driven to an eye doctor. Late one night, David's mother calls to be rescued from a bar after going out on a date, having become frightened when the man tried to kiss her goodnight. At the bar, David's mother confides that his father Max had cheated on her and humiliated her in their marriage. An enraged David goes to confront Max. Their argument ends with David saying: \"Tomorrow I'm shooting a commercial about a family who loves each other, who cares about each other. I'm fakin' it.\" The next day, David is distracted by his problems with his father, affecting his work. As a peace offering, David offers to take Max to a nightclub to hear some of his favored jazz music. While there, David accidentally discovers that his father has been dealing with diabetes and his foot has gangrene.\nMax must have surgery. Beforehand, he and Lorraine share thoughts about their life together, and she condemns him for his treatment of her. Alone, Max sobs in regret. At the agency, Andrew Woolridge insists that David accompany him to New York to promote the new ad campaign for his airline. David refuses, saying he wants to be with his father, who is scheduled for surgery. After Woolridge complains, David loses his temper with this important client, and is fired. The next day, David accompanies his dad to the operating room. His boss Charlie is sympathetic and assures David that he will personally smooth things over with Woolridge, so David can take time to be with his father. Max has two toes amputated. When he goes home from the hospital, David pushes his wheelchair. Max tells him: \"You were the last person I thought would ever come through for me.\" Later, David recovers his job and gets to show Max what his work is about."}