{"mid": "NothingButAMan", "IMDB_id": "tt0058414", "title": "Nothing But a Man", "plot": "Duff Anderson works on a railroad section gang near Birmingham, Alabama, earning a good wage and living an itinerant life with his black co-workers. On their night off, while the other men drink and visit a pool hall, Duff decides to walk into the nearby small town, and ends up at a church meeting featuring good food and lively gospel music. There, Duff meets the pretty and genteel schoolteacher Josie, the daughter of Preacher Dawson. They begin to date against the wishes of Josie's father and stepmother, who think the relatively uneducated, non-religious, and (to them) arrogant Duff is not good enough for Josie. Despite her parents' objections, Josie continues to see Duff, partly because Duff shows himself willing to resist and challenge the social conventions that oppress black people, rather than just accepting the status quo in order to get along with white people, as Josie's father has done.\nInitially, Duff is just looking for a sexual relationship, and tells Josie he doesn't want to get married. But after Duff visits his four-year-old illegitimate son who has been abandoned to the care of an indifferent, unloving foster mother, and his emotionally abusive, drunken father who is barely functioning under the care of Duff's stepmother Lee, Duff realizes that he prefers the stability of a family to the life of a drifter. Duff and Josie marry with bright hopes for the future, but then begin to face a series of challenges as a married couple.\nDuff quits the section gang and takes a lower paying job at the local sawmill in order to have a stable home life. Being on the move had given Duff the illusion of freedom, but living in the town makes Duff subject to the town's social rules, and he immediately starts to have problems. Unlike his peers, Duff refuses to pretend to be friendly to white people who treat him obnoxiously or patronize him. Duff tries to encourage his black co-workers at the mill to stick together and stand up for their rights, but one of them informs on him to the white mill bosses, who suspect him of being a union organizer and troublemaker. After Duff refuses to follow his white boss's order to retract his statements to the other men, Duff is fired, and subsequently finds himself blacklisted at other area mills. Despite diligently searching for work, he is unable to find another job that is not humiliating and that also pays enough to support his family, now including a baby on the way.\nDuff hates his preacher father-in-law, whom he sees as having sold out to the white people in return for social status and economic gain, and he hurtfully says to his wife, \"You've never really been a nigger, living with them, in that house.\" Nevertheless, out of concern for Josie, Preacher Dawson uses his connections in the town to get Duff a job at a white-owned gas station. Soon, white customers who find Duff too proud for a black \"boy\" threaten to cause trouble if the boss keeps him on, and he loses that job as well. Although Josie is understanding, Duff, under emotional pressure and in a rage, shoves his pregnant wife to the floor when she tries to comfort him. Duff packs his bag and leaves their house, telling Josie that he will write her when he is on his feet again.\nDuff storms off to his father, and finds him so inebriated that he dies as Duff and Lee are driving him to the hospital. Neither Duff nor Lee know where Duff's father was born or how old he was, and the only possessions he has handed down to Duff are the contents of his pockets. Duff decides to return home with his young son, whom Josie had been wanting to adopt. Duff and Josie tearfully embrace as he reassures her that \"everything is gonna be all right”."}