{"mid": "NothingButTrouble", "IMDB_id": "tt0102558", "title": "Nothing But Trouble", "plot": "While hosting a party in his Manhattan penthouse, financial publisher Chris Thorne (Chase) meets lawyer Diane Lightson (Moore) and agrees to escort her to consult a client in Atlantic City on the following day. Thorne's clients, obnoxious but wealthy Brazilian siblings Fausto and Renalda, whom he calls \"Brazillionaires\", meet up with them and invite themselves along.\nAlong the way, Chris takes a supposed scenic detour off of the New Jersey Turnpike, ultimately ending up in the run-down village of Valkenvania. Failing to comply with a stop sign and subsequently attempting to escape pursuing officer Dennis Valkenheiser (Candy), the group is captured and taken before Dennis's 106-year-old grandfather Judge Alvin Valkenheiser (Aykroyd), who confiscates their identification cards. After Chris makes too many smart-alecky remarks, the judges drops a trap door out from under them in order to hold the offenders in his courthouse/funhouse to be judged. Later, some disrespectful drunk drivers that tried to threaten Dennis are called before the judge, who sentences them to immediate death at the hands of a deadly roller coaster nicknamed \"Mr. Bonestripper\".\nInvited up to dinner, the group is repulsed by the bizarre food choices (involving a hot dog train and a warm can of Hawaiian punch) but also learns the Judge has labeled Chris as a \"banker\" for his financial affiliations, and is holding them there out of revenge for the Valkenheiser family's misfortune at the hands of a corrupt coal deal long before. The group attempts an escape, but due to a series of mishaps, Chris and Diane are overtaken by Alvin's mute granddaughter Eldona (also John Candy). Meanwhile, being chased by Dennis' trigger-happy cousin, Miss Purdah, the two Brazillionaires escape by cutting a deal with Dennis, who decides to escape with them.\nThe Judge is angered by their actions and imprisons Chris and Diane in a room from which the pair eventually escapes (again with help from Dennis) and getting lost through hidden hallways and slides, become separated. Diane makes it out of the house and into the property's salvage yard; here, she meets two troll-like creatures by the names of Bobo and Lil' Debbull, the judge's severely deformed grandchildren. Earning the creatures' friendship, Diane catches glimpses of Eldona destroying Chris's BMW.\nMeanwhile, Chris sneaks into the Judge's personal quarters but is quickly caught. Valkenheiser punishes him according to house policy, which decrees that Chris must marry Eldona. Meanwhile, in the court room, the alternative rap group Digital Underground is being held on charges of speeding, but the Judge releases them after being charmed by an impromptu performance of one of the group's hits. He also asks them to stay as witnesses for the wedding, which Chris reluctantly goes through with in exchange for his life, but is later caught pleading the band to help him escape. The band leaves without understanding him, and Alvin sentences Chris to die in \"Mr. Bonestripper\". The machine breaks down the instant before Chris is fed into it, and he escapes. The Judge nearly kills Diane with another claw contraption, but Chris retrieves her at the last second and the two jump on a train back to New York.\nAfter the two report their plight to the authorities, the Judge's courthouse is raided by local and state police. Chris and Diane are asked to accompany the officers to the site, only to find out that the officers involved are fully aware of and in league with the Judge. The couple escapes when the area's underground coal fires cause a collapse, destroying the town.\nThe Brazillionaires are shown to have made their way back to South America; Dennis is now their personal head of security and Renalda's lover. Chris and Diane are shown relaxing in New York. Chris's relief does not last, however, as he stumbles on a televised news segment covering the ruined town of Valkenvania, in which Valkenheiser, brandishing Chris's driver's license, announces that he and his family plan to move in with his new grandson-in-law in New York, saying \"See you soon, Banker!\". Chris runs away panicking while making a cartoon-style impression of himself through a wall."}