{"mid": "NottingHill", "IMDB_id": "tt0125439", "title": "Notting Hill", "plot": "William \"Will\" Thacker owns an independent book store, The Travel Book Co. in Notting Hill. He is divorced and shares his house with an eccentric, care-free Welshman named Spike and has a small, tight knit group of friends that includes his sister, Honey.\nWill encounters Hollywood superstar Anna Scott when she enters his shop. Minutes later, they collide in the street and his drink spills on her clothes. Will offers his house nearby for Anna to change. Before leaving, she impulsively kisses him and then asks him not to mention what just occurred.\nDays later, Spike belatedly relays a message from Anna. Will calls and she invites him to visit her at the Ritz Hotel. On arrival, Will is mistaken for a journalist—in a panic he claims he works for Horse & Hound— and is made to interview not only Anna, but the entire cast of her of new sci-fi film, which he knows nothing about. Anna calls him back in and says she has cleared her evening. Will is exhilarated, before remembering that he is expected at his sister Honey's birthday party; Anna surprises him by offering to be his date.\nAt the house of Will's friends Max and Bella, Anna fits in perfectly as they all share stories. Honey immediately recognizes Anna and declares them best friends instantly. She and Will share a private moment in a garden square as they walk back from the birthday party. The following evening they go to a restaurant, where Will overhears a group of patrons making crude remarks about Anna and attempts to defend her, before Anna steps in herself and humiliates them. As they walk back to her hotel, she invites Will up to her room. But when he arrives, she tells him he must leave immediately. Her American movie star boyfriend (who was never mentioned until now) appears and starts to bark orders at him, as well as make unflattering comments about Anna's weight. Anna is apologetic and embarrassed, while a stunned Will leaves. Over the next six months, Max and Bella set Will up on a series of blind dates, trying to help him move on; however Will, still hung up on Anna, does not connect with any of them.\nOne day, a distraught Anna appears at Will's doorstep; some pre-stardom nude photos have been published in the tabloids (along with reports of a video filmed without her permission), and she needs a place to hide from the fallout. Once she calms down, they spend some time on the rooftop patio rehearsing lines from Anna's next film. She also apologizes for the previous incident, telling Will her boyfriend simply showed up out of the blue and the relationship had broken down long before then. When she sees a poster of the Marc Chagall painting La Mariée on his kitchen wall, Anna tells Will that \"it feels like how love should be\". That night, Anna goes to him and they have sex. The next morning, the press (inadvertently tipped off by Spike) besiege Will's house and get pictures of both him and Anna half-dressed. While packing to leave, a furious Anna accuses Will of exploiting the situation for his own benefit and declares that she regrets their time together, because the press will make sure it never goes away.\nSeasons pass and Will, though determined to forget Anna, remains miserable. Spike and Honey find the numbers to Anna's New York and London agents, encouraging him to reach out, but Will decides to throw them away. At a dinner with his friends, Will discovers that Anna is now an Oscar winner and back in town making a period film. He visits her location shoot, where Anna sees him and invites him past security. Although things are not going well on set, she asks him to stay because there are \"things to say\". He is surprised to find that it is a Henry James film, something he had previously suggested would be a good role for Anna. Given headphones to listen to the actors over their microphones, Will overhears Anna bantering with her rude co-star, until the co-star mentions seeing Will and Anna refers to him dismissively. Saddened, Will leaves the set.\nThe next day, Anna comes to the bookshop with a present. Visibly nervous, She apologizes for her previous behavior and expresses a desire to rekindle their relationship. When Will points out her comments the previous day, she explains that she would never discuss her private life with \"the most indiscreet man in England.\" Believing it inevitable that they would break up, Will turns her down, as her superstar status would mean he could never really escape the pain of losing her, and having it happen a third time would crush him. Although saddened, Anna accepts his decision, but reminds him that underneath all the fame—which is really just nonsense— she is \"also just a girl, standing in front of a boy, asking him to love her.\"\nWill meets his friends in a restaurant with the opened gift—the original La Mariée. They take turns supporting his decision to end the relationship by (halfheartedly) pointing out Anna's flaws. When Spike enters and is told what happened, he promptly calls Will a \"daft prick\". Will reiterates Anna's last comment and realizes his mistake. They pile into Max's car and race across London to Anna's hotel, where they find that she has checked out and is holding a press conference at the Savoy Hotel. When Will arrives, Anna's publicist is telling the crowd that Anna will be taking time off from making films and leaving the UK that night. Will, pretending to be a reporter again, admits he made the wrong decision and begs Anna to reconsider. After admitting she would, Anna announces that she will be staying in Britain \"indefinitely.\" Anna and Will smile at one another from across the room as the press goes into a frenzy. A montage shows their wedding and arrival at one of Anna's movie premieres, before ending with them on a bench in the private garden, Will reading to a visibly pregnant Anna."}