{"mid": "NowAndThen", "IMDB_id": "tt0114011", "title": "Now and Then", "plot": "In 1991, four childhood friends reunite in their hometown of Shelby, Indiana. Samantha Albertson (Demi Moore), a science-fiction writer, narrates the story. As an adolescent (played by Gaby Hoffmann) Samantha was considered the \"weird\" girl who liked performing seances and was interested in science fiction and the supernatural. Roberta Martin (Rosie O'Donnell), a doctor, was a tough tomboy (played by Christina Ricci) whose mother died when she was four years old. Chrissy DeWitt (Rita Wilson), who lives in her childhood home, is married and about to give birth to her first child. As a naïve youngster (played by Ashleigh Aston Moore), she was overly sheltered by her mother. Tina \"Teeny\" Tercell (Melanie Griffith) is a successful Hollywood actress; as a child (played by Thora Birch), she had always dreamed of fame. Teeny and Samantha have not visited their hometown in ten years.\nThe story flashes back to 1970 when the girls had two goals: saving enough money to buy a tree house and avoiding the Wormer brothers. One night, they sneak out to the cemetery to perform a seance. A cracked tombstone convinces them they have resurrected the spirit of a young boy identified only as Dear Johnny, who died in 1945 at the age of twelve. Intrigued, they search for information at the library but find nothing.\nLater, while heading for the library in a nearby town, they spy the Wormer brothers skinny dipping in the lake. To retaliate for a prank the boys played on them, the girls steal the boys' clothes, tossing them onto the road while riding off. At the library, Roberta discovers an article about her mother being killed in a car accident, a fact previously unknown to her. Samantha finds a story about Dear Johnny and his mother tragically dying, but a part is missing, leaving the cause of their deaths a mystery. The girls then visit a local psychic (Janeane Garafalo) who determines he was murdered.\nSamantha goes home and unexpectedly meets Bud Kent (Hank Azaria), a man her newly-single mother invited to dinner. Upset, she storms out and flees to Teeny's. They hang out in the tree house display at the store where Samantha confesses her parents are getting divorced. Teeny comforts her, then breaks her favorite necklace in two, giving one half to Samantha as a \"best friends for life\" bracelet. On their way home during a thunder storm, Samantha loses it in a storm drain. When she climbs down to retrieve it, the water rises, trapping her. Crazy Pete, an old vagrant, pulls her out. Grateful, the girls now see him differently. At the same time, Roberta is playing basketball in her driveway when Scott Wormer (Devon Sawa) suddenly arrives. They question why they fight all the time before sharing a kiss.\nThe next day, the girls consult Samantha's grandmother (Cloris Leachman) about Dear Johnny's death, and discover from a newspaper article that he and his mother were murdered. Roberta becomes upset and angry that two innocent people were killed and also by the realization that her mother died violently, contrary to what she was told. Samantha announces that her parents are divorcing, and the four make a pact to always be there for one another.\nTo put Dear Johnny's soul to rest, the girls go to the cemetery to perform another seance. Johnny's tombstone suddenly rises surrounded by bright light. A figure appears from behind, but it is only the groundskeeper who explains that the stone was damaged and is being replaced. The groundskeeper explains he was the one who cracked the tombstone. Realizing they never resurrected Dear Johnny, they agree to stop the seances. While leaving, they notice Crazy Pete, and Samantha follows him back to Dear Johnny's grave. Realizing that he is Dear Johnny's father, she comforts him, while he advises her not to dwell on things. Some time after, the tree house is finally bought, and Samantha narrates, \"The tree house was supposed to bring us more independence. But what the summer actually brought was independence from each other.\"\nThe film returns to 1991, and Chrissy goes into labor and gives birth to a girl. Later, in their old tree house, it is revealed by Roberta that Crazy Pete had died the previous year. They then discuss how happy they are in life and make another pact to visit more often."}