{"mid": "NowhereBoy", "IMDB_id": "tt1266029", "title": "Nowhere Boy", "plot": "The drama tells the story of John Lennon's teenage years from 1955 to 1960.\nJohn was separated from his mother, Julia Lennon, when he was five. He was brought up by his aunt and uncle, Mimi and George Smith, as their own son. He learns the truth at George's funeral, becomes curious and seeks out his mother. John becomes obsessed with rock 'n' roll music during a visit to Blackpool with Julia.\nWhen John is suspended from school, Julia offers to let him stay at her house during school hours so that Mimi won't discover his suspension. Julia teaches John how to play the banjo. Mimi discovers their arrangement and demands that it stop, but John refuses and moves in with Julia. A week later, John overhears an argument between Julia and her husband, and he decides to return to Mimi.\nJohn tells Mimi that he wants to start a rock 'n' roll band and she buys him a guitar. John organizes some of his friends into a band which he names the Quarrymen. They play their first gig at a village fete. After the show, John meets Paul McCartney, who auditions for the band with the song \"Twenty Flight Rock\". Paul is accepted into the band and he and John begin writing songs together. The Quarrymen soon become very popular. John meets Paul's friend, George Harrison, who also auditions. George is accepted into the band as lead guitarist.\nJulia holds a birthday party for John at her home. After the party, John confronts her about his missing father, Alf Lennon, and asks why Julia gave him up. He also confronts Mimi, who tells him that Julia cheated on Alf and refused to work on the marriage. Alf allowed 5-year-old John to decide whom he wanted to live with, and John chose his father. Alf planned to move with John to New Zealand, but when Julia abandoned the family John was torn by his devotion to his mother. Without the time or money to legally determine custody, Mimi assumed custodianship of John and raised him as her son. John is upset by this revelation, and leaves in anger.\nJohn moves out to live on his own. Over time, John accepts his past and Julia and Mimi become friendly. When Julia is hit and killed by a car, however, John is consumed by an anger that he cannot overcome.Two years later, John asks Mimi for his passport so that he can travel to Hamburg with his newly formed band, The Beatles. Mimi asks John to call her as soon as he arrives in Hamburg. The film ends with the caption, \"John phoned Mimi as soon as he arrived in Hamburg...and every week thereafter for the rest of his life.\""}