{"mid": "NowVoyager", "IMDB_id": "tt0035140", "title": "Now, Voyager", "plot": "Drab Charlotte Vale (Bette Davis) is an unattractive, overweight, repressed spinster whose life is brutally dominated by her tyrannical mother (Gladys Cooper), an aristocratic Boston dowager whose verbal and emotional abuse of her daughter has contributed to the woman's complete lack of self-confidence. It is revealed that Mrs. Vale had already brought up three sons, and Charlotte was an unwanted child born to her late in life. Fearing that Charlotte is on the verge of a nervous breakdown, her sister-in-law Lisa (Ilka Chase) introduces her to psychiatrist Dr. Jaquith (Claude Rains), who recommends that she spend time in his sanitarium.\nAway from her mother's control Charlotte blossoms, and at Lisa's urging the transformed woman opts to take a lengthy cruise instead of going home immediately. On the ship she meets Jeremiah Duvaux Durrance (Paul Henreid), a married man who is traveling with his friends Deb (Lee Patrick) and Frank McIntyre (James Rennie). It is from them that Charlotte learns of how Jerry's devotion to his young daughter Christine (\"Tina\") keeps him from divorcing his wife, a manipulative, jealous woman who does not love Tina and keeps Jerry from engaging in his chosen career of architecture, despite the fulfillment he gets from it.\nCharlotte and Jerry become friendly, and in Rio de Janeiro the two are stranded on Sugarloaf Mountain when their car crashes. They miss the ship and spend five days together before Charlotte flies to Buenos Aires to rejoin the cruise. Although they have fallen in love, they decide it would be best not to see each other again.\nWhen she arrives home, Charlotte's family is stunned by the dramatic changes in her appearance and demeanor. Her mother is determined to once again destroy her daughter, but Charlotte is resolved to remain independent. The memory of Jerry's love and devotion help to give her the strength she needs to remain resolute.\nCharlotte becomes engaged to wealthy, well-connected widower Elliot Livingston (John Loder), but after a chance meeting with Jerry, she breaks off the engagement, about which she quarrels with her mother. During the argument, Charlotte says she didn't ask to be born, that her mother never wanted her, that it's \"been a calamity on both sides.\" Mrs. Vale is so shocked that her once-weak daughter has found the courage to actually talk back to her, she has a heart attack and dies. Guilty and distraught, Charlotte returns to the sanitarium.\nWhen she arrives at the sanitarium, she is immediately diverted from her own problems when she meets Jerry's lonely, unhappy 12-year-old daughter Tina (Janis Wilson) who has been sent to Dr. Jaquith. Tina greatly reminds Charlotte of herself; both were unwanted and unloved by their mothers. Shaken from her depression, Charlotte becomes overly interested in Tina's welfare and, with Dr. Jaquith's permission, she takes her under her wing. When the girl improves, Charlotte takes her home to Boston.\nJerry and Dr. Jaquith visit the Vale home, where Jerry is delighted to see the changes in his daughter. While he initially pities Charlotte, believing her to be settling in her life, he's taken aback by her contempt for his initial condescension. Dr. Jaquith has allowed Charlotte to keep Tina there with the understanding that her relationship with Jerry will remain platonic. She tells Jerry that she sees Tina as his gift to her and her way of being close to him. When Jerry asks her if she's happy, Charlotte finds much to value in her life, even if she doesn't have everything she wants: \"Oh, Jerry, don't let's ask for the moon. We have the stars,\" a line ranked #46 in the American Film Institute's list of the top 100 movie quotes in American cinema."}