{"mid": "NunsOnTheRun", "IMDB_id": "tt0100280", "title": "Nuns on the Run", "plot": "After their boss is killed during a bank heist, London gangsters Brian Hope (Idle) and Charlie McManus (Coltrane) desire to lead more peaceful lives in Brazil, disapproving of their new younger and more brash boss, Casey (Patterson). While planning to rob a local Triad gang of their ill-gotten drug money, Brian meets and falls in love with a waitress, Faith (Coduri). During the robbery, Brian and Charlie betray their crew, steal the money and flee, but are forced to abandon their car when it runs out of petrol and seek refuge in a nearby nunnery during the ensuing gunfight. Faith, who had tried to warn Brian beforehand, is shot in the wrist, while one of the triads is shot and hospitalised. Casey places a bounty on Brian and Charlie's heads.\nDisguising themselves as nuns, Brian and Charlie introduce themselves to the Sister Superior, Liz, as Sisters Inviolata and Euphemia, respectively. Faith, having witnessed the gunfight and Brian and Charlie fleeing into the nunnery, follows them and poses as a mature student to get inside. Her gunshot wound is exposed and she is taken to the infirmary. Brian pays her a secret visit and claims he is married in order to end their relationship for her safety. When Faith intends to go to church and confess, Charlie distracts the priest, Father Seamus, while Brian poses as him. Faith admits she still loves Brian, but Brian convinces Faith to keep silent. On her way out, she is abducted by the Triads and interrogated. She directs them to Casey and they set her free, but bumps into a lamppost and hits her head on the road, ending up in the hospital, where one Triad has infiltrated the staff as a janitor. Brian and Charlie acquire tickets to Brazil, despite Brian's desire to take Faith with them.\nBrian decides to tell Faith the truth, but discovers she has not returned to the nunnery. They go to her apartment and only barely escape their former fellow gangsters. They sneak back into the nunnery and manage to slip into their spare habits after accidentally waking up an eccentric nun, Sister Mary. In conversation, Brian learns that Faith is in the hospital, with her father and brother who have vowed revenge on Brian. He visits her, but she is heartbroken, believing that Brian no longer loves her. They attempt to flee for the airport the next morning, but are caught and exposed by Sister Mary. In desperation, they steal a truck and head for the airport, pursued by their comrades and Sisters Liz and Mary. Brian forces Charlie to go to the hospital, where Brian tells Faith the truth while Charlie stalls the gangsters. They manage to escape the hospital with Faith, while Casey and the others are arrested, though one briefcase of money is lost during the chase. Sister Liz and Sister Mary find the lost case of drug money and decide to use it to fund a drug rehabilitation clinic.\nBrian, Charlie and Faith reach the airport, where security guards demand to speak with Brian and Charlie. They board the flight disguised as attendants and successfully escape the UK for Brazil."}