{"mid": "OctoberBaby", "IMDB_id": "tt1720182", "title": "October Baby", "plot": "Hannah is a 19-year-old college freshman who suffers from epilepsy, asthma and depression. On the verge of her theatrical debut in a university play, she collapses on stage. Hannah meets with her parents and a doctor, who quotes passages from her journal that she has been feeling lost and unwanted. She learns that she is adopted and her biological mother tried to abort her.\nHannah seeks out her best friend, Jason, for advice. After sorting through her feelings and her options with Jason, she decides to find her birth mother. Jason invites her to go on a trip to New Orleans, Louisiana with a group of his friends for spring break. Hannah's father, Jacob Lawson, is reluctant to let her go, because of her illness. Hannah decides to go because she says she wants answers. She sets out on a journey that leads her to her birthplace, Mobile, Alabama. Jason helps her find the hospital where she was born, but it is vacant and locked up. Hannah pries the back door open and they are arrested. The sheriff lets them go when she tells him her reason for trying to get in. He gives her the name and address of the nurse who signed her birth certificate. She locates the nurse, who assisted in the abortion, and they have an emotional encounter while the nurse describes the circumstances behind not only her birth, but that of her twin brother, whom Hannah knew nothing about. She leaves the nurse's apartment with the changed name and workplace of her birth mother.\nWhen she finally meets her biological mother, she is overwhelmed by anger and hatred because of her mother's rejection. Her father arrives to take her home, having found out she lied to him about being with others beside Jason, and about checking in with her doctor. He discovers their arrest for breaking and entering and tells Jason he is not permitted to interact with Hannah. Jason returns to the hotel where his friends are staying. He breaks up with his girlfriend, Alanna, and returns home. He phones Hannah's father and apologizes for lying.\nHannah's adopted parents go through their own pain and suffering, deciding to tell Hannah the details of their choice to adopt both her and her brother, who died months later. Her adopted mother had been pregnant with twins and lost them at 24 weeks. They saw an adoption request for Hannah and her brother at a crisis pregnancy center where she had volunteered.\nHannah wanders aimlessly until she sees a Catholic Church and goes in. She seeks consolation from a priest. Hannah experiences an epiphany and finds she is able to forgive her biological mother and forget about the botched abortion.\nJason takes Hannah back to the theater where she had collapsed and says they should finish the play together. Hannah realizes he wants to be more than a friend and starts to fall in love. The movie ends with them leaving to go to their college dorms. Hannah hugs both her parents and thanks them for wanting her when no one else did. She is seen smiling at her father and holding Jason's hand."}