{"mid": "OddJobJack", "IMDB_id": "tt0373584", "title": "Odd Job Jack", "plot": "The eponymous character, Jack Ryder, graduates from university with a degree in sociology and becomes a temporary employee at an agency called Odd Jobs which specializes in filling difficult and unusual positions. Each episode ends with Jack adding a chapter to a book which he is writing about his experiences on his laptop.\nWhen not working, Jack often hangs with his eccentric friends, Leopold \"Leo\" Trench, an agoraphobic computer hacker who, like one of the characters in McKellar's earlier comedy series, Twitch City, is unable to leave his apartment but nonetheless leads a complex and bizarre life, and Bobby Lee, an Asian kid who works in the family store by day, and is a club disc-jockey and masked hero by night.\nJack also spends some time at the beginning and end of each episode at the agency where he attempts to develop a rapport with Betty Styles, the female assignment \"associate\" while under electronic surveillance from the gruff, imperious, and decidedly unpleasant, manager/owner (Mr. Fister) who is often involved in some way in the bizarre conspiracies, sordid sexual escapades, and crimes which lurk behind the workaday appearances of Jack's assignments.\nMr. Fister never appears in season three, but makes a final appearance in season four, while at the conclusion of season three Betty, after stealing the company jet to rescue Jack from African kidnappers, runs away to a distant country. Instead Jack is greeted in each season four episode with a new assignment associate, each with a personality defect. The first season also featured Jacques, a French Canadian doppelgänger to Jack who serves as an office nemesis.\n=== Season One ===\nAmong the unusual situations in which Jack finds employment during the show's first season are mortuary worker; rodent wrangler on the set of a James Bond-like movie produced entirely with rodents; tree-planter in Bigfoot country; waiter in a chi-chi restaurant where something is definitely not right in the kitchen; security guard in a high-tech firm; Eighties-style business executive in a take-over firm; and Christian theme-park employee. None of these assignments are as straightforward as they seem. Jack's co-workers and employers can only be described as contentedly psychotic.\nIn the rodent wrangler episode, McKellar plays and parodies himself as a stereotypical vain, role-hungry and superficial actor, as well as voicing the anti-hero, Jack, and is the subject of a self-deprecatory episode based on Being John Malkovich in which a tunnel is dug from Jack's kitchen into McKellar the actor's ego.\nThere are also a number of sly allusions in the episode to McKellar's movies, including The Red Violin (1998) and Highway 61 (1991)."}