{"mid": "OfMiceAndMen", "IMDB_id": "tt0031742", "title": "Of Mice and Men", "plot": "Two migrant field workers in California on their plantation during the Great Depression—George Milton, an intelligent but uneducated man, and Lennie Small, a bulky, strong man but mentally disabled—are in Soledad on their way to another part of California. They hope to one day attain the dream of settling down on their own piece of land. Lennie's part of the dream is merely to tend and pet rabbits on the farm, as he loves touching soft animals, although he always kills them. This dream is one of Lennie's favorite stories, which George constantly retells. They had fled from Weed after Lennie touched a young woman's dress and wouldn't let go, leading to an accusation of rape. It soon becomes clear that the two are close and George is Lennie's protector, despite his antics.\nAfter being hired at a farm, the pair are confronted by Curley—The Boss's small, aggressive son with a Napoleon complex who dislikes larger men, and starts to target Lennie. Curley's flirtatious and provocative wife, to whom Lennie is instantly attracted, poses a problem as well. In contrast, the pair also meets Candy, an elderly ranch handyman with one hand and a loyal dog, and Slim, an intelligent and gentle jerkline-skinner whose dog has recently had a litter of puppies. Slim gives a puppy to Lennie and Candy, whose loyal, accomplished sheep dog was put down by fellow ranch-hand Carlson.\nIn spite of problems, their dream leaps towards reality when Candy offers to pitch in $350 with George and Lennie so that they can buy a farm at the end of the month, in return for permission to live with them. The trio are ecstatic, but their joy is overshadowed when Curley attacks Lennie, who defends himself by easily crushing Curley's fist while urged on by George.\nNevertheless, George feels more relaxed, to the extent that he even leaves Lennie behind on the ranch while he goes into town with the other ranch hands. Lennie wanders into the stable, and chats with Crooks, the bitter, yet educated stable buck, who is isolated from the other workers racially. Candy finds them and they discuss their plans for the farm with Crooks, who cannot resist asking them if he can hoe a garden patch on the farm albeit scorning its possibility. Curley's wife makes another appearance and flirts with the men, especially Lennie. However, her spiteful side is shown when she belittles them and threatens Crooks to have him lynched.\nThe next day, Lennie accidentally kills his puppy while stroking it. Curley's wife enters the barn and tries to speak to Lennie, admitting that she is lonely and how her dreams of becoming a movie star are crushed, revealing her personality. After finding out about Lennie's habit, she offers to let him stroke her hair, but panics and begins to scream when she feels his strength. Lennie becomes frightened, and unintentionally breaks her neck thereafter and runs away. When the other ranch hands find the corpse, George realizes that their dream is at an end. George hurries to find Lennie, hoping he will be at the meeting place they designated in case he got into trouble.\nGeorge meets Lennie at the place, their camping spot before they came to the ranch. The two sit together and George retells the beloved story of the dream, knowing it is something they'll never share. He then shoots Lennie, with Curley, Slim, and Carlson arriving seconds after. Only Slim realizes what happened, and consolingly leads him away. Curley and Carlson look on, unable to comprehend the subdued mood of the two men."}