{"mid": "OldAcquaintance", "IMDB_id": "tt0036230", "title": "Old Acquaintance", "plot": "In 1924, newly successful author Kit Marlowe returns to her home town to speak, as part of a lecture tour, and to visit her dear childhood friend Millie. Millie has married Preston Drake and is pregnant, and she surprises Kit when she discloses she has also written a book, a romance novel. Millie asks Kit to present her book to her publisher. Upon their meeting, Preston appears to be impressed by Kit Marlowe.\nEight years pass, and the childhood friends have each formed distinctly opposite personalities. Kit is witty, perceptive, wry and calmer in comparison to Millie who is intense, self-involved and histrionic. The two can be described as \"frenemies\". Millie becomes increasingly difficult and resentful of any diversion from full attention being focused upon herself. When Kit jokes and glowingly reports about her shopping trip with Preston and Millie's only child, Deirdre, Millie impudently retorts \"Time you had one of your own!\" as she swans out.\nPreston immediately asks Kit why she has remained so loyal to Millie over the years. Kit confides in Preston despite Millie's often emotionally unstable and dysfunctional behaviour, she feels indebted as Millie was her first real friend. Kit feels a particular loyalty to Millie as orphaned Kit grew up with an aunt who died and found a sense of home and family through Millie's parents kindness and generosity towards Kit.\nMillie has become a very successful writer, with a string of romance novels. This has made her very arrogant and condescending to those around her. Visiting New York, on the eve of the opening of a play written by Kit, the Drakes' marriage is slowly disintegrating. In an interview with a reporter, Preston, an architect and engineer, is shown to feel very much ‘second’ to his wife’s success. In a private moment with Kit, Preston professes his love for Kit. In another private moment, when Millie mentions Preston’s drinking habit to Kit, Kit replies “people drink for escape”. Millie and Preston clash with Kit playing referee. The response is complete ingratitude from self-absorbed Millie and growing romantic feelings from an increasingly frustrated Preston.\nMoments later, as the three converse, Preston and Millie's argument escalates (with Millie displaying what some might interpret as ‘manic’ behavior) and Preston leaves Millie ‘for good’. Kit tracks down Preston and tries to convince him to return to Millie, but he tries to convince Kit that he is in love with her. Selflessly, Kit tells him she can not reciprocate, as she could not do that to Millie. They kiss goodbye and part.\nTen years pass, and World War Two is underway. Kit is on a radio show espousing the good of the American Red Cross, and Preston, now a major in the Army, hears her. He calls the radio station to suggest they meet for a drink. They do, but Kit also has her much-younger beau, Rudd Kendall, and Preston’s almost 18-year-old daughter, Deirdre, whom Preston has not seen in those ten years, join them. Preston tells Kit he is engaged, and Kit is happy for him. Preston and his daughter become reacquainted. The next morning Rudd (again) presses Kit to marry him, but she puts him off, promising an answer in a few days, and he leaves. Rudd, feeling reproached and rejected, then meets with Deirdre.\nMillie treats Preston's return as a victory and sets the scene for a desperate reconciliation. Preston however dashes her hopes by revealing his engagement and asks for ‘joint custody’ of Deirdre. Preston incidentally discloses to Millie that he was once in love with Kit. An outraged Millie throws him out. Millie then rants and raves to Deirdre about how Kit is a Jezebel (the writer's tongue-in-cheek reference to Davis’s 1938 film Jezebel). Millie spitefully does her best to poison Deirdre against Kit and relishes in excessively establishing herself as the centre of attention and revelling in her self-indulgence, oblivious to Deirdre's clear distress.\nMillie also discloses that Kit is to marry Rudd, causing Deirdre further distress, and Deirdre leaves. Kit and Millie have an all-out argument about all that hasn’t been said until now, where Millie plays the victim and Kit reveals a few brutal home truths to an in denial and melodramatic Millie. Millie even goes as far to discard to her own daughter to her love rival. Realising her words are falling on deafened ears, frustrated Kit physically shakes Millie to \"knock some sense\" into her self-obsessed drama queen friend, in arguably the film's most remembered scene.\nThat night, Kit, having decided to marry Rudd, finds out from him that he is now in love with Deirdre. Kit tracks down Deirdre at a handsome but incompatible beau's bachelor pad, calms her, and returns her to Rudd. Kit then returns home to find Millie, and they reconcile. Millie tells Kit about her new book, about the trials of two women friends, and Kit suggests that Millie title the book “Old Acquaintance”. Millie agrees, and the end credits roll."}