{"mid": "Oliver", "IMDB_id": "tt0063385", "title": "Oliver!", "plot": "=== Act I ===\nThe musical opens in the workhouse, as the half-starved orphan boys are entering the enormous dining room for dinner . They are fed only gruel, but find some solace by imagining a richer menu, (\"Food Glorious Food\"). Oliver gathers up the courage to ask for more. He is immediately apprehended and is told to gather his belongings by Mr. Bumble and the Widow Corney, the heartless and greedy caretakers of the workhouse (\"Oliver!\"). Mr. Bumble and Widow Corney are left alone, and Mr. Bumble begins to make amorous advances. Mrs. Corney pretends to resent his attentions, but ends up on Mr. Bumble's lap, as he eventually proposes to her (\"I Shall Scream!\"). Mr. Bumble then takes Oliver and sells him as an apprentice to an undertaker, Mr. Sowerberry (\"Boy for Sale\"). He and his wife taunt Oliver and Mr. Bumble (\"That's Your Funeral\"), causing Mr. Bumble to become angry and storm out. Oliver is sent to sleep in the basement with the coffins (\"Where is Love?\").\nThe next morning Noah Claypole, another employee of Sowerberry, insults Oliver's dead mother, whereupon Oliver begins pummeling him. Mrs. Sowerberry and her maid, Charlotte, also Noah's girlfriend, run in, and Mr. Bumble is sent for. He and the Sowerberrys lock Oliver in a coffin, but during all the commotion Oliver escapes. After a week on the run, he ends up in the city of London and meets a boy about his age known as the Artful Dodger. Dodger seems a kindly boy, and invites Oliver to join him and his friends (\"Consider Yourself\"). Dodger is, unknown to Oliver, a boy pickpocket, and he invites Oliver to come and live in Fagin's lair. Fagin is an elderly criminal, now too old to thieve himself, who now teaches young boys to pick pockets. Oliver is completely unaware of any criminality, and believes that the boys make handkerchiefs rather than steal them. Oliver is introduced to Fagin and his boys, and is taught their ways (\"You've Got to Pick a Pocket or Two\").\nThe next day, Oliver meets Nancy, an older member of Fagin's gang, and the live-in wife of Fagin's terrifying associate Bill Sikes, a brutal house-burglar whose abuse she endures because she loves him. Nancy, along with her younger sister Bet and the boys, sing about how they don't mind a bit of danger (\"It's a Fine Life\"). Oliver bows deeply to Nancy and Bet, trying to be polite. All the boys laugh and mimic Oliver. Nancy singles out Dodger to demonstrate the way the rich people treat each other (\"I'd Do Anything\"). Nancy and Bet leave and Oliver is sent out with the other boys on his first pickpocketing job (\"Be Back Soon\"). Dodger, another boy named Charley Bates, and Oliver decide to stick together, and when Dodger and Charley rob Mr. Brownlow, a wealthy old man, they run off, leaving the horrified Oliver to be arrested for the crime (\"The Robbery\").\n=== Act II ===\nIn the Three Cripples pub, to help take her mind off of Sikes's neglect towards her, Nancy strikes up an old tavern song with the low-life ruffians, (\"Oom Pah Pah\"). Bill Sikes makes his first appearance, and disperses the crowd (\"My Name\"). Dodger runs in and tells Fagin about Oliver's capture and removal to the Brownlow household. Scared he will betray the gang's whereabouts, Fagin and Bill decide to abduct Oliver and bring him back to the den, with Nancy's help. Nancy, who has come to care for Oliver, at first refuses to help, but Bill physically abuses her and forces her into obedience. In spite of this, Nancy still loves Bill, and believes he loves her too (\"As Long As He Needs Me\").\nThe next morning, at Mr. Brownlow's house in Bloomsbury, Mrs. Bedwin the housekeeper sings to Oliver (\"Where Is Love? [Reprise]\"), and Oliver wakes up. Mr. Brownlow and Dr. Grimwig decide that Oliver is well enough to go outside, so Brownlow sends Oliver to return some books to the library. Oliver sees a group of street vendors and joins them in song (\"Who Will Buy?\"). As the vendors leave, Nancy and Bill appear and grab Oliver. They bring him back to Fagin's den, where Nancy saves Oliver from a beating from Sikes after the boy tries to flee. Nancy remorsefully reviews their dreadful life, but Bill maintains that any living is better than none. Fagin tries to act as an intermediary (\"It's A Fine Life [Reprise]\"). Left alone, Fagin wonders what his life might be like if he left London and began an honest life (\"Reviewing the Situation\"), however, after thinking of various excuses, he elects to remain a thief.\nBack at the workhouse, Mr. Bumble and the Widow Corney, now unhappily married, meet the dying pauper Old Sally and another old lady, who tell them that Oliver's mother, Agnes, left a gold locket when she died in childbirth. Old Sally stole the locket, which she gives to the Widow Corney. Mr. Bumble and Widow Corney, realizing that Oliver may have wealthy relatives, visit Mr. Brownlow, who has advertised in newspapers for news of him, hoping to profit from any reward given for information (\"Oliver! [Reprise]\"). Mr. Brownlow realises they are not interested in Oliver's welfare, but only money, and throws them out, but recognizes the picture inside the locket as a picture of his daughter, and realizes that Oliver is actually his grandson.\nNancy visits Mr. Brownlow, explains how she and Bill abducted Oliver, and remorsefully promises to deliver Oliver to him safely that night on London Bridge. She ponders again about Bill (\"As Long As He Needs Me [Reprise]\"). Suspecting that Nancy is up to something, Bill follows her as she sneaks Oliver out of Fagin's den. At London Bridge, he confronts them, knocks Oliver unconscious, and clubs Nancy to death. He then grabs Oliver and runs off. Mr. Brownlow arrives and discovers Nancy's body. A large crowd forms, among them the distraught Bet. Bullseye, Bill's terrier, turns on his master and returns to the scene of the crime and the crowd prepares to follow him to the hideout. Fagin and his boys leave their hideout in panic. Not finding Bill at the hideout, the crowd returns to the Thames Embankment. Bill appears at the top of the bridge, holding Oliver as hostage and threatening to kill him. Two policemen sneak up on him. One of them shoots Bill and the other grabs Oliver. After Oliver is reunited with Mr. Brownlow, the mob disperses offstage in order to track down Fagin. He appears and decides that the time has never looked better for him to straighten out his life (\"Reviewing the Situation [Reprise]\")."}