{"mid": "Olivia", "IMDB_id": "tt0082841", "title": "Olivia", "plot": "Olivia, an English teenager, arrives at a finishing school in France. Olivia finds comfort in the school which differs greatly from her former restrictive English boarding school and where the students and faculty are welcoming.\nThe majority of the pupils in the school are divided into two camps: those that are devoted to the headmistress, Mlle Julie and those who follow Mlle Cara, an emotionally manipulative invalid who is obsessed with Mlle Julie.\nOlivia becomes an immediate favourite of Mademoiselle Cara who shows her a photograph album full of pictures of the history of the school. When Olivia admires a girl in the pictures, Laura, Mlle Cara becomes angry and withdrawn; another pupil later explains that before she left Laura was Mlle Julie's favourite pupil. Later Olivia hears Mlle Julie reading Andromaque and begins to fall in love with her.\nMlle Julie takes Olivia to Paris on a day trip and Olivia becomes more and more obsessed with her. Shortly after Laura arrives and she and Olivia quickly become friends. Olivia asks her if she is in love with Mlle Julie and Laura replies that she loves her but is not in love with her. Later, Laura hears an argument where Mlle Cara accuses Mlle Julie of not loving her and expresses her jealously that both Olivia and Laura love Mlle Julie and not her. That night, before going to bed Mlle Julie passes Olivia's room where she kisses her on the eyes while telling her to go to sleep. Olivia responds by passionately kissing her hands which Mlle Julie tries to play it off as her being overly affectionate.\nAround Christmas time Laura leaves the school again confessing to Olivia that she can't bear Mlle Cara's jealousy and warning Olivia to watch out. Directly after she leaves however Olivia goes to Mlle Julie and tells her she loves her.\nAt the Christmas ball Mlle Julie kisses another pupil on the neck in front of Olivia and later promises to join Olivia in her room later that night and give her something sweet. However Mlle Julie does not come to visit Olivia and the following morning tells her that she didn't go into her room to protect her. Olivia is deeply disappointed and cries herself to sleep in front of the fire in Mlle Julie's room where she is later discovered by Mlle Cara. Mlle Cara is enraged at finding her and attacks her physically telling her she's a disappointment. When Mlle Julie enters the room to see them fighting Mlle Cara accuses her of going into the girls' rooms at night. After their fight Mlle Julie announces that she will be leaving the school, leaving it in the care of Mlle Cara.\nThe night before she is to leave Mlle Julie enters Olivia's room, confessing that she loves her. She leaves only to return shortly after screaming for Olivia to call for help for Mlle Cara who died from an overdose of chloral. Mlle Julie is heartbroken over her death calling Mlle Cara the only person she ever really loved."}