{"mid": "OmenIvTheAwakening", "IMDB_id": "tt0102585", "title": "Omen IV: The Awakening", "plot": "Virginia congressman Gene York (Michael Woods) and his attorney wife Karen (Faye Grant), after numerous failed attempts to have children, go to a nun-owned orphanage where they adopt a child that they name Delia from a nun named Sister Yvonne (Megan Leitch). At first, other than Delia scratching Karen and the later heart attack of the preacher overseeing her baptism, all seems normal. But seven years later, after the Yorks adopt a rottweiler that they name Ryder, Delia (Asia Vieira) starts to display the traits and personality of an increasingly violent and manipulative sociopath. Furthermore, as the family doctor, Dr. Hastings (Madison Mason) reveals that she is going through puberty, strange events begin to occur around Delia, including the death of the father of a boy whom she terrorized. Jo Thueson (Ann Hearn), a New Age practitioner hired by the Yorks as a nanny to help while Gene runs for the Senate, senses something suspicious about Delia after finding her healing crystals blackened by the girl's touch.\nAt the advice of her friend, an aura reader named Noah (Jim Byrnes), Jo takes Delia to a fair, where all psychics present sense a feeling of unease brought on by the girl's presence. Jo manages to get Noah to take an Aura photograph of Delia before she storms off. But as Noah sees her photograph showing very dark colors, Delia causes a fire that sets the entire fairground ablaze. Though Noah warns her to leave after showing her the photo, Jo attempts to find out why her young charge is so full of negative energy. It is during this investigation that Jo learns of Delia's true identity, but before she can share this information with anyone she is sent plummeting out of a window by Ryder. Karen, who witnesses the fall, faints from shock and is taken to the hospital, where she learns that she is pregnant.\nBecoming increasingly alarmed and suspicious of her adoptive daughter, Karen turns to her preacher, Father James Mattson (Duncan Fraser), for help in understanding what Jo learned of Delia, and is told of the Antichrist. Eight months later, after learning that Sister Yvonne mysteriously left the orphanage when she and Gene adopted Delia, Karen hires detective Earl Knight (Michael Lerner) to find Delia's biological parents. Knight's search takes him to Charlotte, North Carolina, where Sister Yvonne now goes by the name Felicity. He finds her taking part in a bizarre religious ceremony during which Felicity stands in a circle surrounded by rattlesnakes. Earl shows Felicity a recent photograph of Delia, and unintentionally causes her suffer an envenomation overdose during a Snake handling ritual. After speaking to her before she dies, Knight finds clippings in Felicity's trailer relating to Gene. Unable to return to Virginia, Knight sends Karen a letter of his findings in the mail prior to being killed in a bizarre construction accident.\nBy this time, with her paranoia worsening, Karen has given birth to her son, Alexander, and is eventually able to leave the hospital and return home to meet the new nanny, Lisa Roselli (Andrea Mann). Growing increasingly distrustful of Delia around Alexander while learning of Yvonne and Knight's deaths, Karen receives the latter's letter that details Damien Thorn and reveals that Dr. Hastings is a Satanic disciple. Confronting Hastings for answers, Karen learns that Delia is actually Damien's daughter and that she is the protector of the real Antichrist: her twin brother, Alexander, whose embryo was carried inside Delia before being implanted into Karen by Hastings. Karen kills Hastings before returning home armed with his gun, where she kills Roselli, also a Satanic disciple, only to find Delia waiting for her, holding Alexander and drawing Karen's attention to the 666 symbol, clearly displayed on the palm of her brother's hand. Be it by the children's power or by her own inability to kill the infant, Karen ends up taking her own life, with Gene, Delia and Alexander attending her funeral."}