{"mid": "OnAClearDayYouCanSeeForever", "IMDB_id": "tt0066181", "title": "On a Clear Day You Can See Forever", "plot": "Act I\nQuirky Daisy Gamble sees herself as an unremarkable person and has low self-esteem, even though she can (1) make plants grow remarkably, (2) predict when a telephone will ring or someone will drop in, and (3) tell where to find an object that someone else is looking for. Her current problem, though, is her nasty smoking habit, which will interfere with the chances of her fiancé, Warren, for a job with great benefits. She seeks help from a psychiatrist, Dr. Mark Bruckner, to stop smoking. When he hypnotizes her, she describes living a previous life in late 18th century England as \"Melinda Wells\", who died in her late twenties from circumstances beyond her control. Free spirited Melinda was in love with portrait painter Edward Moncrief. Dr. Mark keeps to himself what Daisy has revealed to him, and he tells her that she should not be ashamed of her ESP.\nAt their next session, Daisy, under hypnosis, relates scenes from the salacious London Hellrakers' Club where Melinda met Edward. Melinda and Edward eventually marry, but the painter is unfaithful to her, making love to his subjects. Mark, the psychiatrist, finds himself falling for \"Melinda\" and becomes convinced that Daisy is really the reincarnation of Melinda. Melinda finally left Edward and set sail for America, but the ship never reached Boston. Before Mark can save Melinda from shipwreck, Daisy wakes up.\nAct II\nMark reports on the case to his fellow psychiatrists, who ridicule his findings. Greek shipping magnate Themistocles Kriakos learns of Mark's belief in reincarnation and offers to finance a study of the events of Melinda's life in exchange for Mark's help in discovering who he will be in his next life, which will allow him to leave his fortune to his future self. Daisy accidentally discovers that she is the \"Melinda\" at the center of the growing controversy and that Mark prefers Melinda to herself. In her angry confrontation with the psychiatrist about the matter, she tells him that she is \"through being a go-between for you and your dream girl. You're not going to go on using my head for a motel.\"\nDaisy goes to the airport, ready to return home. Her ESP powers warn her that the plane on which she plans to travel will crash. She realizes at last how special she really is. She leaves her starchy fiancé (Come Back To Me) and she and Mark unite to explore their extraordinary future."}