{"mid": "OnDeadlyGround", "IMDB_id": "tt0110725", "title": "On Deadly Ground", "plot": "Aegis Oil operates Aegis 1, an oil refinery and several oil rigs in Alaska. They purchased the oil rights from the local Alaskan Natives 20 years ago, but stand to lose them if the refinery isn’t on-line by a certain deadline. With 13 days to go, and billions of dollars at stake, the company cuts corners and uses faulty equipment. Hugh Palmer, a rig foreman, is aware of this; as he predicts, his rig catches fire. It takes Forrest Taft (Seagal), a specialist in dealing with oil drilling-related fires, to extinguish the fire. Taft refuses to believe Hugh’s story of faulty equipment at first, but later discovers that it’s true after accessing the company’s computer records and finding that the next shipments of new, adequate equipment have been delayed way past the deadline. Michael Jennings (Michael Caine), the ruthless CEO of Aegis, deludedly believes that Hugh's carelessness is to blame for the rig fire and, after discovering his efforts to alert the EPA about the use of substandard equipment, arranges for him to be ‘dealt with’ by his henchmen MacGruder (John C. McGinley) and Otto (Sven-Ole Thorsen).\nJennings is alerted to Taft's activities and orders that Taft be also removed. MacGruder and Otto brutally ransack Palmer's cabin for the evidence against Jennings, and torture and murder Palmer without finding it. Taft is set up for a trap by investigating a supposedly damaged pump station. He is badly wounded by an explosion, but survives and is rescued by Masu (Joan Chen), the daughter of Silook, the chief of her tribe.\nMacGruder and Otto are unable to locate Taft's body, and Jennings assumes that he is still alive. Taft is being cared for by Silook's tribe. After unsuccessfully trying to leave using a dogsled, Silook has Taft undergo a vision quest in which he sees the truth. When made to choose between two women, Taft opts for the elderly, clothed grandmother, forgoing the erotically-charged nude Iñupiaq seductress. The grandmother warns Taft that time is running out for those who pollute the world. Taft realizes that his only option is to see the refinery closed. He takes off, with MacGruder and Otto hot on his trail.\nAt Silook's village, they demand to know where Taft is. Silook refuses to give the information and is fatally shot by MacGruder. Jennings berates MacGruder for killing Silook in front of his entire tribe. They bring in a group of New Orleans-based mercenaries led by Stone (R. Lee Ermey) to finish off Taft before he can stop Aegis 1 from going on-line. They also have an FBI Anti-Terrorist Unit at the refinery.\nAccompanied by Masu, Taft (who is probably ex-CIA and an expert on sabotage and demolition), collects weapons and explosives and manages to enter the refinery complex, and begins to effectively sabotage the refinery. MacGruder (who is killed by Taft in the process of getting thrown into the helicopter's tail rotor blades for killing Hugh and Silook), Otto (who was killed earlier at Hugh's cabin) and Jennings’ ruthlessly efficient female assistant Liles (who crashes her truck into a gasoline tank in an escape attempt), are powerless to defeat him and are all killed in various gruesome ways; the FBI also pulls out, revealing in the process that Taft might be ex-CIA.\nTaft and Masu confront Jennings, string him up, and drop him into a pool of oil, effectively drowning Jennings in his own wealth. They then escape as a series of explosions destroy the rest of Aegis 1.\nAs an epilogue, Taft, far from being arrested for sabotage and multiple murders (self defense), is asked to deliver a speech at the Alaska State Capitol about the dangers of oil pollution, and the companies that are endangering the ecosystem. During the speech they show a scene of one of the first commercial hydrogen fuel cell systems developed by Perry Energy Systems."}