{"mid": "Ondine", "IMDB_id": "tt1235796", "title": "Ondine", "plot": "Syracuse \"Circus\" (Colin Farrell) is trawling with his fishing boat and finds a scantily clad young woman caught in his net. He sees she is alive and resuscitates her. She calls herself Ondine (Alicja Bachleda) and refuses to be taken to hospital, not wanting to be seen by anyone else. He shelters her in a caravan house that belonged to his late mother in a quiet harbor, which makes him late for picking up his wheelchair-bound daughter Annie (Alison Barry), who lives with his ex-wife Maura (Dervla Kirwan). During Annie's dialysis, he tells her a story about a fisherman that catches a woman out of the sea. Annie explains the woman could be a magical selkie. Annie receives a new powerchair from the CRC, and upon returning home is greeted by Maura's boyfriend Alex (Tony Curran). Maura flips Circus off for missing the doctor who had news on a kidney match for Annie.\nNext morning, Circus finds Ondine washing clothes in a stream, singing in an unknown language. She follows him on his boat to work the day. Circus pulls up only empty lobster pots, until Ondine starts singing, after which every pot contains a catch. Still not wanting to be seen, Ondine doesn't follow Circus to the fish market where the lobsters are sold. Circus buys a dress and lies to the store clerk that it's for Annie when she grows up.\nWhen Circus picks up Annie from her school, he continues the fisherman story by explaining how the woman sings to the fish for him to catch, a song in a language he has never heard before. Annie states that Selk is the language of the selkie. Circus stammers that his lobsters hear her sing, which makes Annie curious as to whose story this is, and she secretly follows him to the caravan. When Circus asks how long she will stay, Ondine says it is up to him. Humored, Circus answers forever and happily ever after, according to the fairytale he has been building with Annie, who watches them without being noticed. Annie is back home studying all her new library books on seals and selkies. Alex says selkies are Scottish creatures, but the one Annie saw is not.\nCircus meets with the priest (Stephen Rea) for a confession, who has repeatedly told Circus that this isn't AA. Circus recalls a recurring nightmare where he is at Alex's funeral and reunited with Maura, still with her drinking problem. As the priest pushes the subject away, Circus brings up the woman he pulled out of the water with his net and kept her. Ondine is by herself tidying up the caravan, and tries her new clothing as if the experience was a first, especially when she stretches leggings over one splayed hand so it looks webbed.\nThe next day, Ondine is swimming and is met by an unexpected Annie, they bond together talking about selkies, none of which Ondine denies, kissing Annie goodbye before the child goes back to her Mam. Circus is in the library asking for books about selkies, but discovers that Annie took them all. Annie runs into some neighbourhood kids showing off their bicycles, lets one of the kids play with her powerchair, it shorts out driving into water. The kids abandon \"spaz\" Annie, who is left alone to push it back home, where she finds Alex drinking beer. As Alex dries out the batteries, Annie asks again about selkies, he tells her they come from his homeland Outer Hebrides. However, Ondine doesn't speak like him.\nCircus brings Ondine fishing again to steer the tiller, until a Fisheries board patrol boat zooms by, causing Ondine to hide. She begins singing again as he is pulling up his net, and finds it filled with a bountiful catch of salmon, that doesn't come from trawling. Ondine hides as the patrol boat returns to inspect for prohibited gillnetting, the guards look for the truth by finding dry gillnets and Ondine hidden in them. Circus wasn't sure if she could be seen, the guards accept Ondine's answer as to how the fish were caught. Glad that Ondine isn't invisible, Circus boats into the town harbor to sell their catch, where everyone stares at Ondine, including a dark-haired man who is looking for her. Circus and Ondine go shopping for clothes and run into Annie, who helps her with outfits, as townsfolk gawk through the store window eyeing a very pretty Ondine.\nLater, Circus wants to pick up Annie for local regatta festivities. Maura says she already left. Ondine gets another surprise visit from Annie, and sees the caravan has been cleaned. Learning that Annie can't swim, they both play in the shallow water, where Ondine finds something that Annie thinks is her seal coat, and they bury it in the greenhouse. Annie wants Ondine to stay for seven years, unless the selkie husband claims her back, and shares this with Circus as they all boat into town, Ondine warns Annie that she isn't selk and can't grant wishes. Upset, Annie pretends to have brake failure to throw herself off the pier, to test Ondine's ability to breathe underwater, when Ondine jumps in to her rescue. They bring Annie back to Maura and Alex, who share with Annie that a man was asking for Ondine. This gives Annie a nightmare about the selkie husband coming. Back in the caravan, Circus explains he's called Circus the Clown because he was an alcoholic like Maura. He stopped drinking for Annie, yet custody went to the mother.\nBack in the confessional, Circus tells the priest he sinned with Ondine the night before, and fears the good luck she brings, since he lost hope long ago. As he leaves, the unknown man approaches him about Ondine, Circus ignores him. Circus brings Annie back from dialysis, but is locked out since Maura and Alex are drinking in a pub. Annie asks to be left with them. Circus returns to find the caravan has been ransacked, and Ondine hiding nearby. Circus wants Ondine to stay and asks her to wish the man away, but her only wish is for Annie not to be sick. Ondine's man is back in town driving with rage, causing an accident with Maura who was drunk driving. Alex is killed, thrown through the windshield. Ondine and Circus follow Annie to the hospital, and learn she is getting an immediate kidney transplant from Alex who opted as a donor. The man is also brought to the hospital, and asks Ondine why she speaks their language as they both don't belong here.\nCircus and Maura both get drunk at Alex's wake. Maura wants him to get rid of Ondine, now hiding in his boat, because of bad luck. Intoxicated Circus maroons Ondine at Roancarrig Lighthouse island because he thinks she will haunt him forever, as humans and selk don't belong together. Dusk comes and some driftwood gives Ondine's basking shilouette the appearance of a seal's tail, she jumps into the sea towards the seals on Seal Rock. The priest wakes up a depressed Circus, and he brings Annie from hospital to his home. She comforts him saying Ondine will be back because she left something behind. Annie watches TV with Sigur Rós performing, Circus recognizes they are the songs of Ondine, and goes back to find her on Seal Rock to demand the truth. Ondine gives one version that she is a sea creature that found her seal coat and buried it so she can stay with a family she loves. She then explains that she is a drug mule from Romania, and her pushta Vladic (Emil Hostina) was evading the Coast Guards, when she swam away with the backpack of heroin since Vladic can't swim. She floated in the sea until Circus saved her.\nCircus brings Ondine back to Annie where they are ambushed by Vladic and another gunman, that Annie thinks want the seal coat. Everyone goes to the greenhouse to dig it up, but find nothing because Annie had moved it. Ondine promises to stay with Annie, revealing it was moved to a lobster pot. As they pull that up, Annie reminds Ondine that she is a selkie yet Vladic isn't, Ondine trips Vladic overboard by pulling on the rope he is standing on. He drowns going after the falling lobster pot pushed back in by Annie. Circus throws the other Romanian into the water, disarming him and the Romanian is arrested ashore, along with Ondine, who faces deportation. Annie is seen making a confession to the priest who is to wed Circus and Ondine, completing the fairytale how selkie women often find unexpected happiness with a landsman."}