{"mid": "OneCrazySummer", "IMDB_id": "tt0091680", "title": "One Crazy Summer", "plot": "Delphine, 11, Vonetta, 9, and Fern, 7, live with their father and grandmother in Brooklyn, New York. However, the girls’ father sends them to Oakland, California one summer to stay with their estranged mother, Cecile, who refers to herself as Nzila. Cecile never calls Fern by her name, always referring to her as \"little girl.\" This makes Delphine believe what her grandmother has always said to be true—that Cecile abandoned her children because their father objected to her giving the baby the name of Afua. Cecile makes Delphine hand over the money her father gave them for expenses in California, giving them a small allowance to get Chinese food every day and forbidding them to enter her kitchen, which is Cecile’s workplace where she writes and prints poetry.\nDuring the day, the three sisters go to The People's Center run by the Black Panther Party for breakfast and day camp, where they meet Sister Mukumbu. Here the three sisters get a radical education that paints the Black Panther Party in a positive light, showing the good deeds they do, such as feeding poor children. The Black Panther member Bobby Hutton has been shot and killed by police, and one of their founding members, Huey Newton, has been wrongfully jailed. The children at the center will soon participate in a rally to protest these injustices.\nAfter a day trip to San Francisco, the sisters return home to find their mother Cecile and two members of the Black Panther Party being arrested. Cecile tells the police she has no children, so the girls pretend to live next door. Soon a friend from the Center, Hirohito, comes for the girls and allows them to stay with him until Cecile returns home.\nThe time of the rally arrives. During the talent show portion, and the girls perform a poem their mother wrote, which they found while cleaning the kitchen after her arrest. After their recital, Fern takes the microphone and tells the Black Panthers how she saw one of their most vocal members, (Crazy) Kelvin, interacting agreeably with the police, which gets him in trouble with the party members.\nAt the rally, the sisters see their mother has been released from jail, and return home with her. Though Delphine and Cecile’s relationship remains strained, Cecile tells Delphine how she lost her mother at age 11 and had a rough life thereafter. She tries to explain why she left her children, but Delphine is still too young to understand. The next day, the girls return home, after finally hugging their mother."}