{"mid": "OneFroggyEvening", "IMDB_id": "tt0048449", "title": "One Froggy Evening", "plot": "An unnamed man is working on the demolition of an old building. As he comes across the cornerstone of the building, he finds a box inside it. Contained within the box are a piece of paper commemorating the creating of the building in 1892, as well as a frog (still alive after more than 50 years). The man soon is amazed when the frog grabs a miniature cane, puts on a top hat, and begins to sing \"Hello, My Baby.\" Sensing a way to get rich quickly, the man puts the frog back in the box, and sneaks away.He next ends up in the office of a talent agency, but the frog refuses to perform. After the man is kicked out of the office into an empty hallway, the frog begins to sing and dance to \"The Michigan Rag.\" The man eagerly rushes back to let the talent agency employee see, but the frog goes silent before he can show him. Unknown to the man, the frog will only perform for him.Shortly afterwards, the man attempts to try to capitalize on the frog again. Using up all his money, he purchases a theater promoting the frog. However, when the curtain rises, the frog once again refuses to sing. The man shortly thereafter goes bankrupt, and ends up on the streets.One late evening, an officer overhears the frog singing \"Largo al factotum.\" The officer finds the man sitting on the bench with the (now silent) frog. When the officer inquires who was disturbing the peace, the man angrily points to the frog. This causes the officer to arrest the man and have him committed to an asylum.When he finally gets out, the old man sees a new building about to be dedicated. Sneaking onto the site, he drops the box with the frog into the new building's cornerstone, and sneaks off as the frog sings \"Please Don't Talk About Me When I'm Gone.\"Over a hundred years later, the new building is being demolished, when a worker comes across the cornerstone. Inside, like the previous man, he finds the singing frog, who sings \"Hello, My Baby\" just for him. Just like the previous man, this one feels he can profit from the singing amphibian, and sneaks off the site with it, unaware of what will happen to him."}