{"mid": "OneMillionYearsBc", "IMDB_id": "tt0060782", "title": "One Million Years B.C.", "plot": "Akoba (Robert Brown) leads a hunting party into the hills to search for prey. One member of the tribe traps a warthog in a pit, and then Akoba's son Tumak (John Richardson) kills it. The tribe brings it home for dinner and Tumak is later banished to the harsh desert because of a fight over a piece of meat with Akoba. After surviving many dangers such as a giant iguana, ape men, Brontosaurus and a giant spider, he collapses on a remote beach, where he is spotted by \"Loana the Fair One\" (Raquel Welch) and her fellow fisherwomen of the Shell tribe. They are about to help him when an Archelon (which is three times the size of the actual prehistoric Archelon) makes its way to the beach. Men of the Shell tribe arrive and drive it back into the sea. Tumak is taken to their village, where Loana tends to him. Scenes follow emphasising that the Shell tribe is more advanced and more civilized than the Rock tribe. They have cave paintings, music, delicate jewellery made from shells, agriculture, and rudimentary language – all things Tumak seems to have never before encountered.\nWhen the tribe women are fishing, an Allosaurus attacks. The tribe flees to their cave, but in the panic, a small girl is left trapped up a tree by Tumak. Tumak seizes a spear from Ahot (Jean Wladon), a man of the Shell tribe, and rushes forward to defend her. Emboldened by this example, Loana runs out to snatch the child to safety, and Ahot and other men come to Tumak's aid, one of the men being killed before Tumak is finally able to kill the creature. In the aftermath, a funeral is held for the dead men – a custom which Tumak disdains. Leaving the funeral early, he re-enters the cave, and attempts to steal the spear with which he had killed the Allosaurus. Ahot, who had taken back the spear, enters and is angered by the attempted theft, and a fight ensues. The resulting commotion attracts the rest of the tribe, who unite to cast Tumak out. Loana leaves with him, and Ahot, in a gesture of friendship, gives him the spear over which they had fought.\nMeanwhile, Akoba leads a hunting party into the hills to search for prey but loses his footing while trying to take down a ram. Tumak's brother Sakana (Percy Herbert) tries to kill their father to take power. Akoba survives, but is a broken man. Sakana is the new leader. While this is happening, Tumak and Loana run into a battle between a Ceratosaurus (as with the Archelon the Ceratosaurus is twice as larger than the actual creature) and a Triceratops; the Triceratops eventually wins, charging its opponent and leaving it stunned. The outcasts wander back into the Rock tribe's territory and Loana meets the tribe, but again there are altercations. The most dramatic one is a fight between Tumak's current love interest Loana and his former lover \"Nupondi the Wild One\" (Martine Beswick). Loana wins the fight but refuses to strike the killing blow, despite the encouragement of the other members of the tribe. Meanwhile, Sakana resents Tumak and Loana's attempts at incorporating Shell tribe ways into their culture.\nWhile the cave people are swimming – seemingly for the first time, and inspired by Loana's example – they are attacked by a female Pteranodon. In the confusion, Loana is snatched into the air by the creature, and dropped bleeding into the sea, when a giant thieving Rhamphorhynchus intervenes. Loana manages to stagger ashore while the two pterosaurs battle and then falls down. Tumak arrives but is only greeted by the sounds of the victorious Rhamphorhynchus eating the Pteranodon's young, actually believing it is eating Loana.\nTumak initially believes her dead. Sakana then leads a group of like-minded fellow hunters in an armed revolt against Akoba. Tumak, Ahot and Loana (who had staggered back to her tribe after the Pteranodon dropped her into the sea), and other members of the Shell tribe arrive in time to join the fight against Sakana. In the midst of a savage hand-to-hand battle, a volcano suddenly erupts: the entire area is stricken by earthquakes and landslides that overwhelm both tribes. As the film ends, Tumak, Loana, and the surviving members of both tribes emerge from cover to find themselves in a ruined, near-lunar landscape. They all set off – now united – to find a new home."}