{"mid": "OneWeek", "IMDB_id": "tt1104806", "title": "One Week", "plot": "Ben Tyler (Joshua Jackson) is a young elementary school English teacher living in Toronto, Ontario. Ben is told that he has been diagnosed with an aggressive form of cancer in its fourth and final stage.\nOn the way home, he encounters an elderly man Marc Strange selling his 1973 Norton Commando motorcycle. The narrator notes that Ben's fiancée Samantha Pierce (Liane Balaban) despises motorcycles, but he buys it. Finishing a Tim Hortons coffee, he rolls up the cup's rim to see if he has won a prize, but sees only a message that reads \"Go West Young Man\".\nHe breaks the news of his cancer to Samantha, as well as his desire to take a two-day excursion on the motorcycle. She objects, arguing that he should begin treatment immediately, but he feels a need for an adventure before \"becoming a patient\". He asks Samantha to come with him, but she refuses, and he ultimately sets out from Toronto by himself. Early in the trip he begins to question the trip's worth, and turns back. But he encounters two young men bicycling from Newfoundland to Vancouver on a wager of a case of beer, and his adventure seems reasonable by comparison, so he resumes it.\nHe finds that Samantha has packed a copy of a book he had written as a child, hoping that an attached note about reading it to his children someday would persuade him to return and begin treatment. But the story, about a mythical creature called Grumps, which his father had said would bring good fortune to any child who managed to find one, strengthens his resolve to symbolically resume his search for Grumps.\nBen begins to question his future with Samantha: He recalls their discovery while planning their wedding that their religious beliefs – Ben has none – differ, and they have a telephone argument about compromises she's made for him. He meets a middle-aged man (Gord Downie) staying in the same motel, who successfully treated his cancer years before; he tells Ben that if he's unsure if he's in love, he isn't.\nHis motorcycle breaks down in rural Saskatchewan. Nearby, he finds a dead dog and phones its owner, a middle-aged rancher. In gratitude, she picks up him and his motorcycle, takes him on a scenic horseback ride, and fixes the minor problem with his bike. She is twice-divorced with a son and granddaughter she rarely sees, but the narrator explains that the time with Ben inspires her to seek the son out, coincidentally meeting the new \"love of her life\".\nContinuing the trip beyond the promised two days, he arrives at Banff National Park in Alberta, and checks into an expensive hotel suite. Samantha has told his family about his cancer, and is flying out to get him. He goes on what he fears will be a last adventure in the woods, where he gets lost and meets a backpacker, Tracy (Emm Gryner) exploring the backcountry with her dog. At her campsite, she chides Ben for giving up too easily on his dreams: of a singing career quashed by a teacher's harsh remarks, and a novel which he failed to find a publisher for. Ben spends the night with her. The next morning, Samantha has arrived earlier than expected, and Ben admits to sleeping with Tracy. He also tells Samantha that he does not love her like she loves him; she leaves him and returns home.\nBen makes his way to the west coast of Vancouver Island. At a diner, he finds himself unable to eat his meal, and meanwhile a truck hits his motorcycle in the parking lot, wrecking it. He rents a surfboard and takes it out into the Pacific, but rather than catching a wave to ride back in, he keeps going, despondent. He sees a humpback whale dramatically breach the surface. Ben remembers that his father had said to him as a child that anyone who searched for Grumps would \"know him when you see him\"; Ben is satisfied that he has, and returns home. He and Samantha discuss his prospects and their impending breakup, and he goes home to see his family.\nThe final sequence reveals the movie's narrator (Campbell Scott) recording the final chapter of an audio book, revealed to be One Week by Ben Tyler, a memoir of his motorcycle trip."}