{"mid": "Onibaba", "IMDB_id": "tt0058430", "title": "Onibaba", "plot": "The film is set somewhere in Japan, in the mid-fourteenth century during a period of civil war. Two wounded soldiers flee from pursuers on horse in thick reeds which are taller than a man. Suddenly the soldiers are killed with spears by unseen assailants. Two women appear, take the armour and weapons, and drop the bodies in a hole. The women return to a small hut. The next day they take the armor and weapons to a merchant named Ushi (Taiji Tonoyama) and trade them for food. The merchant tells them news of a war. Ushi tries to seduce the older woman in vain. A neighbor named Hachi (Kei Satō), who has been at war, returns. The older woman (Nobuko Otowa) asks Hachi about her son, who was forced to be a soldier along with Hachi. The son is the husband of the younger woman (Jitsuko Yoshimura). Hachi tells about his experience in two fights, where general Takauji Ashikaga attacked his division. He says that he and the younger woman's husband deserted. Later her husband was killed while they were stealing food from farmers and he barely escaped. The older woman warns the younger woman to stay away from Hachi, whom she blames for her son's death.\nOne beautiful day the three, who are out at the lake talking and minding their own business, see two samurai chasing one another and fighting on horseback. They jump in the lake and keep fighting, swimming closer to the three as they go. As one samurai comes close to them, asking for help, Hachi stabs him with his spear. He then orders the women to get the other man, whom they drown in the lake. The two then take their armour as before, sell it to Ushi, and have a good meal. Despite the warning to stay away from Hachi, he seduces the young woman and she sneaks out of her hut every night to have sex with him. The older woman learns of the relationship and is angered by this. She tries to sleep with Hachi, then pleads with him to not take the young woman away since she cannot kill without her help.\nOne night, while Hachi and the young woman are together, a lost samurai in a demon --Hannya- mask (Jūkichi Uno) forces the older woman to guide him out of the swamp. She tricks him into plunging to his death in the pit where the women dispose of their victims. She climbs down and steals the samurai's possessions and, with great difficulty, his mask. Under the mask he is disfigured. As she leaves, the older woman then gets an idea to keep her daughter-in-law away from Hachi.\nAt night, the older woman dons the mask and frightens the young woman away from Hachi. During a storm, the older woman terrifies the young woman with the mask, but Hachi finds the daughter-in-law and again has sex with her in the grasses as the old woman watches from afar. Hachi returns to his hut. He finds a man in his hut. The man kills Hachi.\nThe older woman discovers that, after getting wet in the rain, the mask is impossible to remove. She reveals her scheming to the young woman and pleads with her to help take off the mask. The young woman agrees to remove the mask after the older woman promises not to interfere with her relationship with Hachi. The young woman breaks off the mask with a hammer. Under the mask, the older woman's face is covered with sores. The young woman thinks the older woman has turned into a demon, and runs from her; the older woman runs after her, crying out that she is a human being, not a demon. The young woman leaps over the pit, and as the older woman leaps after her the film ends."}