{"mid": "OnlyAngelsHaveWings", "IMDB_id": "tt0031762", "title": "Only Angels Have Wings", "plot": "Geoff Carter (Grant) is a pilot and the manager of Barranca Airways, a small, barely solvent company owned by \"Dutchy\" Van Ruyter (Sig Ruman) carrying airmail from the fictional South American port town of Barranca through a high pass in the Andes Mountains. Bonnie Lee (Arthur), a piano-playing entertainer, arrives one day. Joe Souther (Noah Beery Jr), a pilot who had been planning to have dinner with her, crashes trying to land in fog on her first day at the air base. Bonnie becomes infatuated with Carter, despite his fatalistic attitude about the dangerous mountain flying, and stays on in Barranca (not at Carter's invitation, as he insists on telling her).\nThe situation is complicated by the appearance of pilot Bat MacPherson (Richard Barthelmess) and his wife, Geoff's old flame Judy (Rita Hayworth). MacPherson is revealed to be an alias; his real surname is Kilgallen. He is infamous among the pilots for having once bailed out of a plane, leaving his mechanic — the brother of \"Kid\" Dabb (Thomas Mitchell), Carter's best friend — to be killed in the resulting crash. When Geoff is forced to ground the Kid because of failing eyesight, he is short on pilots and agrees to hire MacPherson on the condition that he fly the most dangerous missions. MacPherson understands and accepts the setup: none of the other pilots would shed a tear if he were lost.\nDutchy will secure a lucrative government mail contract that would put the airline on a solid financial footing, if he proves he can provide reliable mail service during a six month trial period. On the last day of Barranca Airways' probation, bad weather closes the mountain pass. Geoff plans to fly a new Ford Trimotor over the mountains at an altitude of 17,000 feet. The Kid asks to go with him, as co-pilot. When Geoff refuses him, the Kid suggests letting the toss of a coin decide the matter. Geoff tries to grab the coin in mid-air. However, it lands on the floor, and he picks it up and finds that it has two heads — which would insure the Kid’s being on board. Realizing how important it is to the Kid, Geoff agrees to take him along. Just before leaving, Bonnie tries to talk Geoff out of going. As they hug, she takes his gun out of his holster, points it at him and tells Geoff that she won't let him go. Knowing that she really can't stop him, she lowers the gun. However, when she drops the gun on the table, it accidentally fires, hitting Geoff in the shoulder.\nUnable to fly, Geoff agrees to let Bat and the Kid try flying over the mountains instead of threading the pass. However, they are unable to climb above 15,600 feet before the plane stalls and falls off. The Kid radios Geoff and tells him that the plane could not get enough altitude to go over the mountains. Although Geoff tells them to turn around and return, the Kid and Bat decide to try to fly through the fogged-in pass. On the way through, they encounter a flock of condors. One crashes through the windshield, injuring the Kid; another tangles with the No. 1 engine, setting it on fire. Later the No. 2 engine also catches fire. The Kid tells Bat to bail out but Bat refuses, turns the plane around and manages to land the burning Trimotor back in Barranca. The Kid dies from a broken neck, but not before telling Geoff of Bat's valor. As a result, Bat is finally accepted by the other pilots.\nBonnie is torn between leaving and staying, and confronts Geoff in the hope he will ask her to stay. However, Geoff is quoted earlier as saying that \"he would never ask a women for anything,\" and doesn't make the request she is hoping for. Then the weather clears and Geoff is about to rush out to secure the all-important contract. Before he goes, he offers to toss a coin to decide: heads, she stays; tails, she leaves. Bonnie is unwilling to decide her life so haphazardly, saying with tears \"I'm hard to get, Geoff — all you have to do is ask me!\" As he leaves, Geoff gives her the coin as a \"souvenir.\" At first she is distraught, but then she's thrilled when she discovers that the coin has heads on both sides and realizes it was Geoff's way of asking her to stay."}