{"mid": "OnTheRoad", "IMDB_id": "tt0337692", "title": "On the Road", "plot": "The two main characters of the book are the narrator, Sal Paradise, and his friend Dean Moriarty, much admired for his carefree attitude and sense of adventure, a free-spirited maverick eager to explore all kicks and an inspiration and catalyst for Sal's travels. The novel contains five parts, three of them describing road trips with Moriarty. The narrative takes place in the years 1947 to 1950, is full of Americana, and marks a specific era in jazz history, \"somewhere between its Charlie Parker Ornithology period and another period that began with Miles Davis.\" The novel is largely autobiographical, Sal being the alter ego of the author and Dean standing for Neal Cassady.\n=== Part One ===\nThe first section describes Sal's first trip to San Francisco. Disheartened after a divorce, his life changes when he meets Dean Moriarty, who is \"tremendously excited with life,\" and begins to long for the freedom of the road: \"Somewhere along the line I knew there would be girls, visions, everything; somewhere along the line the pearl would be handed to me.\" He sets off in July 1947 with fifty dollars in his pocket. After taking several buses and hitchhiking, he arrives in Denver, where he hooks up with Carlo Marx, Dean, and their friends. There are parties—among them an excursion to the ghost town of Central City. Eventually Sal leaves by bus and gets to San Francisco, where he meets Remi Boncoeur and his girlfriend Lee Ann. Remi arranges for Sal to take a job as a night watchman at a boarding camp for merchant sailors waiting for their ship. Not holding this job for long, Sal hits the road again. \"Oh, where is the girl I love?\" he wonders. Soon he meets Terry, the \"cutest little Mexican girl,\" on the bus to Los Angeles. They stay together, traveling back to Bakersfield, then to Sabinal, \"her hometown,\" where her family works in the fields. He meets Terry's brother Ricky, who teaches him the true meaning of \"mañana\" (\"tomorrow\"). Working in the cotton fields, Sal realizes that he is not made for this type of work. Leaving Terry behind, he takes the bus back to Times Square New York, bums a quarter off a preacher who looks the other way, arrives at his Aunt's house in Paterson, just missing Dean, who had come to see him, by two days.\n=== Part Two ===\nIn December 1948 Sal is celebrating Christmas with his relatives in Testament, Virginia, when Dean shows up with Marylou (having left his second wife, Camille, and their newborn baby, Amy, in San Francisco) and Ed Dunkel. Sal's Christmas plans are shattered as \"now the bug was on me again, and the bug's name was Dean Moriarty.\" First they drive to New York, where they meet Carlo and party. Dean wants Sal to make love to Marylou, but Sal declines. In Dean's Hudson they take off from New York in January 1949 and make it to New Orleans. In Algiers they stay with the morphine-addicted Old Bull Lee and his wife Jane. Galatea Dunkel joins her husband in New Orleans while Sal, Dean, and Marylou continue their trip. Once in San Francisco, Dean again leaves Marylou to be with Camille. \"Dean will leave you out in the cold anytime it is in the interest of him,\" Marylou tells Sal. Both of them stay briefly in a hotel, but soon she moves out, following a nightclub owner. Sal is alone and on Market Street has visions of past lives, birth, and rebirth. Dean finds him and invites him to stay with his family. Together, they visit nightclubs and listen to Slim Gaillard and other jazz musicians. The stay ends on a sour note: \"what I accomplished by coming to Frisco I don't know,\" and Sal departs, taking the bus back to New York.\n=== Part Three ===\nIn the spring of 1949, Sal takes a bus from New York to Denver. He is depressed and lonesome; none of his friends are around. After receiving some money, he leaves Denver for San Francisco to see Dean. Camille is pregnant and unhappy, and Dean has injured his thumb trying to hit Marylou for sleeping with other men. Camille throws them out, and Sal invites Dean to come to New York, planning to travel further to Italy. They meet Galatea, who tells Dean off: \"You have absolutely no regard for anybody but yourself and your kicks.\" Sal realizes she is right—Dean is the \"HOLY GOOF\"—but also defends him, as \"he's got the secret that we're all busting to find out.\" After a night of jazz and drinking in Little Harlem on Folsom Street, they depart. On the way to Sacramento they meet a \"fag\", who propositions them. Dean tries to hustle some money out of this but is turned down. During this part of the trip Sal and Dean have ecstatic discussions having found \"IT\" and \"TIME\". In Denver a brief argument shows the growing rift between the two, when Dean reminds Sal of his age, Sal being the older of the two. They get a '47 Cadillac from a travel bureau that needs to be brought to Chicago. Dean drives most of the way, crazy, careless, often speeding over 100 miles per hour (160 km/h), bringing it in a disheveled state. By bus they move on to Detroit and spend a night on Skid Row, Dean hoping to find his homeless father. From Detroit they share a ride to New York and arrive at Sal's aunt's new flat in Long Island. They go on partying in New York, where Dean meets Inez and gets her pregnant while his wife is expecting their second child.\n=== Part Four ===\nIn the spring of 1950, Sal gets the itch to travel again while Dean is working as a parking lot attendant in Manhattan, living with his girlfriend Inez. Sal notices that he has been reduced to simple pleasures—listening to basketball games and looking at erotic playing cards. By bus Sal takes to the road again, passing Washington, D.C., Ashland, Cincinnati, and St. Louis, and eventually reaching Denver. There he meets Stan Shephard, and the two plan to go to Mexico City when they learn that Dean has bought a car and is on the way to join them. In a rickety '37 Ford sedan the three set off across Texas to Laredo, where they cross the border. They are ecstatic, having left \"everything behind us and entering a new and unknown phase of things.\" Their money buys more (10 cents for a beer), police are laid back, cannabis is readily available, and people are curious and friendly. The landscape is magnificent. In Gregoria, they meet Victor, a local kid, who leads them to a bordello where they have their last grand party, dancing to mambo, drinking, and having fun with prostitutes. In Mexico City Sal becomes ill from dysentery and is \"delirious and unconscious.\" Dean leaves him, and Sal later reflects that \"when I got better I realized what a rat he was, but then I had to understand the impossible complexity of his life, how he had to leave me there, sick, to get on with his wives and woes.\"\n=== Part Five ===\nDean, having obtained divorce papers in Mexico, had first returned to New York to marry Inez, only to leave her and go back to Camille. After his recovery from dysentery in Mexico, Sal returns to New York in the fall. He finds a girl, Laura, and plans to move with her to San Francisco. Sal writes to Dean about his plan to move to San Francisco. Dean writes back saying that he's willing to come and accompany Laura and Sal. Dean arrives over five weeks early, but Sal is out taking a late-night walk alone. Sal returns home, sees a copy of Proust, and knows it is Dean's. Sal realizes his friend has arrived, but at a time when Sal doesn't have the money to relocate to San Francisco. On hearing this Dean makes the decision to head back to Camille. Sal's friend Remi Boncoeur denies Sal's request to give Dean a short lift to 40th Street on their way to a Duke Ellington concert at the Metropolitan Opera House. Sal's girlfriend Laura realises this is a painful moment for Sal and prompts him for a response as the party drives off without Dean. Sal replies: \"He'll be alright\". Sal later reflects as he sits on a river pier under a New Jersey night sky about the roads and lands of America that he has travelled and states: \". . . I think of Dean Moriarty, I even think of Old Dean Moriarty the father we never found, I think of Dean Moriarty.\"\n=== Characters ===\nKerouac often based his fictional characters on friends and family.\n\"Because of the objections of my early publishers I was not allowed to use the same personae names in each work.\""}