{"mid": "OrdealByInnocence", "IMDB_id": "tt0087852", "title": "Ordeal by Innocence", "plot": "While serving a sentence for killing Rachel Argyle, his adoptive mother – a crime he insisted he didn't commit – Jacko Argyle dies in prison. His own widow, Maureen, believed him to be responsible. Two years later, the man who could have supported Jacko's alibi suddenly turns up; and the family must come to terms not only with the fact that Jacko was actually innocent, but that one of them is the real murderer, and now suspicion falls upon each of them. Christie's focus in this novel is upon the psychology of innocence, as the family members struggle with their suspicions of one another.\nThe witness, Arthur Calgary, who was unaware of the events and thus failed to come forward and not otherwise locatable by the police, believed the family would be grateful once he cleared their son's name. He failed to realize the full implications of his information. However, once he does so, he is determined to protect the innocent by finding the murderer. To be able to do so, he visits the retired local doctor, Dr MacMaster, to ask him about the now-cleared murderer, Jacko Argyle. MacMaster states that he was surprised when Jacko killed his mother. Not because he thought that murder was outside Jacko's 'moral range', but because he thought Jacko would be too cowardly to kill somebody himself; that, if he wanted to murder somebody, he would egg on an accomplice to do his dirty work. MacMaster says \"the kind of murder I'd have expected Jacko to do, if he did one, was the type where a couple of boys go out on a raid; then, when the police come after them, the Jackos say 'Biff him on the head, Bud. Let him have it. Shoot him down.' They're willing for murder, ready to incite to murder, but they've not got the nerve to do murder themselves with their own hands.\" This description seems to be a reference to the Craig and Bentley case which had occurred in 1952.\nWhile two outsiders attempt to find the murderer, it is an insider – Philip Durrant – whose efforts to uncover the truth force the actual killer to kill again. Ultimately it is revealed that the murderer was indeed acting under the influence of Jacko Argyle. The failure of Jacko's carefully planned alibi was, in hindsight, an ironic stroke of fate when the police failed to locate the absent Calgary. Jacko was not innocent at all and had a hand in the death of his adoptive mother. The killer is revealed to be Kirsten Lindstrom, the Argyles' middle-aged housekeeper. Jacko had persuaded the plain Kirsten that he was in love with her, and persuaded her to murder his adoptive mother under cover of a \"foolproof\" alibi to steal some much needed money. But once Kirsten learned that Jacko was secretly married, she decided not to cover for Jacko, abandoning him to his fate."}