{"mid": "Orgazmo", "IMDB_id": "tt0124819", "title": "Orgazmo", "plot": "Everyman Mormon missionary Joseph Young (Trey Parker), assigned with his mission partner to Los Angeles, finds the city to be a hostile and unenthusiastic place for their work. The problems worsen when they knock on the door of sleazy porn director Maxxx Orbison (Michael Dean Jacobs) and several security guards are sent to dispose of them. Joe defeats all of them single-handedly with a variety of martial arts skills. Impressed by his performance and bored of his current project’s lead actor, Orbison attempts to hire Joe to be the title character and lead of his pornographic superhero film, Orgazmo. Joe is conflicted because of his beliefs but the salary offered would pay for a wedding in the temple in Utah where his fiancée Lisa (Robyn Lynne Raab) has expressed a strong desire to wed. Joe reluctantly accepts despite being given a sign from God.\nJoe finds the crew of the film intimidating but manages to befriend co-star Ben Chapleski (Dian Bachar), a technical genius and graduate from M.I.T. who works in the pornographic industry to satiate his overactive sex drive. He plays Orgazmo's sidekick Choda Boy, who assists Orgazmo with specially designed sex toys, including Orgazmo's signature weapon, the Orgazmorator, a ray gun that forces orgasm upon whomever it is fired. Ben invites Joe to his home later on and shows Joe a real, working Orgazmorator Ben has built, and he and Joe spend an evening using it on unsuspecting citizens for amusement.\nAt a sushi bar owned by Ben’s Japanese friend G-Fresh (Masao Maki), the two witness a group of thugs vandalizing the bar in an attempt to force out G-Fresh so their dance club next door can expand. Later on, when Ben and Joe are not present, G-Fresh is coerced to leave. Upon finding this out, Joe and Ben don costumes and use their film props and the Orgazmorator to sneak into the club and steal back the contract G-Fresh was forced to sign. Joe is agitated after nearly being shot in the head but Ben is excited by finally getting to be a real superhero.\nOrgazmo becomes an amazing success, both financially and critically, and Orbison withholds Joe's paycheck to keep him in town long enough to announce a sequel, and asks Joe to reprise his role. Tempted with a doubled salary, Joe is confronted by his fiancée who has found out what he has been doing and leaves him. Facing production difficulties and harassment from Orbison’s unsympathetic nephew A-Cup (David Dunn), Joe tries to back out of the project but Orbison refuses. When Joe stands up to him, Orbison has Lisa kidnapped to force Joe into agreement. When Ben finds out the thugs who assaulted G-Fresh are also working for Orbison, he joins Joe in storming Orbison’s mansion before Lisa can be forced to perform in one of Orbison’s films.\nFighting through Orbison’s group of henchmen, Joe and Ben meet their match in A-Cup. Joe helps Ben overcome a mental block from childhood that forced him to repress the Hamster Style discipline of martial arts, allowing Ben to beat A-Cup. After repairing his damaged Orgazmorator, Joe repeatedly shoots Orbison with it, incapacitating him and capturing all the henchmen. Ben blows up the mansion with another device, the \"Cock Rocket\", destroying Orbison's base of operations. Joe and Lisa reconcile and she gives him her blessing to remain in Los Angeles and continue being a hero alongside Ben.\nAs the film ends, Orbison is seen in a doctor’s office being told that after so many orgasms in a row, his testicles have swollen to the size of oranges and that surgical removal is the only option. A now insane Orbison declares revenge on Orgazmo as he will now be the personification of A-Cup's character and Orgazmo's nemesis who is immune to the Orgazmorator: Neutered Man."}