{"mid": "Orlando", "IMDB_id": "tt0107756", "title": "Orlando", "plot": "The film begins in the Elizabethan era shortly before the death of Queen Elizabeth I. On her deathbed, Elizabeth promises an androgynous young nobleman named Orlando a large tract of land and a castle built on it along with a generous monetary gift which she will only bequeath to him if he consents to her command, \"Do not fade. Do not wither. Do not grow old.\" Both he and his heirs will keep the land and inheritance forever. Orlando acquiesces and resides in splendid isolation in the castle for a couple of centuries, during which time he dabbles in poetry and art. His attempts to befriend a celebrated poet, however, backfire when the poet ridicules his verse. Orlando then travels to Constantinople as English ambassador to the Turks, where he is almost killed in a diplomatic fracas. Waking up the next morning, he learns something even more startling: he has physically transformed into a woman overnight.\nThe now Lady Orlando comes home to her estate in Middle Eastern clothing, only to learn that she faces several impending lawsuits arguing that Orlando was a woman to begin with and therefore has no right to the land or any of her/his royal inheritance.\nThe succeeding two centuries tire her out; the court case, bad luck in love and the wars of British history eventually bring her up to the 1990s, with a young daughter in tow and a book in search of a publisher. The editor who judges the work as \"quite good\" is, ironically, portrayed by Heathcote Williams – the same actor who denigrated her poetry as a different character 200 years earlier. Having lived a most bizarre existence, Orlando finally finds a tranquil niche within it.\n=== Differences from novel ===\nDirector Sally Potter said: \"My task with the adaptation of Virginia Woolf's book for the screen was to find a way of remaining true to the spirit of the book and to Virginia Woolf's intentions, whilst being ruthless with changing the book in any way necessary to make it work cinematically. [...] The most immediate changes were structural. The storyline was simplified – any events which did not significantly further Orlando's story were dropped.\"\nThe film contains two anachronisms not in the novel. On arrival in Constantinople c1700 England is referred to as a \"green and pleasant land\", a quote from William Blake's \"Jerusalem\", written post 1800. And Orlando receives a gift to celebrate the new century from Queen Anne, who in fact had not yet succeeded to the throne.\nPotter argued that the more pragmatic medium of cinema called for reasons to drive the narrative, over the novel's abstraction and arbitrariness, especially as the story itself is based on a kind of suspension of disbelief. Thus it is Queen Elizabeth who bestows the long life upon Orlando. The change of sex is a result of Orlando reaching a crisis of masculine identity when he is unwilling to conform to what is expected of him as a man. Nor as a woman can Orlando conform. Unlike the novel, the film ends with Orlando having a daughter, not a son.\nPotter also adds: Orlando's words and looks to the camera [were] intended as an equivalent both of Virginia Woolf's direct addresses to her readers and to try to convert Virginia Woolf's literary wit into cinematic humor\nThe film's last scene takes place in present-day 1992, just as Woolf's novel ends in its present day of 1928."}