{"mid": "Ouija", "IMDB_id": "tt1204977", "title": "Ouija", "plot": "In the opening scene, two young girls, named Laine and Debbie, are sitting in Laine's room playing with a Ouija board. Debbie tells Laine how to play and how to use the planchette to see any spirits. They say the mantra, \"As friends we gathered, hearts are true; spirits near, we call to you.\" Laine looks through the planchette to spot a spirit, and is frightened when she sees someone, only it's her younger sister Sarah. She yells at Sarah to leave.In the present day, the adult Debbie (Shelley Hennig) is playing with the Ouija board by herself. She appears distressed, and she tosses the board and planchette into the furnace. She then speaks on the phone with the adult Laine (Olivia Cooke). Laine goes over to her house, and Debbie says she is not up to hanging out with her and their friends that night. Debbie mentions playing the Ouija board and feeling odd, though Laine dismisses this as her being a spaz. After Laine leaves, Debbie goes back upstairs and sees the Ouija board and planchette on her bed. She looks through the planchette, and her eyes turn white. Debbie then grabs some Christmas lights and hangs herself.The next morning, Laine is with her boyfriend Trevor (Daren Kagasoff) at a diner. They are met by their waitress friend Isabelle (Bianca A. Santos). Laine gets a text from her dad saying to go home immediately. When she gets there, Laine finds her dad, her grandmother, and Sarah (Ana Coto) gathered to inform her of what happened to Debbie.All of Debbie's loved ones gather for the wake. Laine is too shaken to be there, but she holds it together. Debbie's boyfriend Pete (Douglas Smith) arrives with some flowers. Laine goes into Debbie's room where Debbie's mother finds her. Laine breaks down and hugs her. She asks Laine to housesit for them while they are gone. Laine agrees.Laine discovers the Ouija board that Debbie was playing with. Since she cannot shake the feeling that Debbie's presence is still in the house, she gathers Sarah, Trevor, Pete, and Isabelle to Debbie's house to play with the board. They get together and say the mantra as they put their hands together on the planchette. It starts to move, which everyone thinks is Sarah moving it. The spirit implies that it is Debbie and it spells out \"Hi Friend\" on the board. The friends are freaked out and stop playing.Each friend is followed by the spirit. Trevor encounters it on a bike ride, leading him under a bridge where he sees \"Hi Friend\" written on the wall in chalk. Isabelle sees it spelled out in her car window, along with a hand slamming against it. Pete sees it carved in his desk.Thinking that Debbie is trying to communicate with them, the friends get together to play the board again. They learn that the spirit is not Debbie, but someone that identifies as DZ. Laine looks through the planchette and sees a little girl with stitches on her mouth. The spirit then spells out on the board, \"Run. She's coming.\" Laine asks who is coming, and the spirit spells \"Mother.\" Laine looks through the planchette and sees the girl point to an older female spirit screaming and running in her direction.In her home, Isabelle is flossing her teeth and drawing herself a bath. She then has stitches form on her mouth, and she is levitated in the air. The spirit drops her, leaving her to slam her head against the sink, killing her.Trevor is angry at Laine because she made them play the game, which led to Isabelle's death. Laine investigates Debbie's house and finds some pictures of two little girls and their mother. Trevor looks up on the internet an article on a missing girl from the same address as Debbie's home, as well as the girl's sister being taken into custody after murdering her mother.Laine goes to a mental asylum to meet Paulina Zander (Lin Shaye), the sister of Doris, the girl with the stitches on her mouth. She tells Laine that their mother believed she heard voices and saw spirits that were trying to communicate through Doris, so she sewed her mouth shut. Paulina asks Laine to find Doris's body in the house and to cut the stitches open.Laine finds Doris's corpse in Debbie's home, with her mouth still sewed shut. She cuts the stitches open, bringing Doris's spirit out, along with Mother. Doris lets out a blood-curdling scream and vanquishes Mother's spirit.Just when it seems that everything is over...IT'S NOT. Pete gets killed in his home by Doris's spirit. Laine returns to the asylum to tell Paulina that she did what she told her. Paulina chuckles, and Laine realizes that Mother was not evil, but it was Doris and Paulina that were communicating with spirits, and that their mother was trying to stop them.Laine's grandmother tells Laine and Sarah that the only way to defeat the spirit is the destroy not only the Ouija board, but Doris's corpse.The girls and Trevor go to Debbie's house to finish this. Trevor gets pulled into the pool and is killed by Doris. Sarah finds Doris's corpse and is attacked by her spirit. Laine gets out the Ouija board and beckons Doris to play with her. Doris grabs Laine's arm and almost kills her, until Debbie's spirit shows up to intervene. Sarah brings Doris's corpse and throws it into the furnace. Laine throws the Ouija board and planchette, and Doris's spirit is destroyed.Laine and Sarah return home, relieved that everything is over. Laine flosses her teeth and gets ready for bed, and then finds the planchette on her desk. She picks it up and looks through it one more time."}