{"mid": "OurFriendMartin", "IMDB_id": "tt0248271", "title": "Our Friend, Martin", "plot": "Miles (Robert Ri'chard) is a wisecracking African American boy who is an avid fan of sports, particularly baseball icon Hank Aaron, but is failing at school. His teacher Miss Clark (Susan Sarandon) threatens Miles that she will make him repeat 6th grade should his grades not improve. He and his class, including his friends, two Caucasian boys Randy (Lucas Black) and former bully Kyle (Zachary Leigh) and a Latino girl Maria (Jessica Garcia), visit a museum, dedicated to Martin Luther King, Jr.. Randy and Miles explore Martin's bedroom, and are caught by the museum's curator Mrs. Peck (Whoopi Goldberg), who winds up an old watch. The boys hold Martin's baseball glove and the two are transported back to 1941 and encounter a 12-year-old Martin (Theodore Borders) playing with his friends, Sam and Skip Dale (Adam Wylie), until their mother (Ashley Judd) arrives and reprimands her sons for integrating with the \"coloreds\". Martin explains to Miles and Randy that Mrs. Dale's hatred of black people stems from the fact she regards them as \"different\", but violence would only worsen things.\nThe boys then travel 3 years in time and meet a teenage Martin (Jaleel White) on a segregated train. He explains to them that blacks and whites are unable to integrate and must use separate bathrooms, restaurants, and waiting rooms. They later have dinner with Martin's family and while he goes to do shut in rounds with his father (James Earl Jones), the boys travel forward 11 years and meet Martin (LeVar Burton), who by now is in his 20's and works as a minister at the church. He is holding a meeting about the Montgomery Bus Boycott, set off after Rosa Parks, a black seamstress refused to give up her seat on a bus and was put in prison for it. As a result, no black adults or children will ride the buses. Just then, Turner (Samuel L. Jackson), Martin's friend, alerts him his house has been bombed. He races home, but fortunately his wife Coretta Scott King and newborn daughter Yolanda escape unharmed.\nTurner announces that in retaliation, they will attack the perpetrators with bricks, guns, Molotov cocktails and knives, but Martin stops him, reminding the crowd of Gandhi peacefully standing his ground to exile the British colonies from India and of Jesus teaching love for his enemies. Miles and Randy then travel to the Birmingham riot of 1963 and witness firemen and police officers squirt black protesters with hoses and set German Shepherds on them. The boys are later transported back to the museum and join their class back at school. The following day, Miles and Randy tell Miss Clark about the events prior to Martin's work and later the class watch a VHS tape of Martin's work. After the class leaves, Maria and Kyle decide to investigate for themselves how Miles and Randy got the information. When the boys arrive at the museum, Mrs. Peck lets them stay but warns them that when one messes with the past, this can affect the present.\nMaria and Kyle follow the two boys in and catch them in Martin's bedroom. The four children are then transported to the March on Washington Movement and meets Martin who is in his 30's (Dexter Scott King) and a young Miss Clark, who at this time is a member of the movement and not yet married. When they return, Miles discovers that Martin was murdered. The children travel back to 1941 and bring the 12-year-old Martin back to the present. When they return, only Miles and Martin return together and the present is different. They discover that the museum is now just a burned down house. They also find out Randy and Kyle are also racists and no longer friends with Miles or know him. His middle school is segregated and named after Robert E. Lee, Miss Clark is treated poorly by the principal and Maria works as a maid and can't speak English. He and his mother (Angela Bassett) live in poverty as she now works as a cleaning lady. The next day Miles can't understand what is going on but Martin figures out because he left his own time, it created an alternate timeline where his civil rights work never happened. Miles realizes the error of his ways and must sacrifice his plans to rescue Martin. Miles bids a tearful farewell, but realizes he still has Martin's watch and begs for him to come out of his house. Martin returns to his time, where he is shot and killed at his hotel. This results in the present reverting to normal and Miles is reunited with Randy, Maria, and Kyle. Mrs. Peck knows about Miles time traveling and tells him that while they can't change the past as long as they remember Martin and what he stood for he will always be with them. He receives an A+ on his history test, allowing him to progress to 7th grade. He and his friends then vow to continue Martin's work. At the end of the film, Mrs. Peck closes the door to Martin's bedroom as the credits roll."}