{"mid": "Outbreak", "IMDB_id": "tt0114069", "title": "Outbreak", "plot": "Motaba, a fictional virus which causes a deadly fever, is discovered in the African jungle in 1967. To maintain the virus as a viable biological weapon, two U.S. Army officers, Donald McClintock and William Ford, destroy the camp where it was found after taking blood samples from the dying victims.Twenty-eight years later, in 1995, the virus resurfaces in Zaire. Colonel Sam Daniels, a USAMRIID virologist, is sent to investigate. He and his crew, Lieutenant Colonel Casey Schuler, and new recruit Major Salt gain information about the virus and return to the United States, where Daniels asks his superior, now-Brigadier General William Ford, to put out an alert. Ford knows that the virus is not new, but he tells Daniels it is unlikely to show up. Daniels' ex-wife and former crew-member Roberta Keough, has left USAMRIID to take the lead role of a similar team at the United States Center for Disease Control and Prevention in Atlanta, Georgia and is convinced by Daniels to recommend an alert from the CDC, but her superior balks as well.Meanwhile, we learn that the virus arrived via a host animal, a white-headed capuchin monkey, that was smuggled into the United States. James \"Jimbo\" Scott, an employee at the Bio-Test animal holding facility, bribed a security guard and took the monkey to Cedar Creek, California, to sell on the black market. During the drive, Jimbo is infected with the virus through facial contact with the monkey's saliva.Jimbo unsuccessfully tries to sell the monkey to a crooked pet store owner, Rudy Alvarez Before parting ways, however, the monkey scratches Alvarez and infects him, and shares a banana with another monkey already in the store, infecting that monkey as well. Not able to care for the monkey, Jimbo releases it into the woods. Jimbo starts to show signs of infection while flying to Boston, where he gets off the plane and kisses his girlfriend Alice, infecting her as well just before collapsing. They are both hospitalized. Keough investigates the infections but finds that no one other than Jimbo, his girlfriend or Rudy all three of whom die of hemorrhagic fever in the Boston area was infected.Meanwhile, the technicians at a Cedar Creek hospital run tests on Rudy's blood. But Henry, one of the technicians, accidentally breaks a vial, splattering the contents, infecting and killing him, but not before visiting a movie theater. The virus mutates into a new strain, capable of spreading like flu, and numerous Cedar Creek citizens are exposed to Motaba at the theater. Daniels learns of the infection and flies to Cedar Creek alongside Schuler and Salt, against Ford's orders, joining Keough's team.As Daniels and his team begin a search for the host animal, a state of martial law is declared in Cedar Creek, and the U.S. Army has quarantined the town to contain the outbreak, including preventing an attempt by civilians from breaking quarantine. During their research, Schuler is infected when his suit tears. Keough follows after she accidentally stabs herself with a contaminated needle while collecting samples due to Schuler suddenly convulsing. A mystery serum, E-1101, is introduced to those suffering from Motaba. Daniels soon realizes that the serum is not experimental, but was designed to cure Motaba, and that Ford knew about the virus beforehand. However, the serum does not help the residents of Cedar Creek, who are infected by a mutated strain. Daniels confronts Ford, who admits that he withheld information on the virus due to national security and Motaba's potential to be turned into a biological weapon.Daniels learns from Ford of Operation Clean Sweep, a plan by the military to bomb the town of Cedar Creek, with approval from the President of the United States. Now-Major General Donald McClintock plans to use the bombing to cover up the virus's existence to protect his secret biological weapon project. To prevent Daniels from finding a cure, McClintock has him arrested by implicating Daniels as a viral carrier. This leads Daniels and Salt to search for the host animal to save the town by escaping custody by helicopter. After the animal holding facility who had been aiding Daniels by tracking down how the host animal got into the country learns what happened from the security guard about what Jimbo did, the two are able to track down the ship that carried the host animal and Daniels obtains a picture of Betsy and broadcasts it on the news. Mrs. Jeffries realizes that this is the animal her daughter Kate is playing with in their backyard. She calls the station, and the two men arrive at the family's house, though Colonel Briggs intercepts the call and informs McClintock of Daniels and Salt's location who heads out to intercept them by helicopter. Kate coaxes out Betsy, whom Salt tranquilizes. Learning from Daniels that the host animal is captured, Ford delays the bombing.Flying back, Daniels and Salt are confronted by McClintock who tries to force them to head to their local air force base, only for Daniels to refuse. While McClintock's helicopter chases theirs, Daniels has Salt fire two rockets into the trees to trick McClintock into thinking they crashed so they could escape by flying low enough to avoid being detected by radar. Returning to Cedar Creek, Salt mixes Betsy's antibodies with the E-1101 to create an anti-serum in time to save Keough, but not Schuler, who has already succumbed to the virus. McClintock arrives back at base and has Operation Clean Sweep resumed, refusing to listen to Ford who now wishes to call off the bombing. Daniels discovers this and realizes that McClintock will not call off the bombing. He and Salt take it upon themselves to fly in the way of the bomber, commanded by a pilot with the call sign of Sandman One, to stop it. With support from Ford, Daniels is able to stay in the way of the plane long enough to convince Sandman One and his co-pilot that information was purposely withheld from them and that they can now cure the remaining townsfolk. Heeding Daniels' warnings, Sandman One deliberately detonates the bomb over water instead of the town. Before McClintock can order another bombing, Ford, having had enough of McClintock's single-minded obsession, relieves McClintock of his command and places him under arrest for deliberately withholding information from the President, though while being taken away by Col. Briggs, McClintock promises he'll take Ford down with him. Daniels and Keough reconcile, and the remaining residents of the town are successfully cured."}