{"mid": "OutForJustice", "IMDB_id": "tt0102614", "title": "Out for Justice", "plot": "Gino Felino is an NYPD detective from Brooklyn who has strong ties within his neighborhood. Gino and his partner Bobby Lupo wait to bust up a multimillion-dollar drug deal. However, Gino sees a pimp violently assaulting one of his girls and intervenes. Shortly afterward, Richie Madano murders Bobby in broad daylight in front of his wife, Laurie, and his two children.\nRichie is a crack addict who grew up with Gino and Bobby. He has become psychotic and homicidal due to rage and drug use, and seems not to care about the consequences of his actions. Richie then murders a woman at a traffic stop because she abruptly tells him to move the car. He heads off into Brooklyn alongside his goons, who are horrified by what he does but continue to work alongside him.\nGino knows Richie is not going to leave the neighborhood. Ronnie Donziger, his captain, gives him the clearance for a manhunt and provides him with an shotgun and an unmarked car. Gino visits his mob connection Frankie and his boss Don Vittorio, and he tells them he will not get out of the way of their own plans to take out Richie, whom they view as a loose cannon. While driving, Gino sees a fellow driver discard something moving from his car. Upon investigating, Gino rescues an abandoned German Shepherd puppy.\nGino starts the hunt for Richie at a bar run by Richie's brother Vinnie Madano. Vinnie and his friends all refuse to provide information, so Gino beats up all of them. He still does not find out where Richie is, but his concern about getting an attitude problem has been taken care of. Richie later comes back to the bar and beats up Vinnie for not killing Gino when it was one cop against a bar full of armed men. He also has info leaked to the mob that he is at the bar, then emerges from hiding and ambushes the mob's hitmen in a shoot-out.\nAfter visiting a number of local hangouts and establishments trying to find information, Gino discovers Richie killed Bobby because Bobby was having an affair with two women – Richie's girlfriend, Roxanne Ford, and a waitress named Terry Malloy. When Gino goes to Roxanne's home, he finds she is dead. Gino believes that Richie killed Roxanne before he killed Bobby. Gino goes to Laurie's house and tells the widow what is going on. In Laurie's purse, Gino finds the picture that Richie dropped on Bobby's body after killing him. It turns out that Bobby was a corrupt cop who had wanted a money-making lifestyle like Richie's, and Laurie knew Bobby was corrupt. Laurie had found a picture of Bobby and Roxanne having sex. She had given Richie the picture out of jealousy, never expecting Richie to kill Bobby for sleeping with Roxanne. Laurie took the picture away from where Richie dropped it on Bobby because she wanted to protect her husband's reputation.\nGino attempts to get Richie out of hiding by arresting his sister Pattie and by talking to his estranged, elderly father. Following a tip from his local snitch Picolino, Gino eventually finds Richie in a house in the old neighborhood having a party. Gino kills or wounds all of Richie's men. Gino then finds Richie and fights him hand-to-hand. After beating Richie senseless, Gino finally kills him by stabbing him in the forehead with a corkscrew. The mobsters arrive soon after, also intent on killing Richie. Gino uses the lead mobster's gun to shoot the already-dead Richie several times, then tells him to return to his boss and take credit for Richie's death.\nGino and his wife adopt the puppy as a family pet, naming him Coraggio (Italian for courage or bravery). Whilst out walking, they encounter the same man who abandoned the puppy earlier, and Gino confronts him. When the man attacks him, Gino defends himself, knocking the man down. Gino and his wife laugh as the puppy urinates on the man's head."}