{"mid": "Outlander", "IMDB_id": "tt3006802", "title": "Outlander", "plot": "Flashback: Claire and Frank are happily strolling down a London street. Suddenly, Frank stops in the middle of the road and, with a smile, asks Claire if she is ready. Puzzled, Claire wonders what she should be ready for, and turns as Frank nods toward the City of Westminsters Registry Office, where a newly married couple are standing on the steps posing for newlywed photos. Claire is astonished. \"Now? What about your parents? Theyre waiting at the restaurant!\" Frank persuades her with little trouble, and finally asks \"Will you marry me?\" \"Of course,\" says Claire, kissing him . . .\"You may kiss your bride . . .\" intones a Scottish voice, and suddenly, Claire is tentatively kissing Jamie at the end of a candlelit wedding ceremony.Later, she is sitting in their room in the inn, with most of her wedding finery discarded, and musing over how different this wedding was from her wedding to Frank and how at some point, one chooses to move forward with their life. Jamie enters the room, and as the door opens, the sounds of merriment can be heard below. Claire notes that the wedding party is still going strong, and Jamie hesitantly observes that \"they will keep it up, until we make it . . . official.\" Claire looks down, and mutters that its a wonder that they arent watching. \"Only Rupert and Angus,\" observes Jamie, and at Claires startled glance, he tells her that it was \"just a wee joke.\" \"You're a regular Bob Hope,\" she sighs.\"Was he a funny man?\" Jamie looks about, at a loss, and Claire suddenly suggests a drink. Jamie offers a gallant toast: \"To a lady of grace, a woman of strength, and a bride of astonishing beauty -- my wife, Claire Fraser.\" Jamie sips his drink, but Claire downs her in a single gulp, earning a raised eyebrow and a refill. She tosses back the second glass, ignoring Jamies raised glass, and obligingly, he pours yet another glass. After her third glass, he realizes that she is drinking from nervousness, and reassures her that he has no intention of forcing himself on her. She has questions, and first and foremost, she wants to know why he agreed to marry her. \"I didnt have much of a choice . . . but you!\" \"I dinna have much of a choice, either,\" admits Jamie.Flashback to the day before: In the stable, Dougal and Ned are explaining to Jamie and Murtagh that Claire needs to be married to a Scottish husband to become a Scottish citizen and to therefore avoid being harshly questioned by Black Jack Randall. Ned is very clear the marriage must be consummated, either with actual witnesses or at least witnesses in the same building. Jamie is taken aback, and demands to know if Claire is aware of the particulars. Dougal shrugs off the question, indicating that Claire doesnt have a choice. Murtagh looks questioningly at Dougal and observes that he didn't think that Dougal believed in rape. \"Not rape . . . persuasion,\" purrs Dougal, but then Dougal warns Jamie that the marriage must be consummated, with no secret agreements where they say they have, but they havent. Dougal goes on to say that it shouldnt be difficult, and that with Claire's figure, he wouldnt mind having sex with her himself. Jamie angrily tells Dougal that if Claire is to become his wife, then he would thank Dougal to stop talking about her like she was a common whore. Dougal reminds him that Claire has already bravely taken a few blows from Randall, but asks him to consider what Randall may do to her if he gets his hands on her again. Jamie turns away, considering . . . Claire smiles at Jamie. \"So, you married me to keep me safe?\" she asks him, and he agrees, with a small smile. Then seriously, he tells her that she has his name, his clan, his family and, if necessary, the protection of his body, as well. Claire comes to sit next to him on the bed, gazing at him consideringly, and holding his hand gently. Jamie gently leans in for a kiss, but nervously, Claire forestalls him, stammering, \"Tell me about your family!\" He stops and chuckles. \"How many generations back?\" he asks wryly. Relaxing, Jamie begins to tell her about his mother and father, and how they eloped and were married. They spend the next several hours drinking, talking and getting to know each other for the first time. Jamie charms her with his storytelling. Suddenly, the door bursts open, and Angus and Rupert are in the doorway, sent by Dougal to see if they have consummated their marriage, yet. Angus declares that they havent, \"they still have their clothes on!\" he exclaims as Jamie shoos them out the door. Claire giggles nervously at Jamie's return, and there is a moment of silence as they both consider the next step. Taking a deep breath, Claire suggests that it is getting late, and perhaps they should go to bed. \"To bed . . . or to sleep?\" inquires Jamie carefully. \"Wellll . . . .\" Claire says consideringly, smiling at Jamie. Jamie offers to help her take her corsets off, and begins to unlace her. Quickly, the many layers are discarded, leaving Claire in her shift as Jamie gently caresses her. \"My turn,\" she whispers, reaching for his kilt. They begin to kiss passionately, and she draws back, surprised. \"Where did you learn to kiss like that?\" she asks. \"I said I was a virgin, not a monk,\" he tells her. \"If I need guidance, Ill ask . . .\" He turns her around so that her back is to him and begins to fondle her. She turns to face him, and they collapse onto the bed, not bothering to finish undressing. In his eagerness, he does not realize that he is crushing her, and she whispers, urging him to a slightly different position. In a moment, its over, leaving them both gasping for breath. As they lay back, catching their breath, they exchange tentative smiles, and Claire asks him, curiously, if it was like he thought it would be. \"Almost,\" he admits.\"I thought . . . \" he breaks off, embarrassed, and Claire encourages him to tell her what he had imagined, promising not to laugh. He tells her that he didnt realize it was done face-to-face. \"I thought it was done the back way . . . like horses!\" Claire cannot contain her giggles, and even Jamie starts to laugh. He asks her if she liked it. She lowers her eyes, not answering immediately. A disappointed look crosses Jamies face, and he murmurs \"Murtagh was right about that, then.\" Confused, Claire asks, \"Murtagh?\" Jamie tells her that Murtagh told him \"that women generally do not care for it. He . . . and Rupert. And Ned. They had a lot of advice on the subject last night,\" he shrugs, and glumly sits on the edge of the bed. After a moment, Claire sits up and tells him, softly, \"I did like it, Jamie.\"Crossing the room, she is suddenly struck by the fact that she is both a bigamist and an adulteress. Shaking the thought from her head, she declares she is going down to fetch some food. Jamie tries to stop her, but she steps through the door in only her shift, forgetting the crowd downstairs. As she appears at the top of the stairs, she is taken aback by the raucous cheers and greetings of the McKenzie clansmen, who have been celebrating Jamies marriage with enthusiasm. Suddenly realizing her state of undress, she quickly retreats back to the room, leaving Jamie to good-naturedly bear the brunt of the clansmens lewd comments as he gathers some food and wine to take back to the room.As Jamie starts back upstairs, he hears Dougal voice, softly, under the laughter of the other men: \"Ye didnt thank me,\" reminding Jamie that he was the one that has provided Jamie with a bride. Jamie considers him for a moment and then tells him, \"Thank you -- truly.\" Dougal warns him that he shouldnt be too eager to run back to his bride, because, as Jamie tells Claire later, it gives her too much power over him. As Claire and Jamie eat together, he tells her what Dougal has said, and she asks him what his response was. \"I told him I was completely under your power and happy to be there,\" he replies. He brings more whiskey, and as he tops up her glass, he reaches out with his other hand to gently touch her hair. Involuntarily, she flinches and he moves away, disappointed. She catches herself and smiles at him, and he returns, leaning on the back of her char and contemplating her hair. \"Mo nighean donn,\" he murmurs, and when she asks what he means, he tells her it means \"my brown hair lass.\" She dismisses her hair color as dull, but Jamie thinks it beautiful. Tentatively, he caresses her bare shoulder, but she self-consciously pulls up her shawl and, searching for another topic of conversation, sees his kilt crumpled on the floor and notes that he had a new kilt for the occasion. \"Those are Fraser colors,\" he explains.Flashback to the previous day: Murtagh presents Jamie with a kilt with the Fraser colors, and when Jamie asks where he found it, Murtagh tells him that it belonged to the widow of a Fraser who lived about five miles away. He tells Jamie that the widows wants the kilt back, and grumbles that he almost didnt bring it anyway, as there are so many Redcoats in the village. Jamie says he knows, thats why hes not collecting his own wedding clothes, but Murtagh is skeptical and worried: \"What do you think will happen, when you prance out of here with red hair, your size and wearing Fraser colors? You may as well paint a target on your back.\" Jamie tells him that he only plans to get married once, and he wants to do so in a way that would make his mother proud. Murtagh shakes his head ruefully. Jamie asks him what he thinks of Claire, and Murtagh tells him that she'll do. When Jamie asks if his mother would approve, Murtagh is gruff, but then asks if Jamie still has the broach. As Murtagh runs his finger over the broach, he tells Jamie that his mother had a sweet smile, and that Claires smile was just as sweet.Claire is surprised by Jamies story about Murtagh, and Jamie then goes on to describe his negotiations with Dougal over the wedding . . .Flashback to the previous day: Jamie has three demands before he marries Claire. Dougal is impatient, declaring that it would be easier just to kill them both. Jamie is adamant: First, that they be wed properly, in a church, before a priest . . .Dougal and one of the McKenzies rustle up a priest, a rather sickly specimen of a man, and drags him to the cold, tumble-down church. The priest nevertheless refuses to marry Jamie and Claire without the banns being read. Exasperated, they pull a sword on the priest and threaten him, but he has a small knife of his own, and isn't afraid to use it. When they point out that he is outnumbered, he cannily observes that he is the only priest, so they can't kill him if they want a marriage ceremony. The priest goes on to protest that he must follow the law of reading the banns. Dougal almost explodes, but the MacKenzie clansman with him stops him, and begins to reason with the priest, and they enter into a spirited argument of doctrine, law and Biblical intent. After a few exchanges, Dougal, impatient, finally threatens to kill the priest, and the priest admits that he would rather die in hell, because it would be warmer than the miserable cold of that church. Dougal strikes a bargain: If the priest performs the ceremony the next day, he will provide windows for the church . . . Jamie finishes the story for Claire: \"And Dougal said the wee man didnt skip a beat before asking what time he wanted the ceremony.\" They laugh, and as she offers him a tidbit of food, he takes the food away and tenderly kisses her wrist. \"What were your other conditions?\"Flashback to the previous day: Rupert and Angus have been tasked with obtaining a wedding ring. They locate the village blacksmith, who also fashions jewelry, and strike a bargain with him to make a ring out of a key that Jamie has given them. The blacksmith agrees, saying that it will be ready next week, but Angus demands that the key be ready that day. \"It'll cost ye,\" the blacksmith says, and Rupert pays up. Claire admires her ring, but asks Jamie, \"The key to what?\" Jamie shrugs and says that it was just something that he had in his sporran. \"What was your third condition?\" she asks, and he turns and smiles broadly at her. \"I left that to Ned,\" he laughs.Flashback to the previous day: Ned has been tasked with obtaining a wedding dress. He visits the village brothel, thinking that the women may have a pretty dress he can buy or borrow. The residents are delighted to see him, and parade various frocks for him to choose from, as well as merrily offering their own services. The madam shoos them away, and tells Ned that she had had a client who had a dress made for his wife, but then was short of money to pay for his services at the brothel, and paid with the dress instead. She notes that it hasnt been worn before, which makes it a perfect dress for a bride. Ned pulls out his purse to pay for the dress, and the girls, excited by the sight of so much money, immediately throw themselves on him. The madam suggests that they could offer him some entertainment while she sees to having the dress wrapped up for him, and he eagerly agrees.Claire laughs outloud and accuses Jamie of making things up, but he tells him that Ned related the story himself, blushing all the while. \"He even brought the strumpet to the wedding, did you not see her?\" Claire is surprised, but admits that she didnt really pay attention. Jamie then asks her what she had been up to all day. She laughs self-consciously, and then holds up the bottle of whiskey suggestively.Flashback to earlier in the day: Murtagh throws back the covers of the bed, revealing a disheveled Claire, who had drunk herself into oblivion the night before at the prospect of marriage. The innkeepers wife is disapproving of Claire's obviously hangover. Jamie asks if she remembers anything about her wedding, and she assures him that she does, but also ruefully admits that she had a monstrous hangover. He tells her that he remembers every moment, every second . . .Jamie comes out of the church, dressed in a fine kilt and coat, to meet Claire in the churchyard, surrounded by admiring MacKenzies and curious villagers. She stands very still, and the innkeeper's wife, acting as her maid, removes her cloak, revealing Claire in a stunningly beautiful dress of richly embroidered pale grey and mossy green. \"It was as if the sun came out,\" he tells her of his first sight of her. He bows low to her and whispers, \"your servant, madam.\" In a moment of panic, Claire blurts out, \"I cant marry you, I dont even know your name!\" Jamie smiles, and introduces himself, slowly emphasizing each name:\"It's Fraser -- James Alexander Malcolm MacKenzie Fraser.\" She stares at him for a moment, and then puts her hand out for a handshake. \"Claire Elizabeth Beauchamp,\" she responds politely. He takes her hand and holds it gently, and as they exchange a gaze, Dougal gruffly breaks in, with the suggestion that \"if you two are finished, let's get on with it\". Claire turns to enter the church, suddenly glancing down at her hand to see Franks wedding ring. Slowly, she draws it off, and slips it down the tight bodice of her dress. They exchange their vows in the candlelit church Jamie gazing intently at Claire as he repeats his, and Claire, not meeting his eyes, but looking down at their clasped hands, repeating hers. After the ring is blessed, Jamie slips it on her right ring finger, and she stares at him. Suddenly, Dougal draws his knife, and to Claire's shock, Jamie holds out his arm, wrist up and Dougals sword makes a cut across Jamie's wrist. Before she can make sense out of what is happening, he grasps her wrist and cuts it, too, and Jamie places their cut wrists together. As the blood mingles, Dougal ties their wrists together, and Jamie tells her to repeat the Gaelic words after him, which she does slowly and unsteadily. Afterwards, they kiss a lingering kiss, which sparks a look of hope on Jamies face. He tells her that the wrist binding is an old Gaelic custom, and the worlds mean \"Blood of my blood, bone of my bone . . .\" and then says, hesitantly, that the way she kissed him, he thought that maybe she didnt mind so much having to marry him. With a slight smile, she lightly runs her fingers along his shirt-clad arm. Rising, she tells him to stand up, and take off his shirt. \"I want to look at you,\" she says softly. Holding her gaze, he removes his shirt, and slowly Claire circles him, allowing her fingers to brush against him in a lingering, admiring exploration. \"Fair's fair -- take off yours as well,\" he says, his voice low. She steps away and removes her shift. Jamie stands, staring, and she asks lightly if he has never seen a naked woman before. \"Aye, but not one so close -- and not one that's mine.\" A spark is lit, and their embrace quickly becomes passionate. As she reaches a climax, Jamie is surprised, and asked if that happens every time. \"Only if the man is a very good lover,\" she tells him breathlessly, and she begins to play the aggressor, teaching him, to his delight, the pleasures of a woman who takes an active part in making love. Gasping at the end, he tells her that he thought his heart was going to burst . . .As Jamie falls asleep, Claire rises, and seeing that there is no more whiskey, she wraps herself in Jamie's plaid and ventures downstairs to the darkened tavern, finally quiet for the evening. As she gathers some food and more drink, Dougal enters the room, and tells her that he has been to visit Captain Randall, to tell him the news of her marriage. \"What did he say?\" she asks him, curious, and Dougal comments that there's probably even a limit to her tolerance for bad language. He tells her that Randall has \"more important things to worry about than chasing after one stray Sassenach, no matter how pretty,\" and that he knows better than to kidnap Colums nephews wife. As she smiles in relief and turns back, he stops her and tells her that he \"commends her for doing her duty, but it shouldnt stop her from sampling . . . other . . . pleasures,\" caressing her chin and lips suggestively. \"I find you to be a most singular woman, Claire.\" She frowns, and reminds him that she is Jamies wife. She stares at him, aghast, and they are interrupted by Rupert, who comes into the room. Claire takes the opportunity to leave, but before she leaves, she thanks Rupert for his efforts for her that day, \"the ring is magnificent!\" Rupert, beaming, tells her that she is welcome, and offers her congratulations on her wedding day. She thanks him, and returns to their room, and Rupert observes to Dougal in a low voice and a nod after Claire that \"Young Jamie may not have much experience, but that one looks well ridden!\" Dougals fist suddenly slams into Dougals face. \"Ooof! What did you do that for?!\" complains Rupert, and Dougal tersely tells him to look after the horses. When Rupert tells him that he already has, Dougal tells him to do it again. Claire observes the byplay from the shadows of the stairs, and leaves Dougal alone, drinking in the darkened inn.Back in their room, Claire sits at a table, staring into the fire as Jamie sleeps. He awakens, and seeing her sitting there before the fire, he quietly rises from the bed and pulls something from his sporran. Coming up behind Claire, he drops a single rope of pearls around her neck, startling her. \"They're Scotch pearls,\" he explains. \"They belonged to my mother, and now they belong to my wife.\" As Claire examines them, he tells her that the necklace is one of the few things he has to remind him of his mother, \"and they are very precious to me -- as are you, Claire,\" he tells her softly. Wearing nothing but the pearls, she reaches over to kiss him, sits astride him and they make love.The next morning, Jamie is in a cheerful mood, quickly getting dressed and declaring that he is so hungry that he could take a bite out of her. \"I think you've already done that!\" she teases him, stretching languorously. He grins quickly and with a leer, tells her that he looks forward to doing it again, too. Claire laughs, and as Jamie leaves, she begins to straighten up their room. Fetching her wedding dress from the floor, she gently shakes it out and is surprised when her wedding ring with Frank falls out of the bodice and rolls across the floor, lodging in a crack in the floorboards. Carefully, she plucks it up, and slides it on her left ring finger. Sinking to the floor, she holds up both hands, gazing at both rings."}