{"mid": "OutOfAfrica", "IMDB_id": "tt0089755", "title": "Out of Africa", "plot": "The story begins in 1913 in Denmark, when Karen Dinesen (a wealthy but unmarried woman) asks her friend Baron Bror Blixen (Klaus Maria Brandauer) to enter into a marriage of convenience with her. Although Bror is a member of the aristocracy, he is no longer financially secure; therefore, he agrees to the marriage, and the two of them plan to move to Africa to begin a dairy farm.\nUpon moving to British East Africa, Karen marries Bror in a brief ceremony, thus becoming Baroness Blixen. She meets and befriends various other colonial residents of the country, most of whom are British. She also meets Denys Finch Hatton (Robert Redford), a local big-game hunter with whom she develops a close friendship. However, things turn out differently from her expectations, since Bror has used her money to purchase a coffee plantation rather than a dairy farm. He also shows little inclination to put any real work into it, preferring instead to become a game hunter. Although theirs was a marriage of convenience, Karen does eventually develop feelings for Bror, but she is distressed when she learns of his extramarital affairs. To make matters worse, Karen contracts syphilis from her philandering husband (at the time, cures were uncertain) and is forced to return to Denmark for a long and difficult period of treatment using the then-new medicine Salvarsan. Bror agrees to look after the plantation in her absence.\nAfter she has recovered and returns to Africa, the First World War is drawing to an end. However, it becomes clear that her marriage to the womanizing Bror has not changed, and she eventually asks him to move out of their house. No longer able to have children of her own due to the effects of the syphilis, she decides to open a school to teach reading, writing, arithmetic, and also some European customs to the African tribal children of the area. However, her coffee plantation runs into financial difficulties, and she is forced to rely on bank loans to make ends meet. Her friendship with Denys Finch Hatton develops further.\nDespite her expectation and desire to have what begins as an affair turn into a lasting relationship, Karen realizes that Denys is as impossible to domesticate as the wild animals he hunts and often refers to. Although he moves into Karen's house, he criticises her desire to \"own\" things; this implies even people. He refuses to commit to marriage or give up his free lifestyle and tells her that he will not love her more just because of a \"piece of paper\". Karen grudgingly continues in the relationship, knowing it will not ever be official. He decides to invite Felicity, a female mutual acquaintance on one of his safaris, which exceeds Karen's ability to tolerate his justifications for his lifestyle and behaviour. Karen asks him to accede to her request to not take her along, and he refuses. She asks him to move out. The plantation finally yields a good harvest at long last, but a devastating fire breaks out in the processing shed, and the crops and all of the factory equipment are destroyed.\nNow financially broke, and her relationship with Denys over, Karen prepares to leave Africa to return home to Denmark, just as British East Africa is becoming Kenya Colony. She arranges to sell everything that she owns and empties the house of all her luxurious items for a rummage sale. In the now empty house, Denys visits her that night, and the two of them enjoy a drink and a dance. He asks her if he might escort her to Mombasa in his biplane to begin her journey home. She agrees and he promises to return after a few days. However, Denys never returns, and Karen is told that his plane has crashed and that he has been killed. Her loss now complete, Karen attends his funeral in the Ngong Hills. With Denys gone, Karen's head servant, Farah, takes her to the railway station, for the train to Mombasa.\nKaren later became an author and a storyteller, writing about her experiences and letters in Africa, though she never returned there."}