{"mid": "OutOfThePast", "IMDB_id": "tt0039689", "title": "Out of the Past", "plot": "Joe Stefanos arrives in a small town of Bridgeport, California, in search of Jeff Bailey. Jeff, owner of the town's gas station, is on a picnic with wholesome local girl Ann Miller. Stefanos sends Jeff's deaf young employee, The Kid, to retrieve Jeff. Stefanos informs Jeff that Whit Sterling wants to see him. Though Ann trusts Jeff implicitly, her parents are wary of him, as is Jim, a local police officer who has been sweet on Ann since childhood. Jeff reluctantly agrees to meet with Whit, and Ann joins him to drive through the night to Whit's home on Lake Tahoe. On the way, Jeff tells Ann of his past (in flashback).\nJeff Bailey's real name is Jeff Markham. He and partner Jack Fisher were private investigators in New York. Jeff had been hired by shady businessman Whit to find his girlfriend, Kathie Moffat. Whit claimed she shot him and stole $40,000 from him. Jeff is reluctant, sensing that finding Kathie will result in her death. Whit assures Jeff he just wants her back, and will not harm her.\nKathie's maid tells Jeff that she's gone to Florida, but Jeff guesses Mexico because of the particular inoculations Kathie received. He goes to Acapulco and waits, eventually striking up an acquaintance with her. A love affair develops, and Jeff ultimately reveals that he had been sent by Whit. Kathie sensed this from the start and has been spinning a web for him. She denies taking Whit’s money and pleads with Jeff to run away with her.\nPreparing to leave, Jeff is surprised by the arrival of Whit and Stefanos, checking up on his lack of progress. Jeff asks to be taken off the case, but Whit refuses. Jeff lies that Kathie slipped past him and is on a steamer going south. Whit instructs Jeff to keep looking for her—instead, Jeff takes her north to San Francisco.\nThey live in San Francisco as inconspicuously as possible, but an outing to the horse races goes bad when they are spotted by Jeff’s old partner, Fisher. Jeff and Kathie split up, with Jeff making himself conspicuous in moving to Los Angeles. Jeff seems to give Fisher the slip and eventually rejoins Kathie at a rural cabin, only to find that Fisher had actually followed Kathie. When Fisher demands money to keep quiet, the two men brawl. Kathie suddenly shoots Fisher dead and flees without Jeff. He finds her bank book, revealing a deposit of $40,000, the money she had denied taking from Whit.\nBack to the present, Ann drops Jeff off at Whit's palatial estate. Jeff is surprised when Kathie reappears. She had returned to Whit and told the whole story. Whit tells Jeff that doing one last job is the only way to make things right between them. Whit's lawyer, Leonard Eels, has helped Whit dodge all taxes, but now wants $200,000 ($2,145,000 today) or he will give Whit's business records to the taxman, which would put Whit in prison. Whit wants Jeff to recover the records, but Jeff realizes that he is being set up. In San Francisco, he meets Eels' secretary, Meta Carson, who is secretly conspiring with Whit. He is introduced by her to Eels, leaving his fingerprints on a glass. Jeff returns and finds Eels dead. He hides the body and retrieves the business records, but is told by the devious Kathie (who has impersonated Meta Carson) that she gave Whit a signed affidavit swearing that Jeff killed Fisher, setting up Jeff to be a double murderer—reported as such in the morning papers.\nJeff returns to the Bridgeport area. Unbeknownst to Whit, Kathie has ordered Stefanos to trail The Kid so he can find and kill Jeff. The Kid drives to a steep, narrow, canyon where Jeff is hiding. The Kid spots Stefanos taking aim at Jeff and quickly hooks him with a fishing line, causing Stefanos to lose his balance and fall to his death.\nJeff goes back to Whit's mansion, telling him of Kathie's double cross and the death of Stefanos. He offers that the death of Stefanos, Eels' actual murderer, can be made to look like a guilt-ridden suicide, removing Jeff from that frame up. Furthermore, he will return the business records to Whit if he destroys Kathie's affidavit and hands her to the police for Fisher's death. Whit takes the offer, and Jeff believes he has worked his way out of the trap.\nJeff makes a quick visit to Ann, returning to Tahoe to discover that Kathie has killed Whit. She gives Jeff the choice of running away with her and a satchel of Whit's money, or taking the blame for all three murders. He agrees to go with her, but phones the state police while she is upstairs packing. Driving up to a police roadblock, Kathie realizes that Jeff has betrayed her and shoots him dead. She then fires at the police, who fatally shoot her.\nWhen the news reaches Bridgeport, Jim offers to take Ann away. Ann asks the Kid if Jeff had been planning to run away with Kathie. Wanting to free Ann, The Kid lies and nods his head. Ann returns to Jim and she drives off with him."}