{"mid": "OutpostBlackSun", "IMDB_id": "tt1418712", "title": "Outpost: Black Sun", "plot": "Beginning immediately after the events of the first film, Nazi-hunter Lena (Catherine Steadman) is on the trail of a notorious war-criminal scientist, Klausener, who at the close of World War II had begun trials of a frightening new technology that can create an immortal army. While interrogating Neurath, one of Klausener's old Nazi colleagues, he dies from a heart attack. She searches his body and finds a map of Eastern Europe and documents relating to Hunt, the man from the first movie who was hired to locate an abandoned SS bunker that was the Site of Klausener's experiments. This indicates that Neurath and Klausener were the ones who hired Hunt, as well as the fact that the second mercenary team sent in to check out the bunker by Klausener report to him that they can find \"no trace of your operative or his team\", obviously referring to Hunt, D.C and the other mercenaries. Lena's search for Hunt, whom she believes can take her to Klausener, leads her to a war zone in Eastern Europe (although the exact location is never mentioned, maps clearly show former Yugoslavia). There she runs into an acquaintance, a physicist, Wallace (Richard Coyle). He informs her that Hunt and his mercenary bodyguards went to find the bunker and never returned. He encourages her to stop her search because he knows what is coming and she refuses. So, pooling resources, they end up helping a professional military unit they meet take on the advancing army, the product of Klausener's experiments, a battalion of zombie Nazi Storm Troopers. Their leader, Brigadefuhrer Gotz, also known as the 'breather' and another of Klausener's old SS associates, has attached Hunt to the large generator that controls the undead soldiers. Using Hunt, Gotz has managed to increase the range of the electro-magnetic field emitted by the generator. This has enabled him and his soldiers to travel beyond the bunker and massacre scores of people. Lena, Wallace, and the unit aim to shut down the source of the evil army and prevent a Fourth Reich."}