{"mid": "Outpost", "IMDB_id": "tt0892899", "title": "Outpost", "plot": "In a seedy bar in a town ravaged by war, scientist and businessman Hunt (Julian Wadham) hires former Royal Marine turned mercenary D.C. (Ray Stevenson) to assemble a crack team of ex-soldiers – Prior (Richard Brake), Jordan (Paul Blair), Cotter (Enoch Frost), Voytech (Julian Rivett), McKay (Michael Smiley) and Taktarov (Brett Fancy) – to protect him on a dangerous journey into no-man's land. Their mission is to scope out an old military bunker in Eastern Europe.\nOnce at the outpost, the men make a horrific discovery that changes the dynamics of the entire mission: the scene of a bloody and gruesome series of occultistic Nazi experiments, carried out by the SS during World War II, using reality shifting and reanimation to create invincible soldiers. Amidst the carnage, they find a survivor, Götz (Johnny Meres).\nAt night, the clearing around the bunker is suddenly lit, and silhouettes of people are seen against the light. Soon after, Taktarov is gruesomely killed by an unseen foe. Later the same night Voyteche is killed by two Nazis. The next morning, Voyteche and Taktarov's dead bodies are found joined at the head, with Taktarov's skull containing a spent round. D.C. demands answers regarding the assignment from Hunt: an unnamed corporation wanted Hunt to find and recover a large generator-like device responsible for the SS's reality-shifting experiments. D.C. orders Cotter to retrieve Hunt from the generator room. While trying to convince Hunt to leave, Cotter is killed by an SS soldier with a pickaxe. It is revealed that Götz is actually a surviving SS brigadier general – a \"breather.\" When Prior kills Götz, the \"breather\" comes back to life and MacKay is killed. The mercenaries and Hunt attempt to evacuate the outpost, only to be slaughtered by the undead German army.\nA second corporate team arrives 72 hours later to carry out the same assignment, only to find a \"breather\" among the piles of naked corpses. The clearing is lit again, revealing the illuminated soldiers surrounding the bunker. In the distance stands the brigadier general, who gives the SS soldiers a nod, and they begin their assault on the team."}