{"mid": "Outsourced", "IMDB_id": "tt0425326", "title": "Outsourced", "plot": "Todd Anderson (Josh Hamilton) has to travel to India when his department is outsourced. Todd is not happy but when his boss Dave informs him that quitting would mean losing his stock options, he goes to train his Indian replacement Puro (Asif Basra).\nWhen he arrives, Todd is frustrated with everything in the country where people call him \"Mr. Toad\". He has difficulty making the call center employees of Gharapuri understand what their American customers expect. He feels that he is never going to get the Minutes-per-Incident (MPI) under six minutes and so will never get to return to the USA.\nTodd experiences the festival of Holi and with it, a sense of calm. At the call center the MPI slowly improves. He recognizes a leader in an employee Asha (Ayesha Dharker) and offers her the job of assisting Puro when Todd leaves. Todd tries to improve the workplace experience for the employees; when they tell him they would like some of the products they are selling, he decides to implement a rewards program and asks Dave for a shipment. Dave initially refuses, but when Todd manages to convince him that he is opening the products to a market of a billion people, Dave agrees to ship them overnight.\nAsha realizes that the shipment has gone to another Gharapuri, an island. They both reach the island and get the shipment, but the boat that was supposed to ferry them back catches fire. With no resort, they check into a hotel, where Asha accuses Todd of being frivolous with Kali. They argue but end up having sex. Upon their return Asha informs Todd that she has been engaged to a family friend named Ashok since she was four years old. She says their affair could be only a \"Holiday in Goa\", a term for a short time spent with a lover before marrying another. Todd is confused but accepts the situation.\nOne day, a laundry man invites him to his home for lunch and gives him a rice flour cake.\nThe call center MPI is at six when Dave calls to let Todd know that he needs to be picked up from the railway station. When Dave arrives, the power shuts down due to flooding, but the employees manage to set up their workstations on the roof and resume business. Dave is impressed, but when the employees go to the local bar to celebrate, Dave informs Todd the business is being shifted to China.\nTodd informs the employees they have been fired, and Dave is erasing all data off their hard disks. Asha tells Todd that she has been writing a novel on her work computer called Holiday in Goa that needs to be saved. Todd gets the hint and they leave for Gaurav's (another employee's) house, where they spend time together. Todd refuses to go to China but suggests Puro as a replacement. Puro is seen leaving for China with his new wife.\nUpon his return to the USA, Todd receives a phone call from Asha just as the screen turns black and the end credits roll."}