{"mid": "Paperman", "IMDB_id": "tt2388725", "title": "Paperman", "plot": "A young accountant named George is standing on an elevated train platform in 1940s New York City, holding a folder, when he is hit by a flying piece of paper. The paper is chased by a young woman named Meg who lost it to a gust of wind from a passing train. The same thing happens to George when a subsequent gust of wind from another incoming train dislodges one of the papers from his folder and blows it into Meg's face, leaving a lipstick-smudged kiss imprinted on the paper, much to her amusement when George retrieves it. He is entranced by the lipstick mark and Meg's beauty, and therefore misses her boarding the departing train. The two exchange looks as she departs.\nGeorge arrives at work, despondent, gazing at the lipstick-marked paper on his desk. He looks out the window and is surprised to find Meg in the building across the street, working in an office with an open window. After failing to get her attention by waving his arms, George begins folding airplanes from a stack of papers on his desk, throwing them out the window one by one in an attempt to get her to notice him. Unfortunately, his efforts are met with varying levels of failure, as well as disparaging looks from his boss. In desperation, having used all of the paper on his desk to no success, he uses the lipstick-marked paper, although this fails as well when a gust of wind tugs it from his hands. Meg then leaves the office, and George, rebuffing his boss, dashes from his desk. Rushing across a street of busy traffic, he fails to see which way she went, and only finds the final lipstick-marked paper airplane. Angered, he throws it hard and it soars into the sky.\nIt turns out many of the paper airplanes have collected in a nearby alley, and when the lipstick-marked paper airplane lands among them, they begin to stir and fly from the ground, seeming to come alive, and set off in pursuit of George. A cloud of paper airplanes forces him toward a nearby train station and onto a train, much to his confusion. Meanwhile, the lipstick-marked paper airplane sets off in pursuit of Meg, finding her at a flower stand. Recognizing the lipstick-marked paper, she chases the airplane to another train station and aboard a different train. They're finally brought together when both of their trains stop at the same station; George still covered in paper airplanes and Meg holding his lipstick-marked paper airplane. As the credits roll, they are seen chatting happily with each other at a restaurant table with the lipstick marked paper between them."}