{"mid": "Paprika", "IMDB_id": "tt0098063", "title": "Paprika", "plot": "In the near future, a revolutionary new psychotherapy treatment called dream therapy has been invented. A device called the \"DC Mini\" allows the user to view people's dreams. The head of the team working on this treatment, Doctor Atsuko Chiba, begins using the machine illegally to help psychiatric patients outside the research facility, using her alter-ego \"Paprika\", a sentient persona that she assumes in the dream world.\nPaprika counsels Detective Toshimi Konakawa, who is plagued by a recurring dream. Its incompleteness is a great source of anxiety for him. At the end of the session, she gives Konakawa a card with a name of a website on it. This type of counselling session is not officially sanctioned, so Chiba, her associates and Konakawa must be cautious that word does not leak out regarding the nature of the DC Mini and the existence of Paprika. Chiba's closest ally is Doctor Kōsaku Tokita, a genius man-child and the inventor of the DC Mini. Because they are unfinished, the DC Minis lack access restrictions, allowing anyone to enter another person's dreams, which poses grave consequences when they are stolen. Almost immediately, the chief of the department, Doctor Toratarō Shima, goes on a nonsensical tirade and jumps through a window, nearly killing himself.\nUpon examining Shima's dream, consisting of a lively parade of objects, Tokita recognizes his assistant, Kei Himuro, which confirms their suspicion that the theft was an inside job. After two other scientists fall victim to the DC Mini, the chairman of the company, who was against the project to begin with, bans the use of the device completely. This fails to hinder the crazed parade, which manages to claim Tokita, who went inside Himuro's dream trying to find answers and intruded into Konakawa's dream. Paprika and Shima take matters into their own hands and find that Himuro is only an empty shell. The real culprit is the chairman, with the help of Doctor Morio Osanai, who believes that he must protect dreams from mankind's influence through dream therapy. Paprika is eventually captured by the pair after an exhausting chase. There, Osanai admits his love for Chiba and literally peels away Paprika's skin to reveal Chiba underneath. However, he is interrupted by the outraged Chairman who demands that they finish off Chiba; as the two share Osanai's body, they battle for control as they argue over Chiba's fate. Konakawa enters the dream from his own recurring dream, and flees with Chiba back into his. Osanai gives chase through Konakawa's recurring dream, which ends in Konakawa shooting Osanai to take control of the dream. The act actually kills Osanai's physical body with a real bullet wound.\nDreams and reality have now merged. The dream parade is running amok in the city, and reality itself is starting to unravel. Shima is nearly killed by a giant Japanese doll, but is saved by Paprika, who has become an entity separate from Chiba thanks to dreams and reality merging. Amidst the chaos, Tokita, in the form of a giant robot, eats Chiba and prepares to do the same for Paprika. A ghostly apparition of Chiba appears and reveals that she has been in love with Tokita this whole time and has simply been repressing these emotions. She comes to terms with her own repressed desires, reconciling herself with the part of her that is Paprika. The chairman returns in the form of a living nightmare, reveals his twisted dreams of omnipotence, and threatens to darken the world with his delusions. Paprika returns to Tokita, throwing herself into his body. A baby emerges from the robotic shell and sucks in the wind, aging as she sucks up the chairman himself, becoming a fully-grown combination of Chiba and Paprika. In this new form, she is able to consume the chairman's dream form and end the nightmare he created before fading away.\nIn the final scene, Chiba sits at Tokita's bedside as he wakes up. Later on, Konakawa visits the website from Paprika's card and receives a message from Paprika: \"Atsuko will change her surname to Tokita...and I suggest watching the movie Dreaming Kids.\" Konakawa enters a movie theater and purchases a ticket for Dreaming Kids."}