{"mid": "Parallels", "IMDB_id": "tt3479316", "title": "Parallels", "plot": "Ronan and Beatrix each receive a message from their father, Alex, who requests they meet him. Curious, they separately converge at their father's house, where they find him missing, though Ronan recovers a strange, ball-shaped device. When Harry, Beatrix's friend, arrives, he joins them in their attempts to locate their father despite Ronan's dislike for him. Harry, a public defender, suggests that they contact the police. However, Captain Stone can offer little help to them, as they have no evidence of wrongdoing. He directs them to the building Alex described and tells them that it is abandoned.\nThe three find the building empty and covered in graffiti that describes alternate timelines and histories. Initially dismissive of the seemingly nonsensical graffiti, they discover that the building has transported them to an alternate Earth devastated by nuclear blasts. When they see a roving patrol shoot down pedestrians, they flee back into the building, where they meet Polly. Polly, a traveler between worlds, explains that the building transports anyone within it to a new, random world if they return to it in exactly 36 hours. In hostile worlds such as the one in which they currently reside, she suggests that they stay inside the building and not interact with the locals. The group sleeps to pass the time.\nThey are woken by an armed patrol, who take them to meet the leader of the local settlement. Polly takes charge and convinces him that they are merely confused travelers. Recognizing Captain Stone as their leader, Harry thanks him for his help. Stone, suddenly distrustful of outsiders who know both his name and former occupation, takes them hostage and orders Tinker, the local surgeon and gadget-man, to interrogate them. Tinker shows them footage of a terrorist attack via suitcase nuke, and Ronan and Beatrix are horrified to recognize their father as the perpetrator.\nRonan breaks free, knocks Tinker unconscious and frees the others. Desperate for revenge against Alex, Tinker sets off with his own suitcase nuke to destroy the building. The group returns to the building just in time to escape the blast and transport to the next world, though they do not know that Tinker transports with them. This world is technologically advanced, and the group splits up to learn more about both it and Alex. Ronan and Polly explore Alex's house, which turns out to be empty. Ronan reveals that he blames himself for his mother's death, and Polly seems confused when he jokingly quotes slang from her world back to her. Ronan shows her the device he found earlier, and she says that it could only be from the \"core world\" where the building was constructed. They flee the house when they find a hidden warning and a team of assassins attack them.\nBeatrix and Harry discover, that in this world he is a wealthy and corrupt corporate lawyer. They hack into his computer and learn that this world's Alex was killed in an accident and Ronan apparently never existed. Harry sends evidence of his double's wrongdoing to the media, and they return to the building, where they find that Tinker has apparently taken Ronan and Polly hostage. Beatrix threatens to kill Tinker, but Ronan convinces her to allow Tinker to use an invention that hacks into the building. Impressed with the device, Alex reveals himself after stepping out from a secure elevator. Alex directs Tinker to the top floor of the building, where he says Tinker will find answers.\nOnce Tinker leaves, Alex tells his children that he and their mother were not born on what they perceived as their home world. Tinker returns from the elevator, yelling to them not to trust Alex, and Alex shoots and kills Tinker. Alex leaves the building after telling Ronan and Beatrix that they must find their mother, who they insist is dead, in order to return to the core world. After the building transports them once again, three different versions of Polly convene in secret and two of them play rock-paper-scissors to presumably determine who will accompany the rest of the group into the next world."}