{"mid": "Paranoiac", "IMDB_id": "tt0057401", "title": "Paranoiac", "plot": "The wealthy Ashby family has been damaged by the death of Mr. and Mrs. Ashby in a plane crash when their three children were very young. The children were left in the care of their Aunt Harriet. The oldest son, Anthony, committed suicide by jumping off a cliff into the sea when he was 15. The second son, Simon, (Reed) is now a cruel, spendthrift alcoholic trying to drive his sister, Eleanor (Scott) insane, so that he can inherit the estate of their deceased parents. He has only three weeks to wait until the lawyers will turn the family money over to him. But a mysterious man (Davion) appears, who throws a monkey wrench into Simon's plans.\nA mysterious man, first sighted by Eleanor, appears who greatly resembles the dead brother. Eight years earlier, when Tony was a youth, he had left a suicide note and had apparently jumped off a seacoast cliff, but his body had never been recovered. Now, the new Tony appears, claiming that he had simply run off. Eleanor wants to believe that the man is Tony. Harriet Ashby (Burrell), their Aunt, is immediately hostile and calls the man an impostor. Simon appears to be more open-minded about the situation. Desperate to keep his hands on the family money, Simon sabotages the car brakes and Eleanor and Tony are nearly killed, saved only by Tony's quick thinking. Eleanor finds she is falling in love with her supposed brother. Overcome with conflict over her seemingly incestuous thoughts, she is about to commit suicide, when the man restrains her and confesses that he is not her brother Tony, but instead is a con man hired by the embezzling Keith Kossett (Bonney), son of the family attorney (Denham).\nMeanwhile, Simon has been having an affair with Eleanor's nurse, a French woman. When she realizes what Simon is up to, she decides to leave—but Simon drowns her in a nearby pond. Simon tells Eleanor that the nurse has simply left.\nEleanor has been hearing mysterious music from the disused family chapel for a long time but had been too frightened to investigate. She and Tony investigate together and see Simon playing the organ while a really creepy masked choirboy sings. The next night \"Tony\" and Eleanor stealthily observe this ritual through a window. Eleanor is spotted by the masked maniac out of the corner of her eye. The masked maniac slips outside and tries to attack Eleanor, but is stopped by \"Tony.\" The person in the mask is revealed to be Aunt Harriet. Aunt Harriet becomes furious and explains that this ritual keeps Simon calm by allowing him to pretend that his brother Tony is still alive. However, it's even stranger than that\nSimon knows the new man is an impostor because he had actually tricked the real Tony into writing the suicide note and then murdered him. He had then hidden the body behind a brick wall in a chapel on the estate (these facts are not revealed until near the end of the film). From time to time, when depressed, Simon would retreat to the chapel and act out a scene in which he would pretend his brother was still alive. He would play a phonograph record of Tony singing, while Simon would play the organ, in the company of a masked maniac, who would also play the part of the dead brother. One night \"Tony\" is attacked by the masked maniac with a steel hook while watching Simon play the organ. The Aunt then explains about the ritual, and blames \"Tony\" for awakening Simon's psychosis after it had seemingly been dormant for years.\nThe fake Tony investigates the chapel, and finds Tony's mummified body. He is about to leave, but is stopped by Simon, who fills in the missing plot details about having killed Tony. Simon then slugs the man and binds him to a pillar. When the man comes to, Simon is playing the organ, with the real Tony's body now seated on a chair next to the organ. Simon informs the impostor that he and Tony have had a talk and have decided to have the man \"join\" Tony. Harriet appears, and persuades Simon to leave; that she will take care of the situation. Unfazed at seeing the corpse, it is evident that she also knew the truth.\nIndeed, after Simon leaves, Harriet shows that she, too, is a murderer: she throws down a lantern, setting the chapel afire, and she rushes off. Fortunately, Eleanor quickly turns up, unties the fake Tony, and sees the real Tony's body briefly. Eleanor and the man flee the estate rather than returning to the house. With the chapel ablaze and Tony's body inside, Simon's madness takes him over. He leaves the house and staggers to the chapel to try to \"rescue\" Tony, but collapses as he clutches Tony's skeletal remains. The fire rages on."}