{"mid": "ParisIsBurning", "IMDB_id": "tt0100332", "title": "Paris Is Burning", "plot": "Shortly after the failed 1944 20 July plot to assassinate Adolf Hitler (Billy Frick), he appoints General Dietrich von Choltitz (Gert Fröbe) as military governor of occupied Paris. Hitler believes Choltitz will obey his order that the Allies should not be allowed to capture Paris without the Germans destroying it completely, similar to the planned destruction of Warsaw.\nThe French Resistance learn that the Allies are not planning to take Paris, but are heading straight to Germany instead. The two factions within the Resistance react to this news differently. The Gaullists want to wait and see, while the Communists want to take action. The Communists force the issue by calling for a general uprising by the citizens of Paris and by occupying important government buildings. The Gaullists go along with this plan of action once it is set in motion.\nInitially, Choltitz is intent on following Hitler's order to level the city. After his troops fail to dislodge the Resistance from the Prefecture of Police, he orders the German air force to bomb the building but withdraws the order at the urging of the Swedish Consul, Raoul Nordling (Orson Welles), who points out that bombs that miss the Prefecture risk destroying nearby culturally invaluable buildings such as the Notre Dame Cathedral. Choltitz accepts a truce offer from the Resistance (conceived by the Gaullist faction), but the Communists want to keep on fighting, in spite of a lack of ammunition. The truce is, therefore, shortened to one day and the fighting resumes.\nAfter learning that the Germans plan to destroy Paris (the Eiffel Tower and other landmarks are rigged with explosives), a messenger from the Resistance is sent across enemy lines to contact the Americans. He implores the Allies to act and afterwards U.S. General Dwight D. Eisenhower gives the Free French Forces under General Charles de Gaulle the go-ahead to move on Paris.\nAs the military situation deteriorates, Choltitz delays the order to destroy Paris, believing that Hitler is insane and that the war is lost, making the destruction of Paris a futile gesture. He chooses instead to surrender shortly after the Allies enter the city.\nAs the Free French Forces and De Gaulle parade down the streets of Paris, greeted by cheering crowds, a phone receiver off the hook is seen with a voice in German repeatedly asking \"Is Paris burning?\" From the air, Paris is seen, its buildings still standing."}