{"mid": "Passion", "IMDB_id": "tt0117306", "title": "Passion", "plot": "In Milan in 1863, two young lovers are in bed together (\"Happiness\"). The handsome captain, Giorgio, breaks their reverie by telling Clara that he is being transferred to a provincial military outpost. In the next scene, Giorgio is in the mess hall at the army camp with Colonel Ricci, the unit's commanding officer, and Dr. Tambourri, its physician. He thinks longingly of Clara (First Letter) and she thinks longingly of him (\"Second Letter\"). Giorgio's thoughts are interrupted by a bloodcurdling scream. The Colonel tells him not to worry; it's just Fosca, his sick cousin. Giorgio offers to lend her some of his books.As he begins to adjust to the tedium of life at the outpost, the sensitive Giorgio feels increasingly out of place amongst the other men (\"Third Letter\"). He starts becoming friendly with the Doctor, who describes Fosca as having a nervous disorder. She frequently collapses into seizures, exposing her suffering and need for connection.Fosca arrives later after dinner to thank Giorgio for the books. When he suggests she keep a novel longer to meditate over it, she explains that she does not read to think or search for truth, but to live vicariously through the characters. She then goes off into a dark musing on her life (\"I Read\"). When Giorgio awkwardly changes the subject and observes a hearse pulling up, she is seized by a hysterical convulsion. Giorgio is stunned and appalled (\"Transition\").The following afternoon, Giorgio, the Colonel, the Doctor and Fosca go for a walk together. As they stroll through a neglected garden, Giorgio politely engages Fosca in conversation while mentally narrating a letter to Clara. When Fosca confesses that she feels no hope in her life, he tells her that \"the only happiness that we can be certain of is love.\" Fosca recognizes that Giorgio, like herself, is different from others, and asks for his friendship (\"Garden Sequence\").Giorgio and Clara exchange letters about Fosca. Clara urges him to avoid her whenever possible. When Giorgio is preparing to take a five-day leave, Fosca shows up unexpectedly, dissolving into hysteria and begging him to return soon. Fosca is next seen reading, stone-faced, from a letter Giorgio has sent her kindly rejecting her love while he and Clara make love back in their room (\"Trio\").Upon Giorgio's return, Fosca reproaches him. She interrogates him about his affair with Clara and learns that she is married. In a sharp exchange, they agree to sever all ties. Weeks go by with no contact between them, but just as he is beginning to think that he is finally free of Fosca, he is informed by the Doctor that she is dying. His rejection of her love has exacerbated her illness. Giorgio, whose job as a soldier is to save people's lives, must go to her and offer a few words of hope. He reluctantly agrees.He enters Fosca's bedroom, and she implores him to lie beside her while she sleeps. At daybreak, Fosca asks him for a favor before he leaves: \"Write a letter for me.\" He complies, but the letter she dictates is a fantasy one from Giorgio to herself (I Wish I Could Forget You). He hastens from the room.The soldiers gossip about Giorgio and Fosca while playing pool (\"Soldiers' Gossip\"). The Colonel thanks Giorgio for the kindness he has shown his cousin and explains her history. As a child, Fosca was doted on by her parents and once had illusions about her looks. When she was seventeen, the Colonel introduced her to an Austrian count. Fosca was taken with him, though she had her reservations. Once they were married, the count took all of her family's money. Fosca eventually discovered that he had another wife and a child. When confronted, he smoothly admitted to his deception and vanished. It was then that Fosca first became ill. After her parents died, she went to live with the Colonel, who felt responsible for her circumstances (\"Flashback\").Meanwhile, Clara has written Giorgio a letter (\"Sunrise Letter\") addressing her approaching age, in which she admits that she's afraid that he will not love her anymore when she is old and no longer beautiful. Giorgio makes his way to a desolate mountain heath and is in the midst of reading when Fosca appears. After Giorgio lashes out at her in anger (\"Is This What You Call Love?\"), she collapses, and he carries her back in the rain.The rain, the ordeal of getting Fosca back to camp and perhaps the exposure to her contagious emotions have conspired to give Giorgio a fever. He falls into a slumber and dreams that Fosca is dragging him down into the grave with her (\"Nightmare\"). The Doctor decides that Giorgio needs to spend some time away from her and sends him off to Milan on sick leave (\"Forty Days\"). As he boards the train, he is followed once again by Fosca. She apologizes for causing his illness and promises to keep her distance for good. Giorgio pleads with her to give him up. She explains that this cannot happen. Her love is not a choice, it is who she is, and she would gladly die for him (\"Loving You\"). Giorgio is finally moved by the force of her emotions. He takes her back to the outpost (\"Transition\").The Doctor warns Giorgio that he must stop seeing Fosca, that she threatens his mental and physical health. Giorgio requests that his leave be shortened; he feels it his duty to stay and help her as much as he can. Back in Milan, Clara questions him jealously about Fosca. Giorgio asks Clara to leave her husband and start a new life with him, but as she has a child, she cannot.During Christmas at the outpost, Giorgio is told that he has been transferred back to military headquarters. Later on, he reads Clara's newest letter, in which she asks him to wait until her son is grown before planning a more serious commitment (\"Farewell Letter\"). Giorgio finds he no longer desires the carefully arranged, convenient relationship that they shared (\"Just Another Love Story\"). He puts her letter away.Having discovered the letter Fosca dictated, the Colonel accuses Giorgio of leading her on and demands a duel. The Doctor attempts to mediate the two, but Giorgio insists on seeing her one last time. He realizes that he loves Fosca, for no one has ever truly loved him but her.That evening, he returns to Fosca's chamber and, knowing the physical act might very well kill her, surrenders to what she has awakened in him (No One Has Ever Loved Me). They embrace, their passion consummated at last.The duel takes place the following morning. Giorgio shoots the Colonel and lets out a shrill howl eerily reminiscent of Fosca's earlier outbursts.Months pass, and Giorgio is in a hospital, dazed, recovering from his nervous condition. He is informed that Fosca died shortly after their night together; the Colonel recovered from the wound. Dreamlike, the other characters in the story reappear as Giorgio begins reading from Fosca's final letter. Gradually her voice joins his, and together they look back on their revelations (\"Finale\").The company walks off, Fosca last, leaving Giorgio alone at his table."}