{"mid": "PatchAdams", "IMDB_id": "tt0129290", "title": "Patch Adams", "plot": "A suicidal Hunter \"Patch\" Adams (Robin Williams) commits himself into a mental institution. Once there, he finds that using humor, as opposed to the indifferent sessions provided by their doctor, to help his fellow patients gives him a purpose in life. Because of this he wants to become a medical doctor and two years later enrolls at the Medical College of Virginia (now known as VCU School of Medicine) as the oldest first year student. He questions the school's soulless approach to medical care and clashes with the school's Dean Walcott (Bob Gunton), who believes that doctors must treat patients as patients and not bond with them as people. Because of this and incidents such as setting up a giant pair of legs during an obstetric conference, he is expelled from the medical school, although he is later reinstated due to his methods actually helping patients improve. Adams encourages medical students to work closely with nurses, learn interviewing skills early, and argues that death should be treated with dignity and sometimes even humor.\nAdams begins a friendship with fellow student Carin Fisher (Monica Potter), and develops his idea for a medical clinic built around his philosophy of treating patients using humor and compassion. With the help of Arthur Mendelson (Harold Gould), a wealthy man who was a patient whom Patch met while in the mental hospital, he purchases 105 acres (425,000 m²) in West Virginia to construct the future Gesundheit! Institute. Together with Carin, medical student Truman Schiff (Daniel London), and some old friends, he renovates an old cottage into a clinic. When they get the clinic running, they treat patients without medical insurance and perform comedy sketches for them.\nCarin and Patch's friendship soon turns into romance. When she tells him that she had been molested as a child, Patch comforts her and reassures her that she can overcome her pain by helping others. Encouraged, Carin wants to help a disturbed patient, Lawrence \"Larry\" Silver (Douglas Roberts). However, Larry murders Carin then commits suicide. Patch is devastated and guilt-ridden by Carin's death, and begins to question the goodness in humanity. Standing on a cliff, he contemplates suicide once again and questions God about what happened. He then sees a butterfly which reminds him of Carin's telling him earlier how she always wished she was a caterpillar that could someday transform itself and fly away. The butterfly lands on his medical bag and on his shirt before flying away. This reminds Patch of Carin and revives his spirits, and he decides to continue his work in her honor.\nHe is expelled from medical school a second time for running a clinic and practicing medicine without a license and because of complaints that he has made his patients uncomfortable (which is obviously not true). He files a grievance with the state medical board at the advice of his former medical school roommate, uptight Mitch Roman (Philip Seymour Hoffman). Patch is able to convince the board that he did his best to help the people that came to him, and as a doctor it is his responsibility to treat the spirit as well as the body. The board accepts Patch's methods and decides to allow him to graduate. He receives a standing ovation from the packed hearing room.\nAt graduation, Patch receives his diploma and bows to the professors and the audience, revealing that he is not wearing anything under his gown."}