{"mid": "PatGarrettAndBillyTheKid", "IMDB_id": "tt0070518", "title": "Pat Garrett & Billy the Kid", "plot": "In 1881 in Old Fort Sumner, New Mexico, William H. Bonney, known as Billy the Kid (Kris Kristofferson), is passing the time with friends shooting chickens for fun. An old friend of Billy's, Pat Garrett (James Coburn), rides into town with Deputy Sheriff J. W. Bell (Matt Clark) and joins the diversion. Later, over drinks, Garrett informs Billy that the electorate want him out of the country, and that in five days, when he becomes Sheriff of Lincoln County, he will make Billy leave.\nSix days later, Garrett and his deputies surround the small farmhouse where Billy and his gang are holed up. In the ensuing gun battle, Charlie Bowdre (Charles Martin Smith) and several other men on both sides are killed, and Billy is taken prisoner. As Billy awaits his execution in the Lincoln County Jail for the killing of Buckshot Roberts, he is taunted and beaten by self-righteous Deputy Sheriff Bob Ollinger (R. G. Armstrong) while the hangman's gallows are being built nearby. Garrett warns Ollinger not to taunt Billy again or he will be fired and sent back to Texas then Garrett leaves town to collect taxes leaving his two deputies to guard Billy. Ollinger again argues with Billy but after J. W. Bell intervenes, Ollinger leaves to get a drink. Billy finds a gun hidden for him in the outhouse and gets the drop on Bell, shooting him in the back. He quickly retrieves Ollinger's shotgun loaded with \"sixteen thin dimes\" and shoots Ollinger dead in the street, saying, \"Keep the change, Bob.\" Billy leaves town.\nAfter Garrett returns to Lincoln and recruits a new deputy sheriff named Alamosa Bill Kermit (Jack Elam), he rides to Santa Fe to meet with Governor Lew Wallace (Jason Robards) who introduces him to a pair of powerful men from the Santa Fe Ring. They offer a thousand dollars for the capture of Billy the Kid with five hundred dollars upfront. Garrett rejects the money saying they can pay him in full when Billy is brought in and warns them that he will be successful as long as another cattle war is not started.\nBilly returns to his gang at Old Fort Sumner, where he decides to lie back for a few days. He is confronted by three strangers looking to kill him; all three are killed in the subsequent shootout, helped by another stranger called Alias (Bob Dylan), who kills one of the men with a knife through the neck. Alias had witnessed Billy's escape from the Lincoln County Jail.\nGarrett meets up with Sheriff Colin Baker (Slim Pickens), hoping he can provide information on Billy's whereabouts. Baker and his wife (Katy Jurado) go with Garrett to arrest some of Billy's old gang. In a gunfight, the gang members including Black Harris (L. Q. Jones) are killed and Baker is mortally wounded. Baker's wife comforts the dying lawman as he waits to die by a river. Later that evening, Garrett watches a barge floating down a river with a man shooting bottles in the water. Garrett and the two face off briefly from a distance before lowering their rifles.\nGarrett is joined by a glory-seeking John W. Poe (John Beck), who works for the Santa Fe Ring. The two ride southwest to meet John Chisum (Barry Sullivan), a powerful cattle baron, who informs them that Billy has been rustling his cattle again and killed some of his men. Billy once worked for him and claims Chisum owes him back salary.\nAnticipating Garrett's arrival in Old Fort Sumner, Billy's friend Paco (Emilio Fernández) and his family leave for Mexico, soon followed by Billy. Along the way, Billy stops at the Horrell Trading Post, which is owned by an old friend. By chance, Horrell (Gene Evans) is hosting Garrett's new deputy, Alamosa Bill. After they finish eating, Billy and Alamosa step outside for a duel at ten paces, with Billy shooting Alamosa dead. Meanwhile Garrett and Poe arrive at a saloon. Garrett tells Poe to ride on without him and that Garrett will pick him up in Roswell in five or six days. Three members of Billy's gang come into the saloon. After taunting Holly (Richard Bright) and getting him drunk, Garrett shoots him dead after he pulls a knife. He tells Alias to give Billy a message that they had \"a little drink together\".\nGarrett rides to Roswell ahead of Poe to gather more clues on Billy's whereabouts. Garrett beats up a prostitute named Ruthie Lee (Rutanya Alda) and learns from her that Billy is in Fort Sumner. Poe arrives in Roswell to find Garrett naked and in bed with several prostitutes, and confirms that Billy is in Fort Sumner. Garrett recruits an old friend he helped become a sheriff and along with Poe rides to Fort Sumner to find Billy.\nBilly and his girlfriend, the daughter of Pete Maxwell, have sex as Garrett and his two deputies arrive. Billy goes to get some meat and seeing Garrett's deputies, backs into a bedroom where Garrett shoots him. Garrett angrily hits Poe for attempting to cut off Billy's trigger finger. He stays on the porch until morning, when the townspeople of Fort Sumner, having heard the news of his death, gather to see Billy's lifeless body. Garrett mounts his horse and rides out of town, with a small boy throwing stones at him.\nTwenty-eight years later in 1909, near Las Cruces, New Mexico, Garrett is riding with some associates when he is ambushed and killed by men working for the Santa Fe Ring."}