{"mid": "PatriotsDay", "IMDB_id": "tt4572514", "title": "Patriots Day", "plot": "Boston, MA, April 2013The film opens with Sergeant Tommy Saunders (Mark Wahlberg) and two other police officers trying to get a suspect named Harrold (Rhet Kidd) to open his apartment door. Tommy kicks the door down with such force that he injures his knee. He manages to catch Harrold before Commissioner Ed Davis (John Goodman) arrives. Tommy tells Davis that he hurt his knee kicking a perp in the mouth as the officers arrest Harrold.A title card reads that it is April 15th, 2013.A couple named Patrick Downes (Christopher O'Shea) and Jessica Kinsky (Rachel Brosnahan) are having a meal as they discuss going to the marathon later that day. Patrick tries to get Jessica to speak with a Boston accent.At the Massachusetts Institute of Technology, a group of students are working on a project of theirs as Officer Sean Collier (Jake Picking) goes to visit one of his friends, Li (Lana Condor), regarding concert tickets.Tommy gets home late and wakes up his wife Carol (Michelle Monaghan) as he stumbles through his closet.As the sun is rising, a Chinese exchange student named Dun Meng (Jimmy O. Yang) talks to his parents via a video chat and shows them his new car, a large black Mercedes. His parents comment that he must be very tired. Dun then goes out for his morning run.Tommy does his morning workout and goes to find that Carol put his uniform together for him. He puts it on, kisses Carol goodbye, and goes off to work.Meanwhile, Katherine Russell (Melissa Benoist) is tending to her daughter while her husband Tamerlan Tsarnaev (Themo Melikidze) and his brother Dzokhar (Alex Wolff) are planning for something together. Dzokhar doesn't seem entirely sure about what is to come, while Tamerlan tells him that they are working in the name of Islam. Tamerlan then hugs his brother.In nearby Watertown, Sergeant Jeffrey Pugliese (JK Simmons) gets up and goes to the nearby Dunkin Donuts to get his wife a blueberry muffin.The Patriots Day marathon is being set up as officers and citizens continue coming in. Steve Woolfenden (Dustin Tucker) and his son Leo (Lucas Thor Kelley) are there to watch his wife compete in the race. Patrick and Jessica arrive and join the crowd. Sean and his buddies watch from home. Carol shows up in the crowd to bring Tommy something. Before the race begins, there is a moment of silence in honor of the victims of the Newtown school shooting.Tamerlan and Dzokhar arrive at the race. They split up and carry backpacks with them, dropping them off a few blocks away from each other before disappearing. As the runners are heading down the street, an explosion goes off. Before most people can react, another explosion goes off a few blocks down. The police spring into action while medics start tending to the wounded. Both Patrick and Jessica's legs are severely injured. Steve is knocked out by the blast, but Leo is uninjured. A medic tends to Steve while an officer takes Leo somewhere safe. Tommy finds Carol safe and urges her to get home. Other runners and fans are severely injured with some of their limbs blown off or mangled.Once things have settled in the area and everyone has been cleared out, the police meet with FBI Special Agent in Charge Rick Deslauriers (Kevin Bacon). After learning the details, Rick doesn't want to initially label the incident as an act of terrorism so as to not create even more panic, but they come to the conclusion that this was indeed done by terrorists. Rick has all the authorities working on the case to set up shop at the Black Falcon Terminal so that they may conduct their investigation.The Tsarnaevs see reports of their attack all over the news and decide to keep a low profile.Tommy goes around the city trying to find leads. He meets with Jessica's family while she and Patrick are both comatose and have had their legs amputated in separate hospitals. Tommy goes home and finds neighbors and friends all clamoring and asking who is responsible. Tommy becomes distressed and screams at everyone to get out. He breaks down in Carol's arms over what he has just witnessed and vows to find those responsible.An analyst at the terminal reviews security footage from the marathon prior to the explosion. He spots Dzokhar wearing a white cap and being the only one to look in the opposite direction from everyone else. They also manage to get footage of Tamerlan. Rick is hesitant in putting the pictures out because he thinks it might give the suspects an advantage since there isn't concrete proof that they were the culprits. He also worries that should they be Muslim, it will create anti-Muslim paranoia and fear. Rick chooses not to release the photos, but Davis demands that they do.Pugliese has his own team in Watertown conducting their investigation into the bombings.Some of Dzokhar's college buddies are in his dorm smoking weed. They look into his bag for more weed but find a number of materials used to create a bomb (fireworks and vaseline, for instance).The brothers go out at night and find Sean sitting in his patrol car after responding to a nearby disturbance. They approach his car, and Tamerlan shoots Sean in the face. Dzokhar tries to grab Sean's gun, but Sean fights him off. Tamerlan continues to shoot Sean until he is dead. Afterwards, they come across Dun in his Mercedes and they carjack him at gunpoint. Tamerlan drives away and asks Dun if he believes Muslims were responsible for 9/11. Dun admits to not knowing much about 9/11 as Tamerlan claims the U.S. government was responsible for those attacks. The brothers then stop at a gas station. As Tamerlan is waiting for Dzokhar to get out of the store, Dun quickly escapes the car so that he can run to nearby convenience store and tells the clerk to call 911. The brothers get away but Tommy arrives at the convenience store to talk to Dun. He tells Tommy that the brothers admitted to the marathon bombings and are planning another attack in New York. Dun gives Tommy the GPS tracking number to his car so they can find them.Police trace the car to Watertown. Tamerlan is confronted and starts to open fire on an officer. Backup arrives, leading to a shootout. Dzokhar throws bombs at the police while Tamerlan shoots at them. Pugliese and Tommy rush to the scene. Tamerlan is eventually shot multiple times. Dzokhar drives away and finishes his own brother off by running him over. Tamerlan is taken to the hospital where doctors try to revive him, but he is pronounced dead.The next day, the entire city is on lockdown as police continue to search for Dzokhar. His roommates are arrested in their dorm. Katherine is also taken into custody to be questioned for any possible involvement in her husband's deeds. A woman police detective interrogates Katherine and presses her into trying to give up any information should there be more bombs out there. The woman tries to convince Katherine that Tamerlan didn't even care enough about her or their daughter, just as Katherine doesn't care enough about their child to disclose any information. Katherine remains silent on the matter.Across town, Patrick and Jessica are reunited, as are Steve and Leo.A man in the suburbs finds rolls outside on his lawn by his boat. He believes that Dzokhar is hiding under the sheets in the boat. The police arrive, and Tommy goes over to confirm that Dzokhar is indeed in the boat. More officers show up and demand for Dzokhar to get out. They start shooting at the boat and setting off flares until Dzokhar finally surrenders. He is slammed to the ground and taken into custody. Everyone at the terminal cheers when they hear the news.Tommy and his fellow officers go to a bar to celebrate their victory.We see footage of a Boston Red Sox game with the real authorities portrayed in the film present, with everyone in the city showing off a newfound sense of pride and unity.The closing text reads that Dzokhar Tsarnaev was charged on 30 counts and sentenced to death by lethal injection. He is currently being held in federal prison while awaiting appeal. His roommates were arrested for obstructing the investigation. Authorities continue to investigate Katherine Russell for any possible involvement in the bombings.We then see video testimonies from the real people involved, including Ed Davis, Richard Deslauriers, Jeffrey Pugliese, Patrick Downes, Jessica Kinskey, and Steve Woolfenden and his wife Amber. They discuss the tragedy of the events, but also the strength and unity it brought them, and the massive support for the authorities and survivors. We see Patrick with a prosthetic leg as he would later run in the marathon and make it to the finish line. He is seen tearfully embracing Jessica. Also shown are photos of the deceased victims (Krystle Campbell, Lu Lingzi, Martin Richard, and Officer Sean Collier). The film is dedicated to the victims, survivors, first responders, medics, and the law enforcement that were involved during the events."}