{"mid": "PawnSacrifice", "IMDB_id": "tt1596345", "title": "Pawn Sacrifice", "plot": "The film starts with an adult Bobby Fischer in a paranoid state, worried he is being spied upon by the Soviets. The film flashes back to when Fischer is 6 years old, the late 1940s, and he is shown even then feeling a general sense of paranoia. His mother, a Russian immigrant, supports his general fears, telling him she thinks a socialist revolution could begin in the U.S. and hence they are spied upon.\nHe immerses himself into learning and becoming an expert chess player. His mother, worried that chess is becoming his obsession, takes him to an adult chess club. He impresses the resident chessmaster and is accepted as a student. His coaching leads him into the world of professional chess championships. He soon becomes the youngest grand master ever. Personal tensions lead to frequent outbursts. He enters a championship match in Bulgaria where he senses that they are trying to isolate him, and alleges collusion, which he feels makes it impossible for a non-Soviet player to win the championship. He quits the tournament and ends his professional career.\nWhen he returns to the USA, a lawyer says that he will help him modify the tournament rules, offering his services free of cost to give Fischer a fair chance to win future tournaments. Fischer re-enters the world of professional chess. He selects William Lombardy, a former World Junior Chess Champion who is now a Catholic priest, as his second. Lombardy tries to calm Fischer's excessive demands, which leads Fischer back to winning tournaments.\nHe overcomes most of the grand masters across the world and gets close to the world championship. He becomes a celebrity with the American public, which makes him overconfident. He loses against Boris Spassky, the current world champion.\nIt is the height of the Cold War era and the US is desperate to challenge the Russian dominance in the world of chess. The White House closely monitors his progress. The pressure to win every game drives Fischer towards psychosis. His sister suspects that he is under severe mental stress fearing for his life because he might defeat Spassky.\nReporters and fans all assemble at Reykjavík, Iceland to witness the historic match between Fischer and Spassky. Fischer is easily distracted by small noises like someone coughing in the audience, rolling cameras, or the pawns on the chess board, which leads him to make extreme demands for silence and fewer distractions. Spassky concedes to all his demands to make sure the match continues so that he can win the 24-game match in the right spirit.\nBobby loses the first game, and doesn't show up for the second therefore losing by forfeit, but wins the third using unconventional tactics. Americans are thrilled with Bobby's victory. Game four is a draw but Fischer wins game five after Spassky himself begins showing signs of paranoia. With the match now more interesting, experts speculate that the next game will determine the outcome of the tournament. In game six Fischer plays using an opening he has never played before, surprising the audience and wins it. Spassky expresses amazed admiration and rises to lead the applause from the gallery. Fischer ultimately goes on to win the match, but his delusions have destroyed him emotionally and he goes into self-imposed exile."}