{"mid": "Pcu", "IMDB_id": "tt0110759", "title": "PCU", "plot": "Preppy pre-freshman (pre-frosh) Tom Lawrence (Chris Young) visits PCU (Port Chester University), a college where fraternities have been outlawed and political correctness is rampant on campus. During his visit, accident-prone Tom manages to make enemies with nearly every group of students, and thus spends much of his visit evading the growing mob upset with him.\nDuring his visit, Tom also finds himself in the middle of a war between \"The Pit\" and \"Balls and Shaft\", two rival groups. Among the members of the latter is Rand McPherson (David Spade), who, with the other Balls and Shaft members, want the outlawed Greek system to return. Meanwhile, \"The Pit\", an unofficial group, runs the former \"Balls and Shaft\" frat house in a highly disorganized manner. Currently inhabited by seniors Gutter (Jon Favreau) and Mullaney (Alex Désert), mid-year Freshman co-ed Katy (Megan Ward), and led by multi-year senior James \"Droz\" Andrews (Jeremy Piven), The Pit is a party-centric house that rebels against the politically correct protests; their counter-protests and parties are a frequent source of complaint forms.\nOther factions on campus include a commune-style house of pot users called Jerrytown that Gutter often frequents, a radical feminist group known as the Womynists, an Afrocentrist group suspecting the Pit of conspiring against them, and the college president, Ms. Garcia-Thompson (Jessica Walter), who is obsessed with enforcing \"sensitivity awareness\" and multiculturalism to an extreme. She proposes that Bisexual Asian Studies should have its own building, as well as a plan to change the campus mascot to a Whooping Crane instead of an offensive Native American character during their Bicentennial Anniversary. Garcia-Thompson conspires behind closed doors with Balls and Shaft to get the established residents of The Pit kicked off campus and give Rand control of the house. She provokes the Pit residents with a damage bill from their past semester. Left unpaid, the campus would seize their house, leaving them homeless and unable to continue attendance at PCU without getting jobs.\nThe Pit responds by throwing a party to raise the funds needed. The Womynists take offense to The Pit's flyers advertising the party, and hold a protest outside as the house residents conspire to steal alcohol and convince students to attend. The party at first appears to be a failure. However, a series of unlikely events results in George Clinton and Parliament-Funkadelic performing at the party. Students begin streaming in (initially to seize Tom for his prior mistakes) and the party successfully raises the funds to keep the house. Garcia-Thompson (after being locked in a room by Droz with the song \"Afternoon Delight\" playing on repeat), deciding to act on the many complaints against The Pit, shuts down the party and expels the residents of The Pit in spite of their fundraising efforts. Tom then informs Droz about an overheard conversation with the Board of Trustees: the President's politically correct changes are negatively affecting both their past legacy and media publicity.\nAt the bicentennial ceremony the following morning, Droz and former Pit residents succeed in liberating the Whooping Crane and provoking the other students into an impromptu protest against protesting (chanting \"We're not gonna protest!\"). The demonstration establishes that even with The Pit shut down, the President cannot control the student population, resulting in the Board of Trustees summarily firing her. Meanwhile, Rand complains about all the other student groups, unaware that Droz has surreptitiously used the podium microphone to broadcast his rant to the entire campus.\nLater, Tom heads home having decided to commit to PCU as the Pit has moved back into their house. As he sits on the bus, he sees Rand, who is now in Tom's position at the beginning of the film: being chased by the students across campus."}