{"mid": "Peacock", "IMDB_id": "tt1188113", "title": "Peacock", "plot": "Peacock (2010) Synopsis:The film begins with lots of different voices and noises, shouting and people not saying very nice things. This is the voice of Johns mother throughout his childhood. Theres a massive storm and Emma Skillpa (Cillian Murphy) quickly takes down some of her washing off of the line and rushes in the house holding the basket. She quickly opens the door to collect the paper on the doorstep. She leaves dinner set out on the table and places the slippers in the same position. She peers out the window and keeps looking at the time. She moves the stool and walks up the stairs to the bedroom where she takes her wig off and gets undressed.John Skillpa (Cillian Murphy) sits reading the paper and collects his lunch from the table and walks over to his bike. He collects a treat from the hidden box under the stairs and cycles off to work in the Peacock State Bank. Once in his office, Mr. French (Bill Pullman) comes in to give him a pile of work and his pay slip.After work John stops by the river and chucks things around, he is emptying the contents of a bag he is holding, when he comes across a hand written note from Emma, which he looks down at, and smiles. He jumps onto the tire swing and sways looking up at the trees. On the way home, he stops by at the shop and bumps into Louise (Eden Bodnar) who invites him over for dinner as she says he must get lonely in his house. John returns home with the shopping, gets his dinner out of the fridge, which is accompanied by a handwritten note, which makes him laugh a little and soon after goes up to bed.The next morning, we hear the loud noises of the train nearby, Emma is taking down the washing in the garden, when all of a sudden the train comes crashing through the fence and Emma is unconscious for a short while. When she wakes up, lots of people are gathered around her and Louise questions who she is and how she knows John. Emma does not know how to respond, so walks away quickly muttering that she lives here. Emma enters the house and closes the door immediately and stands there taking deep breaths. Emma looks at the clock, ensures the curtains, blinds and doors are shut and that the food is on the table ready for when John arrives.John comes down into the living room and hears a lot of noise outside, he opens the door and is shocked at the state of the incident, which took place several feet away from his house. Louise asks if his lady friend is ok and he does not know how to answer this either and leaves the situation by giving an excuse that his breakfast is getting cold, so that he could go back inside. Next to Johns breakfast is a note reading Go straight to work. Dont talk to strangers! John walks over to see that his lunch has not been made, goes outside and jumps on his bike to cycle to work.On his way to work, he cycles along and Officer Tom McGonigle (Josh Lucas) stops to talk to John, he says that he needs to go to work and cycles off in a hurry. When at work, lots of people kept asking him about the train incident, his boss came into his office and said he could have the day off, but he decides to stay until lunch as he has lots of work to do. When he cycles home, the officer is in the garden and mentions how John acted like he did not know him when he passed him on the street earlier on. The officer also mentioned that when he knocked on the door to check if the lady was ok, nobody answered and people in the town said that it was Johns wife.The officer talks about how he told John what to do with the house and everything when his mum died. John wants the train gone as soon as possible as it is bringing everyone in the community to his house and they are all asking questions. John is quite worried about this because, he'll need to create some kind of cover story about Emma.Emma hears something at the door, so opens the door slowly and peers out. It's the neighbors Connor Black (Graham Beckel) a senior political advisor and Fanny Crill (Susan Sarandon), they are holding a newspaper. A bird flies in and the neighbors rush in to try and get it out again. Emma asks them to get out the house very quietly, but in a polite way. They are hoping to speak to Mr. Skillpa, as they want to discuss how John would feel if they used the train as a backdrop for a rally in the backyard, as the train was part of a campaign they were running. Connor talks to Emma about how he needs her and John's help for this, Fanny shows Emma the newspaper and there is a photograph of Emma on the front page, Emma does not really know how to react. Emma asks Fanny how she and Connor know John, Fanny's husband owns the bank where John works. Fanny sits down and takes her shoes off, while Connor is outside smoking his cigarette. Fanny runs the county shelter for women and she wants to use the rally for a photo shoot with the women from her shelter. Emma says to Fanny that she needs to go upstairs and Fanny gets up walking towards her as she wants Emma to say yes to let them use the train for the photo shoot. Emma stands upstairs looking out the window and looks over to John's clothes laid out on the bed.Emma comes down with some lemonade and cookies for Connor and Fanny who are standing out in the garden. After they leave, Emma goes back into the house and the phone is ringing. Emma answers the phone and it is Mr. French asking for John because he has not shown up to work yet. Emma rushes upstairs, gets changed. John cycles to work to find Mr. French, Connor and Fanny in his office. Ray Crill (Keith Carridine) holds up the newspaper and Fanny talks about how she loved meeting his wife Emma. John reacts as if he does not know anything and Connor talks about the political rally they want to hold in the back garden. Fanny tells John how Emma seemed very happy to hold the rally there; John raises his voice and shouts at Fanny. Mr. Crill stands up and is angry at how John spoke to his wife Fanny. John is very frustrated at the moment because he just wants the train gone and life to how it was before the train incident.Fanny and Connor leave the office and Ray sits down to talk to John so he can try and persuade him to say yes to the political rally. John cycles to the river to sit on the rock next to the tire swing. When John gets home, just before he steps in his door, Maggie (Ellen Page) with her son Jake (Flynn Milligan) calls him and starts talking to him. Jake runs into the house and they both follow. Maggie tells John that they are planning on leaving the town and how they need some help with money. John is unsure why Maggie is asking him and she tells him that his mother used to send her money. John has to break the news to Maggie that she died a year ago. John feels sorry for Maggie and wants to help her; John tells Maggie that he has his own money and walks upstairs. Maggie and Jake sit down on the sofa and Emma comes down the stairs.Emma introduces herself as John's wife to Maggie and Jake, they say goodnight and then leave the house. Emma comes outside and asks Maggie where her car is; she says she borrowed it to a friend and is walking, but Emma guesses correctly that she doesn't have a car so decides to offer them a lift home. Maggie asks for John and Emma says that he is sleeping. Emma does not usually drive, so it is a bit of a rocky journey to Maggie's. Emma helps Maggie into the house with Jake and puts Jake to bed; there is a knock on the door. Maggie explains how John's mother made him do horrible things. Maggie opens a small box in the room next door and gets out the birth certificate to show Emma that John is Jake's father. Emma looks shocked, but does not say anything. Back at home, Emma walks up the stairs towards the bedroom at the end of the hall very quietly and enters; she looks around at all of the photographs framed in the room and sees John's mother's dress that Maggie described earlier. Emma lies down on the bed.Emma makes a phone call and springs a question about wanting to adopt Jake. Emma turns up to the shelter to let Fanny know that they can go ahead with the rally. Emma drives with Fanny to tell Connor that they will do the rally. After telling Connor, Officer Tom McGonigle needs John and Emma to fill in an accident form with him. Emma makes up an excuse that Fanny Crill is waiting for her. Fanny asks Emma if she ever met John's mother and she says she did not, Fanny said not many people did. Emma asks Fanny if she has any kids and Fanny said she had a son called James, but he died 14 years ago. Emma tells Fanny how she and John wanted a little kid.Emma stops by at Wade's café to say hello to Maggie. Jake accidentally drops a plate and Wade shouts at him. When Emma gets home, she hangs the washing up outside and then goes to the broken step to get out the old box and finds a key and a bankbook. Emma goes to the bedroom and just sits there quietly. There is a loud knock at the door and John comes running down the stairs to answer it. It is Fanny; she has a gift for John and Emma to say thank you. Ray sits waiting in the car outside and says to John that he does not have to bother coming into work today. Fanny walks back to the car and John slams the door shut and turns the light on. John walks over to his breakfast on the table and takes the top plate off which is covering it. He picks up his breakfast plate and chucks it in the sink; it smashes. John then goes outside to the broken step to retrieve the box, looks at the key and book. John opens the present from Fanny and Ray Crill; it is a small photo frame, he puts it down and holds his head in his hands. John then walks over to the table again; to see his breakfast on the table and the sink empty. He is a little confused and has to take a double take. This time when he takes the top plate off, he is more satisfied than previously; picks up his serviette ready to eat and then hears voices outside. John rushes over to the door and Officer Tom McGonigle is there, he asks John to bring his wife out so that they can both go over the accident form with him. John is a bit overwhelmed by the situation and is not really sure how to handle it, so makes a fuss and says that he does not want the rally to happen. Officer Tom McGonigle said he would swing back later when John has calmed down. In this time, John decides to repair the fence the train had broken.John goes to a workshop to ask a guy if he could remove the train from his back garden, he demands 800 in cash. John rushes into work and gets asked straight away where he was yesterday. As John is about to walk into his office, there is a call for him at reception and the receptionist says that she thinks it is his wife Emma. It is Maggie and she is at the women's shelter; John cycles home quickly, goes to the cupboard for a particular key and notices that it is gone. John walks over to the hallway and at the end of the hall, his mother's bedroom door is slightly open. John looks in the wardrobe and sees a few extra hangers in there than before, looks at the photograph and sees that the bed is unmade. John rushes over to his wardrobe and picks up Emma's clothes to donate to the shelter; when he arrives at the shelter, he asks to see Maggie. John tells Maggie that he will giver her money as he wants her and Jake to get out of Peacock because it is not safe in Peacock. John talks to Maggie and says how he can not go home, instead he asks Maggie where she wants to go and that he will take her wherever she wants to go. Maggie has family in Madison and takes John's offer of taking her and Jake there; she apologises to John for causing trouble to him and Emma and John replies and tells Maggie that she is not his wife.John runs to the bank and tries to get in, but it is closed. John then drives to the river near the tire swing where he occasionally went before or after work. Officer Tom McGonigle pulls up in his car to find John lying down on the floor, beside the tree. John states to Officer Tom McGonigle that he cannot go home. John chucks a stone into the river and they both look over. John speaks to Officer Tom McGonigle and says that his mother held his head under water, when he was a kid. John starts talking about his mum and Officer Tom McGonigle reminds him that his mother is gone. John is upset and stands up in frustration.John and Officer Tom McGonigle both drive back to John's house and Officer Tom McGonigle waits until John is in his door before driving off. John slowly walks into his house and into the room, he then turns around and crashes the door shut. John opens the cupboard, gets something out and runs downstairs and calls for his mum. John rings on the doorbell at a nearby motel; he has turned up with a small bag and asks for a room. John is unsure of how long he needs the room for when he is asked. John sits down on a chair in his motel room, tilts his head back and closes his eyes for a short time. John opens the bag and is shocked to see his mother's blue and white dress folded up in his bag. John slowly backs away from the bag. Back home, Emma is wearing John's mother's dress and eating breakfast at the table. Emma draws open all of the curtains and someone knocks on the door. Emma opens the door and it is the guy from the workshop, John asked him to remove the train yesterday. Fanny pulls up at the house and asks if she knows where Maggie is as she is not at the shelter. Emma is worried, so drives to the café where Maggie works. Emma says to Maggie that Fanny Crill has a job for her at the bank and they could stay in Peacock together. Emma walks down to the basement back at home, turns the light on and opens a cardboard box, which is labeled John's Toys. The phone rings, Maggie answers it at the café; it's John, he tells her to meet him at the motel at 11 o'clock sharp and to make sure nobody knows, especially Emma.John turns up at the bank and sees Louise and Mr. French; Mr. French questions why John came in the front door. John sparks the question to Mr. French: \"What would you do without me?\" Mr. French simply replies, \"Find someone more reliable.\" John is pleased with this response, because he is just prepping himself for leaving later with Maggie. John turns up in his office with his stack of paper work, he sits down at his desk and gets the key out of his jacket pocket for his safe. John opens his brown paper bag and fills it with his money. John goes outside at work and puts his bike in the boot of his car.Back at home; Emma is shaving her eyebrows off with a razor. Emma is at the motel and starts to dance with Cal (Nathan Christopher). Emma introduces herself as Maggie. They go back to the motel room, Cal is at the desk pouring drinks and Emma hits Cal over the head, knocking him down to the floor. Emma lays him down on the bed and sets the room alight. Emma is doing this to fake John's death. Emma goes back home and two people knock at the door and Fanny walks over too, they have come to let her know that John has died in a fire in his motel room. They say a prayer for John together.The rally goes on in Emma's back garden; Emma is nowhere to be seen while the rally is going on. Emma is in the house looking after Jake, she gives him John's old toys. Emma takes a photograph of Jake sitting at the table and then has a series of flashbacks and drops the camera. Emma rushes outside to the rally and asks Maggie to come with her; Emma gives Maggie the money in the brown paper bag. Maggie and Jake leave, because Emma says that is what John would have wanted. Fanny saw the door slam shut, Emma has locked the door; it is nearly time to take the photo. Emma ignores the constant knocking at the door and chooses to sit peering out of the window instead."}