{"mid": "PearlHarbor", "IMDB_id": "tt0213149", "title": "Pearl Harbor", "plot": "In 1923 Tennessee, two young boys, Rafe McCawley (Jesse James) and Danny Walker (Reiley McClendon), play together in the back of an old biplane, pretending to be soldiers fighting the Germans in World War I. After Rafe's father lands his biplane and leaves, Rafe and Danny climb into the plane and Rafe accidentally starts it, giving the boys their first experience at flight. Rafe manages to stop the plane at the end of the runway, but Danny's father beats Rafe and Danny for climbing into the plane. Rafe stands up to Danny's father calling him a \"dirty German.\" However, Danny's father then reveals that he fought the Germans in World War I, and that he prays no one will ever have to experience what he experienced.\nEighteen years later, in January 1941, Danny (Josh Hartnett) and Rafe (Ben Affleck) are both first lieutenants under the command of Major Jimmy Doolittle (Alec Baldwin). Doolittle informs Rafe that he has been accepted into the Eagle Squadron (a RAF outfit for American pilots during the Battle of Britain). A nurse named Evelyn (Kate Beckinsale) meets Rafe and passes his medical exam despite his dyslexia. That night, Rafe and Evelyn enjoy an evening of dancing at a nightclub and later a jaunt in New York harbor in a borrowed police boat. Rafe shocks Evelyn by saying that he has joined the Eagle Squadron and is leaving the next day.\nDanny, Evelyn and their fellow pilots and nurses are transferred to Pearl Harbor. Meanwhile, Rafe flies in numerous dogfights with the RAF against the Luftwaffe, becoming a flying ace, but is shot down over the English Channel and presumed to be killed in action. Danny gives Evelyn the news and she is devastated. Three months later, Evelyn and Danny begin to develop feelings for each other. Danny takes Evelyn on a sunset flight over the harbor and the two begin a relationship.\nOn the night of December 6, Evelyn is shocked to discover Rafe standing outside her door, having survived his aircraft crash. He goes to the Hula bar where he is welcomed back by his overjoyed fellow pilots. Danny finds Rafe in the bar with the intention of making things right, but the two get into a fight. They drive away, avoiding being put in the brig when the authorities arrive at the bar. The two later fall asleep in Danny's car.\nEarly the next morning, on December 7, 1941, the Japanese navy begins its attack on Pearl Harbor. The USS Arizona is obliterated when an armor-piercing bomb detonates the ship's forward ammunition magazine, literally lifting the bow out of the water. The USS Oklahoma capsizes after several torpedoes strike her, trapping hundreds of men inside. On the USS West Virginia suffers severe damage. One bomb mortally wounds Captain Mervyn S. Bennion (Peter Firth). Cook Dorie Miller (Cuba Gooding Jr.), with no training with firearms, mans a .50 caliber machine gun and shoots down a Japanese plane. The USS Nevada makes a run for the sea, becoming a primary target during the second wave. Danny and Rafe drive away in search of a still standing airfield, while Evelyn and the other nurses rush for the hospital. The nurses struggle to give emergency treatment to hundreds of injured. Rafe and Danny manage to get in the air in two P-40s. After causing four planes to crash into each other and another getting shot down by ground fire, the two shoot down seven Japanese Zeros. After landing, the two donate blood, rescue the men out of the capsized USS Oklahoma, and try to rescue the men out of the sinking remains of the USS Arizona, but are too late.\nThe next day, President Franklin Delano Roosevelt (Jon Voight) delivers his Day of Infamy Speech to the nation and asks the US Congress to declare a state of war with the Empire of Japan. The survivors attend a memorial service to honor the numerous dead, including fellow nurses and pilots. Later, Danny and Rafe are assigned to travel stateside under newly promoted Lt. Colonel Doolittle for a secret mission. Before they leave, Evelyn reveals to Rafe that she is pregnant with Danny's child and that she will remain with Danny.\nUpon their arrival in California, Danny and Rafe are both promoted to Captain and awarded the Silver Star. Doolittle asks them to volunteer for a top secret mission, which they both accept. During the next three months, Rafe, Danny and other pilots train with specially modified B-25 Mitchell bombers. In April, the raiders are sent towards Japan on board the USS Hornet, and are informed that their mission will involve bombing Tokyo and then landing in China. However, the Japanese discover them early, forcing the raiders to launch from a longer distance than planned. After a successful bombing run against Tokyo, the raiders crash-land on Japanese-occupied territory in China in a rice paddy. The Japanese Army pin down Rafe's plane, but Danny's crew flies over and shoots the Japanese patrol before crashing. Danny is shot during the attack by Japanese patrols while the other pilots, Red (Ewen Bremner) and Gooz (Michael Shannon), kill the remaining Japanese patrolmen. Danny tells Rafe that he will have to be the father and dies. Back in California, a pregnant Evelyn sees Rafe getting off the aircraft, carrying Danny's coffin. Afterward, Evelyn and Miller are awarded medals and Rafe is awarded his medal by President Roosevelt. Rafe and Evelyn, now married, visit Danny's grave with Danny and Evelyn's infant son, also named Danny. Rafe then asks his son if he would like to go flying, and they fly off into the sunset in the old biplane that his father once had."}