{"mid": "PeeWeesBigAdventure", "IMDB_id": "tt0089791", "title": "Pee-wee's Big Adventure", "plot": "Pee-wee Herman has a heavily accessorized bicycle that he treasures and that his neighbor, Francis Buxton, covets. A bike shop employee, Dottie, has a crush on Pee-wee, but he does not reciprocate it. Pee-wee's bike is stolen while he is shopping at the mall. The police tell Pee-wee that they can't help him find his bike. Pee-wee tells the police that a lot of people wanted to take the bike and thinks Francis took it. He confronts Francis in his bathtub in an underwater brawl; Francis' father stops the brawl and tells Pee-wee that Francis didn't steal the bike. Pee-wee then offers a $10,000 reward for his bike. Francis, who did indeed pay to have someone steal the bike, is frightened by Pee-wee's relentlessness and then pays to have it sent away. After holding a meeting, Pee-wee angrily rejects Dottie's offers of help, tells her off and says that he doesn't need anybody. Desperate, he visits \"Madam Ruby\", a phony psychic with an electric-powered \"crystal ball\". After sneaking a glance out the window at the shop across the street, Al and Moe's Bargain Basement, she tells Pee-wee that his bike is in the basement of the Alamo. Pee-wee hitchhikes to Texas, getting rides from a fugitive, Mickey, and from Large Marge (the ghost of a deceased truck driver).\nAt a truck stop, Pee-wee discovers his wallet is missing (stolen by Madam Ruby) and pays for his meal by washing dishes. He befriends Simone, a waitress who dreams of visiting Paris. As they watch the sunrise at a dinosaur museum, Pee-wee encourages her to follow her dreams, but Simone tells him about her jealous (and large) boyfriend Andy who doesn't want her to leave. At sunrise, as Pee-wee and Simone leave the dinosaur, Andy tries to attack Pee-wee. Pee-wee escapes onto a moving train, where he meets Hobo Jack; Pee-wee jump from the train at San Antonio. He immediately heads over to the Alamo and joins a guided tour. At the end of the tour, he asks the guide, Tina, where the basement is. Tina laughs with the other tourists as she tells him that the Alamo has no basement, causing Pee-wee to flee in humiliation. At a bus station, he runs into Simone, who tells him that she and Andy broke up and she's on her way to Paris. She tells Pee-wee not to give up finding his bike, before bidding him \"au revoir\". Pee-wee calls Dottie at the bike shop and apologizes for his behavior. Meanwhile, Andy shows up at the bus station trying to stop Simone from leaving. He spots Pee-wee and resumes his attack. Pee-wee evades Andy at a rodeo by disguising himself as a rodeo bull rider. Forced to ride for real, Pee-wee does surprisingly well but receives a concussion, while the bulls chases Andy away.\nPee-wee enters a biker bar to make a phone call, but the outlaw motorcycle club kicks him out. Pee-wee accidentally knocks over their motorcycles, causing the bikers to drag him back into the bar and threaten to kill him. Pee-wee makes a last request, dancing to the song \"Tequila\". His dance wins over the bikers. They offer him a motorcycle to get home, and escort the ambulance to the hospital after Pee-wee gets into an accident. In the hospital, he has a surreal nightmare of clown doctors \"operating\" on his bicycle overseen by Francis (as the Devil). Pee-wee wakes up and sees a TV news report that a special bike is being used as a prop in a movie at Warner Bros. Studios and is shocked to learn that his bike is being used by a spoiled brat kid actor named Kevin Morton, Pee-wee sneaks into the studio by pretending to be part of Milton Berle's entourage. He finds the film set where Kevin Morton is playing \"Rusty\", a saintly orphan raised by nuns. However, Morton is rude and nasty to his co-stars and director. During a take, Pee-wee, disguised as an extra nun, ad-libs that Rusty has inspired \"her\" to start a paper route and takes off with the bike. Riding his bike, he is chased by security all over the studio lot and through several sets, including one for a Twisted Sister music video, before escaping the studio.\nOutside, Pee-wee discovers a burning pet shop. He heroically rescues the animals and collapses on the sidewalk, just as police and fire department arrive. Even though the firefighters declare Pee-wee a hero, the police arrest him for what he did at the studio. Pee-wee is taken back to the studio, where he meets the president of Warner Bros., Terry Hawthorne. Pee-wee explains how his bike was stolen and how much time he spent trying to get it back. Mr. Hawthorne decides to drop the charges and make a special movie about Pee-wee and his bike. The bike is returned to Pee-wee, accompanied by Dottie.\nLater at the drive-in, Pee-wee and Dottie attend the movie premiere of his biopic, an action movie starring James Brolin as \"P.W. Herman\" (who introduces himself as \"Herman, P.W. Herman\") and Morgan Fairchild as Dottie. After ninjas attack the couple and steal an important sport bike called the X-1, P.W. gets a phone call from the unseen President of the United States, who explains that the X-1 has an important microfilm concealed in it, which the Soviets must not be allowed to discover. Pee-wee has a cameo appearance as a hotel bellhop (unconsciously mouthing \"P.W.'s\" lines as Brolin speaks them). Back at the movie, Pee-wee gives refreshments to all the people he met along his journey, including Mickey (who has been recaptured and furloughed in a prison bus to see the film). Pee-wee also encounters Francis, who claims to be Pee-wee's best friend who taught him how to ride, and brags about how knowledgeable he is about Pee-wee's bike, but accidentally catapults himself into the air using one of the bicycle's gadgets. Pee-wee tells Dottie that he is leaving. Dottie wonders why he is not staying for the rest of the movie. Pee-wee answers, \"I don't have to see the movie. I lived it.\" He and Dottie then ride off together."}