{"mid": "PeggySueGotMarried", "IMDB_id": "tt0091738", "title": "Peggy Sue Got Married", "plot": "Peggy Sue Bodell sets off for her 25-year high school reunion in 1985 with her daughter, Beth, as company. Peggy has just separated from her high school sweetheart, now husband, Charlie, and is wary of attending the reunion because of everyone questioning her about his absence as they have been married since Peggy became pregnant right after graduation.\nShe arrives at the reunion and is happy to reconnect with her old best friends, Maddy and Carol. Charlie unexpectedly arrives at the reunion, causing an awkward scene with Peggy ignoring him. The awkwardness is ended when the event MC announces the reunion’s \"king and queen.\" The king is Richard Norvik, a former class geek turned billionaire inventor. Peggy is named the queen and walks on stage, but after they wheel out the reunion cake, she faints.\nWhen Peggy wakes, she finds herself back in the spring of 1960 during her senior year of high school, having passed out after donating blood in the school gym (where the reunion was). She finds all of her friends that she just left to also be their teenage selves, not just her. Still in shock, she allows herself to be taken home while she sees her surroundings are the way they were 25 years before. After a rough first night, she decides to have fun with the experience and behave as if everything is normal. However, when given the chance to break up with Charlie, she thinks it might be best since she knows how it will end.\nPeggy makes friends with Richard Norvik, the class geek (and future billionaire), to figure out what is going on with her. Charlie gets jealous when she ignores him at lunch and makes arrangements to meet Richard after school to discuss time travel with him. When she tells him her secret, at first he thinks it's a joke. However, she tells things about him and the world that she would not know if she were not from the future. Although Peggy has decided to break up with Charlie (and her eyes have been on Michael Fitzsimmons given this new chance), she's the only one who wants that.\nOne night after a party, Peggy decides to sleep with Charlie. He then flips out and reminds her that she had rebuffed him the weekend before and therefore believes she's playing games, then drives her home. Instead of going inside, she takes a walk and ends up at an all-night cafe. As she walks by, she sees Michael Fitzsimmons — the artsy loner in school she always wished she’d slept with - and goes in to talk to him. After finding out they have more in common than originally thought, they ride off on his motorcycle. In a field, they smoke weed and find out more about one another. When he asks if she is going to marry Charlie, she responds that she already did that and will not do it again. After he recites some of his poetry for her, they have sex.\nMichael reveals that he wants her to go with him and another woman to Utah (where polygamy is legal) so they can marry and support him while he writes. After his revelation, she tells him he should go and to write about their night together. In the middle of their conversation, she hears a voice she recognizes singing. When she looks at the stage, she sees that it's Charlie and realizes that she did not know everything about him. Michael is upset, thinks that she declined his offer for Charlie and is ready to go. After they leave, it's shown that Charlie was singing as a audition for an agent and is rejected. The next day when Peggy goes to talk to Charlie, he lashes out at her and she gives him a song she \"wrote\" for him (which ends up being \"She Loves You\", by The Beatles). She then goes to Richard to say goodbye so she can stop messing up her life and everyone else's since the reason Charlie stopped singing was her becoming pregnant right before they graduated. Richard proposes, but she refuses because she does not want to marry anyone and he has to be valedictorian. Confused, she visits her grandparents for her birthday. After her grandparents tell her that her grandmother can see the future, she confides her story in them. Her grandfather and his lodge friends then try a strange séance ritual to send her back to 1985.\nPeggy is then kidnapped by Charlie, leaving everyone at the Lodge thinking that the ritual worked. He tells her that he told his dad that he gave up singing and was given 10% of the business so he can support her. He then proposes and gives her the locket she wore at the beginning of the film. When she looks inside, she sees baby pictures of her and Charlie, which resemble their children. Peggy sees how much he loves her and how much she loves him, and they kiss. They begin to make love, which would again lead to Peggy getting pregnant and marrying him. In the next moment, Peggy is transported back to 1985.\nPeggy awakes in a hospital, with Charlie at her side. He is deeply regretful of his adultery and tells Peggy he wants her back. When she questions him about Janet, he swears it's over. It seems there's hope for them reconciling when Peggy looks at Charlie with new eyes and (citing a reference from her grandfather who claimed that her grandmother's strudel kept the family together) says, \"I'd like to invite you over to your house for dinner on Sunday with your kids. I'll make a strudel.\""}