{"mid": "Performance", "IMDB_id": "tt0066214", "title": "Performance", "plot": "Chas (James Fox) is a member of an East London gang led by Harry Flowers (Johnny Shannon); his specialty is intimidation through violence as he collects pay-offs for Flowers. He is very good at his job, and has a reputation for liking it. His sexual liaisons are casual and rough. When Flowers decides to take over a betting shop, owned by Joey Maddocks (Anthony Valentine), he forbids Chas to get involved, as he feels Chas' complicated personal history with Maddocks (which is at least partly gay) may lead to trouble. Chas is angry about this and later humiliates Maddocks, who retaliates by wrecking Chas' apartment and attacking Chas. Chas shoots him, packs a suitcase and runs from the scene.\nWhen Flowers makes it clear that he has no intention of offering protection to Chas but instead wants him eliminated, Chas decides to head for the countryside to hide but instead winds up hiding out in London, requesting that Tony (a trusted friend he refers to as 'Uncle') helps him get out of the country. He assumes a new name, Johnny Dean, and appears at the house of Turner (Mick Jagger), makes a clumsy attempt to ingratiate himself with Pherber (Anita Pallenberg), one of the female inhabitants, and moves in. Turner is a reclusive, eccentric former rock star who has \"lost his demon\", and who lives there with his female friends Pherber and Lucy (Michele Breton), with whom he enjoys a non-possessive and bisexual ménage à trois, and their child maid Lorraine (Laraine Wickens).\nAt first, Chas is contemptuous of Turner, and Turner attempts to return the rent paid in advance, but they start influencing each other. Chas also enjoys intimate moments with Pherber, during which he shows his bisexual tendencies. Pherber and Turner understand his conflict and want to understand what makes him function so well within his world. To speed up the process, Pherber tricks him by feeding him a mushroom (Amanita muscaria), and Chas then accuses her and Turner of poisoning him. After that evening, Chas opens up, and he begins a caring relationship with Lucy, implying that he outgrew the psychological boundaries he was stuck in, due to having to function as a stereotypically masculine man within a gangster world.\nFlowers and his henchmen track Chas to Turner's flat. They are appalled by the loose clothing and feminine wig that Chas now wears, and allow him to go and collect his things upstairs. Chas discusses his options with Turner and Pherber, then shoots Turner in the head. Pherber hides in a closet. As he is led to his death, Chas still wears his feminine clothes and wig, but his face is identical to Turner's."}