{"mid": "PetalsOnTheWind", "IMDB_id": "tt3496892", "title": "Petals on the Wind", "plot": "Petals on the Wind picks up immediately where Flowers in the Attic left off: with Cathy, Chris, and Carrie traveling to Florida after escaping Foxworth Hall. Still weak from the effects of the poison that killed her twin Cory, Carrie gets sick on the bus. Henrietta \"Henny\" Beech, a mute African-American woman, rescues them and takes them to the home of her employer, 40-year-old widower Dr. Paul Sheffield of Clairmont, South Carolina. At first the children refuse to reveal their identities, but once Cathy is convinced that Paul genuinely cares and might be able to help them, she tells him their story.\nDuring the siblings' first Christmas with Paul, Cathy begins bleeding profusely during a ballet audition and collapses; after waking in the hospital, she is told that they had to perform a D&C and that the bleeding was due to irregular periods (due to her near-starvation in the attic). Cathy suspects that the bleeding was actually a miscarriage, the result of her sleeping with Christopher in the attic, but she does not mention this suspicion, telling herself that it's in the past and all that matters is her ability to dance.\nThough the children thrive under Paul and Henny's care and start fulfilling their dreams (Chris heads to premed and then medical school; Cathy gets into a local ballet school and then one in New York City), Cathy is still bent on revenge against their mother, thinking she is to blame for everything wrong in their lives. Carrie continues to feel anguish over Cory's death and is embarrassed by her failure to grow properly and the problems caused by her lack of height, while Cathy and Chris still struggle with their feelings for each other. Determined to live a 'normal' life, Cathy rejects Chris's advances and insists that he must find someone else to love.\nOver time, Cathy falls in love with Paul and they plan to marry, to Chris's dismay. Paul tells Cathy the story of his wife, Julia, and how she had drowned herself and their son, Scotty, after Paul confessed to an affair. Cathy and Paul become engaged. Her ballet troupe begins performing in New York City. Cathy finishes a performance to find Paul's sister, Amanda, waiting to meet her. Amanda leads Cathy to believe that Julia is still alive and states that she knows Cathy miscarried Chris' child. Devastated, Cathy runs to a man in her dance troupe, Julian Marquet, who had been pursuing her since the day they met, and agrees to marry him immediately. When she returns to South Carolina, it is as Mrs. Julian Marquet. Only then does Cathy confront Paul about Amanda's message—and learns that Julia had been in a permanent vegetative state from her suicide attempt at the time Paul took them in, but had died around the time Cathy and Paul became intimate. Paul also insists that Cathy did not have a miscarriage. Cathy still isn't sure, but realizes that she has now revealed to Paul that she and Chris committed incest while they were imprisoned. Paul assures Cathy that he loves her; Cathy knows she has made a mistake in marrying Julian, but she feels she must honor her vows.\nJulian is a possessive husband and jealous of Cathy's relationships with Paul and Chris. He abuses Cathy, cheats on her, and forbids her from seeing them. He breaks Cathy's toes so she can't perform. Chris pleads with Cathy to leave Julian, but Cathy has found out she is pregnant and tells Chris that she loves her husband and wants to make their marriage work, despite Paul's and Chris' insistence that she must leave for her own safety. Julian has a car accident and is paralyzed, at least temporarily. He believes he will never dance again and commits suicide in the hospital.\nAfter Cathy gives birth to her son, Julian Janus \"Jory\" Marquet, she becomes more determined to destroy her own mother's life. She packs up Carrie and Jory and they move to Virginia, not far from Foxworth Hall. Under the guise of collecting Julian's insurance, she hires Bart Winslow, her mother's second husband, as her lawyer. Meanwhile, Carrie meets a young man named Alex and enjoys a sweet courtship, until he says he plans to be a minister. Frightened by the memory of her grandmother's rants about the children being the \"Devil's spawn,\" Carrie purchases powdered doughnuts and arsenic and attempts suicide. In the hospital, Cathy reassures Carrie that Alex won't be a minister if it upsets her so much. Carrie reveals her other motive for suicide: she saw their mother on the street, ran up to her, and was angrily rejected. This only strengthened Carrie's conviction that she must be evil and undeserving. Carrie dies, and Cathy becomes even more intent on taking revenge on Corrine and soon comes up with a plan to blackmail her along with stealing her handsome young husband, Bart.\nCathy refuses to stop, obsessed with making their mother pay for all the pain that the children have suffered, even after Chris discovers Cathy's plan and threatens to distance himself from Cathy completely. Though initially focused solely on revenge, Cathy falls in love with Bart, and he returns her affections. She discovers she is pregnant and believes this will be a crushing blow to Corrine. Bart is torn between his desire to stay married to Corrine and his wish to be a father but does manage to put an end to Cathy sending blackmail letters to Corrine.\nCathy returns to Foxworth Hall on the eve of the annual Christmas Ball, in a replica of the gown Corrine wore to the Christmas party Cathy and Chris spied on so many years ago. She visits the room where she and her siblings were locked away and sees that it has been untouched since their escape. At the stroke of midnight, she appears in the ballroom and exposes the truth to Bart and the party guests. Bart takes Cathy and Corrine to the library where Grandmother Olivia is seated. At first, Bart believes Cathy is lying, but after hearing Cathy's whole story, he confronts Corrine. Corrine breaks down, claiming to be the real victim because her father had known his grandchildren were hidden in his home, and he wanted them to die in captivity. Corrine claims she gave the children arsenic to make them sick gradually so she could sneak them out to safety one by one and then tell her parents the children had died in hospital. Bart is visibly disgusted. Cathy demands to know what happened to Cory's body. Corrine says she stashed the body in a ravine, but Cathy accuses her of hiding Cory's body in a small room off the attic that gave off a telltale odor. Chris bursts into the library, and Corrine perceives him as the ghost of his father, her first husband. She suffers a mental breakdown and sets fire to Foxworth Hall. Corrine, Chris, and Cathy escape, but Bart and Olivia are trapped and die in the fire. Corrine is committed to a mental institution.\nAfter Chris drags Cathy from Foxworth Hall he informs her that Henny has had a stroke, and while trying to help her, Paul suffered a massive heart attack. Cathy returns to Paul, marries him, and gives birth to Bart Jr. Paul dies when Bart Jr. is still quite young, and on his deathbed encourages Cathy to be with Chris, who has loved her and waited all these years. Realizing that Chris was the right one for her all along and that she still loves him, Cathy agrees. They move to California with the two boys and live as the Sheffields. Cathy dreads what will happen if their secret is exposed, and the book ends with her stating that she has been having strange thoughts about the attic in their house and has put two twin beds up there."}