{"mid": "PetersFriends", "IMDB_id": "tt0105130", "title": "Peter's Friends", "plot": "It is New Year's weekend and the friends of Peter (Fry) gather at his newly inherited country house. Ten years ago, they all acted together in a Cambridge University student comedy troupe. Since then they have gone in different directions and career paths.\nPeter's friends are Andrew (Branagh), now a writer in Hollywood; married jingle writers Roger (Laurie) and Mary (Staunton); glamorous costume designer Sarah (Emmanuel); and eccentric Maggie (Thompson), who works in publishing. Joining them are Carol (Rudner), the American TV star wife of Andrew; and the impolite Brian (Slattery), Sarah's very recently acquired lover. Also accompanying them are Vera, Peter's long-serving housekeeper (Law), and her son Paul (Lowe).\nPeter's father has recently died, and Peter plans to sell the house after this last party. Andrew and Carol's marriage is strained by the demands of her fame. Roger and Mary are recovering from a devastating personal tragedy only slowly revealed to the audience: the death of one of their children. A lonely Maggie is determined to persuade Peter they should be more than just friends, and Sarah's not as happy with her life as she appears.\nThe weekend does not go as planned. After a failed attempt to seduce Peter, Maggie receives a makeover from Carol and seduces Paul. Carol leaves Andrew and returns to America, and after a year of sobriety Andrew returns to the bottle. Roger and Mary reach an emotional breakthrough, share their grief and address her obsessive overprotection of their remaining child. Brian returns to his wife after realizing that Sarah is not interested in that which she already has, but only in that which belongs to someone else. In the climax of the film, Peter reveals the real reason for his bringing them all together: he is HIV-positive. The friends emerge from their own problems and pledge their assistance to Peter, and the weekend ends on a more upbeat note."}