{"mid": "PetualanganSherina", "IMDB_id": "tt0274716", "title": "Petualangan Sherina", "plot": "Sherina is a little girl who is smart, energetic, and loves to sing. She lives in Jakarta with her parents, Mr. and Mrs. Darmawan (Mathias Muchus and Ucy Nurul). However, Sherina has to leave her friends when her father accepts a job as an agronomist, at a plantation in Lembang owned by Ardiwilaga (Didi Petet). In her new environment, she quickly adapts and acquires some new friends. However, she becomes the target of the class bullies, consisting of a boy named Sadam (Derby Romero) and his two friends. They often bother children who are weaker. Sherina cannot accept such treatment and she gathers her classmates in a struggle against Sadam. When she accompanies his father to visit the plantation, she discovers that Sadam is Ardiwilaga's son.\nSherina and Sadam challenge each other to climb the nearby hills and, upon arriving, Sadam attempts to leave Sherina behind. She tries to find her way back to the plantation and stumble across an adult man. Together they go to a car where another man is waiting. As they gesture for Sherina to get into their car, Sherina hears Sadam's muffled voice from inside its boot telling her to get away. She escapes and, when the four kidnappers leave, she follows them. She discovers that they have been tasked with kidnapping Sadam by a cunning businessman named Kertarajasa (Djaduk Ferianto), who wishes to buy the plantation to complete their development project.\nWhen the kidnappers try to call Ardiwilaga, they reach his wife (Ratna Riantiarno) and tell her to prepare a 3 billion rupiah ransom. She agrees to this condition and convinces her husband to sell the land to Natasya (Henidar Amroe), who had offered them 2 billion the day before. Later, at the kidnappers' hideout, Sherina is able to rescue Sadam while the guards are sleeping. They take documentation connecting the thugs to Kertarajasa escape to a nearby observatory, where they spend the night. In Jakarta, Kertarajasa dances with his wife, revealed to be Natasya, and states that he will launch his project the following day once the plantation is legally his.\nIn the morning Sadam is desperately ill. Sherina tries to leave the observatory through the front door only to discover that it had been locked and the kidnappers were outside. With Sadam's help she rappels down the observatory wall and outruns two of the kidnappers, making her way to a nearby village and catching a ride to Ardiwilaga's home; Sadam, however, is captured. Sherina arrives just as he is preparing to sign the land deed over to Natasya and reveals Kertarajasa's plans. Police quickly arrest Natasya and Kertarajasa, and when the kidnappers try to collect their ransom they too are arrested. When Sherina and Sadam return to school after the holiday they are friends, and Sadam agrees to stop bullying his peers."}