{"mid": "Phantom2040", "IMDB_id": "tt0110825", "title": "Phantom 2040", "plot": "In the year 2040, environmental disasters and the economic Resource Wars of the early 21st century have decimated the fragile ecological balance of an Earth once teeming with life. Everywhere, the privileged and wealthy continue to thrive in expensive real estate developments that tower above the suffering masses. The victims of Earth’s misfortune have been forced to subsist on scavenged refuse from the past on the mangled streets of forlorn city-states.\nIn Metropia (once known as New York City), the largest and most powerful of the city-states, the powerful robotics manufacturing corporation Maximum Inc. has slowly shaped a cold, steely urban center, consisting of huge, residential towers intertwined with TubeTrain tunnels. Maximum's robotic \"biots\" (Biological Optical Transputer System) have replaced enormous amounts of human labour, and the corporation is illegally producing prohibited combat biots to form Maximum's private underground army. Under this guise of efficient progress, Maximum has own plans for the future, all known as the Maximum Era. Through the construction the fortress of Cyberville, an immense survival shelter where only the wealthiest and most elite humans will retreat, and the take over of Metropia by Maximum's biot armies, their plans all ultimately involve the dark path of decline and extinction as the culminating result of man's prior errors and efforts, once Earth finally succumbs to its slowly deteriorating state.\nThe only hope for the survival of humanity is the Ghost Jungle — thousands of square miles of mutated vegetation that may be the planet's salvation. This secret source of life is submerged beneath Metropia,unseen by most. College student Kit Walker Jr. is chosen by fate to save the world, donning the black mask and purple suit of his people’s savior, the 24th Phantom.\nThe role of the Phantom has been passed on from father to son since the 16th century, leading the world to believe that the Phantom is a single immortal individual. Kit, the 24th in the line, is young, unsure, and inexperienced, but he finds within him the courage and might to battle the evil that threatens to destroy the Earth."}