{"mid": "PhaseIv", "IMDB_id": "tt0070531", "title": "Phase IV", "plot": "Due to an unknown cosmic event, listed in \"phases\", ants have undergone rapid evolution and developed a hive mind. A scientific team begins investigating strange towers and geometrically perfect designs that ants have built in the desert. Except for one family, the local human population flees the strangely acting ants. Scientists James Lesko and Ernest Hubbs set up a computerized lab in a sealed dome located in an area of significant ant activity in Arizona. The ant colony and the scientific team, along with the holdout family, fight each other though the ants are the more effective aggressors.\nThe narrative uses the scientific team as the main protagonists, but there are also ant protagonists going about their duties in the colony. The ants immunize themselves to the humans' chemical weapons and soon infiltrate their lab. Teams of ants penetrate the computers of the lab and short them out. After Lesko decodes an ant message, Kendra Eldrige, (a young woman who had taken refuge with the scientists) becomes convinced that her actions have enraged the ants. Seeking to save the two scientists, she abandons the lab and apparently sacrifices herself.\nHubbs and Lesko begin to have different plans for dealing with the ants. While Lesko thinks he can communicate with the ants using messages written in mathematics, Hubbs plans to wipe out a hill he believes to be the ants' central hive. Delirious from a venomous ant sting, Hubbs can barely get his boots on but is determined to attack the hive and kill the ant queen. Instead, Hubbs literally falls into a trap – a deep pit that the ants fill with earth. Helpless to save Hubbs, and concluding that the ants will soon move into desert areas where their growth will exceed man's ability to control them, Lesko chooses to follow Hubbs's plan. He sets out to the hive with a canister of poison. Descending into the hive, Lesko hunts for the queen, but instead finds Kendra. The two embrace, and Lesko realizes that far from destroying the human race, the ants' plan is to change them and make them a part of the ants' world. In voice-over, Lesko states that he does not know what plans the ants have, but he is awaiting instruction. There is also an alternative ending with an elaborate Saul Bass-type montage of weird images."}