{"mid": "Phenomenon", "IMDB_id": "tt0117333", "title": "Phenomenon", "plot": "George Malley is a kind but average auto mechanic in a small town in Northern California. While celebrating his 37th birthday at a local bar with his best friend, Nate, and father figure, Doc Brunder, he steps outside while drunk. A ball of shining bright white lights moves around in the sky, grows closer and hits him in the head, making a loud sound and knocking him down. When he comes to and re-enters the bar, he learns that nobody else saw the lights nor did they hear the sound. Doc notices something is amiss when George quickly achieves a checkmate in their chess game.\nGeorge begins to exhibit remarkable levels of intelligence. He easily absorbs vast amounts of information, formulates new, revolutionary ideas, as well as developing psychokinesis. Not needing sleep, he spends each night reading multiple books.\nGeorge tries to use his new intelligence for the good of his community. He correctly predicts an earthquake without any equipment. When Doc is called to aid a sick Portuguese man, George learns the language in minutes and helps translate. He then uses his telekinesis to rescue the man's young relative. Visiting Nate, George decodes and responds to a signal on Nate's shortwave radio, though Nate asks him to forget about it out of fear that they might be picking up information from a nearby air force base.\nDuring this time of upheaval the townsfolk become wary, but George finds support from Doc, Nate and from a growing relationship with a single mother, Lace, and her children, Al and Glory. George also sets a plan in place to help Nate get together with the mother of the Portuguese boy he rescued.\nGeorge invites Lace to join him on a trip to UC Berkeley to meet with seismologist Professor Ringold about George's earthquake prediction. Instead, the FBI takes George and Nate into custody over his code-breaking. He breaks more codes, then astounds Dr. Nierdof by easily answering a series of difficult quizzes and exams. When George threatens to talk to the press, he is finally released.\nReturning to the local bar, George becomes frustrated with friends' questions about his abilities, and he causes a large mirror to break via telekinesis. Lace visits him to provide a shave and a haircut. Their innocent intimacy scares her since she has tried so hard to not like him, but it encourages him to stop avoiding the townsfolk. He goes to the county fair to ease fear with a demonstration of his powers, but the crowd goes into a frenzy, demanding his attention and his perceived healing powers. George is knocked to the ground, where he again sees the balls of light, before losing consciousness.\nGeorge awakens in a hospital. With Lace and Nate there for support, Doc explains that George has a deadly brain tumor. This has caused the lights and stimulated George's phenomenal brain functions. They have called Dr. Wellin, a leading brain surgeon, to see if an operation can save George's life. Dr. Wellin later determines there is only a 1 in 500 chance of survival, but wants to proceed with an invasive operation solely to do research on George's living brain. When George refuses, saying he still has work to do, the doctor has him declared mentally unfit and held against his will.\nGeorge escapes from the hospital and returns home. He spends time with Nate, then goes to Lace's to spend time with her and her children. The FBI agent shows up, but Lace persuades him to let George die in peace. George and Lace share a romantic and intimate time, but he informs her that he is about to die and she cries as she holds him.\nDr. Ringold arrives at Lace's house, only to learn that he is too late. Lace gives him George's research materials, so he can finish George's breakthrough work.\nA year later, George's friends are gathered for what would have been his 38th birthday. Nate, now fluent in Portuguese, is married to a visibly pregnant Ella. Other signs of George's phenomenal impact on the town and its people are seen all around."}