{"mid": "Phenomena", "IMDB_id": "tt0087909", "title": "Phenomena", "plot": "A lost tourist, Vera Grandt (Fiore Argento), is beheaded in the Swiss countryside. Her head is found by Inspector Rudolf Geiger (Patrick Bauchau) and his assistant, Kurt (Michele Soavi), who take it to entomologist John McGregor (Donald Pleasance). He estimates the time of death by examining the maggots.Jennifer Corvino (Jennifer Connelly), insect-loving daughter of a movie star, arrives at the Swiss Richard Wagner Academy for Girls, chaperoned by Frau Brückner (Daria Nicolodi), who places her with roommate Sophie (Federica Mastroianni). While sleepwalking, Jennifer witnesses a student being slain. She awakens and falls, ending up lost in the woods. She is discovered by Inga (Tanga), McGregor's chimpanzee attendant, and brought to him. He believes her to have a special gift for telepathy. Jennifer's memories of the murder she witnessed are vague, and a brain scan by the school doctor (Antonio Maimone) is not helpful in addressing her sleepwalking.After Sophie is killed, a firefly guides Jennifer to a maggot-covered glove. Back in the school, when the students taunt Jennifer for her connection to insects, she summons a swarm of flies to the school, which cover the whole building. In an attempt to find the killer, McGregor gives her a living specimen of the Great Sarcophagus fly, which is drawn to decaying human flesh. The fly leads her to the abandoned house where Vera Grandt was attacked, attracted by a severed hand.One night McGregor is murdered. Jennifer no longer wants to stay at the school, so she goes to stay at Frau Brückner's house. After numerous red herrings, Jennifer realizes that Frau Brückner has given her poisonous pills, and purges the pill out. Brückner locks her in a room, but Jennifer discovers a tunnel leading underneath the house to a dungeon. She is suddenly grabbed by Inspector Geiger, who has been chained up to the wall. Frightened, she backs away from his mutilated appearance and falls into a pool full of decaying, maggot infested bodies. With Geiger's help Jennifer escapes.In the basement, she finds Brückner's small son, Patua (Davide Marotta), with a hideously deformed face. He chases Jennifer onto a motorboat, but she manages to escape his attempts to kill her by summoning a swarm of flies to devour his face, leaving him drowning in the lake. On the shore, she is greeted by her father's assistant Morris Shapiro (Mario Donatone), who came to help after an earlier telephone call. He is immediately decapitated by a deranged Brückner, using a piece of sharpened sheet metal. In the final confrontation between Brückner and Jennifer, Brückner is suddenly attacked and killed by Inga with a straight razor."}