{"mid": "PickupOnSouthStreet", "IMDB_id": "tt0046187", "title": "Pickup on South Street", "plot": "On a crowded New York City subway train, pickpocket Skip McCoy (Richard Widmark) steals Candy's (Jean Peters) wallet. Unbeknownst to Skip or Candy, in the wallet is microfilm of top-secret government information. Candy was delivering an envelope as a final favor to her ex-boyfriend, Joey (Richard Kiley). Joey has told her that it contains stolen business secrets and she believed him, unaware that Joey is actually a communist spy.\nGovernment agent Zara (Willis Bouchey) had Candy under surveillance, hoping she would lead him to the top man in the spy ring. He seeks police help to identify the thief. Police Captain Dan Tiger (Murvyn Vye) has professional informant Moe Williams (Thelma Ritter) brought in. After they agree on a price, she gives him a list of eight names; Zara quickly identifies Skip from his mug shot. Zara tries to get Skip to give up the film, revealing its importance and appealing to his (non-existent) patriotism, but Skip denies everything.\nMeanwhile, Joey persuades a reluctant Candy to track down the thief using her underworld connections. The trail leads to Moe, who is delighted to be able to sell the same information a second time, knowing that her good friend Skip will not mind.\nCandy searches Skip's waterfront shack that night while he is out. When he returns, he spots her flashlight, sneaks in and knocks her out. When she comes to, she tries to get the film from him without success. The second time she visits, she is puzzled when he calls her a \"commie\" and demands $25,000 for the film. Despite his rough treatment, however, she finds herself falling in love with him. Skip thinks she is only acting.\nWhen she returns to Joey, his superior gives him a day to get the film back, and leaves him a gun. Candy finally realizes the truth. She turns to Moe for help, since Skip will not believe it if she tells him he is in danger. Moe tries, but fails, to convince Skip to give the film to the government. Moe goes home, and finds Joey waiting for her. Knowing that her strength is failing, and that she is dying, Moe refuses to reveal Skip's address for any amount of money, and taunts Joey with being a turncoat, and a rat until he shoots her dead.\nThe next morning, Skip returns home to find Candy there. She blames herself for Moe's death, but to her dismay, Skip is still willing to deal with Joey. When he starts to leave with the film, she knocks him out with a bottle and takes it to Zara and Tiger. Zara asks her to give Joey the film, so he can lead them to his boss. Candy does, but Joey notices that there is a frame missing. He beats Candy in an attempt to get Skip's address, then shoots her as she tries to leave. In her purse, Joey finds the address. Skip visits Candy in the hospital and comforts her.\nJoey and an associate go to the shack, but Skip hears them coming and hides underneath. When Joey is ordered to deliver the portion of film he does have, Skip follows him to a subway station. He watches as the film is exchanged in a restroom, then knocks out the ringleader and chases after and beats up Joey.\nLater, at the police station, Tiger predicts Skip will return to his criminal ways, but he and a recovered Candy depart to start a new life."}