{"mid": "PillowTalk", "IMDB_id": "tt0053172", "title": "Pillow Talk", "plot": "Jan Morrow is a successful, self-reliant interior decorator in New York City. She lives alone and claims to be quite happy, when questioned on that subject by her drunken housekeeper, Alma. The only irritant in her life is the party line that she shares with Brad Allen, a talented, creative Broadway composer and playboy who lives in a nearby apartment building. She is unable to obtain a private phone line because the telephone company has been overwhelmed by the recent demand for new phone lines in the area.\nJan and Brad, who have only ever \"met\" on the telephone, develop a feud over the use of the party line. Brad is constantly using the phone to chat with one young woman after another, singing to each of them an \"original\" love song supposedly written just for her, though he only changes the name or language he sings in. Jan and Brad bicker over the party line, with Brad suggesting that the single Jan is jealous of his popularity.\nOne of Jan's clients is millionaire Jonathan Forbes, who repeatedly throws himself at her to no avail. Unknown to Jan, Jonathan is Brad's old college buddy and current Broadway benefactor.\nOne evening in a nightclub, Brad finally sees Jan dancing and learns who she is. Attracted to her, he fakes a Texan accent and invents a new persona: Rex Stetson, wealthy Texas rancher. He succeeds in wooing Jan, and the pair begin seeing each other regularly. Jan cannot resist bragging about her new beau on the phone to Brad Allen, while Brad teases Jan by having \"Rex\" show an interest in traditionally effeminate things, thereby implying \"Rex's\" homosexuality.\nWhen Jonathan finds out about Brad's masquerade, he forces Brad to leave New York City and go to Jonathan's cabin in Connecticut to complete his new songs. Brad invites Jan to join him. Once there, romance blossoms until Jan stumbles upon a copy of \"Rex's\" sheet music. She plunks the melody on the nearby piano and recognizes Brad's song. She confronts Brad and ignores his attempts at explanation, returning to New York with Jonathan, who has just arrived at the cabin\nBack in New York, Jonathan is pleased to learn that the playboy has finally fallen in love, while conversely Jan will have nothing to do with Brad. Brad turns to Jan's housekeeper, Alma, for advice. Alma, pleased to finally meet Brad after listening in on the party line for so long, suggests he hire Jan to decorate his apartment so they will be forced to collaborate. Jan only concedes so that her employer will not lose the commission. Brad leaves all the design decisions up to Jan, telling her only to design a place that she'd want to live in herself.\nStill quite angry, Jan decorates Brad's apartment in the most gaudy and hideous decor she can muster. Horrified by what he finds, Brad angrily storms into Jan's apartment and carries her in her pajamas through the street back to his apartment to explain herself. He tells her of all the changes he's made to end his bachelor lifestyle because he thought they were getting married. Her face lights up and, as he leaves in anger, she uses one of his \"playboy\" remote control switches to lock the door. She flips the second switch and the player piano pounds out a honky-tonk version of Brad's standard love song. He turns around, their eyes meet and they lovingly embrace.\nAt the end of the film, Brad goes to tell Jonathan that he is going to be a father, only to be pulled by Dr. Maxwell (an obstetrician) and Nurse Resnick into their office for an examination, when he says that he’s going to have a baby (a reference to when he ducks into Dr. Maxwell's office in an earlier scene to hide from Jan, but escapes before they can examine him). During the end credits, four pillows appear on the screen — pink, blue, pink, and blue — signifying the children Brad and Jan have together."}