{"mid": "Pin", "IMDB_id": "tt0095871", "title": "Pin", "plot": "Dr. Frank Linden has a life-size, anatomically correct medical dummy in his office which he calls \"Pin\". Via ventriloquism, Dr. Linden uses Pin to teach his children, Leon and Ursula about bodily functions and how the body works in a way the children can relate to without it being awkward. Dr. Linden's interactions with the children are otherwise cold and emotionally distant, and his ventriloquism act is the only sign of a more warm and playful side to his nature. Unknown to Dr. Linden, Leon is mentally ill and has come to believe that Pin is alive. Due in part to his mother, who discourages Leon from playing outdoors or bringing anyone home, Leon has no real friends and sees Pin as the closest analogue. Leon is further traumatized when he secretly witnesses his father's nurse use Pin as a sex toy.\nWhen Leon turns eighteen, Dr. Linden, having come back to retrieve case studies for a speech, catches him having a conversation with Pin (via ventriloquism, which Leon had learned). Realizing the extent of Leon's psychosis and that his son is mentally ill, Dr. Linden takes Pin away to use as a visual aid for a speech with the intention of leaving Pin at the medical school. As Dr. and Mrs. Linden speed to the hall, they get into a car crash caused by either Dr. Linden's recklessness or Pin; the Lindens are both killed instantly. Later, as Ursula sits in the back of a police car, crying, Leon secretly retrieves Pin from the scene.\nLeon and Ursula, though grieving and orphaned, enjoy their newfound freedom until Mrs. Linden's sister, Aunt Dorothy, moves in. She encourages Ursula to take a job at the library, which Leon is against. Believing that she is influencing Ursula and after talking it over with Pin, Leon causes Aunt Dorothy to die from a heart attack by using Pin to frighten her. However, Ursula continues to work at the library, where she meets handsome athlete Stan Fraker and falls in love. Meanwhile, Leon takes his fixation with Pin to pathological extremes, first by dressing him in Dr. Linden's clothes and finally fitting him with latex skin and a wig.\nLeon believes that Stan is only interested in Ursula's inheritance and that he wants to put Leon in a sanitarium. He invites Stan over under the guise of discussing a surprise birthday party for Ursula. Leon drugs Stan's drink, and when Stan fights back, Leon bludgeons Stan with a wooden sculpture. Following Pin's instructions, he puts Stan in a bag and plans to dump him in the river. Leon is interrupted by a call from Ursula, who says she intends to come home early. Leon quickly hides Stan's body in a woodpile outside the house and cleans up the blood.\nTo calm her, Leon tells Ursula that Stan is visiting a sick friend out of town; she believes him until she discovers a gift she gave Stan and a wet spot on the carpet. When she confronts Leon, he blames it on Pin, which causes her to run out of the house in hysterics. Leon asks Pin why he would not help him. Pin states that he has never lied to or for him and that Leon's motives were selfish. Ursula returns with double-bit axe, which she raises ready to strike; the screen goes white as Leon screams and cowers.\nThe police find Stan's body; to their amazement, he is still alive. Some time later, Ursula and Stan return to the house to visit Pin. Ursula tells him that she's going on a trip with Stan. Pin inquires as to whether she's heard from Leon. Ursula replies \"No.\" Pin says that he misses him a great deal. Ursula agrees, it is revealed that she is talking to Leon, who has taken Pin's persona. When the dummy was destroyed, Leon had a psychotic break, which left only the Pin side of his personality to completely take over which also means that Leon has also become a real, life-size version of Pin."}