{"mid": "PinkyDinkyDoo", "IMDB_id": "tt0804425", "title": "Pinky Dinky Doo", "plot": "Pinky is a seven-year-old girl who lives in Great Big City with her parents, her four-year-old little brother, Tyler, and their pet, Mr. Guinea Pig. When a problem arises, Pinky says,\"That gives me an idea\" and Tyler says, \"Pinky, are you going to make up a story?\" and Pinky will say, \"Yeserooni positooni!\" and dances her way to a cardboard box called her Story Box with Tyler and Mr. Guinea Pig and uses a piece of chalk and her imagination to tell a story. During the made-up story, Pinky must Think Big, at which point her head swells up like a balloon and she comes up with an often wacky solution to the problem while singing \"If I have a problem and don't know which way to go, I think and think and think and think and suddenly I know!\". In \"Tyler Dinky Doo to the Rescue,\" \"Two Wheel Dreams\", Tyler's Big Idea(Grand Finale)\" and \"Go to Bed, Tyler!\", Tyler does the thinking. In \"Shrinky Pinky\", it was Mr. Guinea Pig. In the second season, Pinky uses the Story Pad, a notebook in which Pinky draws pictures for her newer made-up stories, whenever the Story Box is not available.\nThis show helps viewers increase their vocabularies with its Great Big Fancy Word, which is featured several times during the episode. It also addresses problem-solving skills as well as the basics of narrative stories—character, dialogue, plot, details, main idea and sequence of events. After Pinky tells her story and solves the problem of the day, kids are invited to play an interactive game on the Cheese Sandwich toy, where they review details about the story. At the end of each episode, Pinky says, \"I love to make up stories. I'll bet you can make up a story too.\" In each episode, there is also a \"Great Big Fancy Word\", which varies with each episode, but when somebody is about to say the word, Mr. Guinea Pig will blow a trumpet and then the character says the word.\nThis series was created by Jim Jinkins, who originally made up Pinky's adventures as bedtime tales for his children. The Executive Producers are Jinkins and David Campbell. It is a production of Sesame Workshop, Cartoon Pizza, Keyframe Digital Prod. Inc, and Abrams Gentile Entertainment. According to Nick Jr., Pinky Dinky Doo is the network’s second series (first original series) dedicated to enhancing early literacy.\nThe original American version was initially shown on CBeebies in the UK, but more recently the show has been redubbed and broadcast with British English accents. There is also a Spanish version on Univision.\nIn 2016, it was rerun on HBO on HBO Family"}