{"mid": "PlanesTrainsAndAutomobiles", "IMDB_id": "tt0093748", "title": "Planes, Trains & Automobiles", "plot": "Neal Page is an advertising executive on a business trip in New York City trying to return to his family in Chicago for Thanksgiving. After a meeting ends without a decision, Neal attempts to hail a cab. Del Griffith, a traveling salesman who sells shower curtain rings, has unknowingly taken a taxi that Neal bought from an attorney. The two meet again at La Guardia Airport where they board a plane to O'Hare. Their plane is diverted to Wichita due to a blizzard in Chicago.\nThe pair resort to various means to try and reach Chicago, but one attempt after another is defeated. Forced to share a room in a cheap motel on the first night, Neal loses his temper with Del and lambastes him. In response, Del admits that he regards Neal as a cold cynic and says that despite how Neal feels, he likes himself and his wife and customers like him. Neal calms down and the two men go to sleep. During the night their cash is stolen by a burglar.\nThe following day they attempt to reach Chicago by train, but the locomotive breaks down, leaving the passengers stranded in a Missouri field. After reaching Jefferson City, Del sells his remaining shower curtain rings to buy bus tickets, but neglects to tell Neal that they are only valid to St. Louis. Upon arrival, Neal again offends Del over lunch and the two part ways. Neal attempts to rent a car, but finds the space at the distant rental lot empty. After walking back to the airport terminal, Neal vents his anger at the rental agent to no avail. In desperation, he attempts to hail a taxi to Chicago, but insults the dispatcher, who then attacks Neal. Del arrives in time to rescue Neal with his own rental car. While driving, they find themselves arguing again. The situation is made worse when Del nearly gets them killed on a freeway after driving in the wrong direction, and driving between two semi-trailer trucks. While they take a moment to compose themselves by the side of the road, Del's carelessly discarded cigarette sets fire to the rental car. Neal initially gloats over Del's predicament, thinking that he is liable for the damage to the car. Neal's amusement turns to anger when Del reveals he used Neal's credit card to rent the car after their cards were accidentally switched.\nWith his credit cards destroyed in the car fire, Neal sells his designer watch to a motel clerk to pay for a room for himself. Del is broke and attempts to sleep in the car, which has lost its roof in the fire. Neal eventually feels sympathy for Del and invites him in from the cold and snowy night. Neal relaxes as the two consume Del's collection of airline liquors and laugh about the events of the past two days. The pair resume driving to Chicago the next morning, but their badly damaged car is impounded by the police. They finally make it to Chicago, two days late, in the back of a refrigerator truck.\nThey part ways at the LaSalle/Van Buren CTA station. While riding the train, Neal remembers some of the cryptic comments Del made about his wife during the journey and realizes that Del may be alone for the holiday. He returns to the station, sees Del sitting by himself and asks why he has not gone home. Del reveals that he does not have a home; his wife died eight years earlier. Neal returns home to his family and introduces them to Del, whom he has invited to Thanksgiving."}