{"mid": "PlayDirty", "IMDB_id": "tt0063443", "title": "Play Dirty", "plot": "During the North African Campaign in World War II, Captain Douglas (Caine) is a British Petroleum employee seconded to the Royal Engineers to oversee incoming fuel supplies for the British 8th Army. Colonel Masters (Green) commands a special raiding unit composed of convicted criminals, and after a string of failures he is told by his commander, Brigadier Blore (Andrews), that he must have a regular officer to lead a dangerous last chance mission to destroy an Afrika Korps fuel depot, lest his unit be disbanded. Despite Douglas' objections, he is chosen for his knowledge of oil pipelines and infrastructure. Douglas is then introduced to Cyril Leech (Davenport), a convicted criminal rescued from prison to lead Masters' operations in the field.\nThe next day, Douglas and Leech are provided with armed jeeps and lead six other men out into the desert disguised as an Italian Army patrol. They endure a long and arduous trek across the desert: encountering enemy tribesmen, sandstorms, and a booby-trapped oasis, among other dangers. While Leech and his men are often insubordinate towards Douglas' command, they eventually reach their objective, only to discover that the depot is fake. They then head to a German-occupied port city hoping to steal a boat and escape; Douglas sees the fuel depot there and convinces Leech that destroying it would aid their plan. Meanwhile, Masters is confronted by Blore with aerial photographs of the (supposed) depot intact — confirming the mission's failure. Having lost contact with the men for some time, Masters is ordered to leak intel on the team to the Germans; the British Army is now on the offensive, and they wish to keep any enemy fuel depots intact for capture.\nUnder the cover of night, the men don German uniforms and sneak into the port depot to plant their explosives, but one of them sets off a trip flare and they are quickly surrounded; an officer on a loudspeaker calls each of them out by name, revealing Masters' betrayal. The men scatter as the depot is detonated; Leech and Douglas manage to slip away while the rest are caught and killed. After taking shelter, Leech admits to Douglas that he is being kept alive only because Masters is paying him £2000 for his safe return.\nThe 8th Army arrives the next morning; Douglas and Leech (still donning their German uniforms) decide to surrender to the British. Unfortunately, a trigger-happy British soldier opens fire — killing them before they have a chance to speak."}