{"mid": "PlayMistyForMe", "IMDB_id": "tt0067588", "title": "Play Misty for Me", "plot": "Dave Garver (Clint Eastwood) is a KRML radio disc jockey who broadcasts nightly from a studio in Carmel-by-the-Sea, California, often incorporating poetry into his program. He lives a rather freewheeling bachelor lifestyle. At his favorite bar, seemingly by chance, he encounters a woman named Evelyn Draper (Jessica Walter). Dave drives her home, where she reveals that their meeting was not accidental; she sought him out after hearing the bar mentioned on his radio show. He guesses correctly that she is the recurring caller who always requests the jazz standard \"Misty\". The two have sex.\nA casual relationship begins between Dave and Evelyn. But before long, Evelyn begins to display symptoms of borderline personality disorder. She shows up at Dave's house uninvited. She also follows Dave from his home to workplace at all hours of the day and night. Evelyn phones Dave all the time to demand that he keep her company and not leave her alone for a single minute. The final straw comes when Evelyn disrupts a business meeting, mistaking Dave's lunch companion (Irene Hervey)—a representative who has come to offer him a career opportunity—for his date.\nDespite his efforts to gradually and gently sever ties with Evelyn, her unbalanced feelings lead her to attempt suicide in his home by slashing her wrists. After Dave rejects her again, Evelyn breaks into his home where his housekeeper, Birdie (Clarice Taylor), finds her maniacally vandalizing his possessions. Evelyn stabs her with a knife and is subsequently committed to a psychiatric hospital.\nDuring Evelyn's incarceration, Dave rekindles a relationship with his ex-girlfriend, Tobie Williams (Donna Mills). A few months later, Evelyn again calls the studio to request \"Misty\". She tells Dave that she has been released from the mental hospital due to good behavior and is moving to Hawaii for a new job and to give herself a fresh start in life. She then quotes an Edgar Allan Poe poem, \"Annabel Lee\". That night, while Dave is asleep, she sneaks into his house and tries to kill him with a butcher knife. He fights her, she flees, at first he thinks this is just a dream until he notices knife marks on his pillow case and Dave subsequently contacts the police.\nDave tells Tobie about Evelyn and cautions her to stay away from him until the woman is caught. For her safety, she goes home. There, she meets with a girl who answered her ad for a roommate: Evelyn, using the alias Annabel. Tobie eventually realizes that Annabel is Evelyn when she sees the fresh scars on Evelyn's wrists, but before Tobie can escape, Evelyn takes her hostage. Evelyn also murders McCallum (John Larch), a police detective who had come to check on Tobie.\nAt the radio station, Dave makes the connection between Tobie's roommate and the quote from \"Annabel Lee\". When he calls Tobie to warn her, Evelyn answers and says Tobie and she are waiting for him. Dave switches from a live show to taped music and rushes to the house, where he finds Tobie bound and gagged. Evelyn attacks again with the butcher knife, slashing Dave multiple times. He punches Evelyn, knocking her through the window and over a railing and she falls down the cliff onto the rocky ocean shore below. Dave and Tobie look down at Evelyn's dead body as Dave's voice on the taped radio show dedicates \"Misty\" to Evelyn one final time."}