{"mid": "PlayItAgainSam", "IMDB_id": "tt0069097", "title": "Play It Again, Sam", "plot": "Set in San Francisco, the film begins with the closing scenes of Casablanca, with Humphrey Bogart and Ingrid Bergman. We then see that the main character, Allan Felix (Woody Allen), is watching the film in a cinema, mouth agape. He leaves the cinema regretting that he will never be like Rick.\nApart from apparitions of Bogart he also has frequent flashbacks of conversations with his ex-wife, who constantly mocked his sexual inadequacy.\nAllan Felix has just been through a messy divorce. His best friend, Dick Christie (Tony Roberts), and Dick's wife, Linda (Diane Keaton), try to convince him to go out with women again, setting him up on a series of blind dates, all of which turn out badly. Throughout the film, he is seen receiving dating advice from the ghost of Humphrey Bogart (played by Jerry Lacy), who is visible and audible only to Allan. Allan's ex-wife Nancy (Susan Anspach) also makes fantasy appearances, as he imagines conversations with her about the breakdown of their marriage. On one occasion, the fantasy seems to run out of control, with both Bogart and Nancy appearing.\nWhen it comes to women, he attempts to become sexy and sophisticated, in particular he tries to be like his idol, Bogart, only to end up ruining his chances by being too clumsy. Eventually, he develops feelings for Linda, around whom he feels relatively at ease and does not feel the need to put on the mask.\nAt the point where he finally makes his move on Linda (aided by comments from Bogart) a vision of his ex-wife appears and shoots Bogart, leaving him without advice. He then makes an awkward move. Linda runs off but returns, realizing that Allan loves her. The song \"As Time Goes By\" plays as they kiss, with flashes from Casablanca.\nHowever, their relationship is doomed, just as it was for Rick and Ilsa in Casablanca.\nDick comes home early from Cleveland and confides to Allan that he thinks Linda is having an affair, not realizing that her affair is with Allan. Dick expresses to Allan his love for Linda.\nThe ending is an allusion to Casablanca's famous ending. Dick is catching a flight to Cleveland, Linda is after him, and Allan is chasing Linda. The fog, the aircraft engine start-ups, the trenchcoats, and the dialogue are all reminiscent of the film, as Allan nobly explains to Linda why she has to go with her husband, rather than stay behind with him.\nAllan quotes a closing line from Casablanca, saying, \"If that plane leaves the ground and you're not on it, you'll regret it; maybe not today, maybe not tomorrow, but soon, and for the rest of your life.\" \"That is beautiful\", Linda says, causing Allan to admit, \"It's from Casablanca. ... I've waited my whole life to say it!\" His journey is complete. The music from the scene in Casablanca resumes the theme \"As Time Goes By\", and the film ends."}