{"mid": "Pocahontas", "IMDB_id": "tt0114148", "title": "Pocahontas", "plot": "In 1607, the Susan Constant sails to the New World from London, carrying English settlers. On board are Captain John Smith and the voyage's leader Governor Ratcliffe, who seeks gold to bring him wealth and status. Along the way, the Susan Constant is caught in a North Atlantic storm, and Smith saves a young, inexperienced crewmate named Thomas from drowning. In the Powhatan tribe in Virginia, Pocahontas, the daughter of Chief Powhatan, fears being possibly wed to Kocoum, a brave warrior whom she sees as too serious for her own free-spirited personality. Powhatan gives Pocahontas her mother's necklace as a present. Pocahontas, along with her friends, the raccoon Meeko and hummingbird Flit, visit Grandmother Willow, a spiritual talking willow tree, and speaks of a dream involving a spinning arrow, and her confusion regarding what her path in life should be. Grandmother Willow then alerts Pocahontas to the arriving English.\nRatcliffe has Jamestown built in a wooded clearing and immediately has the crewmen dig for gold. Smith departs to explore the wilderness and encounters Pocahontas. They quickly bond, fascinated by each other's worlds and develop a relationship, despite Powhatan's orders to keep away from the English after Kocoum and other warriors engage them in a fight. Meanwhile, Meeko meets Percy, Ratcliffe's dog, and becomes the bane of his existence. Pocahontas introduces Smith to Grandmother Willow and avoids two other crewmen, but Pocahontas's best friend Nakoma discovers her relationship with Smith and warns Kocoum. Later, Smith and Pocahontas meet with Grandmother Willow and plan to bring peace between the colonists and the tribe. Smith and Pocahontas kiss, while Kocoum and Thomas witness from afar. Enraged, Kocoum attacks and attempts to kill Smith, but Thomas intervenes and kills Kocoum. Smith commands Thomas to leave just before the tribesmen come and capture Smith while Kocoum's body is taken away. Enraged, Powhatan declares war on the English, beginning with Smith's execution at sunrise. Pocahontas tries to convince her father otherwise, but the chief refuses to listen, as he is very angry with Pocahontas for disobeying his orders to remain in the village.\nThomas warns the crewmen of Smith's capture, while Ratcliffe rallies his men to battle, using this as an excuse to annihilate the tribe and find their non-existent gold. A desperate Pocahontas visits Grandmother Willow, where Meeko hands her Smith's compass. Pocahontas realizes Smith's compass was the spinning arrow from her real life encounter, which leads her to her destiny. Just as Powhatan is about to kill Smith, Pocahontas stops him and convinces her father to end the fighting between the two groups. Both parties accept gracefully, except Ratcliffe, who tries to kill Chief Powhatan in anger, but wounds Smith instead when he protects the chief. Ratcliffe is then arrested by his crewmen. In the end, Smith is forced to return home to receive medical treatment, while Ratcliffe is also sent back to England to face justice for his crimes. He asks Pocahontas to come with him, but she chooses to stay with her tribe. Meeko and Percy, now friends, give Pocahontas her mother's necklace completely fixed. Smith leaves without Pocahontas and Powhatan's blessing to return in the future."}