{"mid": "PointBlank", "IMDB_id": "tt0062138", "title": "Point Blank", "plot": "Walker works with his friend Mal Reese to steal a large amount of cash from a courier transporting funds for a major gambling operation, with the deserted Alcatraz Island as a drop point. Reese then double-crosses Walker and shoots him, leaving him for dead. Reese also makes off with Walker's wife, Lynne.\nWalker recovers. With assistance from the mysterious Yost, who seems to know everything about everybody, Walker sets out to find Reese, take his revenge, and recover the $93,000 he is owed. Reese used all of the money from the job to pay back a debt to a crime syndicate called \"The Organization\" and get back in its good graces.\nWith memories of happy times together, Walker goes to Los Angeles to pay back his wife and his best friend for their treachery. He bursts in on Lynne and riddles her bed with bullets, just in case Reese is in it. A distraught Lynne tells him she no longer wants to live, then takes an overdose of pills.\nWalker is told that a car dealer named Stegman might know where Reese can be found. He takes Stegman for a wild ride in one of his new cars, smashing the car and terrorizing him until Stegman reveals where Reese is living. He is told that Reese has now taken up with Walker's sister-in-law, Chris.\nBreaking in on Chris, he learns that she actually despises Reese and had considered Walker the best thing ever to happen to her sister. Willing to help in any way, Chris agrees to a sexual tryst with Reese inside his heavily guarded penthouse apartment just so she can gain access and unbolt a door for Walker. Walker ties up some men in an apartment across from the penthouse and has a call made to police to report a robbery, creating a diversion that enables him to slip into the penthouse.\nWith a gun to Reese's head, Walker persuades him to give up the names of his Organization superiors – Carter, Brewster, and Fairfax – so he can make somebody pay back his $93,000. He then forces a naked Reese off the balcony and watches him plunge to his death.\nAfter next confronting Carter for his money, Walker is set up. A hit man with a high-powered rifle is assigned to kill him at a money-drop in a storm-drain river bed. Walker sees to it that Carter and Stegman are the ones who get shot.\nYost takes him to a home belonging to Brewster. Walker visits Chris in her apartment, which has been trashed by The Organization. He brings her with him to the home belonging to Brewster, claiming she will be safer with him than by herself. Walker waits for Brewster to return there. Angry at Walker's apparent disinterest in her, Chris slaps and punches him as he regards her impassively, not defending himself. Then they make love. The following morning, Brewster comes home and is ambushed by Walker, who demands his money. Brewster insists that no one will pay. Walker forces Brewster to make a phone call to The Organization to get his money. Brewster speaks with a Mr. Fairfax, telling him that if they do not pay the money, he is going to be shot. Fairfax refuses to pay, though, saying, \"Threatening phone calls don't impress me.\" Walker then shoots the phone. Brewster says that they can still get him the money in San Francisco through \"The Alcatraz Run\" in which large sums of money change hands. \"The drop has changed, but the run is still the same,\" explains Brewster.\nThey travel to Fort Point in San Francisco. Walker does not trust him and refuses to show himself. Brewster receives the money by a courier in a helicopter. The hit man is also in the darkness with his rifle. He shoots Brewster, who falls to the ground thinking Walker shot him. Yost emerges from the shadows, telling him that it was not Walker who shot him. Brewster calls out to Walker, \"This is Fairfax, Walker! Kill him!\"\nYost/Fairfax thanks Walker (who is still hiding in the darkness) for eliminating his dangerous underlings, telling him: \"Our deal's done, Walker. Brewster was the last one.\" He then offers him an enforcer job, claiming he has looked for a man like him for years. Walker remains silent and does not bother collecting the money. Yost/Fairfax and the hit man leave."}