{"mid": "PointOfOrder", "IMDB_id": "tt0058481", "title": "Point of Order!", "plot": "The film uses selections from the hearings to show the overall development of the trial, beginning with introductions from several main participants, such as Joseph N. Welch and McCarthy. Each participant is shown in a still image with a brief audio recording, except for McCarthy, who is introduced with longer footage of a speech he made during the hearings.\nIn a sequence titled \"Charge and Countercharge\", Senator Stuart Symington summarizes the principle charge and counter-charge of the case. This sequence includes questioning of Roy Cohn for allegedly threatening to \"wreck the army\" if David Schine were not made a general, a statement Cohn denies. The film follows with a scene in which the Army counsel questions the origin of a photograph of that shows Schine in a meeting with Secretary of the Army Robert T. Stevens; the photograph is shown to be cropped to suggest a closer relationship between Schine and Stevens, but McCarthy's counsel denies any knowledge of photographic alteration.\nA sequence titled \"The Accusation\" shows McCarthy accusing a member of Welch's law firm of membership in the National Lawyer's Guild, which McCarthy and others accused of serving the interests of the Communist Party USA. The sequence includes a frequently quoted exchange from the hearings: Welch asks McCarthy, \"Have you no sense of decency, sir, at long last? Have you left no sense of decency?\"\nThe film ends with a heated exchange between Symington and McCarthy that occurred when the hearings were about to adjourn for the day. Symington sharply questions the handling of McCarthy's secret files by his staff. McCarthy calls this a \"smear\" against the men on his staff, and as Symington starts to leave, McCarthy accuses him of using \"the same tactics that the Communist Party has used for too long.\" Symington returns to the microphone and says: \"Apparently every time anybody says anything against anybody working for Senator McCarthy, he is declaring them and accusing them of being Communists!\" Symington leaves and the hearings adjourn. McCarthy continues his passionate but repetitious defense of his staff and his attack on Symington, speaking to an increasingly empty chamber. Although this is the finale of the film, this exchange actually occurred in the middle of the hearings. The actual end to the hearings, in which McCarthy was cleared of any wrongdoing, does not appear in the film."}