{"mid": "PoliceAcademy3BackInTraining", "IMDB_id": "tt0091777", "title": "Police Academy 3: Back in Training", "plot": "The film begins in a large garage structure, where Lt. Proctor (Lance Kinsey) and Commandant Mauser (Art Metrano) meet up with former cadets, (now Sgts.) Chad Copeland (Scott Thomson) and Kyle Blankes (Brant van Hoffman). It seems one of the two police academies is getting the axe due to the state government's unwillingness to continue financing two academies, and Mauser wants Copeland and Blankes to make sure Lassard screws up. The men agree to the plan, knowing this may be their only chance at revenge at Lassard for (somewhat deservingly) graduating them at the bottom of their class. Afterwards, Mauser and Proctor find themselves and their car stuck inside the garage (as they were forewarned it was closing soon), but when they both get out to try to forcibly open the gate arm, the car falls out of park and starts rolling backwards down the ramp, while Proctor tries futilely to stop it.\nAfter the governor's speech in which he will appoint a committee to evaluate which of the two academies should remain open, Mauser starts getting an edge by kissing up to the governor (offering the committee an escort, showing governor pages of useful tactics, etc.). However, Sgt. Jones (Michael Winslow) quickly and discreetly humiliates Mauser with his unintelligible moaning and noises that sound like belching, prompting Chief Hurst to reprimand him for his behavior. Commandant Lassard (George Gaynes) gets an idea on how to win: along with now Sgt. Jones and Lt. Callahan (Leslie Easterbrook), he calls back Sgt. Mahoney (Steve Guttenberg), Sgt. Hooks (Marion Ramsey), Sgt. Hightower (Bubba Smith), and Sgt. Tackleberry (David Graf) to help train the new recruits. Among the new recruits are Sgt. Fackler's wife (Debralee Scott), whom Sgt. Fackler is against being trained to be a police officer (mirroring her feelings and actions from the first movie), Sweetchuck (Tim Kazurinsky) and Zed (Bobcat Goldthwait) (who have history from the second movie as a meek small business owner being harassed by a gang, led by Zed, who ran the block his business was on), Karen Adams (Shawn Weatherly), and Tackleberry's brother-in-law Bud Kirkland (Andrew Paris). Tomoko Nogata (Brian Tochi) is at first a recruit of Mauser's academy, but Mauser transfers him in with Lassard's academy instead in hopes of sabotaging the latters' academy further.\nAfter a few weeks of training, Nogata is lovestruck over Callahan, and Sweetchuck contemplates quitting after Zed, whom he was forced to room with, drives him crazy (but Tackleberry talks him out of it and takes him under his wing). Copeland and Blankes make the recruits do things that would make the committee think they are incompetent. Mauser wants them out on the field soon, knowing the committee will be there. The recruits fail and are teased by Mauser and Proctor. However, Mahoney gets back at them by taping Mauser's eyes closed while doing a taste test. Proctor succeeds in removing the tape, but the tape pulls off Mauser's eyebrows.\nBoth Lassard and Mahoney give a pep talk to each of the cadets before training resumes. At the policepersons' ball, Mahoney meets up with his hooker friend from the first film (Georgina Spelvin), and has her do a favor on Proctor after the latter insults Mahoney and Adams. The hooker tricks Proctor into removing all his clothes and then locking him out of the hotel room (much to the dismay of onlookers). He goes out and steals a car and drives to the academy. The car runs out of gas, however, and Proctor enters a building, which to his horror turns out to be the Blue Oyster Bar. Meanwhile, Mauser insults Lassard in front of the recruits by telling him that he is winning (after he pestered Hurst so much that Hurst made him believe he was winning), so Mahoney gets him back by giving a speech at the ball and then putting the microphone in a pitcher of water. When Mauser grabs it, the microphone shocks him.\nOn the final day of the cadet training/evaluation competition, one recruit from each academy attends the governor's ball (Proctor misunderstands and sends in two, one of whom is portrayed by David James Elliott). Copeland and Blankes play with the computer system and send cars to the wrong locations, but are quickly caught by Hooks, who punches them out cold. At the governor's party, a gang of thieves dressed as busboys start robbing the guests and take the governor hostage. The most effective academy is proven when Mauser's cadets promptly faint upon being threatened by the thieves. Lassard's cadet Hedges (David Huband) manages to sound the alarm, prompting Mahoney and the gang to rescue the governor. Mauser and Proctor prove to be too overconfident and ineffective to react to the emergency, but Lassard's squad arrives just in time to fight off the thieves and rescue the governor.\nAs a result of the governor's final judgment, Lassard's academy stays open, and the epilogue shows Lassard delivering a speech on how the academy is grateful for the \"many, many\" recruits. The graduating class salutes the camera as the film ends."}