{"mid": "PoliceAcademy", "IMDB_id": "tt0087928", "title": "Police Academy", "plot": "Due to a shortage of police officers, the newly elected mayor of an unnamed American city has announced a policy requiring the police department to accept all willing recruits, effectively abolishing fitness requirements, educational levels, and medical standards. Not everyone in the police force is happy about the new changes.\nCarey Mahoney (Steve Guttenberg) is an easy-going man who has repeatedly gotten himself in trouble with the law when standing up to arrogant people. Mahoney is forced to join the police force as an alternative to jail, a proposal by Captain Reed who has been lenient on Mahoney because of knowing his father, who was also a policeman. Mahoney reluctantly agrees to this, deciding that he will get himself thrown out as a loophole. However, the chief of police, Henry Hurst (George R. Robertson), outraged by the Mayor's lowered requirements, decides that the new cadets should be forced to quit rather than being thrown out.\nLieutenant Thaddeus Harris (G.W. Bailey), who trains the cadets, agrees with the plan and employs tactics to make their lives as miserable as possible so that they do in fact quit. However, Commandant Lassard (George Gaynes) is the only one who doesn't agree with both Harris and Hurst's schemes. He wants to give the new cadets a chance. Harris is also implied to be seeking Lassard's place as the leader of the academy. Harris asks for the help of two cadets he takes a liking to, Copeland (Scott Thomson) and Blankes, to inform him of any improper conduct done by the other cadets. Harris appoints them as squad leaders to help him force these cadets to quit.\nMahoney tries several schemes to get thrown out but eventually he has a change of heart and decides to stay for good, having fallen in love with another cadet, Karen Thompson (Kim Cattrall). While in the academy, Mahoney becomes friends with fellow cadets Larvell Jones (Michael Winslow) a human beatbox and sound effects man who was arrested with Mahoney before they came to the academy (Mahoney pulled some strings with Reed to let Jones go with Mahoney to attend the academy); George Martin (Andrew Rubin), a ladies man; Eugene Tackleberry (David Graf), a gun-obsessed adrenaline junkie who was an ex-security guard and was a military veteran; Leslie Barbara (Donovan Scott), an overweight cowardly man; and Moses Hightower (Bubba Smith), a giant of a man with incredible strength.\nAt Lt. Harris' request, Blankes and Copeland try to learn where a weekend party, organized by Mahoney, is going to be held, to investigate it for any cadet unlawful behavior. Wary that they're using an intimidated Barbara to force him to reveal where the party is, Mahoney tricks Blankes and Copeland into attending a party at the Blue Oyster gay bar where the horrified men are intimidated into dancing the whole night. Mahoney's party turns out to be relatively sedate.\nAt night, Martin tries to sneak into the women's bunk for some fun, as he always does, but is caught by Sgt. Callahan. He is pulled into a room by Callahan and she throws him on the bed, pounces on him and they have sex. The next day, after a voice training exercise, Martin confides to Mahoney that he had fallen in love with Sgt. Callahan and that he speaks with a fake Spanish accent in order to get girls.\nMahoney helps Hightower prepare for a critical driving test. They go for a practice drive the night before the exam by stealing cadet Copeland's car. They are chased by the police for crashing into another car and speeding, but Hightower manages to escape and in the process greatly sharpens his driving skills. After he passes the driving test, Hightower is very thankful to Mahoney. Unfortunately, immediately afterwards, when Copeland racially insults fellow cadet Laverne Hooks (Marion Ramsey) for accidentally running over his feet during her driving test, Hightower is offended and lifts and overturns the police car in which Copeland is seated, despite Harris' demands and Hooks' pleas for him to stop. This leads Harris to promptly eject Hightower from the academy, much to Mahoney and many of the other cadets' dismay.\nShortly after this, Mahoney and Barbara are having lunch in the cafeteria and talking about Hightower's expulsion. Mahoney is finally fed up with the academy, but refuses to quit. Blankes and Copeland attempt to get Mahoney to fight them so they can give Harris a reason to expel him, but Mahoney resists. Having enough of their misconduct towards Mahoney, Barbara stands up for him and shocks everyone by throwing the first punch, hitting Copeland with a lunch tray. After watching Copeland faint, an offended Blankes punches Barbara back for foiling them, which promptly gets Mahoney involved in a brawl with him. After the fight, when Lt. Harris asks them who started it, Mahoney takes the blame for throwing the first punch to protect Barbara, which finally gives him the green light to expel his most despised cadet.\nBefore Mahoney actually leaves the premises, however, a major riot breaks out downtown, inadvertently caused by cadet Fackler who always attracts accidents to others around him. Mahoney decides to join the academy students in the mission to pacify it. The resulting police emergency forces the cadets into real action for the first time, and they are accidentally transported to the very epicenter of the rioting instead of the planned peripheral area (due to Lassard giving the wrong location). During the riot, one criminal manages to steal two police revolvers from Blankes and Copeland. The two run to hide from the criminals but, to their horror, end up at the Blue Oyster bar again. Barbara manages to avoid the rioters, but finds himself confronted by the same men who bullied him when he was working at a picture developing booth, who are now apparently stealing some furniture. Despite their attempts to bully him again, Barbara gives them a beating after having learned self-defense. Soon he orders the men to return the furniture and leave, only to learn that the men were actually moving their own things out due to the riots.\nThe outlaw with the stolen police handguns then proceeds to capture Harris in the confusion, taking the officer to the roof of a nearby building as a hostage. Mahoney attempts a rescue but is taken as a second hostage. Just as both are about to be killed, Hightower suddenly appears on the rooftop. The former cadet manages to fool the madman into thinking he is a fellow crook and demands that he kill Harris. When the criminal tries to pull the trigger, Hightower knocks him unconscious and he falls onto the stairs. When he wakes up to kill Hightower, Hooks quickly apprehends him by entering the back door to the building (which she attempted to tell Sgt. Callahan about earlier, but she couldn't hear her).\nMahoney and Hightower are both reinstated as cadets and graduate from the academy a few days later. For their rescue of Lt. Harris and capture of his kidnapper, they also receive the academy's highest commendation and medals. All of the cadets graduate with flying colors (minus Blankes and Copeland), finally winning a respectful salute from the reluctant Harris."}