{"mid": "PoltergeistIITheOtherSide", "IMDB_id": "tt0091778", "title": "Poltergeist II: The Other Side", "plot": "One year after the events of Poltergeist, Cuesta Verde, the Freelings' neighborhood from the first film, is being evacuated and turned into an archaeological paranormal dig centered around the spot where the Freelings' home stood before it imploded. The excavation leads to the discovery of an underground cave by a ground crew. Its existence is revealed to psychic Tangina Barrons (Zelda Rubinstein), who tells a friend of hers, Taylor (Will Sampson), a Native American shaman. After investigating the cave for himself, Taylor realizes that Rev. Henry Kane (Julian Beck), a deceased, insane preacher, has located Carol Anne and goes to defend her.\nThe Freeling family—Steven (Craig T. Nelson), Diane (JoBeth Williams), Robbie (Oliver Robins), and Carol Anne (Heather O'Rourke)—has relocated to Phoenix, Arizona and now live in a house with Diane's mother, \"Grandma Jess\" (Geraldine Fitzgerald). Having lost his real estate license, Steven is reduced to selling vacuum cleaners door-to-door while filing repeated insurance claims to cover the missing home. Grandma Jess is highly clairvoyant, and says that Diane and Carol Anne are clairvoyant as well. Grandma Jess later dies from natural causes, but not before telling Diane one last time that she'll always \"be there\" if she needs her.\nTaylor shows up as Kane begins his first assault on the home. Unable to get in through the television as the family has removed all television sets from the home, Kane's minions are forced to find another way in, this time through Carol Anne's toy telephone. The attack fails, and the family gets out of the house quickly. Taylor introduces himself and convinces them that running would be a waste of time since Kane would only find them again, and they return to the house, which Taylor has made safe for the time being.\nKane himself shows up at the home one day in human form and demands to be let in, but Steven stands up to him and refuses. Taylor congratulates him for resisting Kane, and then takes Steven to the desert and gives him the \"Power of Smoke\", a Native spirit that can repel Kane. Tangina shows up at the house and helps Diane to understand Kane's history and how he became the Beast that is now stalking the family. Reverend Henry Kane led his followers into the cave because he believed the end of the world was coming, then left them to die after the date he predicted came and went. Because he was so evil, Kane became a monster after death. Taylor warns the family that Kane is extremely clever and will try to tear them apart.\nOne night, Steven lets his guard down and gets drunk, swallowing a Mezcal worm that is possessed by Kane, who then temporarily possesses him. He attacks and tries to rape Diane, who cries out that she loves him. Steven then vomits up the worm possessed by Kane, which grows into a huge, tentacled monstrosity. In this form, Kane attacks Steven from the ceiling, but Steven uses the smoke spirit to send him away. The Beast then decides on another assault, and this time, the family decides to confront the Beast on his own turf, the Other Side.\nThe Freelings return to Cuesta Verde and enter the cavern below their former home, where Kane pulls Diane and Carol Anne over into the Other Side. Steven and Robbie jump in after them through a fire started by Taylor. On the Other Side, Steven, Diane, Robbie, and Carol Anne unite, but Kane (now a horrifying, gigantic monster) grabs Carol Anne. Taylor gets a charmed Native lance into Steven's hands, and Steven stabs Kane with it, defeating the monster and causing him to fall into the afterlife. Carol Anne nearly crosses over into the afterlife as well, but Grandma Jess' spirit appears and returns her to the family. The Freelings then return safely and thank Taylor and Tangina."}