{"mid": "Populaire", "IMDB_id": "tt2070776", "title": "Populaire", "plot": "Set in 1958–1959, Populaire focuses on Rose Pamphyle (Déborah François), who lives with her widowed father and is destined to marry a son of the local mechanic. Rose travels out of town and applies for a secretarial job with an insurance agency run by Louis Échard (Romain Duris). Louis learns that Rose can type with extraordinary speed -- using only two fingers -- and he tells her to compete in a speed-typing competition if she wants the job.\nWhile Rose makes the finals, she ultimately loses her first typing competition. Louis begins training Rose to become the fastest typist in the world. He makes a bet with his best friend, Bob Taylor -- who is married to his old sweetheart, Marie -- that Rose can win the regional competition.\nLouis begins to train Rose at his home, but he sets strict rules to prevent others from knowing that Rose is staying in his boyhood bedroom. He begins to teach her to type with all ten fingers and Louis insists she take piano lessons (taught by Marie) to strengthen her fingers. As she struggles to learn to type with ten fingers, Louis encourages her, colour-coding the keys on her typewriter and teaching her better posture. As the seasons change, she excels and Louis and Rose become close friends.\nRose wins her second typing competition, becoming the fastest in her home region of Lower Normandy. It becomes obvious to Louis' friends that Louis and Rose are romantically interested in each other, but Louis insists that a coach mustn't distract his student. They travel together to Paris and the night before the French national competition, Louis and Rose announce their love to one another and make love.\nCompeting against the current national champion, Rose makes it to the finals, but struggles under the pressure. Before her final match, Louis tells Rose that he had been lying and that he has secretly been recording that her typing speed is regularly faster than her opponent's best record. Angered by his lie, Rose is enraged into winning. Rose is ecstatic at winning and flashes Louis a big smile from on stage. After initially being elated, Louis begins to feel inadequate for somewhat ambiguous reasons. He abandons her and their training sessions.\nRose stays in Paris and becomes a French celebrity, endorsed by a major typing firm and begins using their newest typewriter. She never forgets Louis and calls him regularly, although Louis never answers the phone. Louis tries to move on, but is generally depressed and feels inadequate. Rose begins to move on and is soon in New York at the world typing competition.\nWhile Rose starts the world competition in New York, Louis struggles with his own feelings. He reaches out to Marie and asks why she chose Bob over him. She says she didn't: Louis chose to be second place. Louis explains that he could never give Rose the smile and happiness the she had when she won in Paris -- the same smile that he saw on Marie on her wedding day to Bob. Marie says, \"I was smiling because I felt loved.\"\nLouis realises he needs to overcome his own feelings of inadequacy and flies to New York to support Rose in the international typing competition. He arrives just before the second round of the finals ends. As the judges announce the results, Rose is behind and struggling. She runs back stage to fetch her old typewriter, and Louis confronts her and professes his love. They kiss.\nRose goes on stage for the last round - seemingly energised by love. She races ahead in the final match. About half way in, her typewriter jams. She is too fast for the typewriter. She quickly recovers and races ahead again, winning the competition to be the World's Fastest Typist. Louis walks on stage and kisses her, ending the film on the two holding hands and the audience cheering."}