{"mid": "PorkysParty", "IMDB_id": "tt0030610", "title": "Porky's Party", "plot": "The cartoon begins with Porky Pig lighting candles on a birthday cake while singing and stuttering, 'Happy Birthday' to himself.\nPorky receives a package from his uncle Pinkus. Inside is a tiny silkworm. The silkworm knits garments whenever the word sew is spoken. Porky commands the worm to sew and it sews a sock as Porky and Black Fury look on in awe. Porky gives the command again. The worm sews a brassiere, which Porky disposes of bashfully.\nPorky and his dog Black Fury enter the bathroom, where Porky applies hair-growth formula on his own head, producing no results. Then, needing to get ready, Porky hurriedly leaves the bathroom. Black Fury takes the formula and seeing that it contains 99% alcohol, begins to drink it. He becomes shaggy after ingesting the formula. He becomes severely intoxicated, loudly shouting \"Happy Birthday!\"\nMeanwhile, Porky hears a knock at the door. It is his friend Penguin, who rushes in and begins wolfing down ice cream. Goosey saunters in and holds out his hand for Porky to shake. The hand is a prop, adorned with a sign reading \"Happy Birthday, Fat Boy!\". Porky chuckles at Goosey, stating \"He's so silly.\"\nPorky repeatedly stutters the word so, and the silkworm in Porky's pocket begins sewing garment after garment. As garments come from underneath Porky's jacket, he notices they are women's underwear and brassieres; he hides them guiltily. He tosses the silkworm away.\nThe silkworm lands on Penguin's ice cream, and continues sewing garments, which end up in the ice cream. Disgusted, Penguin pulls a sock out of his mouth. As he has difficulty swallowing, a top hat forms in his mouth. The hat pops up, and Penguin's head assumes the shape of it. Failing to quell the hat, Penguin shouts for Goosey's help, who rams Penguin's head into the wall, hits him with a mallet, and slams a washtub over his head, to no avail.\nBlack Fury, looking shaggy, attempts to shave. After putting on the shaving cream, he starts the electric razor. The razor takes on the qualities of a snake, and attacks Black Fury. Porky mistakes Black Fury for a mad dog, and the party guests run around the house with Black Fury, not realizing that the \"rabid dog\" is actually Porky's pet.\nAfter several more antics, the shaving cream is removed, and Porky sees that it is just Black Fury. Penguin, angrily rolls up his \"sleeve\" and stares Black Fury down, uttering \"so...\" in anticipation of a fight. This sets off the silkworm, who wraps Penguin up into a state of mummification."}