{"mid": "PorkysIITheNextDay", "IMDB_id": "tt0086129", "title": "Porky's II: The Next Day", "plot": "Images from the first part of Porky.Edward \"Pee Wee\" Morris (Dan Monahan) wakes up shouting \"I've been laid!\" with joy. It's the following morning, after all the events in the first part. He increases the line in his maturity chart - the one he keeps under his mattress. His penis doesn't look as responsive as always, but he thinks it may be a resting time after the novelty of sex with a woman. His mother (Ilse Erl) enters his bedroom while he's got a boner - after watching toples women at  The National Geographic  magazine. Mrs Morris is dumbfolded when she looks at Pee Wee's chart.Back at Angel High School, Pee Wee brags about having Wendy Williams (Kaki Hunter) snatched from everybody else. His friends tease Pee Wee, saying that Wendy didn't think it was such a big thing. Wendy wants a better man - Wendy admits that it was all a prank planned by his friends: she really ended up satisfied.The Drama Club is producing a Shakespeare-based play for a theatre festival. All the boys in the festival are participating. Pee Wee interrupts a natural sciences lesson - the vivisected frogs are disgusting. Pee Wee is blamed for a joke which was not even his, but the science teacher (Howard Neu) tells him off. Pee Wee is jealous of Wendy, who is talked about a lot. She says that she's faithful, that people will talk about her without really knowing her, and that boys will always brag about things they haven't really done. Pee Wee tries to trust her, and says that he'll kick the ass of any boy who badmouths her from that moment on.Tommy Turner (Wyatt Knight), Tim Cavanaugh (Cyril O'Reilly), Billy McCarthy (Mark Herrier) and Anthony \"Meat\" Tuperello (Tony Ganios) are part of Pee Wee's gang. They are on friendly terms with new student Johnny Henry (Joseph Runningfox), who says hello to them. He'll participate in Shakespeare's play as well, alongside with Pee Wee and Tommy.Anthony has to dress up as a god fairy, which creates plenty of mockery around, especially with Pee Wee. Later, they disguise themselves to go to a carnival to see a well-endowed girl to dance something similar to the dance of the seven veils. The boys visit Gloria , and her MC (Peter Conrad). Pee Wee wants to get out on stage with his costume. He looks like a green Puck.Ms Beulah Balbricker (Nancy Parsons) and Reverend Bubba Flavel (Bill Wiley). Mrs Morris, Pee Wee's mother was the person responsible for the play. Mr. Floyd J. Carter (Eric Christmas) cannot stand up to Flavel's shouts and screams. They allege that Shakespeare is filth. Carter dismisses them after reading romantic passages from the Bible.Pee Wee finds another girl, and he takes her to the cemetery. He runs away. It's a prank - as Pee Wee shows himself stark naked. Laura gets undressed and wraps herself around Pee Wee. It looks like Laura is choking to death. Steve and Tommy say that Pee Wee is to blame for Laura's death. They can't call Ted (Art Hindle). Steve frightens Pee Wee, dressed as a zombie. So now, they accuse Pee Wee of killing two people; he runs butt naked. Ted and another cop see Pee Wee naked running on the road, but they don't stop to pick him up. They are dumb folded by Steve's disguise, but not afraid. He passes out.Somebody (Will Knickerbocker) has thrust a dummy against Johnny Henry, a Native American, kissing a white girl. The commissioners arrive; they are Hurley (Fred Buch), Couch (Richard Liberty) and Gebhardt (Edward Winter) will support the play, in spite of the racist comments.Balbricker sings and dances  Black Magic  while on the toilet, but the gang plays a prank on her. They open up the pipe and push a snake up. Balbricker runs in panic with her pants and panties down to the gym of the high school. All the school hears her screams and sees her. Later on, everybody panics, especially two cheerleaders (Francine Joyce and Wendy Becker) when they see the snake. Tommy says he's picked the snake and the coaches congratulate him for that.Carter interrupts rehearsals, when Johnny Henry was taking his role too realistically. Officially, the Shakespeare production is called off, but the classroom can rehearse as a private project classroom. One of them mentions that one of the commisoners exposed himself.Seward County Commissioner Gebhardt initially gestures Steve, Pee Wee, Wendy and the rest of the gang that Flavel's demands are ludicrous and unreasonable. The commissioners seem to think well of the production; Gebhardt praises them to fight for their ideals and for what they want. He tells them that he'll do a favour, in return of which he'll be offered another favour, and that's how things work, so they have nothing to worry about.John is beaten. The KKK opposes a Seminole character - his role is Romeo - to kiss a white girl - Wendy's role which is Juliet. A cross is burning next to him. 5,000 signatures are given to Geghardt against the play. Johnny's sword breaks and he has to pretend to keep on fighting with a broken sword in an absurd way. They give him the leg of a female mannequin.Flavel insists in shutting the production down. Anthony shows him his balls. Mrs Morris tells him that the gesture wasn't helpful. Gebhardt gestures for the gang to keep calm, but he finally betrays them. Gebhardt is a pervert who will go out with Wendy, who is 17 and therefore still a minor. Wendy wants revenge.At Seward court, in the basement, commissioners love silent black-and-white porn flicks. They make derogatory terms. Wendy prepares a punch which looks like vomit. She goes to La fontana di voglio, a fancy restaurant. He is friends with the maitre d' (Robin Paradise and Ted Richert)The KKK is led to talk to John. The gym is packed with Seminole Indians, and they want to shave the KKKmembers' heads. Wendy enters dressed and talking like a prostitute, shouting and making a big scandal out of it so that everybody looks at her - which everybody does. She jumps on top of him and tries to shag him there. She puts her boa on a gentleman (William Kerwin)'s head, and she sings that she's going on 17 that day, and that she was 14 when she first met him. Wendy will cry rape if he goes away: she says that she's pregnant of him.During Flavel's speech, he sees he KKK members stark naked. Then, the recording with the commisioners badmouthing Flavel and talking about the porn flick is played for everybody to hear. The public gets restless and Flavel loses it, swearing like a maniac to the press. Wendy gets drunk and drinks the gentleman's cup, and she repeats her date's name and position. Wendy vomits in a pool, and all the restaurant-goers leave. The gentleman even saw Wendy take out the vomit from one of her fake breasts. Pee Wee takes a picture of Gernhardt in the pool. They leave to the sound of  We're going to see the Wizard, the wonderful Wizard of Oz, because because because.... The news jumps to the newspapers and Gernhardt quits his post.The Shakesperean Festival is on again, announced on the first page. Johnny is a hero. Wendy and Pee Wee are together again. The KKK members try to discreetly leave. One of them is kicked in the head by sweet ladies with umbrellas. The restaurant will be no more. Flavel tries to strangle one of his old accomplices."}