{"mid": "Powder", "IMDB_id": "tt0114168", "title": "Powder", "plot": "Jeremy \"Powder\" Reed is an albino young man who has incredible intellect and is able to sense the thoughts of the people around him. Jeremy's brain possesses a powerful electromagnetic charge, which causes electrical objects to function abnormally when he is around them, particularly when he becomes emotional. The electrical charge also prevents hair from growing on his body.\nJeremy's mother was struck by lightning while pregnant with him; she died shortly after the strike, but Jeremy survived. His father disowned him shortly after his premature birth, and he was raised by his grandparents. Jeremy lived in the basement and worked on their farm, never leaving their property and learning everything he knew from books. He is taken from his home when his grandfather is found dead of natural causes. Jessie Caldwell (Mary Steenburgen), a child services psychologist, takes him to a boys' home because he is now effectively a ward of the state.\nJessie enrolls him in high school, where Jeremy meets physics teacher Donald Ripley. Donald finds out that Jeremy has supernatural powers as well as the highest IQ in the history of mankind. While his abilities mark him as special, they also make him an outcast.\nOn a hunting trip with his schoolmates, Jeremy is threatened with a gun by John Box (Bradford Tatum), an aggressive student who views him as a freak. Before John can fire, a gun goes off in the distance, and everyone rushes to see that Harley Duncan, a Sheriff's deputy, has shot a doe. Anguished by the animal's death, Jeremy touches the deer and Harley, inducing in Harley what the students assume is a seizure. However, Harley admits that Jeremy had actually caused him to feel the pain and fear of the dying deer. Because of the experience, Harley removes all of his guns from his house, although Sheriff Doug Barnum allows him to remain as a sheriff's deputy without a sidearm.\nDoug enlists Jeremy to help speak to his dying wife through telepathy. Through Jeremy, the sheriff learns that his wife clings onto life because she didn't want to leave without her wedding ring on her finger and without him reconciling with his estranged son, Steven. She tells him that Steven found the ring and that it has been sitting in a silver box on her nightstand the entire time. Doug then places the ring on his wife's finger and reconciles with Steven, letting his wife die peacefully.\nJeremy meets Lindsey Kelloway (Missy Crider), a romantic interest, but their relationship is broken by Lindsey's father. Before the interruption, he tells Lindsey that he can see the truth about people: that they are scared and feel disconnected from the rest of the world but in truth are all connected to everything that exists.\nJeremy goes back to the juvenile facility and packs away his belongings, planning to run away to his farm. He pauses in the gym to stare at a male student washing, noticing the latter's luxurious head of hair as well as body hair which he himself lacks, and is caught at it by John Box, who accuses him of homosexuality. John steals Jeremy's hat and taunts him, but Jeremy reveals that John's words mimic what his stepfather said before beating him when he was 12, infuriating him. John and the other boys humiliate Jeremy, stripping him naked and taunting him. His powers begin to manifest by pulling at their metal buttons and any piercings. Eventually, a large spherical electromagnetic pulse erupts throwing Jeremy into a mud puddle and everyone else to the ground. John is found still, with his heart stopped. Jeremy uses an electric shock to revive him.\nIn the final scene, Jeremy returns to the farm where he grew up, now in probate with the bank, and finds that all of his possessions have been removed. He is joined by Jessie, Donald, and Doug, who persuade Jeremy to come with them to find a place where he will not be feared and misunderstood. Instead, he runs into a field where a lightning bolt strikes him, and he disappears in a blinding flash of light, possibly transcending earthly limitations and becoming pure energy (as Donald alluded to in an earlier conversation). The electrical jolt hits Jessie, Donald and Doug."}