{"mid": "PracticalMagic", "IMDB_id": "tt0120791", "title": "Practical Magic", "plot": "Maria Owens, a young witch, is exiled to Maria's Island in Massachusetts with her unborn child for escaping her execution. When her lover does not come to rescue her, she desperately casts a spell upon herself to stop falling in love due to heartbreak, only to die soon after. The spell becomes a curse for several generations. 11-year-old twin sisters, Gillian and Sally Owens, two descendants of the Owens family, are taken in by their aunts Frances and Jet after the death of their parents. Sally is the more gifted of the two while Gillian's talents are more in charm and persuasion, and have been subject to ridicule during their youth. After witnessing their aunts cast a spell on a man for a woman who seems obsessed with having his love, Gillian decides to fall in love and Sally casts a true love spell to protect herself.\nThe sisters cast an oath to each other using blood from both of their hands and Gillian leaves for Los Angeles. Sally meets and marries Michael, a local apple salesman. They have two young daughters, Kylie and Antonia. One morning, after several blissful years of marriage, Sally hears the \"death-watch beetle\" and realizes that it is coming for her husband. Despite Sally tearing up the floor in an effort to find and kill the beetle, Michael is killed by a truck during his early morning routine of taking apples to the local farmers market. Sally and her daughters return to the Owens home to live with the aunts and realize that the aunts cast a spell so she could fall in love. Sally decides that she and her daughters will not perform magic. While Gillian begins a relationship with Jimmy Angelov in Orlando, Sally is devastated by her husband's death. Gillian feels that Sally needs her and drugs Jimmy to return to Massachusetts.\nGillian returns to Sally after Jimmy becomes abusive, but the sisters are kidnapped. Sally puts belladonna into Jimmy's tequila, inadvertently killing him. The sisters resurrect him using the forbidden spell from their aunts' book of spells, but Jimmy attempts to kill Gillian after being revived. Sally kills him again, and the sisters bury his remains in their home's garden. State investigator Gary Hallett arrives from Tucson, Arizona in search of Jimmy, who is also a serial killer. As Gary begins to suspect Sally, Gillian, Kylie and Antonia create a potion to banish Gary; however, the girls realize he is the one described in Sally's true love spell, and remove the potion. Later, Sally has Gary record her testimony and sees the letter she had once written Gillian, and realizes he must have read it more times than he had let on. Unable to deny their feelings for each other, they kiss and Sally realizes that he was there because of the spell she cast years earlier.\nSally discovers that Jimmy's spirit has possessed Gillian's body and Gary sees Jimmy's spirit emerge. Jimmy attempts to possess Gary, only to be hurt by his silver star-shaped badge and is temporarily exiled. Later, Sally tells Gary that he is there because of her spell and the feelings they have for each other are not real. Gary replies that curses are only true if one believes in them and reveals that he also wished for her, before returning to Tucson.\nJimmy possesses Gillian again and attempts to kill Sally before Frances and Jet return. Sally, realizing she must embrace magic to save her sister, asks the aid of the townswomen and they form a coven to exorcise Jimmy's spirit. Sally makes them stop when she sees that the effort might kill Gillian. Getting inside the circle, Sally and the townswomen reenact her oath with Gillian. They are able to break the Owens curse, exorcising Jimmy's spirit and allowing the coven to exile him permanently. Sally receives a letter from Gary telling her that she and her sister are cleared of any suspicion of wrongdoing in Jimmy's case and Gary returns to Massachusetts to be with Sally. The Owens women celebrate All Hallow's Eve dressed up in witch costumes, and are embraced and welcomed by the townsfolk."}