{"mid": "PrayersForBobby", "IMDB_id": "tt1073510", "title": "Prayers for Bobby", "plot": "Mary Griffith is a devout Christian who raises her children—Ed, Bobby, Joy and Nancy—according to the evangelical teachings of her local Presbyterian church in the late 1970s and early 1980s in Walnut Creek, California.\nEd finds Bobby resisting temptations to overdose on Aspirin as an initial suicide attempt before Bobby confides to him that he is gay. Life changes for the entire family after Mary learns about his secret. In hopes of converting him, she takes him to a psychiatrist, who explains to Bobby's parents that a person's homosexuality is the result of lacking a close relationship with parental figures. She then advises Bobby to pray harder and seek solace in Church activities, as well as to arrange a special bonding time with his father. While spending such quality time with his father, Bobby explains his desire to become a writer, to which his father suggests \"some dreams are just not realistic.\"\nBobby's father and siblings slowly come to terms with his homosexuality, but Mary believes God can cure him. Despite his mother's vulgarness, Bobby stays at his cousin Jeanette's house in Portland, Oregon; she has always been accepting of his sexual orientation and tries to help him realize that his mother will never change. Desperate for his mother's approval, he does what is asked of him, but through it all, the Church's disapproval of homosexuality and his mother's attempts to suppress his growing behaviors in public cause him to grow increasingly withdrawn and depressed.\nStricken with guilt, Bobby finds a boyfriend, David, at a gay bar. Nonetheless, before leaving the house with David, Mary informs Bobby that she \"will not have a gay son.\" After Bobby finds David betraying him for another boy, he continues to think of his mother's words of prejudice, i.e., when saying \"homosexuality is a sin and (gays) are doomed to spend eternity in hell,\" as well as calling him \"sick,\" \"perverted,\" and \"a danger to our children.\" Following his subsequent depression and self-loathing which intensifies, one night he free falls off a bridge on a highway into the path of an oncoming eighteen-wheeler truck, which kills him instantly. The family receives the news the following day and are devastated.\nFaced with their tragedy, Mary begins to question herself and her Church's interpretation of the Scripture. Through her long and emotional journey, Mary slowly reaches out to the gay community and discovers unexpected support from them. She becomes acquainted with a local reverend of the Metropolitan Community Church, who convinces her to attend a meeting of Parents, Families and Friends of Lesbians and Gays (PFLAG). It is there she recalls Bobby being different from conception and reassures herself that his true value was in his heart.\nMary then gives a speech in a Walnut Creek city council meeting supporting a local \"gay day\" live on television. She tells of her experiences with Bobby, the struggles she initially has coping with him coming out of the closet and her stubbornness to reevaluate her religious beliefs which were nothing more than \"bigotry\" and \"dehumanizing slander.\" Mary also acknowledges how she came to realize that Bobby's sexual orientation was quite natural in God's image and his suicide was subsequently due to poor parenting. She concludes her speech by urging people to think before they say, voice, or support homophobia because \"a child is listening.\" The measure is rejected, but Mary and her family travel to San Francisco with fellow PFLAG members and walk in a gay pride parade, during which she sees another young man just like Bobby observing the parade. She walks over and hugs him, finally coming to terms with her son's death and vowing to work hard for the rights of gays and lesbians."}