{"mid": "PreludeToWar", "IMDB_id": "tt0035209", "title": "Prelude to War", "plot": "In an edit added to the film before public release, a comment by Henry L. Stimson, the Secretary of War at the time, was quoted to create trust with the audience, “the purpose of these films is to give factual information as to the causes, the events leading up to our entry into the war and the principles for which we are fighting.”\nThe purpose of the OWI was to use mass communication to sell the war and to define Americans' perception of the reality of war; therefore, they released Prelude to War to further these goals. The film commences with an explanation of how Americans were brought into the war through heroic motives to protect countries unable to protect themselves. America had this duty to righteousness and Christian values throughout history, according to the values and beliefs set forth by the founding fathers.\nThe documentary makes use of compare and contrast methods throughout the film in order to transmit its heroic message. The primary images used within the film to portray the opponents of America are introduced by Henry Wallace as the “free world” — a brightly illuminated planet of the Allies, and a “slave world” as a planet deep in shadow of the Axis Powers.\nIt examines the differences between the U.S. and the fascist states of Benito Mussolini, Adolf Hitler and Yamamoto, portraying the latter countries working together as gangsters to conquer the world. In order to do this, Capra made use of footage from Triumph of the Will, but with different narration designed to support the Allied cause.\nIt is brought to the audience’s attention that after the Nazis smashed the opposing political parties and labor unions they turned their attention to their last remaining obstacle — the church. In one scene a stained glass window is shattered by several bricks to reveal a “Heil Hitler!” poster behind. To emphasize this depiction of Hitler as an antichrist figure, a class of German schoolchildren is shown singing to the song Frederick Rex:\nAdolf Hitler is our Saviour, our hero\nHe is the noblest being in the whole wide world.\nFor Hitler we live,\nFor Hitler we die.\nOur Hitler is our Lord\nWho rules a brave new world."}