{"mid": "Presto", "IMDB_id": "tt1245104", "title": "Presto", "plot": "Vaudeville-era magician Presto DiGiotagione is famous for a hat trick wherein he pulls his rabbit Alec Azam out of his top hat. A hungry and irritated Alec is locked in a cage, unable to reach his carrot. After Presto returns from eating a meal, he begins practicing his act with Alec, revealing that his top hat is magically connected to a wizard's hat kept backstage with Alec, so that when Presto reaches into the top hat, his hand appears out of the wizard's hat, allowing him to grab Alec and pull him out of the top hat. He intends to feed Alec the carrot, but realizes that he is late for the show and rushes off to the stage without doing so, much to Alec's chagrin. Presto tries to start the performance, but Alec becomes reluctant to cooperate until he is given the carrot. Presto then spends the rest of the show trying to catch Alec through the opening between his top hat and the wizard's hat.\nAlec cleverly turns the hat's magic against his master in multiple humiliating ways, each of which elicits increasing applause from the audience, who believe it is part of Presto's act. Presto's finger is stuck in a mouse trap and is hit in the face by an egg, caused by a backfired attempt to aggravate Alec. Presto responds by antagonizing Alec, turning the carrot into a flower. An unimpressed Alec sucks Presto's head into a ventilation pipe offstage, which spikes Presto's hair and turns his face red. When Presto lunges at Alec through the hat, Alec directs Presto's hand into the podium's drawer and closes the drawer, painfully restraining the hand while he looks through Presto's sleeve for the carrot. Presto runs toward Alec, but instead is poked in the eye by his own hand. Presto drops his hat, and when he grabs the wizard hat, he accidentally strips his slacks down to underwear, to Alec's amusement. Furious, Presto tries to attack Alec, but in an act to defend himself, Alec puts an offstage ladder into the wizard hat, and Presto is hit between his legs. Presto attempts to hit Alec with it, but it misses and hits a backstage door, and Presto ends up hitting his chin on the ladder. Presto antagonizes Alec again, covering the carrot with a cloth before smashing it into a pulp with a piece of the ladder. Alec then furiously retaliates by aiming the opening of the wizard's hat towards an electrical socket which Presto's fingers go into, shocking Presto into dancing wildly to bluegrass music.\nNow at his wit's end, Presto storms backstage to catch Alec, but he accidentally releases a weight holding down some stage props, and his foot gets caught in a rope that lifts him up to the fly space above the stage. When his foot comes loose from the rope, he falls, along with suspended scenery. Alec, realizing that Presto will be crushed, uses the magic hat to save him, earning the audience's wild approval for both himself and Presto. Presto gives Alec the apparently restored carrot, as well as second billing on the posters advertising the show, and they are rewarded for each show they do, with roses for Presto and carrots for Alec."}