{"mid": "PrettyInPink", "IMDB_id": "tt0091790", "title": "Pretty in Pink", "plot": "High school senior Andie Walsh lives modestly with her underemployed working class father, Jack. Andie's best friend, Phil \"Duckie\" Dale, is in love with her, but is afraid to tell her how he truly feels. In school, Duckie and Andie, along with their friends, are harassed and bullied by the arrogant \"richie\" kids, specifically Benny Hanson and her boyfriend Steff McKee, who is secretly interested in Andie.\nWhile working after school at TRAX, a new wave record store, Andie starts talking about her school's senior prom to her manager Iona, who advises Andie to go despite not having a date. Blane McDonough, one of the preppy boys and Steff's best friend, starts talking to Andie at school and at TRAX, and eventually asks her out. Steff tells Blane to stop talking to her.\nOn the night of the date, Andie waits for Blane at TRAX, but he is late. Duckie comes in and asks Andie to go out with him, but she ignores him. Iona gives her a pep talk, while Duckie, still oblivious, asks what's wrong. When Blane arrives, Duckie is upset and starts an argument with Andie, with Duckie trying to convince her that Blane will only hurt her. Duckie storms off and Andie goes on with her date. Blane suggests going to a house party Steff is throwing, but Andie is treated poorly by everyone, including a drunk Steff and Benny. Andie, in turn, suggests going to the local club, where they discover Iona sitting with Duckie, who is hostile toward Blane. After another argument with Duckie, Andie and Blane walk out of the club. Andie, feeling that their night didn't go so well, tells Blane that she wants to go home, but when Blane offers to take her home, she refuses, admitting that she doesn't want him to see where she lives. She eventually allows him to drop her off and he asks her to the prom, which she accepts and they share their first kiss. Andie visits Iona at her apartment the next day to talk about Andie's date. Meanwhile, Blane, pressured by Steff, begins distancing himself from Andie.\nJack comes home one night and surprises Andie with a pink dress he bought for her at a thrift shop. Questioning how he was able to afford it, Andie tells him that she knows he has been lying about going to a full-time job. The two fight until Jack breaks down, revealing that he is still bitter and depressed about his wife having left him. At school, Andie confronts Blane for avoiding her and not returning her calls. When asked about prom, he claims that he had already asked somebody else but had forgotten. Andie starts calling Blane a liar and accuses him of being ashamed of being seen with her because his friends don't approve. Andie runs away as a teary-eyed Blane leaves, with Steff criticizing Andie again. Duckie overhears Steff and attacks him in the hallway. The two fight before teachers intervene. Andie goes to Iona, crying about what happened. She asks for Iona's old prom dress.\nUsing the fabric from Iona's dress and the thrift shop dress, Andie creates a new pink prom dress. When she arrives at the prom, Andie has second thoughts about braving the crowd on her own until she sees Duckie walk out. They reconcile and walk into the ballroom hand in hand. When a drunk Steff begins mocking the couple, Blane confronts him and finally realizes that Steff resents Andie because she had turned down Steff's advances. Blane then approaches the two, shaking Duckie's hand and then apologizing to Andie, telling her that he always believed in her and that he will always love her, kissing her cheek before walking out. Duckie concedes that Blane is not like the other rich kids at school and advises Andie to go after him, joking that he'll never take her to another prom if she doesn't. Duckie then sees a girl smiling at him, telling him to come over and dance with her. Andie catches up with Blane in the parking lot and they kiss passionately."}