{"mid": "PrincessGwenevereAndTheJewelRiders", "IMDB_id": "tt0112131", "title": "Princess Gwenevere and the Jewel Riders", "plot": "=== Premise ===\nThe show's action is set in the legendary island of Avalon, here portrayed as a fairy tale style utopia that keeps its magic in check by the seven Crown Jewels of the Kingdom, each representing an area of the realm. The series takes place after a thousand years passed since the good wizard Merlin's initial victory over the witch queen Morgana. In the original version of the show, the title character has her name similar with Arthur's wife, Guinevere; other Arthurian characters include Merlin and Lady of the Lake. Mentored by the ageless Merlin, the Jewel Riders are the young female champions of goodness and magical guardians of New Camelot, who uphold the laws of the peaceful land and defend its people for generations. But when evil threatens Avalon and with their teacher Merlin suddenly gone, the trio of Jewel Riders, the kingdom's traditional teen defenders, aided by their animal friends, are tasked with recovering the mystical Enchanted Jewels that are essential for controlling the dangerous Wild Magic.\nAvalon's fate rests with the Jewel Riders: the latest incarnation consists of the 16-year-old Princess Gwenevere (Gwen) and her friends, Fallon and Tamara. Their jewels, besides their unique powers, are allowing them to \"ride\" safely the tunnels through the alternate dimension of the Wild Magic, as well as to communicate with their Special Friends ― the magic animals who each share a similar gemstone in their neck collars. The girls are often assisted by the Pack, a teenage male trio of wolf-riding Knights of Avalon wielding the Forest Stones. The protagonists contend with the ruthless Lady Kale, a former princess of Avalon who has vowed to command all the magic and rule the kingdom no matter the consequences. An emphasis is set on the \"power of friendship\", which enables the Jewel Riders to overcome evil. In the second season, the threat to Avalon is not over yet, and gets worse with an introduction of an even more dangerous adversary for the Jewel Riders to thwart. Instead of Crown Jewels, Gwen and her friends seek out another cache of magical gems while still struggling to fight off the forces of darkness and to contain the growing chaos in the magic.\n=== First season ===\nThe story is set up during the two-part pilot episode \"Jewel Quest.\" Princess Gwenevere, the young daughter of the rulers of Avalon, Queen Anya and King Jared, is being prepared by Merlin for the day when she will meet a bonded animal friend to share their own themed Enchanted Jewels with. Gwen is yet to be given the magic of the royal Sun Stone, while her best friends Tamara and Fallon already wield the magic of the Moon Stone and the Heart Stone. Gwen needs to search for such an animal and become the new leader of the Jewel Riders. Suddenly, disaster strikes when the outlaw Princess Kale, a hateful and power-hungry sister of Anya, gets hold of the formidable magic of the Dark Stone and uses it to overpower Merlin, sending him into the perilous dimension of Wild Magic. The sorceress steals the Crown Jewels and plans to use their magic to take over Avalon and reign forever, but Merlin foils her by breaking their setting and sending them back to the lands from where they had come, scattering them wide across the kingdom and beyond. Gwen succeeds in getting her Special Friend, a winged unicorn named Sunstar. Unfortunately, once the Crown Jewels' bond is broken, magic is no longer stable and flows out of control, causing dangerous outbreaks until they are brought back together. Retrieving them is the only way the Riders can free Merlin from being lost in the limbo of Wild Magic and so their titular quest begins. Using the magic of the Enchanted Jewels and their friendship, the Jewel Riders must prevent Kale from gaining more power, reclaim the Crown Jewels, and save Merlin and all of Avalon.\nFor most of the episodes, the primary storyline tells of the Jewel Riders' efforts to locate and secure each of the Crown Jewels before Lady Kale can get her hands on them or to win them back if she does. The seven Crown Jewels consist of the Jewel of the North Woods (in \"Travel Trees Can't Dance\"), the Rainbow Jewel found inside the Rainbow Falls (in \"Song of the Rainbow\"), the Jewel of the Burning Ice found in the Hall of Wizards at the Wizard's Peak in the snow-covered mountains (in \"Wizard's Peak\"), the Misty Rose Jewel found in the Misty Moors (in \"For Whom the Bell Trolls\"), the Desert Star Jewel of the Great Desert found in the magical realm of Faeryland (in \"The Faery Princess\"), the Jewel of the Dreamfields (in \"Dreamfields\"), and the Jewel of the Jungle found in the hidden lair of the legendary wizard Morgana (in \"Revenge of the Dark Stone\").\nDuring the two-part dramatic finale of the first season (in \"Revenge of the Dark Stone\" and \"Full Circle\"), Lady Kale succeeds in seizing control of the Jewel Keep at the Crystal Palace. Becoming seemingly invincible, she overthrows Anya, unleashes the dark magic onto Avalon, strips the Jewel Riders of their powers, and prepares to make herself a queen for eternity. Kale seeks out Merlin to finish him off, but he uses his remaining powers to pull the wicked woman into the Wild Magic and holds her there for long enough for the girls to release the positive magic of the Crystal Palace, revealed as the most powerful Enchanted Jewel in Avalon. Unaware of this, Kale attempts to absorb the powers of the gathered Crown Jewels which results in her being destroyed and her dark spells are undone. The girls then discover that they have tuned the Crown Jewels to their personal jewels, enabling them to channel all the magic of Avalon. In doing so, however, they squandered a chance of solving the magic crisis for good, as well as a chance of freeing Merlin, who has sacrificed his staff jewel to outwit Kale.\n=== Second season ===\nThe Jewel Riders realize that the Crown Jewels have given them a set of new 'Level Two' armor and magic seven times more powerful than before. They girls now have at their disposal far greater magic than they ever dreamed possible; they also find it difficult to use. Meanwhile, inside the Wild Magic, Kale's Dark Stone is summoned toward a floating palace, where she materializes back to life and meets her accidental rescuer, the elflike Morgana who was the creator and original wielder of the Dark Stone. Morgana had led the other ancient wizards against Merlin a millennium ago but was defeated and, losing her jewel, she has remained trapped in the Wild Magic ever since. The two villainesses, united only by their mutual hatred for Merlin, grudgingly decide to team up and Morgana sends Kale back to Avalon in search for the other Wizard Jewels in a preparation for the return of Morgana and the deciding battle between the forces of light and dark. The Jewel Riders need to master their enhanced powers while they continue their quest to bring Merlin home, and soon they confront Morgana and realize that they are facing a dangerous new enemy.\nThe seven Wizard Jewels are just as hard to obtain as the Crown Jewels were, as they are scattered in magical places beyond Avalon. Through most of the season the Riders try to find the jewels before they fall into the hands of Morgana, who wants to use their magic to complete her conquest of the kingdom; at the same time, Lady Kale also seeks the Wizard Jewels for herself while supposedly working for/with Morgana. The seven Wizard Jewels consist of the Unicorn Jewel (in \"Vale of the Unicorns\"), the Jewel of Arden (in \"Prince of the Forest\"), the Garden Jewel (in \"The Wizard of Gardenia\"), the Jewel of the Sea (in \"The Jewel of the Sea\"), the Time Stone (in \"Mystery Island\"), and the Fortune Jewel (in \"The Fortune Jewel\"), not counting the Dark Stone itself.\nPrincess Gwenevere meets a handsome, mysterious young man called Ian (a good-hearted werewolf-like who later comes to her rescue her during the final battle), falling in love with him. Tamara finds a magical animal for herself, which turns out to be a striped unicorn named Shadowsong. Together they fight to protect Avalon. During the series' two-part conclusion (in \"Lady of the Lake\" and \"The One Jewel\"), set in the Heart of Avalon, Gwen is given the magic Staff of Avalon by the Lady of the Lake (the Spirit of Avalon), which she uses to rid of Kale, turning the witch to a crystal statue, and to save her friends. In the final showdown, the Riders and their friends then band together to battle Morgana in a test of skills and wits over the collected Wizard Jewels. Eventually, the princess fuses the Dark Stone with the Sun Stone and captures the ultimate One Jewel forged from the Wizard Jewels, which the freed Merlin then uses the One Jewel to do away with Morgana and the ancient wizards' ghosts once and for all."}