{"mid": "PrincessProtectionProgram", "IMDB_id": "tt1196339", "title": "Princess Protection Program", "plot": "When Princess Rosalinda Demi Lovato is about to become queen of her country of Costa Luna, the country is invaded by an evil dictator. She is put into the Princess Protection Program, a secret organization funded by royal families that looks after endangered princesses. Rosalinda is taken under the wing of Mason Verica, an agent in the PPP from rural Louisiana. While there, she meets his daughter, Carter Selena Gomez,who works at the local bait shop. Carter dreams of going to the school dance with her crush, Donny, Adamson, the school hottie. In becoming a normal teenager, Rosalinda takes up the name Rosie and soon becomes popular at school; which Carter must learn to handle. Although through the ups and downs, the two form a tight bond and become close friends, with Carter teaching Rosie to become a normal American girl, and Rosie helping Carter to find her inner princess. At the end, Carter realizes what a jerk Donny is and goes to the dance with Ed Braun, who is her best friend and has had a crush on her for a long time. Rosie becomes Queen of Costa Luna in the end and Carter and Ed cheer, \"Long Live Queen Rosie!\" and Rosie walks down the aisle with Carter proud and smiling. [D-Man2010]Princess Rosalinda (Demi Lovato) of the small Spanish-speaking nation of Costa Luna, is about to be crowned queen upon reaching maturity. Mysteriously, General Kane who the dictator of a neighboring country Costa Estrella, is able to massively infiltrate her palace with his agents during her coronation rehearsal, and attempts to assassinate her while effecting a coup d'etat against her regime. Luckily, Joe Mason who ia an agent of the Princess Protection Program, (a secret organization funded by royal families that looks after endangered princesses) is able to whisk her away to safety via helicopter because Gen. Kanes agents failed to secure her rooftop helipad. They succeeded in capturing her mother, the Queen Sophia, but unfortunate for the general his coup severely alienates him from the international authorities.\nTo keep Princess Rosalinda hidden, the Princess Protection Program places her in Mr. Masons home in rural Louisiana because she refuses to trust anyone else. There she meets his daughter Carter (Selena Gomez), an insecure girl who works at the local bait shop and dreams of going to the school dance with her crush Donny (Robert Adamson). In becoming a normal teenager, Rosalinda takes up the name Rosie and soon becomes popular at school, which Carter must learn to handle. The two become close friends. Carter teaches Rosie to act like a normal American girl, and Rosie shows Carter how to disarm those that scorn them and put them in their place by behaving as a princess.\nMeanwhile, General Kane plots to marry Rosalindas mother in order to legitimize his rule, but also to draw Rosalinda (the late Kings legitimate heiress) out of hiding so that he can ambiguously marry her, place her on the throne as a puppet, or kill both her and her mother to wipe out the royal family.\nJoe Mason understands that if Rosie knows General Kane is forcing her mother into marriage, then she will want to give herself up in order to placate his need to secure his rule. He also knows that Gen. Kane is likely to simply kill Rosie if he can get his hands on her. Unfortunately, Mr. Mason fails to recognize the threat posed by the popular girls at school, who want Rosie to drop out of the election for Homecoming Queen. After discovering that Rosie is actually a princess, they tell Rosie about Gen. Kanes plan to marry her mother and try to encourage her to leave by destroying her and Carters homecoming dresses.\nRosalinda is distraught and makes up her mind to leave without anyone knowing besides Carter. Carter knows what will happen if Rosie goes back, so asks her to do her one last favor and stay until after the Homecoming. Rosalinda agrees to wait to return to Costa Luna until after the dance. To acquire new dresses, Carter calls Rosalindas dressmaker Mr. Elegante, and asks him to send some as part of a plan to save Rosie, the Queen, and Costa Luna. To carry out their plan Mr. Elegante sends the dresses and pretends to betray Rosalindas whereabouts to Gen. Kane in order to lure him to Louisiana. Carter's plan is to use herself as bait to get Gen. Kane to expose himself. She knows that her father \"will always be there for her\", and that there is no way a rogue foreign dictator can enter U.S. airspace and land unnoticed by the authorities.\nIn the meantime, Rosie and Carter help a bunch of girls by making them look good for the dance, which includes wearing masks to help Carter stand in for Rosie. Gen. Kane flies to Louisiana with only a few men in order to try to abduct Rosie. As part of her plan, Carter poses as Rosie by wearing a dress of the same color that Gen. Kane was informed that Rosie would be wearing, and is taken away to the Gen. Kane's helicopter. Again, Gen. Kanes agents fail to actually secure the helipad on top of the school. Mr. Mason and his Princess Protection Program agents bribe and sneak their way into Gen. Kanes helicopter and arrest the General while his men offer no resistance. Although the agents promise to turn him over to the international authorities, this would be the first time in history that a ruling head of state has been arrested on foreign soil, but it is also the first time a ruling head of state has personally traveled to another country to abduct someone.\nAt the end, Carter realizes what a jerk Donny is and goes to the dance with Ed, who is her best friend and has had a crush on her for a long time. In the ends, Rosie is crowned Queen of Costa Luna. Carter and Ed cheer, \"Long Live Queen Rosie!\" and Rosie walks down the aisle with Carter smiling proudly.\nOne year later, Carter and Rosie are seen as fully-fledged agents of PPP, and are being assigned a new assignment. ~BatzinMabelfry~"}