{"mid": "Privilege", "IMDB_id": "tt0062155", "title": "Privilege", "plot": "The story is presented as a narrated documentary, set in a near-future 1970s England, and concerning a disillusioned pop singer, Steven Shorter (Paul Jones), who is the most-loved celebrity in the country. His stage show involves him appearing on stage in a jail cell with handcuffs, beaten by police, to the horror and sympathy of the audience. It is described that the two main parties of England have formed a coalition government and encourage the success of Shorter to placate the masses and divert them from political activity. Shorter is consistently monitored and manipulated by handlers consisting of manager Martin Crossley (Jeremy Child), public relations representative Alvin Kirsch (Mark London), record company executive Julie Jordan (Max Bacon), and financial backer Andrew Butler (William Job). Businesses including nightclubs, shopping centers, product brands, and media outlets, carry Shorter's name, demonstrating his appeal to consumers. An artist, Vanessa Ritchie (Jean Shrimpton) has been hired to paint his portrait, and Shorter gravitates to her amidst his loneliness and isolation.\nDemands upon Shorter's time and energy increases. He is asked to film a commercial for the country's apple growers, hoping to convince citizens to eat a disproportionately large amount of apples to make up for a surplus supply. More ominously, the collective churches of England strike an arrangement with the government and Shorter's empire to turn him into a messianic leader that will boost church attendance and a sense of national unity. An image change is announced in advance of a huge stadium concert, where he will publicly \"repent,\" no longer perform in handcuffs, and will espouse religious themes in his songs. Shorter's equilibrium becomes more shaky; at a picnic where lobster is served, he absurdly orders hot chocolate to drink, and everyone present in turn orders hot chocolate as well, demonstrating he will be enabled at all times.\nThe stadium rally has a record attendance, and features militarized performance from various nationalist organizations. A firebrand preacher, Reverend Jeremy Tate, tells the assembled crowd they will be handed cards reading \"We Will Conform,\" rails against the perceived post-war apathy in the country, and demands they repeat the words at his prompting, which they follow. Shorter and his band take the stage, with the band members wearing costumes and assuming poses reminiscent of Nazi Germany. Disabled citizens are given preferential seating to the stage, in the hopes Shorter's music will heal them. When Shorter later watches footage of the rally on television, he is disgusted at the display, and goes on a furniture-breaking tear. He also reveals to Vanessa that contrary to the publicity that his old show was just an act, he bears real scars and bruises from being legitimately assaulted by the mock policemen in the act.\nShorter's record company holds a formal event to give him an achievement award and profess theirs and the nation's love for him. Shorter finally breaks down, inarticulately declaring disgust for the public that cannot see past his charade, and asking to be seen as an individual and not the inflated deity he has been presented as. After stunned silence, the public reacts angrily, and his popularity immediately plummets. Andrew Butler announces his immediate resignation from the Shorter organization, as it is no longer lucrative for his investors. The narrator states that to placate the now-hateful masses, and to preserve the viability of the still extant businesses that carry his name, Shorter's music will be banned from airplay, and he shall not be allowed to speak or perform publicly again.\nIn postscript, the narrator reveals that there is little left of Shorter's career, and over archival footage of him (\"with the soundtrack removed, of course...\"), declares, \"It is going to be a happy time in England, this year in the future.\""}