{"mid": "PrizzisHonor", "IMDB_id": "tt0089841", "title": "Prizzi's Honor", "plot": "Charley Partanna is a hit man for a New York crime organization headed by the elderly Don Corrado Prizzi, whose business is generally handled by his sons Dominic and Eduardo and by his longtime right-hand man, Angelo, who is Charley's father.\nAt a family wedding, Charley is quickly infatuated with a beautiful woman he doesn't recognize. He asks Maerose Prizzi, estranged daughter of Dominic, if she recognizes the woman, oblivious to the fact that Maerose still has feelings for Charley, having once been his lover. Maerose is in disfavor with her father for running off with another man after the end of her romance with Charley.\nCharley discovers that the mysterious woman, Irene, is a \"contractor\" who, like himself, performs assassinations for the mob. He flies to California to spend time with her and quickly falls in love. Unaware she is married, Charley also carries out a contract to kill Irene's husband, Marksie Heller, for robbing a Nevada casino. She repays some of the money Marksie stole and in Mexico marries Charley.\nCharley is unaware that Irene is suspected by the mob of having the rest of the money Marksie took. A jealous Maerose travels there on her own to establish for a fact that Irene has double-crossed the organization. The information restores Maerose to good graces somewhat with her father and the don.\nDominic, acting on his own, wants Charley out of the way and hires someone to do the hit, not knowing that he has just given the job to Charley's own wife. Angelo sides with his son, and Eduardo is so appalled by his brother's actions that he helps set up Dominic's permanent removal from the family.\nIrene and Charley team up on a kidnapping that will enrich the family, but she shoots a police captain's wife in the process, endangering the organization's business relationship with the cops. The don is also still demanding a large sum of money from Irene for her unauthorized activities in Nevada, which she doesn't want to pay. In time, the don tells Charley that his wife's \"gotta go.\"\nThings come to a head in California when, acting as if everything were all right, Charley comes home to his wife. (A famous line from the movie, spoken by Charley, is \"Do I marry her? Do I ice her? Which one of these?\") Each pulls a weapon simultaneously in the bedroom. Irene ends up dead, and Charley ends up back in New York, missing her, but consoled by Maerose."}