{"mid": "PsychoCopReturns", "IMDB_id": "tt0107894", "title": "Psycho Cop Returns", "plot": "In a coffeehouse, Officer Joe Vickers, a serial killer empowered by Satan, overhears Brian and Larry, a pair white-collar workers, discussing a bachelor party that they are planning to throw in their workplace for their friend Gary. Vickers follows the two to their office, and stakes it out in his car (which is full of body parts and demonic imagery) until after hours, which is when Larry bribes the security guard into letting in three strippers. Vickers tricks the guard into letting him in, then stabs him in the eye with a pencil.\nVickers sabotages the lifts, and when Mike goes downstairs to tell the night watchman about it, Vickers throws him down an elevator shaft. Vickers proceeds to send vaguely threatening faxes to the partiers, though this does not deter the drunken Gary from going up onto the roof with one of the strippers. The two are found by Vickers, who shoots Gary in the head, and throws the stripper off of the building. Vickers continues to send faxes, prompting Brian, Larry, and the remaining two strippers to go to the copy room, while elsewhere Vickers uses a decorative spear to impale a pair of workers who were having sex in a storage closet.\nLarry, Brian, and the strippers flee when Mike and Gary's bodies fall through the ceiling of the copy room, and run into Sharon, an accountant who had stayed late. The quintet try to call 911, but the lines are not working, and while looking around to see if anyone else is in the building, they find the skewered couple, and are confronted by Vickers. Initially feigning being there to help, Vickers shoots Larry in the mouth, wounds Brian, and chases the others. The women try to escape through the front entrance, but the door is shatterproof, and handcuffed shut. While the trio make their way up to the garage exit, they are attacked by Vickers, who shoots one stripper, and snaps the neck of the other. Sharon is pursued by Vickers, but manages to set his face on fire (causing one of his sunglasses lenses to melt to his eye) and knock him down an elevator shaft, but he survives the fall.\nSharon makes it out through the garage, and is chased through the streets by Vickers, who catches her outside a bar. The patrons of the bar see Vickers attacking Sharon, and in a parody of the Rodney King incident, they beat down the officer as a bystander videotapes the scene from his apartment balcony. Sharon, Brian, and Vickers are all taken to a hospital, where Vickers is healed by demonic forces, massacres the police officers and medical staff watching him, and storms out of his room."}