{"mid": "PureLuck", "IMDB_id": "tt0102729", "title": "Pure Luck", "plot": "The film opens as the klutzy Valerie Highsmith (Sheila Kelley) arrives at an airport in Puerto Vallarta. She calls her father (Wanamaker), a wealthy businessman, to let him know that she has arrived. While she is on the phone, she clumsily leans on the railing of her balcony and falls several stories onto a canvas. Soon after, an encounter with some street thieves knocks her unconscious and she loses her memory, then a local criminal named Frank Grimes (Scott Wilson) spirits Valerie away from her hotel.\nA psychologist named Monosoff (Harry Shearer), knowing that Valerie has ultra bad luck, persuades her father to send one of his employees, Eugene Proctor (Martin Short), an accountant with super bad luck, to find her. Perhaps he will be lucky, and his bad luck could help to find the unlucky girl. Eugene is partnered with Raymond Campanella (Danny Glover), a hardnosed investigator, who bristles at Eugene's every move.\nAs they travel to Mexico together, they endure one mishap after another, from damaged luggage and bad hotel rooms to bar fights with strangers. Eventually, they are told by the local police that Valerie was last seen with Frank Grimes. Eugene thinks that he can press a local prostitute for information, but she robs him. Raymond tracks the prostitute down at a gambling club and confronts several men at gunpoint to retrieve Eugene's money. Neither of them realizes that Frank Grimes is seated at the table, until after they drive away and look at his picture one more time.\nRaymond and Eugene return to the club and abduct Grimes to find out where Valerie is. He confesses that Valerie's extreme clumsiness required him to keep going to hospitals with her, wiping out all his money. He could no longer afford to keep her hostage. So, Grimes turned Valerie over to a man named Fernando (Puebla). Before Grimes can take them to Valerie, he is killed in a drive-by shooting. The police arrest Raymond and Eugene by mistake. After a short stint in jail, they find out that Grimes had put Valerie on a plane to Mexico City which never arrived, and Valerie is presumed dead in a plane crash.\nThey charter a plane to look for Valerie's wreckage, hoping that she might have survived. During the flight, Eugene is stung by a bee and swells to an enormous size, due to an allergy. As he recovers at a field hospital, he talks to a local man who tells about a strange woman who wandered into their village one day. She was so grateful for being taken in by the villagers that she offered to make them all breakfast in the morning, but she ended up burning the village down on accident. Musing that she might be Valerie, Raymond shows the man her picture, and he screams in terror.\nRaymond and Eugene head towards the burned village in search of Valerie. Eugene nearly drives them off a cliff. After barely escaping, Raymond has had enough of Eugene's dreadful luck. In a rage, he reveals to Eugene that the only reason he was hired to find Valerie was because Monosoff thought Eugene's bad luck would somehow combine with Valerie's to create some good luck. Eugene tries to fight Raymond, but he only manages to knock himself out.\nRaymond takes Eugene to a local hospital. Realizing that he has befriended Eugene, he asks the nurse to take extra care with him. When Eugene wakes up, he is in a bed next to Valerie, who has also suffered a head wound. They blithely walk off hand in hand. Raymond discovers their empty beds and spots them on the end of a pier. He shouts at Eugene to let him know that he has found Valerie. Eugene stares at her in a daze and asks, \"Valerie?\" Hearing her name, Valerie recovers her memory. The film ends with the pair floating down the river on a piece of the pier that has broken off and is headed towards a massive waterfall."}