{"mid": "Purgatory", "IMDB_id": "tt0158131", "title": "Purgatory", "plot": "It is the late 1800s in a small, peaceful western town until a violent evil gang of bank robbers pay a visit. Led by ruthless, bloodthirsty Blackjack Britton (Eric Roberts), they take the bank. Things are progressing well, until a random troop of military soldiers ride into town. Then all hell breaks loose in the dusty little settlement.After the deadly shootout, the gang flees, only to be passionately chased by a large angry posse. Desperate, they ride straight through the night, but are unable to shake the mob who is determined to take them and hang them all. When the posse finally overtakes them, a running shootout begins, which eventaully kills the horse carrying all the money. Partially satisfied, the posse breaks off pursuit. Badly cut down, exhausted and without money, the dejected gang rides on, straight into a bizarre sandstorm. When the dust finally settles, they find themselves in a place no human eye has ever seen before.Here in this sleepy little town called Refuge, the people welcome them and invite them to take anything they want, absolutely free. It is a quiet little town, with no telegraph, and seemingly no guns or violence. The people look oddly familiar however. Why does that sheriff look like Wild Bill Hickock? Everyone knows he was killed almost ten years ago. And is that Billy The Kid? And Doc Holliday? Look, he looks like Jesse James! But arent they all dead? Who are they?One young man, Sonny (Brad Rowe) knows them all. He loves the Dime Store novels that write about all the outlaw heroes. Related to a member of the gang, Sonny wanted to join, until he saw how outlaw life really was. The only good guy in the dangerous group, he tries to befriend them, especially the mysterious Rose, a sweet young girl in town. He finally dismisses his crazy ideas that is, until late one night a mysterious coach arrives and drops off a woman, a woman who died in his arms in the bank robbery town! The coach vanishes into thin air, and Sonny begins a relentless pursuit of the truth, never dreaming where his search will lead, or what it will cost him.Welcome to Refuge."}