{"mid": "Quartet", "IMDB_id": "tt1441951", "title": "Quartet", "plot": "The plot takes place in Beecham House, a retirement home for former professional musicians, patterned after the real-life Casa di Riposo per Musicisti founded by Giuseppe Verdi.\nReg, Wilf and Cissy are retired opera singers who often worked together in the past; among other residents are Cedric Livingstone, a former director, and diva Anne Langley. All the guests in the retirement home continue to be engaged in their former professions in one way or the other, including lecturing and initiating young people to music.\nFinances threaten closure of the home but proceeds from a yearly gala concert on Verdi's birthday hold hope for a continuation of the place. However, Cedric has become rather desperate because some of the most prominent singers have either died or decided not to participate at all. Reg, Wilf and Cissy were in the cast of a very highly rated recording of the opera Rigoletto, which includes a famous quartet for soprano, mezzo-soprano, tenor and baritone (\"Bella figlia dell'amore\"). This version is very prominent among opera buffs as THE Rigoletto of the post-war era.\nOne day, Reg is shocked to find his former wife Jean Horton, the missing soprano of the Rigoletto recording, turning up to live at Beecham House. Reg is angry not to have been warned as their parting was on very sour terms.\nAt first Jean tries unsuccessfully to mend things with Reg. In the ensuing conversations her infidelity arises, as well as her past marriages, but Reg comes to understand that all that is past. In the meantime, Wilf and Cissy convince Cedric that bringing together those who sang the quartet on the famous recording to sing it again for the Verdi Gala concert will sell enough tickets to save the home. Enchanted with the idea, they persuade Reg to overcome his objections to performing with Jean again. However, she is harder to persuade as she vowed never to sing again after retiring.\nCissy takes Jean flowers from the garden to cheer her up and asks if she wishes to discuss the quartet, but Jean becomes violent and attacks Cissy, which only aggravates Cissy's already delicate senile condition. Jean apologises and is finally persuaded to sing in the quartet from Rigoletto, after learning that Anne Langley will be singing \"Vissi d'arte\" from Tosca. The group prepares for their performance and, moments before their curtain call, Cissy gets very confused and attempts to walk out the door, saying that she has to go back to her family, but Jean manages to salvage the situation. During her conversation with Cissy, Jean expresses regret for all her past bad behaviour towards Reg and admits that she is still in love with him. Reg overhears this.\nJust as the recital is about to start, the director of the home is amazed at the energy displayed by the guests of the home. The idea of rehearsing and playing before an audience brings life back to them, leading her to the conclusion that old age and art go together. As they are about to enter the stage, Reg asks Jean to marry him again, and once on stage she whispers her acceptance."}