{"mid": "QuatermassAndThePit", "IMDB_id": "tt0062168", "title": "Quatermass and the Pit", "plot": "Workmen discover a pre-human skull while building in the fictional Hobbs Lane (formerly Hob's Lane, Hob being an antiquated name for the Devil) in Knightsbridge, London. Dr Matthew Roney, a paleontologist, examines the remains and reconstructs a dwarf-like humanoid with a large brain volume, which he believes to be a primitive man. As further excavation is undertaken, something that looks like a missile is unearthed; further work by Roney's group is halted because the military believe it to be an unexploded Second World War bomb.\nRoney calls in his friend Professor Bernard Quatermass of the British Rocket Group to prevent the military from disturbing what he believes to be an archaeological find. Quatermass and Colonel Breen, recently appointed to lead the Rocket Group over Quatermass's objections, become intrigued by the site. As more of the artefact is uncovered additional fossils are found, which Roney dates to five million years, suggesting that the object is at least that old. The interior is empty, and a symbol of five intersecting circles, which Roney identifies as the occult pentacle, is etched on a wall that appears to conceal an inner chamber.\nThe shell of the object is so hard that even a boron nitride drill makes no impression, and when the attempt is made, vibrations cause severe distress in people around the object. Quatermass interviews local residents and discovers ghosts and poltergeists have been common in the area for decades. A hysterical soldier is carried out of the object, claiming to have seen a dwarf-like apparition walk through the wall of the artefact, a description that matches a 1927 newspaper account of a ghost.\nFollowing the drilling, a hole opens up in the object's interior wall. Inside, Quatermass and the others find the remains of insect-like aliens resembling giant three-legged locusts, with stubby antennae on their heads giving the impression of horns. As Quatermass and Roney examine the remains, they theorise the aliens may have come from a planet habitable five million years ago – Mars.\nWhile clearing his equipment from the craft the drill operator triggers more poltergeist activity, and runs through the streets in a panic until he finds sanctuary in a church. Quatermass and Roney find him there, and he describes visions of the insect aliens killing each other. As Quatermass investigates the history of the area, he finds accounts dating back to medieval times about devils and ghosts, all centred on incidents where the ground was disturbed. He suspects a psychic projection of these beings has remained on the alien ship and is being seen by those who come into contact with it.\nQuatermass decides to use Roney's optic-encephalogram, a device that records impressions from the optical centres of the brain, and see the visions for himself. Roney's assistant, Barbara Judd, is most sensitive; placing the device on her, they record a violent purge of the Martian hive to root out unwanted mutations. Quatermass concludes that in its most primitive phase mankind was visited by this race of Martians. Some apes and primitive pre-humans were taken away and genetically altered to give them abilities such as telepathy, telekinesis and other psychic powers. They were then returned to Earth, and the buried artefact is one of the ships that had crashed at the end of its journey. With their home world dying, the aliens had tried to change humanity's ancestors to have minds and abilities similar to their own, but with a bodily form adapted to life on Earth.\nBut the aliens became extinct before completing their work. As the human race bred and evolved, only a percentage retained their psychic abilities, which surfaced only sporadically. For centuries the buried ship had occasionally triggered those dormant abilities, which explained the reports of poltergeists; people were unknowingly using their own telekinesis to move objects around, and the ghost sightings were traces of a racial memory. The authorities, and Breen in particular, find this explanation preposterous despite being shown the recording of Barbara's vision. They believe that the craft is a Nazi propaganda weapon and the alien bodies fakes designed to create exactly the impressions that Quatermass has succumbed to, and decide to hold a media event to stem the rumours that are already spreading.\nQuatermass warns that if implanted psychic powers survive in the human race, there could also still be an ingrained compulsion to enact the \"Wild Hunt\" of a race purge, but the media event goes ahead regardless. The power cables that string into the craft fully activate it for the first time, and glowing and humming like a living thing it starts to draw upon this energy source and awaken the ancient racial programming. Those Londoners in whom the alien admixture remains strong fall under the ship's influence; they merge into a group mind and begin a telekinetic mass murder of those without the alien genes, an ethnic cleansing of those the alien race mind considers to be impure and weak.\nBreen stands transfixed and is eventually consumed by the energies from the craft as it slowly melts away and an image of a Martian \"devil\" floats in the sky above London. Fires and riots erupt, and after Quatermass succumbs to the mass psychosis he attempts to kill Roney, who does not have the alien gene and is therefore immune to the alien influence. Roney manages to shake Quatermass out of his trance, and remembering the legends of demons and their aversion to iron and water, he proposes that a sufficient mass of iron connected to wet earth may be sufficient to short-circuit the apparition. Quatermass acquires a length of iron chain and tries to reach the \"devil\" but succumbs to its psychic pressure. Roney manages to walk up to the apparition and hurls the chain at it, resulting in him and the spacecraft being reduced to ashes.\nAt the conclusion of the final episode Quatermass gives a television broadcast, at the end of which he delivers a warning directly to camera: \"If we cannot control the inheritance within us, this will be their [the Martians'] second dead planet.\""}