{"mid": "Queen", "IMDB_id": "tt3322420", "title": "Queen", "plot": "In the 1997 general election, Tony Blair (Michael Sheen) becomes Britain's newly elected prime minister. Queen Elizabeth II (Helen Mirren) is wary of Blair and his pledge to modernise Britain. Three months later, Diana, Princess of Wales dies in a car crash at the Alma Bridge tunnel in Paris. Blair's director of communications, Alastair Campbell (Mark Bazeley), writes a speech, calling Diana the \"People's Princess.\" The phrase catches on and millions of people display an outpouring of grief at Buckingham and Kensington Palaces. Diana's death sparks division amongst members of the royal family, with some of the view that since Diana was divorced from Prince Charles (Alex Jennings) prior to her death, she was no longer a part of the royal family. They argue that Diana's funeral arrangements are thus best left as a private affair of her family, the Spencers. Charles, however, argues that the mother of a future king cannot be dismissed so lightly, and persuades the Queen to authorise the use of an aircraft of the Royal Air Force to bring Diana's body back to Britain.\nIn London, flowers begin to pile up before the palace railings, forcing the changing of the Queen's Guard to use another gate. British tabloids become inflammatory about the lack of a statement from the royal family. Charles leaves no doubt that he shares Blair's views about the need for a statement. As the royal family's popularity plummets, Blair's approval rises, to the delight of his anti-monarchist advisers and wife, Cherie (Helen McCrory). However, Blair, unconcerned about his increase in political popularity, does not share these sentiments. While disagreeing with the Queen's course of action, Blair begins to develop an admiration for her. Blair tells his wife that a republican Britain is ludicrous and begins to denounce the anti-monarchical views of his Labour Party advisers. Blair immediately calls the Queen and recommends three strong measures to regain public confidence of the monarchy: attend a public funeral for Diana at Westminster Abbey, fly a Union flag at half-mast over Buckingham Palace, and speak to the nation about Diana's life and legacy in a televised address.\nBlair's recommendations outrage several members of the royal family including Prince Philip (James Cromwell) and the Queen Mother (Sylvia Syms), who views such steps as an undignified surrender to public hysteria. The Queen shares their feelings but believes that there has been a shift in public values and that perhaps she should abdicate. The Queen Mother dismisses the idea by saying that she is one of the greatest assets the monarchy has ever had, stating: \"The real problem will come when you leave\". She reminds the Queen of the promise she made in Cape Town, South Africa on her 21st birthday, that her \"whole life, whether it be long or short, shall be devoted to your service and the service of our great imperial family to which we all belong...\". Meanwhile, Philip tries to distract William and Harry (Jake Taylor Shantos and Dash Barber) from Diana's death by taking them deer stalking. While venturing out alone in her Land Rover, the Queen damages it crossing a river and is forced to telephone for assistance. The Queen quite alone on the expanse of the estate, begins to weep, either out of stress or a sense of loss for Diana. She is distracted as she catches sight of a majestic red deer which Philip had been stalking with William and Harry. The Queen is struck by his beauty and the two stare at each other. Hearing a distant gunshot and fearing the deer will be shot, the Queen shoos the animal away and decides to carry out Blair's recommendations. While preparing to return to London to attend a public funeral for Diana, the Queen is heartbroken to learn that the deer has been killed on a neighbouring estate, asks to see the stag, and is upset at its loss.\nThe royal family finally returns to London to inspect the floral tributes to Diana. While watching live television coverage with his staff, Blair becomes angry and disappointed at his advisers, declaring that the Queen is admirable and that Diana had rejected everything the Queen held most dear. The Queen later follows Blair's advice to make a public statement on live television, in which she speaks about the life and legacy of Diana and describes her as an exceptional and gifted human being. Two months after Diana's death, Blair visits Buckingham Palace to attend a weekly meeting with the Queen. The Queen, finally displaying a compassionate response to Diana's death, has slowly regained her popularity. However, she believes that Blair has benefited himself from her acquiescence to his advice and that she will never fully recover from that week. The Queen warns Blair that he will find that public opinion can rapidly turn against him, and states that life in Britain has changed and that the monarchy must modernise in the future. When Blair suggests that he can help with this, the Queen replies to him: \"Don't get ahead of yourself, Prime Minister. Remember, I'm supposed to be the one advising you\". The Queen, realising she must move forward making concessions as the position of the monarchy has changed over time, finally softens her stance with the Prime Minister. She invites him to join her for a walk in the gardens at Buckingham Palace. The film ends with The Queen and The Prime Minister walking together."}