{"mid": "QuestForCamelot", "IMDB_id": "tt0120800", "title": "Quest for Camelot", "plot": "Kayley's father, Sir Lionel, is one of the knights of the Round Table. Kayley wants to be a knight like her father. At Camelot, one of the knights, Ruber - wanting to become king of Camelot instead of King Arthur - attempts to kill Arthur, but Lionel intervenes and is killed. Ruber flees Camelot in exile after being rebounded by Excalibur. At Lionel's funeral, Arthur said she and her mother would be welcomed in Camelot.\n10 years later, a griffin attacks Camelot, stealing Excalibur. Merlin's falcon Ayden attacks the griffin and the sword falls into the Forbidden Forest. Meanwhile, Ruber invades Kayley's home, holds everyone hostage and uses a potion he obtained from some witches to create steel warriors from his human henchmen and a rooster who becomes Bladebeak. He plans to use Juliana, Kayley's mother to gain entrance into Camelot.\nKayley escapes the henchmen and enters the Forbidden Forest where she encounters Garrett; a blind hermit, and Ayden. Kayley convinces him to help her find Excalibur and learns that Garrett was once a young stable boy in Camelot. The stable caught fire and Garrett was rescuing the horses when one of them blinded him by accident. But Lionel still believed in Garrett and taught him to adapt.\nThey enter Dragon Country and meet the funny two-headed dragon named Devon and Cornwall who do not like each other, cannot breathe fire or fly (which is why they are bullied by other dragons), and both want to be individual dragons. Devon and Cornwall decide to join to the group; Garrett reluctantly agrees after Kayley manages to convince him.\nLater, they discover that Excalibur is no longer where the griffin dropped it. Kayley distressfully babbles on, causing Garrett to miss Ayden's signal and is injured by one of Ruber's men. Kayley drags Garrett away as the thorn bushed creatures hold Ruber and his men captive. Kayley escorts Garrett into a small cave and apologizes profusely as he lays there, but he tells her it is all right, and they realize that they have fallen in love as Garrett is healed by magical forest plants.\nLater, the group goes into a dark cave where it lives an ogre who holds Excalibur; currently using it as a toothpick. Kayley succeeds in getting Excalibur and they escape before Ruber and his men get to it.\nExiting the forest, Garrett stays behind, feeling unwanted in Camelot. After he leaves, Ruber captures Kayley and takes Excalibur. Devon and Cornwall, who witnessed this, rush to Garrett convincing him to go save Kayley. By working together for the first time, Devon and Cornwall are able to fly and breathe fire. Meanwhile, Kayley meets her mother; Bladebeak releases Kayley from her ropes and she runs to find Ruber. Garrett finds Kayley and they go inside the castle.\nInside, Ruber tries to kill Arthur with Excalibur; now bonded to his arm. Kayley and Garrett intervene and trick Ruber into returning Excalibur to the stone, causing its magic to disintegrate Ruber and revert the mechanical men, including Bladebeak, back to normal. Later, with Camelot restored to its former glory, Kayley and Garrett become knights of the round table."}