{"mid": "QuietPlease", "IMDB_id": "tt0038011", "title": "Quiet Please!", "plot": "Tom's nemesis, Spike, is trying to take a nap, but is awoken by Tom Cat chasing Jerry Mouse with a frying pan. After being hit several times, an annoyed Spike tries to go back to sleep. But he is awoken again by Tom's rather inaccurate use and tossing away of a rifle, which hits Spike on the head. The canine buries his head in his pillow, but is woken a third time by Tom trying to whack Jerry with the flat of an axe, but getting Spike instead. Fed up, Spike grabs Tom, and angrily tells him that he is becoming a nervous wreck, which he demonstrates by pulling his tongue, producing a crazed look on his face. First calmly, then viciously, he warns Tom that if there is one more sound, no matter who makes it, he will skin Tom alive. On the side, Jerry grins and nods happily.\nSpike settles down to sleep, and Tom sighs with relief. Jerry then whistles at Tom, showing him a drawing of a cat labelled \"STINKY\". Tom zooms after him, but stops abruptly when Jerry holds up a spoon and frying pan right next to Spike, ready to bang. Jerry even pokes and whacks the cat with the spoon, but when Tom turns to attack, Jerry renews the threat. Tom sneaks around the corner, and grabs the noisemakers from behind. Jerry's next trick is to set up a lamp cord to trip Tom. Tom does trip and falls toward a table full of wine glasses. From midair, he fantastically manages to push the table away and replace it with a pillow, on which he falls quietly. As Jerry gets ready to fire a large rifle, Tom races to stick his fingers in the gun barrels first, after which Jerry fires. As Tom examines his throbbing fingers, Jerry prepares to push a colossal grandfather clock to the floor. Tom can do nothing but stick his fingers in Spike's ears and hope it muffles the crash, which it amazingly does. Jerry begins to drop light bulbs off the mantelpiece, but Tom acrobatically catches them all. But Jerry plugs his tail into the light socket, lighting poor Tom like a Christmas tree, and pushes a roller skate under the cat's foot for final measure, sending him crashing into Spike!\nSpike half awakens, but Tom quickly picks him up and lulls him back to sleep singing Rock-a-bye Baby and then somewhat strange version of Brahms' Lullaby while pouring an entire bottle of \"Knock-Out Drops\" into Spike's mouth, and nose. As Tom finishes the song, he lifts Spike's right eyelid to reveal: \"OUT COLD\". Jerry comes in triumphantly and noisily banging a drum, to no effect. Tom repeatedly imitates numerous percussion instruments on the KO'ed Spike. He plops himself on top of the dog, who doesn't stir, and shows the mouse the bottle of Knock-Out Drops. This causes Jerry's mouth to drop, and then his face to fall, he is beaten. In the kitchen, the mouse writes his last will: \"My last will – to Tom, my favorite cat I leave my sole earthly possession – ONE CUSTARD PIE. Signed: Jerry.\" Tom reads it, and answers, \"One custard pie?! Let me have it!\" And Jerry does – right in the puss.\nThe chase resumes in full force until Tom stops in horror, as the dog is snarling. However, when the dog doesn't otherwise move, the cat pulls up Spike's chin to reveal Jerry faking it. When he sees Tom, he continues to imitate a dog by barking, then he bites Tom right on the nose. Tom takes a short break to watch Jerry attempt to wake Spike by yelling in his ear, pushing his back, and stabbing him in the rear with a pin. However, Spike's left eyelid reveals that he is \"STILL OUT COLD\". Then Tom swings a hammer at Jerry, who takes off. He stops the cat next to a chair and graciously pulls out a larger hammer from underneath, for Tom. Also graciously, Tom hands the mouse the smaller hammer and prepares to flatten Jerry with the big one, but Jerry smashes Tom's foot first and runs as Tom yowls.\nTom is just recovering, but gasps when Jerry places a huge stick of dynamite beneath Spike, and lights the fuse. Tom attempts to pull it out from under Spike, but just then, the knock-out drops finally wear off. Spike awakens and growls at him – Tom smiles, slides the dynamite back under Spike (not known for being the brightest dog) and escapes, before it explodes. A battered Spike with some fur missing and an anchor tattoo revealed on his arm, then gives Tom a thorough beating off-screen. Finally, Spike makes Tom, now bruised, bandaged and blind, rock a cradle in which Spike is lying comfortably. Jerry takes advantage by relaxing next to him and hanging a \"Do Not Disturb\" sign!"}