{"mid": "RabbitSeasoning", "IMDB_id": "tt0045062", "title": "Rabbit Seasoning", "plot": "The cartoon finds a row of signs saying it's rabbit season. It is revealed that Daffy Duck is the one putting up the signs, stating that while he knows it's unsporting, he has to have some fun \"and besides, it's really duck season.\"\nElmer Fudd then appears and notices rabbit tracks that Daffy left, leading to Bugs' hole. He pokes his gun into the hole, threatens to blast him out if he doesn't come out, and then follows through on his threat. Bugs Bunny, however, appears out the other side and begins a conversation with Elmer about rabbit season. When Elmer fails to realize that Bugs is a rabbit, Daffy emerges from his hiding spot, disgusted by this, and points out that Bugs is a rabbit, which the latter confirms, asking if Elmer would prefer to shoot him now or wait until he gets home. Daffy eagerly shouts for the first option and Bugs rebukes him, \"You keep out of this! He doesn't have to shoot you now!\" Daffy angrily asserts, \"He does so have to shoot me now!\" and outright demands that Elmer do so. Elmer looks confused for a few seconds, but complies as Daffy sticks his tongue out at Bugs. The shot dislocates his beak to the back of his head, and Daffy replaces his beak before requesting to run through what they just said again. Bugs complies, and upon reaching Bugs' word swap, Daffy calls him out on \"pronoun trouble\", saying \"It's not 'he doesn't have to shoot you now.' It's 'he doesn't have to shoot me now.' WELL, I SAY HE DOES HAVE TO SHOOT ME NOW!\" Subsequently, Daffy commands Elmer to shoot him again, which he does. Daffy fixes his beak again and is about to rant at Bugs before realizing that he may fall into the trap again. He decides to speak to Elmer instead, confirming that he is a hunter and that it is rabbit season. Bugs interjects, asking what Elmer would do if Daffy was a rabbit. Daffy repeats the question angrily, and has enough time to realize what he said (looking towards the camera and piteously saying \"Not again\") before Elmer shoots him. Daffy fixes his bill once more and laughs sarcastically at Bugs for his trick.\nAt that point Elmer grows impatient and begins firing at them both. Bugs and Daffy hide in Bugs' hole, and the latter checks to see if he's gone at the former's behest. He is shot again, and in a daze rejects Bugs' suggestion of being a decoy, whereupon the former dresses up as a woman (wearing a Lana Turner-style sweater). He manages to fool Elmer briefly, but a peeved Daffy demands that he reveal his identity out of sheer honesty. When he prods to ask if Bugs has anything to say out of sheer honesty, \"she\" replies that she would love a duck dinner. A lovestruck Elmer shoots Daffy, who removes his beak by hand as he is shot and replaces it afterwards. The duck approaches the rabbit, briefly apologizes for suspecting him, and then removes his wig to expose him and commands Elmer to shoot him. Bugs responds by asking, \"Would you like to shoot him here or wait till you get home?\" Daffy attempts to escape any more tricks by choosing the latter option, whereupon he joins Elmer on a walk to his cabin. One gunshot later, Daffy walks back to Bugs, fixes his beak, and tells the rabbit, \"You're despicable.\""}