{"mid": "RabbitFire", "IMDB_id": "tt0043953", "title": "Rabbit Fire", "plot": "Daffy Duck lures Elmer Fudd to Bugs Bunny's burrow, and watches from aside when Elmer attempts to shoot Bugs. But Bugs informs Elmer that it isn't rabbit season, but instead duck season. Daffy emerges, irate, and attempts to convince Elmer that Bugs is lying. Their conversation breaks down into Bugs leading Daffy to admit it is duck season by a number of verbal plays.\nOnce Daffy admits it is duck season, Elmer fires his shotgun at Daffy, causing the duck to suffer a temporary setback before he tries again. This repeats multiple times during the short, with Daffy trying different ploys to get Elmer to shoot Bugs, but Bugs continues to outwit him. After Daffy is shot for the third time, he walks away. Elmer tries to shoot him, but no more shells come out of his gun. Thrilled, Daffy comes back and grabs Elmer's gun to make sure, only to be shot with the last shell.\nDaffy then sees a sign that Bugs has nailed to a tree saying \"Duck Season Open\". As he sees Elmer approaching, he disguises himself as Bugs, telling him that it's duck season. Bugs then appears disguised as Daffy, complete with webbed feet and fake bill, and asks Daffy why he thinks it's duck season. Daffy points at the tree where he previously saw the \"Duck Season Open\" sign. However, the sign nailed to that tree now reads \"Rabbit Season Open\", implying that Bugs replaced the signs. Elmer, of course, shoots Daffy. After Daffy gets blasted, he goes up to Bugs and says, \"You're desthpicable!\" The two walk away, getting out of their costumes as Daffy rants to Bugs how despicable he is. Ignoring Daffy, Bugs then begins to read duck recipes from a cookbook that he pulls out of his rabbit hole, and Daffy does the same with a rabbit recipe cookbook that he also pulls from the rabbit hole (though why Bugs is disturbingly keeping a rabbit recipe book in his own home is unknown and goes unquestioned). Elmer tells them he's a vegetarian and only hunts for the sport of it (although, in previous episodes, it has been stated that he was hunting Bugs for rabbit stew or the like). Outraged, Bugs gets in Elmer's face and claims, \"Oh, yeah? Well, there's other sports besides huntin', ya know!\" Daffy then offers to play tennis (\"Anyone for tennis?\"). Elmer blasts him again, tells Bugs that he's next, and then begins shooting and chases both of them all the way to the rabbit hole. Bugs comes out of his hole and accuses Elmer of \"hunting rabbits with an elephant gun,\" suggesting Elmer to shoot an elephant instead. Just as Elmer is considering it, a huge elephant appears from literally nowhere, threatens Elmer in a Joe Besser voice (\"You do and I'll give you such a pinch!\"), and preemptively pounds him into the ground before striding off.\nElmer finally loses patience and decides to take out both Bugs and Daffy. Daffy comes into the scene, disguised as a hunting dog and Bugs comes in as a lady hunter. It appears that the outrage of Elmer hunting for sport rather than food has united both rabbit and duck against him. Elmer, however, sees through their disguise and threatens to shoot them. The cartoon climaxes when Bugs and Daffy argue by a tree with a sign that starts with the words \"Rabbit Season.\" Bugs and Daffy continue to pull off the sign to alternatively reveal it is \"Duck Season\" or \"Rabbit Season\" until they hit a final sign, proclaiming it to be \"Elmer Season.\" The tables turned, Elmer starts running and Bugs and Daffy, dressed as hunters, begin to stalk Elmer."}