{"mid": "RabbitRampage", "IMDB_id": "tt0048529", "title": "Rabbit Rampage", "plot": "When Bugs realizes who is in charge of the feature, he makes plain his desire not to be a victim to an animator who plans on making him look bad. With that said, Bugs is about to get back into his hole, but the animator erases it, causing Bugs to jump headfirst into the ground. After Bugs stands up, he restates his desire not to work with the animator, who puts yellow paint on Bugs' back, implying that Bugs is a coward. Bugs grabs the brush and breaks it in half.\nBugs emphatically states that he will report the animator to Warner Bros. and calls the animator a menace to society, while the animator draws a picket sign (\"I won't work\") in Bugs's left hand. When Bugs sees the sign, he throws it on the ground, off screen. Bugs asks if the animator is trying to get him fired, before explaining that he has become a good asset to the studio, which gives the animator time to draw another picket sign (\"I refuse to live up to my contract\"). After throwing away the last sign off-screen, Bugs returns, wiping off the yellow paint with a towel. Afterwards, Bugs agrees to work on the picture, but pauses once he sees that the animator drew a hat on his head, prompting Bugs to throw it on the ground, stating that the animator knows he's not supposed to wear a hat. In response, the animator draws a big pink women's hat, and Bugs throws it on the ground, too. This cycle continues with very ridiculous hats and wigs until Bugs gives up. The animator draws a rotated forest, and Bugs tries to get in his hole by climbing down a nearby tree. The animator draws an anvil on Bugs's tail, causing Bugs to fall on a street, later rolling into an empty area.\nAngry, Bugs incoherently yells at the animator, which the animator responds to by erasing Bugs's head. When Bugs notices this, he taps one foot impatiently and points at the spot where his head existed. The animator then draws a jack-o'-lantern on Bugs's body. When Bugs realizes this, he demands it to be corrected, which the animator supplies by simply adding rabbit ears to the existing head, infuriating Bugs even further. The animator erases the pumpkin head and then draws a tiny version of Bugs's head. Bugs does not realize what has happened until he pulls a carrot out of his pocket, stopping short when he sees that something else is wrong. He then takes notice of his high-pitched voice. He smacks his hand against his face and realizes that his head is now small. He angrily requests that the animator draw his head back in properly, which he does, except he forgets to apply the ears. Bugs requests the ears to which the animator puts in human ears. Bugs requests that he have long rabbit ears, to which the animator then draws long, droopy rabbit ears, only to revert them back when Bugs snaps at him not to be \"so danged literal.\"\nNow with his ears back, Bugs walks away, only to have his tail erased and replaced with a horse's tail. When Bugs states that a horse's tail belongs on a horse, the animator erases Bugs's body and redraws him as a horse. Bugs, while standing on two hindlegs and eating a carrot, points out to the artist that this misinterpretation will not make his employers happy, allowing the animator to pretend to comply with what Bugs is telling him by erasing Bugs's horse body and drawing him as a more abstract, simplified rabbit with big cheeks and feet. The abstract version of Bugs warns the animator that this latest bit of teasing can lead to serious consequences for both of them, which leads the animator to draw him back to normal.\nWhen Bugs sardonically asks the animator if he wants to paint him into a grasshopper, the animator takes out a brush and Bugs takes it back. Bugs attempts to make friends with the animator, promising that they could do something popular. In response, the animator draws two clones of Bugs, prompting Bugs to shove the clones out of the picture. As Bugs states that he will not leave the spot until the animator gets the boss, the animator paints Bugs on a railroad track with a train coming through a tunnel behind it. As the train passes by, Bugs leans on a rock and says that there is still one way out and he cannot stop Bugs. He jumps up and pulls down a card with the words \"The End.\"\nThe camera pulls back to the animator, who is revealed to be Elmer Fudd, in a cameo appearance, who laughs and states his delight to the audience, \"Weww anyway, I finawwy got even with that scwewy wabbit!\""}