{"mid": "RabbitHood", "IMDB_id": "tt0041779", "title": "Rabbit Hood", "plot": "There is a wall covered with anti-poaching notices and wanted posters of Robin Hood and Little John. Bugs is trying to silence an alarm attached to a carrot he just pulled out of the King's Carrot Patch. He is caught by the Sheriff of Nottingham and is about to be put to the rack when Little John (depicted as a fat goonish fellow) appears and introduces Robin Hood. However, Robin Hood does not appear. Bugs and the Sheriff continue to converse, and Bugs averts the latter's attention by lying about the king's arrival. Bugs clubs the Sheriff while the latter is bowing and runs off.\nWhile examining the castle wall in an attempt to scale it, Bugs is chased by the Sheriff up to the Royal Rose Garden, which the Sheriff regards as \"royal ground\". Here, Bugs dupes the Sheriff once again by acting as a real estate agent and successfully selling the land to the Sheriff, who plans to turn the garden into a \"six-roomed Tudor\". As The Sheriff is building the house, he suddenly realizes that he's been tricked and, now infuriated, declares revenge, all the while hitting himself on the head with the hammer (\"OOOH! I HATE MYSELF! I DO! I DO! I DO!\").\nThe Sheriff shoots an arrow which grazes Bugs while he is scaling the castle wall. Bugs falls into Little John's hands. Bugs then uses the opportunity to introduce Little John and the Sheriff to each other several times over, diverting the Sheriff's attention once again. During the exchange, the Sheriff spies Bugs leaving and angrily shrugs off Little John, saying \"Stop it, Oaf!\". Bugs convinces the Sheriff that the King is indeed coming while the Sheriff tries not to be fooled once again. But when the Sheriff turns to prove to himself that Bugs is just lying, he is surprised to see Bugs dressed first as a clarion player and then as a royal crier before reappearing as the King. The Sheriff recognizing Bugs as the King, obligingly bows down. The famous knighting scene ensues. Afterwards, the Sheriff, already dazed from the repeated hits, sings \"London Bridge Is Falling Down\" and falls on a cake quickly baked by Bugs during the song.\nBugs hears Little John once again introducing Robin Hood, but Bugs interrupts and mocks Little John, remembering Robin's failure to appear the first time. This time however, Little John tells Bugs not to \"talk mean like that\", as this time, he is telling the truth, and Robin indeed appears (played by Errol Flynn, in live-action footage from The Adventures of Robin Hood). Bugs, however, doubts that's \"him\"."}