{"mid": "RabbitProofFence", "IMDB_id": "tt0252444", "title": "Rabbit-Proof Fence", "plot": "Set in 1931, two sisters, 14-year-old Molly and 8-year-old Daisy, and their 10-year-old cousin Gracie live in the Western Australian town of Jigalong. The town lies along the northern part of Australia's rabbit-proof fence, which runs for several thousand miles.\nThousands of miles away, the official Protector of Western Australian Aborigines, A. O. Neville (called Mr. Devil by them), signs an order to relocate the three girls to his re-education camp. The children are referred to by Neville as \"half-castes\", because they have one white and one Aboriginal parent. Neville's reasoning is portrayed as: the Aboriginal peoples of Australia are a danger to themselves, and the \"half-castes\" must be bred out of existence. He plans to place the girls in a camp where they, along with all half-castes of that age range, will grow up. They will then presumably become labourers and servants to white families, regarded as a \"good\" situation for them in life. Eventually if they marry, it will be to white people and thus the Aboriginal \"blood\" will diminish. As such, the three girls are forcibly taken from Jigalong by a local constable, Riggs, and sent to camp at the Moore River Native Settlement, in the south.\nDuring their time at the camp, Molly notices a rain cloud in the sky and infers that if she, Gracie and Daisy were to escape and go back to Jigalong on foot, the rain will cover their tracks, making them difficult to follow. Gracie and Daisy decide to go along with Molly and the three girls sneak off without being noticed and run away. Moments after their escape, an Aboriginal tracker, Moodoo, is called in to find them. However, the girls are well trained in disguising their tracks. They evade Moodoo several times, receiving aid from strangers in the harsh Australian country they travel. They eventually find the rabbit-proof fence, knowing they can follow it north to Jigalong. Neville soon figures out their strategy and sends Moodoo and Riggs after them. Although he is an experienced tracker, Moodoo is unable to find them.\nNeville spreads word that Gracie's mother is waiting for her in the town of Wiluna. The information finds its way to an Aboriginal traveller who \"helps\" the girls. He tells Gracie about her mother and says they can get to Wiluna by train, causing her to break off from the group and attempt to catch a train to Wiluna. Molly and Daisy soon walk after her and find her at a train station. They are not reunited, however, as Riggs appears and Gracie is recaptured. The betrayal is revealed by Riggs, who tells the man he will receive a shilling for his help. Knowing they are powerless to aid her, Molly and Daisy continue on. In the end, after a harsh long journey, the two sisters make it home and go into hiding in the desert with their mother and grandmother. Meanwhile, Neville realizes he can no longer afford the search for Molly and Daisy and decides to suspend the pursuit.\n=== Epilogue ===\nThe film's epilogue shows recent footage of Molly and Daisy. Molly explains that Gracie has died and she never returned to Jigalong. Molly also tells us of her own two daughters; she and they were taken from Jigalong back to Moore river. She managed to escape with one daughter, Annabelle, and once again, she walked the length of the fence back home. However, when Annabelle was 3 years old, she was taken away once more, and Molly never saw her again. In closing, Molly says that she and Daisy \"... are never going back to that place\". That is the end. This shows Molly and Daisy at the end."}