{"mid": "RabbitOfSeville", "IMDB_id": "tt0042871", "title": "Rabbit of Seville", "plot": "The cartoon opens with people filing in to see The Barber of Seville in an amphitheatre. In the back of the theater, Bugs is chased by Elmer, who is shooting his gun, and runs through an open stage door. Elmer, now on stage behind the curtain, does not see it rise when Bugs raises the curtain. The conductor, after a brief confused look at his watch, shrugs, then starts the orchestra, which causes Elmer to turn wide-eyed towards the audience. Bugs then steps out from behind the door of a stage barber shop, dressed in a barber's outfit, and forces Elmer into getting a shave, rendering him \"nice and clean, although [his] face looks like it might have gone through a machine.\"\nAfter recovering, Elmer starts the chase again -saying his only line \"Oh, wait till I get that wabbit!\"-, but is stopped by Bugs dressed as a temptress, singing, \"What would you want with a wabbit? Can't you see that I'm much sweeter? I'm your little señorita. You're my type of guy, let me straighten your tie, and I shall dance for you.\" (no dialogue is heard again from this point on until the end) He then ties Elmer's shotgun into a bowtie and snips off Elmer's pants suspender buttons, snapping the scissors like castanets. After being thoroughly embarrassed when his pants fall down, Elmer sees through Bugs' disguise, he tries shooting him, but is blown back into the barber's chair. Bugs has another go with Elmer's scalp, beginning with a scalp massage with his hands and feet, turning his head into a fruit salad bowl (complete with cherry on top). Elmer chases Bugs again, but Bugs plays a snake charmer to get an electric shaver to chase Elmer. Elmer disables the shaver with a shotgun blast and chases Bugs back to the barber's chairs. Bugs and Elmer raise their chairs to dizzying heights, and Bugs cuts loose a stage sandbag which bonks Elmer, causing Elmer's chair to drop back down into the barbershop while spinning around. After receiving the traditional barber's gratuity from the dazed Elmer, Bugs then throws him in a revolving door to further daze him and waltzes him back into the barber's chair.\nBefore Bugs' third go-round with Elmer's scalp, he gives one of his feet a pedicure with a can opener, hedge clippers, file, and red paint. That is followed by growing a beard on Elmer's face and shaving it with a miniature mower, and finally a mud masque for the face which Bugs handles like cement. Then it's back to the scalp as Bugs massages it with hair tonic first, then adds \"Figaro Fertilizer\", causing hair to grow from Elmer's head which sprouts into flowers. A short 'arms chase' ensues as a result where Bugs and Elmer chase each other across and off-stage with bigger weapons (first axes, then guns, then cannons). Finally, Bugs ends the chase by offering flowers, chocolates, and a ring to Elmer, who ducks offstage and comes back as the blushing bride. The tune then briefly switches to the \"Wedding March\" by Mendelssohn, before finishing with Bugs carrying his 'bride' up a long flight of stairs, through a false doorway (opening up onto thin air), and drops Elmer down head-first into a wedding cake labeled \"The Marriage of Figaro\". Bugs then looks at the camera, smirks, and breaking the fourth wall says in the same way as his catchphrase, \"Eh, next?\""}