{"mid": "RaceForYourLifeCharlieBrown", "IMDB_id": "tt0076591", "title": "Race for Your Life, Charlie Brown", "plot": "The Peanuts gang heads off to Camp Remote somewhere in the mountains. Charlie Brown is accidentally left behind by the bus while at a desolate rest stop. He is then forced to hitch a harrowing ride on Snoopy's motorcycle in order to make the rest of the journey to the camp, accompanied by rock guitar type riffs while he is shouting in fear at Snoopy's wild driving.\nUpon their arrival, the kids are immediately exposed to the regimentation and squalor of camp life which is a stark contrast to their comfortable residences back home. They are unfamiliar with the concept that the camp schedule is in the 24-hour clock (Franklin asks if \"oh-five-hundred\" is noon, and Sally thinks \"eighteen-hundred\" is a year). Although they do their best to adjust to the rigors of camp life, Snoopy, in a tent of his own, enjoys an ice cream sundae while watching TV on his portable set.\nThe gang must contend with a trio of ruthless bullies (and their cat, Brutus, vicious enough to intimidate even Snoopy and Woodstock) who openly boast of them having won a raft race every year they have competed. The only thing that keeps them at bay is Linus using his security blanket like a whip (which also gets him unwanted attention from Sally due to her praising the courage of her self-proclaimed \"Sweet Babboo\"). It is revealed that they have only won through outright cheating — using a raft equipped with an outboard motor, direction finder, radar and sonar. They also resort to every trick they could think of to hamper or destroy everyone else's chance to even make it to the finish line, much less win the race.\nThe kids are broken into three groups: the boys' group (consisting of Charlie Brown, Linus, Schroeder, and Franklin), the girls' group (consisting of Peppermint Patty, Marcie, Sally, and Lucy), and Snoopy and Woodstock. Charlie Brown is the very reluctant leader of the boys' group, struggling with his insecurity but making a good effort to lead and implement well-thought out decisions. His anthesis is Peppermint Patty, the leader of the girls' group, who is very confident despite her incompetence as a leader. She insists on every decision, no matter how inconsequential, being confirmed by a vote of secret ballots. Predictably, when the voting is tied or she disagrees with the outcome, she often overrules the decision, to the disdain of the other girls. The bullies are overconfident; they use their cheating to burst ahead, but in their boasting they fail to watch where they are going and crash into a dock, which costs them a lot of time and effort to dislodge their boat while the others sail past.\nThe groups see many unique sights along the river race, such as mountains, forests, and a riparian logging community of houses built on docks. However, they also run into different obstacles: getting lost, stranded, storms, blizzards, and sabotage from the bullies. Snoopy abandons the race to search tirelessly for Woodstock when a storm separates them; after a long search, they manage to find each other and are joyfully reunited. Charlie Brown grows increasingly into his leadership role; ultimately, after the bullies sabotage both the boys' and girls' rafts, Charlie is asked to be leader of both groups — only to find himself treated more as a scapegoat than a leader.\nThanks to Charlie Brown's growing self-confidence and leadership, the gang is about to win the race at the climax after overcoming considerable odds. Unfortunately, Patty incites the girls to celebrate too soon and they accidentally knock the boys overboard in their excitement; when they attempt to rescue them, the bullies seize the opportunity to pull ahead.\nThe bullies gloat about their apparently imminent victory. However, their brash over-confidence, infighting, and constant carelessness during the race has seen them become involved in numerous mishaps, causing them to suffer substantial damage to their raft. Just shy of the finish line, their raft finally gives out and sinks. This leaves Snoopy and Woodstock as the only contenders left. Brutus slashes Snoopy's inner tube with a claw, but Woodstock promptly builds a raft of twigs with a leaf for a sail and continues toward victory. When Brutus tries to attack Woodstock, Snoopy decks him, and Woodstock wins the race. Conceding defeat, the bullies begin to vow vengeance next year, but their threats are humiliatingly cut short when Snoopy hands Brutus a rough beating after he threatens Woodstock again.\nAs the gang boards the bus to depart for home, Charlie Brown decides aloud to use the experience as a lesson to be more confident and assertive, and to believe in himself. Unfortunately, right after he finishes speaking, the bus leaves without him for the second time, and as before, he is forced to hitch a ride with Snoopy again."}