{"mid": "RaceWithTheDevil", "IMDB_id": "tt0073600", "title": "Race with the Devil", "plot": "Roger Marsh and Frank Stewart own a successful motorcycle dealership in San Antonio, Texas. Together, with their wives Kelly and Alice, along with Roger and Kelly’s small dog, they leave San Antonio in a recreational vehicle (RV) for a much anticipated ski vacation in Aspen, Colorado.\nAlong the way, they set up camp in a desolate meadow of central Texas, where Roger and Frank race their motorcycles together. Later that night after their wives retire to the RV, the men witness what turns out to be a Satanic ritual human sacrifice a short distance from their campsite across a river.\nAfter being chased by the Satanists and barely escaping with their lives, they report the incident to Sheriff Taylor, who investigates their report but attempts to convince them that they probably only saw hippies killing an animal. Unbeknownst to the sheriff, Roger steals a sample of dirt stained with the murder victim's blood, intent on delivering it to the authorities in Amarillo. At the same time, the wives find a cryptic message-a rune-pinned to the broken back window while cleaning, and steal books about occultism from a local library to further research the incident, unknowingly spied on by an unseen man in a red truck. One such library book reveals that the ritual is what Satanists often perform to gain magical powers. As the foursome leaves town, the sheriff notices a red truck that begins to follow them making it clear that he is either aware or part of the Satanic cult.\nWhen the couples arrive at a trailer park, Kelly is stared at by its residents while in a swimming pool and wants to return home. A couple at the park invites them to dinner. While at the restaurant/nightclub, Kelly is stared at menacingly by one of the musicians. When they return from dinner at the club, they discover that Kelly's dog has been killed and hanged causing them to immediately leave the park. Shortly afterwards, they're forced to fight off two rattlesnakes planted in their RV by the cultists. The frightened Kelly and Alice begins to scream and goes off in a panic, causing Frank to accidentally drive into a tree before the snakes are killed. The next day Kelly's dog is buried. Roger and Frank then purchased a shotgun and head towards Amarillo while being spied on by a steadily increasing number of cultists who seem to be networked throughout numerous small Texas towns. When Roger tries to call long distance for the highway patrol, he finds one dead payphone and another with a \"bad connection\" and is told long distance service is down throughout their towns by a \"big wind from up north\".\nThe couples then leave for Amarillo and staged a showdown with the cult members during a high-speed chase that pits their RV against numerous trucks and cars. Roger and Frank kill and injure most of the attackers and escape, including from a school bus trick \"accident\" that Frank sees through since it's done on a Sunday.\nThe foursome stop in a field at nightfall as they cannot continue until morning since the RV’s headlights has been damaged during the chase. They begin to celebrate when they pick up a radio signal coming from Amarillo. In the middle of their celebration, the foursome hears chanting outside the RV and find themselves surrounded by cult members wearing black robes with hoods, including the sheriff and the couple they had dinner with. The film ends as the cultists light a ring of fire around the RV trapping the couples inside while the chanting continues."}