{"mid": "RadioDays", "IMDB_id": "tt0093818", "title": "Radio Days", "plot": "Joe (Woody Allen), the narrator, relates how two burglars got involved in a radio game after picking up the phone. He goes on to explain that he associates old radio songs with childhood memories.\nDuring the late 1930s and early 1940s young Joe (Seth Green) lived in a modest Jewish-American family in Rockaway Beach. His mother (Julie Kavner) always listened to Breakfast with Irene and Roger. His father (Michael Tucker), who regularly gave him a beating, kept his occupation secret. Joe later found out that he was ashamed of being a taxi driver. Other family members were Uncle Abe and Aunt Ceil, grandpa and grandma, and Aunt Bea (Dianne Wiest). The latter was a serial dater, always on the lookout for a potential husband.\nJoe's own favourite radio show was The Masked Avenger. It made him dream of buying a secret decoder ring. In Joe's fantasy the Masked Avenger looked like a hero, but in reality the voice actor (Wallace Shawn) was short and bald. Other radio memories are stories about sporting heroes, news bulletins about World War II, a report of an extraterrestrial invasion, and a live report of the search for a little girl who fell into a well.\nWith his friends from school Joe was searching for German aircraft, but instead they saw a woman undressing in her bedroom. She later turned out to be their substitute teacher. Alone on the coast Joe saw a German U-boat, but he decided not to tell anyone because they wouldn't believe him.\nJoe was fascinated by the glitz and glamour of Manhattan, where the radio broadcasts were made. He visited the Radio City Music Hall, and described it as the most beautiful thing he ever saw.\nJoe collected stories of radio stars, including that of Sally White (Mia Farrow), whose dreams of becoming famous were hampered by her bad voice and accent. Starting as a cigar salesgirl she got stuck on the roof of the radio building with Roger, who was cheating on Irene. After she witnessed a crime the gangster Rocco (Danny Aiello) wanted to kill her, but following his mother's advice he ended up using his connections to further her career. She finally became a reporter of celebrity gossip.\nOn New Year's Eve Joe was brought down from his room to celebrate the transition to 1944. Simultaneously the radio stars gathered on the roof of their building. The narrator concludes that he will never forget those radio voices, although with each passing of a New Year's Eve they seem to grow dimmer and dimmer."}