{"mid": "Ran", "IMDB_id": "tt0326704", "title": "Ran", "plot": "Great Lord Hidetora Ichimonji, a powerful though now elderly warlord, decides to divide his territory among his three sons. Taro, the eldest, receives the First Castle and leadership of the Ichimonji clan, while Jiro and Saburo, as second and third sons, will be given the Second and Third Castles respectively; Hidetora is to retain the title of Great Lord. Two other visiting warlords, Lords Ayabe and Fujimaki, bear witness to the decision. Saburo objects, saying that it is foolish to rely on his brothers' loyalty. A faithful servant, Tango, also agrees. However, Hidetora takes Saburo's protests as an insult, and he exiles both men. However, Fujimaki, appreciating Saburo's frankness, takes him in.\nFollowing the division of Hidetora's lands amongst the two remaining sons, Taro's wife Lady Kaede, resentful of Hidetora's ruthless killing of her family, urges Taro to oust Hidetora. Taro makes a pretext of a conflict arising from an insulting song sung by Kyoami, Hidetora's fool, demanding Hidetora renounce his title. His son's disrespect shames Hidetora, causing him to storm out of the castle in anger. Hidetora travels to Jiro's castle, meeting with meeting with him and his wife, Sué, only to discover that like Taro, Jiro too openly disrespects him. Hidetora leaves Jiro's castle in disgust, and eventually Tango appears, bringing further news of Taro's betrayal. Against Tango's advice, Hidetora listens to his advisor Ikuro, taking refuge in the abandoned Third Castle.\nShortly thereafter, the castle is besieged by Taro and Jiro's combined forces, and virtually all Hidetora's followers are slaughtered. In the confusion, Taro is also killed from behind by Jiro's general, Kurogane. Alone and unable to commit seppuku, Hidetora succumbs to madness and wanders away from the burning castle, in full view of the astonished enemy. Hidetora is joined by Tango and Kyoami, who remain loyal, and seeking refuge in the wilderness, the three encounter Tsurumaru, the brother of Lady Sué, blinded and left destitute by Hidetora. Horrified by Tsurumaru's haunting flute song, Hidetora flees with his two followers.\nAs Taro is dead, Jiro moves into the First Castle as Great Lord. Suspicious, Lady Kaede threatens him into admitting his part in her husband's fall in battle, before herself stating that she cares only for her own future, and seduces him. Falling under Kaede's control, Jiro orders Kurogane to obtain Lady Sué's head. In defiance, Kurogane brings back the head of a kitsune statue instead, attempting to warn Jiro of Kaede's dangerous influence.\nTango encounters and kills two spies for Jiro, who have since been abandoned by him. One of them is Ikuro, who before dying warns him that Jiro is sure to send assassins after Hidetora, causing Tango to ride off to alert Saburo. Meanwhile, Tsurumaru and Sué, fleeing from Jiro, arrive at the ruins of a castle, encountering a wandering Hidetora; in guilt, he becomes even more insane, losing Kyoami as he runs into a nearby plain.\nRoused by Tango to seek his father, Saburo, Ayabe, Fujimaki, and their armies cross back into Jiro's territory. Goaded by Kaede to attack, and against the advice of his generals, Jiro hastily mobilizes his army for war. Notified by Kyoami of the situation, Saburo takes a small unit from the battlefield, successfully finding Hidetora, who has collapsed in the plain. Hidetora recovers his sanity, and he mournfully apologizes to Saburo for his foolishness, which Saburo accepts tearfully.\nAt the battlefield, Jiro attacks Saburo's force in Saburo's absence, but is forced to hastily retreat by the news that Ayabe, having deployed a decoy force, is in actuality marching on First Castle. While Saburo and Hidetora are returning together, a marksman in a unit of snipers sent by Jiro, shoots and kills Saburo. Overcome with grief, Hidetora also dies, and Tango and Kyoami mourn their deaths as Fujimaki and his army arrive bearing news of victory.\nSué, having given a picture of Amida Buddha to Tsurumaru to watch over him while he stays at the ruins, leaves to retrieve Tsurumaru's flute and is murdered by Jiro's vassal. As First Castle is attacked, Kurogane sees proof of Sué's death and confronts Kaede. She admits to her manipulation, having completed her plot for revenge now that the castle is doomed. Enraged, Kurogane decapitates Kaede in front of Jiro, before both Jiro and Kurogane go to their deaths in the subsequent battle.\nA solemn funeral procession is held for Saburo and Hidetora. Meanwhile, alone in the castle ruins, Tsurumaru stumbles, dropping the Amida Buddha image into the gorge below."}