{"mid": "RazorBladeSmile", "IMDB_id": "tt0159693", "title": "Razor Blade Smile", "plot": "Lilith Silver [Eileen Daly] was made a vampire in the 19th century when she attempted to\nstop a duel between a human and the vampire Sethane Blake Christopher Adamson]. Sethane shot\nand killed the human, Lilith shot Sethane, Lilith was shot, and Sethane\nrewarded her by making her a vampire. Lilith's first meal as a vampire was\non the human who shot her.Nowadays, Lilith dons her black, skintight, leather jumpsuit, leaves\nher breasts a-heaving, paints her lips blood red, and hires herself out as\nan assassin working for a man she calls Platinum [Kevin Howarth]. She is known as the\nAngel of Death, and her current hit list revolves around a select cadre of\nwealthy and influential people who call themselves the Illuminati, who\nclaim ancient roots on par with the Freemasons, and who wear rings that\nlook like eyes. Each time Lilith kills, she uses the same modus operandi.\nShe drinks their blood and then mangles their necks to obscure the bites,\nand she brings back the telltale ring. For such service, she is paid\n£250,000 [about what she needs to keep herself in leather].Unbeknown to Lilith, the head of the Illuminati is none other than\nher sire, Sethane Blake, and Sethane is concerned that the cadre is being\nsystematically knocked off. He suspects that the assassin may be a vampire\nbecause of the testimony made by a witness to Lilith's last killing. She\nsaw Lilith drinking her husband's blood and then followed Lilith to Club\nTransylvania, a nightclub for vampire wannabees. Sethane has set Detective\nInspector Raymond Price [Jonathan Coote], also a member of the Illuminati, to look for and\nstop the vampire angel.\nThings begin to heat up when Price gets closer and closer to Lilith.\nHe hires a photographer to photograph the 'vampires' at the Club, a move\nthat yields Price a photo of Lilith but yields the photographer a bite on\nthe neck. Price brings in Lilith for questioning, but his superior comes\nto the conclusion that Price is looney and releases Lilith. Not to be\ndaunted, Price sharpens a few stakes and sets up watch outside of Lilith's\nhouse, but all he gets is a stake in his own gut.Meanwhile, Lilith receives a package in her post. It's a videotape of\nPlatinum asking Lilith to return the last payment of 250,000 pounds\nbecause she was unable to produce the ring from that assassination (it\nfell into the bathtub and she didn't want to get her leather gloves wet).\nPlatinum is bound and bleeding and says that, if Lilith returns the money,\nhis captors will let him go. If not, he will be killed. Since Lilith has a\nsexual thing going with Platinum, she complies.It's a trap. As Lilith cuts the cords that bind Platinum, a dozen\nguns appear and fire on her. Wounded and bleeding but still standing, of\ncourse, Lilith gives Platinum a gun and tells him to split. Lilith then\nproceeds to take out those who are gunning for her. Unfortunately,\nPlatinum decided to hang around a bit longer so that he could take out a\nfew of the gunners. He winds up being confronted by Sethane.\nAs it happened back in the 19th century, Lilith appears just in time\nfor the duel between human and vampire. Sethane shoots Platinum. As\nPlatinum lay dying, Sethane offers Lilith a choice. In her wounded\ncondition, she needs blood. She can either take what's left of Platinum's\nblood or she can give to Platinum what's left of her blood and, thus, save\nPlatinum's life.Lilith makes the correct choice and, after a swordfight with Sethane\nin which she almost succeeds in beheading him, she only nicks his neck.\nSethane looks up amazedly and says, 'You've got good.' The vampire lovers\nembrace and congratulate each other on yet another game successfully\nplayed. [Original Synopsis by bj_kuehl.]"}