{"mid": "Razorback", "IMDB_id": "tt0087981", "title": "Razorback", "plot": "Jake Cullen (Bill Kerr) is babysitting his grandson at his house in the Australian outback when a massive razorback boar attacks him, smashing through his house and dragging away his grandson to devour alive. Jake is accused of murdering the child and while his account of the events are met with considerable skepticism, he is acquitted due to lack of evidence of a boar being responsible of the attack. The event destroys his credibility and reputation, however, and he vows revenge on the boar.\nTwo years later, American wildlife reporter Beth Winters (Judy Morris) journeys to the outback to document the hunting of Australian wildlife to be processed into pet food at a run-down factory. Beth gets video footage of two thugs, Benny Baker (Chris Haywood) and his brother Dicko (David Argue) illegally making pet food out of animals and is subsequently chased down by them by car. They catch up, force her off the road and attempt to rape her only to be chased off by the same boar that killed Jake's grandson. Beth attempts to take shelter in her car but the hog rips off the door, drags her out and eats her. With no witnesses, her disappearance is subsequently ruled an accident resulting from having fallen down an abandoned mine shaft after leaving her wrecked car.\nSome time later, Beth's husband Carl (Gregory Harrison) travels to Australia in search of her and encounters Jake, whom Beth interviewed during her initial report. Jake refers him to the local cannery where he meets Benny and Dicko, whom he convinces to take him along on their next kangaroo hunt, only to be abandoned by them when he spoils a potential kill. Carl is then attacked by a herd of wild pigs, spurred on by the giant boar, who chase him through the night and force him take shelter atop a windmill. The next morning the pigs knock over the windmill but Carl is saved by landing in the pond at the windmill's base, in which the pigs fear to swim.\nOnce the pigs leave Carl attempts to make his way back to civilisation, all the while suffering from dehydration-induced hallucinations, before finally reaching the house of Sarah Cameron (Arkie Whiteley): a friend of Jake who has been tracking and studying the local pig population and the only one who believes his story of the giant razorback. While recovering at Sarah's house, Carl and Sarah become intimate and he learns that something has been causing the wild pigs excess stress, leading them into unusual behavior such as increased aggression and cannibalizing their own young. Meanwhile, after learning that Carl had seen the razorback, Jake sets out for the pumping station and manages to shoot it with one of Sarah's tracking darts. He also finds Beth's wedding ring in the boar's feces which he returns to a grieving Carl, who resigns himself to returning home.\nAfter overhearing a radio conversation suggesting that Jake knows what really happened to Beth Winters, Benny and Dicko, fearful that Jake is attempting to implicate them in her death, attack him at his camp, breaking his legs with bolt-cutters and leaving him to be killed by the razorback. His remains are later found by Sarah and Carl, along with marks in the dirt made by Dicko's cleaver. Realizing that the brothers were responsible for both his wife and Jake's death, Carl attacks Benny at his and Dicko's lair, interrogating Benny by lowering him into a mine shaft before letting him fall down it. As Sarah rounds up a posse to hunt down the razorback using the tracker Jake shot into it, Carl corners Dicko at the cannery, but the razorback suddenly appears and mauls Dicko before Carl can shoot him. The razorback then chases Carl into the factory when Sarah suddenly arrives and is seemingly killed by the boar, who continues to pursue Carl even after impaling its throat on a broken pipe. In its maddened rampage, the razorback ends up damaging the cannery's generator which sends the machines running out of control as Carl lures the boar up onto a conveyor belt that throws it onto a giant fan, chopping it to pieces. After shutting down the machinery, Carl finds and rescues Sarah, who had merely been knocked unconscious, and the two embrace."}