{"mid": "RealGenius", "IMDB_id": "tt0089886", "title": "Real Genius", "plot": "A group of CIA officers watch a video presentation of a top-secret project called \"Crossbow\": a space shuttle mounted with a computer-guided laser weapon capable of incinerating a man on the ground with pinpoint accuracy. Researchers on the project have yet to devise a system to generate enough power to operate it. When it becomes clear that this weapon has no wartime applications and is intended solely for illegal assassinations, one agent decries the project as immoral and refuses to take part. The remaining agents discuss eliminating the dissenting agent before going to lunch.\nProfessor Jerry Hathaway meets high school student Mitch Taylor at the school's science fair. He informs Mitch that he has been admitted to Pacific Technical University, where he will room with physics \"legend\" Chris Knight. Hathaway is secretly developing the laser for the CIA, but instead of doing the work himself, he has his unpaid students do it, while misappropriating the project funding to remodel his house. Arriving on campus, Mitch meets Chris and is disappointed to learn that he is an irreverent slacker who spends his time pulling elaborate high tech pranks. Mitch also meets Jordan, a hyperkinetic female student, \"Ick\" Ikagami, a brilliant and affable foil to Chris's antics, and the mysterious Lazlo Hollyfeld, a middle-aged man who seems to be living in Mitch's closet. Hathaway's sycophantic graduate assistant Kent becomes hostile when Hathaway puts Mitch in charge of the laser project.\nUnder pressure to get results, Hathaway gives Chris an unrealistic timetable, which Chris dismisses. When Mitch is caught attending Chris' pool party instead of working in the lab, Hathaway berates him. The next day Mitch is mortified when a recording of his tearful phone call to his parents is played over a loudspeaker system during lunch, a prank conceived by Kent and his cronies. Humiliated, Mitch is ready to quit school. Chris convinces him to stay by explaining to him that Lazlo was the top genius at Pacific Tech in the 1970s, but suffered a breakdown when he learned that his theories were being used to build weapons. Chris tells Mitch that if he does not want to \"crack\" like Hollyfeld, he must learn to have fun, and the first order of business is to get even with Kent, calling it a \"moral imperative\" to do so. They accomplish this by disassembling Kent's car and rebuilding it inside his dorm room. Kent vows revenge.\nUnder increasing pressure from the CIA, Hathaway berates Chris for failing to solve the laser power problem and promises to fail him and prevent him from graduating. After a pep-talk from Mitch, Chris devotes himself to solving the power problem and achieving a perfect score on Hathaway's final exam. Mitch is accosted by Sherry Nugel, a beautiful older woman who seeks amorous encounters with the top ten geniuses in the country. Mitch turns her down, realizing he's in love with Jordan, and the two become a couple. Though Chris aces Hathway's exam, Chris and Mitch's efforts appear to be ruined when Kent sabotages the laser. In a fit of anger at the laser's destruction, he has an epiphany that solves the power problem. The beam of the redesigned laser has unlimited range and produces an estimated six megawatts of power, exceeding the original requirement.\nWhile the team celebrates its success, Lazlo insists that the high-energy laser can only be used as a weapon, and in fact that it must have been conceived for this purpose. Chris is devastated. Hathaway has removed the laser from the lab. Chris, Mitch, Ick and Jordan trick Kent into revealing the date when the laser is going to be tested by placing a microphone in his braces and convincing him that God is talking to him. The group tails Hathaway to a nearby Air Force base. While Chris and Mitch talk their way onto the base, Lazlo remotely cracks the laser's computer and changes its target coordinates to Hathaway's house, where the team has placed a huge tin of popcorn. Meanwhile, Chris and Mitch remove circuits that prevent the laser from overheating. When the laser beam hits the house, it is diffused by a prism placed by Chris and the popcorn heats and expands; the house bursts at the seams as popcorn pours out onto the lawn. Kent \"rides\" the flowing popcorn out of the front door unharmed and laughing, thinking the incident was religious in nature. The group, reveling in their success, greet an arriving Lazlo accompanied by Sherry, riding in a motor home pulling a trailer full of prizes he won in a sweepstakes. He and Sherry indicate they intend to run off together as he is the genius she's been looking for all this time. Hathaway arrives home and in disbelief, assesses his ruined home."}