{"mid": "ReAnimator", "IMDB_id": "tt0089885", "title": "Re-Animator", "plot": "At University of Zurich Institute of Medicine in Switzerland, Herbert West brings his dead professor, Dr. Hans Gruber, back to life. There are horrific side-effects, however; as West explains, the dosage was too large. When accused of killing Gruber, West counters: \"I gave him life!\"\nWest arrives at Miskatonic University in New England in order to further his studies as a medical student. He rents a room from fellow medical student Dan Cain and converts the building's basement into his own personal laboratory. West demonstrates his reanimating reagent to Dan by reanimating Dan's dead cat Rufus. Dan's fiancee Megan, who already thinks West is creepy, walks in on this experiment and is horrified.\nDan tries to tell Dr. Alan Halsey, who is Megan's father and dean of the medical school, about West's success in reanimating the dead cat, but the dean does not believe him. When Dan insists, the dean infers that Dan and West have gone mad. Barred from the school, West and Dan sneak into the morgue to test the reagent on a human subject in an attempt to prove that the reagent works, and thereby salvage their medical careers. The corpse they inject comes back to life, but in a frenetic and violent zombie-like state. Dr. Halsey stumbles upon the scene and, despite attempts by both West and Dan to save him, he gets killed by the reanimated corpse, which West then kills with a bone-saw. Unfazed by the violence and excited at the prospect of working with a freshly dead specimen, West injects Dr. Halsey's body with his reanimating reagent. Dr. Halsey returns to life, also in a psychotic, zombie-like state. Megan chances upon the scene, and is nearly hysterical, but the sight of her seems to awaken some kind of memory in her reanimated father, who while still crazed, appears to suddenly feel a kind of regret.\nDr. Halsey's colleague Dr. Carl Hill, a professor and researcher at the hospital, takes charge of Dr. Halsey, whom he puts in a padded observation cell adjacent to his office. He carries out a surgical operation on him, lobotomizing him. During the course of this operation, he discovers that Dr. Halsey is not sick, but dead and reanimated.\nDr. Hill goes to West's basement lab and attempts to blackmail him into surrendering his reagent and notes, hoping to take credit for West's discovery. West offers to demonstrate the reagent and puts a few drops of it onto a microscope slide with dead cat tissue. As Dr. Hill peers through the microscope at this slide, West decapitates him with a shovel, snarling \"plagiarist!\" as he drives the blade of the shovel through Dr. Hill's neck. West then reanimates Dr. Hill's head and body separately. While West is questioning Dr. Hill's head and taking notes, Dr. Hill's body sneaks up behind him and knocks him unconscious. The body carries the head back to Dr. Hill's office, with West's reagent and notes.\nExercising mind control over Halsey (in a deleted scene Hill is revealed to have psychic/hypnotic abilities; in the finished film, Halsey's submission is explained as a result of the lobotomy), Dr. Hill sends him out to kidnap Megan from Dan. While being carried to the morgue by her reanimated father, Megan faints. When she arrives, Dr. Hill straps her unconscious body to a table and strips her naked. She wakes up in the middle of this experience. Hill then sexually abuses her, including shoving his bloody, severed head between her legs.\nWest and Dan track Halsey to the morgue. West distracts Dr. Hill while Dan frees Megan. Dr. Hill reveals that he has reanimated and lobotomized several corpses from the morgue, rendering them susceptible to mind control as Halsey is. However, Megan's voice reawakens a protectiveness in her father, who then fights off the other corpses long enough for Dan and Megan to escape. In the ensuing chaos, West injects Dr. Hill's body with a lethal overdose of the reagent. Dr. Hill's body mutates rapidly and attacks West, who screams out to Dan to save his work before being pulled away by Dr. Hill's mutated entrails.\nDan retrieves the satchel containing West's reagent and notes. As Dan and Megan flee the morgue, one of the reanimated corpses attacks and kills Megan. Dan takes her to the hospital emergency room and tries to revive her, but she is dead. In despair, he injects her with West's reagent. As the scene fades to black, Megan, apparently revived, can be heard screaming."}