{"mid": "RebelRabbit", "IMDB_id": "tt0041785", "title": "Rebel Rabbit", "plot": "Bugs notices high bounties on various animals. There is a $50 bounty (about $500 today) on foxes, $75 (about $750 today) on bears, but then is offended by the two-cent bounty (about $0.20 today) on rabbits. Bugs has himself mailed to Washington, D.C., where a supercilious game commissioner explains that the bounty is so low because, while foxes and bears are \"obnoxious\" animals who damage property, \"rabbits are perfectly harmless\". Bugs vows to prove that he can do just as bad and storms out, slamming the game commissioner's door so hard that the glass in it shatters.\nBugs begins his campaign by attacking a guard in the leg with his own billy club. From there, he pulls stunts like renaming Barney Baruch's private bench as \"Bugs Bunny\" and then paints barbershop-pole stripes on the Washington Monument while painting \"Bugs Bunny Wuz Here\". Bugs then travels around where he rewiring the lights in Times Square to read \"BUGS BUNNY WUZ HERE\".\nDifferent newspapers comment about Bugs' actions as he first shuts down Niagara Falls where it reveals some barrels underneath it. Bugs then sells the entire island of Manhattan back to the Native Americans and is shown walking through it wearing a feathered headband and smoking a peace pipe asiding to the audience that \"they wouldn't take it back unless I threw in a set of dishes\". Afterwards, Bugs saws Florida off from the rest of the country where he quotes \"South America, take it away!\" Bugs then wonders what other kind of devilry he can commit. Bugs heads to Panama and swipes all the locks off the Panama Canal, which are represented as actual locks as he quotes \"I got 'em! I got 'em!\" Bugs then heads to Arizona where he fills up the Grand Canyon. Bugs then concludes his campaign by literally tying up railroad tracks.\nAn angry Senator Claghorn–esque Congressman speaks before the United States Congress and demands that they take action against Bugs, but is interrupted by Bugs who emerges from the congressman's hat, slaps him, and gives him a mocking kiss. The cartoon then shows live-action footage of the entire War Department mobilizing against Bugs. Tanks come rumbling out of their garages, soldiers pour out of barracks, and bugles blow as the news of this is shown. Bugs, now satisfied with the $1 million bounty (about $10,100,000 today) on his head (although the bounty is for him specifically, not rabbits in general), is snapped out of a Tarzan yell by the whole US Army coming after him. Bugs then dives into a fox hole as artillery shells surround the foxhole. Bugs then quotes \"Could it be that I carried this thing too far?\" just as the missiles explode. It then cuts to Alcatraz Island where Bugs is in his jail cell as he quotes \"Ehhh, could be...\""}