{"mid": "RebelWithoutACause", "IMDB_id": "tt0048545", "title": "Rebel Without a Cause", "plot": "Behind the opening credits, the film opens on a suburban Los Angeles street with teenager Jim Stark (Dean) drunkenly lying down on a sidewalk. He is arrested and taken to the juvenile division of the police station for \"plain drunkenness\". At the station he meets John \"Plato\" Crawford (Mineo), who was brought in for shooting a litter of puppies with his mother's gun, and Judy (Wood), who was brought in for curfew violation (she was wearing a bright red dress with matching lipstick and was mistaken for being a streetwalker). The three each separately reveal their innermost frustrations to officers; all three of them suffer from problems at home:\nJim feels betrayed and anguished by his constantly bickering parents, Frank (Jim Backus) and Carol (Ann Doran), but even more so by Frank's milquetoast attitude and failure to stand up to Carol and her mother, who lives with them. His frustrations are made manifest to officer Ray Fremick (Edward Platt) when Jim is released to their custody.\nJudy is convinced that her father (William Hopper) has callously withdrawn his affections from her because she's no longer a little girl, so she dresses up in racy clothes to get attention, which only causes her father to call her a \"dirty tramp\".\nPlato comes from a broken family. His father abandoned them when he was a toddler, and his mother is often away from home, leaving Plato in the care of his housekeeper.\nJim sets out for his first day at Dawson High School and again meets Judy (who lives nearby) waiting on the corner and offers her a ride. Seemingly unimpressed by Jim at first, she declines and sarcastically says, \"You know, I bet you're a real yo-yo,\" and then is picked up by her \"friends\", a gang of delinquents led by \"Buzz\" Gunderson (Corey Allen). Arriving at school, Jim immediately gets in hot water for unknowingly stepping on the school insignia. While shunned by most of the student body, Jim befriends Plato, who comes to idolize him as a father figure. That afternoon, Jim's class goes on a field trip to Griffith Observatory, where they see a dramatic presentation of the bleak future of the Earth as the Sun goes through its red giant phase and post red-giant phase. As he walks out, Buzz and his gang slash one of Jim's tires and then begin taunting him by clucking and calling him \"chicken\", which is sure to set him off. When Jim asks Judy, revealed to be the \"property\" of Buzz, why she hangs around with them, Buzz pushes Jim away from her, then whips out a switchblade and challenges Jim to a knife fight. Having no knife, Jim refuses, so Buzz orders one of his gang to lend Jim his knife, but even then Jim still refuses. When Buzz again calls Jim chicken he goes off, and the two begin fighting, each one getting minor jabs on the other until Jim knocks Buzz's knife away and subdues him. Buzz wants another shot at Jim, which he accepts but not with knives. Buzz suggests stealing a couple of cars to have a \"Chickie Run\" at Millertown Bluff, a high seaside cliff. Jim agrees to meet them that evening before the observatory security guard runs the gang off. After they leave, Jim asks Plato what a Chickie Run is.\nAt home, before leaving for the chickie run, Jim ambiguously asks Frank for advice about defending one's honor in a risky, dangerous situation. But Frank, dressed in a frilly apron and doing housework while Carol is sick in bed, instead gives Jim a long-winded speech about avoiding confrontation of any kind. Jim changes his clothes and drives to Millertown Bluff. Buzz shows him the two stolen cars they'll be racing, and then go to the edge of the cliff alone and share a cigarette, where Buzz confides in Jim that he likes him. When Jim asks Buzz why they're doing the run, Buzz replies \"You gotta do something, now don't you?\". Meanwhile, Judy asks Plato about Jim; though they barely know one another, Plato calls Jim his best friend. When Judy asks what Jim is like Plato merely replies \"You have to get to know him,\" but adds that people Jim likes most get to call him \"Jamie\".\nAs they prepare to race, Buzz explains the rules: the two are to race toward the edge of the cliff, and whoever jumps out of their car first is declared the \"chicken\". As the two cars speed toward the cliff, Jim tumbles out of his car, but Buzz's jacket sleeve gets caught on his door handle, preventing him from jumping out before both cars plummet to the rocky shores below, with Buzz screaming, until he meets his death in the fiery crash below. The rest of the gang flee leaving Judy stranded, but Jim, with Plato in tow, gives Judy a ride home, giving her back the purse mirror she left at the police station. Still with Plato along, Jim drives home. Plato then asks Jim if he would like to go with him up to an old abandoned mansion near the observatory and stay there for the night, but Jim declines and sends him home, but not before Plato writes down Jim's address in his pocket notebook.\nJim tells of his involvement in the crash to his parents who saw a news report about it on TV, but when Jim considers turning himself in, they warn him not to volunteer himself to the police. When Carol declares they're moving again, Jim asserts that he won't let her use him as an excuse to keep running away. Jim then begs Frank to stand up with him against her, but he doesn't. Jim angrily jumps and strangles Frank until he is pulled away by Carol. He storms off to the police station and is accosted by Buzz's fellow gang members Crunch (Frank Mazzola), Goon (Dennis Hopper) and Moose (Jack Grinnage) who were just released from custody. Jim ignores them and goes in looking for Fremick, but the desk sergeant rudely tells him that Fremick will be out all night. Before leaving, Jim tries to call Judy at her home, but the call is intercepted by her father who abruptly hangs up.\nJim drives back home and finds Judy waiting at the same spot where they met that morning (she greets him with \"Hello, Jamie\"). When Jim reveals he was attracted to her from the moment he saw her (and even gently kisses the side of her forehead), Judy apologizes for the way she treated Jim that morning, blaming peer pressure, and the two begin to fall for one another. Agreeing that they will never go back to their respective homes, Jim suggests they go to the mansion Plato told him about, saying \"You can trust me, Judy.\"\nMeanwhile, Plato is just arriving home on his motor scooter when he is grabbed by Crunch, Goon and Moose. Convinced that Jim ratted them out to the police, and looking to avenge Buzz's death, they demand to know where they can find Jim, but Plato refuses to talk. They grab Plato's pocket notebook as he gets to the front door and run off. Plato runs upstairs to his bedroom and, after throwing away a child support check from his father, grabs his mother's gun and runs off to find and warn Jim. At Jim's house Frank and Carol hear knocking at the front door. Frank answers to find a live chicken hanging over their door, and Buzz's friends asking about Jim, but Frank hurriedly shuts the door. After they take off, Plato shows up for the same reason, but when Frank asks Plato about Jim, Plato quickly apologizes and hurries off to the mansion where he finds Jim and Judy.\nThe three new friends act out a fantasy as a family, and Plato tells them about when the \"head shrink\" got him to open up about hearing his parents fight when he was a baby, and how his mother later decided the money being spent on his therapy was better spent going off alone to Hawaii. Wishing they could stay there, but unable to ignore his situation, Plato decides he \"might as well be dead anyway\" and lies down to doze. Judy hums the Brahms' Lullaby to him before she and Jim go exploring the rest of the mansion. Jim and Judy find a place, and they exchange their first kiss. Crunch, Goon and Moose, now armed with chains, find their way to the mansion and wake up Plato. Frightened and distraught, Plato fights them off, both in the empty swimming pool, and in the mansion, until he finds his gun and shoots Moose, and then mistakenly fires at Jim when he comes back. Jim tries to restrain Plato, but he runs from the mansion, shooting at police who have just arrived.\nPlato runs to the observatory and barricades himself inside as more police converge including Fremick who, with Frank and Carol, was out looking for Jim. Jim and Judy follow Plato into the observatory, and Jim persuades Plato to trade the gun for his red jacket; Jim silently removes the ammunition before giving the gun back. Jim then convinces Plato to come outside after asking Fremick to turn the police lights off. As they start to come out the police notice Plato still has the gun and turn their lights back on, which incites Plato to break away and charge the police. When he is shot down, Jim screams, \"I got the bullets!! Look!!\" Seeing Jim's jacket, Frank believes at first that Jim had been shot. He runs to comfort the openly grieving Jim, and promises to try and be a stronger father, one that Jim can depend on. Judy's father takes Jim's jacket, and covers Plato's body. Now reconciled to his parents, Jim introduces them to Judy saying \"She's my friend\", first briefly opposed by Carol, until Frank assures her that it's all right.\nAs dawn encroaches, and as everyone leaves in their respective cars, a lone figure in a business suit with briefcase walks toward the observatory, completely unaware of what just transpired."}