{"mid": "RedHotRidingHood", "IMDB_id": "tt0036295", "title": "Red Hot Riding Hood", "plot": "The story begins with the standard version of Little Red Riding Hood (with the wolf from Dumb-Hounded, the cartoon which saw the debut of Avery's Droopy). The characters rebel at this stale and derivative staging of the story and demand a fresh approach. The annoyed narrator accedes to their demands and starts the story again in a dramatically different arrangement.\nThe story begins again, now told in a contemporary urban setting. The narrator explains that Little Red Riding Hood (now portrayed as an adult) is an attractive performer in a Hollywood nightclub under the stage name \"Red Hot Riding Hood,\" and the Big Bad Wolf, now a Hollywood swinger, follows Red to the club where she's performing. Red performs onstage (a rendition of the 1941 classic hit song \"Daddy\" by Bobby Troup) and the wolf goes mad with desire. He brings her to his table and tries wooing her, but she wants nothing to do with him. Red escapes the Wolf, saying she's going to her Grandma's place, but nevertheless the Wolf manages to get there first. Grandma's place is a penthouse at the top of a skyscraper. Red's grandma is an oversexed man-chaser who falls head over heels for the Wolf (upon seeing him, she whistles and says, \"At last a wolf! Yahoo!\").\nThe Wolf tries to escape, but Grandma blocks the exit and asks him, \"What's your hurry, hairy?\" She locks the door, drops the key down the front of her evening gown, and poses provocatively for him. She dons a bright red shade of lipstick and a chase scene ensues. Whenever the Wolf attempts an exit, Grandma waits behind the door with puckered lips. He finally makes his escape by jumping out a window, severely injuring himself on the pavement many floors below. He makes his way back to the nightclub, covered with bandages and bruises, swearing, \"I'm through with women. Why, I'll kill myself before I'd even look at another babe.\" Immediately Red takes the stage and begins another performance. The Wolf pulls out two guns and commits suicide, but his ghost rises from his dead body and howls and whistles at Red as he did earlier."}