{"mid": "RedSonja", "IMDB_id": "tt0089893", "title": "Red Sonja", "plot": "After being raped by the soldiers of Queen Gedren, a despot who had her parents and brother murdered for scarring the queen's face while rejecting her sexual advances, Red Sonja is visited by a spirit who grants her the strength to seek revenge. Having trained under a sword master and becoming distrustful of most men, Red Sonja is found by Lord Kalidor, who takes her to her dying sister Varna. Varna is a member of an order of priestesses who were preparing to destroy a light-powered relic known as the Talisman that created the world and whose growing power now threatens it. However, Gedren's army and her aide-de-camp Ikol slaughtered the priestesses and took the Talisman while Varna was fatally wounded by the time she found Kalidor. Before dying, Varna tells Sonja of the events at her temple while urging her to find the Talisman and destroy it. After turning down Kalidor's offer to accompany her, seeing a storm in the distance, Sonja arrives to the now-ruined kingdom of Hablock. There she meets the young Prince Tarn and his servant Falkon, learning Gedren completely wiped out Hablock when Tarn refused to surrender. Tarn announces that he is raising a new army to crush Gedren and invites Sonja to work for him as a cook. She declines while told that Gedren is based in Berkubane, the Kingdom of Eternal Night.\nSonja kills Lord Brytag after he refuses her passage through the mountain passes. His troops surround Sonja, and Kalidor, who has secretly been following her, attacks their rear, allowing Sonja to escape. Sonja comes across Tarn and Falkon in the mountains. Tarn is being tortured by bandits. Falkon rejoins Sonja to help her kill the brigands and free the prince. They travel onward toward Berkubane. At Castle Berkubane, Gedren and Ikol watch Sonja and her party approaching on a magic screen. Gedren recognizes Sonja and orders that she be brought back to the fortress unharmed. She and Ikol use the Talisman to conjure up a storm, forcing Sonja's band to take shelter in a watery cavern. Gedren unleashes an \"Icthyan Killing Machine\" in the cavern. Kalidor reappears, and helps Sonja blind the beast.\nSonja now accepts Kalidor's company, learning he is a descendant of the lords who entrusted the Talisman to the temple, but also warns him that \"no man can have her\" unless he can defeat her in a sword fight. Kalidor challenges her and they fight to a draw. Kalidor, Sonja and Falkon then infiltrate Castle Berkubane. To protect Tarn, they convince him to stay behind in order to prevent Gedren from escaping. Sonja confronts Gedren, while Kalidor and Falkon deal with her guards in the castle's dining hall. Ikol, realizing Gedren is insane when she refuses his pleas to place the Talisman in a dark place for a while, tries to escape with some of the gold looted from Hablock. But Ikol is stopped by Tarn, and meets an unpleasant end.\nThe Talisman, which Gedren has placed in a Chamber of Lights, is becoming too powerful to control. Its power breaks the floor open, revealing a chasm of molten lava beneath the castle. Sonja and Gedren fight in the Chamber, but Sonja eventually gains the upper hand and runs Gedren through with her sword, sending the evil ruler plunging to her doom in the lava pit below. Sonja throws the Talisman in after her, destroying it and starting a chain reaction that tears Castle Berkubane apart. The heroes manage to escape just before the castle is consumed by the rising volcano. As Prince Tarn and Falkon eventually depart to rebuild Hablock, Sonja and Kalidor spar again before they kiss."}