{"mid": "Repeaters", "IMDB_id": "tt1580426", "title": "Repeaters", "plot": "Kyle Halsted, Sonia Logan, and Michael Weeks are inmates at a rehabilitation facility. Bob Simpson, the administrator, tasks them with apologizing to those they have hurt with their addiction. When Kyle attempts to apologize to his younger sister Charlotte, she angrily blows him off, and the principal kicks him off school grounds. Sonia goes to the hospital where her dying father is a patient, but she is unable to bring herself to face him. Michael visits his father in jail, but the conversation is cut short by his father's abusive threats. When Bob tries to get them to discuss their day in group therapy, they refuse, and Michael storms off. Later, while discussing the pointlessness of Bob's therapy, Sonia is told that her father has died. As the trio try to deal with their emotional pain, a storm rolls in, and each of them is shocked and knocked unconscious.\nWhen they wake up the next morning, the events of the previous day repeat. Kyle, Sonia, and Michael stumble through the day and repeat their actions in a daze. When they discuss the situation, Michael is intrigued by the consequence-free possibilities open to them, but Kyle convinces them to act on a news report that he recalls. They go to the dam but are too late to stop a jumper. Michael suggests that they take advantage of the situation, and they commit petty crimes that result in a stay at jail. Eventually, as the day repeats endlessly, they embark on a drug bender and crime spree that culminates in the violent kidnapping of a drug dealer who has been selling to Charlotte. At the dam, Michael carelessly risks his life walking on top of the railing and dares Sonia to do the same. When she slips, Michael merely laughs and refuses to try to help Kyle save her. Sonia falls to her death, though she wakes up with a gasp the next morning. Sonia claims to remember nothing of her death, and the trio become emboldened by their apparent immortality.\nThe next day, as Kyle and Sonia save the jumper at the dam, they discover that Michael has raped one of Charlotte's friends. When Kyle and Sonia confront Michael, Michael accuses them of hypocrisy and says that his actions are excusable because everything will become reset the next day. Michael's behavior becomes more violent and antisocial as the days repeat. Shaken by Michael's behavior, Kyle ambushes him and ties him to a chair. Kyle and Sonia fall in love and work toward redemption, but Michael laughs at Kyle; he claims that Sonia's story of childhood sexual abuse is just an act. However, when Kyle and Sonia successfully make peace with their pasts, the time loop abruptly ends, but Michael does not realize it until the middle of a violent rampage that ends with the senseless murders of two people. Freaked out, Michael takes Charlotte hostage, but he commits suicide after Kyle attempts to reason with him. In the last scene, Michael wakes up again, stuck in his own time loop."}