{"mid": "Repossessed", "IMDB_id": "tt0100475", "title": "Repossessed", "plot": "Father Jebediah Mayii (Nielsen) casts out the devil from the body of young Nancy Aglet (Blair). Seventeen years later, in 1990, Nancy's body is possessed once again, however, while watching The Ernest and Fanny Miracle Hour, a religious broadcast.\nAfter a visit to the hospital, and a visit from Father Luke Brophy (Starke), Brophy concludes that Nancy is indeed possessed. Mayii, however, refuses to perform the exorcism, claiming he is too weak, and that both he and Nancy barely survived her previous exorcism. Brophy then visits the Supreme Council for Exorcism Granting. Ernest and Fanny (Ned Beatty and Lana Schwab) of The Ernest and Fanny Miracle Hour are also present. Ernest concludes that an exorcism is warranted, and convinces the Council to televise Nancy's exorcism. They agree, believing it will convert millions, so Ernest presents Ernest and Fanny's Exorcism Tonight to the network.\nFeeling he may be needed, Mayii visits \"Bods-R-Us\", a gymnasium, to restore his physical strength. There, Brophy approaches him, informs him of the televised exorcism, and attempts once more to convince Mayii to conduct the exorcism, though he refuses again. The night of Nancy's exorcism arrives, presented by Ernest and Fanny.\nAfter a montage of attempts to free Nancy's body using phone donations, song, and insults (\"You're so tough, how come you possessed a woman's body?\"), Ernest and Fanny's Exorcism Tonight is announced as having the largest audience in history. Upon hearing this, the devil, in Nancy's body, sets the studio on fire, causing the audience to flee. He reveals to Ernest and Fanny that he used them to get the largest audience, and turns them into a pantomime horse.\nUsing the camera, the devil tries to claim the souls of the viewing audience, but is stopped by Brophy, who destroys the camera. The devil announces he knows another way to claim their souls, and runs away, heading for a satellite transmitter. He is pursued by religious figures from around the world, who have gathered at Brophy's command. Brophy teases the devil about his defeat to Mayii.\nBack in the studio, the devil successfully uses the camera to lure Mayii to him for a rematch. The exorcism, with commentary by \"Mean Gene\" Okerlund and Jesse Ventura, is ineffective until the devil mentions that he hates Rock 'n Roll. Turning the TV studio into a live concert, the song \"Devil with a Blue Dress On\" is played to the devil by the various religious figures, including The Pope on guitars. The devil is tormented so that he is finally driven from Nancy's body, declaring \"I'll be back!\"."}