{"mid": "Repulsion", "IMDB_id": "tt0059646", "title": "Repulsion", "plot": "Carol Ledoux (Catherine Deneuve), a Belgian manicurist, lives in Kensington, London, with her older sister Helen (Yvonne Furneaux). Carol practically sleepwalks through her days, and interacts awkwardly with men. A would-be suitor, Colin (John Fraser), is flummoxed by her behaviour and she rebuffs his advances, disgusted by them.\nShe hides her head in her pillow against her sister's cries of sexual pleasure with her lover, Michael (Ian Hendry). When Helen leaves on a holiday to Italy with Michael, Carol appears even more distracted at work, gets sent home, stays in the apartment, leaves a raw, skinned rabbit out to rot, and begins to hallucinate, first seeing the walls cracking, a man breaking in and molesting her, then hands reaching out to grab and attack her. Colin breaks into her apartment when she refuses to acknowledge his adoration and he apologizes for his transgression. When he says he wants to \"be with [her] all the time,\" she bludgeons him to death with a candlestick, dumps the body into the overflowing bathtub, and nails the broken door shut.\nLater, the imperious landlord (Patrick Wymark) breaks in, looking for the late rent payment. Carol pays him and sits on the sofa, staring into space. He remarks on the decaying state of the apartment, and attempts to ingratiate himself by bringing her a glass of water as he leers at her in her nightgown. When he first propositions her, then sexually assaults her, she gets away. But he comes at her again and she slashes him to death with a straight razor.\nWhen Helen and Michael return, they discover the dead bodies. Michael runs for help. Helen, distraught, finds Carol hiding under the bed in a catatonic state. Neighbors arrive – curious, concerned and shocked. Michael returns and carries Carol out, staring creepily at her wide-open eye, face and body. A family photograph on the floor shows Carol as a girl, turned towards an adult male figure in the photograph with a look of loathing."}