{"mid": "ReturnToSleepawayCamp", "IMDB_id": "tt0382943", "title": "Return to Sleepaway Camp", "plot": "Alan (Michael Gibney) is a boy at summer camp. Unfortunately Alan is a bully, who is bullied by other kids in turn. Among his abusers are his stepbrother Michael (Michael Werner), his \"friends\" Vinny (Christian Hess) and T.C. (Christopher Shand), and a chubby girl, Bella (Shahidah McIntosh). The film opens with several boys lighting farts one night. Alan tries to light his own farts and after failing, threatens the other boys. He is stopped by camp counselor Randy (Brye Cooper). The next day in the dining hall, Alan gets into a violent confrontation with Randy after he complains about the food. Ronnie, the head counselor from the first movie and head counselor here, allows Alan to get something else to eat after the confrontation is stopped by Sheriff Jerry, a smaller man who uses a mechanical voice box in order to speak. Meanwhile, Alan gets in trouble with cook Mickey (Lenny Venito). Alan throws a butcher knife at Mickey and the camp owner, Frank (Vincent Pastore), argues with Alan. Alan runs away, with Michael chasing him. In the kitchen Mickey is suddenly killed, tossed into the deep fryer by an unseen person. His body is dumped in the trash compactor.\nDuring the social, Alan is fooled by campers Terry (Adam Wylie), nicknamed \"Weed,\" and Stan (Chas Brewer) into smoking dried cow manure, which makes him cough and stumble, falling on Stan's crotch. This earns him the nickname \"Blowjob.\" After the social, Weed is relaxing outside when he is attacked and tied to his chair, with the unseen person squirting gasoline down his throat. The killer sticks a lit cigarette in his mouth and he explodes. Ronnie starts to worry that the murders that happened twenty years ago are happening again, but Frank believes the deaths were accidental. A week later, Alan manages to convince two girls, Karen (Erin Broderick) and Marie (Samantha Hahn), to go to his \"secret hideout.\" Michael plays a prank and makes Alan look like he skinned some frogs, and Karen and Marie run away. Michael, T.C. and Marie make Karen lure Alan to the back of the stage, where they strip him, tie up and blindfold him and embarrass him at the social by pushing him out onto the stage in front of the entire camp.\nRonnie turns paranoid and suspects counselor Petey (Kate Simses) as the killer for always being nearby when Alan is in trouble. Coincidentally Ricky Thomas, (Jonathan Tiersten), Angela's cousin, works at a nearby construction site and is questioned about the new deaths. He refuses to talk about Angela or the killings and angrily walks away. After returning to his cabin that night, Frank is knocked unconscious with a hammer and wakes up with his head locked in a birdcage. The killer opens the birdcage and places two rats inside. The rats eat through Frank's head and down into his intestines, killing him. That same evening Randy and his girlfriend Linda (Jackie Tohn) go to the pump house to have sex. As Randy urinates in the woods, the killer attacks and ties him to a tree, using fishing line that wraps around his penis. Linda looks for him and panics after hearing Randy try to placate the killer and drives off in the Jeep. But the fishing line is tied to the Jeep and tears off Randy's penis, killing him. Linda drives through a wrapped barbed wire line, which wraps around her face, causing her to crash into a tree.\nMeanwhile, Vinny visits T.C. in his cabin and then leaves. Suddenly a wooden spear comes through a hole in the floor and disappears. As T.C. is looking into the hole to find it the spear pops back up and impales him through the eye. Ronnie and another camper, Jenny (Jaime Radow), find Frank dead and begin rounding up everyone with the help of Sheriff Jerry. Bella goes to her cabin to hide, where she sees that the bunk above her has been replaced with a board of spikes. The killer suddenly jumps down from the rafters and lands on the top bunk, causing the spikes to impale and kill Bella. T.C. and Bella are found dead and Ricky is called in to help as Ronnie insists that Angela has returned to kill again. Karen runs through the camp and finds Randy and Linda dead before bumping into the killer and fainting.\nKaren wakes up with a rope around her neck, hanging from a basketball hoop. The killer flips a switch to raise the net, causing Karen to be lifted off the ground and slowly strangle. As she screams for help Sheriff Jerry arrives and lowers the net. After Karen announces to the rest of camp that she thinks Alan is the killer, Michael grabs a croquet mallet and runs to Alan's secret hideout. He finds Alan and starts beating him with the mallet, Alan screaming that he is innocent. As Michael steps back to deliver a killing blow, the real killer appears behind him and the screen goes black.\nRonnie, Ricky and Jenny run to the hideout and find a badly wounded but alive Alan. Sheriff Jerry appears and slowly walks up to them, explaining through his mechanical voice box that the victims never learned, were always so mean all the time, could do whatever they want and get away with it, and they got what they deserved. As he speaks the Sheriff throws off his clothes and fake mustache, revealing himself as Angela Baker, the real killer. As Ronnie says \"I knew it was you!\" Jenny sees something writhing on the ground and runs away screaming. Ronnie and Ricky investigate and find Michael skinned alive on the ground. Angela begins to laugh maniacally, staring creepily into the camera as the screen snaps to black.\nFollowing the credits, a text crawl states that three weeks prior to the film's events, Angela escaped from the psychiatric clinic where she was kept after the first movie. A short scene shows her causing a brake fluid leak in a stolen car and flagging down Sheriff Pete (Carlo Vogel), the real sheriff. She murders him by dropping the car on his head and steals his clothes to become Sheriff Jerry."}