{"mid": "ReturnToHorrorHigh", "IMDB_id": "tt0093854", "title": "Return to Horror High", "plot": "In 1982, the southern California town of Crippen was rocked by a series of murders at Crippen High School. The killer was never caught.\nSeveral years later, Cosmic Pictures, headed by sleazy producer Harry Sleerik, has come to Crippen to make a movie about the murders, setting up shop in the high school. However, it seems the killer is still there, and as crew and cast members disappear left and right, it's up to ex-student/cop/leading man Steven Blake and leading lady Callie Cassidy to get to the bottom of this.\nMost of the film is told in a fractured, nonlinear narrative style which goes back and forth between the film crew getting isolated and killed one by one by a hooded masked killer, to the film-within-a-film segments of the supposed \"found footage\" of the film being shot, and to the investigation into the recent massacre where the police, led by Chief Deyner, and aided by the rookie Officer Tyler, interrogate the sole survivor, the scriptwriter Arthur Lyman, who describes the events leading up to the latest killing spree by the unknown killer.\nInvestigating the killings and disappearances, Steven and Callie find a trap door leading to the basement of the school where they encounter the killer who happens to be the former Principal Kastleman, who has been masquerading as the school janitor Amos. Kastleman reveals that Steven was romantically involved with his daughter who got pregnant and when Kastleman found out, he murdered his daughter out of shame and hid her body in the basement which led to him going on the past killing spree. After a struggle, Steven and Callie kill Kastleman by impaling him to a wall with a javelin.\nIn the present time, after Arthur Lyman finishes telling his story to Chief Deyner, the police venture into the school to investigate the basement. When the policemen are gone, Arthur then yells out \"all clear\".... and all of the \"victims\" of the massacre that have been found sit up revealing that they are alive. It turns out that the whole contemporary killing spree was a stunt thought up by Harry Sleerik to bring in publicity for the film. It is implied that after Steven and Callie discovered that Kastleman was the killer of the previous massacre, Harry took it upon himself to concoct the entire massacre to bring publicity for the film. None of the killings shown in the film were ever real for they were either staged with hidden cameras or fantasy sequences thought to mislead the viewers.\nAfter the very much alive film crew gathers up their fake body parts and leaves the scene, the police arrive in the basement where Kastleman is still there after being impaled to a wall by Steven and Callie, when he comes back to life and lunges at the policemen who are forced to shoot him dead... for a second time. When the police return outside the building and find all the dead bodies of the film crew gone, they mistakenly believe that there might be a real killer still out there.\nIn the final scene, the scriptwriter Arthur Lyman is seen at a desk and typing out a new screenplay which he titles 'The Return to Horror High', which he intends as a sequel to the previous screenplay he wrote for Harry and Cosmic Pictures. A framed picture sits at his desk which is Principal Kastleman, revealing that Arthur is Kastleman's son. An unseen figure enters the room, dripping blood, and stops at Arthur's typewriter, dripping blood on the pages being typed. Arthur looks up at the unseen figure and says, \"Dad?\""}