{"mid": "ReturnOfTheLivingDeadPartII", "IMDB_id": "tt0095990", "title": "Return of the Living Dead: Part II", "plot": "The story begins with a military truck transporting barrels of Trioxin. The soldier, driving the vehicle through a downpour, is unaware when a barrel breaks loose and falls into a river. The next morning, a young boy, Jesse Wilson, is at the cemetery with two local bullies. The trio investigate the Trioxin tank that they find, and Jesse warns them that they should not tamper with it. The bullies trap Jesse in a derelict mausoleum and leave him. They then return to the trioxin tank and release the toxic gas. A van pulls up to the graveyard, introducing the characters Ed, Joey, and Brenda. Ed explains to Joey that they are there to rob graves; Brenda expresses her fears for cemeteries, but Joey assures her that it will be worth their time and leaves Brenda in the van. He heads into the cemetery with Ed. They decide to loot the mausoleum and open the locked doors, releasing Jesse, who immediately runs home. At his home, Jesse watches his older sister, Lucy, doing aerobic exercises to a work-out video; she tells Jesse to do his homework or he will be grounded.\nLater, in the night, a cable technician arrives at the Wilson house to install cable TV. As he enters, Jesse manages to sneak out the back door and heads to Billy's home, one of the bullies from earlier. Upon Jesse's arrival, Billy's mother tells Jesse of Billy's illness and allows him a brief visit. Jesse is shocked to see the effect of the Trioxin, which is making Billy ill. Billy whimpers to Jesse not to tell what they've found, but is interrupted by his mother, who asks Jesse to leave. Jesse returns to the sewer drains to further examine the Trioxin tank, and finds a phone number for the military. He is attacked by a tar-covered zombie who has escaped from the tank. He flees to the cemetery and witnesses a hand reaching from one of the graves and runs home before the zombies rise.\nEd and Joey are still inside the Mausoleum and witness a zombie awakening from its tomb. They club him with a crowbar, which has no effect. Outside, a worried Brenda enters the cemetery, unaware of what is going on. She is spooked by a zombie's approach and tries to flee, only to be stopped by a zombie that has crept up on her from behind. She punches him, crushing his face, and runs deeper into the graveyard. Brenda encounters Joey and a frantic Ed, and they escape to the streets, where they meet Billy's parents and warn them of the zombies before fleeing. Jesse returns home to an angry Lucy, who chases him into their parents' bedroom; he locks the door and calls the military for help and is placed on hold.\nOutside Joey, Ed, and Brenda steal Tom's van and accidentally knock a zombie into a telephone pole, disconnecting Jesse's call. Billy's father threatens them with a gun, but he is attacked by the supposedly-dead zombie. The streets are now flooded with the living dead, and the traumatized group run to the Wilson house for refuge. After they enter, an argument occurs over what is happening; Joey and Ed also show symptoms very similar to Billy's. Jesse assures everyone that they're zombies and that Dr. Tom Mandel, a neighbor, can help them all escape. Billy's mother leaves her house and sees her husband being eaten by a group of zombies. She quickly returns to her house, removing her glasses, and is then killed by a now-zombified Billy. Jesse and his group make their way to the Doctor's house and get trapped in his garage. Zombies break in but the doctor escapes with Jesse and the others in a vehicle. Tom drives through a horde of zombies, knocking one onto the car's roof. During their journey, the zombie reaches through an open window, only to have its hand cut off. The hand continues to attack before it is thrown from the car's window.\nArriving at a deserted hospital, Joey's and Ed's health deteriorate. Jesse, Lucy, and Tom leave to get more ammunition and guns from their uncle's home after realizing there is no help. Dr. Mandel tells Brenda that Joey and Ed are more or less dead; she vehemently disagrees with the diagnosis and calls him a quack. She leaves with the dying Joey; Ed, however, follows - much to Brenda's annoyance. They are stopped by three military men wielding guns. Ed attacks one, eating his brains, and the two remaining soldiers drive off, leaving Brenda helpless. Ed is occupied with eating his victim, so Brenda uses this opportunity to ditch him, and escapes with Joey. In the car, Joey transforms into a zombie. He confesses that he wants to eat Brenda's brains and attacks her; she escapes unhurt from the car and bumps into a dazed zombie. She manages to get her hand trapped in the zombie's mouth, and rips his jaw from his face. Joey runs toward her and chases her into an empty church, explaining that he wants her spicy brains. Brenda retaliates by saying, \"I'm not into dead guys!\" Joey explains that he loves her. Seeing no other option, Brenda allows him to eat her brains.\nThe others return to the hospital and collect Dr. Mandel. They devise a plan to lead the zombies to a power plant and electrocute them all, using a trail of frozen brains. After arriving at the plant, they place brains into puddles of water, with electrical wires in each puddle. Zombies ambush them after Billy opens the large entry gates. Lucy and Tom hide in the back of the truck, and zombies begin breaking through the truck's door. Jesse, who is now inside the plant, is attacked by Billy and stabs him with a screwdriver. Jesse activates the power, killing all of the zombies. Billy walks in, holding the screwdriver, and pushes Jesse onto a control panel. While this is happening, a large transformer falls through the roof. Dr Mandel distracts Billy by telling him his fly is open, and Jesse kicks Billy into the transformer, electrocuting him. As Jesse, Lucy, Tom, and Dr. Mandel leave the plant, the military arrives to dispose of the bodies with flamethrowers."}