{"mid": "ReturnToHouseOnHauntedHill", "IMDB_id": "tt0827782", "title": "Return to House on Haunted Hill", "plot": "Ariel Wolfe is the sister of Sara Wolfe, a survivor of a massacre some years ago in the \"Hill House\" sanatorium, which was decades ago guided by the insane psychiatrist Dr. Vannacutt. Sara claimed that phantoms had killed her friends, but no one believed her. When Sara commits suicide, Ariel tries to find out the reason.A diary of the late Dr. Vannacutt leads Ariel to the cruel past of \"Hill-House\". Suddenly, she and her friend Paul get kidnapped by the unscrupulous art dealer Desmond. It looks like Desmond knows a lot about Sara and Hill-House. Ariel is forced to help Desmond to find a precious artifact, a figurine of the demon Baphomet. The artifact is said to be hidden somewhere inside Hill House. While Desmond, Ariel, Harue and four of Desmond's henchmen walk into the sanatorium, Paul and one thug are told to wait outside - Paul is some kind of security. Inside Hill-House Ariel and her kidnappers meet Dr. Hammer and his assistants Kyle and Michelle. Dr. Hammer and Desmond seem to be enemies for they start to shout to each other. Whilst bickering, it comes out that Michelle is a traitor. She only seduced Dr. Hammer to steal information about Hill House and to find out the possible hiding place of the Baphometh idol.Suddenly, loud noises echo through the entrance hall and a now fearful Ariel explains that the masterlock of the sanatorium has been activated. Desmond makes his stooges stop the machine by shooting it. After this the group walks down to the basement and splits up. Soon the first thug gets killed, his body beeing sucked into a massive wall. Next is Harue, one of Desmond's buddies. She first gets scared by a couple of lesbian ghosts, then sliced up by the undead Dr. Vannacutt. The next victim is Ariel. She gets pulled violently into a padded cell and is traumatised by hallucinations shown to her by the ghost of an ex-patient. He shows Ariel parts of the bygone happenings decades ago. In life, the patient led a revolt against Dr. Vannacutt, in which the sanatorium got burnt down. When Ariel wakes up she is in a straight-jacket and starts to scream.Meanwhile, Kyle and a henchman of Desmond reach the entrance hall, where the thug gets mauled by phantoms. The now frightened Ariel, Michelle, Desmond, and Dr. Hammer go back to the entrance hall, where Paul and his minder appear. Desmond goes crazy because he didn´t call the two in, but the thug tells the converse. While bickering, another stooge of Desmond's suddenly walks away, following a ghostly appearance. He is surprised by an undead nurse and then gets killed in the cruelest way by Vannacutt. The team can hear his death screams via cell phone. In the ensuing chaos, Paul, Kyle and Dr. Hammer succesfully wrestle down Desmond and Michelle.The diary of Dr. Vannacutt and the ghostly visions of Ariel reveal step by step what happened decades ago. Due to the revolt against Dr. Vannacutt, a fire broke out and the patients tried to escape. Trapped Dr. Vannacutt activated the masterlock of the asylum, so the patients couldn´t leave. Everyone was burnt alive except for five people. The following haunting inside the asylum, which began some years later, was thought to be the result of the ever-furious patients, their souls seeking revenge. But now it looks like the ghosts of Hill House were kept inside the building by some unkown force. Since Dr. Vannacutt was known as the owner of the evil Baphomet idol, it seems like he was the willing servant of Baphomet, working for the demon. This explains why Dr. Vannacutt who was originally a genius and nice, became heartless and perverted.The team searches now for the crematory of Hill House. The searched for artefact is said to be hidden in a secret chamber behind the crematory. In an hydrotherapy room Kyle is drowned by undead who were drowned themselves. Ariel tries to rescue him, but fails. Desmond and Michelle are able to flee, but shortly after, Michelle is killed by poltergeist-activity. Desmond, now furious, runs to find the crematory himself.Meanwhile, Ariel, Paul and Dr. Hammer find a viaduct leading out of Hill House. However they can't get out because of an iron grating. In a vision, transmitted by the same phantom in the padded room, Ariel is told where to find the crematory. The ghost desperately begs Ariel to destroy the Baphometh idol, so that the souls can finally leave and rest peacefully. It looks like the idol actually keeps all the furious ghosts trapped inside Hill House. Ariel decides to help and the team finds the crematory.Inside a hidden room, they finally find the Baphometh idol. When Ariel shoots the idol, the item turns out to be indestructable. Ariel decides to get the idol out of Hill House by the viaduct. The team gets surprised while turning back by Desmond, but he´s grabbed by ghosts and pushed into one of the cremators and burnt alive. Paul gets separated from Ariel and Dr. Hammer. While he runs back to the idol chamber, Ariel and Dr. Hammer go back at the viaduct.Suddenly Dr. Hammer attacks Ariel and tries to strangle her. It´s obvious that he´s posessed by Baphometh. While fighting, the ghost of Dr. Vannacutt appears and when the now crazy Dr. Hammer attacks Vannacutt, he gets slain. Ariel takes the opportunity and throws the wicked idol into the viaduct. At this very moment the curse of Hill House comes to an end and the ghosts take revenge on Dr. Vannacutt. Ariel runs back to the entrance hall meeting Paul there. They can now leave Hill House.The final scene, after the credits, takes place on a beach where two people find the cursed statue."}