{"mid": "ReturnToNeverLand", "IMDB_id": "tt0280030", "title": "Return to Never Land", "plot": "In World War II, Jane Darling is Wendy's daughter who refuses to believe in stories about Peter Pan. She is mistakenly abducted by Captain Hook and his crew, who sail through the sky on their pixie-dust enchanted ship, evade an air raid alert and escape back to Neverland.\nThere, Hook plans to feed Jane to the octopus (who replaced Tick-Tock the Crocodile) in order to lure Peter into a trap. However, Peter rescues Jane and Hook escapes from the octopus, returning to the ship. After recognizing and asking Jane to follow Wendy's footstep, Peter takes her to his hideout to be the mother of the Lost Boys, but Jane refuses and gets stranded. The next day as the boys fail to teach Jane about flying, she upsets them and does not believe in fairies, making Tinker Bell sick. That night, Hook tricks Jane by lying that he will not harm Peter and she agrees to help him find the treasure. Hook gives Jane a whistle and leaves.\nJane asks Peter and the boys to play a game of \"treasure hunt\", and they wish Jane to believe in fairies and save Tinker Bell. As Jane finds the treasure and changes her mind into discarding the whistle, the boys make her the \"Lost Girl\" before Tootles finds and inadvertently blows the whistle. As the pirates arrive to capture the boys, Peter calls Jane a traitor and tells her because she does not believe in fairies, Tinker Bell is dying. Jane rushes back to the Lost Boys' home, but gets to Tinker Bell too late. Jane, realizing she is the reason Tinker Bell is gone, breaks down in tears for her, but she revives. They head to the ship and see Hook forcing Peter to walk the plank. With Tinker Bell's help, Jane learns to fly. As Peter drops the anchor on the ship and sinks into the sea, the pirates, riding on a rowboat, are pursued by the octopus.\nAfter saying goodbye to the boys, Peter escorts Jane back home, where Jane reconciles with Danny. Peter and Tinker Bell meet Wendy again, though she is an adult, they say goodbye. As Edward returns home from the war, Peter and Tinker Bell fly back to Neverland."}