{"mid": "Revanche", "IMDB_id": "tt1173745", "title": "Revanche", "plot": "Alex works in Vienna for Konecny, owner of the brothel \"Cinderella\", where Tamara, a Ukrainian prostitute, also works. Konecny has a possessive attitude towards Tamara, not realizing that she and Alex are in a secret relationship and want to leave Vienna as soon as possible to begin a new life together. While visiting his grandfather Hausner, who lives on a smallholding in the country, Alex decides to rob the local bank. Hausner has a neighbour, Susanne, who lives nearby, and visits him regularly. She is married to Robert, a policeman. They keenly want a child, but although Susanne was pregnant, she lost the baby and is unable to conceive a second time because of Robert's fertility problems. Susanne would like to adopt, but Robert refuses to accept that there is any difficulty in his fathering children. Consequently, their relationship is suffering.\nTamara has a bad feeling about Alex's planned bank robbery, and insists on waiting for him in the getaway car while Alex, armed and masked, holds up the bank. By chance, Robert is on patrol and walks past the car at the moment Alex is returning to it. Alex threatens him with his gun and drives off. Robert shoots at the tires as it speeds away but instead hits Tamara fatally. In despair, Alex abandons the car and Tamara's body in the wood and makes his way to Hausner's rustic barn, where he hides out. His loss makes him very withdrawn and distraught; he scarcely speaks, and spends hours every day aggressively chopping wood for the winter. Hausner begins playing the accordion a great deal with encouragement by Susanne, who visits often, adding to Alex's growing unease.\nRobert and Susanne's relationship becomes further strained because Robert's unintentional killing of Tamara is causing him great mental anguish. He blames himself for it and can find no way to discuss or deal with the guilt. He carries Tamara's photo round with him, and looks at it constantly. His colleagues refuse to take his grief seriously, and try to encourage him by telling him that he has only killed a bank robber's accomplice, and that in the forthcoming official inquiry into the death he will have nothing to worry about.\nWhile they are shopping Alex and Hausner meet Susanne, who tells them about the bank robbery and that it was her husband who shot at the car. This has an effect on Alex. On her visits to Hausner, Alex has scarcely reacted at all to the extremely talkative Susanne and, when he does, is very dismissive, although this has apparently not bothered her. Under cover of darkness, he now starts to spy on the couple in their house and follows Robert when he goes jogging in the woods. After one of her visits to Hausner, Alex speaks to Susanne bluntly and tries to discourage her from returning. This seems not to trouble her: she invites him to her house, with a hint that she will be alone that evening. Alex appears not to react to the invitation but that evening suddenly turns up at her terrace door and startles her, until she realises that it is \"only Alex.\" She offers him a glass of wine. While Susanne talks brightly but nervously in an uninterrupted stream, Alex looks depressed and is almost silent. After a while he asks her why she wants to have sex with him. To his astonishment Susanne participates willingly in an almost brutal sex act, which seems to offer Alex a vent for his accumulated aggression. When he goes to take a shower he sees the nursery that Suzanne and Robert have set up in their house, but Susanne refuses to discuss it. As he is leaving she asks if he wants to come again.\nThe next time Alex sees Robert jogging in the woods, he draws his gun and aims it at Robert's back, but does not fire it. Alex later meets Susanne again while shopping. She tells him that she will be alone again that evening and that she wants him to visit her, which he does. She asks him whether he has a girlfriend, and he tells her that until recently he used to have, but that she was murdered, and that now he thinks day and night about killing the murderer. Susanne protests that he cannot do such a thing, and must not even think about it. But she understands now why Alex is so cold, and takes him to bed. In the night Susanne is wakened by the sound of a car engine. Robert has come home, and she urges Alex, lying next to her, to go. Robert, crying, tells Susanne that he has been declared unfit for duty and suspended from the police force. He shows her Tamara's photo, which he is unable to stop looking at. As Susanne goes to throw it away, she sees Alex leaving the house.\nSome days later Alex is sitting on a bench by the lake in the woods and waiting for Robert. He jogs past, and sits on the bench with Alex. In the course of their conversation the subject of the bank robbery arises. Robert tells how the death of the young woman has preyed on his mind, and how he was aiming to shoot the tires. Alex asks if Robert is not afraid that the robber will come and shoot him, out of revenge. Robert's only comment is a resigned \"He's welcome to.\" He gets up to leave but pauses to add that he would like to ask the bankrobber why he took the woman with him in the first place: \"the whole mess wouldn't have happened if the woman hadn't been in that car without any reason.\" When Robert is out of sight, Alex throws his gun into the lake. That evening Susanne tells her husband that at last she is pregnant.\nOn Sunday Susanne calls again to take Hausner to church, but he is in hospital and only Alex is at home. She asks him to consider their affair at an end, and not to tell her husband about it, and Alex promises this. Susanne then sees Alex's photo of Tamara on the table, and in a moment of insight the connections suddenly become clear to her. At the end the two come to an understanding. The last scene is of Alex collecting fallen apples into a big basket."}