{"mid": "Ricochet", "IMDB_id": "tt0102789", "title": "Ricochet", "plot": "In 1983, rookie Los Angeles police officer and law student Nicholas Styles (Denzel Washington) meets his future wife Alice (Victoria Dillard). He drifts away from his childhood friend Odessa (Ice-T), who is drifting into a life of crime in South Central Los Angeles. Styles and his partner Larry Doyle (Kevin Pollak) patrol a carnival, where they encounter hitman Earl Talbot Blake (John Lithgow) and his servile accomplice Kim (Josh Evans). Styles catches Blake at gunpoint and is forced into a standoff when Blake takes a hostage. After stripping his equipment and uniform off, Styles uses a hidden gun in his athletic supporter, shooting Blake in the knee and subduing him. The incident is caught by an amateur videographer and is shown on television, making Styles a hero. He and Doyle are subsequently promoted to Detective, while Blake is sent to prison.\nEight years later, Styles has moved on to be an Assistant District Attorney, is married to Alice, and has two daughters. At the same time, Blake has degenerated into further violence fighting against the Aryan Brotherhood. He also strikes a deal with the leader of the gang to plot an escape. Having been incarcerated with Blake, Kim is paroled and plans to assist in Blake's escape and revenge. Blake and the AB members stage a violent prison escape during a parole hearing, which only Blake and the AB leader survive. Blake murders the gang leader and burns his corpse.\nStyles finds Odessa, who has become a major drug-dealer in the neighborhood. Blake and Kim later kill the city councilman, staging his death to appear as a suicide. Styles is abducted by Blake and Kim outside his home and is held hostage in an empty swimming pool for several days. Blake and Kim regularly inject Styles with heroin and cocaine while engaging in arm wrestling. Blake hires a blonde white female prostitute Wanda (Linda Dona) to have sex with Styles. As she stripes naked, Wanda ignores Styles' weak objections and proceeds to rape him as Blake records the incident on video. After Blake and Kim deposit Styles' unconscious body on the steps of City Hall, Alice overhears Styles' phone conservation and thinks he cheated on her with a prostitute. Styles witnesses a video of Blake going up to his daughters' room and holding a hatchet over them just before the tape cuts out. Terrified and enraged, Styles heads to the park, sees a black-clad figure who is a clown, and holds him at gunpoint. After the tape has been substituted with the video recording of Styles' rape, he vehemently protests his innocence and Blake's complicity to District Attorney Priscilla Brimleigh (Lindsay Wagner), who suspends Styles. After receiving evidence of Blake's obsession, Styles and Doyle go to the bookstore that night, and Styles beats information out of the owner. Blake ambushes Doyle, fatally wounds him in the alley, and escapes.\nDesperate, Styles contacts Odessa for help, evacuates his family from their home, and takes them to the housing project Odessa uses as a drug lab. Styles then goes to the roof and raves to the street below, appearing to be suicidal. Blake arrives at the project, while Styles fakes his own death by starting a fiery explosion in the building and escaping. Odessa's gang abducts Kim, and Odessa sends a message to Blake that Styles is alive and intends to get him, challenging him to come to the Watts Towers. Blake finds Kim tied to the scaffolding and kills him. On the towers, Blake and Styles fight until Styles knocks Blake off the tower, fatally impaling him on a spike. Styles reunites with his family and calls out to Odessa one last time, inviting him to basketball. The television news crews are there, broadcasting the latest events that have dramatically proven Styles innocent. When a newscaster (Mary Ellen Trainor) asks Styles for a comment, he turns off the news camera."}