{"mid": "RideWithTheDevil", "IMDB_id": "tt0134154", "title": "Ride with the Devil", "plot": "Jake Roedel and Jack Bull Chiles are friends in Missouri when the American Civil War breaks out. During the mayhem, Chiles's father is murdered by Kansas pro-Union Jayhawkers. The two men join the First Missouri Irregulars, also known as the Bushwhackers; informal units loyal to Missouri in 1861. They later meet George Clyde and former slave Daniel Holt, whose freedom Clyde has previously granted.\nThe Bushwhackers battle Jayhawkers using guerrilla warfare tactics while trying to evade capture. The men manage to hide out in a coarsely-built shelter on the property of a pro-Confederacy family, the Evanses. A young widow in the household, Sue Lee Shelley, becomes romantically involved with Chiles. When Chiles dies of gangrenous wounds received during a skirmish, Roedel escorts Shelley to a refuge dwelling where another pro-Confederate kindred, the Brown family, reside.\nFollowing the collapse and destruction of a makeshift prison holding the female relatives of guerrillas, a complementary clan of Bushwhackers led by William Quantrill plot a revenge attack against the Union and raid Lawrence, Kansas.\nIn the midst of the offense, a quarrel arises between Roedel and fellow Bushwhacker Pitt Mackeson. Roedel, a German American, was born in Germany but raised by his immigrant father in Missouri. He suffers from sporadic anti-German suspicion from other Southerners, because the German population in the state is largely sympathetic to the Union. In an episode of hostility, Mackeson purposely shoots Roedel in the leg shortly after the raid on Lawrence, while retreating from a counterattack by Union forces. The perceived prejudice contributes to Roedel's sympathy to the plight faced by Holt, a former slave coping with racism.\nMeanwhile, Shelley gives birth to Chiles's daughter. Holt and Roedel, both wounded, recover at the same residence that took in Shelley occupied by the Brown folk. The Browns, who mistakenly suppose Roedel is the child's father, pressure Roedel to marry her, which he is reluctant to do. However, after spending time with Shelley and the child, Roedel begins to have feelings for both of them.\nMeanwhile, Anderson and many other Bushwhackers have been killed, taken prisoner or otherwise rendered inactive. Pitt Mackeson has gathered some survivors into a gang which no longer fights the Yankees, but instead robs, murders and plunders Unionists and Southerners alike. Word comes from one of Roedel's compatriots that Mackeson and his gang are headed South and plan on visiting Roedel soon.\nOne day Mr. Brown takes Holt to town and returns with a reverend and Roedel, after realizing he does love Shelley and she him, marries her in an abrupt wedding. Roedel's feelings toward Shelley are further deepened by a tender wedding night together.\nProclaiming himself finished with war, Roedel gives up being a Bushwhacker and takes his new family to California.\nOn the way, they meet Mackeson and the last of his men, Turner, ragged, injured and on the run. They report Black John and Quantrill are both dead and agree with Roedel the war is lost. Mackeson tells them of his plan to ride into Newport despite the fact the town is full of Federal soldiers, and his strange manner causes Roedel and Holt to hold guns on Pitt and Turner, but the two ride off without violence.\nHolt rides with Roedel and his family toward California, until their roads part, and then Daniel tells Jake farewell, while Shelley and the baby sleep. Holt leaves for Texas, a free man, to find his long lost mother."}