{"mid": "RideThePinkHorse", "IMDB_id": "tt0039768", "title": "Ride the Pink Horse", "plot": "Lucky Gagin (Robert Montgomery) arrives on a bus in San Pablo, a small rural town in New Mexico during its annual fiesta. He plans to confront and blackmail money from a mobster named Frank Hugo (Fred Clark) as retribution for the death of his best friend Shorty. He unpacks the Colt 45 pistol from his luggage, sticks it in his waistband, places the check in question in locker 250, and secretes the locker key with a piece of chewing gum to the back of the framed map in the bus depot waiting room.\nBecause of the fiesta, Gagin cannot find a room at the hotel by the bus station. He is directed to the non-tourist side of the town. At the merry go round there, he meets Pila (Wanda Hendrix) who takes him to the La Fonda Hotel and gives him a charm of Ishtam that she says will protect him.\nAt the hotel, Gagin uses a ruse to find out that Frank Hugo is in room 315. Gagin comes, uninvited, into the hotel room, and proceeds to knock out Jonathan (Richard Gaines), Hugo's private secretary. Marjorie Lundeen (Andrea King), a sophisticated female acquaintance of Hugo's, comes in and uses her wiles trying to learn more about him. When the telephone rings, Gagin answers and impersonates a bell boy. Speaking with Hugo, he learns that Hugo will not be there that day. Gagin leaves the room and in the hotel lobby, he is accosted by FBI agent Bill Retz (Art Smith). In his conversation with Gagin, Retz recounts the plot so far. Retz takes Gagin to lunch and tells Gagin to lay off with his plot for revenge on Frank Hugo.\nStill looking for a room, Gagin ends up at the Cantina de las Tres Violetas, where Pila is inexplicably sitting outside. Going inside, Gagin finds himself to be the only non-Hispanic in the bar. He buys himself a large whiskey and pays for it with a twenty dollar bill. The barkeep can only make change for ten dollars and the situation is resolved by Pancho (Thomas Gomez), who proposes that Gagin buy ten dollars worth of drinks for everyone in the bar.\nGagin, having spent twenty dollars at the bar, accompanies Pancho back to his tiovivo (carousel) where Pancho puts him up for the night. Pila arrives at the merry go round and ends up sleeping in one of the seats on the carousel. Retz also shows up and warns Gagin of the toughs and tells him that if he could readily find Gagin, so will the toughs.\nThe next morning, Gagin goes back to the hotel where he meets Frank Hugo, who wears a hearing aid. Gagin tells Hugo that he has check number 6431 and proceeds to layout the blackmail. They agree to meet that evening at the Tip Top Cafe, where Hugo will pay Gagin the thirty thousand dollars for the incriminating check.\nRetz meets Gagin and \"officially\" asks for the evidence, which Gagin refuses to hand over. Gagin takes Pila to lunch and they are interrupted by the arrival of Marjorie Lundeen. She lays out a scheme for how to shakedown Frank Hugo for even more money, but Gagin does not go along with Marjorie's plan.\nAfter the lunch, Gagin returns to the bus depot where he retrieves the check and follows the fiesta crowd to the Tip Top Cafe. He meets with Hugo, who is having dinner with his associates. Hugo tells Gagin that the bank messenger with the money will be late. Marjorie invites Gagin to dance with her, and in order to not be seen by Hugo, she walks Gagin outside to a dark alley. There, she tells him that there is no messenger, but someone else. The response to Gagin's query as to who is coming is two toughs who jump him. In the ensuing fight, one of them stabs Gagin in the right shoulder with a knife. Retz finds the two toughs in the alley, one dead and one with a broken arm, and confronts Hugo at the dining table. While the police search the area, Pila finds Gagin in the bushes, pulls the knife out of his back, and together they make their way back to Pancho and the merry go round.\nGagin gives the check to Pila, who hides it in her bustier. Two toughs come to the tiovivo. With Gagin hidden in one of the seats by Pila, and children riding the carousel, the toughs proceed to severely beat Pancho, who does not divulge the presence of Gagin. Gagin, whose health and mental state are failing, agrees to go with Pila back by bus to her village of San Melo. While they are waiting in the Tres Violetas, they are found by Locke (Edward Earle) and Lundeen. When Locke approaches the now passed out Gagin, Pila hits him with a bottle and they make their escape, leaving Marjorie to find Locke lying on the floor the cantina.\nGagin makes his way back to the La Fonda Hotel, where Pila finds him outside room 315. The door is opened by one of Hugo's toughs and the duo is brought into the room,where Frank Hugo, Marjorie Lundeen, Jonathan, and the two toughs are present. Hugo begins to question the now incoherent Gagin, who does not remember where the check is. He is beaten by one of the toughs, who then proceed to also beat Pila. Retz arrives, disarms the toughs, breaks Hugo's hearing aid, and ultimately gets the check from Gagin.\nAt a two dollar breakfast the next day with Retz, Gagin refuses to eat. Retz tells Gagin that he should say goodbye to Pila and Pancho, and together they return to the merry go round. Gagin bids adieu to Pancho, and then, uncomfortably, to Pila, to whom he returns the Ishtam charm. As Retz and Gagin leave, Pila, who had been somewhat of an outcast with her peers, is surrounded by them. She recounts the story of her adventure and realizes that now she is the center attraction among her group.\n=== Adaptation ===\nIn the novel, a character named \"Sailor\" rather than Frank Hugo has managed to obtain a deferment from military service. The film makes many details, including those of the blackmail scheme, less sordid, and adopts different names and occupations for the principal non-Mexican characters. Although Gagin's first name is never mentioned in the film, the opening credits read: Robert Montgomery is Lucky Gagin.\nThe character Frank Hugo, as portrayed by Fred Clark, has more than a passing resemblance to Zozobra, the god of bad luck, who burned as part of the fiesta."}