{"mid": "RideClearOfDiablo", "IMDB_id": "tt0047411", "title": "Ride Clear of Diablo", "plot": "Sheriff Fred (Paul Birch) and lawyer Tom (William Pullen) conspire to have dance hall girl Kate (Abbe Lane) entertain the hired hands of the O'Mara ranch whilst the Sheriff and the lawyer rustle the O'Mara's stock. Tom shoots both the father and teenage O'Mara son to leave no witnesses.\nSurviving son Clay (Audie Murphy), a railroad surveyor in Denver, is informed of their deaths and comes back to his home where the identity of the murderers is unknown. Clay is talked out of revenge by the town Reverend (Denver Pyle) but Clay makes his own enquiries to the sheriff and Tom. When Clay asks the sheriff if he can become his deputy in order to make an investigation, the sheriff at first refuses. Tom advises the sheriff that it would be a good idea with Clay sent on a false trail to arrest notorious gunslinger Whitey Kinkaid (Dan Duryea) in the town of Diablo. Kinkaid has no connection with the murders, but the corrupt pair plan that Kinkaid will kill the pesky Clay. Ringer (Russell Johnson).\nTo everyone's surprise Clay outdraws Kinkaid, arrests him, thwart's Kinkaid's escape attempts and successfully fights off an ambush from three men. Kinkaid, who spends his life by hanging and idling about, is bemused by the unstoppable Clay and watches him go after the real killers; at first he does this for amusement, but gradually he realizes that the moral attitude of the much younger Clay is like a valuable lesson in living a worthwhile life. It is amusing to see how he accepts him finally as an exemplar. Kinkaid's identification goes so far as to sacrifice himself to save the younger hero's life in several gunfights, all in accordance with the fact, that he said that if ever he feels he's become \"like a human being\", he will shoot (meaning here, sacrifice) himself.\nHence the moral lesson of the film is to show how right thinking and acting may sometimes turn the attitudes of depraved characters inside out; the audience are presented with a character in moral transformation, Western style. Murphy, as Clay, has top billing, showing successive bouts of corruption-busting action aided by his new friend, Kincaid, who ultimately demonstrates he'll make the ultimate sacrifice if needs be."}