{"mid": "Ridicule", "IMDB_id": "tt0117477", "title": "Ridicule", "plot": "The film begins in 1783 with the Chevalier de Milletail (Carlo Brandt) visiting the elderly Monsieur de Blayac (Lucien Pascal), confined to his chair. He taunts him about his past prowess in wit and reminds him of how he humiliated him, naming him \"Marquis de Clatterbang\" when he fell over while dancing. He then urinates on the helpless old man.\nThe film then shifts to the Dombes, a boggy region north of Lyon. The Baron Grégoire Ponceludon de Malavoy (Charles Berling) is a minor aristocrat and engineer. He is one of the few aristocrats who care about the plight of the peasants. Horrified by the sickness and death caused by the mosquitoes that infest the swamps, he hopes to drain them; he goes to Versailles in the hope of obtaining the backing of King Louis XVI (Urbain Cancelier).\nJust before reaching Versailles, Ponceludon is robbed and beaten. He is found by the Marquis de Bellegarde (Jean Rochefort), a minor noble and physician. As Ponceludon recuperates at the marquis' house, Bellegarde takes him under his wing, teaching him about wit (l'esprit), the primary way to make one's way at court. At first, Ponceludon's provincial background makes him a target at parties and gatherings, even though he proves himself a formidable adversary in verbal sparring.\nAt one such party, he catches L'abbé de Vilecourt (Bernard Giraudeau) cheating at a game of wits, with the help of his lover, Madame de Blayac (Fanny Ardant), the beautiful and rich recent widow of Monsieur de Blayac, who was to have been Ponceludon's sponsor at court. Blayac repays his generosity in not exposing them by arranging for the certification of his lineage—thereby allowing his suit to proceed. Despite his success, Ponceludon begins to see that the court at Versailles is corrupt and hollow.\nIn one notable example, a bumbling noble of the court, Monsieur de Guéret, falls asleep during a roll call to partake in court with the King Louis XVI. L'abbé de Vilecourt, seeing that the noble is asleep, removes the noble's shoe, throwing it in a fireplace, and mimics a call for him. The noble wakes upon hearing his name, but finding out he has only a single shoe, is terribly distraught. To attend court without the proper clothes is a social impossibility, and because of this, the noble is forced to leave. He is so terribly distraught with his own failure that he later hangs himself in the garden.\nThe only exception is Mathilde de Bellegarde (Judith Godrèche), the doctor's daughter. She has agreed to marry Monsieur de Montaliéri, a rich, old aristocrat whose wife is dying. Her motivation is twofold: to support her science experiments and to help pay off her father's debts. Ponceludon begins to help her with her experiments. Montaliéri observes their growing attraction to each other. Later, Montaliéri tells Ponceludon that he should wait, as he is not likely to live very long, and Mathilde would be a rich widow. Even after Mathilde admits that she dreads her upcoming marriage, Ponceludon does not want her to end up the wife of a poor man.\nOne day, a deaf-mute named Paul runs through the woods wearing Mathilde’s diving suit and frightens Madame de Blayac. Blayac makes Bellegarde send him away. Bellegarde sends the boy to the Abbé de l'Épée, a pioneering educator of the deaf. Mathilde visits Madame de Blayac and unsuccessfully pleads for Paul. Madame de Blayac senses a rival for Ponceludon. Meanwhile Vilecourt is concerned that Ponceludon is becoming too successful, so Madame de Blayac promises to bring him down. Madame de Blayac traps Ponceludon at a dinner party (with her accomplice Montaliéri) where one too many guests has been invited. A contest of wit is used to settle who must make a humiliating departure. Distracted by Blayac, Ponceludon loses, and is convinced that his disgrace will force him to leave the court. However, he is reminded of why he set out in the first place when a village child dies from drinking contaminated water. During this time, Mathilde appears at court, breaking the terms of her engagement contract.\nVilecourt finally obtains an audience with the King, but blunders by accidentally blaspheming against God in an attempt to be witty, and Blayac turns her attention back to Ponceludon, convincing him to return to Versailles. He sleeps with her in exchange for her assistance; she arranges a meeting with the King. She maliciously has Bellegarde attend her in his capacity as physician when Ponceludon is still with her, ensuring that Mathilde learns of their relationship.\nDuring a presentation at court of the Abbé de l'Épée's work with deaf people and development of sign language, the nobles ridicule the deaf mercilessly. However, some nobles change their minds when the deaf demonstrate their own form of wit: sign language puns. In response, de Bellegarde stands and asks how to sign \"bravo,\" leading Ponceludon to rise and clap to show his support. Mathilde is touched, and they soon make up.\nPonceludon joins the King's entourage and, after showing off his engineering prowess by proposing an improvement to a cannon, secures a private meeting with the King to discuss his project. The embarrassed cannoneer then insults Ponceludon, forcing him into demanding a duel. Madame de Blayac almost persuades him to avoid the duel, but he eventually decides to proceed, under the supervision of Bellegarde. He kills the cannoneer, but is later informed that the King cannot meet with someone who has killed one of his officers right after his death, although he is assured that it was right to uphold his honour.\nMadame de Blayac is furious when she learns that Ponceludon has left her for Mathilde and plots her revenge. Ponceludon is invited to a costume ball \"only for wits.\" Upon arriving at the ball with Mathilde, he is manoeuvered into dancing with Blayac and is tripped. His spectacular fall earns him the derisive nickname \"Marquis des Antipodes\" by Milletail. Ponceludon tears off his mask and condemns their decadence. He tells them that they class themselves with Voltaire because of their wit, but they have none of Voltaire's compassion. He vows to drain the swamp by himself, and leaves the court with Mathilde. Madame de Blayac removes her mask and stands silently crying.\nThe movie closes in Dover, England in 1794, where Bellegarde has fled from the French Revolution and where he gets a taste of the English “humour” which the nobles had discussed earlier in the film. On-screen text states that Grégoire and Mathilde Ponceludon successfully drained the Dombes and live in revolutionary France."}