{"mid": "Rigoletto", "IMDB_id": "tt0038882", "title": "Rigoletto", "plot": "Place: Mantua\nTime: the Sixteenth century\n=== Act 1 ===\nScene 1: A room in the palace of Duke of Mantua\nAt a ball in his palace, the Duke sings of a life of pleasure with as many women as possible: \"Questa o quella\" (\"This woman or that\"). He has seen an unknown beauty in church and desires to possess her, but he also wishes to seduce the Countess of Ceprano. Rigoletto, the Duke's hunchbacked court jester, mocks the husbands of the ladies to whom the Duke is paying attention, including the Count Ceprano, and advises the Duke to get rid of him by prison or death. The Duke laughs indulgently, but Ceprano is not amused. Marullo, one of the guests at the ball, informs the courtiers that Rigoletto has a \"lover\", which astonishes them. The courtiers resolve to take vengeance on Rigoletto for making fun of them. The festivities are interrupted by the arrival of the elderly Count Monterone, whose daughter the Duke had seduced. Rigoletto provokes him further by making fun of his helplessness to avenge his daughter's honor. Monterone confronts the Duke, and is immediately arrested by the Duke's guards. Before being led off to prison, Monterone curses Rigoletto for having mocked his righteous anger. The curse terrifies Rigoletto, who believes that an old man's curse has real power.\nScene 2: A street, with the courtyard of Rigoletto's house\nPreoccupied with the old man's curse, Rigoletto approaches his house and is accosted by the assassin Sparafucile, who walks up to him and offers his services. Rigoletto declines for the moment, but leaves open the possibility of hiring Sparafucile later, should the need arise. Sparafucile wanders off, after repeating his own name a few times. Rigoletto contemplates the similarities between the two of them: \"Pari siamo!\" (\"We are alike!\"); Sparafucile kills men with his sword, and Rigoletto uses \"a tongue of malice\" to stab his victims. Rigoletto opens a door in the wall and returns home to his daughter Gilda. They greet each other warmly: \"Figlia!\" \"Mio padre!\" (\"Daughter!\" \"My father!\"). Rigoletto has been concealing his daughter from the Duke and the rest of the city, and she does not know her father's occupation. Since he has forbidden her to appear in public, she has been nowhere except to church and does not even know her own father's name.\nWhen Rigoletto has gone, the Duke appears and overhears Gilda confess to her nurse Giovanna that she feels guilty for not having told her father about a young man she had met at the church. She says that she fell in love with him, but that she would love him even more if he were a student and poor. As she declares her love, the Duke enters, overjoyed. Gilda, alarmed, calls for Giovanna, unaware that the Duke had sent her away. Pretending to be a student, the Duke convinces Gilda of his love: \"È il sol dell'anima\" (\"Love is the sunshine of the soul\"). When she asks for his name, he hesitantly calls himself Gualtier Maldè. Hearing sounds and fearing that her father has returned, Gilda sends the Duke away after they quickly trade vows of love: \"Addio, addio\" (\"Farewell, farewell\"). Alone, Gilda meditates on her love for the Duke, whom she believes is a student: \"Gualtier Maldè!... Caro nome\" (\"Dearest name\").\nLater, Rigoletto returns: \"Riedo!... perché?\" (\"I've returned!... why?\"), while the hostile courtiers outside the walled garden (believing Gilda to be the jester's mistress, unaware she is his daughter) get ready to abduct the helpless girl. They tell Rigoletto that they are actually abducting the Countess Ceprano. He sees that they are masked and asks for a mask for himself; while they are tying the mask onto his face, they also blindfold him. Blindfolded and deceived, he holds the ladder steady while they climb up to Gilda's room: Chorus: \"Zitti, zitti\" (\"Softly, softly\"). With her father's unknowing assistance Gilda is carried away by the courtiers. Left alone, Rigoletto removes his mask and blindfold, and realizes that it was in fact Gilda who was carried away. He collapses in despair, remembering the old man's curse.\n=== Act 2 ===\nThe Duke's Palace\nThe Duke is concerned that Gilda has disappeared: \"Ella mi fu rapita!\" (\"She was stolen from me!\") and \"Parmi veder le lagrime\" (\"I seem to see tears\"). The courtiers then enter and inform him that they have captured Rigoletto's mistress: Chorus: \"Scorrendo uniti\" (\"We went together at nightfall\"). By their description, he recognizes it to be Gilda and rushes off to the room where she is held: \"Possente amor mi chiama\" (\"Mighty love beckons me\"). Pleased by the Duke's strange excitement, the courtiers now make sport with Rigoletto, who enters singing. He tries to find Gilda by pretending to be uncaring, as he fears she may fall into the hands of the Duke. Finally, he admits that he is in fact seeking his daughter and asks the courtiers to return her to him: \"Cortigiani, vil razza dannata\" (\"Accursed race of courtiers\"). Rigoletto attempts to run into the room in which Gilda is being held, but the courtiers block the way. Gilda enters. The courtiers leave the room, believing Rigoletto has gone mad. Gilda describes to her father what has happened to her in the palace: \"Tutte le feste al tempio\" (\"On all the blessed days\"). In a duet Rigoletto swears vengeance against the Duke, while Gilda pleads for her lover: \"Sì! Vendetta, tremenda vendetta!\" (\"Yes! Revenge, terrible revenge!\").\n=== Act 3 ===\nA street outside Sparafucile's house\nA portion of Sparafucile's house is seen, with two rooms open to the view of the audience. Rigoletto and Gilda arrive outside. The Duke's voice can be heard from inside, singing \"La donna è mobile\" (\"Woman is fickle\"). Sparafucile's sister, Maddalena, has lured him to the house. Rigoletto and Gilda listen from outside as the Duke flirts with Maddalena. Gilda laments that the Duke is unfaithful; Rigoletto assures her that he is arranging revenge: \"Bella figlia dell’amore\" (\"Beautiful daughter of love\").\nRigoletto orders Gilda to put on a man's clothes to prepare to leave for Verona and tells her that he plans to follow later. After she leaves, he completes his bargain with the assassin, who is ready to murder his guest for 20 scudi. Rigoletto then withdraws.\nWith falling darkness, a thunderstorm approaches and the Duke decides to spend the rest of the night in the house. Sparafucile directs him to the ground floor sleeping quarters, resolving to kill him in his sleep.\nGilda, who still loves the Duke despite knowing him to be unfaithful, returns dressed as a man and stands outside the house. Maddalena, who is smitten with the Duke, begs Sparafucile to spare his life. Sparafucile reluctantly promises her that if by midnight another victim can be found, he will kill the other instead of the Duke. Gilda, overhearing this exchange, resolves to sacrifice herself for the Duke, and enters the house. Sparafucile stabs her and she collapses, mortally wounded.\nAt midnight, when Rigoletto arrives with money, he receives a corpse wrapped in a sack, and rejoices in his triumph. Weighting it with stones, he is about to cast the sack into the river when he hears the voice of the Duke, sleepily singing a reprise of his \"La donna è mobile\" aria. Bewildered, Rigoletto opens the sack and, to his despair, discovers his dying daughter. For a moment, she revives and declares she is glad to die for her beloved: \"V'ho ingannato\" (\"Father, I deceived you\"). She dies in his arms. Rigoletto cries out in horror: \"La maledizione!\" (\"The curse!\")"}