{"mid": "Ringu", "IMDB_id": "tt0178868", "title": "Ringu", "plot": "High school students Katie and Becca discuss an urban legend about a cursed videotape which kills anyone who watches it seven days later. Katie admits that she watched the tape with her boyfriend and two friends the previous week. That night, Katie is killed by an unseen force.\nAt Katie's funeral, her aunt Rachel, a Seattle journalist, is asked by Katie's mother, Ruth, to investigate her death. Rachel discovers that Katie's boyfriend and two other teenagers mysteriously died on the same night as Katie. After learning that they watched the cursed videotape at Shelter Mountain Inn, Rachel travels there and watches the tape, which contains disturbing and surreal imagery. Afterwards, she receives a phone call from an unknown caller who utters \"seven days\".\nRachel recruits the help of Noah, the estranged father of her son, Aidan. He watches it and has Rachel make him a copy to study. Rachel discovers hidden footage of a lighthouse on the tape. Her research leads her to identify a woman on the tape: a horse breeder, Anna Morgan, who committed suicide after her horses were involved in a mass suicide in Moesko Island. Rachel discovers Aidan watching the videotape and informs Noah.\nLeaving Aidan in Ruth's care, Rachel heads for Moesko Island to speak to Anna's widower, Richard. At the same time, Noah travels to Eola Psychiatric Hospital to view Anna's medical files, which contains missing footage. On the ferry to the island, Rachel spooks a racehorse and it leaps off the ferry to its death. On the island, she discovers Anna had an adopted daughter, Samara, but Richard denies it.\nRachel speaks with the island doctor, who explains that Anna could not conceive and so adopted Samara. Samara possessed an uncontrolled ability to psychically etch images onto objects and into the minds of her parents and their horses, tormenting them. Noah also learns of Samara's existence and heads for the island.\nRachel sneaks into the Morgan house and watches the missing footage of Samara explaining her powers during a psychotherapy session. Richard discovers her and strikes her. Realizing that Samara's evil is still at large, he electrocutes himself in the bathtub. Noah arrives and he and Rachel enter the barn. In a loft converted to Samara's bedroom to isolate her from her mother, they find an image of a tree behind the wallpaper; Rachel realizes it is the image of a tree at the Shelter Mountain Inn.\nIn Cabin 12, Rachel and Noah discover a stone water well beneath the floorboards. They remove the lid but Rachel is pushed inside. A hand grabs her, and Rachel experiences a vision of Anna pushing Samara into the well, where she survived for seven days. Samara's corpse surfaces in the well and Rachel tries to appease her spirit by giving her a proper burial. Afterwards, Noah informs Rachel that seven days have passed since she watched the cursed videotape, leading them to believe that the curse is broken.\nAidan warns Rachel that the curse is not over. Rachel realizes that Noah is next and rushes to save him, but the vengeful ghost of Samara crawls out of his television and kills him. Rachel finds his corpse and returns home to destroy the tape. She realizes that she was spared because she made a copy and showed it to Noah. Rachel helps Aidan make his own copy and plans to show it to someone else."}