{"mid": "Rings", "IMDB_id": "tt0449092", "title": "Rings", "plot": "In October 2013, on an airplane bound for Seattle, passenger Carter, reveals to Faith that he has watched Samara Morgan’s cursed videotape before heading to the bathroom. Faith tells another passenger Kelly, who reveals she has seen the tape too. She rushes to the bathroom and asks Carter if he made a copy and after learning he hasn't, the airplane begins to malfunction as Samara comes for Carter and eventually causes the plane to crash.\nTwo years later, college professor Gabriel buys an old VCR once owned by Carter, discovering the videotape inside. Elsewhere, Julia sees her boyfriend Holt off to college, but becomes concerned when he falls out of contact. She is inspired to find him when a panicked girl, Skye, contacts her asking for Holt’s whereabouts. Julia meets Gabriel, following him to a private area of the college where a group of people known as \"The Sevens\", are involved in an experiment involving the cursed video, watching and filming themselves, before passing the task to another person, called a “tail”.\nJulia recognizes Skye, who takes her to her apartment to have her watch the video, but Holt contacts Julia, warning her not to. Julia locks herself in the bathroom as Skye is murdered by Samara. Holt arrives shortly after. He reveals that he has watched the tape as well and has 12 hours left. Unwilling to let Holt die, Julia watches his copy and when she picks up the phone after, she experiences a vision of a door. As she reaches for the handle, the phone burns a mark on her hand. Turning to Gabriel for help, he notices Julia’s copy of the video cannot be copied and is larger than usual. He discovers extra images within the tape and Julia watches the new footage which features a mysterious woman and tells them that they must cremate Samara's physical remains.\nGabriel sends them to the town Sacrament Valley, where Samara was given a burial after the residents of her island refused to accept the remains. He later realizes the mark on Julia’s hand is Braille, translates it, and goes to warn them. Arriving in town, Julia and Holt travel to a church Julia saw on the video, exploring the graveyard for Samara’s stone. They find an unmarked tomb, but when they break in, they find it is empty. Julia and Holt are caught and taken to a blind man named Burke, who claims Samara’s body was entombed by the local priest but a flood came shortly after leading the priest to bury her in a Potter's field just outside town. He also notes Julia’s mark, asking her why she has it.\nHeading out of town to look for the remains, Julia and Holt are stopped due to a car crash and learn Gabriel was involved. He tries to warn Julia of his discovery but is fatally electrocuted by a falling utility pole. After experiencing a vision of Samara’s birth mother, Evelyn, Julia and Holt return to town. While Holt makes inquiries about Evelyn’s fate, Julia goes to the church following her visions. She discovers a hidden chamber beneath the bell tower and finds evidence that Evelyn was imprisoned there whilst pregnant, held in captivity by the priest after being raped before she escaped at eight and a half months into the pregnancy.\nJulia visits Burke and explains her findings. He suddenly attacks her, revealing he was not only the priest but Samara’s biological father, and had blinded himself to escape the reach of his daughter’s powers. Julia pushes him down the stairs, temporarily incapacitating him. Meanwhile, Holt, finding Julia missing, rushes to Burke's house where he is knocked unconscious. Julia is drawn to a room in the house where she discovers Samara’s skeleton hidden behind a wall. Burke suddenly appears behind her and tries to choke her to death, but a swarm of cicadas fly in, summoning Samara through Julia’s phone. Samara removes Burke’s blindness so she can kill him. Holt recovers and rushes to Julia's aid. Later that night, he and Julia cremate Samara’s corpse.\nShortly after, Julia and Holt return home. While Julia is in the shower, Holt notices a voicemail from Gabriel, who warns him of the Braille. Holt begins to translate it on the computer, discovering it means “rebirth”. The computer begins to malfunction as Holt translates the symbol. In the bathroom, Julia peels away the skin where the mark was, revealing gray skin underneath. She falls to the floor and begins to cough up a string of black hair, from which a cicada is born. Holt unsuccessfully tries to disconnect the computer as Julia’s copy of the video is suddenly sent to everyone on her contact list and begins going viral. Julia stands again, gazes into the mirror, and as she clears away the fog, her reflection is that of Samara's."}