{"mid": "RisingSun", "IMDB_id": "tt2404353", "title": "Rising Sun", "plot": "During a commencement gala at the newly opened Los Angeles headquarters of Nakamoto, a Japanese keiretsu, a professional escort named Cheryl Lynn Austin (Tatjana Patitz) is found dead, apparently after a violent sexual encounter. Police Detectives Web Smith (Wesley Snipes) and John Connor (Sean Connery), a former police captain and expert on Japanese affairs, are sent to act as liaison between the Japanese executives and the investigating officer, Smith's former partner Tom Graham (Harvey Keitel). During the initial investigation, Connor and Smith review security footage taped by hidden surveillance cameras, and realize that one of the laserdiscs is missing.\nSmith and Connor suspect Eddie Sakamura (Cary-Hiroyuki Tagawa), a sleazy yakuza playboy and Cheryl's boyfriend of killing her, and interrogate him at a house party. Sakamura promises to bring Connor something, and Connor reluctantly lets him go after confiscating his passport, due to his father having saved his life in Japan years ago. Ishihara, a Nakamoto employee whom Connor had previously interrogated, delivers the missing laserdisc, which clearly shows Sakamura killing Cheryl. Graham and Smith lead a SWAT raid on Sakamura's house. He tries to flee in a sports car, but crashes it into oncoming traffic and is killed.\nSmith learns that Sakamura had attempted to contact him moments before the raid about the missing laserdisc, and with Connor takes the disc to an expert, Jingo Asakuma (Tia Carrere), who reveals that disc is copy and has been digitally altered to implicate Sakamura in the murder.\nNakamoto is in the midst of sensitive negotiations for the acquisition of an American software company, with Senator John Morton (Ray Wise), a guest at the party, abruptly changing his stance on a bill that would prevent the merger from going through. Suspecting his sudden shift is somehow related to the murder, Connor and Smith attempt to interview him at his campaign office, but without much success. Upon returning to Smith's apartment, the duo find Sakamura alive and well. He reveals that he was being tailed that day by Tanaka (Clyde Kusatsu), a Nakamoto security agent attempting to locate the original disc. Not wanting to be seen with Sakamura, Tanaka stole his sports car and committed suicide by crashing it. Eddie gives Connor the original, unaltered security footage, but before he can leave, Lt. Graham arrives with Ishihara, revealing the two to be in cahoots. Sakamura is killed trying to fight off Ishihara's men, and Smith is shot and left for dead, surviving only thanks to a bulletproof vest.\nAfter being interrogated all night, Smith is put on paid leave due to an ongoing investigation of an earlier corruption charge. Regrouping with Connor and Jingo, the three view the original surveillance footage, which shows Senator Morton performing erotic asphyxiation on Cheryl while Sakamura looks on. Falsely believing to have killed her, Morton changes his stance on the regulation bill to stay in Nakamoto's good graces. After leaving the boardroom, the footage shows an unknown figure approaching and killing Cheryl by strangulation.\nHoping to draw the killer out, Connor and Smith send fax Morton stills of the footage showing his implicit involvement in the murder. Panicking, Morton contacts Ishihara, revealing the executive to be in on the cover-up as well. Morton commits suicide, and Connor, Smith, and Jingo interrupt the merger negotiations to show Nakamoto President Yoshida (Mako Iwamatsu), the surveillance footage. Bob Richmond (Kevin Anderson), an American lawyer working for Nakamoto, reveals himself as the killer and tries to run away, only to be drowned in wet cement by Sakamura's friends.\nYoshida maintains his and his colleagues innocence, quietly exiling Ishihara to a desk job back in Japan. Smith drives Jingo home, where she casts doubt on whether Richmond was really the murderer, or if he was simply taking the fall to protect someone higher up in the organization."}