{"mid": "RiskyBusiness", "IMDB_id": "tt0086200", "title": "Risky Business", "plot": "Joel Goodson is a high-achieving high school student who lives with his wealthy parents in the North Shore area of suburban Chicago. His father wants him to attend Princeton University, his alma mater, so Joel participates in Future Enterprisers, an extracurricular activity in which students work in teams to create small businesses. When his parents go away on a trip, Joel's friend, Miles, convinces him to take advantage of his newfound freedom to have some fun. On the first night, he raids the liquor cabinet, plays the stereo loudly, and dances around the living room in his underwear and pink dress shirt to \"Old Time Rock and Roll\". The following day, Miles calls a call girl named Jackie on Joel's behalf. Jackie turns out to be a tall, masculine transvestite. Joel pays Jackie to go away, but before she leaves, she gives Joel the number for Lana, another prostitute. That night, Joel is unable to sleep and hesitantly calls Lana. She turns out to be a gorgeous blonde and they have sex all night.\nLana asks Joel for $300 for her services. He goes to the bank, but when he returns, Lana is gone, along with his mother's expensive Steuben glass egg. Joel finds Lana and demands the egg back, but they are interrupted by Lana's pimp Guido, who pulls a gun. While in his father's Porsche 928, Joel is chased by Guido, but eventually escapes. Lana tells Joel that the egg is with the rest of her stuff at Guido's. Joel lets Lana stay at his house while he goes to school. When he returns, his friends are over, and Lana has invited another prostitute Vicki to stay, but Joel rejects the idea. That night, Joel, Lana, Vicki, and Joel's friend Barry go out. They get stoned, and while Vicky and Barry wander away, Joel and Lana talk. Lana takes exception to something Joel says and leaves. While retrieving her purse from Joel's car, she moves the shifter out of gear. Moments later, the car rolls down the hill and onto a pier, despite Joel's futile attempt to stop it. The pier collapses, dumping the Porsche into Lake Michigan.\nWhen Joel takes the car to a repair shop, he is horrified to learn how much it will cost to fix it. He and Lana later decide to turn his parents' house into a brothel for a night; Joel's share of the profits will pay for the car repairs. The party is a huge success; the house is packed with Joel's friends and classmates and Lana's co-workers. However, the recruiter from Princeton, Rutherford chooses that night to interview Joel for admission to Princeton. The interview is plagued by interruptions, and Rutherford is unimpressed by Joel's resume. Afterwards, he stays at the party and becomes acquainted with Lana's friends. After the party, Joel and Lana go and have sex on the deserted Chicago 'L'.\nThe next morning, Joel finds his house has been burgled. When he tries to call Lana, Guido answers; he tells Joel that he will let Joel buy back his furniture. Fortunately, Joel and his friends manage to get everything moved back in just as his parents walk in, though his mother notices a crack in her egg. Later, Joel's father congratulates him; the interviewer was very impressed and has indicated Joel will be accepted into Princeton. Joel meets Lana at a restaurant, and they speculate about their future. She tells him that she wants to keep on seeing him; he jokes that it will cost her.\n=== Alternate ending ===\nThe remastered 25th-anniversary edition offers \"both the upbeat studio ending and Mr. Brickman's original, more tentative and melancholic conclusion\"."}