{"mid": "Roadgames", "IMDB_id": "tt0083000", "title": "Roadgames", "plot": "The film opens on truck driver Patrick Quid (Stacy Keach) as he pulls into a motel for the night. Quid notices a man in a green van checking in with a female hitchhiker he had passed earlier because the trucking company policy forbids it. Nevertheless, Quid is upset at the man for taking the last room in the motel and picking up the attractive hitcher. In the motel, the hitcher strums a guitar naked on the bed, while the unidentified man unpacks a new guitar string. He winds the string around his gloved hands and uses it to strangle the woman.\nQuid wakes the next morning in his truck. His pet dingo sniffs relentlessly at the garbage outside the motel, and Quid notices the van driver watching the dingo from the window of the motel room. Quid picks up a load of pigs from Universal Meats. He sets off for Perth with his load and passes various characters on the road: a nagging wife and her family, a cautious man hauling a sailboat, and a station wagon crammed full of toy balls. He repeatedly passes by another female hitchhiker.\nThe nagging wife creates a roadblock by streaming pink paper across the highway. When Quid stops at the sight of it, she climbs into his cab and orders Quid to catch up with her husband who left her at the side of the road. They play What's My Line? to pass the time. The woman informs Quid about the grisly murder of a woman, and his nonchalant answers start to disturb her. She suspects that he might be the serial killer from the news. Quid stops the truck when he sees the green van parked along the road. Its driver has several trash bags and an esky. He appears to be burying the bags. When the van driver notices Quid watching him through binoculars, he abandons his work and drives away.\nAt a roadhouse, the van driver assaults Quid's dingo while he is inside. Quid gives chase, but he encounters the slow driving boat owner who refuses to let Quid pass. Eventually, Quid destroys the boat, but the green van is too far off to catch.\nQuid picks up the female hitchhiker, Pamela Rushworth (Jamie Lee Curtis), that he has passed before. She gradually reveals that she is the daughter of a powerful American diplomat. Quid urges Pamela to let her father know that she is alright. The duo eagerly discuss the serial killer. At a service station, they notice the green van parked near the restroom. Quid sees a pair of feet in the toilet stall, and he thinks he has the killer cornered. Pamela investigates the green van while Quid tries to get the man to exit the stall. As Pamela reaches for the esky inside the van, she realizes that the driver is sleeping on the floor. In the restroom, a biker emerges from the stall and rushes outside. Quid rushes outside to see that the green van is gone.\nWhen he catches up to the van, it appears that Pamela is happily in the passenger seat. Later that night, Quid notices the van parked off the side of the road, and pulls over to investigate. He hears people giggling in the bushes nearby and assumes that Pamela and the van driver are engaged in sexual intercourse. When he breaks into the van to investigate, he finds that the esky only contains food so he rests his suspicions.\nQuid arrives at the outskirts of Perth, and while reporting to the weigh station, sees the green van. The proximity of several police cars revives his suspicions, and he follows the van through the streets of Perth, trailed by the police. Eventually the van reaches a dead end, and Quid's truck becomes stuck in the narrow alleys.\nThe van driver approaches Quid's truck and attempts to strangle Quid with a garrotte, but Quid manages to disarm him. When Quid starts to strangle the van driver with the same weapon, the police arrive and falsely assume that Quid is the killer. Upon freeing a gagged and bound Pamela from the van, the police learn that Quid is innocent, and pursue Pamela's actual captor through the crowd.\nWhen Quid finally delivers the meat shipment, a torso and human head, presumably belonging to a murder victim, are found in his trailer."}