{"mid": "RoadHouse", "IMDB_id": "tt0098206", "title": "Road House", "plot": "James Dalton (Patrick Swayze) is a professional \"cooler\" (i.e. specialized doorman, or bouncer) with a mysterious past who is enticed from his current job at a club in New York City by Frank Tilghman (Kevin Tighe) to take over security at his club/bar, the Double Deuce, in Jasper, Missouri. Tilghman plans to invest substantial money into the club to enhance its image, and needs a first-rate cooler to maintain stability.\nArriving in Jasper, Dalton eventually takes lodging at a local farm owned by Emmett (\"Sunshine\" Parker). He attracts attention driving his 1965 Buick Riviera and having a quiet demeanor—contrasting with the tough locals. Dalton's \"real\" car is a 1986 Mercedes 560SEC with New York license plates, which he keeps hidden (at a private garage and later under a car cover in his landlord's barn in Jasper) because it becomes a target for disgruntled bar patrons. Dalton is soon introduced to local business magnate (and next door neighbor) Brad Wesley (Ben Gazzara), who appears to have a stranglehold on the town; little happens without his knowledge and approval. In the course of cleaning up the violent nightclub, Dalton dismisses several unruly and corrupt employees, some of whom are connected with Wesley. After one particularly violent night where Dalton is forced to physically remove Wesley's henchmen, he suffers a knife wound. Going to the hospital for stitches, he strikes up a friendship with Dr. Elizabeth \"Doc\" Clay (Kelly Lynch), which develops into a romantic relationship.\nWesley summons Dalton to his home in a seemingly innocent attempt to make peace, but has an ulterior motive: Wesley would like Dalton to work for him once he extorts Tilghman's club. When Dalton declines, Wesley begins an assault on Dalton's friends, including interfering with liquor deliveries to the Double Deuce. Dalton's mentor, legendary but aging cooler Wade Garrett (Sam Elliott), arrives in town after a disconcerting phone call from Dalton and helps him defend a liquor shipment from Wesley's thugs.\nThat evening, local business owner Red Webster's (Red West) auto parts store is destroyed by a fire after he refuses to give ground to Wesley's persistent extortion demands. Dalton, not wanting to exacerbate matters, allows Wesley and his men entrance to the club that night. The next day, car dealership owner Pete Stroudenmire becomes Wesley's next victim when he also refuses to pay. As a result, Wesley has one of his thugs, Gary Ketchum (Anthony De Longis), demolish the dealership and crush four station wagons in the showroom with his monster truck (BIGFOOT #7) as Dalton and his friends look on with contempt.\nThat night, Doc visits Dalton and attempts to persuade him to leave. However, their conversation is interrupted by a powerful explosion at Emmett's house next door. Dalton rescues Emmett from the blaze before his house is destroyed. He then witnesses one of Wesley's henchmen, Jimmy (Marshall Teague), fleeing the scene, and manages to intercept him. After a vicious fight, Dalton kills Jimmy by ripping out his throat with his bare hand. The next morning, Dalton receives an ominous phone call from Wesley, who vows to have either Wade or Doc killed. At that moment, Wade staggers into the Double Deuce, badly beaten but alive. Believing Doc to be in danger, Dalton races to the hospital, but she refuses to leave with him, repulsed by his increasingly violent nature. Upon returning to the Double Deuce, Dalton finds Wade sprawled out on the bar with a knife lodged in his chest. Deeply in tears but also enraged, Dalton pulls the knife free and jumps into his car, determined to settle the score with Wesley.\nDriving his Mercedes, Dalton speeds recklessly toward Wesley's estate. The car draws gunfire from Wesley's henchmen but when it crashes they discover the car empty, and the knife that was used to kill Wade stuck in the accelerator. Using the distraction, Dalton sneaks onto the estate on foot and, one by one, dispatches each of Wesley's thugs, eventually coming face-to-face with Wesley. Dalton gains the upper hand in their fight and prepares to finish Wesley in the same brutal manner as Jimmy, but decides against it. As Dalton releases him and walks away, Wesley seizes the opportunity to reach for a gun, but is promptly shot to death by Red, Emmett, Stroudenmire, and Tilghman. They stash the weapons away prior to the arrival of law enforcement and proceed to corroborate each other's innocence, with the implication that what happened in Wesley's house will remain a secret.\nThe final scene finds Dalton and Doc enjoying each other's company in a swimming hole, suggesting that they do get together and Dalton remains in town for good."}