{"mid": "RobinAndMarian", "IMDB_id": "tt0075147", "title": "Robin and Marian", "plot": "An aging Robin Hood (Sean Connery) is a trusted captain fighting for King Richard the Lionheart (Harris) in France, the Crusades long over. Richard orders him to take a castle that is rumored to hold a gold statue. Discovering that it is defended by a solitary, one-eyed old man (Esmond Knight) who is sheltering harmless women and children, and convinced that there is no statue, Robin and his right-hand man, Little John (Nicol Williamson), refuse to attack. King Richard (Richard Harris), angry at their insubordination, orders the pair's execution, but before his orders can be carried out, he is mortally wounded by an arrow thrown by the old man. Richard has the helpless residents massacred, with the exception of the old man, because Richard likes his eye; it also turns out that there never was a gold statue. The King offers to let Robin beg for his life. When Robin refuses, Richard draws his sword, but lacks the strength to strike him and falls to the floor. Robin helps him, and moved by his loyalty, with his last words, Richard frees Robin and Little John.\nAfter Richard's death, Robin and Little John return to England and are reunited with old friends Will Scarlet (Denholm Elliott) and Friar Tuck (Ronnie Barker) in Sherwood Forest. When Robin casually inquires about Maid Marian (Audrey Hepburn), they tell him she has become an abbess. When he goes to see her, she finds him as impossible as ever. He learns that his old nemesis, the Sheriff of Nottingham (Robert Shaw), has ordered her arrest in response to the King's order to expel senior leaders of the Roman Catholic Church from England. Marian wants no trouble, but Robin rescues her against her will, injuring Sir Ranulf (Kenneth Haigh), the Sheriff's arrogant guest, in the process. Ignoring the Sheriff's warnings, Sir Ranulf pursues Robin into the forest. His men are ambushed and devastated by arrows; Sir Ranulf is left unharmed only because Robin orders him spared. When the news of Robin's return spreads, old comrades and new recruits rally once more to him. Sir Ranulf asks King John (Ian Holm) for 200 soldiers to deal with Robin.\nThe Sheriff waits in the open fields beyond the Forest, knowing Robin will attack. When Robin does, he proposes that he and the Sheriff duel to settle the issue, despite the protests of Sir Ranulf. Despite Robin appearing to have superior skills at the start of the fight, it soon becomes clear that the Sheriff is surprisingly in fact far superior to Robin, and more than a match for Robin. More agile and resistant, the Sheriff begins dominating Robin in the fight. Eventually the Sheriff has the wounded Robin at his mercy and demands his surrender. Refusing, Robin manages to kill the Sheriff with the last of his strength. Led by Sir Ranulf, the soldiers attack and scatter Robin's ragtag band, many of whom are captured or killed. Little John swiftly kills Sir Ranulf. Then he and Marian take Robin to her abbey, where she keeps her medicine.\nRobin believes he will recover to win future battles. Little John stands guard outside while Marian tends to Robin's wounds. Marian prepares a draft and takes a drink of it herself before giving it to Robin. He drinks the medicine and notes that the pain has gone away and his legs have gone numb. Then, realizing that she has poisoned them both, he cries out for Little John. However, he comes to understand that Marian has acted out of love because he would never be the same man again. She tells him:\nI love you. More than all you know. I love you more than children. More than fields I've planted with my hands. I love you more than morning prayers or peace or food to eat. I love you more than sunlight, more than flesh or joy, or one more day. I love you...more than God.\nRobin and Marian try to touch each other's hands as Little John crashes through the door and weeps at Robin's bedside. Robin asks Little John for his bow and shoots an arrow from his deathbed through the open window, and tells him to bury them both where it lands. The arrow soars out of the window into the distance, while decaying apples next to the same window are seen."}