{"mid": "RobinHoodDaffy", "IMDB_id": "tt0052139", "title": "Robin Hood Daffy", "plot": "The film features Daffy Duck in the role of legendary outlaw Robin Hood, and opens to the strains of his playing a song on an instrument similar to an archlute or bouzouki. As he prances along singing, he trips and tumbles down a hill (still singing), off a bank and into a river.\nWatching is Porky Pig, as a Friar Tuck figure, who laughs uproariously at Daffy's inglorious plunge. The annoyed Daffy tries to prove his skill with a quarterstaff (\"Actually, it's a buck-and-a-quarter quarterstaff, but I'm not telling him that!\") on a tree-trunk bridge, but manages to hit himself in the face with it, bending his bill in what becomes a recurring visual gag throughout the film. Undeterred, Daffy tries again, but while he is spinning his quarterstaff, Porky stops it with a wooden dowel, resulting in Daffy himself spinning around and falling back into the river. He gets out of the water and confronts Porky, who has once again been reduced to fits of laughter. Daffy is initially annoyed, but then starts to laugh along with him before becoming annoyed again.\nHaving given up showing off, Daffy attempts to leave, but Porky follows and asks the \"traveling clown\" if he knows the whereabouts of Robin Hood's hideout as he \"wouldst fain join up with his band of jolly outlaws\". Daffy proudly announces that he is Robin Hood, but Porky disbelieves him.\nIn order to prove that he is Robin Hood, Daffy informs Porky that he will attempt to rob a rich traveler on a bouncing mule and give his money \"to some poor unworthy slob\". Watched by Porky, Daffy pitifully fails in each and every attempt he makes to stop the traveler, usually injuring himself in the process, be it accidentally firing himself from his own bow, slamming into a succession of trees while trying to swing on a rope (repeatedly crying \"Yoinks! And awa-aaay!!!\" with each launch) and after chopping the trees down to clear a path (his final attempt results in him slamming face-first into a boulder) or trying again to swing down from a rope (this time attached to a huge iron ball) and slamming face-first into the side of a cliff (causing the iron ball to drop down on top of him).\nEventually the rich traveler, completely oblivious to Daffy's increasingly desperate attempts to rob him, reaches his castle unharmed, convincing Porky that he's \"just not Robin Hood\". The frustrated Daffy finally gives up, and in the final scene walks on with a tonsured head and wearing a habit, having decided to become a friar himself, he tells Porky; \"Never mind joining me, I'll join you. Shake hands with Friar Duck!\" As the film closes, Daffy's bill bends back up one more time."}