{"mid": "Robocop3", "IMDB_id": "tt0107978", "title": "RoboCop 3", "plot": "After the failure of the Robocop program, OCP is on the verge of bankruptcy after a series of failed business plans and drop of stocks, and are now struggling with their plans to create the new Delta City. To speed up the process, OCP creates an armed force called the Urban Rehabilitators, nicknamed \"Rehabs,\" under the command of Paul McDaggett (John Castle). Ostensibly its purpose is to combat rising crime in Old Detroit, augmenting the ranks of the Detroit Police Department in apprehending violent criminals. In reality, it has been set up to forcibly relocate the residents of Cadillac Heights. Nikko, a Japanese-American computer whiz kid, loses her parents in the process.\nThe police force is gradually superseded by the Rehabs, and violent crime begins to spiral out of control. The Delta City dream of the former OCP CEO, \"Old Man\", lives on with the help of the Japanese Kanemitsu Corporation, which has bought a controlling stake in OCP and is trying to finance the plan. Kanemitsu (Mako), CEO of the Kanemitsu Corporation, sees the potential in the citywide redevelopment, and moves forward with the plans to remove the current citizens in order to create Delta City. The company develops and uses its own ninja androids called \"Otomo\" to help McDaggett and the new OCP president (Rip Torn) overcome the resistance of anti-OCP militia forces.\nRoboCop (Burke) and partner Anne Lewis (Allen) try to defend civilians from the Rehabs one night, but Lewis is mortally wounded by McDaggett and eventually dies. Unable to fight back because of his \"Fourth Directive\" programming, RoboCop is saved by members of a resistance movement composed of Nikko and residents from Cadillac Heights and eventually joins them. Due to severe damage sustained in the shoot-out, RoboCop's systems efficiency plummets, and he asks the resistance to summon Dr. Lazarus, one of the scientists who created him. Upon arrival she begins to treat him, deleting the Fourth Directive in the process. During an earlier raid on an armory, the resistance picked up a jet-pack prototype, originally intended for RoboCop's use, which Lazarus modifies and upgrades to hold RoboCop.\nAfter recovering from his injuries, RoboCop conducts a one-man campaign against the Rehabs and OCP. He finds McDaggett and attempts to subdue him, but McDaggett is able to escape. McDaggett then obtains information from a disgruntled resistance member (Stephen Root) regarding the location of the resistance fighters' base. The Rehabs attack and most of the resistance members are either killed or taken prisoner. RoboCop returns to the rebel base to find it abandoned. One Otomo unit arrives and attacks him. RoboCop experiences another power drain and his left arm and auto gun is destroyed, but eventually he is able to overcome his opponent with his arm-mounted gun. Nikko infiltrates the OCP building and assists a captured Lazarus in broadcasting an improvised video, revealing OCP's responsibility for the criminality in the city and implicating them in the removal and killing of the Cadillac Heights residents. The broadcast causes OCP's stock to plunge, driving the company into financial ruin and bankruptcy.\nMeanwhile, McDaggett decides to execute an all-out strike against Cadillac Heights with the help of the Detroit police, but the police officers, enraged at the company's sadistic ways, refuse to comply and instead defect to the resistance in order to get revenge for Lewis and their salaries and pensions, escalating the rebellion against OCP into a full-scale city war. As a result, McDaggett turns to hiring street gangs and hooligans to assist with his plans.\nHaving heard Lazarus' broadcast, RoboCop provides aerial support for the entrenched resistance forces. He then proceeds to the OCP building and confronts the waiting McDaggett. RoboCop is then attacked, and nearly defeated, by two Otomo robots. Nikko and Lazarus succeed in reprogramming them using a wireless link from a laptop computer forcing them to attack each other. The Otomos' self-destruct system activates, forcing RoboCop to flee with Nikko and Lazarus. The flaming discharge from the jet-pack immobilizes McDaggett, leaving him to perish in the blast.\nAs Old Detroit is being cleaned up, Kanemitsu arrives and finally comes face to face with RoboCop and his group, while his translator (Doug Yasuda) tells the OCP president on Kanemitsu's behalf that he is fired, as the corporation shuts down OCP for good and plans to leave Detroit. Kanemitsu then bows to RoboCop and the group in respect."}