{"mid": "Robocop2", "IMDB_id": "tt0100502", "title": "RoboCop 2", "plot": "After the success of the RoboCop program, Omni Consumer Products (OCP) has a new scheme to have Detroit completely under their control. They plan to have the city default on its debt, then foreclose on the entire city, taking over its government. They will then replace the old neighborhoods with Delta City, a new planned city center independent of the United States government.\nTo rally public opinion behind urban redevelopment and Delta City construction, OCP sparks an increase in street crime. As Detroit Police Department is owned by OCP, they terminate police pension plans and cut salaries, triggering a police strike. RoboCop, due to his directives, is unable to strike and remains on duty with his partner, Anne Lewis. The two raid a manufacturing plant of Nuke, a new designer drug that has been plaguing the streets of Detroit. RoboCop kills all the criminals, except for a young criminal named Hob, who shoots him and escapes.\nMeanwhile, OCP struggles to develop \"RoboCop 2\", which is expected to be mass-produced and completely replace police officers. To their frustration, all the newly resurrected officers immediately commit suicide. Dr. Juliette Faxx, an unscrupulous psychologist, concludes that Alex Murphy's strong sense of duty and his moral objection to suicide due to his Roman Catholic religion were the reasons behind his ability to adapt to his resurrection as RoboCop. Faxx convinces the Old Man to let her control the project, this time using a criminal with a desire for power and immortality. Despite other executives' objection, Faxx is allowed to proceed.\nNuke's distributor, the power-hungry Cain, feels threatened by the Delta City plan. He fears that he will lose his market if the city is redeveloped into a capitalistic utopia. He is assisted by his girlfriend Angie, his apprentice Hob, and Duffy, a corrupt police officer and Nuke addict. RoboCop tracks down Duffy and beats Cain's location out of him. He confronts Cain's gang at an abandoned construction site, but is overwhelmed. The criminals cut apart his body and dump the pieces in front of his precinct. Cain has Duffy tortured to death for revealing their location, and forces Hob to watch.\nRoboCop is repaired, but Faxx reprograms him with over 300 new directives, severely impeding his ability to perform his duties. One of his original technicians suggests that a massive electrical charge might reboot his system. RoboCop shocks himself with a high voltage transformer. The charge erases all of his directives, including the original ones, allowing him to be in complete control. Murphy motivates the officers to aid him in raiding Cain's hideout. As Cain tries to escape, RoboCop intercepts and heavily wounds him. Hob escapes and takes control of Cain's drug empire. Believing she can control him with Nuke, Faxx selects Cain for the RoboCop 2 project, and puts his brain in a towering and heavily armed body.\nHob arranges a meeting with the Detroit mayor, saying that the mayor needs to institute a \"hands off\" policy towards Nuke. In exchange, Hob presents the mayor with a truckload of cash and gold in order to retire the city's debt to OCP, which would nullify the Delta City project. Threatened by this move, OCP sends RoboCop 2/Cain to the meeting to kill Hob. Cain slaughters everyone in sight, except for the mayor who manages to escape. He kills Angie by breaking her neck and fatally wounds Hob. As RoboCop arrives, Hob identifies the attacker and dies.\nDuring the unveiling ceremony for Delta City and RoboCop 2, the Old Man presents a canister of Nuke as a symbol of the current crime wave. Seeing Nuke, Cain goes berserk and attacks the crowd. RoboCop arrives and fights Cain. The two battle throughout the building, and the fight eventually extends to the street. The police force arrives and engages Cain, who opens fire at officers and civilians alike. RoboCop recovers the Nuke canister and has Lewis give it to Cain, who stops fighting to administer the drug to himself. As Cain feels the drug's effect, RoboCop leaps onto his back, shoots through his armor and rips out his brain. He crushes the brain, ending Cain's rampage.\nThe Old Man decides to scapegoat Faxx to escape blame, and leaves. As Lewis complains that OCP is escaping accountability again, RoboCop insists they must be patient because \"We're only human.\""}