{"mid": "RockADoodle", "IMDB_id": "tt0102802", "title": "Rock-A-Doodle", "plot": "Chanticleer is a rooster, whose job is to wake the sun up every morning, but the Grand Duke of Owls, who hates sunshine, sabotages him to make it look like the sun comes up on its own without Chanticleer's crow. Detested by the farm animals as a result, he leaves the farm to look for work in the city. Afterward, perpetual darkness and rainfall threaten the farm with flooding.\nTurning out to be a story read to Edmond, it seems that the flooding has found his family, and when his mother goes to help them stop it, he calls out to Chanticleer and is heard by the Grand Duke himself, who takes a dislike to Edmond's attempts to foil his plans. He turns him into a kitten to devour him, but he is saved at the last second by Patou, a bloodhound who struggles to learn on how to tie the knots on his shoes, from Chanticleer's farm. He is accompanied by Snipes, a claustrophobic magpie, and Peepers, an intellectual field mouse, as well as several animals from the farm, hoping to find Chanticleer and apologize to him for their behaviour. Edmond accompanies Patou, Snipes and Peepers to the city, while the rest of the animals remain at Edmond's house. En route, they are attacked by Hunch, the Duke's diminutive nephew, assigned by him to stop Edmond and the others from finding Chanticleer. They narrowly escape and enter the city.\nChanticleer has risen to fame in the city, thanks to his manager Pinkie Fox, employed by the Duke to keep the rooster in the city. At a show featuring an Elvis-type theme, he is introduced to Goldie Pheasant as a distraction in case Chanticleer's friends come to find him. Goldie soon grows genuinely attracted to Chanticleer, and realizes Pinkie's true intentions when he captures Edmond and the others trying to get a letter to Chanticleer.\nMeanwhile, the Duke and his party stalk the farm animals at Edmond's house, who continually use a flashlight to drive them off as long as the batteries hold out. Realizing that she is in love with him, Goldie confesses to Chanticleer that his friends had come to see him, and Pinkie blackmails Chanticleer to attend his show or never see his friends again. Chanticleer goes on with the show, Hunch inadvertently frees Edmond and the others, and they help Chanticleer and Goldie make a grand escape in a helicopter, foiling Pinkie's plans and destroying his Cadillac at the same time. They return to the farm.\nAfter their batteries run out, the denizens of the farm are nearly made a meal of by the Duke and his minions when they are driven off by the helicopter's spotlight. Chanticleer confronts the Duke, but realises he has forgotten how to crow. The Duke taunts him and tries to drown him, but Edmond refuses to lose hope and starts chanting Chanticleer's name in hopes to revive his spirit. The Duke grows tired of this and magically strangles Edmond to his assumed death. Patou starts to chant Chanticleer's name, followed by everyone else, and the Duke transforms himself into a massive, violent tornado to silence them. Chanticleer finally remembers how to crow, and begins to sing for the sun to emerge; his cries are heard and the sun rises, driving the Duke's minions away and shrinking him to a very minuscule size. Hunch barely recognizes his uncle, but uses this to exact revenge by chasing him with a fly swatter.\nEdmond transforms back into his human form in front of the others, who realize he was telling the truth about being a little boy. As Peepers tries to wake him, he does so in his own room, with his mother watching over him after an accident where a tree collapsed into his room. The sun is shining outside and the floods have ended, but his family does not believe him about his adventures and he is told to get his rest. He picks up Chanticleer's book and thanks him for coming back, before he is magically transported into Chanticleer's world, where he witnesses the rooster singing to make the sun shine."}