{"mid": "RockyV", "IMDB_id": "tt0100507", "title": "Rocky V", "plot": "Shortly after Rocky Balboa's victory over Ivan Drago in Moscow, he, his wife Adrian, his brother-in-law Paulie, and his trainer Tony \"Duke\" Evers return to the United States, where they are greeted by Rocky's son, Robert. At a press conference, boxing promoter George Washington Duke attempts to goad Rocky into fighting his boxer Union Cane, who is now the top rated American challenger. They want the bout for the World Heavyweight Championship in Tokyo, but Rocky declines the offer. Duke refuses to give up on the huge payday fight with Balboa and surmises he needs to come up with an angle to convince him to fight.\nShortly after returning home, it is discovered that Paulie unknowingly had Rocky sign a \"power of attorney\" over to Rocky's accountant, who had squandered all of his money on real estate deals gone sour; in addition, the accountant had failed to pay Rocky's taxes over the past six years, and the mansion is discovered to be unpaid by $400,000. His lawyer confirms this, but he tells Rocky the situation is easily fixable with a few more fights. Rocky, not wanting to go bankrupt, decides to accept the mega fight with Cane for the money. However, after seeing a doctor, an examination reveals permanent and irreversible brain damage from the fight with Drago and at Adrian's insistence, Rocky opts to retire from boxing. He files for bankruptcy, has his mansion and belongings auctioned off, and moves his family back into Paulie's old house in South Philadelphia. Adrian returns to working part-time at the J&M Tropical Fish pet shop while Paulie goes back to the Shamrock Meat Packing facility. Rocky arranges plans to refurbish and reopen Mighty Mick's Boxing Gym, willed to his son Robert by his late trainer Mickey Goldmill. He walks through the abandoned gym and reminisces about a training session between the two just before Rocky fought with Apollo Creed years before.\nOne day, Rocky and Paulie meet a hungry young fighter from Oklahoma named Tommy Gunn, and Rocky takes him under his wing. Training the young fighter gives Rocky a sense of purpose, and Gunn fights his way up the ladder to become a top contender. Rocky eventually becomes so distracted with Gunn's training that he winds up neglecting Robert. He falls in with the wrong crowd at school and as a result, he begins acting out at home.\nUnion Cane wins the vacant world heavyweight title while Gunn continues his rapid and impressive rise through the ranks. Still wanting to do business with Rocky, Duke sees Gunn's knockout streak and relationship with Rocky as a way of getting control of him. Duke showers Gunn with luxuries and promises him that he is the only path to a shot against Union Cane for the title. Duke hopes to take control of Gunn as his manager and keep Rocky on as head trainer.\nOn Christmas Eve, Duke visits the Balboa house with Gunn to explain the new scenario which would financially benefit all of them However, Rocky insists dealing with Duke will end badly and is dirty business. Gunn drives off in a huff, leaving Rocky for good. Adrian attempts to comfort Rocky, but his frustrations finally boil over. He confesses his life had meaning again when he was able to live vicariously through Gunn's success. She reasons with him, telling him Tommy never had his heart and spirit—something he could never learn. When this realization hits him, Rocky embraces his wife and they begin to pick up the pieces. After finding Robert hanging out on a street corner, Rocky apologizes to his son and they mend their broken relationship.\nGunn fights Cane for the heavyweight title as Rocky watches from his basement, still rooting for his protégé. After taking a good punch, Gunn goes on to completely dominate and dismantle a passive Cane scoring a first-round knockout. Gunn is booed by spectators for leaving Rocky and hounded by reporters after the fight. They insist Cane was nothing but a \"paper champion\", because Cane did not win the title from Balboa, and also suggest he wasn't necessarily trying his best to win and accuses Duke of rigging the ratings. Gunn is enraged when they say he will never be the real champion unless he fights a worthy opponent, like Rocky; they drive the point home when one reporter announces, \"...he's no Rocky Balboa!\" With Gunn incensed by the press's reaction, Duke convinces him that he needs to secure a title fight with Rocky to put to bed the notion that he's not the real champion. Duke and Gunn show up at the local bar to goad Rocky into accepting a title challenge. Rocky declines the prospect of a title fight and tries to reason with him, but Gunn rebukes it and calls him weak, prompting Paulie to stand up for Rocky. However, Gunn punches Paulie and he falls to the ground. Enraged, Rocky accepts the challenge, but tells Gunn \"my ring is outside.\"\nDespite Duke's warnings to keep the fight in the ring, Gunn accepts. During the fight, Rocky is eventually beaten down and is seemingly out for the count. He then hears the voice of Mickey urging him to get up and continue the fight, to go just \"one more round\". Rocky gets up and, with Robert, Paulie, and the entire neighborhood cheering him on, utilities his vast street fighting knowledge to knock out his former protégé. While Gunn is escorted away by the police, Duke threatens to sue Rocky if he touches him, but after a brief hesitation and with nothing else to lose anyway, Rocky knocks him onto the hood of a car and quips, \"Sue me for what?\"\nThe next morning, Rocky and Robert take a jog to the Philadelphia Museum of Art, and Rocky gives his son Rocky Marciano's cufflink, given to him years ago as a gift from Mickey. The film ends with a shot of Rocky's statue looking out over the Philadelphia skyline."}