{"mid": "RocketshipXM", "IMDB_id": "tt0042897", "title": "Rocketship X-M", "plot": "Four men and a woman blast into outer space from the White Sands Proving Ground aboard the RX-M (Rocketship Expedition-Moon) on humanity's first expedition to Luna. Halfway there, after surviving their jettisoned and runaway first stage and a meteoroid storm, their engines suddenly quit. Recalculating fuel ratios and swapping fuel tank positions fixes the problem. After the engines fire, RX-M rapidly careers out of control on a rapid heading beyond the Moon; lowered oxygen pressure also causes the crew to slowly pass out. They gradually revive much later and discover that they have traveled some 50,000,000 miles and are now on a direct heading toward Mars. Quick calculations reveal that RX-M is only 50,000 miles away. Dr Karl Eckstrom (John Emery) is forced to \"pause and observe respectfully while something infinitely greater assumes control\".\nRX-M passes through the Martian atmosphere and lands safely. The next morning the scientists, clad in aviation oxygen masks due to the low pressure, begin exploring the desolate surface. They come across physical evidence of a now dead advanced Martian civilization: a partially buried-in-the-sand, stylized, Art Deco- or Tiki culture-like metal face sculpture and, in the distance Moderne architecture-like ruins. Their Geiger counter registers dangerous radiation levels, keeping them well away; from the levels detected, there has been an atomic war on Mars in the distant past.\nFinding cave refuge, the scientists notice in the distance the primitive descendants of that civilization emerging from behind boulders and creeping toward them. Amazed, Dr Eckstrom comments \"From Atomic Age to Stone Age.\" Soon after leaving, two of the explorers encounter a dark-haired woman who has lost her footing and rolled down a hill toward them; she is blind, with thick, milky cataracts on both eyes. She screams upon hearing their oxygen mask-distorted voices. The radiation burned tribesmen attack, throwing large rocks and stone axes. Armed with only a revolver and a bolt-action rifle, the explorers defend themselves, purposely missing the primitives. Dr Eckstrom is killed by a stone axe; another astronaut is badly injured by a large thrown rock. The survivors finally make their way back to the RX-M.\nAs the RX-M nears Earth, the survivors calculate that they have no fuel for a landing. Col. Graham contacts their base and reports their dire status to Dr Fleming (Morris Ankrum), who listens intently and wordlessly over headphones. Col. Graham's report is not heard, but Fleming's subtle reactions tells of the crew's odyssey, their discovery of a once advanced civilization destroyed long ago by atomic war, and of the crew fatalities at the hands of Martian descendants reverted to barbarism.\nCol. Graham and Dr Van Horn embrace as the RX-M begins its uncontrolled descent, consoling one another in the moments left to them. Through a porthole, they bravely watch their rapid descent into the wilds of Nova Scotia. The press is later informed by a shaken Dr Fleming that the entire crew has perished. When they ask if the mission was a failure, he confidently responds with conviction, stating that all theories about manned spaceflight and exploration have now been proven. He continues, underscoring the point that a dire warning has been received that could very well mean the salvation of humanity, \"A new spaceship, the RX-M-2, begins construction tomorrow\". The pioneering exploration continues."}