{"mid": "RockyIv", "IMDB_id": "tt0089927", "title": "Rocky IV", "plot": "Ivan Drago, a Russian Soviet boxer, arrives in the United States with his wife, Ludmilla, and a team of trainers from the USSR and Cuba. His manager, Nicolai Koloff, takes every opportunity to promote Drago's athleticism as a hallmark of Soviet superiority. Motivated by patriotism and an innate desire to prove himself, Apollo Creed challenges Drago to an exhibition bout. Rocky has reservations, but agrees to train Apollo despite his misgivings about the match. He asks Apollo whether the fight is against the Soviet, or \"you against you?\"\nDuring a press conference regarding the match, hostility sparks between Apollo and Drago's respective camps. The boxing exhibition takes place at the MGM Grand Hotel in Las Vegas. Apollo enters the ring in an over-the-top patriotic entrance with James Brown performing \"Living in America\" complete with showgirls. The bout starts tamely with Apollo landing several punches that have no effect on Drago. It soon turns serious though, as Drago starts to retaliate with devastating effect. By the end of the first round, Rocky and Apollo's trainer, Duke, plead with him to give up, but Apollo refuses to do so, and tells Rocky not to stop the match no matter what. Drago continues to pummel him in the second round, Duke begs Rocky to throw in the towel. Eventually, Drago lands one final punch that knocks Apollo out and kills him. In the immediate aftermath, Drago displays no sense of remorse commenting to the assembled media: \"If he dies, he dies.\"\nEnraged by guilt and the Russians' cold indifference, Rocky challenges Drago himself. Drago's camp agrees to an unsanctioned 15-round fight in the Soviet Union on Christmas Day, an arrangement meant to protect Drago from the threats of violence he has been receiving in America. Rocky travels to the USSR without Adrian, setting up his training base in Krasnogourbinsk with only Duke and brother-in-law Paulie to accompany him. Duke opens up to Rocky, stating that he raised Apollo and that his death felt like a father losing his son. He expresses his love and faith in Balboa to prevail. To prepare for the match, Drago uses high-tech equipment, steroid enhancement, and a team of trainers and doctors monitoring his every movement. Rocky, on the other hand, lifts and throws heavy logs, chops down trees, pulls an overloaded snow sleigh with Paulie atop, jogs through heavy snow under treacherous icy conditions, and climbs the largest icy mountain. Adrian arrives unexpectedly to give Rocky her support after initially refusing to travel to the Soviet Union because of her worry that Rocky would be killed like Apollo.\nDrago is introduced with an elaborate, patriotic ceremony and the home crowd is squarely on Drago's side and being hostile to Rocky the American as he approaches the ring. In contrast to his match with Apollo, Drago immediately goes on the offensive. Rocky takes a fierce pounding and is thrown and shoved across the ring but comes back toward the end of the second round and cuts Drago's left eye, stunning both the Russian and the crowd and prompting Rocky to continue punching even after the bell rings. While Duke and Paulie encourage Rocky, they remind him that Drago is not a machine, but a man. Drago ironically comments to his trainers that Rocky \"is not human, he is like a piece of iron\" after his trainers reprimand him for his performance against the \"weak\" American.\nThe two boxers continue their battle over the next dozen rounds, with Rocky managing to continually hold his ground despite Drago's powerful punches. His resilience rallies the previously hostile Soviet crowd to his side, which unsettles Drago to the point that he shoves Koloff off the ring for berating his performance. In the last round, Rocky attempts the Rope-a-dope tactic against Drago, a tactic that successfully worked against Clubber Lang. However, this tactic does not work with Drago. Rocky then goes toe to toe and lands rapid punches to the body of the Russian following shouted orders from Duke. Rocky follows up with punches to the face that daze Drago and finally cause him to fall to the canvas, winning by knockout to the shock of the Soviet politburo members watching the match. A bloody and battered Rocky gives a victory speech, acknowledging how the local crowd's disdain of him had turned to respect during the fight. He compares it to the animosity between Soviets and Americans, and says that seeing him and Drago fight was \"better than 20 million,\" implying war between their two countries. Rocky finally declares, \"If I can change, and you can change, then everybody can change!\" The Soviet General Secretary stands and reluctantly applauds Rocky, and his aides follow suit. Rocky ends his speech by wishing his son watching the match on TV a Merry Christmas, and raises his arms into the air in victory as the crowd applauds."}