{"mid": "RockAndRule", "IMDB_id": "tt0086203", "title": "Rock & Rule", "plot": "The intro of the film states, \"The War was over, the only survivors were street animals, dogs, cats, and rats. From them a new race of mutants evolved, that was a long time ago.\" The intro states that in 1983 a nuclear World War 3 had erupted between the Soviet Union and the United States of America which destroyed each other and the human race.\nMok, an aging yet legendary rock musician, is on the search for a very special voice that can unleash a powerful demon from another dimension to fulfill his wish of being immortalized as a musician/Magic Man. After traveling around the world looking for the right voice, he returns to his hometown of Ohmtown, a remote, storm-ravaged village famous for its unique power plant.\nMeanwhile, at a nightclub, Omar, Angel, Dizzy and Stretch perform in a small rock band. As Angel performs a gentle love ballad to a mostly empty audience, Mok hears her sing and his special ring goes off, and he realizes that Angel has the voice he needs. He invites Angel and the band to his mansion outside of town. Omar goads Mok upon meeting him, annoying Mok enough to suggest the band tries \"Edison Balls\"- a modern drug, which Omar and Stretch take, incapacitating them. Dizzy sneaks away. Meanwhile, Mok takes Angel on a stroll through his garden and tries to convince her to join him. Initially unaware of Mok's true intentions, she refuses to abandon her band. Unwilling to admit defeat, Mok kidnaps her and takes his blimp to Nuke York, where his summoning, disguised as a concert, will be performed.\nAfter Dizzy snaps his band-mates out of their stupor, the trio find out what happened to Angel and they follow the blimp in a stolen police car. Before they reach Nuke York, they are arrested by a border guard. Meanwhile, Angel attempts to escape with the unwitting help of Cinderella, a sister of Mok's goons. While sneaking through the ventilation system, Angel overhears Mok confirming his plans with his computer. At this time, the computer informs Mok that the only way to stop the demon is with \"One voice, One heart, One song\", but when Mok asks who can do this, the computer replies that there is \"no one\". Angel and Cindy escape the building and head to the dance club \"Club 666\", unaware that Mok's henchmen are following them.\nDizzy's aunt bails out Omar and his friends, and tells them the whereabouts of Angel and Cindy. They follow, but Omar eventually bumps into Mok, who has already recaptured Angel and uses an impersonator to fool Omar into thinking that she is with Mok. To manipulate Angel, Mok captures the band and tortures them with a giant \"Edison Ball\" to force her to agree with his demands. He also brainwashes them to ensure that they stay out of the way. The Nuke York concert turns out to be a disaster because of an electrical failure. Mok relocates the summoning to Ohmtown, where the power plant has enough energy. During the second concert, a power surge causes overloads all over the city. The shock also brings Omar and his friends out of their stupor.\nOmar, still believing Mok's earlier deception, refuses to help Dizzy and Stretch stop the concert. They go without him in a stolen police car but crash at the concert too late. Mok forces Angel to summon the demon with her song. Zip, one of Mok's simple-minded minions, realizes that there is still evil in the world based on the summoning the demon. The demon attempts to kill a subdued Angel but suddenly Omar appears after giving a rebel yell and frees Angel from her electronic braces. The demon then attacks Omar. Just then, Zip saves Omar seemingly at the cost of his own life. Toad, Mok's tough minded minion,is completely enraged by his little brother's sudden death at the hands of Mok's demon and by his boss' psychotic laughter afterwards. Angel tries singing to force the demon back, but her voice has no effect as Mok triumphantly looks on. Omar joins in harmony with Angel, driving the demon back through the portal. After being thrown by Zip's brother, Toad, into the portal, hanging for his life, Mok realizes that \"no one\" did not mean that a person who could stop him did not exist, but that more than one person was needed for the counter-spell; he is then sealed with the demon. As Omar and Angel continue on with the show as Zip is revealed to be alive and Mylar, the show's MC, proclaims this as the greatest show ever."}