{"mid": "Rogue", "IMDB_id": "tt0479528", "title": "Rogue", "plot": "While carrying out his research as a travel journalist, cynical American Pete McKell joins a group of tourists on a crocodile watching river cruise in Kakadu National Park of Australia's Northern Territory. Among the other passengers are a photographer named Simon, a local Australian family of Elizabeth, Sherry, and Allen, a local couple named Gwen and Russell, an American couple named Mary Ellen and Everett, local tour guide Kate Ryan, and Kevin, her dog. After a run-in with two locals, Neil and Collin, the cruise winds to a close and Kate prepares to return the group to base.Everett spots a flare in the distance, and Kate tells the group that they must investigate to determine whether someone is in distress. A few miles up river, they come across a half-sunken boat when suddenly something crashes into the tourists' boat, creating a crack in the side. Kate's only choice is to run it ashore on a small island in the middle of the river. The group disembarks and begins discussion of what to do. Everett suddenly disappears, pulled into the water by an unseen predator. Kate comes to the conclusion that they are in the heart of a large crocodile's territory and that it will be more aggressive than usual. As the afternoon wears on, the tourists realize that the tide is rising: in a matter of hours their small island will be submerged.Neil and Collin arrive soon after and as they near the island, the 25-foot long crocodile smashes Neil and Collin's boat and sinks it. Neil manages to swim to the island safely, but Collin has disappeared.As night falls, Neil proposes that he swim to the mainland and string a rope between two trees, creating a zip-line to allow the group to cross above the river. Neil succeeds in setting up the rope and Mary Ellen crosses first only to freeze in fear halfway across. Allen becomes impatient and aggressive and attempts to get himself and Sherry across with Mary Ellen still on the line. While trying to secure the rope, Neil is attacked by the crocodile and gets eaten alive. The tree holding the rope snaps and the three on the line fall into the water. They scurry back to the island, but as Allen crawls up the beach, the gigantic crocodile suddenly lunges out of the water and throws him further into the river where he is also eaten alive.Later that night, Pete suggests they can delay the croc with a hook and bait on one side of the island while everyone escapes off the other side. Kate hooks two dead birds onto the boat's anchor while Pete secures the anchor rope to a boulder and throws the bait out into the river. After a long wait, the anchor is suddenly grabbed and pulled and the entire group jumps into the water and makes a break for the far shore. Pete tries to stop the boulder from being pulled over as Kate swims across behind the group. The croc suddenly lets go of the hook and bait, seizes Kate, and drags her underwater. Pete hurriedly makes the swim across the river with the dog Kevin in tow, and heads off into the bush to meet up with the others.As day breaks, Pete is crossing a stream when Kevin runs away. Pete chases the dog into a cave and falls down a narrow chute into a larger cave, where he sees Neil's partly eaten corpse. He quickly realizes that the cave is the crocodile's lair, and to his surprise, he finds Kate who is still alive but badly injured and unconscious with her part of her left leg and right arm missing having been eaten. He attempts to carry her out but has to hide when he hears the crocodile eating Kevin outside the cave. The huge crocodile then slowly enters the cave, laying down, and going to sleep. Trying to reach the entrance carrying Kate, Pete accidentally wakes the crocodile and it makes several attempts to devour both him and Kate as he retreats into the narrow confines of the cave. Finally, after a long fight in which he gets tossed around and is bitten in the hand, Pete makes one last stand. He braces a broken log against a large boulder with the sharp end pointing out towards the croc. The croc lunges at him, and Pete successfully impales it through the head killing it. He escapes from the cave with Kate to join the other tourists and waiting paramedics.As the credits roll, the camera zooms in on a newspaper article detailing Pete's heroic battle with the croc and rescue of Kate."}