{"mid": "Rollercoaster", "IMDB_id": "tt0076636", "title": "Rollercoaster", "plot": "An unnamed man (Timothy Bottoms) sneaks into Ocean View Amusement Park and places a small radio-controlled bomb on the tracks of the park's wooden roller coaster, The Rocket. The bomb detonates, and The Rocket derails, killing several riders. Safety inspector Harry Calder (George Segal), who initially cleared the ride, is called to the park to investigate. A park worker tells Calder that there was an unauthorized man on the track.\nIn Pittsburgh the bomber causes a fire at a dark ride at another park. Calder suspects the incidents are linked, and learns that the executives of companies running the largest amusement parks in America are holding a meeting in Chicago. Calder flies to Chicago and intrudes on the meeting. One of the executives plays a tape sent by the bomber, wherein he demands $1 million to stop his bombing campaign.\nBack home, Calder is visited by FBI Agent Hoyt (Richard Widmark), who says the extortion money is to be delivered by Calder at Kings Dominion. There, Calder is ordered to wait at a telephone. The bomber calls, warning him there is a bomb in the park. He sends Calder a two-way radio so that he can keep contact, then orders Calder to go on various rides in the park. While Calder is on the Skyway, the bomber tells Calder that the bomb is in the radio. He warns Calder not to throw it away, because it will explode on impact on the crowded paths below. He orders Calder to falsely signal that he has made the delivery, in order to distract the FBI, then leave the money on a bench. Calder complies and walks away. Later, Hoyt admits that he marked the money (violating the bomber's instructions). Calder demands to be sent home and leaves the bomb radio with the bomb squad.\nBack home, Calder gets another call from the bomber. He blames Calder for the marked money, and threatens another attack. Assuming it will be directed at Calder personally, he deduces that the next target will be The Great American Revolution at Magic Mountain, a coaster that Calder inspected and cleared. The FBI rejects Calder's hypothesis, but decide to investigate anyway because the ride is scheduled to debut on July 4, when park attendance will be at its highest for the season. Agents disguised as park maintenance men find a bomb attached to the tracks. They safely disconnect the radio antenna.\nThe bomber returns to his car and gets a new bomb just as the Revolution is about to open. In order to get on board, he pays a park guest $100 for his \"Gold Ticket\", which entitles the holder to be one of the first passengers. He places the bomb under his seat in the rear of the train. Following the inaugural ride, Calder recognizes the bomber's voice during his ride exit interview with a reporter. He chases the bomber, and alerts the agents that he might have placed something in the train. The train leaves the chain lift on its second ride through.\nThe cornered bomber threatens to blow up the ride, holding the detonator in his hand while the agents try to jam the signal. He demands a firearm. Calder takes one from an agent and begins to hand it to him. Agents succeed in jamming the detonator's signal, and alert Calder. Calder retains the gun and shoots the bomber, who then runs away. He hops a fence into the field below the Revolution and runs blindly, not realizing he is circling back toward Calder. The bomber climbs onto the track, but sees Calder and freezes. He is hit and killed by the coaster. The ride re-opens following the accident."}