{"mid": "RollingThunder", "IMDB_id": "tt0076637", "title": "Rolling Thunder", "plot": "In 1973, Major Charles Rane (William Devane) returns home to San Antonio with Sergeant Johnny Vohden (Tommy Lee Jones), and two other soldiers, after spending seven years as a POW in Hanoi. He finds a home very different from the one he left when he meets his wife Janet (Lisa Richards), his son Mark (Jordan Gerler), and local policeman Cliff (Lawrason Driscoll), waiting to drive him home. Rane soon realizes that his son doesn't remember him, and that Cliff seems overly familiar with Janet and Mark. Janet admits that she has become engaged to Cliff and has no plans to break it off, despite still having feelings for Rane. Rane stoically accepts this, but privately reacts by self-imposing the same institutionalized daily regime he had in captivity.\nThe town is intent on giving Rane a hero's homecoming, and at a grand celebration, he is presented with a red Cadillac and 2,555 silver dollars – one for every day he was a captive plus one for luck – by the 'Texas belle' Linda Forchet (Linda Haynes), who has worn his ID bracelet since he left. Shortly after, Cliff attempts to make peace with Rane; the latter, however, seems resigned to losing his wife, but he is determined not to lose his son and makes efforts to build a relationship.\nLinda Forchet spots Rane in his new Cadillac at a gas station and invites him to have a drink at the bar where she works. She makes advances toward him, but Rane is emotionally distant and perhaps even unable to connect with anyone.\nWhen Rane next returns home, four border outlaws are waiting for him: \"The Texan\" (James Best), \"Automatic Slim\" (Luke Askew) and a couple of Mexican thugs, \"T Bird\" (Charles Escamilla) and \"Melio\" (Pete Ortega). They demand the silver dollars and torture Rane to get them. Rane is totally unresponsive, having flashbacks to his torture in Hanoi as they beat him. The gang resorts to drastic measures and shoves Rane’s hand down a garbage disposal, mangling it. At this point Janet and Mark return, and are immediately taken hostage. Rane lies with a mangled arm on the kitchen floor while his son finds and hands over the silver dollars. The gang shoots all three of them, leaving them for dead. Rane survives but his wife and son do not.\nSeveral weeks later, Rane is convalescing in a hospital where Linda and Vohden visit him separately. Vohden has signed on for another ten years in the Airborne Division, due to his uncertainty as to what else to do with his life. Although he gives no details to the police, Rane has ideas regarding the identities of his attackers and prepares to take vengeance. His first move upon discharge is to saw down a double-barreled shotgun and sharpen the prosthetic hook which has replaced his right hand.\nBefore leaving for Mexico, Rane visits the bar where Linda works and invites her to go with him. She leaves with him, having no idea she is accompanying him on a vendetta. He sends her into a seedy Mexican bar to look for \"Fat Ed.\" She is taken into a backroom where a sleazy lowlife named Lopez (James Victor) immediately begins to harass her. Rane comes to her rescue while also extracting some information. Linda now realizes Rane’s intention and though she is alarmed, continues to help. Linda is sent into another seedy bar in a nearby town, as before. Rane locates Automatic Slim and a vicious bar fight ensues; Rane only escapes by wounding Automatic Slim in the crotch with his hook hand.\nConducting his own investigation back in Texas, Cliff finds the sawn-off barrel of Rane's shotgun and realizes Rane's plan. Using his police contacts to trace Rane's car, Cliff finds his way to the Mexican border town in which Rane encountered Lopez. Cliff is led to Lopez, and they scuffle. After Lopez leads Cliff on a foot-chase through a stockyard into an abandoned house, a gunfight ensues. Cliff shoots and kills Lopez and two other attackers before Automatic Slim sneaks in behind him, calls to him and shoots him as he turns to respond. As a wounded Cliff crawls toward his dropped weapon, Automatic Slim mercilessly shoots him again, killing him.\nLinda and Rane begin to connect further while on the road, with Linda talking about her tomboy past, and Rane talking about things he liked before the war. In a motel room in El Paso, she tries to talk Rane out of revenge one last time. Despite his experiences in Hanoi and of losing his son and wife, Rane may not be as emotionally dead as he seems. Rane leaves a sleeping Linda behind in the motel (with a sizable sum of money), and despite her earlier insistence that she would call the police, she cannot bring herself to follow through, as she hangs up the phone when the police answer her call.\nRane, dressed in full uniform, goes to Vohden’s house. Vohden, emotionally distanced from his family, asks no questions and is dressed in his Army uniform and ready to go in an instant. Rane plans to attack the remaining members of the gang in a whorehouse. Vohden goes in first and picks up a prostitute named Candy (Cassie Yates). Once they are upstairs, Rane takes out a guard in the rear yard and goes in the back entrance. Rane signals to Vohden and kicks off a bloody, violent shootout. After surprising The Texan with a hooker, Rane declares \"It’s your time, boy\" before shooting him. T-Bird, Melio and several other men are dealt with likewise before the final standoff between Rane and Automatic Slim. Rane kills him, emotionlessly shooting him several times. Bloodied and wounded, Rane and Vohden, supporting each other, walk out of the brothel."}