{"mid": "RomanHoliday", "IMDB_id": "tt0046250", "title": "Roman Holiday", "plot": "Ann (Audrey Hepburn), the crown princess of an unspecified country becomes frustrated with her tightly scheduled life, and breaks down at having to repeatedly answer \"yes, thank you\" and \"no, thank you\" to demands of her time. Her doctor gives her a sedative to calm her and help her sleep, but she secretly leaves her country's embassy.\nThe sedative eventually makes her fall asleep on a bench, where Joe Bradley (Gregory Peck), an expatriate American reporter for the \"American News Service\" based in Rome, finds her. Not recognizing her, he offers her money so she can take a taxi home, but a woozy \"Anya Smith\" (as she later calls herself) refuses to cooperate. Joe finally decides, for safety's sake, to let her spend the night in his apartment. He is amused by her regal manner, but less so when she appropriates his bed. He transfers her to a couch. The next morning, Joe, having already slept through the interview Princess Ann was scheduled to give, hurries off to work, leaving her still asleep.\nWhen his editor, Mr. Hennessy (Hartley Power), asks why Joe is late, Joe lies, claiming to have attended the princess' press conference. Joe makes up details of the alleged interview until Hennessy informs him that the event had been canceled because the princess had suddenly \"fallen ill\". Joe sees a newspaper picture of her and realizes who is in his apartment. Immediately seeing an opportunity, Joe proposes getting an exclusive interview. Hennessy, not knowing the circumstances, agrees to the deal and offers $5,000 if the interview is all Joe claims it will be, but bets Joe $500 that he will not succeed.\nJoe hurries home and, hiding the fact that he is a reporter, offers to show \"Anya\" around Rome. He also surreptitiously calls his photographer friend, Irving Radovich (Eddie Albert), to tag along to secretly take pictures. However, Ann declines Joe's offer and leaves.\nAnn, enjoying her freedom, explores an outdoor market, buys a pair of shoes, and, on a whim, gets her long hair cut short. Joe follows and \"accidentally\" meets her on the Spanish Steps. This time he convinces her to spend the day with him. They see the sights, including the \"Mouth of Truth\", a face carved in marble which is said to bite off the hands of liars. When Joe shouts in mock pain and pulls his hand out of the mouth, it appears to be missing, causing Ann to scream. He then pops his hand out of his sleeve and laughs. (Allegedly, Hepburn's shriek was not acting—Peck decided to pull a gag he had once seen Red Skelton do, and did not tell his co-star beforehand.)\nLater, Ann shares with Joe her dream of living a normal life without her crushing responsibilities. That night, at a dance on a boat, government agents finally track her down and try to escort her away, but a wild melee breaks out and Joe and Ann escape. While trying to rescue her from plainclothes government agents, Joe is ambushed and falls into a river after being struck. Ann dives in to save him, and they swim away together away from the agents, finally sharing a kiss as they sit shivering on the riverbank. Later, knowing her royal responsibilities must resume, the princess bids a tearful farewell to Joe and returns to the embassy. When she arrives at the embassy she is lectured upon the sense of duty she must display, but (visibly pained) retorts that without such a sense, she would never have returned.\nDuring the course of the day, Hennessy learns that the princess is missing, not ill as claimed. He suspects that Joe knows where she is and tries to get him to admit it, but Joe claims to know nothing about it. Joe decides not to write the story, despite the considerable amount of money riding on it. Irving first plans to sell his photographs independent of the story, but eventually decides against it.\nThe next day, Princess Ann appears to answer questions from the press, and is surprised to see Joe and Irving there. Irving takes her picture with the same miniature cigarette-lighter/camera he had used the previous day. When asked by a reporter which city of her European tour was her favorite, Ann first makes a diplomatic \"all were equally good\" answer, but interrupts it with an impulsive \"Rome! By all means, Rome.\" At the end of the interview, the Princess requests to \"meet\" the journalists, shaking hands and making brief formal conversation. As she reaches Joe and Irving, the latter presents her with an envelope with the photographs he had taken, under the pretext of a generic memento of Rome. The three make several statements that hint at the truth and their dispositions, while feigning formality and the distance expected between the princess and two strange journalists. As the interview with the princess comes to an end and she reluctantly leaves, the crowd of journalists and reporters eventually disperses, and Joe walks away alone."}