{"mid": "RomeoAndJuliet", "IMDB_id": "tt0117509", "title": "Romeo + Juliet", "plot": "In Verona Beach, the Capulets and the Montagues are arch-rivals. The animosity of the older generation—Fulgencio and Gloria Capulet and Ted and Caroline Montague—is felt by their younger relatives. A gunfight between the Montague boys led by Benvolio, Romeo's cousin, and the Capulet boys led by Tybalt, Juliet's cousin, creates chaos in the city. The Chief of Police, Captain Prince, reprimands the families, warning them that if such behavior continues, their lives \"shall pay the forfeit of the peace\".\nBenvolio meets Romeo on a beach. While playing a game of pool they learn of a party being held by the Capulets that evening which they decide to gate-crash. Romeo agrees to come after discovering that Rosaline, with whom he is in love, is attending.\nThe Montague boys meet their friend, Mercutio, who has tickets to the Capulet party. Romeo takes the ecstasy Mercutio gave him and they proceed to the Capulet mansion. The effects of the drug and the party overwhelm Romeo, who goes to the restroom. While admiring an aquarium, he and Juliet see each other and fall instantly in love. Tybalt spots Romeo and vows to kill him for invading his family's home, but Fulgencio stops him.\nRomeo and Juliet sneak into an elevator and kiss. The nurse spots them when the doors open and drags Juliet away, while revealing to her that Romeo is a Montague. At the same time, Romeo realizes that Juliet is a Capulet. Mercutio takes Romeo from the party, but he sneaks back to the mansion, hiding under Juliet’s balcony. Juliet emerges into the yard and proclaims her love for him before Romeo sneaks up behind her. Juliet warns him that he is risking his life, but Romeo tells her he does not care whether he is caught. Knowing her nurse is looking for her, Juliet tells him that, if he sends word by the following day, they will be betrothed. Romeo visits Father Lawrence, telling him he wants to marry Juliet. He agrees to marry the pair in hopes that their marriage will help ease the tensions between the families. Romeo passes the word on to Juliet’s nurse and the lovers are married.\nTybalt encounters Mercutio just as Romeo arrives. Romeo attempts to make peace, but Tybalt assaults him. Mercutio intervenes and batters Tybalt, and is about to finish him off by hitting him with a log when Romeo stops him. Tybalt then wounds Mercutio with a shard of glass, which Mercutio claims is merely \"a scratch\". But as he realizes the cut is much worse than he thought, Mercutio curses both the Montagues and the Capulets before dying in Romeo's arms. Enraged, Romeo chases after a fleeing Tybalt and guns him down.\nCaptain Prince banishes Romeo from the city. Romeo goes into hiding with Father Lawrence, who treats Romeo's injuries and says that, after some time passes, he will help Romeo and Juliet return to the city and reconcile with their family and friends. The nurse tells Romeo that Juliet is waiting for him. When Romeo climbs over Juliet's balcony, she kisses him and they consummate their marriage. Fulgencio decides Juliet will marry Dave Paris, the governor's son.\nThe next morning, Romeo narrowly escapes as Juliet's mother tells her that the family has promised she will marry Paris. She refuses to marry, so her father threatens to disown her. Her mother and nurse insist it would be in her best interest to marry Paris. To get out of this, Juliet runs away from home and sees Father Lawrence, very angrily imploring him to help her and threatening to commit suicide. Father Lawrence proposes she fake her own death and be put in the Capulet vault to awaken 24 hours later. Romeo will be told of the plot, sneak into the vault, and once reunited the two can travel to Mantua. He gives her the potion which mimics death. After saying goodnight to her mother, Juliet drinks the potion and falls into a coma. She is found in the morning, declared dead, and placed in the vault. Balthasar, one of Romeo's cousins, learns that Juliet is dead and tells Romeo, who is not home when the messenger arrives to tell him of the plan.\nRomeo returns to Verona, where he buys poison. As he goes to the church, Captain Prince finds out he is back, and tries to capture him, without success. Father Lawrence learns that Romeo has no idea Juliet is alive. Romeo enters the church where Juliet lies and bids her goodbye. She awakens just as Romeo takes the poison; the two thus see each other before he dies. After he dies, Juliet picks up Romeo's gun and shoots herself in the head, dying instantly. The two lovers are discovered in each other's arms. Prince condemns both families, whose feuding led to such tragedy, and coroners remove the two bodies."}