{"mid": "RomyAndMichelesHighSchoolReunion", "IMDB_id": "tt0120032", "title": "Romy and Michele's High School Reunion", "plot": "Romy White (Mira Sorvino) and Michele Weinberger (Lisa Kudrow) are two friends living together in a beachfront apartment in Los Angeles, California. Romy works as a cashier in the service department of a Jaguar dealership; Michele is unemployed. They are both single and unambitious. Romy encounters former high school classmate, Heather Mooney (Janeane Garofalo), who informs Romy about their upcoming 10-year high school reunion back in Tucson, Arizona.\nAt first excited at the prospect of attending, Romy then has the realization that they will not be able to make a good impression at the reunion. Desperate to impress their former classmates, Romy and Michele make last-ditch attempts to improve themselves to avoid the bullying they endured, mostly at the hands of the \"A-Group\", led by cheerleader Christie Masters (Julia Campbell).\nIn a series of flashbacks from 1987, Romy and Michele's suffering is revealed; Christie attached magnets to Michele's back brace and once took a bite out of the burger Romy was eating. Christie humiliated them once again at the prom, telling Romy that her handsome jock boyfriend, Billy Christensen (Vincent Ventresca), was in love with Romy and has now broken up with Christie to be with her. Christie tells Romy to wait for a dance with Billy. Christie and Billy then ride away together, unbeknownst to Romy, who patiently waits all night long at the dance for Billy. In tears, Romy then dances with Michele in a depressed state.\nFailing in their attempts to get jobs and boyfriends, Romy and Michele decide to simply pretend they have been much more successful by showing up in an expensive car and business suits. Romy obtains a nice car from the Jaguar dealership, and Michele makes their outfits.\nOn the way to the reunion after making the realization they had not thought of what kind of business women they were, they decide to claim that they invented Post-it notes, reasoning that their true origins are obscure. Romy wants to state it was her idea to invent Post-Its and Michele's main contribution was deciding they should be yellow, which Michele takes as an insult to her intelligence. This leads to a further argument about who's the cuter of the two. The argument results in their decision to go their separate ways once they reach their destination.\nWhen they arrive, Michele hears Romy saying that she invented Post-its all by herself. Michele convinces the A-Group girls that she invented a special kind of glue, explaining the glue's complicated formula in great detail. Sandy Frink (Alan Cumming), the nerd who had a crush on Michele in high school, turns out to be incredibly wealthy and gorgeous and hits on Michele, while Billy and Romy reunite and hit it off. Both Romy and Michele win awards as the most successful members of their graduating class. Though still refusing to speak with each other, they look back at each other with longing.\nSeventy years later, an elderly Michele learns that Romy is on her deathbed, so she calls her to make amends. However, they rehash the same argument. Romy dies, flipping her the bird, and they never get a chance to resolve their issues.\nMichele wakes up alone in the car in the present day, disturbed by the previous dream sequence. At the reunion, Romy has begun to spread her story. Heather Mooney disrupts their lie by revealing the real name of the person who did in fact invent Post-It notes (something Heather learned in business school). The A-Group girls begin a vicious verbal attack on Romy. Michele ineptly defends her. Christie further humiliates the two in front of everyone by revealing Romy's lie; Romy runs out, with Michele chasing after her.\nMichele then tells Romy that she genuinely thought that their lives were wonderful just the way they were, before Romy said that they were not good enough. Michele also says that they should not care what everyone else thinks. They change into fun, stylish outfits they've designed, and return to the reunion, determined to have some fun at any cost.\nThey confront Christie about her bullying. Romy says she no longer cares about Christie because Christie is just \"a bad person with an ugly heart\". Christie makes fun of their clothes; former classmate Lisa Luder (Elaine Hendrix), an ex-member of the A-Group who has since become a fashion editor for Vogue, sees things differently, and announces that the outfits are actually very well made and overall \"not bad\". Christie begins to attack Lisa, but Lisa coolly dismisses her in front of the crowd that has gathered to watch. The other A-Group girls defect and Christie is left by herself, while everyone else makes their way over to congratulate Romy and Michele. Heather apologizes to Romy and Michele and tells them that the two of them had actually made her unhappy in high school, for she had been in love with Sandy. Romy and Michele then make her feel better by saying that she too had the luxury of making someone miserable, referencing former classmate and reunion committee head Toby Walters (Camryn Manheim), to whom Heather was always cruel in high school.\nSandy Frink then arrives via helicopter, and turns out to be a billionaire who made his fortune from inventing a special shoe rubber. He goes over to talk to Romy and Michele. Michele tells Sandy that he must be the most successful person in their class; Sandy responds that despite all the wealth and success he has, the one thing he doesn't have is her, and asks her to dance with him. Michele agrees, so long as Romy can dance with them too.\nAfter an interpretive dance to Cyndi Lauper's \"Time After Time\" that receives huge applause, Sandy escorts them to his helicopter.\nHeather walks out, not interested in the new Sandy. While smoking, she encounters a mysterious classmate dressed as a cowboy (Justin Theroux). Heather remembers that in high school, he would often offer her a light by silently flicking lit cigarette butts at her. This time, Heather demands that he talk to her. The cowboy lights her cigarette with a lighter and apologizes for his previous behavior, stating that he had suffered from a speech impediment in high school.\nRomy and Michele leave with Sandy. On their way out, they encounter Billy Christensen, who is now Christie's husband; he is now an alcoholic, with a dead end job, living a miserable life with Christie, and unsure if he's the father of her latest pregnancy. When he propositions Romy, she tells him to go up to his hotel room, get undressed, and wait for her. He excitedly shuffles off; Romy laughs, having finally settled the score with Billy. They board the helicopter and see Heather down below amongst some bushes, making out with the cowboy.\nSix months later, back in L.A., Romy and Michele use money loaned to them by Sandy to open their own fashion boutique. Heather has stayed in touch and has become friends with the girls, shopping in their store (and finally getting an outfit that's not all black)."}