{"mid": "RoosterCogburn", "IMDB_id": "tt0073636", "title": "Rooster Cogburn", "plot": "Because of his drunkenness and questionable use of firearms, aging U.S. Marshal Rooster Cogburn (John Wayne) has been stripped of his badge. But he's given a chance to redeem himself after a village in Indian Territory is overrun by a gang of violent, ruthless criminals, who've killed an elderly preacher, Rev. George Goodnight (Jon Lormer). His spinster daughter, Eula Goodnight (Katharine Hepburn), wants to join Cogburn to track the criminals down, becoming his unwilling partner. But Rooster must use care, because the criminals, led by Hawk (Richard Jordan) and Breed (Anthony Zerbe), have stolen a shipment of nitroglycerine. Rooster rides by the following morning, while Eula and Wolf mourn their friend's and family member's deaths. Rooster convinces them to come, but he attempts to drop them off at Bagby's Store, but the trio follow him close behind. Meanwhile, in a scuffle between two bandit men, one of them is wounded by a stab wound. The wagon also hit a rock, but the men manage to fix it. Rooster, Wolf, and Eula stake out at a crossing in the woods, barricading the path with logs. The bandits are stopped and Rooster threatens to blow up the wagon unless the men dismount, which they do. A man attempts to shoot Rooster in the back, but Eula makes the perfect shot and kills him. Another man tries the same, but is killed instantly by a bullet to the chest. Rooster cries out \"Posse!\" and his two partners fire into the air, causing the men to actually think he has a posse, which they flee. Rooster captures the wagon.\nThe men carry on back to their leader, Hawk. He orders Breed to investigate the tracks, which he finds out there was not a posse, much to Hawk's disdain. Hawk, Breed and the bandit which got stabbed ride on to town, while the other men attempt to fix the axle, which they eventually do. The stabbed man cannot make it, causing Hawk to shoot him, saying \"Let the buzzards have him\" to Breed. That night the men kidnap Wolf, saying they will let him go if they give him the wagon, but are actually planning to get the wagon back, and to kill the three heroes. Wolf shoots the man who is holding him with the 5-shot Pepperbox handgun Rooster previously gave to him to protect himself and Eula if need be. He gets back to camp safely. Rooster has him hitch up the horses, while the bandits retreat because he fired the Gatling gun at them. They escape safely. The next day, Rooster \"borrows\" a raft from an old man, stashing as much dynamite as possible on board. The men attempt to ambush the three, but they fire the gun at them and they manage to escape around the corner. Breed and another bandit set up a trap across the river to capture Rooster and his gang. As the bandit is about the kill Rooster in cold blood, but Breed shoots him in the back in return for Rooster saving his life years prior. That night, Breed returns to the outlaws camp and Hawk realises that the other bandit must be dead. After checking Breed's gun and seeing one expended bullet, Hawk knows Breed killed him. Hawk then kills Breed by kicking down into a rocky ravine. They encounter massive rapids the following morning, causing enormous waves to fall on the raft, practically sinking it. They get through safely, though at the cost of losing the Gatling gun. They realize Hawk is planning to hold them up upriver, so they dump the dynamite overboard. They pretend to surrender, saying Rooster is sick. He jumps up and shoots the explosives, causing a massive wave to knock the riders over and blowing up the bandits. A few days later, Judge Parker gives Rooster's job back."}