{"mid": "Rope", "IMDB_id": "tt0040746", "title": "Rope", "plot": "Two brilliant young aesthetes, Brandon Shaw (Dall) and Phillip Morgan (Granger), strangle to death their former classmate from Harvard University, David Kentley (Dick Hogan), in their apartment. They commit the crime as an intellectual exercise; they want to prove their superiority by committing the \"perfect murder\".\nAfter hiding the body in a large antique wooden chest, Brandon and Phillip host a dinner party at the apartment, which has a panoramic view of Manhattan's skyline. The guests, who are unaware of what has happened, include the victim's father Mr. Kentley (Cedric Hardwicke) and aunt Mrs. Atwater (Constance Collier); his mother is not able to attend due to a cold. Also there are his fiancée, Janet Walker (Joan Chandler) and her former lover Kenneth Lawrence (Douglas Dick), who was once David's close friend.\nBrandon uses the chest containing the body as a buffet table for the food, just before their housekeeper, Mrs. Wilson (Edith Evanson) arrives to help with the party. \"Now the fun begins,\" Brandon says when the first guests arrive.\nBrandon and Phillip's idea for the murder was inspired years earlier by conversations with their prep school housemaster, publisher Rupert Cadell (Stewart). While at school, Rupert had discussed with them, in an apparently approving way, the intellectual concepts of Nietzsche's Übermensch, and De Quincey's art of murder, as a means of showing one's superiority over others. He too is among the guests at the party, since Brandon in particular feels that he would approve of their \"work of art\".\nBrandon's subtle hints about David's absence indirectly lead to a discussion on the \"art of murder\". Brandon appears calm and in control, although when he first speaks to Rupert he is nervously excited and stammering. Phillip, on the other hand, is visibly upset and morose. He does not conceal it well and starts to drink too much. When David's aunt, Mrs. Atwater, who fancies herself as a fortune-teller, tells him that his hands will bring him great fame, she is referring to his skill at the piano, but he appears to think this refers to the notoriety of being a strangler.\nMuch of the conversation, however, focuses on David and his strange absence, which worries the guests. A suspicious Rupert quizzes a fidgety Phillip about this and about some of the inconsistencies that have been raised in conversation. For example, Phillip had vehemently denied ever strangling a chicken at the Shaws' farm, but Rupert has personally seen Phillip strangle several. Phillip later complains to Brandon about having had a \"rotten evening\", not because of David's murder, but over Rupert's questioning.\nAs the evening goes on, David's father and fiancée begin to worry that he has neither arrived nor phoned. Brandon increases the tension by playing matchmaker between Janet and Kenneth. Mrs. Kentley calls, overwrought because she has not heard from David, and Mr. Kentley decides to leave. He takes with him some books Brandon has given him, tied together with the rope Brandon and Phillip used to strangle his son.\nWhen Rupert goes to leave, Mrs. Wilson accidentally hands him David's monogrammed hat, further arousing his suspicion. Rupert returns to the apartment a short while after everyone else has departed, pretending that he has left his cigarette case behind. He hides the case behind some books on the chest, asks for a drink and then stays to theorize about David's disappearance. He is encouraged by Brandon, who hopes Rupert will understand and even applaud them. A drunk Phillip is unable to take it any more; he throws a glass and says, \"Cat and mouse, cat and mouse. But which is the cat and which is the mouse?\"\nRupert lifts the lid of the chest and finds the body inside. He is horrified but also deeply ashamed, realizing that Brandon and Phillip used his own rhetoric to rationalize murder. Rupert disavows all his previous talk of superiority and inferiority, realizing that there is no way to objectively define these concepts, then seizes Brandon's gun and fires several shots out the window in order to attract attention. As approaching police sirens get louder, Rupert pulls up a chair next to the chest and the film's end credits appear on the screen."}