{"mid": "Roxanne", "IMDB_id": "tt0093886", "title": "Roxanne", "plot": "C.D. \"Charlie\" Bales, the fire chief of the small ski town of Nelson, British Columbia is intelligent, humorous, charismatic, athletic and skilled. Bales is sensitive about his large nose, which many in town have learned to not mention. He is unable to have it surgically altered because of a dangerous allergy to anesthetics. He is close to many in town, especially his godsister, Dixie, who owns the town diner and several rental homes. He becomes immediately attracted to beautiful newcomer Roxanne Kowalski, an astronomy graduate student renting from Dixie while searching for a new comet during the summer. She adores Bales, but only as a friend, preferring Chris, a handsome but dim fireman.\nRoxanne goes to Bales for help when Chris fails to advance their relationship further than curious glances. Through a turn of events, she falsely believes Chris is deeply intelligent. When Bales informs Chris of Roxanne's interest, Chris gets sick, intimidated by intelligent women. Chris starts to write her a letter, but takes all day with little result. He convinces Bales to write the letter, with prose that soon bowls over Roxanne. When informed that Roxanne wants to meet him, Chris again gets sick and refuses to meet until Bales comes up with a plan to allow him to be as brilliant as his letter makes him appear. Chris arrives at Roxanne's house with a hunter's cap on, hiding the earphones that relay Bales' words. When the equipment fails, Chris bungles the meeting by speaking his own crass thoughts. After Roxanne storms back into the house furious, Chris begs Bales to fix his mess again. At first he repeats what he is told from under a tree beneath Roxanne's window, but soon also ruins that. Then they switch jackets and hats so Bales can speak the words as Chris. They achieve their goal, and she invites Chris in to make love.\nRoxanne gets word about the comet and has to go out of town for a week. Since she can't find Chris, she gives Bales the address of her hotel and asks him to tell Chris to write to her. Bales writes her several times a day, each letter more incredible than the last. They affect Roxanne so deeply that she returns early. Bales is writing a new letter to her in Dixie's diner when he finds out that Chris (who knows nothing about the letters) is on his way to see Roxanne. He arrives at her home and warns Chris that Roxanne would be mentioning some letters that he supposedly wrote. She tries to get Chris to be the man in the letters, revealing that his looks are only secondary to her. Knowing that his looks are all he has, Chris runs out, leaving her confused. Dixie puts the last letter under her door and after reading it, Roxanne calls Bales over.\nChris prepares to leave town with a bartender, Sandy, whom he met while Roxanne was away. When she asks if he has told Roxanne (the women are acquaintances), he replies that he will write her a letter since he has a history of it.\nBales arrives, unaware that Roxanne knows the truth. She asks him to read one of the letters and then to look at the back, which shows that Dixie revealed its true author. She explodes in anger that he lied to her. He retorts that he simply wanted to tell her how he felt about her, but she was only interested in Chris's face and body. When he reminds her that it only took a few nice words for Chris to get her into bed, she punches him in the face and throws him out. As he prepares to say more he stops and sniffs the air. He slowly walks back to the firehouse and alerts his team, who then \"follow his nose\" until they find and extinguish the fire. During their celebration afterwards, someone mentions his nose and although everyone thinks he will get upset, he doesn't.\nBack home, sitting on his roof, Bales hears someone speaking his words to him. It's Roxanne, declaring that she realizes that it was everything from Bales that she loved, not Chris' looks. Bales descends from the roof and they reconcile. During the credits, she reveals that she named the comet \"Charlie\" - after her father."}