{"mid": "RunawayTrain", "IMDB_id": "tt0089941", "title": "Runaway Train", "plot": "The story follows the escape of two men from an Alaska prison, the efforts of a railroad dispatch office to safely stop the out-of-control train they are on, and the hunt by their warden to recapture them.\nOscar \"Manny\" Manheim is a ruthless bank robber and hero to the convicts of Stonehaven Maximum Security Prison. After two previous escape attempts, the doors to Manny's cell were welded shut for three years. A court order compels Manny's nemesis, the vindictive and sadistic Associate Warden Ranken, to release him back into the general prison population. Manny intends to break out a third time with his older brother Jonah, but he is forced to set his escape plan into action in the middle of winter after Ranken employs a serial killer to stab him. Jonah stabs his attacker to death in retaliation and in turn is severely beaten by a prison guard, leaving him in a high-security hospital wing.\nManny has to leave his brother behind. He recruits Buck McGeehy, who was convicted of statutory rape and who works in the prison's laundry room, to smuggle him out in a trolley. Buck decides to join Manny in the escape, even though Manny wants to go it alone. After a freezing cross-country hike (involving a 300 ft (100 m) drop into a river and subsequent swim) the two hop on board a train consisting of four locomotives at a remote Alaskan rail yard.\nBoth men enter the fourth unit and stow away in the toilet compartment. Just as the train starts to move, the elderly engineer suffers a heart attack. In attempting to stop the train and get off, he does not set the throttle to idle, instead engaging the brakes, before collapsing off the still-moving train. This overrides the engine's automatic train stop. Consequently, the locomotives overpower the brakes, burning their shoes off and making it impossible to stop the train. Neither of the two convicts is aware of what has happened.\nAs the driverless train accelerates, dispatchers Dave Prince and Frank Barstow are alerted to the situation. Unaware of the failure of the brakes, Barstow authorizes employees to allow the runaway out onto the mainline, arrogantly insisting that a computer-controlled system of his creation will automatically apply the brakes on the locomotives. After the last of the brake shoes burn off and the dispatchers realize the severity of their situation, they try to keep the tracks clear. The runaway subsequently smashes through the caboose of a freight train that was in the act of moving out of its path. The collision badly damages the cab of the lead locomotive and jams the front door of the second engine, an old EMD F-unit. The convicts on board are now aware something is seriously wrong. Barstow realizes that the locomotive's over-speed control must have been disabled in the crash. Learning that the train's excessive speed will most probably collapse an old railroad trestle ahead and believing that no one alive is on board, Barstow's superior Eddie McDonald orders him to derail the train.\nAt this point the train's horn blows, alerting the signal maintainer and the convicts that someone is present on the train. Barstow orders a reversal of the switch. The train continues towards the old Seneca trestle, where emergency workers are gathering in expectation of a disaster. Ranken concludes that his two escaped convicts are fleeing by rail and makes his way to the dispatcher's office. Meanwhile, the two fugitives in the rear locomotive are alarmed when they are discovered by the only other person left on the train, a locomotive hostler named Sara, who clambered back to their location in the belief that she would be safer in the event of another collision. They realize that the train is out of control and that she had sounded the horn from the second locomotive.\nSara convinces the convicts that jumping off the train at its current speed would be suicidal and explains that the only way to stop the train would be to climb into the lead engine and press its emergency fuel cut off switch, a near-impossible feat since the second locomotive is a \"carbody\" F-unit with no forward catwalk. Its nose door, which would normally allow access to the lead engine, has been jammed from the collision with the freight train. They are, however, able to slow the train somewhat by disconnecting the MU cables connected to the two rear locomotives, shutting them down and slowing the train enough for it to cross the Seneca trestle despite going much faster than the bridge's speed rating.\nThe dispatchers divert the runaway onto a branch after determining it is only five minutes away from a head-on collision with a passenger train. This is only a brief respite, as further ahead the branch negotiates a tight curve adjacent to a chemical plant. Even at its reduced speed, the runaway is likely to derail on this curve and trigger a major chemical spill. His hand forced, Barstow agrees that they must switch the runaway onto a stub-ended siding and crash it, thus condemning the three people on the train to almost certain death, rather than risk a catastrophic chemical explosion. Warden Ranken forces Barstow's to help him reach the train by helicopter.\nManny shows an increasingly violent streak, repeatedly asserting his dominance over Buck. He tries to force Buck into a suicidal scramble around the outside of the second engine's frozen nose although Buck has already tried once and failed. Sara's intervention on Buck's behalf forces an armed face-off between the two convicts who threaten to kill one another. Emotionally broken, all three slump into a fatalistic depression in the F-unit's cab. Suddenly Ranken's accomplice crashes through the second engine's window and is killed after unsuccessfully trying to board the lead engine via helicopter. Ranken has now caught up with the train.\nSpurred on by the appearance of his arch-enemy and resolved not to return to prison, even if it means his own death, Manny makes a perilous leap from the F-unit's broken windshield to the lead engine. He barely makes it, crushing his hand between the knuckle couplers in the process. Ranken meanwhile has boarded the locomotive from the helicopter. Manny ambushes him as he enters the cab and handcuffs him inside the locomotive. Ranken orders Manny to stop the train before it crashes at the end of the siding, but Manny has chosen to die and take the warden with him rather than be recaptured. When reminded of Buck and Sara in the second engine, Manny tells Ranken, ‘Oh no. It's just you and me!’, and proceeds to detach the lead locomotive from the rest of the train.\nHe waves goodbye, ignoring Buck's screaming pleas to shut down the lead engine, and climbs onto the roof of the lone engine in the freezing cold and blowing snow, his arms stretched out, ready to meet his end. A series of cross-cuts show Buck and Manny's fellow inmates mourning in their cells at Stonehaven, as the lone engine disappears into the snow storm. The film closes with an on-screen quote from William Shakespeare's Richard III:\n\"No beast so fierce but knows some touch of pity.\"\n\"But I know none, and therefore am no beast.\""}