{"mid": "RussianRhapsody", "IMDB_id": "tt0037236", "title": "Russian Rhapsody", "plot": "Nazi German bombers are failing to make it to Moscow in World War II; infuriated by his soldiers' constant failure, Hitler announces his decision via a radio broadcast at a \"New Odor\" rally that he will personally fly a heavy bomber to attack the Russians. On the way to Moscow, Soviet gremlins sneak onto the plane in flight and without Hitler’s being aware of what's going on, begin to dismantle it while singing \"We Are Gremlins from the Kremlin\" to the tunes of “Ochi Chyornye” (“Dark Eyes”) and “Eh, uchnem” (“Song of the Volga Boatmen”), and the sabotage includes a \"termiteski\" busily devouring the plane's wing (with loud burps) and a microscopic gremlin smashing the control panel dials with an enormous wooden mallet and announcing \"I'm only three and a half years old!\"\nHitler eventually discovers the gremlins after he's been stabbed in the buttocks and tries to retaliate. He fails, being severely frightened by several gremlins holding a mask of Joseph Stalin. The gremlins succeed in ejecting him from the bomber by cutting a hole in the fuselage beneath him. As he falls, Hitler comes to and realizes the plane is right behind him in a power dive. He tries to outrun the plane and to hide behind a small sapling upon landing, but the plane alters course as seen by its shadow. Both Hitler and the plane are driven into the ground. The plane’s tail with its swastika insignia erupts from the ground as a headstone.\nThe cartoon ends with the gremlins celebrating in victory as Hitler pops out of the ground, with his face grimacing into the one of comedian Lew Lehr, and paraphrasing his famous catch phrase: \"Monkeys is the cwaziest [craziest] peoples!\" (only changing the word \"monkeys\" into \"Nazis\"). A gremlin pounds Hitler back into the ground with a sledgehammer, ending the film under Clampett’s signature ‘‘bee-woop’’ vocalization."}