{"mid": "RyansDaughter", "IMDB_id": "tt0066319", "title": "Ryan's Daughter", "plot": "Rosy Ryan (Sarah Miles), only daughter of the local publican, widower Tom Ryan (Leo McKern), is bored with life in Kirrary, an isolated village on the Dingle Peninsula in County Kerry, Ireland. The villagers are nationalists, taunting British soldiers from a nearby army camp. Ryan publicly supports the recently suppressed Easter Rising, but secretly serves the British as an informer.\nRosy falls in love with the village schoolmaster, widower Charles Shaughnessy (Robert Mitchum). She imagines, though he tries to convince her otherwise, that he will somehow add excitement to her life. They marry and settle in the schoolhouse, but he is a quiet man uninterested in physical love.\nMajor Randolph Doryan (Christopher Jones) arrives to take command of the army camp. After winning a Victoria Cross on the Western Front, he has a crippled leg and is suffering from shell shock. When he visits the pub where Rosy is serving alone, he collapses under a flashback to the trenches and is comforted by her. The two kiss passionately until they are interrupted by the arrival of Ryan and others. Next day, the two ride to a forest for a passionate liaison. Charles becomes suspicious of Rosy, but keeps his thoughts to himself.\nCharles takes his schoolchildren to the beach, where he notices Doryan's telltale footprints accompanied by a woman's in the sand. He tracks the prints to a cave and imagines Doryan and Rosy conducting an affair. Local halfwit Michael (John Mills) notices the footprints as well and searches the cave. Finding Doryan's Victoria Cross, he pins it on his lapel and proudly parades through the village, but suffers abuse from the villagers. When Rosy comes riding past, Michael approaches her tenderly. Between Rosy's dismay and Michael's pantomime, the villagers surmise that she is having an affair with Doryan.\nOne night, during a fierce storm, IRB leader Tim O'Leary (Barry Foster) – who had killed a police constable earlier – and a small band of his men arrive in Ryan's pub seeking help to recover a shipment of German arms being floated from a ship towards the beach. When they leave, Ryan tips off the British. The entire village turns out to help the rebels, with Ryan the most outwardly devoted to the task, wading into the breakers repeatedly to salvage boxes of weapons and explosives. O'Leary is overwhelmed by Ryan's devotion, and the villagers are ebullient. They gleefully free the rebels' loaded truck from the wet sand and follow it up the hill. Doryan, waiting at the top with his troops, captures the men and arms. O'Leary makes a break, but Doryan climbs atop the truck and brings him down with a single rifle shot. Then he suffers a flashback and collapses. Rosy presses through the crowd in concern, outraging the villagers.\nCharles tells Rosy that he had let her affair run its course, hoping that the infatuation would pass, but now wants a separation. Rosy says the affair is over, but that night she leaves their bed in her nightdress to meet Doryan. In dismay, Charles wanders in his nightclothes to the beach, where the parish priest Father Collins (Trevor Howard) finds him. The villagers storm into the schoolhouse and seize Rosy, convinced that she informed the British of the arms shipment. Ryan watches in shame and horror as his daughter takes the blame for his actions. The mob shears off her hair and strips off her clothes.\nDoryan walks along the beach and gives his cigarette case to Michael. In gratitude, Michael leads Doryan to a cache of arms–-including dynamite–-that was not recovered. After Michael runs off, Doryan commits suicide by detonating the explosives. The next day, Rosy and Charles leave for Dublin, enduring the taunts of the villagers as they go."}