{"mid": "SaltOfTheEarth", "IMDB_id": "tt0047443", "title": "Salt of the Earth", "plot": "Esperanza Quintero (Rosaura Revueltas) is a miner's wife in Zinc Town, New Mexico, a community which is essentially run and owned by Delaware Zinc Inc. Esperanza is thirty-five years old, pregnant with her third child and emotionally dominated by her husband, Ramon Quintero (Juan Chacón).\nThe majority of the miners are Mexican-Americans and want decent working conditions equal to those of white, or \"Anglo\" miners. The unionized workers go on strike, but the company refuses to negotiate and the impasse continues for months. Esperanza gives birth and, simultaneously, Ramon is jailed for assaulting a union worker who betrayed his fellows. When Ramon is released, Esperanza tells him that he's no good to her in jail. He counters that if the strike succeeds they will not only get better conditions right now but also win hope for their children's futures.\nThe company presents a Taft-Hartley Act injunction to the union, meaning any miners who picket will be arrested. Taking advantage of a loophole, the wives picket in their husbands' places. Some men dislike this, seeing it as improper and dangerous. Esperanza is forbidden to picket by Ramon at first, but she eventually joins the line while carrying her baby.\nThe sheriff, by company orders, arrests the leading women of the strike. Esperanza is among those taken to jail. When she returns home, Ramon tells her the strike is hopeless, as the company will easily outlast the miners. She insists that the union is stronger than ever and asks Ramon why he can't accept her as an equal in their marriage. Both angry, they sleep separately that night.\nThe next day the company evicts the Quintero family from their house. The union men and women arrive to protest the eviction. Ramon tells Esperanza that they can all fight together. The mass of workers and their families proves successful in saving the Quinteros' home. The company admits defeat and plans to negotiate. Esperanza believes that the community has won something no company can ever take away and it will be inherited by her children."}