{"mid": "Sampo", "IMDB_id": "tt0053240", "title": "Sampo", "plot": "The people of Kalevala are a peaceful hard working people, they have everything they need and want bar the mystical Sampo, a magical mill which will make grain, salt and gold and give prosperity to whoever possesses it.\nThe only person in Kalevala able to make a Sampo is the smith Ilmarinen, however he cannot make it until his sister Annikki has fallen in love. Annikki eventually falls in love with the young hard working Lemminkäinen.\nAll is not perfect however. There is a dark dismal land called Pohjola ruled over by a wicked witch called Louhi, and she wishes for a Sampo, but her wizards are unable to forge one. Louhi is advised that only Ilmarinen is able to forge a Sampo. Louhi sends her enchanted cloak to bring Annikki to Pohjola as ransom.\nLemminkäinen runs to Ilmarinen to inform him that his sister has been taken and vows to return her, Ilmarinen agrees to come with him and they set off on a boat constructed of an ancient oak tree.\nOn arrival Louhi demands they complete a simple task each, Lemminkäinen is asked to plow a field of snakes, which he does with the aid of a steel horse made by Ilmarinen. The final task is set to Ilmarinen; he is to forge a Sampo. He sets to work and, after some failed bargaining for another task, and with the aid of the trolls of Pohjola on the bellows and the fire from heaven itself, he forges a beautiful Sampo, which immediately begins to make gold, grain and salt.\nLemminkäinen and Ilmarinen are reunited with Annikki and they set sail for Kalevala. Lemminkäinen is upset when he is informed that the people of Kalevala will never be able to reap the benefits of the Sampo and dives into the sea to swim back and recover it.\nBack in Pohjola, Lemminkäinen releases the mist from the prison Louhi has placed it in and it covers the whole land. When the mist clears the Sampo has gone and Lemminkäinen is on a boat heading back to Kalevala. His boat is wrecked on the ocean surface when Louhi orders that the wind be set free, and the Sampo is destroyed and Lemminkäinen presumed lost.\nLemminkäinen manages to swim back to Kalevala and manages to return a small piece of the Sampo, which Väinämöinen announces will bring great prosperity and joy to the people of the land. Lemminkäinen and Annikki marry and a great feast and dance is arranged. However, Louhi, angry at the betrayal, comes to Kalevala and steals their sun. Returning it to Pohjola, she locks it in a deep mountain cave.\nAs Kalevala is plunged into perpetual darkness things look very bleak. However, Lemminkäinen is still hopeful, he asks Ilmarinen to forge a new sun, which he begins work on. But wise old Väinämöinen informs him it's futile and that they must go to Pohjola and recover the sun by force. Väinämöinen tells the people this battle will be fought using kantele and not bladed weapons. The people of Kalevala prepare by cutting trees and bringing all precious metals to Ilmarinen to forge the strings.\nWhen the two people (Kalevala and Pohjola) meet on a frozen lake for battle, Väinämöinen begins playing and the trolls of Louhi begin to drift to sleep. Louhi tries in vain to get them to fight, but she fails and her trolls fall down unconscious. Louhi then sends her magic cape to kill the people of Kalevala but it is beaten down into a hole in the ice. Lemminkäinen marches up to the mountain which contains the sun, and Louhi turns herself into stone in fear. Lemminkäinen slices the stone door of the mountain open with his sword, releasing the sun to shine over the lands of Kalevala.\nThe film ends with scenes of the people of Kalevala looking to the bright sky in wonder and happiness."}