{"mid": "SantaClausIsCominToTown", "IMDB_id": "tt0066327", "title": "Santa Claus Is Comin' to Town", "plot": "Special Delivery \"S.D.\" Kluger (voiced by and resembling Fred Astaire) the mailman is introduced after a newsreel prologue, telling how children around the world are preparing for Christmas and Santa Claus' arrival. When his snowmobile/mail truck breaks down, he tells the story of Santa Claus, answering the children's letters to Santa.\nThe story begins in the gloomy city of Sombertown, ruled by the ill-tempered Burgermeister Meisterburger (voiced by Paul Frees). A baby arrives on his doorstep with a name tag reading \"Claus\" and note requesting that Burgermeister raise the child. He instead orders his lawkeeper Grimsley (also voiced by Paul Frees) to take the baby to the \"Orphan Asylum\". On the way there, a gust of wind blows both sled and baby to the Mountain of the Whispering Winds, where the animals hide him from its inhabitant the Winter Warlock (voiced by Keenan Wynn) and convey him to an Elvish family by the name of Kringle in Rainbow River Valley. Led by Tanta Kringle (voiced by Joan Gardner), the elf queen, they adopt the baby and name him “Kris”. A few years later, Kris hopes to restore the Kringle family as \"The First Toymakers to the King\".\nWhen Kris is old enough, he volunteers to deliver the elves' toys to Sombertown. Unfortunately, the Burgermeister has outlawed all toys in the town, and declares that anyone found possessing a toy will be arrested. On his way to Sombertown, Kris meets a lost penguin whom he names Topper as they evade the Winter Warlock who vows to catch him the next time he passes. In the town, he offers toys to two children washing their stockings by a water fountain. He is stopped by Miss Jessica (voiced by Robie Lester), their lovely schoolteacher, but she softens toward Kris when he offers her a china doll as a \"peace offering\". As Kris gives more toys, the Burgermeister arrives to arrest the children, but Kris gives him a yo-yo. He at first happily plays with it, but Grimsley reminds him he's breaking his own law, leading to Burgermeister ordering Kris' capture.\nAs Kris and Topper return to the Kringles, the Winter Warlock captures them with the help of his Tree Monsters Willy Willow and Peter Pine. But when Kris gives him a toy train as a present in exchange for having his Tree Monsters release him, the Warlock befriends Kris as his appearance changes. To repay him, he re-unites Kris with Jessica, who informs him that the Burgermeister has destroyed all the toys and the children now want new ones. When the Burgermeister hears that Kris means to bring more toys, he orders all doors to be locked before their houses are searched. But Kris enters by the chimneys where the children hung their stockings to dry by the fire where Kris hid the toys.\nThereafter Burgermeister sets a trap for Kris as he makes another delivery, and thus captures the Kringles, Topper, and Winter. Jessica pleads to release her friends, but he refuses, and Jessica requests Winter to break everyone out, but he refuses, on grounds of having little magic except some magic feed corn enabling reindeer to fly. With the reindeer's help, the Kringles, Kris, Topper, and Winter escape.\nAfter months as an outlaw, Kris returns to the woods, where he grows a beard as a disguise. After Tanta suggests that he return to his birth name \"Claus\" for safety, Kris marries Jessica. After the ceremony on December 24, the group travels to the North Pole to build their own castle and workshop.\nAs the years pass, Kris still has to travel by night because he's still an outlaw. Eventually, the Meisterburgers died off and fell out of power and their laws were abolished. The townspeople then look up to Kris who becomes Santa Claus and Jessica becomes Mrs. Claus. Santa then decides to limit his journeys to one night a year and chooses the right night. Christmas Eve, \"the night of profound love.\" Just as Santa is getting ready to leave, Winter tells him that he has his magic powers back to guarantee the world a white Christmas.\nAt the end, after S.D. Kluger explains Santa's true meaning, he remembers that he still has to deliver the children's letters to him and leaves for the North Pole (joined by Topper, Winter, the Kringle family, and a parade of children singing \"Santa Claus Is Coming to Town\") during the credits. As they finally reach Santa's workshop, we see Santa and Mrs. Claus' shadows inside their castle. Santa steps outside and waves goodbye to the viewers as a group of children say, \"Merry Christmas!\""}