{"mid": "SaturdayNightAndSundayMorning", "IMDB_id": "tt0054269", "title": "Saturday Night and Sunday Morning", "plot": "The novel Saturday Night and Sunday Morning is split into two unequal parts: the bulk of the book, Saturday Night, and the much smaller second part, Sunday Morning.\nSaturday Night\nSaturday Night begins in a working man's club in Nottingham. Arthur Seaton is 21 years old, and enjoying a night out with Brenda, the wife of a colleague at work. Challenged to a drinking contest, Arthur defeats \"Loudmouth\" before falling down the stairs drunk. Brenda takes him home with her and they spend the night together. Arthur enjoys breakfast with Brenda before her husband Jack gets home from a weekend at the races.\nArthur works at a lathe at a bicycle factory with his friend Jack. Arthur keeps his mind occupied during the mundane and repetitive work through a mental collage of imagined fantasies, and memories of the past. He earns a good wage of 14 pounds a week, and Robboe, his superior, fears he may get in trouble for letting Arthur earn so much. Soon Arthur hears the news that Jack has been switched to nights, which pleases Arthur as he can now spend more time with Jack's wife. At the same time, Arthur carries on with Brenda's sister Winnie.\nDuring another night out at the pub, Arthur meets Doreen, a young unmarried girl with whom he begins a relatively innocent courtship — all the while keeping Brenda and Winnie a secret. However, although Jack is oblivious to his wife's infidelity, Winnie's husband Bill catches on — and Arthur's actions catch up with him when Bill and an accomplice jump Arthur one night, leaving him beaten and bed-ridden for days.\nSunday Morning\nSunday Morning follows the course of events after Arthur's assault. When Doreen comes to check up on him, Arthur finally comes clean about his affairs with Brenda and Winnie. Doreen stays in a relationship with Arthur despite his dishonesty; Brenda and Winnie disappear from the story. By the end of the novel, Arthur and Doreen have made plans to marry."}