{"mid": "SaturdayNightFever", "IMDB_id": "tt0076666", "title": "Saturday Night Fever", "plot": "Anthony \"Tony\" Manero is a 19-year-old Italian American man from the Bay Ridge neighborhood of Brooklyn in New York City. Tony lives with his parents, and works at a dead-end job in a small hardware store. The stagnant monotony of his life is temporarily dispelled every Saturday night when Tony is \"king of the dance floor\" at 2001 Odyssey, a local disco club. Tony has four close friends: Joey; Double J; Gus; and the diminutive Bobby C. A fringe member of his group of friends is Annette, a neighborhood girl who longs for a more permanent physical relationship with Tony.\nTony and his friends ritually stop on the Verrazano–Narrows Bridge to clown around. The bridge has special significance for Tony as a symbol of escape to a better life on the other side—in more suburban Staten Island.\nTony agrees to be Annette's partner in an upcoming dance contest at 2001 Odyssey, but her happiness is short-lived when Tony is mesmerized by another woman at the club, Stephanie Mangano, who executes intricate dance moves with exceptional grace and finesse. Although Stephanie coldly rejects Tony's advances, she eventually agrees to be his partner in the dance competition, provided that their partnership will remain strictly professional. Tony's older brother, Frank Jr., who was the pride of the Manero family since he was ordained a Roman Catholic priest, brings despair to their parents when he tells them that he has left the priesthood. Tony shares a warm relationship with Frank Jr., but feels vindicated that he is no longer the black sheep of the family.\nWhile on his way home from the grocery store, Gus is attacked by a Hispanic gang and hospitalized. He tells Tony and his friends that his attackers were the Barracudas. Meanwhile, Bobby C. has been trying to get out of his relationship with his devoutly Catholic girlfriend, Pauline, who is pregnant with his child. Facing pressure from his family and others to marry her, Bobby asks former priest Frank Jr., if the Pope would grant him dispensation for an abortion. When Frank tells him such a thing would be highly unlikely, Bobby's feelings of despair intensify. Bobby lets Tony borrow his 1964 Chevrolet Impala to help move Stephanie from Bay Ridge to Manhattan, and futilely tries to extract a promise from Tony to call him later that night.\nEventually, the group gets their revenge on the Barracudas, and crash Bobby C's car into their hangout. Tony, Double J, and Joey get out of the car to fight, but Bobby C. takes off when a gang member tries to attack him in the car. When the guys visit Gus in the hospital, they are angry when he tells them that he may have targeted the wrong gang. Later, Tony and Stephanie dance at the competition and end up winning first prize. However, Tony believes that a Puerto Rican couple performed better, and that the judges' decision was racially rigged. He gives the Puerto Rican couple the first prize trophy, and leaves with Stephanie. Once outside in a car, she denigrates their relationship and he tries to rape her. She resists and runs from him.\nTony's friends come to the car along with a drunk and stoned Annette. Joey says she has agreed to have sex with everyone. Tony tries to lead her away, but is subdued by Double J and Joey, and sullenly leaves with the group in the car. Double J and Joey rape Annette. Bobby C. pulls the car over on the Verrazano-Narrows Bridge for their usual cable-climbing antics. Typically abstaining, Bobby gets out and performs more dangerous stunts than the rest. Realizing that he is acting recklessly, Tony tries to get him to come down. Bobby's strong sense of alienation, his deadlocked situation with Pauline, and Tony's broken promise to call him earlier that day—all culminate in a suicidal tirade about Tony's lack of caring before Bobby slips and falls to his death in the water below them.\nDisgusted and disillusioned by his friends, his family, and his life, Tony spends the rest of the night riding the subway into Manhattan. Morning has dawned by the time he appears at Stephanie's apartment. He apologizes for his bad behavior, telling her that he plans to relocate from Brooklyn to Manhattan to try and start a new life. Tony and Stephanie salvage their relationship and agree to be friends, sharing a tender moment."}