{"mid": "SavingSally", "IMDB_id": "tt5569560", "title": "Saving Sally", "plot": "The film revolves around Marty (Enzo Marcos) an amateur comic-book artist who sees the world around him as a vivid picture book and also sees most people he dislikes or indifferent to as monsters. Three years ago, when he was still a high school sophomore, Marty was often picked on by a bully until Sally (Rhian Ramos), a gadget inventor, intervened and later helped Marty get revenge by humiliating the said bully in public. The two immediately became best friends, and as time passed, Marty developed romantic feelings for his friend but such feelings remained unrequited. Ever hesitant, Marty struggles to gather the courage to express his true feelings to Sally and drew pictures of his friend and his experiences with her in secret.\nThe two had adventures together frequently going to the comics store and in one occasion took pictures of sleeping people. As Marty spent time with Sally he also learns that his friend's adoptive parents are strict and suspects that Sally is being physically abused by them. Sometimes Sally reasons out that she is busy with a \"secret project\". The two developed a system utilizing a high-powered telescope and a code book of signals using clothes, which enabled them to interact than what Sally parents would allow. Marty would sometimes finds Sally with a bruise with Sally often shrugging it off claiming the bruises were from accidents.\nThe summer after they graduated from high school, Sally and Marty decided to attend the same college together as Fine Arts students and took the entrance exams. Marty was immediately accepted at the institution while Sally was put on the \"waiting list\" meaning that her admittance to the college isn't certain. Sally remarks that her parents doesn't like her to take a course in Fine Arts anyway. Marty got a call from a comic-book publisher, Renegade Komiks, and got an opportunity to pitch a comic storyline from the eyepatch-wearing editor Toto. At the park at near dusk when the two are in a swing Marty yet attempts to say his true feelings for Sally and his friend is also eager to say something. Marty urged Sally to say what she would want to say and Sally revealed that she has a boyfriend much to Marty's shock.\nMarty's father confronted him with his problem and brought him to a place where men go when they are depressed which was later revealed to be a toy car racing venue. Marty's father encouraged him that it was not too late to disclose his feelings to Sally pointing out that if he did he would be the \"first in line\" if Sally and her boyfriend broke up.\nMarty brought some of Sally's stuff to her house. He was greeted by Sally's parents who gave him five minutes to interact with their daughter. Sally revealed that she was grounded after her new mobile phone bought for her by her boyfriend Nick was found out by her parents who forbids her to own a mobile phone. Sally said that she won't be allow to take Fine Arts if she won't broke up with Nick. Sally secretly gave Marty, Nick's contact number.\nAt a cafe, Marty meets up with Nick who was initially rude to him before Marty introduced himself. Marty had an impression that Nick is a dickhead and literally sees him as a monster. The two discussed about Sally's situation and Nick told Marty to tell Sally that he misses her so much. At Sally's home, Marty agreed to send a letter by Sally intended for Nick. Meanwhile, Marty presented his pitch to Renegade Komiks. The pitch for his comic is a science fiction story about a war between alien invaders and humanity. Toto approves of the work and asks Marty to start making drawings for the comic series and gives him another deadline.\nSally sneaks out of his house one evening and was fetched by Marty who brings her to a shopping mall. Nick meets up with the two at the mall's cinema. Nick, Sally, and a reluctant Marty watches a Hollywood blockbuster action film. Nick thanks Marty the next day and gives him a ticket to a rave party. Marty was reluctant to accept the ticket saying it wasn't his thing but Nick insists saying it was a gift. Nick reveals that Sally is planning to sneak out of her house again, this time to make out with him. This caused Marty to be vigilant of Sally's whereabouts during that evening but failed to intervene. It was later found out that Sally did not became pregnant.\nStuck with his initial comic concept, Marty presented a new story to Toto which is about an astronomer who dedicates his life to a girl trapped by aliens in a prison which revolved around his own experiences with Sally, her parents, and Nick. While initially averse to publishing a love story, Toto decides to give it a try and the comic became a hit.\nNick along with Marty goes to the rave party. Marty got drunk, talked to a girl who says Nick's a friendly guy and sees the girl dancing with Nick. At Nick's car, Marty who is experiencing a hangover expressed ill-feelings to Nick who viewed Marty as ungrateful. Marty also said that the Sally was entertaining the thought of marrying Nick. Nick said that he would marry Sally. Nick lost contact with Marty and Sally after that incident.\nSally began to wonder where Nick is for sometime. She sneaks out of the house again and asks Marty to buy art supplies - in reality parts for her contraptions. The two finds out Nick dating the girl Marty met earlier across the street. Marty tried to charge at Nick but he was stopped by Sally who prevented him from being run over by a vehicle. The two had an argument in Marty's room and Sally found out her friend's secret drawings of her. Marty finally admitted his feelings but Sally isn't ready to commit in a relationship. Marty became depressed and drew grim drawings and compiled it into the \"Book of Sad\" and sent it to Sally.\nThe two grew distant from each other as they both enter college. Sally had another boyfriend and Marty had a girlfriend. Nevertheless, fate continued to set them up with each other until one day when Sally approached Marty and asked him to autograph her copy of the comics he wrote. Sally says that she plans to sell the comics with his autograph when he becomes famous. Marty agrees but says that his work is garbage anyway and that it means nothing to him now. Sally disagrees with it and the topic of their conversation changed. Sally reveals that she broke up with her boyfriend and Marty said that his girlfriend has emigrated to Australia. Sally later sends a \"Book of Happy\", an interactive pop-out book depicting their adventures, to Marty to cheer him up. Noticing a small reproduction of their old code book containing instructions to open the book in reverse, Marty realizes that the book also functions as a flip book, which Sally used to tell him she now reciprocates his feelings.\nThis rejuvenated Marty's feelings for Sally and immediately goes to her house but he overhears her parents physically beating her. Marty knocks on the door and sees Sally with a bruise on her mouth who explains that it was caused by an accident. Marty refuses to accept the explanation, knowing the real cause of his friend's bruise and urged Sally to run away from her abusive parents. Sally and Marty went to her room to get her stuff but was chased by her parents as they leave the house.\nSally brings Marty to a dumpster where she reveals the \"secret project\" that she worked on, a hideout full of gadgets. She decides to live there from now on. The credits scene suggests that the two graduated from college and became a couple."}