{"mid": "ScannersIITheNewOrder", "IMDB_id": "tt0102848", "title": "Scanners II: The New Order", "plot": "During one of his classes, a young veterinarian intern named David Kellum (David Hewlett) discovers that he has mental abilities to read and control minds of others. When he moves from his country home to the city to continue his studies, he finds difficulty in controlling himself: the congestion of many minds and the ability to hear voices overwhelm him.\nHe stumbles across a store robbery and kills the gunman with his mind. Police Commander John Forrester watches the store's security tape and plans to enlist David to work for him. He tells David that he knows what he is: a Scanner. And, there are others like him around the world. He asks for David's help in tracking down elusive criminals and David agrees.\nAfter capturing a man who put strychnine in milk containers throughout the city, Forrester introduces David to Peter Drak, another Scanner who also works for him. Drak proves to be more aggressive when it comes to using his powers. Forrester teaches David techniques by using Drak as a test subject. Drak considers Kellum an enemy but is injected with the drug Eph2, a variant of Ephemerol. It calms him down before he could harm David.\nThe drug Ephemerol was what originally created Scanners. It was administered to ease expecting mother's discomfort in the 50's. Its side effect caused babies to develop into Scanners. Forrester tells David that although Eph2 manages to calm a Scanner's mind, the drug is addictive and that he should never use it. Forrester encourages him to develop and control his mental abilities on his own.\nDavid feels he has accomplished something by helping with law enforcement. His feeling changes when Forrester orders him to control the mayor and have her announce Forrester as the next Chief of Police. Forrester reassures him that it is the best choice for everyone and together they can stop all crimes. David, feeling guilty, disagrees and questions Forrester's agenda. He explains to the mayor how he forced her to appoint Forrester and apologizes. They then plan a way to remove Forrester from office. David tells Forrester that he is quitting, so Forrester has Drak attack David and kill the mayor before she can react. David escapes and hides at his parents's home.\nHe asks his parents about his abilities, and they tell him that he was adopted. They explain that his birth parents were Cameron Vale and Kim Obrist (Stephen Lack and Jennifer O'Neill, respectively, from the first film Scanners). Vale and Obrist told them about his abilities and that he was in danger. They took David in as their own. David needs to go for a walk but while he is gone, Drak and his accomplices kill David's mother and leave David's father for dead. When David returns, his father tells him about his older sister, Julie Vale. He leaves his father with paramedics and begin searching for his sister.\nHe finds Julie in a secluded cabin. She confirms who she is and explains that their parents were killed by Forrester for resisting him. She also states that her former boyfriend Walter agreed to test the earlier version of Ephemerol and was one of the first Scanner to use the drug, a more unstable version. Walter was kidnapped by Forrester and never seen again. Julie agrees to help David.\nTogether they go to Forrester's secret compound and discover that Walter is alive and is one of the test subjects with addiction in Eph2. Julie and David disable the perimeter guards. But, once inside, Julie is tranqilized by a dart. David leaves her behind to destroy the research and free the test subject Scanners.\nDrak attacks David in the test subject quarters. Drak almost succeeds in killing him, but is stopped by a combined attack by all test subjects, which drains away Drak's life force. This reverses the physical damage all addicted Scanners were suffering from, as well as David's injuries from Drak's attack.\nForrester arrives on the scene, in response to David and Julie's assault. Television news reporters and camera crews also show up. He denies the existence of Scanners and his connection to the mayor's death. With his power, David forces Forrester to admit his involvement and motivation before camera. Afterward, Forrester grabs a gun and tries to shoot David, but David and Julie deform Forrester with telekinesis: everything was caught on tape. David then announces that Scanners mean no harm and wish to live in peace."}