{"mid": "Scarecrow", "IMDB_id": "tt0341564", "title": "Scarecrow", "plot": "The story revolves around the relationship between two vagabonds: Max Millan (Gene Hackman), a short-tempered ex-convict, and Francis Lionel \"Lion\" Delbuchi (Al Pacino), a childlike ex-sailor. They meet on the road in California and agree to become partners in a car wash business, once they reach Pittsburgh.\nLion is on his way to Detroit to see the child he has never met and make amends with his wife Annie, to whom he has been sending all the money he made while at sea. Max agrees to make a detour on his way to Pittsburgh, where the bank that Max has been sending all his seed money is located.\nWhile visiting Max's sister in Denver, the pair's antics land them in a prison farm for a month. Max blames Lion for their being sent back to jail and shuns him. Lion is befriended by a powerful inmate named Riley (Richard Lynch), who later tries to sexually assault Lion, and while he does not succeed, physically savages and emotionally traumatizes Lion. Max rekindles his friendship with Lion, and becomes his protector, eventually exacting revenge by beating up Riley. After being released from prison the two continue to have a profound effect on each other, although they have both undergone personal transformations and their roles have shifted--with Lion still traumatized and no longer carefree and clowning, nor able even to laugh or even smile, and Max loosening up his high-strung aggression (at one point doing a tongue-in-cheek striptease to defuse a fight at a bar, and to attempt to make Lion laugh again).\nWhen the duo finally make it to Detroit, Lion finds a payphone and calls Annie, now remarried and raising their five-year-old son. Annie is still furious at Lion for having abandoned her, and lies that she miscarried their son (adding spitefully, knowing Lion is Catholic, \"He never even got born. Never got baptized. You know what that means; his soul can't go to heaven. That's what you did for your son's soul, you bastard. You sent it into limbo. That soul cannot go to heaven\"). Lion is devastated, but when he gets off the phone, he snaps into a manic state, expressing joy to Max at that he has a son. Shortly afterward, Lion has a breakdown while playing in a park with neighborhood children and becomes catatonic. Max promises Lion, now in a psychiatric hospital, that he will do anything to help him, and boards a train to Pittsburgh with a round-trip ticket."}