{"mid": "ScoobyDooWrestlemaniaMystery", "IMDB_id": "tt2337576", "title": "Scooby-Doo! WrestleMania Mystery", "plot": "Scooby-Doo and Shaggy win an all-expenses-paid stay at WWE City to watch WrestleMania after beating the hardest level of the organization's latest video game. At the insistence of the duo, Fred, Daphne, and Velma agree to join them on the trip to WWE City. Upon their arrival, the Mystery Machine crashes on a ditch after Fred narrowly avoids a crossing raccoon. The gang meets John Cena, his trainer Cookie, and Cookie's nephew, Ruben, before Cena lifts the Mystery Machine back on the road. They also encounter Bayard, a hunter who despises WWE for building their city in his forest. Cena gives the gang VIP tickets to the next event to make up for their altercation with Bayard.\nAt the show, Mr. McMahon unveils the WWE Championship belt, which has been held vacant since Kane's last match was overturned. The title is up for grabs over the weekend at WrestleMania. The gang is then offered a tour of WWE's training camp before arriving at their cabins. Later that night, Daphne and Velma overhear Ruben arguing with Cookie over not becoming a WWE wrestler because of Cookie's leg injury. Meanwhile, Scooby has a dream about wrestling giant food monsters when Shaggy wakes him up and they both encounter a monster called the Ghost Bear before running for their lives. The WWE wrestlers intervene during the chase, but Triple H and Brodus Clay are overpowered by the monster, which disappears after throwing Sin Cara's hot rod toward a water tower. The next morning, the gang is briefed by WWE executive Ms. Richards that the city has been terrorized by bear attacks over the past few weeks. Mr. McMahon asks the gang to solve the Ghost Bear mystery to ensure the security of the WWE belt. Cena and Sin Cara explain to the gang that the legend of the Ghost Bear started over 100 years ago with a wrestling bear named Vicious, who was defeated by Sin Cara's great-great-great grandfather Sin Cara Grande at the grounds that would be WWE City. Furious over its loss, Vicious vented its frustration on the town until Sin Cara Grande warded it off to a cave at the cost of a career-ending leg injury. It is believed by Sin Cara that the spirit of the bear has been stirred by WrestleMania.\nNext morning, the gang is notified by Ms. Richards that the WWE belt has been stolen, and Scooby is arrested after being caught with it around his waist, with security footage showing him caught in the act. Velma, however, proves Scooby's innocence by showing that he was in a deep state of hypnosis when he stole the belt. Ruben then deduces that the WWE video game contains light flashes that implanted post-hypnotic suggestions to Scooby's brain. Mr. McMahon offers Scooby and Shaggy a chance at freedom if they defeat Kane at WrestleMania. The duo receive a crash course training from Cookie and AJ Lee. That night, the gang and Cena wander along the forest until they reach the bear cave. Inside, they discover a room with books on hypnotism, schematics of an EMP device, and a calendar indicating that the culprit plans to target WrestleMania. Suddenly, the Ghost Bear appears and chases the gang through a storm drain. They escape after Cena slams the Ghost Bear away from them before realizing that the storm drain is directly underneath WWE City. After the gang gives Ms. Richards details on their encounter with the Ghost Bear, Cookie advises that WrestleMania should be cancelled, much to Ms. Richards' disapproval. Fred suggests that the gang uses WrestleMania to nab the Ghost Bear.\nDuring the main event, Velma deduces that the WWE belt is the EMP device. After the gang discovers that the belt is a fake and the EMP device is set to go off in 30 seconds, Cena tries to get rid of it, but it activates and shuts off the underground power generator. When the Ghost Bear appears and wreaks havoc all over the arena, the WWE wrestlers ignite green pyrotechnics to light up the stage while Scooby uses his dance moves to throw Kane off guard. The Ghost Bear arrives at ringside, but is confronted by Ruben in his wrestling attire before both combatants are launched into the ring by a floor catapult. The ring is then enclosed inside a steel cage before Cena, Sin Cara, Kane, and Ruben pin down the monster for Scooby to land a belly bomb off the top rope, leveling the ring in the process. The Ghost Bear is revealed to be Cookie, who resented WWE due to his injury ending his career too soon and plotted the perfect crime to steal the title belt using Scooby as a pawn and tarnish the organization's reputation. As Cookie is taken away by the police and Ms. Richards (who is now displeased that she was wrong about Scooby stealing the belt), Mr. McMahon offers Ruben a spot on the WWE roster before awarding the WWE belt to Scooby and Shaggy."}