{"mid": "ScoobyDooAndTheReluctantWerewolf", "IMDB_id": "tt0189072", "title": "Scooby-Doo and the Reluctant Werewolf", "plot": "Every year, all of the classic Hollywood monsters (consisting of Frankenstein's monster, his wife Repulsa, a Mummy, the Witch Sisters, Bone Jangles the Skeleton, Dr. Jekyll/Mr. Snyde, Swamp Thing, and Dragonfly) gather at Count Dracula's castle in Transylvania for the \"Monster Road Rally\", an ultimate road race similar to Wacky Races, awarding the winner with the \"Monster of the Year\" award as well as many other prizes only monsters would enjoy (and one prize — a trip to Hawaii — that none of the monsters want). This year, however, Dracula receives a postcard from the Wolfman stating that he has retired to Florida and will not be participating.\nLacking one of the most well known monsters, Dracula fears they will have to cancel the race. Luckily, Dracula's minion Wolfgang notifies him there is another option, namely, to create a new werewolf. After searching an old book for information, it is revealed that every five centuries, the moon comes into a \"perfect position\" to transform a human into a werewolf, on three nights in a row that begin the following night. The one next in line to become the next werewolf is revealed to be is none other than Shaggy Rogers, who recently demonstrated his skills on the racetrack by winning a funny car race with the help of his pet dogs that serve as his pit crew, a talking Great Dane named Scooby-Doo, and Scooby's young nephew Scrappy.\nDracula sends his hunchbacked henchmen (the mush mouthed, incomprehensible Crunch and the well-articulated British Brunch, together known as \"The Hunch Bunch\") to America to transform Shaggy into a werewolf, and bring him back to his castle. The first night, they attempt to cut a hole in the roof above Shaggy's bedroom to let the moon shine on him, but Scooby learns of their plan and rescues Shaggy just in time, but fails to convince Shaggy and Scrappy of the Hunch Bunch's presence. The second night, they go after Shaggy while at a supermarket, but they again miss their window thanks to Scooby. On the final night, while the trio is at a drive-in movie, along with Shaggy's girlfriend Googie, the Hunch Bunch manage to expose Shaggy to moonlight by dropping the sunroof of his customized race car, causing Shaggy to be finally transformed into a werewolf.\nHowever, a snafu enters the Hunch Bunch's plan when they learn that Shaggy has the hiccups, and changes between human and werewolf with each hiccup. Googie, failing to see him as a werewolf, sends him to the snack bar for something to cure his hiccups, and he attracts horror from the other movie watchers along the way. Scooby, hearing them speaking of a werewolf loose in the theater, hides in a nearby car. The Hunch Bunch attempts to grab Shaggy, who flees, and is then forced to flee from the crowd when they see him as a werewolf. Upon meeting Scooby and seeing his reflection, Shaggy flees the drive-in with his car, Scooby, Scrappy, and Googie in tow, escaping his pursuers with the car's customization. The Hunch Bunch then knocks the group out with moon dust from their \"bat-copter\" and flies back to Transylvania, towing the car.\nUpon reviving the group and quashing their hopes that the current situation is a nightmare, Dracula informs Shaggy that he was turned into a werewolf in order to fill the missing slot in his monster road rally. Shaggy, having no desire to be a werewolf, is displeased with his current situation, and refuses. Dracula tries all manner of coercion: speaking of the pre-race party and all its rewards, showing the awards for the race, imprisonment in one of the guest bedrooms, and even trapping him in a room with a needle wall. Ultimately, however, Shaggy still refuses, forcing Dracula to strike a bargain with him: if he agrees to drive in the race, and wins, Dracula will change him back to a human, and allow him and his friends to leave. Shaggy accepts the bargain.\nThey are given good lodgings and treated like guests in the castle, allowed all the food they wish for breakfast (though the food in question is flavored with \"scream beans\", much to their displeasure). Dracula then shows them the trail that Shaggy will have to follow for the race, and consents to allowing them to navigate the track in their own race car, with the Werewolf Wagon currently undergoing maintenance for Shaggy. Dracula attempts several rotten tricks on the track out of sadistic pleasure, but regardless, Shaggy completes the course expertly, creating anxiety for the vampire that he may lose his werewolf. He subsequently changes the racetrack, sabotages the Werewolf Wagon, and has the Hunch Bunch deprive him of sleep but to no avail.\nShaggy is still asleep the following morning. Googie's help revitalizes Shaggy, and upon beginning the race with Scooby in the passenger seat, he has little difficulty repairing the Wagon. The Hunch Bunch, a couple of the racers, and Dracula himself try their best to sabotage him, but thanks to Googie and Scrappy, who follow along in their own car as their pit crew, they end up doing more harm to themselves than him. At one point, the Hunch Bunch tries to dispose of the duo, forcing Shaggy to save them, but even this only serves as a minor inconvenience, and Shaggy keeps first place for most of the race. Finally, losing his temper, Dracula unleashes his trump card, a massive beast named Genghis Kong who manages to halt their progress. As the other racers near the finish line, however, Googie and Scrappy come up once more and rescue Shaggy and Scooby, then both pairs work together to make the monster fall down on the other cars, leaving an easy path to victory for Shaggy.\nDracula, furious, refuses to revert the spell, stating that there is no way to turn Shaggy back. However, after Dracula's dim-witted wife Vanna Pira unwittingly reveals that the solution of how to turn a werewolf back into a human is in Dracula's spell book, the heroes steal the book and make their getaway. Dracula chases after them in his weaponized car, and then his plane after the car is destroyed due to Shaggy's cleverness. The four only barely manage to dodge Dracula's powerful gadgets, and right before Dracula gets the best of them, a thunderstorm ensues and Dracula's plane is struck by lightning, sending him plummeting into the ocean below where he is chased off by a shark.\nIn the end, Googie uses the book to change Shaggy back to normal. That night, the gang all sit down to watch another horror movie and eating pizza, glad that their problems are over, but in the final scene, Dracula, Brunch and Crunch sneak up behind their window, and say \"We're baaaack!\"."}