{"mid": "ScoobyDooAndTheCyberChase", "IMDB_id": "tt0290057", "title": "Scooby-Doo and the Cyber Chase", "plot": "In a college computer lab run by Professor Kaufman, two of his students; Eric Staufer and Bill McLemore are working when a virtual creature - the Phantom Virus - comes out of a new game based on the Mystery Gang's past adventures and tries to attack. The next day, Mystery, Inc. themselves come to the college and learn from their friend Eric, that the virus had assumed a lifelike form thanks to an experimental laser which is able to transmit objects into cyberspace, and is now rampant across the campus. The gang goes on the hunt for the Phantom Virus, where the virus chases Scooby and Shaggy through the college. Unfortunately, the whole gang, including the virus, somehow gets pulled into the game after 'someone' activates the laser. Left with no other choice, the gang fight their way through the ten levels of mystery and adventures to complete the game in order to escape it, with the goal of finding a box of Scooby Snacks to complete each level. Their efforts are impeded on each level by the Phantom Virus. The first level is on the moon, second is in the Roman Colosseum, third is in the dinosaur age, fourth is under the sea, fifth is in a (shrunken) backyard, sixth is in ancient Japan, seventh is in ancient Egypt, eighth is in a medieval fantasy setting, and the ninth is in the North Pole.\nAfter a while, they finally reach the game's tenth and final level, where they meet their virtual counterparts (who resemble themselves from previous series, with the exception of Shaggy and Scooby). They team up to confront the Phantom Virus, who wreaks havoc across the final level and summons his friends-various villains from the gang's past including the Creeper, Jaguaro, Gator Ghoul, the Tar Monster, and Old Iron Face. To make matters worse, all the monsters are real. The climax takes the two gangs to an amusement park, where they fight off the creatures and attempt to retrieve the last box of Scooby Snax. During the fight, they use magnets to fight the virus, whom they discover is severely weakened by magnetic forces. Cyber-Scooby distracts the virus long enough for the real Scooby Doo to retrieve the Scooby Snax, beating the game, deleting the monsters, and the Phantom Virus once and for all.\nThe real gang bids farewell to their virtual selves and head home. Back in the lab, the gang reveals that they now know the culprit, who turns out to be Bill. Bill is arrested by Officer Wembley and confesses that he created the virus to scare Eric away and take all the credit for inventing the laser. He was outraged when Kaufman chose Eric's video game design over his, despite Bill being at the college two years longer, and he felt more deserving to win the cash prize at the science fair. Kaufman then protests that students alike are all equal. Bill was the one who beamed the gang into the game, hoping they would not survive because he was afraid that they would find out that he created the virus. The gang and Eric play the new Scooby-Doo game, during which Scooby interacts with the gang's virtual counterparts once again by feeding Cyber-Scooby some Scooby Snax.\nThe post-credits scene includes the gang telling what their favorite parts of the movie are."}