{"mid": "ScoobyDooOnZombieIsland", "IMDB_id": "tt0166792", "title": "Scooby-Doo on Zombie Island", "plot": "The film opens with the Mystery, Inc. gang solving the case of the Moat Monster. Becoming bored with solving mysteries, the gang goes their separate ways. Daphne Blake and Fred Jones start running a successful television series called Coast to Coast With Daphne Blake; Velma Dinkley becomes the proprietor of a mystery bookstore; Shaggy Rogers and his dog Scooby-Doo are fired from their job at an airport after eating all of the confiscated foods. For Daphne's birthday, Fred decides to get the gang back together for a road trip while Daphne is filming her show.\nAfter encountering a lot of fake monsters, the gang finally arrives in New Orleans. They are soon invited by a young woman named Lena Dupree to visit her employer's home on Moonscar Island, which is allegedly haunted by the ghost of the pirate Morgan Moonscar. Though the gang is skeptical, they go with Lena, to whom Fred has taken a fancy.\nOn the island, the gang meets Lena's employer Simone Lenoir, as well as the ferryman Jacques, and Simone's gardener Beau, to whom Daphne takes a fancy. They also meet Snakebite Scruggs, an ill-natured fisherman, and his hunting pig, Mojo. The gang sets out to prove that the \"ghost\" is a fake. Shaggy and Scooby are chased by Mojo and end up falling into a big hole, where they encounter the zombie of Morgan Moonscar. By the time the rest of gang comes to investigate, Moonscar isn't around.\nSimone invites the gang to her house to stay for the night. As the gang is dressing up for dinner, Shaggy sees the ghost of a Confederate colonel in the mirror; Simone explains that the island was a temporary headquarters for a Confederate regiment during the American Civil War. Due to Simone's cats, Shaggy and Scooby eat in the Mystery Machine, but find the food spicy and get some water from the lake, where an army of zombies emerge. Shaggy's bad driving gets the Mystery Machine stuck in the mud, forcing him and Scooby to flee on foot.\nFred and Daphne find the Mystery Machine, but no sign of Shaggy and Scooby. They argue about each other's supposed love interests and come across Shaggy and Scooby. They manage to capture a zombie, which is revealed to be real. As the zombies swarm around them, the gang splits in panic. Elsewhere, Shaggy and Scooby discover wax dolls that look like Fred, Velma, and Daphne, and they play with them, causing their friends to undertake a series of involuntary actions for a short time until they leave after disturbing a nest of bats.\nFred, Daphne, Velma, and Beau return to Simone's house and discover a secret passage under the staircase. They find Lena, who tells them that the zombies took Simone away. They find a secret chamber for voodoo rituals, where Velma finds footprints of Simone's heels and interrogates Lena about the story. Simone then appears, and she and Lena use voodoo dolls to trap the gang in the chamber before revealing themselves to be evil cat creatures. Simone explains that centuries ago, they were part of a group of settlers who were devoted to a cat god. When Moonscar and his pirates chased the settlers into a bayou filled with alligators, the vengeful Simone and Lena asked their cat god to curse Moonscar. Their wish was granted and they killed Moonscar and his crew, but the curse caused them to become cat creatures permanently, requiring that they drain life forces to preserve their immortality. Jacques joined them later on, agreeing to bring them more victims in exchange for immortality. The repentant zombies' intent was to warn the gang to leave to escape their fate.\nFinding Shaggy and Scooby, Jacques transforms into a cat creature and chases them to drain their lives. Thanks to the zombies, Shaggy and Scooby escape and accidentally tumble into the cave, interrupting the draining ceremony and distracting the cat creatures. Velma quickly unties herself and creates voodoo dolls of Simone and Lena to interrupt their ritual. When they are finally cornered, the cat creatures' curse expires, causing them to disintegrate, freeing the zombies' souls and allowing them to rest in peace. Beau is revealed to be an undercover police officer sent to investigate the disappearances on the island. Daphne offers Beau a chance to guest-star on her show and discuss the adventure. The next morning, everyone leaves the island via ferry to head back to town. In a post-credits scene, Scooby feeds the cats some milk before howling out his name to the viewers."}