{"mid": "ScoobyDooAndTheLegendOfTheVampire", "IMDB_id": "tt0357139", "title": "Scooby-Doo! And the Legend of the Vampire", "plot": "Scooby Doo, Shaggy, Daphne, Velma, Fred, and the Mystery Machine are\nvacationing in Australia. After sight-seeing in Sydney, they head for the\nOutback to attend the Vampire Rock Music Festival. Legend says that\nVampire Rock is the home of the Yoweeyahoo, an ancient Australian vampire.The events of last year's festival are making Malcolm, Daniel, and\nco-promoter Russell very nervous. Following the festival, one of the bands\ncalled Wild Wind went camping on Vampire Rock and were never heard from\nagain. Rumor has it that all three were kidnapped by the Yoweeyahoo and\nturned into vampires. Now, strange things are happening at this year's\nfestival--sounds, lights, and smoke are issuing from Vampire Rock. And\nlast night three vampires (who look like the members of Wild Wind) swooped\ndown and carried off the band members of Matt Marvellous. Most of the\nfinalists have pulled out of the contest and are going home.When Scooby and his party arrive at Vampire Rock, they are warmly\ngreeted by their friends, the Hex Girls, who are scheduled to open the\nshow. Sensing a mystery to be solved, Fred, Daphne, and Velma decide to\nform a rock group themselves and go undercover as The Meddling Kids.Next band to arrive is the Bad Omens and their rather shady manager,\nJasper Ridgeway. Fred immediately suspects them, as Jasper Ridgeway also\nmanaged Wild Wind. Fred, Daphne, and Velma go nosing around Jasper's\nmotorhome, where they find the costumes worn by Wild Wind. Scooby and\nShaggy are chased by the three vampires, who also show up during\nrehearsals and carry off The Bad Omens. That night, Russell's pick of the\nshow--Two Skinny Dudes--arrive, and Jasper immediately offers to be their\nmanager.It's finally the night of the festival. The Hex Girls start playing\nbut, during their performance, they too are kidnapped by the three\nvampires. In search of The Hex Girls, Scooby and company climb Vampire\nRock where they find a secret passage that leads into a cave holding a lot\nof stage equipment. Enter the Yoweeyahoo and the three vampires, leading\nto a long chase around the mountain. When the morning sun breaks over the\nhorizon, the Yoweeyahoo disappears in a puff of smoke, but the vampires\nstill persist. The sun doesn't seem to harm them, and running water\ndoesn't stop them either.Eventually, Daniel traps the three vampires in a net, and the\nidentities under their vampire masks are revealed. It's The Two Skinny\nDudes and Russell. No, wait! Pull off their second masks, and it's really\nWild Wind. They had planned from the beginning to scare away all the other\nbands, leaving just The Two Skinny Dudes who would also disappear during\ntheir performance to be followed by Wild Wind's triumphant return. They\nfigured the publicity would make them famous.The Yoweeyahoo, by the way, turns out to have been a hologram created\nby all the stage equipment found in the cave. [Original synopsis by bj_kuehl]"}