{"mid": "ScoobyDooPiratesAhoy", "IMDB_id": "tt0867418", "title": "Scooby-Doo! Pirates Ahoy!", "plot": "Fred is treating the Mystery Inc. gang to share in his birthday present: a mystery cruise, compliments of his parents Skip and Peggy. While preparing for the ship launch, Scooby and Shaggy have a creepy encounter with a sinister-looking cloaked man, whom the duo are sure is up to no good. The gang meet the hyper Cruise Director, Sunny St. Cloud, and the captain, Captain Crothers. The Captain says they are bound for the Bermuda Triangle, and St. Cloud promises some creepy intrigue. A montage of sloppy \"mysteries\" that are staged by St. Cloud and Captain Crothers follow, which the gang solves with ease. This peeves the other guests, who have no mysteries to solve now. Soon they rescue Rupert Garcia, a man lost at sea, who tells of an encounter with ghost pirates. The gang naturally assumes that this is a setup to another mystery. He is taken below deck as a man in a jetpack appears from the sky and lands on deck. He turns out to be Biff Wellington, an English billionaire who is known to be fun-loving yet eccentric. He plans to stay on the ship as well.\nThat night, the gang attends a costume party dinner. The creepy cloaked man appears on stage, who turns out to be Mister Mysterio, a famous hypnotist. Shaggy and Scooby are picked from the audience to demonstrate his powers, but they prove immune to his hypnotism: yet the audience falls under the trance. Mysterio dispels the hypnotism and disappears in a puff of smoke. The creepy fog then engulfs the cruise ship. The ghost pirates wreak havoc, chasing the cruise guests, who all mysteriously disappear. Skip and Peggy are kidnapped, and the pirates retreat back to the galleon and leave (after destroying the cruise ship). At this time, the gang realizes it is a real mystery, and they and Garcia are the only ones left aboard the damaged ship.\nWith his help, they follow the glowing trail left behind by the galleon and arrive in a secret harbor. There, they find Garcia's old ship, and then are captured by the ghost pirates, who take them aboard their galleon. The pirates are looking to find a meteor of mystic power, which fell into the triangle ages ago and could be pinpointed using Garcia's map. The gang is tied to the mast along with Skip, but there are no other cruise guests around.\nThe galleon enters the heart of the triangle, and begins to see past ghosts from the triangle: The USS Cyclops, Flight 19, even a sea serpent. Amidst this, the gang manages to escape and explore below deck. They find a lot of modern equipment that was used to project the ghostly images just witnessed. The ship enters an odd ring of rocks, and pulls up the meteor, which glows golden yellow.\nThe gang then engineer a trap, which fails. The pirates then attempt to re-capture the gang, leading to a trademark Scooby-Doo chase sequence, in which the entire pirate crew are captured by Scooby and Shaggy. Captain Skunkbeard is revealed to be Wellington, and Wally is revealed to be Mysterio. The rest of the pirates turn out to be the cruise guests (including the Captain, St. Cloud and Peggy), shipmates of Garcia, and past conquests of the pirates. Wellington explains that Mysterio convinced him that he was the reincarnation of a pirate years ago, and could use the meteor to teleport back in time. The crew were just hypnosis victims under Mysterio's power. Mysterio's motive was that the meteor itself was pure gold and he was going to steal it to make himself rich. Mysterio, still free, attempts to take the meteor for himself, but is stopped by Scooby.\nAt this time, a fierce storm hits, and the gang deduces the forces of the triangle want the meteor back, so they drop it back in the water, and some steering by Fred narrowly gets the galleon out of the ring as it crumbles into the sea. The cruise guests use the galleon as a large party boat as they sail back to Miami to drop off the villains to the authorities."}