{"mid": "ScoobyDooMaskOfTheBlueFalcon", "IMDB_id": "tt2586070", "title": "Scooby-Doo! Mask of the Blue Falcon", "plot": "Scooby and Shaggy take the gang to a comic book convention called the \"Mega Mondo Pop! Comic ConApalooza\" (featuring people dressing up as many Hanna-Barbera characters) to enter a costume contest as their favorite comic book superheroes, Blue Falcon and Dynomutt, Dog Wonder. Fred is eager to see the new and darker Blue Falcon film, produced by Jennifer Severin, starring Brad Adams as the new Blue Falcon. At the convention center, they meet Hank Prince, the owner of a comic book store Shaggy visits regularly, and his nephew, Austin. They also find the actor of the original Blue Falcon show, Owen Garrison. They eagerly approach Garrison to get his autograph, but instead they listen to their favorite celebrity ranting about how the studio is planning to remove all the original Blue Falcon shows for the upcoming new Blue Falcon movie.\nLater, the gang watches the trailer of the upcoming Blue Falcon movie. During the screening, a monster (who Shaggy and Scooby identify as Mr. Hyde, a villain from the original Blue Falcon television show) appears and unleashes a swarm of bats which terrorize the public. The gang offers to help investigate the situation.\nThe next day, the gang returns to the convention to wait for another Mr. Hyde attack. The gang meets Jack Rabble, who makes a living signing autographs. They first show the others a recording of Severin boasting how the Mr. Hyde incident has been increasing publicity for the Blue Falcon movie. The second footage has Adams talking about how he dislikes his role as the new Blue Falcon and hopes that Mr. Hyde will draw the public’s attention away from him giving him a chance to quit. They also found out from Austin that the Mr. Hyde attacks are based on original Blue Falcon episodes and that Mr. Hyde uses green ooze that turns people into monsters in his next appearance.\nMeanwhile, Scooby and Shaggy flee into the storage rooms where they find Mr. Hyde’s secret lair. Mr. Hyde chases them onto a big Frankenstein Jr. balloon, which he uses to fly across San De Pedro. Mr. Hyde unleashes his green ooze on the entire town and at city hall, oozing Scooby, Shaggy, and the mayor. Angered and humiliated by this assault, the mayor fires the gang.\nLater on, the gang watch a news report and learn that the premiere of the new Blue Falcon movie will now be held at the baseball stadium. The gang heads back to the convention center, and Austin manages to acquire entry for them. With Jack Rabble’s help, Fred, Velma and Daphne find Mr. Hyde’s hideout and discover that Mr. Hyde has surveillance cameras of the whole convention center and the baseball stadium. From there, they see a giant Mr. Hyde rampaging in the stadium.\nMeanwhile, as they seek something to eat, Scooby and Shaggy see people fleeing away from the stadium, causing them to run into the stadium and find the giant Mr. Hyde chasing Austin. Scooby regains his superhero mentality and rushes to confront Mr. Hyde. Scooby and Shaggy manage to rescue Austin, but they are booted into the air by the giant Mr. Hyde. Fred, Velma and Daphne arrive and manage to bring down the giant Hyde. They find Garrison in the giant robot, suggesting that he was Mr. Hyde all along. However Garrison claims that someone knocked him out and placed him inside the robot.\nScooby and Shaggy witness the real Mr. Hyde stealing an armored vehicle. Scooby pursues Mr. Hyde and causes the vehicle to crash into the giant Mr. Hyde robot. Mr. Hyde then unleashes his Hideous Hyde Hound on Scooby. Garrison, while wearing the original Blue Falcon uniform, saves Scooby, destroys the Hideous Hyde Hound using the Falcon Car, and stops Mr. Hyde from escaping. The gang unmasks the real Mr. Hyde, who turns out to be Jack Rabble.\nRabble explained that he was in a RC combat league but was kicked out when one of his robots went haywire and destroyed the arena. It was during his autograph career when he devised a plan of revenge. He built the Mr. Hyde robot to attack the convention to force the movie premiere into the stadium. He then put Garrison's knocked out body in the giant Hyde robot to frame him in the stadium attack. The attack would then also force a detour for the armored truck he was targeting for it was carrying more than $5,000,000 from the entrance fees for the convention. Impressed by the action following Jack Rabble's arrest, Severin makes a sequel to the new Blue Falcon film with Garrison as Blue Falcon and Scooby-Doo as Dynomutt."}