{"mid": "ScoobyDooAndTheGoblinKing", "IMDB_id": "tt1295021", "title": "Scooby-Doo and the Goblin King", "plot": "The Mystery, Inc. gang visit a Halloween carnival on Halloween night. When the magician \"The Amazing Krudsky\" (voiced by Wayne Knight) does not allow Scooby to see his show, he and Shaggy accidentally expose Krudsky as a fraud during one of his acts, resulting in the gang getting kicked out of the carnival. The rebellious Fairy Princess Willow (voiced by Hayden Panettiere) later enters Krudsky's tent, where he secretly reveals his wishes to become a real magician. The fairy inadvertently causes Krudsky to notice her on the Goblin Scepter in a spell book, which can be combined with fairy magic to control Halloween. Krudsky then gets an idea to obtain the scepter and rule the world with it. Willow decides to toy with him, but while flying, she accidentally slams her small body against a metal chair knocking her out; Krudsky then crushes her with his flyswatter. When he notices her cry of pain from being crushed, he sees that she is a real fairy, kidnaps her, and absorbs her magical powers, thus becoming a real magician.\nMeanwhile, Scooby-Doo and the gang go trick-or-treating all night. Shaggy's and Scooby's last stop is a spooky looking house which claims to be a \"genuine magic shoppe\". However, a very loud thunderstorm also begins, frightening the heroes. Inside, they meet the kind Mr. Gibbles (voiced by Wallace Shawn), who reveals that magic really does exist. At that moment, Willow enters being chased by Krudsky; he captures her and turns Gibbles into a rabbit, and steals the magic equipment before leaving. Mr. Gibbles explains to an astonished Shaggy and Scooby that Krudsky, after capturing the good magic of the princess, will now want the bad magic held in the scepter of the Goblin King, which will, as well, cause an imbalance in the supernatural order which will make Halloween remain forever and as a result will turn every human into horrifying monsters. Shaggy and Scooby board the Grim Reaper Railway which flies them to the spirit world. Once they arrive, the two realize that they need to get the scepter before Krudsky can, and return home before sunrise or else they will be trapped in the magic world forever. Before they depart, Gibbles gives them magic cards that perform spells just by reading the inscription on each one; however, they have to be saved for emergencies because each card can only be used once and each spell is temporary. To make it less suspicious-looking, Shaggy and Scooby are magically disguised by being transformed into monster-like versions of themselves.\nWhile looking for Shaggy and Scooby, Fred, Daphne and Velma see Krudsky conversing with the Goblin King through a mirror where the Goblin King (voiced by Tim Curry) agrees to exchange his scepter for Princess Willow at midnight at a clock tower. However, seeing that all the evil magic and the Goblin King are real causes Velma's rational mind to shut down; Fred and Daphne leave Velma to rest and go to the tower and set a trap for the Goblin King and Krudsky.\nBack in the magic world, Shaggy and Scooby go to a bar owned by a werewolf (also voiced by Tim Curry). During the song \"Bump in the Night\", Shaggy adds in the lyric on how to get to the Goblin King's castle. Shaggy and Scooby-Doo find that everyone is afraid of the Goblin King and will not help them upon running off. The Goblin King's two bumbling goblin henchmen, Glob and Glum (voiced by James Belushi and Larry Joe Campbell), attempt to capture Scooby and Shaggy, but the latter two are saved by Jack O'Lantern (voiced by Jay Leno), a living pumpkin who leads them to three witches while running away from the Headless Horseman. Along the way, they avoid the chasing monster (who was Jack's former body) by heading across a covered bridge which he cannot cross. The three of them arrive at the Witches' Hut where they meet the Grand Witch (voiced by Lauren Bacall) and her two fellow witches (voiced by Grey DeLisle and Russi Taylor). The witches send Shaggy and Scooby on a ride on their flying broomstick named \"Broomy\" towards the Goblin King's castle, but they are shot down by Glob and Glum by a goblin gun-like cannon.\nLanding in a fairy village, Shaggy and Scooby find three fairies named Sparkplug, Honeybee and Tiddlywink, who help them to the Goblin King's castle entrance. Reluctantly using a potion from the witches (made from someone called \"Scratch\"), Shaggy and Scooby disguise themselves as Daphne (Shaggy) and Velma (Scooby) in order for Glob and Glum to let them into the castle. Only a few minutes away from midnight, Shaggy and Scooby try to run off with the scepter, but are captured and sent to the dungeon by the Goblin King who heads off to meet with Krudsky. At the clock tower, Krudsky and the Goblin King are almost through with their trade when Fred and Daphne release a trap and run off with the princess. But the trap only catches the Goblin King and Krudsky takes the scepter, turning himself into the new Goblin King before turning the Goblin King into a goose.\nKrudsky and his new goblin army set off to take over the world. He turns the Mystery Machine into a living monster vehicle to chase Fred, Daphne, and the now-awakened Velma. They capture the three and Krudsky uses his powers to turn Fred into a vampire, Daphne into a witch, and Velma into a werewolf (respectively). At that moment, Scooby, Shaggy and Jack O'Lantern arrive having been saved from the dungeon before sunrise by the fairies and Broomy. Jack apparently sacrifices himself to strip Krudsky of the staff of which Scooby uses to break Krudsky's spells, restoring his friends, the Mystery Machine and Mr. Gibbles, and the Goblin King back to normal where he reclaims his staff from Scooby-Doo and then uses his restored powers to imprison Krudsky.\nThe Goblin King is revealed to be Willow's father who holds her responsible for all the trouble caused and grounds her for a year, though he does admits that he is relieved to have her back. Mr. Gibbles brings Jack back to life with the Goblin King's help, who then takes Krudsky prisoner for both his crimes and treachery (the Goblin King tells him that he will have plenty of time to \"work on his act\"). He, the goblin army, Willow, Jack, Broomy and Mr. Gibbles all return to the magical world. But before departing and to also keep the balance between the worlds, the Goblin King uses one final spell to erase the memory of the events from Fred's, Daphne's, Velma's, and the others' minds. However, Scooby and Shaggy are allowed to keep theirs as they have proven their courage.\nAs morning comes, Fred, Daphne and Velma forget what transpired (due to the effects of the memory-erasing spell) as Shaggy and Scooby-Doo come to pick them up. As the carnival packs up, Scooby uses an unpacked mirror one last time to spook the gang as the film ends."}