{"mid": "ScoobyDooAndTheWitchsGhost", "IMDB_id": "tt0196931", "title": "Scooby-Doo and the Witch's Ghost", "plot": "After Ben Ravencroft, a famous horror writer of whom Velma Dinkley is a huge fan, assists her and the Mystery Gang in solving a case at a museum, he invites them to his hometown, Oakhaven, Massachusetts. When they arrive, they find the town converted into a tourist attraction by Mayor Corey, complete with 17th-century replicas and attractions based on the alleged ghost of Sarah Ravencroft, an ancestor of Ben's who was persecuted as a witch and executed by the Puritan townspeople in 1657. Ben disputes this, claiming Sarah to be a Wiccan who used natural herbs to heal people and reveals for years he has been searching for Sarah's medical journal to prove her innocence.\nScooby-Doo and Shaggy Rogers are chased by a witch and run into Ben and the gang. They find broken tree branches at the scene and are drawn to an all-female Gothic rock band, The Hex Girls, led by Sally \"Thorn\" McKnight. The gang then decides to split up; Fred and Daphne stay to watch the Hex Girls, Velma and Ben go explore an old barn and Shaggy and Scooby follow the Mayor. Fred and Daphne see Thorn doing some sort of ritual and are convinced the Hex Girls are witches. Velma and Ben find a cherry picker truck in the barn. Scooby and Shaggy follow Corey, until they encounter the witch and flee to the gang.\nThe gang, the Hex Girls and Ben meet in the woods. The witch appears and gives chase, but is captured by Velma. The witch is revealed to be Mr. McKnight, who is Thorn's father. Velma locates the truck and explains that the truck's arm made the witch appear to fly, with the townspeople jointly involved. Ben scolds everyone involved for exploiting Sarah's good name. Back at Ben's house, Fred and Daphne apologize to the Hex Girls and Thorn explains the \"ritual\" was for soothing her vocal cords and that she is actually descended from Wiccans. Corey and Mr. McKnight arrive to apologize to Ben for using his ancestor in their publicity stunt, explaining the witch was to boost the town's failing tourist economy and that they found inspiration from digging up the head marker for Sarah's grave; they kept it secret just not to upset Ben. It is then recalled that Scooby found what appeared to be a shoe buckle earlier, which was actually from Sarah's diary.\nEveryone goes to the buckle's location, where Scooby discovers the buried book, which is actually a spell book. Ben reveals that Sarah was indeed a witch, who wielded her terrible and evil magic against many people before the Wiccans used their powers with nature to imprison her within her own spell book. He created the mystery at the museum and engineered the encounters with the gang, as he knew they could lead him to the book. After taking the book from Ben, the gang attempts to flee in the Mystery Machine, but Ben (with his newly acquired powers) renders the Mystery Machine useless by damaging its tires. Ben takes back the book and finally summons Sarah. However, he soon discovers that she has no loyalty to him and her ambitions are to destroy the world, rather than rule it alongside him.\nDisillusioned, Ben attempts to imprison Sarah, but she tells him that only a Wiccan could defeat her, and imprisons Ben in a magical sphere. The gang launches an attempt to get the book while Sarah begins to turn pumpkins, trees, and a turkey into monsters in order to stop them. Daphne and Velma free the Hex Girls and Velma convinces Thorn to use her inherited Wiccan power to read the spell to banish Sarah into her imprisonment. However, Sarah manages to pull Ben in to make him suffer her fate with her, and they are both imprisoned inside the book. A burning branch falls onto the book, destroying it, ensuring that the Ravencrofts can never return. All of the monsters that Sarah had created have also returned to normal. The gang and townsfolk celebrate their deliverance with a concert from the Hex Girls with Scooby Doo and the gang (and the still-gigantic turkey) joining in on the performance."}