{"mid": "ScoobyDooAndTheAlienInvaders", "IMDB_id": "tt0253658", "title": "Scooby-Doo and the Alien Invaders", "plot": "The Mystery Machine is driving through a desert in Roswell, New Mexico. A sandstorm comes up and Shaggy Rogers makes a wrong turn onto government property. Seeing a UFO causes Shaggy to lose control of the vehicle and the gang find themselves on the outskirts of a small town. While Scooby-Doo and Shaggy stay with the van, the rest of the gang enters a local diner to get directions. Shaggy and Scooby then see a mythical animal called a jackalope. The jackalope takes their last Scooby Snack and they chase it into a cave, where they encounter aliens. They run into the diner in panic, claiming to have seen aliens.\nThe waitress, Dottie, says that they never see aliens but do see strange lights and hear sounds at night. The chef, Sergio, says that a month earlier local cattle vanished without a trace and a lot of people moved away. A man named Lester claims to have been abducted and he believes the two. He also claims to have pictures, so the gang goes to his house to see them. However, they are nothing more than paintings by Lester. He then refers to SALF: the Search for Alien Life Forms (similar to S.E.T.I.), dishes, saying that ever since they were installed, there have been numerous UFO sightings and disappearing livestock.\nThe gang stays overnight at Lester's home where Daphne Blake and Velma Dinkley sleep in a bunk bed and Fred Jones sleeps on the couch. Scooby and Shaggy fall into a deep sleep on the roof and are abducted. The aliens try to examine the two, but Scooby is able to free them. After being cornered by the aliens when they try to escape, they pass out. They are awakened in the middle of the desert by a hippie photographer named Crystal, and her golden retriever, Amber. Shaggy and Scooby immediately fall in love with them, and when they meet up with Fred and the girls at the local diner, the two of them are still so love struck after seeing Crystal and Amber that they are not even hungry, which shocks Fred, Daphne, and Velma.\nFred, Daphne, and Velma meet the crew of SALF, Steve, Laura, and Max, while Shaggy and Scooby hang out with Crystal and Amber. Velma becomes suspicious when she sees dried mud on the boots of Steve, Laura, and Max since they are in the desert. She later takes the gang to a canyon where she believes a seasonal river runs. The canyon proves to be dry, but they find caves, mining equipment and on the cave walls, gold. The SALF crew capture and tie them up. The crew explains that they stumbled on the gold cave while searching for a new location for another SALF dish. Since the gold cave was on government land, they decided to keep the secret for themselves, and they planned to keep it that way. They are also exposed as the \"aliens\" who abducted Scooby and Shaggy, with the UFO being nothing more than a dressed-up helicopter, and the inside of the UFO being an old movie set. Shaggy, Scooby, Crystal and Amber also investigate the cave in the canyon and find the gang and try to rescue them.\nEventually, Crystal and Amber reveal themselves to be the actual aliens from a planet 20 light years away. They dressed like hippies because their only information about Earth came from 1960s television broadcasts, and they assumed that the people of Earth still talked and dressed like those from the 1960s. The UFO that ran the Mystery Gang off the road was actually Crystal and Amber's spaceship. The gang, Crystal, and Amber manage to stop the SALF crew from escaping and tie them up. The SALF crew and their accomplices are arrested, and Crystal and Amber return to their homeworld after a heartfelt goodbye. Shaggy and Scooby are brokenhearted, but a box of Scooby Snacks helps them forget about their sorrows.\nIn a post-credits scene, Scooby-Doo scares the viewer in an alien costume."}