{"mid": "ScoobyDooMoonMonsterMadness", "IMDB_id": "tt4215766", "title": "Scooby-Doo! Moon Monster Madness", "plot": "The film opens with Daphne trying to pass her driver's test and get her license. She is in the Mystery Machine. Velma tells her she can do it, yet despite the encouragements, Daphne crashes the van into a tree. Later she and Velma win a lottery that takes people into space. The two girls soon find themselves going into space along with billionaire Sly Baron, trained astronaut Shannon Lucas, retired astronauts Zip Elvin and Colt Steelcase, alien hunting specialist Ridley, football player Uvininous \"U-boat\" Botango, news reporter Clark Sparkman (who instantly takes a fancy to Velma, much to her annoyance) and of course Fred, Shaggy and Scooby-Doo. Fred allies himself with Zip and Colt, much to their dismay. Shaggy and Scooby are happy to see U-boat. Shannon tells Daphne that she scored the highest on the space test she and her friends took, much to Velma's surprise. This causes Velma to become bitter towards Daphne.\nSoon everyone is boarding Sly's ship, The Sly Star One and they blast off into space. Once in space, they meet a robot named H.A.M whose sense of humor is horrible and dark. After a while, a mysterious alien starts messing with the ship, causing it to land on Sly's space resort, situated on the dark side of the moon. There they are greeted by Sly's twin brother Hudson and some Sly Bots. Afterwards Scooby and Shaggy go to find some food while their friends go to find the alien. Velma's bitterness towards Daphne increases, causing a rift in their friendship. Fred continues to annoy Zip and Colt. Scooby and Shaggy are briefly chased by the alien and then meet up with U-boat who tells them that when they're scared, they should think of something that doesn't scare them. After a while Fred decides to trap the alien. During the plan to trap the alien, Daphne and Velma still continue to argue and Velma finally says that she wonders what if Daphne is the astronaut.\nAfterwards, the gang later catches the alien and it is revealed to be Shannon who states that she wanted to convince people on Earth that space travel isn't safe for amateurs and should be left to professionals. She used her alien costume to make that happen and most of the other characters Scooby and his friends had met during the course of the movie to unknowingly go along in her plan. She then realized that with Scooby and his friends abroad, they would prove the alien hoax and foil her scheme and had to make it hard for them to work together. So she reveals that she lied about Daphne getting the highest score, knowing it would put a strain on her and Velma's friendship, and reveals that it was actually Shaggy who got the highest score (much to everyone's--including Velma and Shaggy's--surprise). She traps the heroes behind a wall of glass, telling them she planted explosive devices all over the resort to blow it up. She heads back to the now repaired Sly Star One and get back to earth alone, leaving the others to their deaths.\nHam reveals that he isn't really a robot but an actor. The gang quickly manage to escape the glass wall and rush into an exact copy of the Sly Star One, built by Hudson. However the tank is broken. Luckily Zip and Colt go to hold it down and they allow Fred to help them, finally accepting him. When the others wonder who will fly the ship, everyone is knocked by pieces of falling metal. Velma tells Daphne she has to fly them home. At first, Daphne protests, but Velma assures her she believes she can do it because she is her best friend.\nUpon hearing Velma's kind words of encouragement, Daphne manages to get the ship off the ground and fly everyone home. Once home, the heroes confront Shannon and expose her scheme. She is taken to prison. Once Shannon is taken away, Daphne and Velma reconcile. The movie ends with Daphne once again driving the Mystery Machine with all her friends."}