{"mid": "ScoobyDooAndTheMonsterOfMexico", "IMDB_id": "tt0369903", "title": "Scooby-Doo! and the Monster of Mexico", "plot": "Fred's pen-pal, Alejo Otero, a man who lives in Veracruz, Mexico, invites Fred and the rest of the gang to visit him and his family there. Fred and the rest of the gang talk about it until they decide to go. However, after Alejo sent the invitation to Fred, a big long-haired monster started to terrorize the population of Veracruz. Alejo and his young son, Jorge, and their pet Chihuahua, Chiquita, see the monster, and the locals start calling him \"El Chupacabra\".\nLater, when Mystery, Inc. arrives in Veracruz, they meet Alejo, who recognizes them all from Fred's letters. Alejo and his family run a huge and fancy hotel, and he shows them around and where they will be staying. He then introduces to them his family, which includes his wife, Sofia, his mother, Doña Dolores, his brother Luis, and Luis's fiancée, Charlene, who is originally from the United States. He also introduces the gang to visiting family members, while doing so, Scooby and Chiquita meet and fall in love. Luis tells the gang he met Charlene when he visited America, at a theme park run by Mr. Smiley. The gang and the Otero family enjoy a meal, and Dolores talks about her late husband. Then, a man named Señor Fuente arrives and asks to speak with Alejo and Luis. Dolores tells the gang that Fuente has been trying to get her to sell the hotel to him ever since her husband died the previous year. Meanwhile, Alejo and Luis tell Fuente once again that they do not want to sell the hotel. Fuente leaves, and the family go inside because of a fierce storm. When inside, Alejo's forced to tell the gang about El Chupacabra. He says that he does not have many other guests besides the gang because El Chupacabra has been scaring them away. Luis and Charlene tell the gang to lock their doors when they go to sleep.\nDuring the night, Shaggy and Scooby-Doo are scared when they think they hear a noise. They then hear a loud growl and run screaming out of their cottage. They wake up Fred, Velma and Daphne. After seeing footprints outside of Shaggy and Scooby's window, Fred declares that there's a mystery they have to solve. The next day, the gang and the Otero brothers set out to search for El Chupacabra. Charlene gives Luis a charm for good luck. Daphne interviews the townspeople, but none of them are able to find El Chupacabra. When they get back to the Mystery Machine, they find someone has written a threat on it, basically telling them to get out of solving the mystery. The gang realizes this is serious and decide to search at night. Fred, Velma and Daphne go one way, Alejo and Luis go another way, and Shaggy and Scooby stay at the Mystery Machine.\nAt night, Shaggy and Scooby sleep in the van, while someone drains their brake fluid. Fred, Velma and Daphne search the woods, and find El Curandero, a medicine man. El Curandero tells them they need to look at history and that they are in grave danger. Meanwhile, Alejo and Luis are searching when Alejo sees El Chupacabra. Alejo is chased and nearly falls off a cliff, but he manages to hold on and lost his sunglasses. He calls for Luis, but there is no answer. El Chupacabra disappears, and Luis shows up, saying he was knocked on the head by El Chupacabra. Luis helps his brother up from the cliff.\nShaggy and Scooby start driving, but when they realize they cannot stop, they get scared. They meet up with Fred, Velma, Daphne, Alejo and Luis, who were being chased by El Chupacabra. Eventually, the van runs out of gas and stops right in front of a gas station. The Mystery Machine gets fixed, and Alejo gets some ice for Luis's head wound, but Luis does not have a bump on his head. Luis says he is fine. The gang drives along and finds a sign to a history museum, and thinking that is what the medicine man said, go to it. When they get there, they meet a suspicious and hyper museum guide who leads them into an auditorium. There they see a performance about ancient Mexican customs. The guide then makes Daphne volunteer, and she kidnaps her, vanishing with a puff of smoke. The rest of the gang find a secret passageway and follow it, until they come to Aztec pyramids. They find Daphne at the top of one and rescue her, but the tourists chase after them, thinking they have vandalized a statue. After a long chase scene and fights against living statues, they finally return home.\nThe next day is the Day of the Dead, and all go to the cemetery, where Dolores informs them that Charlene has been captured by El Chupacabra. The family gives offerings to the grave of Señor Otero and hope Charlene can be found. Suddenly, the ghost of Señor Otero comes out of his grave and tells them to sell the hotel and the land or they will be in danger. At the same time, Fred just revealed the good luck charm Luis has is really a tracking device instead of an ancient medallion. The family cannot believe that Señor Otero would want them to sell, but Scooby and Alejo realizes something is suspicious. He and Chiquita follows a beeping noise that is actives by pushing the button from the tracking device until they find a man in a skeleton suit controlling the ghost. The gang catches him, and he is revealed to be Mr. Smiley. Then, El Chupacabra appears and scares everyone.\nAfter chasing the gang, El Chupacabra is caught up in some wiring. The gang pulls off the mask, and it is revealed the museum guide they saw earlier is El Chupacabra. She tells them she loves Mr. Smiley and that they were going to get all the land. Luis asks what happened to Charlene, and the guide tells him he will never see her again and he should forget about her. Velma then guesses something is up and realizes the head the guide has is a mask, and pulls it off to reveal that Charlene was the guide and El Chupacabra. Fred says that the message written on the Mystery Machine (\"Sal ahora o no veras el dia de manana!\" - Leave today or you won't see tomorrow!) wasn't written in proper Spanish, so whoever made the threat had to have been someone who could not understand the language. Señor Fuente then comes in and says that even though he wanted to buy the Otero family's land, he eventually came to respect the fact that they did not want to sell it.\nMr. Smiley, however, refused to accept this and decided to ruin the business by scaring away all their customers with his lover dressed as El Chupacabra. Fuente explains that he learned of Mr. Smiley and Charlene's plans and wanted to warn the Oteros and Mystery Inc. of what was really going on. Charlene and Mr. Smiley are arrested and taken to jail, and Luis admits that the real reason he didn't come to Alejo's rescue because he was paralyzed with fear — after their father died the previous year, Luis was afraid of losing Alejo, so he lied by saying that El Chupacabra had knocked him unconscious. Alejo comforts Luis and assures him that there are worse things than being a coward, to which Shaggy adds how he has \"made a career out of it.\" In the end, everybody enjoys the Day of the Dead festivities."}