{"mid": "ScoobyDooAndTheLochNessMonster", "IMDB_id": "tt0418141", "title": "Scooby-Doo and the Loch Ness Monster", "plot": "The Mystery, Inc. gang travel to Loch Ness in Scotland to see the famous Blake Castle, the home of Daphne Blake's Scottish ancestors as well as her cousin, Shannon. The castle grounds are home to the first annual Highland games, composed of many traditional Scottish sports. When they arrive, Shannon informs them that the castle has recently been terrorized by the Loch Ness Monster. Shannon says she has seen the monster and it is indeed real, a position shared by Del Chillman, the Loch Ness Monster enthusiast and amateur cryptozoologist, and Professor Fiona Pembrooke, a scientist who has stalked her whole career on proving the monster exists. Taking the opposite end of the argument are Colin and Angus Haggart, their father Lachlan, local competitors in the games, and Sir Ian Locksley, the head judge of the games (as well as director of the Scottish natural history museum). Locksley and Pembrooke share a mutual hatred for each other (she was Ian's research assistant at his museum until he fired her for spending too much time on the Loch Ness Monster's trail).\nThat night, Scooby-Doo and Shaggy are chased by the monster, and destroy the playing field in the process. Velma discovers that the Loch Ness Monster tracks head into town instead of the loch. The next day, the gang and Shannon travel to Drumnadrochit. After enlisting the help of the Haggarty's to rebuild the field, Fred, Daphne, Velma and Shannon take Professor Pembrooke's boat, filled up with out of date research equipment, to search for the Loch Ness Monster by sea, while Shaggy and Scooby take the Mystery Machine and search by land. While Shaggy is distracted, a hand switches a sign on the road leading to Shaggy getting lost. Both groups are attacked by the Loch Ness Monster, which is seemingly in two places at once.\nAfter returning the badly damaged boat back to Professor Pembrooke, the gang discovers Sir Ian has taken it upon himself to patrol the waters with a high-tech ship to prevent any further \"peculiarities\", as he is still not convinced of the monster's existence. On Locksley's ship, the gang and Shannon find something deep in the loch using sonar equipment. They take Locksley's mini-sub down to investigate. In the water, the gang is attacked by the Loch Ness Monster, but is saved by a large magnet claw on the ship (before reaching the surface, the Loch Ness Monster knocks the submarine's sonar camera off of its hull). When they return to Blake Castle, they find Del sleeping in the Mystery Machine, who explains his van has been stolen. The Loch Ness Monster later chases the gang, Shannon and Del into a bog, where it is revealed to simply be a canvas covering Chillman’s van. Fred deduces the Loch Ness Monster to be a decoy, and sets up a trap to catch the real one.\nFred sends Shaggy and Scooby out on the loch to act as bait, while he and Del prepare to use nets to surround the cove to capture the Loch Ness Monster. A large fog appears, blocking visual contact with Shaggy and Scooby. Making matters worse, Locksley’s crew mutinies because they want to capture and sell the Loch Ness Monster, and capture Daphne, Shannon, and Locksley himself. The Loch Ness Monster attacks Shaggy and Scooby, chasing them out of the cove. Locksley’s ship attaches to the nets, dragging Del and Fred with it. The crew attempts to harpoon the Loch Ness Monster, but Daphne and Shannon distract them long enough to make them miss. Just as the Loch Ness Monster is about to attack Del, Fred, and Locksley Daphne captures it by using the ship’s magnetic claw. All of a sudden, a second Loch Ness Monster appears and gives chase to Shaggy and Scooby, but falls into a previously set trap. This monster is revealed to be a huge puppet controlled by the Haggart brothers, and the one Daphne captured is revealed to be a home-made submarine operated by Professor Pembrooke. Pembrooke used a secret entrance in her boat to go into the Loch Ness Monster and operate it. She also hired the Haggart brothers to man the second monster on the assumption that they wanted to sabotage the games, but Angus and Colin reveal that they just wanted to do it as a prank. Velma explains that Pembrooke’s plan was to use her machine to convince Locksley the real monster existed, and enlist his aide in finding it.\nThe next day, the games begin on schedule, but Locksley calls everyone to his ship to look at new pictures of the monster that his mini-sub's sunken (and yet obviously still working) camera had taken, at a depth well below what a ramshackle home-made submarine like Pembrooke's could survive. These, plus three other photos that Pembrooke had taken several days earlier are enough to convince him that the Loch Ness Monster might be real. The film ends with the gang leaving Blake Castle, during which Velma admits that she is actually glad they didn't find out if the Loch Ness Monster was real. Velma's reason for this being, \"Some mysteries are best left unsolved.\" The final scene shows Scooby briefly seeing what could be the real Loch Ness Monster swimming by them in the water."}