{"mid": "ScoobyDooAndKissRockAndRollMystery", "IMDB_id": "tt4717798", "title": "Scooby-Doo! And Kiss: Rock and Roll Mystery", "plot": "Fred, Daphne, Velma, Shaggy and Scooby-Doo are traveling to an amusement park called Kiss World to see Kiss at their big Halloween concert and solve a mystery, mostly because Daphne has a crush on Starchild (Paul Stanley), much to Fred's jealousy.\nAfter Scooby and the gang arrive, security chief and former government defense employee Delilah Domino refuses to let them in. So they sneak in and are caught by Delilah. At that moment, KISS arrives, and after the gang explains that they are there to help, they tell her the kids are free to stay. However, The Demon (Gene Simmons) is against Scooby and the gang staying, because when Scooby and Shaggy first saw him, Scooby squirted him with a water gun. Shaggy and Scooby are chased by an entity; fortunately, Kiss comes to their aid. They tell the gang that the entity chasing Shaggy and Scooby is called the Crimson Witch, and she has been terrorizing the park for a while, and they need her gone before the concert.\nA strange fortune teller named Chikara says that the witch is from an alternate universe called Kissteria and plans to use the black diamond that Kiss uses in their hit song \"Detroit Rock City\" to summon a monster called The Destroyer to destroy the earth, which Velma finds hard to believe. In order to stop the Crimson Witch, the gang uses the diamond to lure the witch. However, the Crimson Witch chases them through a portal to KISSteria to get the black diamond. She manages to get the diamond and unleash The Destroyer, but the gang and Kiss arrive to stop The Destroyer.\nWhile Kiss performs at their concert, Scooby and his friends use a spaceship to defeat The Destroyer. The gang then return to Earth, where they wake up believing that the witch's gas caused them all to have a hallucination. They unmask the Crimson Witch as Delilah, who wished to sell the black diamond (needed for laser technology) to a competing defense company to get back at her former employers.\nLater, Starchild (Stanley) kisses Daphne right in front of Fred. Daphne then gives Fred a kiss on the cheek, much to his delight. The Demon (Simmons) gives Shaggy and Scooby a smile. Shaggy and Scooby then see Kiss fly away with the black diamond. Shaggy asks Scooby if they should tell Velma about what they saw. However, Scooby suggests they do not, stating \"Why rock her world?\""}