{"mid": "ScoobyDooMeetsTheBooBrothers", "IMDB_id": "tt0189070", "title": "Scooby-Doo Meets the Boo Brothers", "plot": "Shaggy discovers that his uncle Colonel Beauregard has died and left him his country estate, which is on a plantation. After being chased away by a ghost witch, Shaggy, Scooby and Scrappy head for the estate in order to claim Shaggy's inheritance. Before they can get there, they meet Sheriff Rufus Buzby, who warns them about the whole estate being haunted and that they should leave. Before he can fully convince them, he receives a call from the police chief, notifying him that a circus train has derailed and a circus ape has escaped. Leaving Shaggy, Scooby and Scrappy, they continue driving, but upon their arrival they are pursued by a headless horseman, a ghost wolf and by the alleged ghost of the Colonel who taunts them, telling them to leave or else they will face the consequences.\nThey also meet the creepy manservant Farquard who tells them that a vast fortune in jewels is hidden somewhere on the estate, which he believes is rightfully his and that Shaggy has no business there. Initially, Shaggy wants to leave, but before they can do that, his truck sinks into quicksand, forcing him, Scooby and Scrappy to spend the night there. With ghosts haunting the place, Scrappy has the idea to call a group of ghost exterminators called The Boo Brothers. To the guys' surprise, the exterminators themselves are ghosts, who proceed to hunt down the ghosts that are haunting the estate, with little success. On top of all, Shaggy meets Sadie Mae Scroggins and her shotgun totting, older brother Billy Bob Scroggins, whose family has an old feud with the colonel. After knowing that Shaggy is related to the colonel, Sadie falls in love with him, and Billy Bob wants to shoot him.\nAfter things calm down a little, Shaggy, Scooby and Scrappy decide to go to the kitchen to eat something, only to find proof that the famous fortune in jewels is real, when they find a diamond with a clue to a treasure hunt. Intrigued by that very first clue, the gang decides to hunt down the rest of the jewels much to Farquard's chagrin and Sheriff Buzby, who is on the trail of an escaped circus ape, and is skeptical about the jewels' existence. They follow the trail through a number of clues that the Colonel has hidden for them, which takes them to several different points in the mansion and also in the rest of the plantation. As they progress in their treasure hunt, things become harder, with numerous ghosts appearing, including the ghost of Colonel Beauregard, the Headless Horseman and the Skull Ghost. To make matters worse, they also have to deal with Billy Bob Scroggins and his sister Sadie Mae, and the escaped Ape, who keep showing up. On top of that, the Boo Brothers reveal themselves incapable of getting rid of any ghost, only causing more mayhem whenever they try to help.\nAfter much treasure hunting, they finally find the last clue, revealing that the treasure is hidden in the mansion's fireplace, much to the happiness of the Skull Ghost, who holds the gang at gun point, and tries to claim it for himself. After catching him, they find out that the person behind the Skull Ghost is the Sheriff. As they unmask the ghost, the real Sheriff comes in, revealing that the Skull Ghost is actually his greedy twin brother, T.J. Buzby impersonating him, as well as the remaining ghosts that were haunting the place. With the treasure found, Shaggy is taken by the Boo Brothers' story that they need a home to haunt, so he turns the mansion over to them and the treasure is put into the Beauregard Trust Fund for Orphans. Saying their goodbyes, Shaggy and the dogs drive back home. Along the way, they encounter once more the ghost of Colonel Beauregard, which Shaggy thinks is another prank of Scooby's, until he realises it's real, and speeds away as fast as possible."}