{"mid": "ScoobyDoo", "IMDB_id": "tt0267913", "title": "Scooby-Doo", "plot": "The members of Mystery, Inc. solve the case of the Luna Ghost at the Wow-O-Toy Factory. However, long-time friction between Fred Jones, Daphne Blake, and Velma Dinkley finally boils over and the gang break up, leaving Shaggy Rogers and his dog Scooby-Doo heartbroken. Two years on, Shaggy and Scooby are invited to solve a mystery on the popular resort Spooky Island, owned by Emil Mondavarious. At the airport, the five members of Mystery, Inc. unexpectedly reunite. Fred has become a popular celebrity, Velma works for NASA, and Daphne has undertaken martial arts to avoid being kidnapped again. However, while Shaggy and Scooby are thrilled with the reunion, the other three refuse to work with each other.\nOn the flight over, Shaggy falls in love with a girl named Mary Jane, who loves Scooby Snacks, but is allergic to dogs. Upon arriving at the island, the gang meet Mondavarious, who claims the visiting tourists have been cursed into a brainwashed state. Velma attends a ritualistic performance hosted by N’Goo Tuana and his henchman, Zarkos, a famous luchador. N’Goo claims the island was once ruled by ancient demons til Mondavarious built the resort, and they plot their revenge.\nDue to a misunderstanding when talking to a local voodoo priest, Daphne, Shaggy, and Scooby venture into the resort’s ghost ride, meeting Fred and Velma inside, where they split up to look for clues. Fred and Velma come across a strange school designed to educate inhuman creatures about human culture, while Daphne discovers a pyramid-shaped artifact called the Daemon Ritus. The gang flee to the hotel, but an army of demons attack, kidnapping Fred, Velma, Mondavarious and other tourists, while Scooby, Shaggy, Daphne, and Mary Jane escape.\nThe next day, Daphne is captured by Zarkos, while Shaggy and Scooby learn the tourists are possessed by the demons. They run into Mary Jane, but Scooby realises she is possessed too. Shaggy and Scooby argue, but the latter falls down a hole into an underground chamber, where Shaggy finds a vat of protoplasmic soul of everyone captured. Shaggy frees Velma, Fred, and Daphne’s souls. Velma discovers the demons can be destroyed by sunlight, but Fred and Daphne become trapped in the wrong bodies until the Daemon Ritus corrects it. The gang come across the voodoo priest, who explains the demons’ ritual will allow them to rule the world for the next ten-thousand years when a pure soul is offered as a sacrifice, namely Scooby. Mondavarious is revealed to be the leader of the demons.\nThe gang plot a trap to defeat the demon cult, but it fails, and Mondavarious sucks out Scooby’s soul using the Daemon Ritus. Shaggy tackles Mondavarious, revealing he is a robot, piloted by Scooby’s estranged nephew Scrappy-Doo, abandoned by the gang years ago due to his egotism. Using the absorbed souls of the tourists, Scrappy transforms into a monster and tries to kill the gang.\nDaphne battles Zarkos, kicking him into the ritual chamber where the demons are exposed to sunlight and die. Shaggy rips the Daemon Ritus from Scrappy’s body, freeing the souls. The real Mondavarious emerges from a prison cell, claiming Scrappy replaced him two years ago for his plan. Scrappy, N’Goo, and Zarkos are arrested, while the reunited gang are asked to solve another mystery."}