{"mid": "ScoobyDooInArabianNights", "IMDB_id": "tt0192578", "title": "Scooby-Doo in Arabian Nights", "plot": "Scooby and Shaggy arrive in Arabia on a magic carpet to become royal food tasters for the young Caliph. They are initially hired, but after they eat everything in sight and leave no food for the Caliph, he gets mad and has his guards chase them. Shaggy and Scooby find a place to hide and Shaggy takes on the disguise as a harem girl. The Caliph, who is looking for a bride, falls in love with the disguised Shaggy and decides that they shall be married. Hoping to make the Caliph fall asleep so they can make their escape, Shaggy tells him two classic stories.\n=== Aliyah-Din and the Magic Lamp ===\nThe first of two stories that involved a gender-bent version of Aladdin.\nThe Sultan of the land is worried as his son, The Prince, has not yet chosen a bride to marry, and has turned down almost every princess that seeks to marry him. The Sultan expresses his worry to his vizier, Haman and with his health failing, the Sultan keeps pressuring his son to choose a wife. He is even more upset as once long ago when the Prince was young, he was already engaged to marry a princess of a neighbouring kingdom; when she was born, everyone was filled joy and happiness, but sadly the princess had disappeared leaving the kingdom without an heir and the Prince heartbroken. Eventually the Sultan decides to have every eligible women arrive the next day so that his son may finally choose a wife to secure an heir to the throne. However, the Prince notices a young women near a river washing her clothes and immediately falls in love with her; the young girl notices him and becomes frightened and soon leaves. The Prince tries to stop her, but instead only finds a scarf she had left behind and decides to go into town to find her.\nHowever, unaware to either the Sultan or Prince, Haman the vizier actually despises them and has a plan to finally gain control of the throne. He seeks guidance from a magical jewel known as the Lord of the Amulet, that helped once long ago and reveals that he had actually kidnapped the princess when she was a baby, as it was part of his plan to gain control of the kingdom. The Lord of the Amulet tells him of a magical lamp that is hidden in a cave that is only revealed every three years during a blue moon, but also reveals that only a person of pure of heart can enter the cave. The Lord of the Amulet reveals that a young woman named Aliyah-Din is the only person capable of entering the cave to retrieve the lamp (and who is also revealed to be the same woman the Prince has fallen in love with) before telling Haman to never seek his help again. Haman then goes into town and soon finds Aliyah-Din, where he explains that only she is capable of entering the cave to retrieve the lamp, but also lies to her saying that the lamp has special powers that will help heal the sick Sultan, to which Aliyah-Din agrees to help.\nLater that day, the Prince is still searching for Aliyah-Din where he also attracts a lot of attention from many women who seek to marry him the next day, causing the Prince to discover of his father's plans. He is outraged of his father wanting him to marry a women he has only met as his heart only lies toward Aliyah-Din. Meanwhile, Aliyah-Din is late meeting with Haman, but on her way she discovers the news that the Prince shall choose a bride the next day; however, a women nearby tells her not get her hopes up as she believes that Aliyah-Din doesn't have a chance of gaining the Prince's love and affections. Aliyah-Din and the Prince then soon bump into each other, where Aliyah-Din in return falls in love with the Prince. However, remembering her duties to help retrieve the lamp, Aliyah-Din is forced to leave the Prince, although he attempts to stop her, The Prince soon loses sight of her, much to his dismay.\nAt night, Aliyah-Din meets with Haman where they witness the cave opening. Haman instructs Aliyah-Din to touch only the lamp and nothing else as she enters the cave. Aliyah-Din enters a room and despite Haman's warnings, she picks what seems to be an innocent flower, unaware that it's actually a piece of treasure. Aliyah-Din soon finds the lamp near a water fountain, but discovers that by picking the flower the cave has started to collapse and it soon closes, leaving her and the lamp trapped inside much to Haman's anger. Aliyah-Din is upset as she has no way out of the cave and that the Prince will eventually pick a bride to marry the next day. She then notices that the lamp has writing that reads \"Rub Me\"; she rubs it as it instructs which releases Yogi Bear, a fully powered Genie and his sidekick Boo Boo, a Genie-in-training, who reveal to Aliyah-Din that she is their new master and they are allowed to grant her three wishes.\nMeanwhile, back at the Palace, Haman is creating a special potion to use on the Sultan that will make him fall into a deep sleep. He goes to the Sultan's chambers where the potion takes an immediate effect and he falls asleep; soon after the Prince arrives to talk to his father, unaware of the sleep spell. The Prince apologizes for not having selected a bride and wanting to put his father's happiness before his own, reveals he will choose a bride and marry whoever it may be the next day, despite the fact he still upset over losing Aliyah-Din. However, the Prince now notices his father's condition and soon Haman puts the Prince under the same spell, Haman then takes the unconscious Prince to the dungeons where he chains him and takes on the Prince's appearance.\nAliyah-Din goes to accept the Prince's hand in marriage unaware of who she's dealing with. Haman reveals himself, takes the lamp, (therefore making him Yogi and Boo-Boo's new master) and has Aliyah-Din thrown into the dungeon. Haman uses his first 2 wishes to become a sultan that has supremacy in front of all the universe. Aliyah-Din escapes from the dungeon and removes the lamp from Haman's grasp, leaving him without a third wish. Aliyah-Din finally gets a do-over of three wishes and uses her first wish to bring everything back to normal.\nWith everything fully restored, The Prince regains consciousness and orders the guards to arrest Haman. The Prince then soon reunites with Aliyah-Din and returns her scarf; after finally learning her name, The Prince asks Aliyah-Din to marry him. However, Aliyah-Din believes that he doesn't truly love her as she believes his love is mainly due to her wishing for it, but The Prince instead reveals to her that he has been in love with her ever since he first saw her. Aliyah-Din is delighted and The Prince assures her that they can be together. Soon the now awakened Sultan arrives and the Prince introduces his father to Aliyah-Din and reveals his desire to marry her. The Sultan, however, cannot bless their desire for marriage, as he reveals to his son that he can only marry a princess, Aliyah-Din rubs the lamp as she hears his words and Yogi appears. Aliyah-Din then wishes to become a princess again, and is soon transformed back into her princess attire. However, even despite the wish, The Sultan cannot allow Aliyah-Din and the Prince to be married.\nSaddened, The Prince apologizes to Aliyah-Din as it appears that their love can never be. However, upon learning her name, The Sultan realizes that Aliyah-Din is the long-lost princess who the Prince was engaged to. Delighted, The Sultan allows them to be married. Aliyah-Din then asks Yogi for her final wish to be a huge wedding, which he gladly grants. The Prince and Aliyah-Din celebrate their engagement and share their first kiss, as Boo Boo finally becomes a full-fledged Genie and grants Yogi his own personal wish: a picnic basket.\n=== Sinbad the Sailor ===\nThe second and final tale is about Sinbad the Sailor (played by Magilla Gorilla) and how he mistakes a pirate ship for a cruise ship, the latter being a running gag throughout the story.\nBefore Shaggy can escape, the Caliph decides to start the ceremony right away, but when the wedding cake arrives, Shaggy pigs out, and his ruse is discovered. However, the Caliph reveals that since he enjoyed listening to the stories, he has decided to make Shaggy and Scooby royal storytellers, which the duo happily accept (even if they lost the royal food tasting job)."}