{"mid": "ScotlandPa", "IMDB_id": "tt0265713", "title": "Scotland, Pa.", "plot": "In 1975, Duncan’s, a fast-food restaurant owned by Norm Duncan in the tiny hamlet of Scotland, Pennsylvania, hosts a variety of workers. Joe “Mac” McBeth is passed over for a promotion to manager by Douglas McKenna, who has been embezzling the restaurant’s money. Three stoned hippies, one a fortune teller, inform Mac that they see a bank drive-thru style restaurant in his future as management. Mac and Pat McBeth then play informants on McKenna, and Duncan recognizes the value of Mac's efforts on behalf of the restaurant. Duncan shares with the McBeths his plans to turn his failing burger joint into a drive-through, and Mac realizes how profitable the drive-through could be, after which he is hit in the head with a refrigerator door and passes out briefly. Pat then decides to murder Duncan in a staged robbery. Mac and Pat attack Duncan to acquire the combination to the restaurant's safe, and Mac assaults Duncan, but is distracted by a vision of the three hippies, allowing Duncan to fall head first into a deep fryer that splatters and burns Pat’s hand. Investigator McDuff arrests a local homeless man, to whom Pat has given Duncan's jewelry, and the restaurant is willed to Duncan's eldest son, Malcolm. Malcolm sells the restaurant to the The McBeths who immediately realize Mac’s ideas, and the restaurant's business takes off.\nInvestigator McDuff returns to Scotland, where the homeless man is cleared, and the McBeths focus their attention on Malcolm. Banko, Mac’s friend, questions why Mac had never mentioned the drive-in concept. Mac grows withdrawn and paranoid and on a hunting trip contemplates killing off Banko, but a vision of the three hippies dressed as deer distracts him. Pat becomes obsessed with her burn injury and accuses people of staring at her repulsive-looking hand, though no scar is visible. Mac then kills Banko with the homeless man’s gun, and the body is discovered while new celebrity Mac gives a press conference. Mac calls on an hallucination of Banko to ask a question at the press conference and loses his sanity as the town watches on TV. He then returns to the woods to look for the hippies while Pat becomes deluded into thinking her hand is falling off. Mac then completely loses his sanity, answering and talking on the phone when no one is on the other end. In one conversation, the hippies suggest he kill McDuff’s family. Mac grabs the sheriff’s gun and orders the officer to call McDuff to the restaurant, where he then shoots McDuff, but the gun proves to be empty. They then wrestle for the inspector’s gun on the roof of the restaurant and both fall off. Mac is impaled on the horns of his car. Pat self-medicates with alcohol, but then cuts her hand off and bleeds to death. McDuff takes over the restaurant, fulfilling his dream of working with food."}