{"mid": "ScreamForHelp", "IMDB_id": "tt0088066", "title": "Scream for Help", "plot": "Christie, a teenage girl discovers that her stepfather Paul is trying to murder her and her mother Karen for her money, but when she tries to tell other people about it, no one will believe her. After a maintenance worker dies in the basement, Christie believes Paul set the trap for her mother after she saw him leave the basement the previous night. Christie begins following Paul everywhere and discovers he is having an affair with a young attractive woman named Brenda. She is caught by Brenda's brother Lacey but manages to run away. Paul convinces Karen that Brenda is a client of his and she believes him over her daughter.\nChristie convinces Josh, her best friend Janey's boyfriend to accompany her to catch Paul, but the brakes to her mother's car have been tampered with almost killing them. Christie and Janey discover Paul and Brenda at a motel and run when Paul sees them, Janey tells Christie she is pregnant for Josh, but moments later is killed in a hit and run by an unseen driver. Christie tells the police that Paul killed Janey, intending to kill her, but she is not believed. Josh sticks up for Christie after she is bullied and blamed for Janey's death, later she loses her virginity to Josh, but they are interrupted by Paul, who orders Josh to leave, when Christie goes to the bathroom she notices gas, which Paul is aware of and now knows Paul is trying to kill her too as she would be entitled to her mother's inheritance before he would be. Karen also falls down the stairs after a trap Paul set for her and needs a wheelchair to get around. Christie takes a picture of Paul and Brenda having sex, but drops the picture and is seen by them, while retrieving the picture she overhears that Brenda and Lacey are in fact a married couple who plan to blackmail Paul after he kills Karen and Christie. She shows her mother the picture and Paul is ordered to leave.\nAt midnight, Paul, Brenda and Lacey invade the house and force Christie and Karen to the basement and reveal their plans to kill them both at 2 a.m. and blame it on a burglar. Christie tells Paul about the real relationship between Brenda and Lacey, which angers him. Christie tricks Brenda into letting her out to go to the bathroom, while Karen cuts the electricity to the house from the basement, giving Christie a chance to run and stab both Lacey and Paul. After Brenda attacks Karen and turns the lights back on Christie surrenders herself to Lacey and both victims are forced back to the basement where they devise another plan to escape by wetting the fuse box.\nAt 2 a.m. they are ordered upstairs, but are interrupted by Josh who knocks at the door, Lacey orders Christie to open the door and get rid of him. Josh is suspicious and informs the police. When the electricity goes off, both mother and daughter flee their attackers, Lacey orders Brenda to go to the basement and turn the lights back on, however the wet fuse box electrocutes Brenda. After almost catching Karen, Lacey runs to the basement after hearing Brenda's scream and finds her dead. Christie tricks Paul into believing she is in her bathroom, when Paul enters the gas filled bathroom with a lighter, it explodes and he is killed. Josh saves Christie from the burning house.\nWith their ordeal over, Christie and Karen reside at another house temporarily, when Josh comes over to kiss Christie, Lacey appears and hits Josh and plans to kill Christie for what she did to Brenda, Christie pulls out a knife and stabs Lacey through the stomach, killing him."}