{"mid": "ScreamBloodyMurder", "IMDB_id": "tt0070654", "title": "Scream Bloody Murder", "plot": "As his father works on a tractor, young Matthew turns it on and kills him with it, damaging his own left hand in the process. Matthew is subsequently placed in a psychiatric hospital, and his mangled limb is replaced with a hook. At the age of eighteen, Matthew is released from the asylum, and returns home, discovering that in his absence his mother has married a neighbor named Mack Parsons. Matthew, who harbors incestous feelings for his mother despite his aversion to sex, dislikes Parsons, and one night he murders him with an axe. Matthew's mother discovers what her son has done, and when an argument breaks out between them, Matthew knocks her to the ground, and she dies due to hitting her head on a rock.\nIn the morning, a distraught Matthew hitches a ride with a young couple, whom he also kills, beating in the man's head with a rock and drowning the woman in a roadside stream. Matthew eventually reaches a town, where he makes the acquaintance of a painter and prostitute named Vera, who reminds Matthew of his mother. Matthew becomes obsessed with Vera, to the point of slitting the throat of one of her clients, a drunken sailor, in a jealous rage. Wanting to impress Vera and give her a better life, Matthew bluffs his way into a mansion, where he smothers the owner with a pillow, hacks the maid to death with a cleaver, and beheads the pet dog.\nMatthew brings Vera to the mansion, but when she continually refuses his offers to live with him, he grows enraged, and takes her prisoner. Matthew tries to make Vera accept her new life, but she defies him at every turn, even after he bludgeons a doctor (who dropped by to see the house's owner) in front of her. One day, while trying to convince Matthew that she needs a bath, Vera realizes that he is disgusted and disturbed by sexuality, and she uses this to her advantage. Vera intimidates Matthew into trying to have sex with her, and while he is distracted, she stabs him with a loose door hook and tries to escape, but Matthew catches her and rips her throat out with his hook.\nWith Vera dead, Matthew becomes completely unhinged and runs through town, chased by hallucinations of his victims. Matthew breaks into a church, and as the phantoms surround him, he uses his hook to kill himself."}