{"mid": "Scrooged", "IMDB_id": "tt0096061", "title": "Scrooged", "plot": "Frank Cross is an inconsiderate and arrogant executive in the IBC television network headquarters. He is preparing an extravagant live production of A Christmas Carol on Christmas Eve, forcing the network's staff, including his assistant Grace Cooley, to work on the holiday. He also fires the meek Eliot Loudermilk for disagreeing with him, denies his employees their Christmas bonus, and gives everyone on his Christmas list, including Grace and his brother James, a monogrammed towel. Meanwhile, Frank's boss Preston Rhinelander has hired Brice Cummings, who is transparently after Frank's job.\nHours before the show starts, Frank is visited by the ghost of his mentor Lew Hayward, who announces that three ghosts will appear over the course of the night. Lew also causes Frank's phone to call Claire Phillips, Frank's true love from years ago. Claire comes to visit Frank, but he is too busy to talk to her. She leaves him the address of the homeless shelter where she works.\nThe Ghost of Christmas Past appears as a taxi driver who takes Frank back to his childhood, beginning in 1955. His father Earl is an unloving meatpacking foreman who gives him veal for Christmas and yells at him when he objects. Frank's only solace is in the world of television, foreshadowing his eventual career path. The Ghost then takes Frank forward to 1968-71 to see himself as a young man meeting Claire, and showing how Frank's rise to power changed his emotional life, and that Frank is to blame for the loss of Claire. Returned to the present, Frank goes to the homeless shelter to apologize to Claire and invites her to lunch to mend fences. However, when shelter workers pester Claire, Frank reverts to his old self, and bluntly tells Claire she is letting life pass her by, and to only care about herself.\nBack at IBC, Frank watches final preparations before the live show. The Ghost of Christmas Present appears as a cute, yet volatile pixie who goes by the motto, \"Sometimes you have to slap people in the face to get their attention\". She shows Frank how Grace struggles with the long hours he puts her through, without being able to care for her family. Her son Calvin has been mute since the death of his father five years prior. The Ghost also shows him how James is enjoying Christmas with his wife and friends; James still invites Frank every year, although he never attends. Frank begins to show empathy. The Ghost leaves Frank in a utility space under a sidewalk, where he finds the frozen body of Herman, a homeless man he had met earlier at Claire's shelter; Frank had refused to buy him a cup of coffee. Frank struggles to escape through a boarded-up door, but when he forces the door he crashes through the IBC set during the final rehearsal.\nPreston has put Brice in charge, fearing that Frank is having a mental breakdown. Frank returns to his office where he is repeatedly shot at by a furious Eliot, whose life he has ruined. Frank dives into an elevator, and finds the Ghost of Christmas Future, appearing as a towering cloaked skeleton with tortured souls trapped inside his ribcage and a TV for a head, waiting for him. This Ghost shows him that if Frank continues on this path, Claire will become cold-hearted and Calvin will be committed to a mental institution. Frank then sees himself in a casket at a funeral only attended by James and his wife, Wendie. However, just as the casket is cremated, Frank is returned to reality.\nHorrified and humbled by what he's been shown, Frank returns a changed man. He rehires Eliot on the spot, and they take over the live show by holding Brice and the control box at gunpoint. Frank goes on-camera, improvising a speech that denounces his own decision to run a live show on Christmas Eve instead of taping it, and explains what he has learned over the last few hours. He apologizes on-air to James and to Claire. Claire rushes to IBC, given a lift by the Past Ghost.\nAs Frank encourages the cast and crew to sing, Calvin speaks for the first time in five years, reminding Frank of the final lines of the show \"God bless us, everyone.\" As Claire and Grace join him, Frank tells everyone to join him in singing \"Put a Little Love in Your Heart\", while Lew and the other Ghosts, including Herman, look on, happy and impressed."}