{"mid": "Scum", "IMDB_id": "tt0079871", "title": "Scum", "plot": "Three young men arrive at Borstal by prison van: Carlin, who has taken the blame for his brother's theft of scrap metal; Angel for stealing a car; and Davis, sent here after escaping from an open institution. All three are allocated to their rooms; Angel and Davis sent to private rooms, and Carlin sent to a dormitory.\nCarlin wants to keep a low profile, having been transferred for assaulting a warder. He meets and befriends Archer, an eccentric and intellectual inmate intent on using non-violent means to cause as much of a nuisance to the staff as possible, and is informed his reputation is already known; Banks, the current \"Daddy\" (the inmate who controls the wing) is seeking Carlin for a fight.\nCarlin struggles to settle into the dormitory, and after having watched the timid and bullied Davis be attacked by Banks, is eventually beaten by Banks and his friends in an unprovoked attack.\nCarlin eventually gets his revenge on Banks. He uses a makeshift cosh from a long sock with two snooker balls inside to beat Banks's crony, then confronts Banks in the bathroom and replaces him as the \"Daddy\" of the ward. Carlin later acquires power over the adjacent wing of the borstal by administering a vicious beating to the adjacent wing's Daddy.\nLife improves for the inmates under Carlin, with victimisation of younger, weaker prisoners prevented, along with racially motivated violence. Carlin gains status with the warders. He persuades them to move him from the dormitory to a single cell in return for an agreement to be responsible in his status as a \"natural leader\". Goodyear offers Carlin a position of leadership in the borstal to help him develop his leadership skills.\nAnother inmate, Toyne, learns through a letter from his in-laws that his wife has died, and sinks into despair, eventually slashing his wrists. After being moved to another prison, word reaches the inmates that he has killed himself in a second suicide attempt. Davis, meanwhile, is framed for theft by Eckersley and placed on report. Carlin advises Davis to avoid them; but Davis is subsequently gang-raped by three youths in a potting shed. This is seen by warder Sands who merely smiles at the rape. Davis slips into despair, and kills himself when he slashes himself in his cell at night. Whilst bleeding to death, he presses the button in his cell for help, but is ignored by warder Greaves.\nDavis’ suicide causes mass hysteria within the prison, with the inmates refusing to eat their food at dinner. Carlin initiates a full-scale riot in the dinner hall. Carlin, Archer and Toyne's friend Meakin are shown being dragged bleeding and unconscious into solitary confinement after having been beaten by the warders. The Borstal's Governor later informs them the damage to the dinner hall will be repaid through lost earnings. The film ends with The Governor declaring a minute's silent prayer for Davis and Toyne."}