{"mid": "Seconds", "IMDB_id": "tt0060955", "title": "Seconds", "plot": "Arthur Hamilton (John Randolph) is a middle-aged man whose life has lost purpose. He is disengaged at his job as a banker, while the love with his wife has dwindled. Through a friend who he thought had died years earlier, Hamilton is approached by a secret organization, known simply as the \"Company,\" which offers wealthy people a second chance at life. The Company, in the person of Mr. Ruby (Jeff Corey), interviews Hamilton, then shows him a film of him attacking a girl after he'd unknowingly consumed drugged food & drink offered him by the Company. They threaten to blackmail Hamilton forcing him to sign on, foreshadowing the unfortunate consequences of accepting the Company's assistance.Hamilton's death is staged to make it look as if he perished in a hotel fire with a corpse left disguised as him. Through extensive plastic surgery and psychoanalysis, Hamilton is transformed into Tony Wilson (Rock Hudson). He is provided with a new home, a new identity (as Wilson), new friends and a devoted manservant. The details of his new existence suggest that there was once a real Tony Wilson, but what became of him is a mystery.Wilson copes with his new world. Relocated to a fancy home in Malibu, California, where he is an already established artist, he commences a relationship with a young woman named Nora Marcus (Salome Jens) and for a time he is happy but soon becomes troubled by the emotional confusion of his new identity, as well as by the exuberance of renewing his youth.At a dinner party he hosts for neighbors, Wilson drinks himself into a stupor and begins to babble about his former life as Hamilton. It turns out that his neighbors are \"reborns\" like himself, sent to keep an eye on his adjustment. Nora is actually an agent of the Company and her attentions to Wilson are designed merely to ensure his cooperation.In violation of Company policy, Wilson, posing as an old friend of her husband's, visits his former wife (Frances Reid) in his new persona. He learns that his marriage had failed because he was distracted by the pursuit of career and material possessions, the very things in life that others made him believe were important.Wilson returns to the Company and announces a desire to start again with yet another identity. The Company offers to accommodate him, but asks if he would first provide the names of some past acquaintances who might like to be \"reborn.\" He refuses since he now knows of the drawbacks to being \"reborn\" and also doesn't want to delay the Company's procedure for a new identity for himself.While awaiting his reassignment, Wilson encounters Charlie Evans (Murray Hamilton), the friend who had originally recruited him into the Company. Evans was also \"reborn\" and likewise could not make a go of his new life. Together, they speculate on the reason for their failure to adjust, attributing it to the fact that they allowed others, including the Company, to make life choices for them.This realization comes too late. Wilson/Hamilton is suddenly strapped to a gurney and as he is wheeled down the hallway, a priest reads him his last rites. He is eventually wheeled into a small room where he learns that failed reborns are not actually provided with new identities but instead become the cadavers used to fake new clients' deaths."}