{"mid": "SeedsOfYesterday", "IMDB_id": "tt4103992", "title": "Seeds of Yesterday", "plot": "Thirteen years after If There Be Thorns, Cathy and Chris arrive at Foxworth Hall, which has been re-built by Bart, for his 25th birthday party. Bart has remained obsessed with Malcolm and has an estranged relationship with his mother and uncle/step-father due to their incestuous relationship. He's even changed his last name to Foxworth in order to emphasise his distance from them. His anger and hatred is particularly aimed towards Chris, though still showing a deep love for his mother. Jory and his wife, Melodie, arrive to announce she is pregnant with twins. Everyone, but Bart, is excited about the news and Bart is jealous of his brother because he secretly lusts after Melodie.\nThe next day, Cindy arrives and Bart welcomes her with contempt, not even wanting to acknowledge her as his sister due to her merely being adopted. At the birthday party, Jory and Cindy perform a ballet for the guests, but Jory has an accident that leaves him paralyzed from the waist down and ends his dance career. Melodie is distraught since she is unable to live with a husband who can't dance, nor make love to her again. Cindy suspects that Bart was responsible for the incident since he had updated his insurance policy the day before the accident. When confronted with this suspicion, Bart denies this to Cathy and Chris, but they don't fully believe him.\nAs months pass with Jory hospitalized and Melodie becoming more depressed, Bart takes advantage of her vulnerable state and seduces her. When Jory comes home, Corrine's will is read and Bart is enraged to learn that he will inherit the Foxworth estate only on his 35th birthday, leaving Chris as the guardian of his money until then. Cathy discovers Bart and Melodie's affair when walking in on them having sex. Bart tells Cathy that Melodie loves him and points out that Malcolm was obsessed with his own mother until she abandoned him and how much he hates seeing his own mother with Chris. Cathy then confronts Melodie and threatens to ruin her life if she doesn't start supporting her husband Jory. Jory however soon attempts suicide by drowning in the pool, but is saved by Chris. Following this, Melodie promises Jory that she will be more attentive to him, but she soon tries to continue her affair with Bart, who having had her, rejects her. Cindy brings home a new boyfriend, Lance, to meet the family during dinner. However, Bart beats him after catching the two having sex. Despite his hatred towards her, Bart nevertheless starts to lust for Cindy.\nOn Christmas Day, Bart deliberately confesses his affair with Melodie to Jory, and the shock causes her to go into premature labour. She gives birth to a boy and girl named Darren and Deirdre. However, she shows no interest in them as well as Jory and abruptly abandons them. Bart follows Cindy meeting with another boyfriend at a bar and confronts her on her way home through the woods and, in the heat of the moment, has sex with her. Cindy is interested in having a relationship with Bart and admits that she has genuine feelings for him, even revealing she knows about Cathy and Chris' secret, but he rejects her having sated his lust. Devastated, Cindy returns to school in New York.\nChris decides to look for a new house for Cathy, Jory, the twins, and himself to give Bart his own space. They hire a nanny, Toni, to take care of the twins. Bart starts pursuing her, which troubles Cathy since she was hoping Toni would end up with Jory instead. Bart soon accuses Toni of being with him merely for his money and breaks up with her. He then forces the family to attend a baptism at the Foxworth chapel for the twins and almost drowns Deirdre in the font, causing Cathy and Chris to decide to leave Foxworth Hall with Jory, Toni, and the twins to get away from sociopathic Bart. Bart has a mental breakdown and accuses Cathy of abandoning him for Chris, and blames her for ruining the family. He is about to kill her with a dagger before he is stopped by Jory. Finally seeing that it is hopeless to help him, Cathy decides to leave Bart for good. As he returns home after finding them a new house, Chris pulls over to help a stranded motorist and is struck by a passing truck, which kills him instantly.\nSeveral hours pass before the police arrive to inform the family of Chris' accident and death. This causes Bart to realize his wrongdoings and how he has pushed people away. He realizes his love for Cindy and confesses to her when she comes home for Chris' funeral. Bart remorsefully gives a moving eulogy at Chris' funeral and is thankful to Chris for raising him when he didn't need to. In the end, Cathy reveals that her children led successful lives away from Foxworth Hall. Jory thrives in his recovery, has married Toni, and they are raising the twins and expecting a child together. Bart becomes a televangelist and marries Cindy. However, Cathy chooses to remain at Foxworth Hall as she continues to mourn the loss of her beloved Chris. One day, she goes up to the attic, sits by a window and, as she envisions yellow paper flowers, there is an implication that she had died of a broken heart."}