{"mid": "Selena", "IMDB_id": "tt0120094", "title": "Selena", "plot": "The film begins on February 26, 1995, with American Tejano music singer Selena (Jennifer Lopez) performing to a sold out concert at the Astrodome in Houston, Texas. Flashing back to Corpus Christi, Texas in 1961, a young Abraham Quintanilla Jr. (Edward James Olmos) and his band, Los Dinos, are rejected for an audition by the restaurant owner due to their Mexican-American ancestry. Crushed, Abraham gives up his music career.\nIn the 1980s, Abraham is now married to Marcella (Constance Marie) and has three children, A.B. Quintanilla (Jacob Vargas), Suzette Quintanilla (Jackie Guerra), and Selena. One day Selena finds her father playing music and sings along. Enchanted by her voice, Abraham decides to start a band with Selena as lead vocalist, A.B. on bass, and Suzette on drums, despite Suzette's protests that \"girls don't play drums\". He names the band Selena y Los Dinos. The band performs often at the Mexican restaurant the family opens, and receive a positive reception from the diners. Eventually, the business goes bankrupt, and the family moves to Corpus Christi.\nThe actions moves ahead to 1989, where Selena y Los Dinos are playing a concert at a fair. Abraham is shocked when Selena peels off her jacket and performs in a beaded bra. He confronts Selena on the band's bus, but she points out that her mother helped her make it, and that other fashionable female musicians such as Madonna and Janet Jackson are wearing bustiers too. Abraham relents, and Selena begins to design more and more of her band's attire.\nWhen the band needs a new guitarist, A.B. recommends Chris Pérez (Jon Seda), and auditions him to his father. However, Abraham is hesitant to hire Chris because of his tough-guy, heavy metal image, but A.B. points out that \"It's just musician stuff\". Abraham agrees to hire Chris if he will cut his hair. Suzette and Deborah re-style his hair and Chris joins the band. The touring band stops off at a roadside diner, where Suzette hears a radio announcement that \"Como la Flor\" has reached number one on the music charts. The band and family celebrate. Selena and Chris begin to have romantic feelings for each other. Selena's mother is supportive, but Abraham angrily fires Chris when he finds them hugging on the tour bus. Selena tearfully objects, but a furious Abraham threatens to disband the group if she continues to see him.\nChris and Selena continue to see each other behind Abraham's back. Selena tires of having to hide their love, and goes to Chris' hotel room. She persuades him to elope, saying it's the only way her father will ever leave them alone. They marry secretly on April 2, 1992. The happy couple rides home in Selena's convertible, but a radio station announces their marriage and plays \"Como La Flor\" in celebration. Selena and Chris decide to hide out for a day so Abraham will have time to cool off. Selena goes home to explain to her father, and Abraham agrees to accept their relationship. The Quintanillas welcome Chris to their family and rehire him to the band.\nSelena plays a concert in San Antonio, watched by executives from her Latin music label. The producers talk to Abraham about her soaring popularity and phenomenal record sales, and ask if she's ready to crossover into the English-speaking market.\nIn January 1994, Selena decides to fulfill another of her dreams and opens Selena Etc., a clothing boutique that will feature her designs, and hires Yolanda Saldívar (Lupe Ontiveros), the president of her fan club, to manage the boutique. Later, Selena is thrilled to win the Grammy Award for Best Mexican American Album.\nBack home, Selena learns from her father that Yolanda has been stealing money from the fan club. On March 9, 1995, Selena and her father, along with Suzette, confront Yolanda about the missing funds at a meeting. Yolanda denies this and says she would never take anything from Selena. Selena, angry and hurt by Yolanda's betrayal, asks her how she could do this to her, and to her fans. Yolanda pleads for time to return the boutique's financial records and claims she can prove that she has done nothing wrong. Selena and Chris discuss the prospect of starting their family when the crossover tour is finished. The future seems bright with promise.\nOn March 31, after arguing over the missing financial documents, Selena is murdered by Yolanda at a Corpus Christi motel. Yolanda is arrested after a nine-and-a-half-hour standoff with the police. As Selena's family, friends, and fans mourn her tragic death, a montage of the real Selena photographs and videos play during a candlelight vigil, and the film ends with a freeze-frame of a smiling Selena with the caption \"SELENA QUINTANILLA-PEREZ: 1971-1995.\""}