{"mid": "Selma", "IMDB_id": "tt1020072", "title": "Selma", "plot": "In 1964, Dr. Martin Luther King Jr. of the Southern Christian Leadership Conference (SCLC) accepts his Nobel Peace Prize. Four black girls walking down stairs in the Birmingham, Alabama 16th Street Baptist Church are killed by a bomb set by the Ku Klux Klan. Annie Lee Cooper attempts to register to vote in Selma, Alabama but is prevented by the white registrar. King meets with Lyndon B. Johnson and asks for federal legislation to allow black citizens to register to vote unencumbered, and the president responds that he has more important projects.\nKing travels to Selma with Ralph Abernathy, Andrew Young, James Orange, and Diane Nash. James Bevel greets them, and other SCLC activists appear. FBI director J. Edgar Hoover tells Johnson that King is a problem, and suggests they disrupt his marriage. Coretta Scott King has concerns about her husband's upcoming work in Selma. King calls singer Mahalia Jackson to inspire him with a song.\nKing, other SCLC leaders, and black Selma residents march to the registration office to register. After a confrontation in front of the courthouse, a shoving match occurs as the police go into the crowd. Cooper fights back, knocking Sheriff Jim Clark to the ground, leading to the arrest of Cooper, King, and others.\nAlabama Governor George Wallace speaks out against the movement. Coretta meets with Malcolm X, who says he will drive whites to ally with King by advocating a more extreme position. Wallace and Al Lingo decide to use force at an upcoming night march in Marion, Alabama, using state troopers to assault the marchers. A group of protesters runs into a restaurant to hide, but troopers rush in, beat and shoot Jimmie Lee Jackson. King and Bevel meet with Cager Lee, Jackson's grandfather, at the morgue. King speaks to ask people to continue to fight for their rights. King receives harassing phone calls with a recording of sexual activity implied to be him and another woman leading to an argument with Coretta. King is criticized by members of the Student Nonviolent Coordinating Committee (SNCC).\nAs the Selma to Montgomery march is about to begin, King talks to Young about canceling it, but Young convinces King to persevere. The marchers, including John Lewis of SNCC, Hosea Williams of SCLC, and Selma activist Amelia Boynton, cross the Edmund Pettus Bridge and approach a line of state troopers who put on gas masks. The troopers order the marchers to turn back, and when they hold their ground the troopers attack with clubs, horses, tear gas, and other weapons. Lewis and Boynton are among those badly injured. The attack is shown on national television as the wounded are treated at Brown Chapel, the movement's headquarter church.\nMovement attorney Fred Gray asks federal Judge Frank Minis Johnson to let the march go forward. President Johnson demands that King and Wallace stop their actions, and sends John Doar to convince King to postpone the next march. White Americans, including Viola Liuzzo and James Reeb, arrive to join the second march. Marchers cross the bridge again and see the state troopers lined up, but the troopers turn aside to let them pass. King, after praying, turns around and leads the group away, and again comes under sharp criticism from SNCC activists. That evening, Reeb is beaten to death by a white mob on a street in Selma.\nJudge Johnson allows the march. President Johnson speaks before a Joint Session of Congress to ask for quick passage of a bill to eliminate restrictions on voting, praising the courage of the activists. The march on the highway to Montgomery takes place, and, when the marchers reach Montgomery, King delivers a speech on the steps of the State Capitol."}