{"mid": "Senso", "IMDB_id": "tt0047469", "title": "Senso", "plot": "Senso is set in Italy around 1866 the year the Italian-Austrian war of unification would see the Veneto and most of Friuli-Venezia Giulia united to Italy after the Seven Weeks' War between Austria on one side and Prussia and Italy on the other. The story opens in the La Fenice opera house in Venice during a performance of Il Trovatore. At the close of Manrico's rousing aria Di quella pira, the opera is interrupted by a boisterous protest by Italian Nationalists against the occupying Austrian troops present in the theater. Livia Serpieri, an Italian countess, unhappily married to a stuffy older aristocrat, bears witness to this and tries to conceal the fact that her cousin Marquis Roberto Ussoni has organized the protest. During the commotion, she meets a dashing young Austrian Officer named Franz Mahler, and is instantly smitten with him. The two begin a secret love affair. Despite the fact that Franz was responsible for sending Roberto into exile for his radical behavior, Livia vainly pretends not to be aware of it.\nAlthough Franz is obviously using Livia for her money and social status, Livia throws herself into an affair of complete sexual abandon with Franz, giving away her money and not caring what society thinks about her. But soon, Franz begins failing to show up for their trysts and Livia becomes consumed by jealousy and paranoia. The war finally forces the lovers apart, with Livia's husband taking her away to their villa in the country in order to avoid the carnage. Late one night, Franz arrives on the estate, and secrets himself into Livia's bedroom. He asks her for more money to bribe the army doctors into keeping away from the battlefield; Livia complies, giving away all of the money she was holding for Roberto, who intended to supply it to the partisans fighting the Austrians. Livia's betrayal leads to tragic consequences; the Austrians overwhelm the under-equipped Italians.\nEventually, Livia is almost driven mad by the fact that she's unable to see Franz, but rejoices when a letter from him finally arrives. In the letter, Franz thanks Livia for the financial support that helped him stay away from the front. He advises Livia not to look for him, but she does not listen. As soon as possible, Livia, still grasping the letter, boards a carriage and hurries to Verona to find her lover. Once there, Livia makes her way to the apartment, which she herself has rented for Franz. What she finds is a drunken, self-loathing rogue, in the company of a young prostitute, openly mocking Livia for accepting his abuse.\nAfter forcing her to sit and drink with the prostitute, Franz brutally throws Livia out of his rooms. She finds herself in the streets, filled with drunken, amorous Austrian soldiers. Livia realizes that she still has Franz's letter, but nothing remains now except mutual self-destruction. Her sanity slipping, Livia heads to the headquarters of the Austrian Army, where she hands Franz's letter to a General, thereby convicting Franz of treason. Although the General sees that Livia is acting out of spite for being cuckolded, he is forced to comply and Franz is executed by firing squad. Livia, now insane, runs off into the night, crying out her lover's name."}