{"mid": "SenseAndSensibility", "IMDB_id": "tt0847150", "title": "Sense & Sensibility", "plot": "Because of primogeniture, when Mr Henry Dashwood dies, his house, Norland Park, passes directly to his son John, the child of his first wife. His second wife, Mrs Dashwood, and their daughters, Elinor, Marianne and Margaret, inherit only a small income. On his deathbed, Mr Dashwood extracts a promise from his son, to take care of his half-sisters. John's greedy wife, Fanny, soon persuades him to renege on the promise. John and Fanny immediately move in as the new owners of Norland, while the Dashwood women are treated as unwelcome guests. Mrs Dashwood seeks somewhere else to live. In the meantime, Fanny's brother, Edward Ferrars visits Norland and soon forms an attachment with Elinor. Fanny disapproves of the match and offends Mrs Dashwood with the implication that Elinor is motivated by money.\nMrs Dashwood moves her family to Barton Cottage in Devonshire, near the home of her cousin, Sir John Middleton. Their new home is modest but they are warmly received by Sir John and welcomed into local society—meeting his wife, Lady Middleton, his mother-in-law, Mrs Jennings and his friend, Colonel Brandon. Colonel Brandon is attracted to Marianne, and Mrs Jennings teases them about it. Marianne is not pleased as she considers the thirty-five-year-old Colonel Brandon an old bachelor, incapable of falling in love or inspiring love in anyone else.\nMarianne, out for a walk, gets caught in the rain, slips and sprains her ankle. The dashing John Willoughby sees the accident and assists her. Marianne quickly comes to admire his good looks and outspoken views on poetry, music, art and love. His attentions lead Elinor and Mrs Dashwood to suspect that the couple are secretly engaged. Elinor cautions Marianne against her unguarded conduct, but Marianne refuses to check her emotions. Abruptly, Mr Willoughby informs the Dashwoods that his aunt, upon whom he is financially dependent, is sending him to London on business, indefinitely. Marianne is distraught and abandons herself to her sorrow.\nEdward Ferrars pays a short visit to Barton Cottage but seems unhappy. Elinor fears that he no longer has feelings for her, but will not show her heartache. After Edward departs, Anne and Lucy Steele, the vulgar cousins of Lady Middleton, come to stay at Barton Park. Lucy informs Elinor in confidence of her secret four-year engagement to Edward Ferrars that started when he was studying with her uncle, and she displays proof. Elinor realises that Lucy's visit and revelations are the result of Lucy's jealousy and cunning calculation, and understands Edward's recent behavior towards her. She acquits Edward of blame and pities him for being held to a loveless engagement by his sense of honour.\nElinor and Marianne accompany Mrs Jennings to London. On arriving, Marianne rashly writes several personal letters to Willoughby, which go unanswered. When they meet at a dance, Mr Willoughby greets Marianne reluctantly and coldly, to her extreme distress. Soon Marianne receives a curt letter enclosing their former correspondence and love tokens, including a lock of her hair and informing her of his engagement to a young lady with a large fortune. Marianne is devastated. After Elinor has read the letter, Marianne tells her that she and Willoughby were never engaged, but she loved him and thought that he loved her.\nColonel Brandon visits the sisters and reveals to Elinor that Willoughby's aunt disinherited him after she learned that he had seduced Brandon's fifteen-year-old ward, Miss Williams, then abandoned her when she became pregnant. This is why he chose to marry for money rather than love. Brandon was in love with Miss Williams' mother as a young man, when she was his father's ward, but she was forced into an unhappy marriage to Brandon's brother that ended in scandal and divorce; Marianne strongly reminds him of her.\nThe Steele sisters come to London as guests of Mrs Jennings and after a brief acquaintance they are asked to stay at John and Fanny Dashwood's London house. Lucy sees the invitation as a personal compliment, rather than what it is, a slight to Elinor and Marianne who should have received such invitation first. Too talkative, Anne Steele betrays Lucy's secret. As a result, the Misses Steele are turned out of the house, and Edward is ordered to break off the engagement on pain of disinheritance. Edward refuses to comply and is immediately disinherited in favour of his brother, gaining respect for his conduct, and sympathy from Elinor and Marianne. Colonel Brandon shows his admiration by offering Edward the living of Delaford parsonage.\nMrs Jennings takes Elinor and Marianne to the country to visit her second daughter. In her misery over Willoughby's marriage, Marianne becomes dangerously ill. Willoughby arrives to repent and reveals to Elinor that his love for Marianne was genuine. He elicits Elinor's pity because his choice has made him unhappy, but she is disgusted by the callous way in which he talks of Miss Williams and of his own wife. He also reveals that his aunt forgave him after his marriage, meaning that if he had married Marianne he would have had both money and love.\nWhen Marianne recovers, Elinor tells her of Willoughby's visit. Marianne realises that she could never have been happy with Willoughby's immoral and expansive nature. She values Elinor's conduct in her similar situation and resolves to model herself after Elinor's courage and good sense. Edward arrives and reveals that, after his disinheritance, Lucy jilted him in favour of his now wealthy brother, Robert. Edward and Elinor soon marry, and later Marianne marries Colonel Brandon, having gradually come to love him."}