{"mid": "SerialMom", "IMDB_id": "tt0111127", "title": "Serial Mom", "plot": "Beverly Sutphin appears to be a typical suburban housewife living with her dentist husband, Eugene, and their teenage children, Misty and Chip, in the suburbs of Baltimore. However, she is secretly a serial killer, murdering people over the most trivial of perceived slights, including mere faux pas.\nDuring breakfast, Detectives Pike and Gracey arrive to question the family about the vulgar harassment of their neighbor, Dottie Hinkle. After the police and her family leave, Beverly disguises her voice to make obscene phone calls to Dottie, because Dottie stole a parking space from Beverly. Later that day, Mr. Stubbins, Chip's math teacher, becomes Beverly's first known murder victim after he criticizes Chip's interests and questions the boy's mental health and family life, as well as berating her parenting; Beverly runs him over with her car, and is witnessed by Luann Hodges, a young woman smoking marijuana nearby. The next day, Misty is upset when Carl Pageant stands her up for a date. Beverly spots Carl with another girl at a swap meet and murders him in the bathroom with a fireplace poker.\nEugene discovers that Beverly has hidden a collection of serial killer memorabilia beneath their mattress. That evening at dinner, Chip comments that his friend Scotty thinks that she is the killer. Beverly immediately leaves in her car, prompting the family to rush to Scotty's house for fear that Beverly plans to kill him; however, Beverly has actually gone to kill Eugene's patient Ralph Sterner and his wife, Betty, for calling Eugene away to treat her husband's chronic toothache on a Saturday they were supposed to spend birdwatching and for eating chicken that reminds her of the starlings. She stabs Betty with scissors borrowed from Rosemary, and causes an air conditioner to fall on Ralph, who caught her killing his wife. Meanwhile, the rest of the family arrive at Scotty's house only to find him in his room masturbating to an old porn video.\nThat Sunday, police follow the Sutphins to church and a news report names Beverly as the suspect in the murders of the Sterners. The church service ends in pandemonium when a suspicious sound causes everyone to panic and flee the church. Police detectives confirm that Beverly's fingerprints match those at the Sterner crime scene and attempt to arrest her, but she escapes. She hides at the video rental store where Chip works, but a customer, Mrs. Jensen, argues with Chip over paying a fee for failing to rewind a videotape and calls him a \"son of a psycho\". Beverly follows Mrs. Jensen home and bludgeons her to death with a leg of lamb while she sings along to \"Tomorrow\" on her rented copy of Annie. Scotty witnesses the attack through a window, Beverly sees him, and a car chase ensues. Catching him at a local club, Hammerjack's, Beverly sets Scotty aflame onstage in front of a deranged crowd during the set of an all-girl band called Camel Lips. The Sutphin family arrive, as do the police, and Beverly is arrested.\nBeverly's trial becomes a national sensation. The media dub her \"Serial Mom\", Chip hires an agent to manage the family's media appearances, and Misty sells merchandise outside the courthouse. During opening arguments, Beverly's lawyer claims that she is not guilty by reason of insanity, but she fires him and proposes to represent herself, citing various law books she has read to her prosecutor's dismay. The judge reluctantly agrees and the trial begins. Beverly proves to be extremely skilled and formidable in defending herself, systematically discrediting nearly every witness against her by; using trick questioning to incite Dottie to contempt of court by repeated obscenities, finding a transsexual-themed magazine in Detective Gracey's trash, invoking judging a person by what they choose to read proves nothing, badgering Rosemary into admitting she doesn't recycle, and fanning her legs repeatedly at pervert Marvin Pickles, whose over-arousal causes him to commit perjury. The only witness she does not discredit is Luann Hodges, who cannot provide a credible testimony due to being under the influence of marijuana. During a second detective's crucial testimony, the entire courtroom is distracted by the arrival of Suzanne Somers, who plans to portray Beverly as the heroine of a television film.\nBeverly is acquitted of all charges, stunning her family, who vow to \"never get on her nerves\". Throughout the trial, Beverly has been displeased that a juror (Patty Hearst) is wearing white shoes after Labor Day. Beverly follows her to a payphone and fatally strikes her in the head with the receiver. Suzanne Somers then angers Beverly into an outburst by trying to pose for a picture that will show Beverly's \"bad side\", just as the juror's body is discovered.\nThe film ends with a close-up of Beverly's wicked smile and a caption stating that Beverly \"refused to cooperate\" with the making of the film."}