{"mid": "SetItOff", "IMDB_id": "tt0117603", "title": "Set It Off", "plot": "Francesca \"Frankie\" Sutton is a Los Angeles bank teller who witnesses a robbery. Although she had no prior knowledge of the robbery, the bank fires Frankie after the police uncover a connection between her and one of the three robbers. Frankie goes to work at Luther's Janitorial Services with her three best friends, Lida \"Stoney\" Newsome, Cleopatra \"Cleo\" Sims, and Tisean \"T.T.\" Williams. Luther treats them with disrespect and pays them paltry wages. Cleo states they should rob a bank themselves. Frankie agrees, but Stoney and T.T. are reluctant. However, when Stoney's younger brother is gunned down by the police in a case of mistaken identity and T.T.'s son is taken away from her by Child Protective Services because she cannot afford to take care of him, they too now have the motivation to join the robbery.\nThe four women embark on a series of bank robberies, which are investigated by LAPD detective Strode. He suspects that Cleo (because of her prior convictions), Frankie (because of her inadvertent connection to the earlier robbery) and Stoney (because of her brother's death) are involved. But his superior refuses to allow him to bring them in for questioning because he doesn't feel the evidence is sufficient. The four women stash the money in an air vent at one of their work sites. However, Cleo, Frankie, and T.T. show up for work one day and realize that their boss, Luther has discovered the money and fled. While Stoney attends a banking event with her lover Keith, the three women track Luther to a motel where he is sleeping with a prostitute. When Luther pulls a gun on Cleo, T.T. kills him. The next day Detective Strode takes Cleo to the police station to participate in a lineup. A glare from Cleo intimidates the prostitute into silence. Frankie and Cleo persuade T.T. and Stoney that they need to rob another bank and leave town the next day.\nThe women rob the bank where Keith, Stoney's lover, works. Strode and his partner try to prevent the robbery, but a bank security guard shoots T.T. The women flee but T.T. dies in Stoney's arms en route to the hospital. The three remaining women decide to split up and meet up later.\nThe police find Cleo who proceeds leads them on a high speed chase. After her car is shot up by police, Cleo leaps from her car in one final battle for her dignity, firing her gun, and is shot down by the police. Frankie is found a short time later. Strode tries to get her to surrender, but when she runs away, she is shot in the back and killed. Stoney tearfully watches this from a passing bus. Strode sees her from a distance but lets her go, realizing he was the reason she and her friends did what they did.\nIn Mexico, Stoney calls Keith to assure him that she is all right and thanks him. Keith hangs up the phone and smiles. Stoney is seen driving through the mountains with the stolen money from the robberies on tow."}