{"mid": "SevenPsychopaths", "IMDB_id": "tt1931533", "title": "Seven Psychopaths", "plot": "Marty is a struggling writer who dreams of finishing his screenplay, Seven Psychopaths. Marty's best friend, Billy, makes a living by kidnapping dogs and collecting the owners' rewards for their safe return. Billy's partner-in-crime is Hans, a religious man with a cancer-stricken wife, Myra.\nMarty writes a story for another psychopath, the \"Quaker\", who stalks his daughter's killer for decades, driving the killer to suicide. Billy suggests Marty use the \"Jack of Diamonds\" killer, perpetrator of a recent double murder, as one of the psychopaths. Billy places an advertisement in the newspaper inviting psychopaths to call and share their stories for Marty to use in his script. A man named Zachariah Rigby approaches Marty and shares his story, with the condition that the movie includes a message to his partner in crime.\nBilly and Hans steal a Shih Tzu named Bonny, unaware that it is the beloved pet of Charlie Costello, an unpredictable and violent gangster. Charlie's thugs, led by Paulo, discover Hans' connection to the kidnapping. They threaten to kill Marty and Hans, but the Jack of Diamonds killer arrives and kills the thugs. Charlie traces Myra to the cancer ward and kills her after she refuses to tell him anything.\nBilly goes to Costello's house to meet his girlfriend, Angela, who is also Charlie's girlfriend. After Billy reveals to her that he kidnapped Bonny, she calls Charlie to tell him. Billy, after finding out that Charlie killed Myra, shoots Angela in retaliation. Charlie arrives at Billy's address and discovers many packs of playing cards with the jack of diamonds missing, and realizes Billy is the \"Jack of Diamonds\" killer.\nMarty, Billy, and Hans leave the city with Bonny. Hans reveals that he was the Quaker. Marty wrote his story after hearing it from a drunken Billy. The trio drive into the desert and set up camp. Billy suggests Seven Psychopaths end with a shootout between the psychopaths and Charlie's forces.\nMarty and Hans see a headline saying that Billy is wanted in connection with the Jack of Diamonds killings. Marty confronts Billy, who reveals that he assumed the Jack of Diamonds persona to give Marty inspiration. Marty tells Billy they must go home. Meanwhile, Hans has a vision of Myra in which she is in a \"grey place,\" leading Hans to question his belief in the afterlife. He ignores Marty's reassurances that his vision was a peyote-induced hallucination. Billy sets the car on fire, stranding the trio, and calls Charlie, telling him their location. Billy claims he impersonated Myra, causing Hans to leave.\nBilly, with Bonnie in tow, anxiously waits for Charlie to arrive, intending to have a climactic shootout. Charlie arrives alone, without a weapon apart from a flare gun. An enraged Billy shoots Charlie, feeling cheated out of a shootout. Marty drives away with Charlie, intending to take him to a hospital, while Billy realizes the flare gun's purpose and fires it. Hans finds Charlie's thugs awaiting the flare signal. The large group catches the attention of the police, who draw closer. Hans pretends to draw a weapon, causing Paulo to shoot him in front of the police. Before dying, Hans says \"It isn't grey at all\".\nThe thugs head towards the signal, with police in pursuit, and encounter Marty and Charlie, who reveals that he only suffered a flesh wound. With backup, Charlie returns to Billy's location. After a shootout, Charlie and Billy have a stand-off, respectively holding Marty and Bonny hostage. Charlie releases Marty and shoots Billy just as the police arrive. Charlie and Paulo are arrested, but Bonny stays at the dying Billy's side. Marty visits the scene of Hans's death, and finds a tape recorder with suggestions for Seven Psychopaths.\nMarty, having adopted Bonny, finishes the screenplay. Some time later later, after the Seven Psychopaths movie is shown in theater, Marty receives a call from Zachariah, who intends to kill him for forgetting to leave a message as promised. On hearing Marty's weary and resigned acceptance, Zachariah realizes that Marty's experiences have left him a changed man, and decides to spare him."}