{"mid": "SevenChances", "IMDB_id": "tt0016332", "title": "Seven Chances", "plot": "Jimmy Shannon (Buster Keaton) is the junior partner in the brokerage firm of Meekin and Shannon, which is on the brink of financial ruin. A lawyer (whom they dodged, mistakenly believing he was trying to add to their woes) finally manages to inform Jimmy of the terms of his grandfather's will. He will inherit seven million dollars if he is married by 7:00 p.m. on his 27th birthday, which happens to be that same day.\nShannon immediately seeks out his sweetheart, Mary Jones, who readily accepts his proposal. However, when he clumsily explains why they have to get married that day, she breaks up with him.\nHe returns to the country club to break the news to his partner and the lawyer. Though Jimmy's heart is set on Mary, Meekin persuades him to try proposing to other women to save them both from ruin or even possibly jail. He has Jimmy look in the club's dining room; Jimmy knows seven women there (the chances of the title). Each turns him down. In desperation, Jimmy asks any woman he comes across. Even the hat check girl rejects him. He finally finds one who agrees, but it turns out she is underage when her mother spots her and takes her away.\nMeanwhile, Mary's mother persuades her to reconsider. She writes a note agreeing to marry Jimmy and sends the hired hand to deliver it.\nUnaware of this, Meekin has his partner's predicament (and potential inheritance) printed in the newspaper, asking would-be brides to go to the Broad Street Church at 5 p.m. Hordes of veiled women descend on the place. When they spot Jimmy (who had fallen asleep on a pew), they begin to fight over him. Then the clergyman appears and announces he believes it all to be a practical joke. Infuriated, the women chase after Jimmy. While hiding, he gets Mary's note. He races to Mary's house, pursued by furious females. Along the way, he accidentally starts an avalanche, which drives away the mob.\nWhen he gets to Mary's home, Meekin shows him his watch; he is minutes too late. Mary still wants to marry him, money or no, but he refuses to let her share his impending disgrace. Fortunately, when he leaves, he sees by the church clock that Meekin's watch is fast. He and Mary wed just in time."}