{"mid": "SevenBridesForSevenBrothers", "IMDB_id": "tt0047472", "title": "Seven Brides for Seven Brothers", "plot": "In 1850, backwoodsman Adam Pontipee comes into a town in the Oregon Territory to search for a bride. Met with ridicule by some locals, he comes upon the local tavern where he meets Milly. Convinced of her worth by the quality of her cooking and her insistence on finishing her chores before she would leave with him, he proposes and she accepts despite knowing each other for only a few hours.\nOn the journey home Milly talks about how she is excited to be cooking and taking care of only one man, visibly upsetting Adam. When they arrive at his cabin in the mountains, Milly is surprised to learn that Adam is one of seven brothers living under the same roof. The brothers have been named alphabetically from the Old Testament in order of birth: Adam, Benjamin, Caleb, Daniel, Ephraim, Frank (short for frankincense, the Old Testament having no names beginning with F), and Gideon. All of the brothers have red hair and all but Gideon are well over six feet tall. Understandably sad about having to tend to the needs of not one, but seven men, and with an idea to solve the situation, a smart and reasonable Milly decides to marry Adam's brothers off to some girls from the town.\nDuring an attempt to accomplish this, Milly teaches Adam's rowdy, ill-behaved younger brothers some manners and social mores. She also shows them how to dance. At first, the brothers have a hard time changing from their \"mountain man\" ways, but eventually each comes to see that the only way he will get a woman of his own is to do things Milly's way. They try out their new manners and make an attempt to begin courting the girls. This takes place at a social gathering in the town (dance + barn-raising) , where they meet six women they like — Dorcas, Ruth, Martha, Liza, Sarah, and Alice. The girls take a fancy to the brothers as well. However, they already have suitors among the young men of the town, who jealously taunt the brothers into fighting during the barn-raising. At first the six brothers remember Milly's teaching and try to resist being drawn into a fight by accepting physical indignities. Adam refuses to let himself be pushed around by the rival suitors and calls his younger brothers cowards for letting them get away with their behavior. The girls' suitors from the town finally go too far when they attack Adam, provoking Gideon into fighting back. A free-for-all ensues in which the brothers dominate their physically weaker townie rivals. Although the Pontipees did not start the fight, they are banished from the town after demolishing the barn they were raising in the course of the brawl.\nWinter finds the six younger brothers pining for the girls for whom they had fallen fast and hard. Milly asks Adam to talk to the brothers as she fears they will want to leave because of missing the girls. Adam reads his brothers the story of \"The Sobbin' Women\" (taken from Plutarch's story of the Sabine Women), one of the books Milly brought to the homestead. He tells them that they should stop moping around and take whatever action is necessary to get their women. Aided by Adam, the brothers kidnap the six girls, then cause an avalanche in Echo Pass so that they cannot be followed by the townspeople. The only problem: they forgot to bring the parson to perform the marriages.\nMilly is furious with Adam, as are the six kidnapped women. Milly consigns the brothers to the barn \"with the rest of the livestock\" while the women live in the house. Adam, feeling betrayed by Milly's reaction, leaves for the trapping cabin farther up the mountain to live out the winter by himself, unknowingly hurting Milly's feelings. Soon after, Milly realizes that she is pregnant by Adam.\nThe winter months slowly pass. The women vent their frustration and resentment by playing pranks on the brothers, such as hitting them with rock-filled snowballs and dumping basins of wash water on them. By spring, the women have forgiven their \"kidnappers\" and fallen in love with the brothers, who are now allowed to court them. Milly gives birth to a daughter, Hannah. Gideon rides to the cabin to inform Adam of his daughter's arrival and asks him to come home. Adam refuses, saying that he had said he would return home only when the snow had melted enough that the pass was open to traffic.\nHaving time to think about his baby daughter, Adam returns home in the spring just as Echo Pass is opening and reconciles with Milly. As a newly responsible father, he has become aware of how worried the townspeople would be about what has happened to the six abducted girls. Adam realizes he was wrong to tell his brothers to kidnap them. He tells his brothers they need to take the women back to their homes in town, but his brothers are unwilling. The six women also do not want to return to their homes; they all want to stay at the farm with their new suitors and hide so they will not be taken back home. When Milly discovers that the women are not in the house, Adam tells his brothers to go after them and bring them back.\nThe townspeople arrive with the intention of lynching the Pontipee brothers for the kidnappings. Upon finding the brothers trying to force the women to return, the fathers believe their daughters are being assaulted and charge to their rescue. Alice's father (Ian Wolfe), a preacher, hears baby Hannah cry in the distance, and worries that the baby might belong to one of the kidnapped girls. The fathers and other townsmen round up the Pontipees and announce they intend to hang them.\nAlice's father, the Reverend Alcott, asks the women whose baby he had heard. They all decide, simultaneously, to claim the baby as their own. This misinformation gives the women and the brothers their wish: the townspeople, including the girls' fathers, insist that all six couples marry at once in a shotgun wedding, performed by the parson while Adam and Milly watch and the fathers stand behind their daughters' grooms, shotguns over their arms."}