{"mid": "SexAndTheCity", "IMDB_id": "tt1000774", "title": "Sex and the City", "plot": "=== Season 1 (1998) ===\nCarrie Bradshaw lives in Manhattan and writes a column called \"Sex and the City\". At a birthday party for Miranda, Carrie and her friends decide to start having sex \"like men\", meaning without emotional attachment. However, she realizes she cannot after getting brushed off by a man she has sex with one time later.\nCarrie has many chance encounters with a handsome businessman whom Samantha refers to as \"Mr. Big\". They begin to date, but Carrie is dismayed to find out he is still seeing other people. Although he eventually agrees to exclusivity, he doesn't introduce Carrie to his mother and won't refer to her as \"the one\", so rather than going on a planned vacation with him, Carrie breaks it off.\nCarrie sets up Miranda with her friend Skipper. Miranda and he date on and off; he is more laid back while Miranda is more forceful. After they break up, Miranda sees him with another woman and feels compelled to resume their relationship, but they again break up when he wants exclusivity and she does not.\nCharlotte dates a marriage-minded man but they clash over china patterns. She declines to have anal sex with another boyfriend and also consents to pose nude for a famous painter.\nSamantha sleeps with an artist who likes to videotape his encounters, with Charlotte's doorman, with a married couple, and with others. When she meets James, who seems utterly perfect for her, she's heartbroken to discover that he has an extremely small penis.\n=== Season 2 (1999) ===\nCarrie dates a baseball player while on the rebound but breaks it off when she realizes she's not over Big. She then dates a sell-out filmmaker, a shoplifter, and a nice guy she scares away by snooping, and then takes up with Big again. She at first keeps this from her friends. Her and Big's relationship is rocky, and when he announces that he might have to move to Paris for a year but doesn't overtly invite Carrie to come with him, they break up a second time. Carrie then tries without success to convert a friend-with-benefits to something more, dates a writer with a great family but who is always \"early\" in bed, and then a recovering alcoholic who uses Carrie to replace his old addiction. She then runs into Big, returned from Paris, and his new 20-something fiancee, Natasha (played by Bridget Moynahan).\nMiranda dates a dirty talker, fakes it with an ophthalmologist, and tries to adjust to a guy who likes to watch porn during sex. By the time she meets Steve, the bartender, she's unwilling to believe he is as nice as he seems. They start dating but the differences in their schedules and their finances lead to a breakup. She winds up back in bed with Steve, but not before dating a guy who wants to get caught, a Peeping Tom in the next building, and a divorced dad.\nCharlotte encounters a legendary purveyor of cunnilingus, a handy actor next door, a widower on the make, a man who undergoes adult circumcision, a famous actor, a too-effeminate pastry chef, a shoe salesman with a foot fetish, and a 20-something guy who gives her crabs.\nDespite a brief attempt at couples therapy, Samantha breaks up with James. She then sleeps with a litigator, a salsa dancer, her personal trainer, a sports fan who can only rally when his team does well, and Charlotte's brother. She then meets a man whose penis is too big even for her.\nThe end of Season two also marks the end of characters' talking directly to the camera.\n=== Season 3 (2000) ===\nCarrie starts off dating a politician, followed by a bisexual. Big marries Natasha, and Carrie meets Aidan, a furniture maker. They have a virtually flaw-free relationship until Carrie and Big begin an affair. When Natasha catches Carrie in Natasha and Big's apartment, Carrie and Big's affair ends as do eventually both Big's marriage and Carrie's relationship with Aidan.\nMiranda and Steve move in together. He tells Miranda he'd like them to have a baby, but a puppy purchase instead alerts Miranda to the fact that they're very different when it comes to maturity. Steve moves out and Miranda makes partner at her law firm. She also goes on to date a phone sex guy, a fake ER doctor, a guy who doesn't swallow his food, and a police detective.\nCharlotte, looking for a husband, dates an investment banker with an anger management problem, a photographer who gets her into menswear, a bad kisser, and a climax name caller. She then meets Trey MacDougal; despite an awkward \"proposal\", the discovery of his low libido and inability to perform sexually the night before their marriage, and conflict with his domineering mother, the two marry. They begin their marriage with a sexless honeymoon, and as sex remains an ongoing problem in their relationship, the two eventually separate.\nSamantha sleeps with a fireman, a short man, her assistant, a black guy with a disapproving sister, a recreational Viagra user, a guy who tastes bad, Trey's Scottish cousin, a dildo model, and a college-aged virgin. She also has a menopause scare, gets tested for HIV, and buys a new apartment in the Meatpacking District, where she has to make peace with the transgender women on her street.\nAfter Carrie's break-ups with Big and Aidan, she dates a guy who still lives at home, teaches a class at the Learning Annex on how to meet men, gets mugged, and tries to apologize to Natasha. She and Big also make an attempt at being friends.\n=== Season 4 (2001–02) ===\nAfter a chance meeting with Aidan at the opening of a bar he co-owns, Carrie convinces him to restart their relationship. He moves into her apartment after purchasing it when her building goes co-op and then proposes. Despite her misgivings, Carrie accepts the proposal and then eventually realizes she's not ready for marriage. Despite discussing her concerns and initially agreeing to give her more time, Aidan soon pressures Carrie for marriage. She realizes this is because he does not trust her, given her past affair with Big. They break up and he moves out, and Carrie purchases her apartment after Charlotte lends her the down payment in the form of the engagement ring she received from Trey. At the end of Season Four, Carrie discovers that Big has sold his apartment and is moving to Napa, California.\nCharlotte and Trey are living apart but continuing to have marital relations; they eventually reconcile and Charlotte moves back into their shared apartment. They decide to try for a baby but realize Charlotte is reproductively challenged; after fertility treatments and discussing adoption, their marriage breaks apart under the strain and they decide to divorce.\nMiranda supports Steve through testicular cancer and surgery. Later, when he feels emasculated by the surgery, they have sex and Miranda gets pregnant. She initially considers an abortion, which is particularly distressing to Charlotte, as she deals with her struggles to get pregnant, but Miranda decides to keep the baby.\nSamantha flirts with a priest, has nude photos taken of herself, tries to have a relationship with a lesbian, and sleeps with a baby talker, a wrestling coach, and a farmer. She then lands a big PR account with resolutely single hotel magnate Richard Wright. They begin a relationship that starts out as purely sexual but becomes something more to both of them, and they attempt monogamy. However, she eventually catches him cheating, and they break up.\n=== Season 5 (2002) ===\nCarrie spends time by herself in Season Five; she fears this means she will be fired from writing her sex column, but instead a publisher wants to turn the columns into a book. A book tour lands her in San Francisco, where she reunites briefly with Big. In New York, she meets Jack Berger, a fellow author with whom she feels sparks, but who is attached.\nSamantha tries again with Richard but cannot overcome her lack of trust in him, and she breaks it off for good.\nMiranda is now mother to son Brady and finds it difficult to work, date, and carry on her previous lifestyle. Steve is supportive, and she falls into bed with him one afternoon, making her question her feelings for him.\nCharlotte has a run-in with her former mother-in-law over the legalities of the apartment she shared with Trey, and she hires Harry Goldenblatt as her divorce attorney. Despite his physical shortcomings she finds herself attracted to him, and they begin a sexual relationship. She soon finds that she is developing real feelings for him. Harry, however, reveals that he must marry within his Jewish faith, causing Charlotte to actually consider conversion.\n=== Season 6 (2003–04) ===\nCarrie begins dating Jack Berger, who is termed her best 'mental match' of all her relationships. However, his struggles as an author and her success with her upcoming book cause too much conflict between them, and they break up. Big returns to New York for angioplasty, and Carrie realizes she still has feelings for him; she also realizes he still cannot fully commit. After he returns to Napa, she meets Aleksandr, a famous Russian artist. Aleksandr seems to be attentive to her in a way that Big never was, and he asks her to come to Paris with him. She does, briefly, but realizes how inattentive he is when working, and she breaks it off with him just as Big arrives in Paris, looking for her, ready to finally commit to her being \"the one\".\nCharlotte decides that life with Harry, who accepts her fertility issues, would be worth converting to Judaism. After this process, she presses Harry to \"set the date\" in an insulting way and he breaks it off with her. However, they run into each other at a mixer and, after her tearful apology, rekindle their relationship and eventually marry. After fertility treatments fail, they decide to adopt, and eventually learn they have been approved to adopt a child from China.\nOnce Miranda realizes she's still in love with Steve, he begins a serious relationship with someone else (Debbie), and so she does the same with Robert (played by Blair Underwood). However, at their son Brady's first birthday party, they reveal their feelings for each other and renew their relationship. Miranda proposes to Steve and they marry in a community park. Needing more room for their growing family, she consents to moving to Brooklyn, where they buy a brownstone. After Steve's mother Mary (played by Anne Meara) is revealed to have suffered a stroke and subsequent memory loss, she moves in with the couple.\nSamantha begins a relationship with a much younger waiter, Jerry Jerrod, who turns out to be a struggling actor. She uses her PR skills to help his career, even changing his name to Smith Jerrod. Despite trying to keep their relationship as casual as her others, she develops true feelings for him. Smith supports her after she is diagnosed with breast cancer, shaving his own head in sympathy after catching her shaving her head when chemotherapy makes her hair fall out. He also insists on waiting for her when her treatment diminishes her sex drive. When he flies home from his movie shoot just to tell her that he loves her, she replies, \"You have meant more to me than any man I've ever known.\"\nThe season and the series concludes with the four girlfriends reunited in New York City, and with Carrie receiving a phone call from Big (which finally reveals his first name, John), telling her that his Napa house is up for sale and he is headed back to New York. Carrie's final voiceover states: \"The most exciting, challenging and significant relationship of all is the one you have with yourself. And if you find someone to love the you you love, well, that's just fabulous.\""}