{"mid": "SexEd", "IMDB_id": "tt2751310", "title": "Sex Ed", "plot": "Ed Cole (Haley Joel Osment) feels like he is letting his life go by without him. He leaves his job at a bagel shop and works as an after-school detention teacher after impressing the principal (Matt Walsh). He moves out of his apartment, allowing his roommate JT (Glen Powell) to engage in kinky sex with his girlfriend Ally (Castille Landon). While working with his students, Ed realizes most of the troubled youths are sexually confused, and begins an after school sex ed program. At the same time JT convinces Ed to have sex with someone to end his dry spell, leading to a disastrous blind date with Trish (Abby Elliott), a former co-ed.\nEd seeks counsel from his landlord Sydney (Retta), who also owns a bar in the apartment building. He meets Pilar (Lorenza Izzo), the adult sister of his student Tito (Kevin Hernandez). He and Pilar hit it off, and she invites Ed to her house for dinner after Tito tells her Ed is his favorite teacher. Pilar's boyfriend Hector (Ray Santiago) belittles Ed and threatens him, leading to the two competing by taking shots of rum. Ed gets sick and vomits on Pilar and Tito's mother, Lupe (Laura Harring). Later Ed apologizes to Pilar, who tells him she and Hector are taking a break. Ed asks her on a date, which she accepts. With the help of JT and Ally, Ed gets his students interested in learning, to the point that other children attend the after school class out of interest.\nAt the same time Ed's student Leon (Isaac White) gets sent to the principal's office for his behavior, leading to his father Reverend Marcus Hamilton (Chris Williams) challenging Ed's qualifications and reasoning to teach sexual education to the children. Ed asks the Reverend to sit in on a class, but the Reverend is not impressed and decides to shut down the program. Tito tells Ed he wants to have sex with his girlfriend and asks for a condom. Ed tells Tito it's not a good idea, but Tito says he'll do it anyways, forcing Ed to give him a condom. Pilar finds out about this during her date with Ed, and goes home to stop Tito. Ed angrily leaves, but is confronted and beat up by Hector. He then attempts to hire a prostitute, but is caught by the police.\nEd admits to JT that he is a virgin, a fact JT previously knew but chose not to call Ed out on. Ed returns to work at the bagel shop, but then with Sydney's help decides to make a grand gesture to win Pilar back. He plays the oboe for her, despite not being very good at it. Ed and Pilar make up and go on a second date. Pilar decides to visit her favorite club, but Ed is not allowed in by the bouncer (Lamorne Morris). Pilar tells him she'll be right back, but the bouncer assures him she won't be. Hector, in line for the club, confronts Ed, and Ed punches Hector, resulting in the police arresting Ed again. Motivated by his anger, Ed forces his way into Reverend Hamilton's support group with his class, insisting the importance of sex education, which the children support. Ed goes as far as admitting he is a virgin in front of everyone. For his demonstration, Reverend Hamilton is impressed and decides to allow the class.\nPilar shows up at Ed's apartment and tells him she wants to be his first sexual partner, but bitter that she abandoned him at the club, Ed turns her down. She leaves angrily, but passes JT in her underwear, impressing him. Ed is upset that he still has not had sex, but Sydney tells him he is a man now because he is in control of his life, and it has nothing to do with his virginity. A year later, Ed is shown to have one of the most popular classes at the school, and the respect of his students."}