{"mid": "SgtBilko", "IMDB_id": "tt0117608", "title": "Sgt. Bilko", "plot": "Master Sergeant Ernest G. Bilko is in charge of the motor pool at Fort Baxter, a small United States Army base that develops new military technology. Exploiting this position, he directs a number of scams, ranging from gambling to renting out military vehicles. His commanding officer, Colonel John Hall, overlooks Bilko's money-making schemes, as he is more concerned with problems in the hovertank that the base is designing.\nMajor Colin Thorn, an officer from the U.S. Army Inspector General's office, arrives at the camp and begins to scrutinize Bilko's record. Officially, Thorn is at Fort Baxter to conduct a general inspection and determine if the base should remain open in light of recent defense cutbacks. He is also determined to get revenge on Bilko to settle an old score the two have from Fort Dix, where Thorn was nearly court-martialled after a fixed boxing match resulted in Thorn being shipped to Greenland.\nBitter and unprincipled, Thorn is not above breaking the law to ruin Bilko. He attempts to steal Bilko's long-time fiancée Rita, whom Bilko has stood up at the altar more than a dozen times. Rita is tired of waiting and gives Bilko 30 days to win her back or lose her for good.\nBilko, with the help of newly assigned Private First Class Wally Holbrook, devises a means of avoiding Thorn's attempt to transfer him to Greenland: He rigs a demonstration of the base's malfunctioning hovertank, staged before a four-star general and numerous dignitaries. Since Thorn had deliberately tried to sabotage the tank the previous night, he confronts Bilko, Hall, and the general, loudly insulting Bilko and Hall. While ranting he confesses to sabotaging the hovertank. Thorn is sent off again to Greenland.\nThe last day of Rita's ultimatum has come. Just as she sadly begins to write Bilko off forever, Rita hears men outside her house, serenading her with one of her and Bilko's favorite songs. Looking out, she sees Bilko and his platoon. Bilko asks Rita to marry him, and she accepts."}