{"mid": "ShadowOfTheVampire", "IMDB_id": "tt0189998", "title": "Shadow of the Vampire", "plot": "Bram Stoker's widow has refused to sell the film rights for Dracula\nto F.W. Murnau, so Murnau [John Malkovich] decides to film it anyway, changing the names of\nthe characters, the title, and the locations. Thus, Dracula becomes\nNosferatu, Transylvania and England become Germany, Count Dracula\nbecomes Count Orlock, and Mina becomes Ellen. After filming the beginnings\nof the movie on a soundstage in Berlin, Murnau is anxious to get cast and\ncrew to Czechloslovakia where they will be meeting up with Max Schreck [Willem Dafoe],\nthe vampire hired by Murnau to play an actor playing a vampire.Murnau introduces Max Schreck as a character actor from the Reinhold\nCompany and explains that Schreck will remain in character at all times.\nYet no one, not even producer Albin Grau [Udo Kier] knows anything about him. As a\nvampire, Schreck is no Dracula. He is old and bald. He can't remember his\nhumanity; he knows only that his turning had to do with a woman, whose\nface has long ago passed from his memory. He has lost most of his powers,\ne.g., his strength and his ability to pass through locked doors. He hasn't\nseen the light of the sun for centuries. He lives in the filth of an\nabandoned abbey, keeping himself alive on the blood of the occasional rat\nhe can catch. He thinks the saddest part of Dracula, which he read after\nMurnau gave him a copy, is when Dracula was forced cook for Harker because\nhe had no servants. He reads and angsts over Goethe's poem about Tithonus,\na mortal who wished for immortality but forgot to ask for external youth\nand is now aged, powerless, and yet must endure...just like himself. He\nhas agreed to make this film only because Murnau has promised to provide\nhim with blood during the filming and, at the end of the movie, Murnau has\npromised that Schreck can feed on Greta [Catherine McCormack], the actress who is playing Ellen\nHarker.As the filming progresses, Schreck's performance is both inspiring\nand creepy, inspiring in how he captures the essence of the vampire and\ncreepy in his own personality and mannerisms. To add to the creepiness,\nthe local villagers are extremely anxious about the nosferatu,\nparticularly after photographer Wolfgang Mueller [Ronan Vibert] is found weak and dazed.\nWhile filming the scene where Jonathan Harker cuts his finger with a bread\nknife, Schreck loses control and takes more blood from Wolfgang, forcing\nMurnau to threaten Schreck with the admonition that he cannot harm his\npeople or there will be no Greta. Schreck is able to contain himself,\nfeeding on the blood of ferrets, rats, and bats and on the occasional\nbottle of blood that Murnau supplies, but one thing Schreck refuses to do\nis to film at sea. Consequently, Murnau is forced to build a replica of\nthe ship on dry ground for the sailing scenes. However, the final scenes\nof the movie, where Orlock feeds from Ellen and is killed in the morning\nsunlight, must be shot on the island of Heligoland, so Murnau agrees to\nfly Orlock there. Unfortunately, Wolfgang is too far gone and must be\nreplaced by another photographer, Fritz Wagner [Cary Elwes].By now, Murnau's people are beginning to suspect that Schreck is a\nreal vampire. All the cast and crew members lock their bedroom doors at\nnight. Albin and Fritz have gone in search of his coffin but found\nnothing. Their suspicions are confirmed when one night they come upon\nMurnau in a laudanum stupor. While under the influence, Murnau blurts out\nthat there is no Max Schreck. He found him in a book about despotic\nSlovakian rulers reputed to be vampires and then, while Murnau was\nscouting out locations in Czechloslovakia, he came upon him living in the\nold monastery. When Fritz asks Murnau what he promised Schreck in return\nfor acting in his movie, Murnau tells the truth: Greta. Albin and Fritz\nare appalled but agree to go ahead that night with the filming of the\nfinal scenes.Murnau has set up the final bedroom scene in an old warehouse that is\nlight-tight, but he has taken care to install a safeguard...a door to\nallow daylight to come streaming into the room at the flick of a switch.\nGreta, dressed in a nightgown, is positioned on the bed. Orlock is on the\nset, his eyes filled with lust for Greta and following her every move.\nFritz is behind the camera, ready to shoot. Albin is standing by, and\nMurnau begins barking out directions.\nJust as the camera is about to roll, Greta notices that Schreck casts\nno reflection in the mirror next to her bed. She begins to scream, so\nMurnau shoots her with laudanum, which knocks her into a compliant stupor.\nSchreck is almost beside herself. 'I vant her now,' he hisses, but Murnau\nrefuses until after he has shot the death scene. When those shots are\ncompleted, Schreck can contain himself no longer and pounces at Greta's\nneck. Amazingly, Murnau keeps the film rolling as Schreck drinks and\ndrinks. After drinking his fill, Schreck falls asleep, as evidenced by his\nsnores. Murnau, Albin, and Fritz wait.It is daybreak. Hoping to get a more realistic death scene, Murnau\norders that the door be opened to flood the room with sunlight.\nUnbeknown to Murnau, however, Schreck has found the trap and dismantled\nit. In releasing the lever, the noise awakens Schreck, who becomes irate\nat being tricked. Fritz attempts to fire on him, but Schreck is impervious\nto bullets and breaks Fritz's neck. Then he chokes Albin. Meanwhile,\nMurnau has taken over the camera. He informs Schreck that this ending is\nunworkable and requests that he return to his original mark. Amazingly,\nSchreck complies, returning to Greta's neck for another sip of blood. Just\nthen, the outside crew breaks down the door, allowing the sunlight into\nthe chamber, and Schreck dies again...this time for real.\nAfter ending the shot, Murnau looks up from the camera and says, 'I\nthink we have it.' [Original Synopsis by bj_kuehl.]"}