{"mid": "ShanghaiExpress", "IMDB_id": "tt0023458", "title": "Shanghai Express", "plot": "In 1931, China is embroiled in a civil war. Friends of British Captain Donald \"Doc\" Harvey (Clive Brook) envy him because the fabulously notorious Shanghai Lily (Marlene Dietrich) is a fellow passenger on the express train from Beiping to Shanghai. Since the name means nothing to him, they inform him that she is a \"coaster\" or \"woman who lives by her wits along the China coast\" – in other words, a courtesan. On the journey, Harvey encounters Lily, who turns out to be his former lover, Magdalen. Five years earlier, she had played a trick on Harvey to gauge his love for her, but it backfired and he left her. She frankly informs him that, in the interim, \"It took more than one man to change my name to Shanghai Lily.\" When Lily makes it clear that she still cares deeply for him, it becomes apparent that his feelings also have not changed, and he shows her the watch she gave him with her photograph still in it.\nAmong the other passengers are fellow coaster Hui Fei (Anna May Wong), Lily's companion; Christian missionary Mr. Carmichael (Lawrence Grant), who at first condemns the two \"fallen women\"; inveterate gambler Sam Salt (Eugene Pallette); opium dealer Eric Baum (Gustav von Seyffertitz); boarding house keeper Mrs. Haggerty (Louise Closser Hale); French officer Major Lenard (Emile Chautard) and a mysterious Eurasian, Henry Chang (Warner Oland).\nChinese government soldiers board and search the train and apprehend a high-ranking rebel agent. Chang then makes his way to a telegraph office and sends a coded message. Later, the train is stopped and taken over by the rebel army and its powerful warlord, who turns out to be Chang. Chang begins to question the passengers, looking for someone important enough to exchange for his valued aide. He finds what he wants in Harvey, who is on his way to perform brain surgery on the Governor-General of Shanghai. Chang offers to take Shanghai Lily to his palace, but she claims she has reformed. When Chang refuses to accept her answer, Harvey breaks in and knocks him down. Because Chang needs Harvey alive, he swallows (but does not forget) the insult. Chang then has Hui Fei brought to him in his quarters, where he forces himself on her.\nThe government releases Chang's man, but Chang decides to blind Harvey for his insolence. Out of love, Lily offers herself in return for Harvey's safe release. Harvey remains unaware of the danger he is in and Lily's reason for going with Chang. Chang is stabbed to death by Hui Fei who tells Harvey what has transpired. Finding Lily, the trio boards the train and depart before the body is discovered. The missionary Carmichael, trusting his instincts, gets Lily to reveal the truth about saving Harvey. She insists that he not enlighten Harvey, because love must go hand in hand with faith. When the train finally reaches Shanghai safely, Lily offers Harvey her love unconditionally, but demands the same in return. Harvey finally breaks down and embraces her."}