{"mid": "Sharknado2TheSecondOne", "IMDB_id": "tt3062074", "title": "Sharknado 2: The Second One", "plot": "Fin Shepard (Ian Ziering) and April Wexler (Tara Reid) are on a plane headed for New York City for a signing of April's book, \"How To Survive A Sharknado\". The flight attendant (Kelly Osbourne) is a fan and asks for an autograph. She calls Fin a hero, but the events of the last \"sharknado\" in L.A. have left him rather traumatized and shaken. In a segment reminiscent of a Twilight Zone episode, Fin looks outside his window notices thunderclaps and strange things flying in the sky. He sees a shark hit the wing of the plane, and he starts to panic. The flight attendant and air marshal calm him down, but suddenly, a whole bunch of sharks start flying everywhere, and one gets sucked into the plane's turbines. The engine breaks off and opens a big hole in the plane, sucking people out and letting some sharks in. Both pilots (Robert Hays and Rachel True) are eaten, forcing Fin to walk into the cockpit and take control of the plane. April almost gets sucked out, but she hangs on for dear life. The air marshal passes her his gun. She shoots a scarred shark, which bites off her left hand. Fin manages to land the plane very roughly.In the next scene in New York's Times Square, we meet Fin's older sister, Ellen (Kari Wuhrer), along with her teenage daughter Mora (Courtney Baxter), Ellen's husband Martin Brody (Mark McGrath), and their 20-something son Vaughn (Dante Palminteri) sightseeing in the city. Fin and Martin were once best pals but they stopped talking to each other once Martin married Ellen. Martin and Vaughn go check out a Mets game at Citi Field while Ellen and Mora meet up with her friends Polly (Sandra Denton) and Chrissie (Tiffany Shepis) to go to check out the Statue of Liberty. They tell Ellen about the plane accident. She calls Fin, who is at the hospital with April. She is being treated for her missing limb and severe blood loss.Meanwhile, Matt Lauer and Al Roker (both playing themselves) report on the news that strange weather is hitting the Big Apple. There appears to be snow headed by, along with rain.Fin meets up with Martin and Vaughn at Citi Field since Ellen left him a ticket. He learns that since Citi Field is close to the water, the storm and the sharks will hit there first.There, he reunites with old friend Bryan (Judah Friedlander) and Skye (Vivica A. Fox). Skye apparently used to date Fin and still has feelings for him. She kisses him but he tells her he's with April. Bryan also meets one of his favorite baseball players, Harland \"The Blaster\" McGuinness (Richard Kind), who played a bad game and failed his father. The storm then starts to hit the stadium, with sharks starting to fall on the place. Fin tells his friends to grab what they can from the gift stand, so they grab bats to swing back against the sharks. Harland even ends up whacking a shark into the Citi Field sign.The sharks start coming down all over the ocean as the four ladies leave Liberty Island. On the ferry back to Manhattan, a shark lunges at them, mauling Chrissie's face until Ellen kills it. Chrissie dies from her wounds. Once they get off the ferry, they run for their lives. The storm intensifies so heavily that it breaks off the head of the Statue of Liberty, crushing a man in the process. The ladies make it onto a garbage truck, but the men operating it are also crushed by the head, so Ellen must drive them to safety.Meanwhile, Fin and company board the subway. He and Martin wonder to each other just why they stopped talking to each other when they used to be \"the dynamic duo\". Unfortunately, the train starts to flood, so Fin orders everybody to move to the next car. Bryan ends up getting eaten by a shark, as does Perez Hilton. Fin fights off the shark that has made it onto the train. Vaughn hits the emergency brakes, and everybody runs out of the subway. For a moment, Fin doesn't appear to get out of the train, but he shows up.On the street, the gang hails a taxi driven by a guy named Ben (Judd Hirsch), who gave Fin a lift to Citi Field and is also a fan of his heroics. Fin devises a plan to throw a bomb into the sharknado to stop it like last time. They just need to find a place that has a lot of weapons, including chainsaws and propane tanks. Ben stops at a pizza place where Fin finds an old friend who owes him something. He appears hesitant, until a shark falls through the ceiling. The man stabs the shark and Fin whacks it into the oven. The guy lets Fin take whatever he needs.The streets start flooding heavily. The cab gets flooded and sharks start surrounding it. They set up a rope to swing to safety. Skye and Vaughn make it across together, followed by Martin. Ben tries to swing, but he gets pulled down and killed by sharks. Fin hops onto the sharks Frogger-style to get to his friends, giving Martin a perfect opportunity to make a \"jumping the shark\" joke.Fin, Martin, Skye, and Vaughn make it to a hotel, where Ellen and Mora meet them after Polly is crushed by a whale shark. Fin and Skye ride the elevator to the roof to hurl their bombs into the sharknadoes. From their conversation, we learn that Fin and Skye did love each other, but Fin didn't have her father's approval. She says that should not have mattered to either of them. They get to the roof, where they make a slingshot and launch the bombs into the sharknadoes. However, they are not strong enough to make any significant damage. Instead, Fin sets the sharks on fire, which fall down and crush/burn everyone. Downstairs, it starts to flood, making Martin, Ellen, Mora, and Vaughn run upstairs. They are met halfway by Fin and Skye, who are outrunning the flaming sharks. They find a fire escape, but Martin and Fin must distract a shark to get the fire axe to break the door open. They get out, but not before Fin swings his axe at a shark.April makes her way out of the hospital as it starts to flood. She helps a young girl get out safely where she is escorted by a nurse. April then boards a fire truck and finds Fin and the others to take them to the Empire State Building, as a third sharknado is trying to merge with the other two. Fin stands among the New Yorkers and rallies them together, stirring up their confidence with New York pride (and the fact that he chainsaws a shark in half before everyone else), because when something bites New Yorkers, NEW YORKERS BITE BACK!Fin and Skye get into the ESB where they plan to take out the sharknadoes by blowing up a tank of Freon. Fin makes it to the top of the tower, with Skye staying downstairs to make sure the cables stick together. A lightning bolt hits the cables, causing the tank to explode and send an electrical surge into the sharknadoes. The explosion hurls Fin and Skye into the air, where Skye is ripped apart by a shark. Fin rides the scarred shark that bit off April's arm with a hook, impaling it on the top of the tower. All the other sharks come falling down, and the New Yorkers grab their weapons and take out every shark they can. Another shark comes down on the tower, but April takes it out with an electric saw attached to her arm.Fin pulls April's arm out of the scarred shark's mouth and takes off her ring, proposing to her again. She accepts and they kiss. The New Yorkers cheer them on, and a truck full of fireworks blows up, sending colorful explosions into the air. Fin tells April that he loves New York.The final word 'FIN' appears in the form of building lights on the Empire State Building.A scene during the end credits shows Fin eating a slice of pizza at the same pizza parlor where he earlier asked for help."}