{"mid": "Sharknado", "IMDB_id": "tt2724064", "title": "Sharknado", "plot": "The movie opens with a sea captain and his crew illegally capturing sharks off the coast of Mexico and slicing off their fins, tossing the dead sharks back into the sea. An Asian man, known only as Mr. Palmer, is seen below deck with the captain, Santiago, and the man offers $100,000 for the captain's cache of shark fins. Captain Santiago scoffs at the offer and asks for $1,000,000. When Palmer questions why (the shark fin soup offered to him by the captain was 'good, not great') Santiago states that a record-breaking pod of 20,000 sharks is passing through the waters, implying the catch will be well worth the price. When Palmer offers $500,000, the captain pulls out a loaded gun and lays it on the table, and Palmer reluctantly agrees to the $1,000,000, and offers $100,000 hidden in a tackle box as down payment. The captain seals the deal by telling the man that he knows the secret to shark fishing -- that man should not be afraid of the sharks, but the sharks should fear man. A storm kicks up on deck, and the captain goes to investigate. Returning below deck, he finds Palmer, the gun and the tackle box missing. Santiago and Palmer confront each other on deck while sharks begin to jump aboard the ship and chomp various crew members. Palmer and Santiago are both eaten as the sharks are shown swimming in greater and greater numbers around the ship whilst the storm swirls around the now-empty boat.At the Santa Monica Pier, beach goers are preparing to surf, and we meet Finley \"Fin\" Shepard (Ian Ziering) and his best friend Baz (Jaason Simmons). Fin is a former champion surfer who now owns a bar built on the outer edge of the pier, surrounded by ocean. Fin is excited about the announcement that a storm brewing in Mexico will soon reach their shores, bring great surf. Inside the bar, George (John Heard) is a patron with a permanent seat, always perched on his red stool. He regularly flirts with the waitress Nova (Cassie Scerbo). Nova has a mysterious scar on her leg that she will not discuss.A little later, while Fin is walking down the beach and enjoying looking at the surf, he witnesses a fellow surfer get chomped by a shark. Baz, who is nearby on a jet ski, tries to get to Fin, but Fin is too busy trying to get the attention of the other people in the water, yelling that there is a shark. Soon it is obvious there are many sharks, and chaos ensues as the people in the bar hear the commotion and run out, the folks on the sand panic, and the people in the water experience various forms of shark-bite injuries.Baz is attacked on the jet ski by a shark that leaps out of the water and bites his leg. Fin paddles over and bravely rams it with his surfboard, and the shark lets go. Fin and Baz head inland on the jet ski.On shore, medics are ready to assist Baz with the minor \"flesh wound\" to his leg, while others are writhing on the beach missing limbs. Nova shows up, and chastises Fin for not being more careful - she clearly has a crush on Fin, who reminds Nova that he is too old for her. Meanwhile, Baz is providing comic relief while he gets a bandage on the 6-inch long gash on his leg.With everyone safely back inside the bar a short time later, the storm gets worse, and Fin is nervous. He insists on calling April (Tara Reid) his ex-wife to make sure she and his teenage daughter Chloe (Aubry Peebles) are safe. Nova is surprised to learn her boss has an ex-wife and daughter. With April clearly hostile on the phone, Fin insists on coming to get them since the storm will cause flooding and the house is less than 10 miles from the beach. April advises Fin that he need not be responsible for them anymore because her boyfriend Colin (Christopher Wolfe) says everything is fine.As the storm rages outside, and the waves pummel the windows of the bar, Fin decides to go see April and Chloe anyway, and announces the bar is closed. As he says this, a shark bursts through the front window of the bar, carried in on a massive wave. As the great white wriggles along the ground looking for humans to chomp, Nova grabs a pool cue and stakes the shark right through the head. Nova really, really hates sharks.As the people run from the bar and try to escape the storm, sharks begin flying through the air, propelled by the water and winds, and chomp quite a few people. The group of Fin, Nova, Baz and George agree that they need weapons, and each one gets an item from the bar. Nova takes a pump-action rifle from behind the bar, and George takes his barstool. The storm loosens the Ferris wheel on the pier, and the wheel begins to roll, chasing down and crushing a few people lucky enough to escape the sharks.As the winds calm down, Fin sees his bar destroyed, and the area is flooded with ocean water as the sea rises. In the flood waters are hundreds of sharks, obviously from the large \"pod\" mentioned earlier. The group of friends decides to help Fin on his quest to get to April and Chloe, and pile into Fin's truck.Getting to the house is an adventure, as the group encounters much flooding (Fin's truck has a sealed engine so he can get the through the water) and many stranded motorists. As the storm gets worse, so does the flooding, and soon sharks are swimming right alongside the truck. At various points, the group stops to assist people, and Nova is very handy with the rifle as she shoots more than her fair share of sharks. George is the first casualty, when he uses his barstool-weapon to break a window for a dog locked in a woman's car. A shark swallows him in front of the stunned friends.When Fin, Baz and Nova arrive at the enormous and beautiful ex-home of Fin's, April is still angry. She insults Nova and Baz, and won't listen to Fin when he warns her that the flooding and storm is coming. Suddenly, a shark bursts forth out of a manhole (from the sewer system) and Nova blasts it with the shotgun like a skeet shooter. April lets the group in the house. Inside, April is still in denial and Chloe is a brat. Boyfriend Colin then makes an appearance and tells Fin that until his monthly visitation week arrives, Chloe is none of his business. Fin tries to tell April about the sharks, and Colin steps up to the living room window to show Fin there are no sharks when . . . BAM! One comes flying through the window at him. Baz, Fin and Nova try to rescue him, but he's torn to bits. Now April is convinced, and agrees to go with them further inland. Chloe mentions that they have to get Matt (Chuck Hittinger) who is in flight school in Van Nuys. Nova is shocked to learn Matt is Fin's son, and Fin is angry that no one told him Matt was in flight school.On the way to Van Nuys, many sharks are fought, and many lines are said that give homage to \"Jaws.\" Fin continues to show his good-guy nature by rescuing an entire school bus of teens, and Robbie the Bus Driver (Robbie Rist) dies a uniquely funny death.Along the way, the truck is destroyed during a shark encounter and Baz steals a tricked-out Humvee. Once in Van Nuys, the storm has reached hurricane proportions and three enormous waterspouts have formed over the ocean and come inland, each one swirling hundreds of hungry sharks in its funnel. Matt is found, his flight instructor is sucked out of the hangar into one of the funnels, and a few sharks fall out of the sky at various intervals and must be killed.Realizing the local nursing home residents are in trouble, and the town must be saved, Matt concocts a plan to throw homemade bombs into the twisters, hoping the explosion will equalize the pressure and neutralize the twisters and bring the sharks back down to earth. Because Matt is the only student at flight school with helicopter flying experience, he volunteers to go up and fly close enough to the twisters to toss the bombs in, and Nova volunteers to go with him. This seems to bond them, and they develop a mini-crush on each other, and Nova reveals the reason for the scar on her leg (a childhood shark attack that killed her family --marvelously clever Jaws reference inserted here).The conveniently-next-door hardware supply store provides the group with fresh ammo, bomb materials and Fin takes a liking to a chainsaw. Meanwhile, Baz starts working on plan B, rigging bombs up to the Humvee, saying he will sacrifice himself to drive the vehicle into the twisters if it comes to that. Fin stays on the ground with April and Chloe to kill the sharks that will rain down once the twisters die.In the sky, Matt and Nova neutralize two of the twisters rather easily, and the ground team kills a lot of sharks very creatively. Baz gets attacked and eaten. With one twister remaining, Chloe throws the bomb but it doesn't work. A shark chomps onto the choppers' \"skis\" and won't let go, tipping the chopper sideways in the air. Nova falls out and is swallowed whole by a great white soaring by while a terrified Matt watches.Fin realizes the third twister must be stopped and drives the Humvee close to the twister, sets the bomb, and jumps out at the last minute. The explosion stops the last twister. Matt manages to expertly land the chopper that is now on fire.As sharks rain around them, Fin returns to the group and sees a shark soaring through the air, straight at Chloe's back. Fin pushes his daughter to safety and, holding the running chainsaw out in front of him, manages to allow the great white to swallow him in one gulp. As his loved ones look on, the shark flops around on the ground, its stomach wriggling. Suddenly, Fin cuts through the shark from the inside, and emerges from the gooey insides of the man eater. Reaching in, he pulls out Nova, who is unconscious. A shark-goo covered Nova gets CPR from a smitten Matt and survives, while April reluctantly kisses the super-gooey Fin, our movie's hero."}