{"mid": "Sheena", "IMDB_id": "tt0088103", "title": "Sheena", "plot": "While investigating rumors of a mystical \"healing earth\" whose powers are said to flow forth from the sacred Gudjara Mountain, geologists Philip and Betsy Ames (Michael Shannon and Nancy Paul) are killed in a cave-in, leaving their young daughter Janet an orphan.\nJanet is adopted by Shaman, a woman of the native Zambouli tribe (Princess Elizabeth of Toro), and because of a prophecy about the cave-in (\"when the sacred mountain cries out\") she is viewed as a child of the gods and renamed Sheena, Queen of the Jungle.\nAs she grows up, Sheena (Tanya Roberts) learns much from Shaman about the lore of the jungle and the ways of all its creatures. She is even entrusted with the secret of telepathic communication with the animals. Outsiders rarely disturb their territory, since that part of Tigora is under the special protection of King Jabalani (Clifton Jones).\nBut trouble is brewing in Tigora; the King's ex-football champion younger brother Prince Otwani (Trevor Thomas) is conspiring with his brother's fiancée, Countess Zanda (France Zobda), to have Jabalani assassinated so that they can exploit the titanium-rich Zambouli land. (This may or may not have something to do with the healing properties of the soil, but this is never explained).\nExperiencing a vision foretelling the death of the King, the Shaman hastens to Tigora's capital of Azan to try to warn him, but is arrested by corrupt police officers working for Zanda.\nOtwani's old \"friend\", reporter Vic Casey (Ted Wass), and his cameraman Fletch Agronsky (Donovan Scott) are in Tigora to do a story on the former football player. When King Jabalani is killed and the Shaman is framed for it, Vic and Fletch realize they are on to a much bigger story than they had anticipated.\nHeading to a remote prison compound to interview the Shaman, they bear witness to her rescue by Sheena and her animal friends: \"Chango\", an elephant; \"Marika\", a zebra; and \"Tiki\", a chimpanzee. As they escape back into the jungle after destroying the prison, Vic and Fletch follow. Soon after however, Shaman dies of injuries.\nOtwani obtains the services of Colonel Jorgensen (John Forgeham) and his small army of soldier mercenaries, the Black Berets. Their mission is to eradicate the Zambouli people so their territory will be open for strip-mining. Vic must join forces with Sheena to stop the evil Prince and his army, and along the way, Vic and Sheena fall in love.\nThe climax of the film takes place on the African serengetti, where Sheena leads her people against the mercenaries and Otwani. Vic gets wounded during a shootout in which he succeeds in killing Otwani. Vic is healed with the earth, and wants to stay with Sheena, but realizes if he tells his story to the outside world, then other corporations will destroy Sheena's home. Vic and his cameraman Fletch leave on an airplane back to New York. Before leaving, Sheena records a farewell message on his tape recorder, wishing him a safe journey."}