{"mid": "Shenandoah", "IMDB_id": "tt0059711", "title": "Shenandoah", "plot": "In the Commonwealth of Virginia in 1864, during the Civil War, family patriarch Charlie Anderson (James Stewart) and his six sons Jacob, John, James, Nathan, Henry, and Boy (who is 16) run the family farm, while his daughter Jennie (Rosemary Forsyth) and daughter-in-law Ann (Katharine Ross) take care of the housework. The family has no slaves. Though Charlie attends church weekly and considers himself a \"God fearing\" man, he doesn't give God credit for anything, but takes credit for himself especially during dinner prayer. He internally blames God for taking his wife from him. His family is constantly late for church and will force people out of their seats to make room for his family, much to the annoyance of the preacher and congregation.\nCharlie's oldest son Jacob (Glenn Corbett) wants to join the war, but Charlie repeatedly tells his family that they won't join the war until it concerns them. Although a few of the boys want to join, they respect their father's wishes and remain on the farm. Charlie's daughter Jennie is courted by a young Confederate officer named Sam (Doug McClure). He wants to marry Jennie, and when Charlie gives his permission, the wedding occurs a few days later. As soon as the vows are said, a corporal rides up and announces that Sam is wanted back immediately. Sam leaves, much to the sorrow of his new bride. Shortly after Sam leaves, Ann then goes into labor, giving birth to a baby girl whom they name Martha in honor of Charlie's late wife.\nWhile out hunting raccoon, Charlie's youngest son Boy (Phillip Alford) and his friend Gabriel (Eugene Jackson Jnr.) stumble onto a Confederate ambush. They run away and stop for a drink at a pond. Boy is wearing an old rebel soldier kepi cap that he found at the river. When a union patrol comes on them, they take Boy as a prisoner of war, mistakenly thinking he is a rebel soldier. Gabriel runs to tell the Andersons what happened. When Charlie hears the news, he and his sons and daughter Jennie leave to look for Boy, leaving James (Patrick Wayne) and his wife Ann at the farm with their young baby.\nThe first place the Andersons look is a Union camp, but they are told there are no prisoners there, but Colonel Fairchild (George Kennedy), who also has a sixteen-year-old son, directs them to a possible location, where Confederate prisoners are shipped North via railroad. However, the captain anchorage refuses to allow Charlie to look through the cars, as he \"has schedules to keep\". So Charlie sets up a roadblock, then forces the conductor and Union troops to let him. He looks through the boxcars, but Boy is not there, so he mounts his horse to leave. As he looks up, he sees young Sam coming through the crowd. Jennie is overjoyed to see her husband. Sam leaves with the Andersons, telling the soldiers to burn the train and go home.\nAfter being taken to a different prisoner of war camp, Boy is befriended by rebel soldier Carter (James Best), who plans to escape and decides to let Boy come along. They and a few other men successfully make it out of the camp and start heading south. Coming onto a Confederate camp, they are involved in a skirmish. Carter is killed, and Boy is shot in the leg. A Union soldier almost kills him, but it turns out to be his friend, Gabriel, who instead helps him hide in a bush until after the battle.\nBack at the farm, scavengers raid the place, killing both James and Ann. On their way home, the Andersons run across a Confederate patrol. A young sentry, startled by the sound of horses, takes a shot at Jacob, killing him instantly. Charlie starts to kill the sentry, but stops to ask him his age. The sentry replies, \"Sixteen, sir.\" Charlie, remembering that his youngest son is sixteen, emotionally tells the sentry that he wants him to live and be an old man and have many sons. He wants him to know what it feels like to lose one of them.\nWhen the Andersons return home, the doctor tells them what happened to James and Ann. Their child Martha is still alive, with an African-American woman acting as her nanny, and Charlie takes her in his arms. Next day at the breakfast table, Charlie begins his standard prayer, but is so heartbroken that he can't finish it. He goes out to the family graveyard to see his wife's grave. He sees the graves of James, Jacob and Ann alongside hers, and he hears church bells ringing in the distance.\nAt the farmhouse, he demands to know why no one told him it was Sunday. The whole family gets dressed and ready for church, arriving as the singing begins. As the congregation completes the first song, the pastor (Denver Pyle) starts to announce the next hymn. Boy stumbles through the back door on a crutch. The whole congregation looks, and Charlie Anderson turns to see what is happening. His face lights up, and he helps his son to the pew. Everyone joyously sings in unison as the story ends."}