{"mid": "SherlockHolmesInWashington", "IMDB_id": "tt0036349", "title": "Sherlock Holmes in Washington", "plot": "British secret agent Alfred Pettibone carrying a vital secret document is murdered on his way to deliver it in the USA. The British government turns to Holmes for help. He deduces that Pettibone converted the document to microfilm. Avoiding an assassination attempt, he hurries to Washington with Watson to retrieve it before it falls into the hands of an \"international spy ring\". Holmes is certain that the spies do not yet possess the document, as people who were in contact with Pettibone on his journey have been harassed. Pettibone's body was then delivered to Holmes by the spies as means to throw Holmes off the track.\nBefore his death, the agent managed to pass the microfilm, hidden inside a \"V for Victory\" matchbook, into the unwitting hands of Washington debutante and bride-to-be Nancy Partridge. The matches get passed from hand to hand at a party unknowingly and end up in the inadvertent possession of the chief spy, Heinrich Hinkel (known as the seemingly respectable Richard Stanley in Washington), when he has Partridge kidnapped.\nHolmes tracks down the ring to an antiques shop, where he confronts Hinkel. During their cat-and-mouse conversation, he even tells the spy that \"the man who has it doesn't know he has it\", with the matchbook in plain sight. Holmes is taken prisoner, but just as he and Partridge are about to be murdered, the police, summoned by Watson by prior arrangement with Holmes, break in and, after a gunfight, rescue the pair. Hinkel gets away, along with the matchbook, however. Holmes races to the office of Senator Henry Babcock, having led Hinkel to believe the microfilm is under a stamp of a letter in the senator's possession. Holmes arrives first and, as Hinkel eavesdrops, reveals the importance of the letter. Hinkel takes the letter at gunpoint, only to have the police capture him. Holmes then takes the matches and sets fire to the letter, before revealing that the microfilm was in the matchbook all along."}