{"mid": "SherlockHolmesFacesDeath", "IMDB_id": "tt0036348", "title": "Sherlock Holmes Faces Death", "plot": "Dr. Watson is serving as resident doctor at Musgrave Hall in Northumberland, a stately home which is also used as a hospital for a number of servicemen suffering from shell shock.\nWhen Sally Musgrave displays her feelings for one of the wounded American fighter pilots, Captain Pat Vickery, who is currently recovering at the family estate, her brothers Geoffrey and Phillip are quick to show their dismay.\nThen one of the physicians working at the estate, Dr. Sexton, is assaulted by an unknown assailant when out on a walk. Dr. John Watson, who is in charge of the medical facility, goes to fetch his dear friend Sherlock Holmes to bring some clarity to the case of the attack.\nUpon his arrival to the estate, Sherlock Holmes discovers the dead body of one of the brothers, Geoffrey. Inspector Lestrade of the Scotland Yard is put on the case to solve the murder, and immediately arrests the captain as a suspect.\nHolmes is of another opinion about the flyer's guilt and continues to investigate on his own. Phillip is formally made the new head of the estate the next day with the aid of his sister. But after only one day of ruling the estate, Phillip too is found murdered, lying in the trunk of the car.\nLestrade suspects the family butler, Alfred Brunton, to be the murderer because Phillip had just fired the butler. Trying to arrest the butler, Lestrade gets lost in the manor's secret passageways. Meanwhile Holmes and Watson look into the special \"Musgrave Ritual\" that the family uses to appoint the new head of the family. They find the words used in the ritual hidden in Sally's room and try to copy the ritual, which involves replaying a giant chess game on the checkered floor of the house main hall. As pieces in the game they use the household staff.\nThe game gives them clues to the family's secret burial crypt underneath the house, and there they find Brunton murdered, clutching a case containing an old document. Holmes examines the body for clues and sets a trap for the murderer. After the others have retired for the day, Holmes sneaks back into the crypt and waits for the murderer to reappear. Before long, Sexton appears, where Holmes confronts him with the evidence that he has found and observed throughout the investigation. Sexton, however, manages to overpower Holmes and takes his revolver. Then Sexton confesses that he indeed is the one responsible for the murders. When he tries to shoot Holmes he discovers that the bullets are blanks. Lestrade and Watson come to the rescue and arrest Sexton.\nExplaining the meaning of the document found in the crypt to Sally, Holmes suggests that Sexton had discovered the old land grant that made the Musgraves worth millions of pounds, and then killed both brothers and implicated Capt. Vickery, hoping to marry Sally who would inherit the estate. Sexton also tried to frame the captain so that he could not marry Sally. Sally destroys the document, not wanting to be rich at the cost of others' lives.\nDriving away with Watson, Holmes muses on Sally's selfless act:\nThere’s a new spirit abroad in the land. The old days of grab and greed are on their way out. We’re beginning to think of what we owe the other fellow, not just what we’re compelled to give him. The time’s coming when we shan’t be able to fill our bellies in comfort while other folk go hungry or sleep in warm beds while others shiver in the cold; when we shan’t be able to kneel and thank God for blessings before our shining altars while men anywhere are kneeling in either physical or spiritual subjection. And God willing, we’ll live to see that day."}