{"mid": "ShesAGoodSkateCharlieBrown", "IMDB_id": "tt0174200", "title": "She's a Good Skate, Charlie Brown", "plot": "Peppermint Patty is practicing figure skating with her coach Snoopy (in a role modeled on real-life skating coach Carlo Fassi) for an upcoming competition, but the many days of getting up to practice at 4:30 A.M. are starting to take their toll, and she falls asleep constantly in class. One of her practices is halted briefly when a group of ten hockey players threatens her if she does not leave the ice so they can play. Patty and Snoopy take care of the situation by shoving the lead hockey players on each squad, causing both teams of hockey players to fall on top of each other like dominoes and be swept off the ice by Snoopy.\nLater that day after an afternoon practice, Marcie, who is observing, invites Patty over to her house for hot cocoa and cookies. Once there, Patty notices that Marcie has a sewing machine. Despite Marcie explaining that it is her mother's machine, and that she does not know how to sew, Patty commissions her to make a dress for the competition. With that settled, they head to a fabric store and buy the supplies (Peppermint Patty decides on denim, thus a \"jean dress\"). As expected, the dress does not come out good on Marcie's part, looking more like a sleeveless poncho, to which Marcie defends her mistake by saying she stated her poor sewing skills and the homespun outfit was Patty's idea, not hers. Patty heads back outside and almost tearfully shows Snoopy the mangled dress. He leads her back to Marcie's and, taking the dress from Patty, returns to the sewing machine and almost instantly sews the dress into a top-notch skating outfit.\nSnoopy is less helpful, however, when Patty complains that her hair is a \"mousey blah\" style. Snoopy brings in a large red gift box, and inside is a large red curly-haired wig that makes Patty look like Little Orphan Annie. After trying it on, Patty rolls her eyes and dumps the wig on Snoopy's head.\nThe day of the competition has arrived. All the contestants are first practicing altogether, then they clear while the Zamboni (driven by Snoopy) clears the ice. The first two contestants end up falling and get rather low scores. The third contestant does not fall, and gets such a good score that the pressure is on for Patty. Unfortunately, disaster seems to strike as her music tape goes haywire in the cassette deck. While Snoopy (who is also running the music for each contestant) frantically tries to fix it and ends up in a fight with the machine on the ice, Patty is starting to sweat as she holds her opening pose longer than she expected, and all the rest of the Peanuts characters in the audience worry that she will be disqualified. However, disaster is averted when Woodstock steps up to the microphone and whistles her music, \"O mio babbino caro\".\nPeppermint Patty receives the highest score, and has won the competition. She is shown on the stand with her trophy, while the runners-up stand below her with silver and bronze medals. On the way out, she is talking with Snoopy about her performance, and Snoopy is back as his grumbling, coaching self. She finally asks if he has anything nice to say, and she gets kissed on the cheek by him. At the end, Woodstock is shown bringing up the rear whistling the music again."}