{"mid": "ShHHHHH", "IMDB_id": "tt0048606", "title": "Sh-h-h-h-h-h", "plot": "A short, mild-mannered man, Mr. Twiddle, plays the congas in a nightclub jazz combo; the incessant noise (the horn players point their instruments directly at Twiddle's head) cause him to have nervous tremors, and he leaves in the middle of the act while the rest of the band continues to play. Later, his psychiatrist Dr. I.M Jittery tells him he is a \"very sick man\" suffering from \"trombonosis\" and recommends a relaxing trip to a quiet, secluded locale to restore his nerves. The doctor warns Twiddle of the consequences of not doing so (\"Your nervous system will shatter, you will simply...blow up!\"), and has his wife (a nurse) make travel arrangements.\nTwiddle takes a plane to the Swiss Alps and checks in at the Hush-Hush Lodge, a mountaintop resort hotel which goes to great lengths to maintain absolute silence for its guests (extending even to the desk bell, from which a little sign reading \"DING!\" pops out instead of audibly ringing). A porter escorts Twiddle to his room, communicating entirely with written cards (including one reading \"CHEAP SKATE!\" after receiving a tip of only a nickel). Twiddle changes into a nightshirt, stubs his toe on an ottoman (sign: \"OUCH!\"), and settles in for a peaceful night's sleep.\nMeanwhile, next door a pair of porters are moving another guest's belongings in, ominously including a trombone. Soon, the unseen neighbor begins playing, waking Twiddle. While he unsuccessfully tries to shut out the noise, a woman in the same room as the horn player starts laughing. Soon the musician, a deep-voiced man, starts laughing as well. Twiddle repeatedly attempts to ask the neighbors to be quiet, but is rudely and physically rebuffed each time; he soon resorts to violent tactics himself (a club, a cannon, a bomb, and finally a safe suspended by a rope), but they backfire on him as well. The entire time, the noisy neighbors are never seen, except for an occasional hand.\nEventually Twiddle's nerves give out; on the verge of a nervous breakdown, he begs the hotel's manager to find a doctor. He is quickly taken back upstairs...to the room next to his own, where the occupants are still laughing hysterically and playing the horn. Twiddle sees to his shock that his neighbors are Dr. I.M. Jittery and his wife/nurse, who have been unaware that their own patient was next door. Twiddle boils into an apoplectic rage, as Dr. Jittery reminds him of his nerves, to no avail--Twiddle explodes in a puff of black smoke. Dr. Jittery sheepishly remarks to the camera, \"people just won't listen to their doctor's advice.\" He and his wife then carry on laughing maniacally and honking on the trombone over the end title card."}