{"mid": "ShipOfFools", "IMDB_id": "tt0059712", "title": "Ship of Fools", "plot": "The characters board a German ocean liner in Veracruz, Mexico, for a voyage to Bremerhaven, Germany, along with 600 displaced workers in steerage, being deported from Cuba back to Spain, and a not-so-exotic band of entertainers, for whom the voyage is just a job. Some are happy to be bound for a rising Nazi Germany, some are apprehensive, while others appear oblivious to its potential dangers.\nThe ship's doctor, Schumann (Oskar Werner) (with dueling scar), takes a special interest in La Condesa (Simone Signoret), a countess from Cuba who has an addiction to drugs and is being shipped to a Spanish-run prison on Tenerife. Her sense of certain doom is contrasted by the doctor's determination to fight the forces of oppression, embodied by his insistence that the people in steerage be treated like human beings rather than animals. The doctor himself has a secret, a terminal heart condition, and his sympathy for the countess soon evolves into love.\nSeveral passengers are invited to dine each night at the captain's table. There, some are amused and others offended by the anti-Semitic rants of a German businessman named Rieber (José Ferrer) who – although married – is beginning an on-board affair with a busty blonde (Christiane Schmidtmer). The Jewish Lowenthal (Heinz Rühmann) is invited instead to join a dwarf named Glocken (Michael Dunn) for his meals, and the two bond over their exclusion. Eventually a passenger named Freytag (Alf Kjellin) seems shocked to find himself ostracized when Rieber learns that his wife is Jewish.\nOthers aboard include a young American couple, David (George Segal) and Jenny (Elizabeth Ashley), who bicker because David is unhappy at his lack of success with painting. A divorcée, Mary Treadwell (Vivien Leigh), drinks and flirts, on a quest to recapture her youth in Paris. Bill Tenny (Lee Marvin) is a former baseball player disappointed in the way his career never quite took off. They are distracted by the music and the professional dancers, whose flirtations seem to skirt the edges of solicitation, or dive right in to the seedy side of oblivion.\nWhen the passengers disembark, two are no longer with them – the countess, who has been taken to an island prison, and the doctor, who has died."}