{"mid": "Shoah", "IMDB_id": "tt0090015", "title": "Shoah", "plot": "=== Overview ===\nThe film is concerned chiefly with four topics: the Chełmno extermination camp, where mobile gas vans were first used by Germans to exterminate Jews; the death camps of Treblinka and Auschwitz-Birkenau; and the Warsaw ghetto, with testimonies from survivors, witnesses and perpetrators.\nThe sections on Treblinka include testimony from Abraham Bomba, who survived as a barber; Richard Glazar, an inmate; and Franz Suchomel, an SS officer. Bomba breaks down while describing how a barber friend of his came across his wife and sister while cutting hair in an anteroom of the gas chamber. This section includes Henryk Gawkowski, who drove transport trains while intoxicated with vodka. Gawkowski's photograph appears on the poster used for the film's marketing campaign.\nTestimonies on Auschwitz are provided by Rudolf Vrba, who escaped from the camp before the end of the war; and Filip Müller, who worked in an incinerator burning the bodies from the gassings. Müller recounts what prisoners said to him, and describes the experience of personally going into the gas chamber: bodies were piled up by the doors \"like stones\". He breaks down as he recalls the prisoners starting to sing while being forced into the gas chamber. Accounts include some from local villagers, who witnessed trains heading daily to the camp and returning empty; they quickly guessed the fate of those on board.\nLanzmann also interviews bystanders. He asks whether they knew what was going on in the death camps. Their answers reveal that they did, but they justified their inaction by the fear of death. Two survivors of Chełmno are interviewed: Simon Srebnik, who was forced to sing military songs to entertain the Nazis; and Mordechaï Podchlebnik. Lanzmann also has a secretly filmed interview with Franz Schalling, a German security guard, who describes the workings of Chełmno. Walter Stier, a former Nazi bureaucrat, describes the workings of the railways. Stier insists he was too busy managing railroad traffic to notice his trains were transporting Jews to their deaths.\nThe Warsaw ghetto is described by Jan Karski, a member of the Polish Underground who worked for the Polish government-in-exile, and Franz Grassler, a Nazi administrator in Warsaw who liaised with Jewish leaders. A Christian, Karski sneaked into the Warsaw ghetto and travelled using false documents to England to try to convince the Allied governments to intervene more strongly on behalf of the Jews. Memories from Jewish survivors of the Warsaw Ghetto uprising conclude the documentary. Lanzmann also interviews Holocaust historian Raul Hilberg, who discusses the significance of Nazi propaganda against the European Jews and the Nazi development of the Final Solution. The complete text of the film was published in 1985.\n=== Franz Suchomel ===\nCorporal Franz Suchomel, interviewed by Lanzmann in Germany on 27 April 1976, was an SS officer who had worked at Treblinka. Suchomel agreed to be interviewed for DM 500, but he refused to be filmed, so Lanzmann used hidden recording equipment while assuring Suchomel that he would not use his name. Documentary maker Marcel Ophüls wrote: \"I can hardly find the words to express how much I approve of this procedure, how much I sympathize with it.\"\nSuchomel talks in detail about the camp's gas chambers and the disposal of bodies. He states that he did not know about the extermination at Treblinka until he arrived there. On his first day he says he vomited and cried after encountering trenches full of corpses, 6–7 m deep, with the earth around them moving in waves because of the gases. The smell of the bodies carried for kilometres depending on the wind, he said, but local people were scared to act in case they were sent to the work camp, Treblinka 1.\nHe explained that from arrival at Treblinka to death in the gas chambers took 2–3 hours for a trainload of people. They would undress, the women would have their hair cut, then they would wait naked outside, including during the winter in minus 10–20 C, until there was room in the gas chamber. Suchomel told Lanzmann that he would ask the hairdressers to slow down so that the women would not have to wait so long outside.\n=== Man in the poster ===\nThe publicity poster for the film features Henryk Gawkowski, a Polish train worker from Malkinia, who, in 1942–1943 when he was 20–21 years old, worked on the trains to Treblinka as an \"assistant machinist with the right to drive the locomotive\". Conducted in Poland in July 1978, the interview with Gawkowski is shown 48 minutes into the film, and is the first to present events from the victims' perspective. Lanzmann hired a steam locomotive similar to the one Gawkowski worked on, and shows the tracks and a sign for Treblinka.\nGawkowski told Lanzmann that every train had a Polish driver and assistant, accompanied by German officers. What happened was not his fault, he said; had he refused to do the job, he would have been sent to a work camp. He would have killed Hitler himself had he been able to, he told Lanzmann. Lanzmann estimated that 18,000 Jews were taken to Treblinka by the trains Gawkowski worked on. Gawkowski said he had driven Polish Jews there in cargo trains in 1942, and Jews from France, Greece, Holland and Yugoslavia in passenger trains in 1943. A train carrying Jews was called a Sonderzug (special train); the \"cargo\" was given false papers to disguise that humans beings were being hauled. The Germans gave the train workers vodka as a bonus when they drove a Sonderzug; Gawkowski drank liberally to make the job bearable.\nGawkowski drove trains to the Treblinka train station and from the station into the camp itself. He said the smell of burning was unbearable as the train approached the camp. The railcars would be driven into the camp by the locomotive in three stages; as he drove one convoy into Treblinka, he would signal to the ones that were waiting by making a slashing movement across his throat. The gesture would cause chaos in those convoys, he said; passengers would try to jump out or throw their children out. Dominick LaCapra wrote that the expression on Gawkowski's face when he demonstrated the gesture for Lanzmann seemed \"somewhat diabolical\". Lanzmann grew to like Gawkowski over the course of the interviews, writing in 1990: \"He was different from the others. I have sympathy for him because he carries a truly open wound that does not heal.\""}