{"mid": "Shocker", "IMDB_id": "tt0098320", "title": "Shocker", "plot": "A serial killer, having murdered over thirty people, is on the loose in a Los Angeles suburb. A television repairman with a pronounced limp, named Horace Pinker, becomes the prime suspect. When the investigating detective, Lt. Don Parker, gets too close, Pinker murders Parker's wife, foster daughter, and foster son.\nHowever, his other foster son, a college football star named Jonathan, develops a strange connection to Pinker through his dreams and leads Parker to Pinker's rundown shop. In a shootout in which several officers are killed, Pinker manages to escape, and targets Jonathan's girlfriend Allison in retribution.\nAnother dream leads Lt. Parker and the police to Pinker, whom they catch in the act of a kidnapping. This time, just as Pinker is about to kill Jonathan, he is arrested. Pinker is quickly convicted and sentenced to die in the electric chair.\nPrior to his execution, Pinker reveals that Jonathan is, in fact, his son, and that as a boy, Jonathan had shot him in the knee while trying to stop the murder of his mother. But what they do not realize is that Pinker has made a \"deal with the Devil\", When executed, he does not actually die but instead becomes pure electricity, and is able to possess others (it is unknown if the possessed hosts live or die after Pinker leaves their body since some of them were shown to be lying motionless after being released) to continue his murderous ways.\nHe soon possesses Lt. Parker, who uses his strength to fight off Pinker, who escapes into a T.V. dish. Jonathan and his friends try to find a way to fight him. Jonathan's friend, Rhino and his friends head to the power station to disable the power.\nJonathan, with the aid of Alison's \"spirit\", devises a scheme to bring Pinker back into the real world and accidentally discovers that Pinker, as with all energy sources, is bound by the laws of the real world; Jonathan uses this limitation to defeat Pinker, and traps him inside a television. Pinker threatens Jonathan that he will find a way out of his \"prison\". The film ends when Alison's voice tells Jonathan to take care of himself, while Jonathan's neighborhood suffers a blackout, caused by his friends blowing out the power main, trapping Pinker in the television.\nJonathan goes outside amidst all his neighbors and looks up at the sky. He asks Alison if she can see the stars to which she replies \"Absolutely beautiful\" Jonathan smiles and agrees and takes one more look at the stars."}