{"mid": "ShockCorridor", "IMDB_id": "tt0057495", "title": "Shock Corridor", "plot": "Journalist Johnny Barrett (Peter Breck) thinks that the quickest way to a Pulitzer Prize is to uncover the facts behind a murder at a mental hospital. He convinces an expert psychiatrist to coach him to appear insane; this involves relating imaginary accounts of incest with his \"sister\", who is impersonated by his exotic-dancer girlfriend (Constance Towers). Barrett convinces the authorities and is locked up in the institution where the murder took place. While pursuing his investigation, he is disturbed by the behavior of his fellow inmates.\nThe three witnesses to the murder were driven insane by the stresses of war, bigotry or fear of nuclear annihilation.\nStuart, the son of a Southern sharecropper who was taught bigotry and hatred as a child, became cynical and angry with the country of his birth. He was captured in the Korean War and was brainwashed into becoming a Communist. Stuart was ordered to indoctrinate a fellow prisoner, but instead the prisoner's unwavering patriotism reformed him. Stuart's captors pronounced him insane and he was returned to the US in a prisoner exchange, after which he received a dishonorable discharge and was publicly reviled as a traitor. Stuart now imagines himself to be Confederate States of America General J.E.B. Stuart.\nTrent was one of the first Negro students to integrate a segregated Southern university. He now imagines himself a member of the Ku Klux Klan, and stirs up the patients with white nationalist dogma.\nBoden was an atomic scientist scarred by the knowledge of the devastating power of intercontinental ballistic missiles. He has regressed to the mentality of a six-year-old child.\nAfter a hospital riot, Barrett is straitjacketed and subjected to shock treatment. Barrett begins imagining that his girlfriend really is his sister, and experiences many other symptoms of mental breakdown. He learns the identity of the killer and violently extracts a confession from him in front of witnesses and writes his story. His mind is critically damaged, however, and he has to stay in the hospital for an undefined period of time."}