{"mid": "ShogunAssassin", "IMDB_id": "tt0081506", "title": "Shogun Assassin", "plot": "As the opening credits roll, an abbreviated version of Ogami Ittō's (Tomisaburô Wakayama) past as Shogunate Decapitator and his wife's murder by ninja are seen, with Daigorō (Akihiro Tomikawa) providing the narration.\nTwo hooded samurai attack Ogami while he is pushing a cart with Daigorō inside. Ogami fends off the attack of the first, breaking the samurai's sword and splitting his head. The second attacker jumps over the first, with the first still clasping Ogami's blade. Ogami pulls off a handrail from the cart and a blade comes out, transforming it into a spear. Ogami then uses the spear to impale the second attacker. As the first is dying, he reminds Ogami that he is marked for death.\nAs Ogami and Daigorō sit by a roadside fire and eat their evening meal, Ogami remembers how he offered the infant Daigorō the life-death choice: either Ogami's sword (which would mean that Daigorō would join him on his mission of vengeance against the Shogun) or Daigorō's ball (which would mean that Daigorō would be killed, so that he could be with his mother in heaven). Daigorō chooses the sword. The next day, the Shogun's officials bring Ogami the Shogun's orders: either swear eternal loyalty or commit suicide with Daigorō. Ogami decides to fight his way to freedom with Daigorō, only to have his path blocked by the Shogun and his men. The Shogun challenges Ogami to fight Kurando (the Shogun's son) in a duel; if Ogami wins, he wins his freedom. Ogami accepts, and eventually cuts off Kurando's head.\nOgami and Daigorō journey on, never stopping in one place for very long as the Shogun's ninjas are always following them. As they wander, Daigorō recalls how Lord Bizen (Taketoshi Naitô) and his men were given orders to kill him. Even though Bizen's men are wearing chain mail beneath their robes, Ogami's skill and blade are too powerful. Ogami lures Lord Bizen into the middle of a stream and uses an underwater sword-slash technique to kill him. Ogami sees the Shogun watching from a distance and he swears to the Shogun that he will destroy him and all of his ninjas.\nThe Supreme Ninja (Kayo Matsuo) receives orders from the Shogun to kill Ogami and Daigorō. Lord Kurogawa (Akiji Kobayashi) doesn't believe the Supreme Ninja's women are up to the task, so she proves otherwise by ordering her ninja's to kill Junai (Kurogawa's strongest ninja).\nOgami and Daigorō meet secretly with a client to discuss a business proposition. Ogami is offered the task of killing Lord Kiru (the Shogun's brother), and in return he will receive ten pieces of gold. Ogami accepts the mission and is told that Lord Kiru is being escorted by a three-brother team known as the 'Masters of Death.'\nDuring Ogami and Daigorō's journey to find Lord Kiru, they are attacked several times by The Supreme Ninja's women. Ogami kills them each time. Ogami finally faces the Supreme Ninja herself. She attacks Ogami with a weighted net that contains fishhooks, but Ogami cuts himself free and the Supreme Ninja flees by running away backward.\nOgami and Daigorō keep on traveling, but they now come face-to-face with Lord Kurogawa's entire ninja force. Pushing Daigorō in his cart to safety, Ogami uses the spear blades in the cart's handrails to attack. All but two of the ninja are cut down, but Ogami is left wounded. He manages to push Daigorō to the safety of a deserted hut before collapsing from loss of blood. Daigorō goes in search of water for his father, finally bringing it back in his mouth, then takes some food offerings from a roadside shrine, leaving his jacket in honorable exchange.\nThe Supreme Ninja meets with Lord Kurogawa to report her failure but Lord Kurogawa has another plan: to strike at Ogami through Daigorō.\nLater that night, Daigorō is lured outside the hut by the sound of a woman singing. Waking up to find Daigorō gone, Ogami searches for his son. He finds Daigorō is a prisoner of Lord Kurogawa and the Supreme Ninja. Daigorō is tied up and suspended over a deep well. Kuroawa demands that Ogami surrender, or he will drop Daigorō down the well. Ogami refuses, so Kurogawa and his men attack. Kurogawa lets go of the rope suspending Daigorō over the well, but Ogami manages to stamp his foot down on the rope and kill Kurogawa (and his two ninjas) at the same time. Ignoring the Supreme Ninja, who has not moved throughout the fight, Ogami carefully pulls Daigorō up to safety. Instead of killing the Supreme Ninja, Ogami walks away with Daigorō.\nOgami and Daigorō board a ship which is carrying the 'Masters of Death' to their rendezvous with Lord Kiru. Also on board is the Supreme Ninja. During the night, the remaining rebels start a fire on board the ship. In the ensuing inferno, the 'Masters of Death' tell Ogami that they recognize him, but that they will not attack him as along as he makes no move against them. Ogami agrees to their terms and they leave him. The companionway is blocked by flames, so he cuts through the deck planking. Ogami then puts Daigorō in his cart and throws them both overboard to safety. The Supreme Ninja attacks Ogami from underwater but he overpowers her. Getting Daigorō, himself and the Supreme Ninja to shore and to the shelter of a fisherman's hut, he strips all three of them naked and gathers them close together, telling the Supreme Ninja that they must share their body heat or die. The Supreme Ninja doesn't understand why he would save her and realizes she cannot kill Ogami or his son. The next day, Ogami and Daigorō leave her there, knowing that she will have to return to the Shogun, report her failure and commit suicide.\nThe 'Masters of Death' escort Lord Kiru and his entourage through a desert area, where they are attacked by a rebel force concealed under the sand. The 'Masters of Death' then fight off and kill all of the rebels. Lord Kiru is taken to safety. However, they haven't gone far before they see Daigorō standing in their way. He points to Ogami, who is waiting. The 'Masters of Death' finally face off against Ogami, but one by one they are cut down and killed. Ogami then chases after Lord Kiru's procession, driving off the guards. Lord Kiru protests that he is the Shogun's brother, but Ogami tells Kiru that the \"Shogun means nothing\" to him. Ogami then kills Lord Kiru with his sword.\nAs he and his father walk away from the carnage, Daigorō looks back one last time and says via voice-over, \"I guess I wish it was different ... but a wish is only a wish\"."}