{"mid": "ShortCircuit", "IMDB_id": "tt0091949", "title": "Short Circuit", "plot": "Number 5 is part of a series of prototype U.S. military S.A.I.N.T. (Strategic Artificially Intelligent Nuclear Transport) robots built for the Cold War by NOVA Laboratories. The series' inventors, Newton Graham Crosby and Ben Jabituya, are more interested in peaceful applications including music and social aid. After a demonstration of the robots' capabilities, Number 5 is hit by a lightning-induced power surge, scrambling its programming and giving it a sense of free will. Several incidents allow the robot to escape the facility accidentally, barely able to communicate and uncertain of its directive. In Astoria, Oregon, Stephanie Speck (who cares for animals and mistakes Number 5 for an extraterrestrial visitor) grants Number 5 access to books, television, and other stimuli, to satisfy his hunger for 'input'; whereupon Number 5 develops a whimsical and curious childlike personality. When Stephanie realizes Number 5 is a military invention, she contacts NOVA who send out a team to recover him, bringing one of the other robots along to help. When Number 5 accidentally crushes a grasshopper and gains an understanding of mortality, he concludes that if NOVA disassembles him he too will cease to be alive. Horrified, Number 5 steals Stephanie's van and flees, but the pair are cornered by NOVA, including Newton and Ben. Although Stephanie attempts to reveal his newly discovered sentience, Number 5 is deactivated and captured. Being taken on the way to NOVA, he manages to turn himself back on and escapes despite a tracker that had been placed on him. Returning to Stephanie for protection, Number 5's unusual actions catch the attention of his creators, but NOVA's CEO Dr. Howard Marner turns a deaf ear to their wild hypothesis.\nFrom this follow several adventurous escapes from the soldiers, led by NOVA's security chief Captain Skroeder (G. W. Bailey). Having humiliated Stephanie's ex-boyfriend Frank and three of the remaining prototypes (that have been reprogrammed to imitate The Three Stooges by Number 5), Stephanie and the robot convince Newton of the robot's sentience. Shortly after, the trio are cornered by Skroeder, who has secretly taken over NOVA's security, and the Army, both of whom chase after Number 5, whose only concern is Newton and Stephanie's safety. Number 5 flees across the fields until a US Army helicopter sweeps over a nearby rise and its missiles blow the helpless robot to pieces. Newton and Stephanie are devastated over the loss, Newton quits NOVA. Marner is also disappointed at the destruction of years of research, and seeing the security team celebrate, quickly dismisses Skroeder for insubordination. Stephanie leaves with Newton, who plans to head to his father's estate in Montana and start over. During their drive, Number 5 reveals himself to them, surprising his friends by revealing the warmongers actually blew up a duplicate he made out of spare parts. Elated in their reunion, Number 5 renames himself \"Johnny 5\" after a song \"Who's Johnny\" that he heard when he escaped from NOVA's van. He accompanies Stephanie and Newton to their new home."}