{"mid": "ShutIn", "IMDB_id": "tt4009278", "title": "Shut In", "plot": "Steven (Charlie Heaton), is a troubled kid who is being sent to boarding school. While his father, Richard Portman (Peter Outerbridge), is driving him to school, Steven and his father get into a bad argument, and the car swerves into the other lane, causing a head on collision with an eighteen wheeler.\nSix months later, Richard Portman has died and Steven has become a vegetable. His stepmother, Mary (Naomi Watts), takes care of his every need. Mary works from home with children and adolescents as a clinical psychologist, giving sessions in the garage right next door to her house.\nMary is informed by a woman named Grace (Crystal Balint), that one of her patients, a little boy named Tom (Jacob Tremblay), who is hearing impaired is going to be transferred to another school in Boston. Mary protests, but there’s nothing she can do about it. Just before leaving, Mary gives a Tom a scarf and hat that once belonged to her stepson Steven. Later that evening, Mary discusses Steven with her therapist, Dr. Wilson (Oliver Platt). She has decided to put Steven in a home to be cared for called Covington because “Steven” is no longer there and he is just a body that she cares for and feeds. Mary expresses guilt for sending her stepson away and the accident which occurred. While bathing she daydreams of drowning Steven in the bathtub.\nAfter bathing, Mary hears sounds in the house and goes to investigate. Once she gets outside, Mary hears glass shattering and her car alarm goes off. In her garage, Mary finds one of her car windows smashed in and Tom fast asleep on the backseat. She brings Tom inside, and while she’s discussing him on the phone, Mary is locked inside her office. When she finally unlocks the door, she finds her front door standing open and Tom is nowhere to be found.\nMary informs the police and they search for Tom. She hears sounds in her house at night and dreams of herself, searching for Tom. Doug Hart (David Cubitt), the father of one of her patients talks about a snow storm that is headed to their area, and asks her out on a date. Mary declines implying that it would be unprofessional.\nShe continues to hear sounds in the house at night. One night, Mary sees Tom. He comes into her room and claps his hand over her mouth to keep her from screaming. Mary discusses the night’s events with Dr. Wilson, and he tries to convince her that it wasn’t real; attributing it to parasomnia, memories, and the guilt she feels about Steven. Dr. Wilson wants to prescribe her some medication to help her sleep, so he sends a nurse over to Mary’s house to do some blood work.\nMary reconsiders and has dinner with Doug, both of them discussing their respective teenagers. Later on, Mary is frightened by a door slamming. When she investigates, Steven is missing from his bed. She finds a small door to a crawlspace across from the stairway that’s partially open but blocked by furniture. Mary opens it and is grabbed from inside by two small hands and has to fight to close the door.\nThe next morning she wakes up on the floor. Steven is back in his bed, but has scratches on his face. Dr. Wilson again tries to convince her that she has sleep parasomnia and wants to prescribe antidepressants. Mary gets two invitations to leave her house for the storm, one from her assistant Lucy (Clémentine Poidatz), and another from Doug Hart who visits her. She declines both.\nDr. Wilson contacts her via Skype with her blood work results. Dr. Wilson admonishes Mary for self-medicating because her stepson’s medication is showing up in her blood. Mary denies taking any medication and distractedly and walks away from the computer without ending the call. Dr. Wilson is about to end the call when he looks into Mary’s living room and sees Steven’s empty wheelchair. Right then, Steven walks across the living room, scaring Dr. Wilson. The power and the lights go out in the house and Dr. Wilson loses his computer connection to Mary. Dr. Wilson tries to call Mary, but can’t get through.\nMary is in the basement when the lights go out. She sees Tom in the dark, and when Mary tries to leave the basement, Steven blocks her way and attacks her. She wakes up bound, gagged, and naked in the bathtub and Steven is bathing her. He tells Mary how he woke up in the hospital after the accident with her there. Steven didn’t move or speak so that he could relish in the attention that Mary gave him. He believes that for six months they were happy together just the two of them; until Tom came.\nIt turns out that Tom wasn’t a ghost. He was alive and living in the crawlspace across from the stairs. Tom saw Steven moving around, so Steven tried to “deal with him,” but before he could, Tom escaped into the crawlspace. Steven blocked him in there hoping he would starve to death. Mary really did see Tom every time he appeared. Steven was keeping her medicated with his medicine so he could walk around at night, increasing her medication since Tom has been there.\nSteven medicates Mary so he can “take care” of Tom and leaves her in the bathroom. Mary unties herself and throws up the medication. Dr. Wilson drives to Mary’s house, but wrecks his car on the way. Mary finds both Steven and Tom in the basement, and Mary learns that Steven killed his father on purpose. She knocks Steven out and unties Tom. He runs when Steven wakes up and attacks Mary. She locks Steven in the basement.\nTom and Mary hide in a closet. Steven breaks out of the basement and searches for them. Dr. Wilson arrives as Steven is searching. Steven stabs him. Steven begins hammering. Mary collects Tom from the closet. When Steven goes upstairs, Mary tries to leave and discovers Doug Hart’s dead body in the snow.\nDr. Wilson, still clinging to life, advises Mary not to challenge Steven and to play along with his delusion so she can save herself and Tom. He dies. Steven has nailed all of the windows and doors shut, so Mary breaks a skylight in the roof and Tom climbs out. Steven catches Mary and she plays along with him until she is able to burn him and knock him out. Mary opens one of the doors just as Steven wakes up. They run to the lake with Steven in pursuit. Mary blocks the path to Tom, who is at the end of the pier. Steven pushes her aside and charges after Tom, knocking him into the freezing water. Mary tries to stop him, but he knocks her down again, and begins to drown Tom. Mary grabs the hammer Steven threw down on the pier and bludgeons Steven with it, knocking him into the water and killing him.\nThe movie ends with Mary driving Tom to school."}