{"mid": "Shuttle", "IMDB_id": "tt0880648", "title": "Shuttle", "plot": "Mel (Peyton List) and Jules (Cameron Goodman) are best friends returning to Los Angeles from a trip in Mexico. Seth (James Snyder) and Matt (Dave Power) arrive and introduce themselves to them. Jules takes Mel into the bathroom to help her deal with her motion sickness, where Mel tells her that she has broken up with her fiancé.\nMel's luggage is lost in the airport, so she must return the next day to get it. Outside, they board a shuttle bus after its Driver (Tony Curran) offers to charge them half the price of a regular shuttle. On board, they meet Andy (Cullen Douglas), a shy family man. Seth and Matt see them and attempt to board, but the Driver tells them he can only make three stops at a time. Jules informs him that the men are with them.\nDuring the trip, Mel shows Matt her signing skills while Seth and Jules flirt with each other. While taking an unusual detour, they are run off the road by a car, and the Driver gets out to survey the damage, which turns out to be a flat tire. Jules opts to call a taxi, but there is no service where they are. Matt offers to help change the tire. While his hand is on top of the tire, the Driver looks for some nuts for the wheel. Suddenly, the bus falls off the jack and onto Matt's hand, severing his fingers. They quickly drive off to the hospital.\nDuring the ride, the Driver calmly pulls over, much to the astonishment of the passengers. He pulls a gun on them and demands cooperation, taking everyone's phones and wallets. While Mel and Seth argue about doing something, Jules finds a flare under the seat from the safety kit used to bandage Matt's hand, and Mel comes up with a plan to get the window open. Andy sees her and causes a commotion. A struggle ensues and the flare is set ablaze. The Driver sees this, stops the bus and removes the flare. Jules runs for the front and finds the door locked and the key missing.\nThe Driver re-enters and slashes Seth's face with a switchblade as a warning to the others. He informs them of a \"change of plans\", and drives them to an indoor ATM booth and has Jules extract some money. While she is inside, she knocks some paper into a bin and sets it on fire to set off an alarm. The Driver sees this and rushes towards her, but she slams the door. Mel escapes, but the Driver shouts at her that he will let Jules suffocate from smoke inhalation if she doesn't return to the bus. She has no choice but to surrender.\nHe then takes them to an all-night supermarket, where he tells Mel to buy \"nine items\" on a list he's written for her and nothing else. On the bus, he chains Seth and Andy together and makes them take valuables and passports from the luggage on board. Seth tells Andy if they get loose, the Driver can only get one of them. Inside, Mel sees a security camera and, through sign language, says she needs help. She goes to the front register, and hands a note to the cashier that tells her to check the security tape and call the police when she leaves. Seth gets free and makes a run for it, only to be run over by the bus. The Driver places the body in the back.\nHe then scolds Mel for buying ice when she didn't need to, but she tells him it's for Matt's fingers. Back in the store, the cashier checks the cameras only to find that they were never switched on. Later, Mel shows Matt a knife she hid in the ice, which she uses to cut their belts off. Matt uses the ice bag to smash the window, and they all shout for help. The Driver walks towards them and pulls out the gun. Mel cuts his wrist with the knife, and Matt hits him over the head with the bag. Mel grabs the gun and threatens to shoot the Driver. She makes him hand over the keys to the belts, and Jules is able to get herself and Andy free.\nShe takes the wheel of the bus and drives, leaving Matt with the gun and Andy with the knife. Andy then nonchalantly stabs Matt in the throat, which no one notices at first. He grabs the gun and puts it to Mel's head, telling her to get away from the pedals. Andy then reveals himself to be in league with the Driver. They stop at a bridge to throw the boys' bodies off, and afterward, Andy torments the girls for a few minutes before the Driver gets him to stop.\nLater, Mel manages to get a tire iron from under the seat, and keeps it by her side. Andy wraps tape around the girls' mouths and takes a cuff of their hair. Mel hits him several times with the tire iron and the Driver is forced to stop. She pulls herself free, and the Driver attempts to get the gun, only for her to hit him on the hand, and knock it towards Jules. Mel seizes control and drives away, but he rushes towards her. She slams the brakes and accelerates to throw him about. She reaches for a knife and stabs him in the knee. Andy comes over to attack her but she grabs a fire extinguisher and hits him with it. The bus then crashes into a wall during the struggle.\nAfter finding Andy dead and the Driver and Mel unconscious, Jules escapes and flags down a passing car. A man gets out and starts to call 911, but he gets plowed by the Driver. The Driver then takes them to a warehouse, where he forcibly removes a tattoo from Jules' body; he also takes the girls' driving licences and puts them in a drawer which is already full of other IDs of people the Driver has kidnapped or murdered before. He has Jules dye Mel's hair blonde, then makes Mel and Jules strip down to their underwear and wear white high heels for an inspection. The man who inspects them is revealed to be the man that ran them off the road earlier, and the same man who was seen observing them at the airport in the opening scene. The Driver inspects their bags and finds that Jules has Antifungal medication for a yeast infection. Since Jules is of no use to the Driver since he needs the girls to both be in good health, he takes her onto the bus and gasses her with a tube connected to the exhaust.\nHe finds Mel, who threatens to cut her face with a shard of glass, which would make her useless to him as well. Instead, she stabs him in the arm with it. He attempts to disarm her, but she stabs it into his thigh before hitting him in the face with some light fixtures. She finds the gun and shoots him, the bullet skimming his head. Thinking he is dead, she tries to escape in the bus. However, before it can start, the Driver attacks her again. They grapple for a minute before he forces her into a large wooden crate, which contains the items Mel purchased earlier in the grocery store: a flashlight, a loaf of bread, two jugs of water, two magazines, kitty litter, and a litter box, as well as her motion sickness pills.\nTrapped inside the dark crate, Mel yells for help, but no one is there, and when someone with a forklift comes, he turns out to be in on the operation. While being carried away, she finds a photo of seven young white women in what looks like a filthy underground cellar. The photo depicts the despondent-looking girls completely naked, hair dyed blonde, and wearing white high heels (like Mel and Jules were forced to wear). It is heavily implied that these girls were also kidnapped by the Driver at some point and forced to become sex slaves overseas. Mel looks at the photo in horror as she realizes that she is to become a sex slave too. The crate is then loaded onto a cargo ship destined for East Asia.\nThe final shot is of Mel's lost luggage turning up at the airport as another day begins."}