{"mid": "Sicario", "IMDB_id": "tt3397884", "title": "Sicario", "plot": "In the opening shot, there is a text that explains that the origin of the word \"sicario\" comes from the Roman zealots that occupied Palestine. In Mexico, the word means \"hitman\".Chandler, Arizona.A SWAT team moves in toward a house where they suspect there to be hostages held by Mexican cartel leader Manuel Diaz (Bernardo P. Sacarino). Kate Macer (Emily Blunt), an American FBI agent, and her partner Reggie Wayne (Daniel Kaluyya) move in with their rescue team and burst in through the house with the van. They capture a few suspects, while Kate kills a man that tried to shoot her. The team then finds dozens of bodies stuffed into the walls with bags over their heads. Most of the team goes outside to puke. Kate's superior Dave Jennings (Victor Garber) calls her inside. Outside, several officers notice something from a nearby shed. A bomb goes off, killing two officers.At the station, Kate is brought in to meet Matt Graver (Josh Brolin). He is brought in to help catch Diaz, along with a mysterious Mexican federal agent who introduces himself as Alejandro (Benicio Del Toro). Kate is asked to join the team, which she only agrees to so she can catch the men responsible for the deaths she witnessed that day.Elsewhere in Mexico, a man named Silvio (Maximiliano Hernandez) is in his kitchen. His son tells him that he has a soccer match later that day. Silvio goes through his daily routine before heading off to work. He is wearing a police uniform as he walks to his car.Kate initially believes the team is going to El Paso, but they end up going just across the border to Juarez, Mexico. Once there, the team rolls with a whole squad of agents and Delta Force soldiers in black SUVS led by Steve Forsing (Jeffrey Donovan) through the city. They recover a prisoner from a jail and return to the border. Alejandro tells Kate to watch out for Mexican State Police. They drive up to a crowded parkway and come to a halt short of Customs. Alejandro spots two cars with gang members and he notices they have itchy trigger fingers. The cops slowly move out of their vehicles and approach the gang members. One of them gets out of their car slowly as well, gun in hand. The officers tell him to lower his weapon, but he reacts quickly, getting himself and his buddies shot to hell. The other gang members suffer the same fate when one of them tries to draw his weapon on the cops. Kate also shoots a bandit sneaking up on her vehicle.On the U.S. Side, Kate argues with Matt on the actions taken on the parkway, as well as the whole way that they are leading this mission. The stress has even caused her to take up smoking again.Matt watches as Alejandro tortures the prisoner, a local gang leader.The team drives to El Paso to question buses filled with immigrants. Alejandro wants the ones caught near Nogales. They question the men to determine where a secret tunnel to cross the border can be found.Next, the team is surveilling a bank where they believe they will find a woman depositing money tied to the Mexican drug cartels. They arrest the woman and in their search, the team finds bags of money to be laundered and wrapped in blue-pink wristbands. The bank manager shows the Feds that the cartels are just repaying loans, which are not tracked.Some of the team goes out for drinks later that night. Reggie introduces Kate to an acquaintance, Ted (Jon Bernthal), a local cop off duty. After a few drinks, Kate goes back to her apartment to hook up, until she notices he took out from his pocket a wristband similar to what they found earlier. Kate tries to get away, but a struggle ensues as she tries to reach for her gun. Ted starts to strangle Kate until Alejandro walks in and points his gun in Ted's face, making him release his grip on Kate.Ted is taken into custody. Alejandro enters the car with him and beats his face until Ted tells him what he can say regarding his business with Diaz, and reveal other corrupt cops.Matt decides to attack a tunnel and make the drug cartel react. They gear up and head towards the tunnel location. Matt tells Kate to stay out of the way as she is only there because the CIA can only work in the U.S. as being attached to a domestic agency.The team succeeds in taking away a substantial amount of money from Diaz's account, forcing him to make his return to Mexico. Following that, the team attacks a tunnel at night and Alejandro and the Delta team lead a running gun battle, Kate and Reggie follow nervously. On the Mexican side Kate sees Alejandro find Silvio and hold him at gunpoint. Kate aims her gun at Alejandro, but he shoots her in her vest and tells her to never do that again. He takes Silvio and makes him drive away in his police car.A while later back on the American side Kate punches Matt but he calms her down. She learns that Alejandro is not a Mexican federal agent, but an assassin originally from the Colombian Cartel being hired by the CIA to catch Diaz's boss, Fausto Alarcon (Julio Cedillo), the local head of the Mexican Cartel. The Mexicans had decapitated Alejandro's wife and threw their daughter into a vat of acid. The CIA thinks they can control drugs better if the Colombians are in charge.Alejandro forces Silvio to drive until they see Diaz's car. Alejandro makes Silvio pull Diaz over and force him to step out of the car. Silvio walks out to confront Diaz, only for Alejandro to shoot and kill Silvio and shoot Diaz in the leg. He forces Diaz to drive to his boss's house, Alarcon.Alejandro arrives at Fausto's home and kills all of his guards. He walks outside to find Fausto having dinner with his wife and two sons. He aims his gun at Fausto and tells the wife and boys to continue eating and to stay calm. Fausto tells Alejandro that his wife wouldn't like what he's become, a lawyer-turned-hitman. Alejandro brings up his daughter. Fausto says it was nothing personal, but it was to Alejandro. He says in Spanish, \"Time to meet God\". He shoots the wife, then the two boys dead, to Fausto's horror. Alejandro tells him to finish his meal, moments before he shoots Fausto dead.Alejandro slips into Kate's apartment unseen. He hands her a document for her to sign to confirm that everything they did was by-the-book. Kate refuses to sign it. Alejandro holds a gun under her chin, stating she'll be committing suicide if she doesn't sign. He wipes tears away from her cheeks while never removing the gun. Kate reluctantly signs. Alejandro leaves and tells her to go to a smaller town where the rules of law still apply. Kate grabs her gun and aims it at him from her window. He turns around and waits for her to pull the trigger, but she just slowly lowers it and lets him walk away.In the final scene back in Mexico, Silvio's son stands over his father's empty bedside, almost as if he knows his father won't be coming home. His mother takes him to his soccer match. During the game, everybody hears gunshots in the distance. They quickly carry on with the game."}