{"mid": "Sidekicks", "IMDB_id": "tt0105402", "title": "Sidekicks", "plot": "Barry Gabrewski is an asthmatic boy who lives with his widowed father, Jerry Gabrewski (Beau Bridges), in Houston, Texas. A loner, Barry has vivid daydreams about being Chuck Norris' sidekick, battling against Norris's movie enemies, who are often personified by Barry's everyday bullies such as Randy Cellini (John Buchanan). Noreen Chan (Julia Nickson-Soul), his favorite teacher, often plays the damsel in distress in these daydreams.\nBarry wants to learn the martial arts, but is rejected by the arrogant dojo owner Kelly Stone (Joe Piscopo) for being too weak. Instead, he is taken on as a student by an old Chinese man called Mr. Lee (Mako), the sly uncle of his teacher and the owner of a local Chinese restaurant, \"Frying Dragon\". Mr. Lee finds creative ways to teach Barry to defend himself from his bullies. Lee devises training methods that increase Barry's endurance, which helps his asthma. Lee also deduces Barry's hero worship of Norris and from that, deduces at least some of Barry's daydreams. He creatively incorporates this into Barry's training, creating training scenarios that seem more dangerous than they are so that Barry will feel heroic for succeeding at them.\nLee enters himself, Barry, and Chan into a local team Karate tournament but is a bit stymied to learn that a team must have four members. Norris is attending the tournament as a guest. Chan (at Lee's urging) convinces Norris to join the team. Norris is both willing to help an ardent fan and has his own motivation for participating: he has encountered Stone on several prior occasions and wants to teach him \"a lesson in humility.\" Barry is stunned to find himself working together with his hero.\nThe tournament involves four events: Breaking, Mens Weapons, Female Kata, and Freestyle fighting. Stone's team narrowly defeats Chan in the Female Kata, but Lee defeats Cellini, one of Stone's students, in Breaking. True to his word, Norris defeats Stone in Freestyle fighting. Barry -- aided by a vivid daydream -- scores well in the Mens Weapons. The result is a tie between Stone's team and Lee's team. In the tie-breaker, Lee is allowed to choose the participants, and chooses Barry and Cellini, saying Barry is the member of the team with \"something to prove.\" Stone chooses the event, Breaking. Barry is dismayed to be confronting Cellini in the latter's best event but Lee tilts the odds in Barry's favor by using a small amount of lighter fluid to set Barry's bricks on fire. Faced with a much more heroic-seeming task, Barry wins.\nAfter the tournament, Barry is seen talking to Norris, thanking him for his help. Norris vanishes, and it is implied that Barry has found the strength to live his life without the need for his daydreams. Before the movie fades to black, a young boy finds Barry's Chuck Norris magazine. With an excited \"Wow\" the camera pans out to reveal the young man is in a wheelchair."}