{"mid": "SilentMovie", "IMDB_id": "tt0075222", "title": "Silent Movie", "plot": "Mel Funn (Brooks), a great film director now recovering from a drinking problem and down on his luck, sets out to pitch a new screenplay idea to the Chief of Big Picture Studios (Caesar), aided by his assistants Dom Bell (DeLuise) and Marty Eggs (Feldman). The screenplay is for the first major silent motion picture in forty years. At first the studio chief, who is in danger of losing the studio to the New York conglomerate Engulf & Devour, rejects the idea, but Funn convinces him that if he can get Hollywood's biggest stars to be in the film, he could save the studio.Funn, Eggs, and Bell proceed to recruit Burt Reynolds, James Caan, Liza Minnelli, Anne Bancroft, and Paul Newman (all played by themselves) to be in their silent film in various comic ways. They also ask world famous mime Marcel Marceau (also as himself) to be in the film, but he replies, \"Non\", the only spoken word in the entire film. Funn claims not to understand Marceau's reply because he \"do[es]n't understand French.\"Meanwhile, Engulf (Harold Gould) and Devour (Ron Carey) worry that Funn will save Big Picture Studios, and they will be unable to buy it. They attempt to \"stop Funn with sex\", by sending Vilma Kaplan (Peters) to seduce Funn, and then pretend to fall in love with him. Funn falls in love with her, but realizes the truth the day before the filming of the movie is set to begin, and returns to drinking. Vilma, who has actually fallen for Funn during the course of their relationship, teams up with Eggs and Bell to find Funn and get him sober.Vilma, Eggs, and Bell locate Funn and feed him several hundred cups of coffee to sober him up. Funn is able to direct, and the movie is filmed on schedule, but the film is stolen from the theater by Engulf & Devour just before its preview. Funn and his associates steal it back while Vilma distracts the audience with her Cabaret act, and after a slapstick car chase and final showdown involving cans of soda being launched like grenades, return the film to the theater, where it is a huge success, saving the Studio.The film ends with the title card \"This is a true story\", implying that it is the story of how \"Silent Movie\" itself was made."}