{"mid": "SilentRage", "IMDB_id": "tt0084684", "title": "Silent Rage", "plot": "In a small Texas town, John Kirby (Brian Libby), a mentally ill man, kills two members of the family with whom he was staying. Sheriff Daniel \"Dan\" Stevens (Chuck Norris) and his deputy Charlie (Stephen Furst) respond and eventually arrest Kirby, but Kirby breaks out of the handcuffs, overpowers the other officers and grabs one of their revolvers, forcing the officers to open fire and shoot Kirby.\nSeverely injured and near death, Kirby is transported to an institute where his psychiatrist, Thomas \"Tom\" Halman (Ron Silver), works along with two medical doctors who are also genetic engineers: Dr. Phillip Spires (Steven Keats) and Dr. Paul Vaughn (William Finley). To save Kirby, Spires proposes treating him with a formula created by himself and Vaughn to enhance cellular strength and regeneration. Halman objects to its use due to Kirby's psychosis, and Spires initially agrees, but later administers the formula anyway once Halman leaves. Revived and rendered nearly mute but virtually invulnerable, Kirby escapes from the institute and tracks Halman to his home. Meanwhile, Stevens invites Halman's daughter Allison, whom is he romancing, on a trip. Kirby breaks into Halman's home and the two fight. Despite shooting Kirby several times and pushing him down a flight of stairs, Halman is killed. Halman's wife Nancy finds her husband's body and is killed by Kirby as well. Allison arrives to pick up her gear for the trip and discovers her parents' corpses, but Kirby flees as Stevens and Charlie arrive with the police.\nStevens and Charlie take Allison to the institute, unaware that Kirby has also returned there to get Spires and Vaughn to treat his wounds. Realizing that the situation is out of control, Spires leaves to examine samples while Vaughn attempts to kill Kirby by injecting him with acid. Kirby survives and kills Vaughn after a brief struggle by stabbing him with the syringe. After finding Vaughn's body, Spires returns to his office, where he briefly speaks to Kirby before Kirby snaps his neck. With Stevens elsewhere, Charlie and Allison discover Kirby killing another of the workers; Charlie attempts to arrest him but is mortally wounded when Kirby breaks his back. Stevens returns just in time to discover Charlie dying and protects Allison from Kirby.\nAfter a chase, Stevens' car crashes with Kirby hanging onto it, lighting him on fire. This injures him, but he jumps into a nearby lake and quickly recovers. With Allison watching, Stevens and Kirby engage in hand-to-hand combat. Both men score blows, but Stevens overwhelms Kirby by roundhouse kicking him several times before throwing him into a nearby well, seemingly killing him. With Kirby's carnage at an end, Stevens and Allison leave. However, deep in the well, Kirby suddenly bursts from the water, having survived."}