{"mid": "SilverStreak", "IMDB_id": "tt0075223", "title": "Silver Streak", "plot": "In the face of seriously declining railroad passenger travel, engineer Tom Caldwell presents to the president of the CB&D Railroad, B.J. Dexter, a design for a revolutionary diesel-electric train that will increase efficiency and lower costs. Dexter opposes change, however, and the railroad's conservative board of directors agrees with him, rejecting Tom's design. Tom quits in frustration. Sure that Tom's theory is sound, Dexter's daughter Ruth convinces Ed Tyler, a locomotive manufacturer, to look into Tom's design. Tyler is impressed with the concept and initiates immediate construction of a prototype. Soon Tom and his team prepare the Silver Streak for a well-publicized trial run with Dexter and Ruth aboard as passengers.\nThe Silver Streak fails to attain even half of its projected speed of 100 miles per hour (160 km/h), however, and is even easily overtaken by a steam-powered freight train. An angry Dexter tells Tyler that all the Silver Streak is good for is an exhibit at the Century of Progress Exposition to recover his advertising expenses. Tom is baffled by the failure since all the engine components worked perfectly during assembly but Dexter stubbornly insists that the concept will never work. Furious with Dexter's attitude, Tom quarrels with Ruth. Her brother Allen, who supported Tom's idea, tells his father that he is quitting the railroad to take a job as a civil engineer with the Six Companies, Inc. constructing the Boulder Dam.\nTom and Bronte, the engine's builder, discover that the electrical generator acquired for the Silver Streak has a manufacturing flaw. After correcting the flaw, the engine produces even greater power than he had earlier predicted. He tries to telephone Ruth with the good news to reconcile with her, but she has left Chicago to travel by train to California. Ruth discovers en route that infantile paralysis (polio) has broken out among the dam's construction crew and detours to the site only to find that Allen has contracted the disease. When a doctor informs her that Allen will die within 24 hours unless he receives treatment from an iron lung respirator, Ruth telephones her father to have the machine shipped to the dam by airplane. Dexter is told that the iron lung is too heavy for any transport airplane to carry and cannot be disassembled. Tom and Tyler persuade Dexter to take a gamble on the Silver Streak as Allen's only hope.\nWith less than twenty hours of time to travel 2,000 miles (3,200 km), the Silver Streak is given a cleared track and takes a shipment of Drinker Respirators out of Chicago. Tom includes Bronte on his crew, unaware that he is a foreign spy wanted for murder. As radio broadcasts track the progress of the \"epic errand of mercy,\" the Silver Streak breaks records as it races south against time through the night. Nearing Boulder City, however, Bronte is revealed as a fugitive and sabotages the engine trying to stop the train, but instead causes it to speed out of control. Tom knocks the spy unconscious and regains control of the runaway train just before it arrives at the station."}