{"mid": "SinginInTheRain", "IMDB_id": "tt0045152", "title": "Singin' in the Rain", "plot": "Don Lockwood (Gene Kelly) is a popular silent film star with humble roots as a singer, dancer, and stuntman. Don barely tolerates his vain, cunning, and shallow leading lady, Lina Lamont (Jean Hagen), though their studio, Monumental Pictures, links them romantically to increase their popularity. Lina is convinced they are in love, despite Don's protestations otherwise.\nAt the premiere of his newest film, The Royal Rascal, Don tells the gathered crowd an exaggerated version of his life story, including his motto: \"Dignity, always dignity.\" His words are humorously contradicted by flashbacks showing him alongside his best friend Cosmo Brown (Donald O'Connor). To escape from his fans after the premiere, Don jumps into a passing car driven by Kathy Selden (Debbie Reynolds). She drops him off, but not before claiming to be a stage actress and sneering at his \"undignified\" accomplishments as a movie star.\nLater, at a party, the head of Don's studio, R.F. Simpson (Millard Mitchell), shows a short demonstration of a talking picture, but his guests are unimpressed. To Don's amusement, Kathy pops out of a mock cake right in front of him, revealing herself to be a chorus girl. Furious at Don's teasing, she throws a real cake at him, only to hit Lina right in the face. She runs away. Don is smitten with Kathy and searches for her for weeks. While filming a love scene, Lina tells him that she had Kathy fired. Don finally finds Kathy working in another Monumental Pictures production. She confesses to having been a fan of his all along.\nAfter a rival studio has an enormous hit with its first talking picture, the 1927 film The Jazz Singer, R.F. decides he has no choice but to convert the next Lockwood and Lamont film, The Duelling Cavalier, into a talkie. The production is beset with difficulties, including Lina's grating voice and strong New York accent. An exasperated diction coach tries to teach her how to speak properly, but to no avail. The Duelling Cavalier's test screening is a disaster; the actors are barely audible thanks to the awkward placing of the microphones, Don repeats the line \"I love you\" to Lina over and over, to the audience's derisive laughter, and in the middle of the film, the sound goes out of synchronization, with hilarious results.\nDon, Kathy and Cosmo come up with the idea to turn The Duelling Cavalier into a musical called The Dancing Cavalier, complete with a modern musical number called \"Broadway Melody\". Cosmo, inspired by a scene in The Duelling Cavalier where Lina's voice was out of sync, suggests that they dub Lina's voice with Kathy's. R.F. approves the idea but tells them not to inform Lina about the dubbing. When Lina finds out, she is infuriated. She becomes even angrier when she discovers that R.F. intends to give Kathy a screen credit and a big publicity buildup afterward. Lina threatens to sue R.F. unless he orders Kathy to continue working uncredited as Lina's voice. R.F. reluctantly agrees to her demands, as a clause in her contract states that she can sue whenever denied a role of her choosing.\nThe premiere of The Dancing Cavalier is a tremendous success. When the audience clamors for Lina to sing live, Don, Cosmo, and R.F. tell her to lip sync into the microphone while Kathy, hidden behind the curtain, sings into a second one. While Lina is \"singing,\" Don, Cosmo and R.F. gleefully raise the curtain, revealing the fakery. Lina flees. A distressed Kathy tries to run away as well, but Don proudly announces to the audience that she's \"the real star of the film.\" Later, Kathy and Don kiss in front of a billboard for their new film, Singin' in the Rain."}