{"mid": "Singham", "IMDB_id": "tt1948150", "title": "Singham", "plot": "Singham opens with an honest police officer in Goa, Rakesh Kadam (Sudhanshu Pandey), committing suicide because of false accusations of corruption filed by Jaikant Shikre (Prakash Raj), a don and politician in Goa running various rackets like kidnapping, extortion and smuggling. Kadam's wife Megha Kadam (Sonali Kulkarni) vows revenge but cannot find any support or help from the police or Minister Anant Narwekar (Anant Jog).\nThe story moves to Shivgarh, a small village near the Goa-Maharashtra border. Bajirao Singham (Ajay Devgn), an honest Maratha police inspector like Kadam, is in charge of the Shivgarh police station. He resolves most of the problems in his town informally and without filing charge sheets, thereby gaining much reputation and love from the villagers. Gautam Bhosle a.k.a. Gotya (Sachin Khedekar) is an industrialist and a friend of Singham’s father Manikrao Singham (Govind Namdeo). He comes to Shivgarh with his wife and daughter Kavya (Kajal Aggarwal). Eventually Singham and Kavya fall in love with each other. Their courtship takes place through a series of comic events where she initially hates him and then has a change of heart when she sees his honest and simple nature.\nEverything seems to run smoothly until Jaikant, who is given a conditional bail for a murder he had committed, is required to travel to Shivgarh to sign the bail every fortnight. He, instead, sends one of his allies to do the formalities, much to the fury of Singham who demands Jaikant sign the bail in person. Humiliated, Jaikant reaches Shivgarh but is unable to take any revenge on Singham fearing the wrath of villagers, who threaten to finish him off. Using his political contacts, he gets Singham transferred to Goa to take revenge.\nSingham, unaware of Jaikant’s hand behind his transfer, joins Colva police station. His co-workers, Sub-Inspector Dev Phadnis (Vineet Sharma), Sub-Inspector Abbas Malik (Ankur Nayyar), Head Constable Savalkar (Ashok Saraf) hate Jaikant for his crimes but are unable to take any action because of Jaikant’s political powers. DSP Patkar (Murli Sharma), Singham's senior, is on Jaikant's payroll and takes care in concealing and eliminating the evidence of Jaikant’s crime from the eyes of the law. Singham tries to take this to the notice of DGP Vikram Pawar (Pradeep Velankar)) but it turns out to be of no use as there is no evidence against Jaikant and Patkar. The local minister Anant Narvekar (Anant Jog) does not help Singham and in turn, he warns him to stay away from Jaikant's case. Defeated Singham wants to return to his hometown but is stopped by Kavya and Megha Kadam, who encourage him to fight against the evil and not run away like a coward.\nBeing mentally tortured by Jaikant, Singham arrests Jaikant’s top lieutenant Shiva Nayak (Ashok Samarth) in a fake case of illegally smuggling alcohol. He thwarts off DSP Patkar in full view of the public when Patkar, bounded by his duties to Jaikant, tries to protect Shiva. Meanwhile, Megha Kadam, after being ridiculed by DGP Pawar and minister Narvekar for her innocent husband’s death, seeks help from Singham to absolve her late husband from the corruption charges . Jaikant kidnaps Kavya’s younger sister Anjali (Sana Amin Sheikh) for ransom. Rescuing her, Singham successfully traces the origins of the kidnapping racket to Jaikant but is unable to arrest him as he wins an election and is set to become a minister of Goa Govt.\nJaikant sends transfer orders to Singham to go back to Shivgarh within 24 hours. That night at a police function organized for the officers with their family, Singham confronts the officers for not abiding by their duties and being dishonest and unfaithful to their profession by protecting Jaikant. At first, the officers disagree with Singham, but filled with guilt, the officers decide to help Singham fight Jaikant. Soon, the entire Goa Police Force reach his home to kill him, with DGP Pawar and DSP Patkar, now in support of Singham. Jaikant eventually escapes but after running through the city, he is arrested by the police the next morning. They bring him to the police station and shoot him dead on the same chair where Inspector Rakesh Kadam had shot himself. Then they threaten Shiva to change his statement. Jaikant and Minister Narvekar are proved guilty. At a media conference, DGP Pawar and Singham clear late Kadam of all corruption charges.\nThe film ends with Singham and other police officers saluting Mrs.Megha Kadam."}