{"mid": "SinkinInTheBathtub", "IMDB_id": "tt0021380", "title": "Sinkin' in the Bathtub", "plot": "The film opens with Bosko, a cheerful Negro boy, whistling in his bathtub as the shower fills it with water. The song, appropriately, is \"Singin' in the Bathtub.\" He plucks his toes and his nose to make musical sounds. He even plays the streams of water as if they were harp strings. The bathtub gets into the act, by rising on its feet and dancing around the bathroom, waving a bath towel and throwing sheets of toilet paper into the air as if they were flower petals.Bosko takes his pants off a nail, drops them on the floor and then pulls a hair on his head to lift the pants onto his body. He redirects the stream of water from the shower head to spray outside the window and then rides the stream out of his house.The music-happy boy pulls a huge harmonica out of his pants, plays for a bit and then whistles for his car, which he believes is in his garage. Instead, the anthropomorphic car exits from the outhouse, with its trunk door still open, revealing its bare behind. Bosko cranks the car, which twists it like taffy. The car untwists, spinning Bosko around. Bosko leaps into the car and takes off.The car chugs along as Bosko plays his harmonica. When the car reaches a field of tulips, it \"tiptoes\" with its back wheels as Bosko picks the flowers and stores them in his car horn. The background music is \"Tip-Toe thru' the Tulips with Me.\"Bosko arrives at the home of his sweetheart Honey. She is also in her bathtub, singing \"Singin' in the Bathtub.\" Bosko calls to her. She cries \"Ooh!\" in embarrassment and pulls down the shade. She pulls her underthings from the clothesline and then appears in an open window. \"Hello, Bosko!\" she calls down from the second floor.Bosko blows once on his horn, which blows out the tulips, allowing him to catch them and hold them behind his back. \"Guess what I got for you, Honey!\" A goat walks up behind him, smells the flowers and eats them, leaving only the stems. Bosko is shocked and then sad. He drops the stems on the walkway, and weeps.\"Don't cry, Bosko!\" soothes Honey. \"Ah still loves ya!\" Bosko's mood immediately brightens, and he makes loving gestures toward his sweetie. The goat, unimpressed, blows a raspberry at Bosko and begins to walk away. Bosko kicks the goat, which sends its rear end flying in the air, up and over the goat's head. The goat walks under its back legs to get itself straightened out, bleats back at Bosko and walks off.Bosko takes his car horn and a piece of his engine, makes a saxophone out of it and dances up to Honey's house on her walkway, which sounds like a xylophone each time he steps on a plank. Honey dislikes the music and throws her bathwater over her balcony, which falls into Bosko's instrument. Bosko keeps playing as bubbles emerge from the saxophone. Honey is happy now, and dances around on the bubbles in mid-air. She jumps back on her balcony and swivels her hips until her skirt falls off. She pulls a beribboned hair on her head, which lifts her skirt back over her midsection. Then she dances on the bubbles as they pop, as she gently drops down to earth.Bosko, happier than ever, dances and slides on her walkway, which still makes the sound of a xylophone. Honey does the same, and then both jump into Bosko's car and take off.While in the car, the two lovebirds share three lip-smacking kisses before they encounter a cud-chewing cow on the road. The cow is distinguished by a pair of eyeglasses, a cowbell and an unusually large udder. Bosko honks at the car to move out of the way, but the haughty animal merely opens two of her teeth like moving panels and spits out a large glob of cud as if it were tobacco juice. This splashes onto the car and flattens it. Bosko angrily pulls the car back into shape. He pushes the cow's body down under her legs, which stick up like tent poles, and drives over her. The cow, shocked at this outrage, uses her back leg to twist her tail like a crank, which pulls her midsection back up where it should be. She walks off, throwing her head in the air and then throwing her behind in the same direction. This sends her enormous udder flying and hitting her on the back.Bosko and Honey laugh at the cow, but don't look where they're going. They hit a boulder, which sends Bosko flying out of the car and hitting the ground, causing him to break up into several tiny Boskos. His tiny selves reassemble themselves into one self, and then he catches up with the car, which suddenly poops out and flattens at the prospect of climbing a steep hill. Bosko kicks and pushes the car up the hill, but when he gets it over, he loses control of it, as it speeds down the hillside with poor Honey alone, crying \"Help! Oo! Ee! Ow! Ee!\" and so on.Bosko races behind and grabs the tailpipe, which pulls like an elastic band. He keeps holding on even while hitting various-size boulders, which again sound like the notes of a xylophone. He holds on even while being pulled over small trees. Finally he is tossed up and over the car, briefly flattening like a pancake in front of it, before returning to his proper shape and finding that the out-of-control car is chasing him. Bosko trips over a boulder and continues down the hill, sliding along on his chin.Now he's running again, and seems to appeal to the audience when he faces the camera and cries \"Mammy!,\" which recalls the signature song of the blackface performer, Al Jolson. Bosko, and then the car with Honey, sail through a house along the hillside. When they emerge, the car is gone, and Honey is now riding in an out-of-control bathtub on wheels, which chases Bosko off the hill and onto a tall landmass shaped like an enormous tree trunk. It also has a long, winding road leading downward. The bathtub car chases Bosko to the edge of a cliff. He's forced to jump off; and as he does so, his screaming mouth fills the camera. The bathtub-car flies off the cliff, too, and Honey's screaming mouth also fills our view.Bosko falls until a tree branch just above a pond catches him. The bathtub with Honey falls into the pond. A splash of water rises up and forms itself into a hand that grabs Bosko and sets him in the bathtub. Bosko and Honey are thrilled to find themselves together and safe at last. Bosko pulls two cattails growing out of the pond and uses them to play the lily pads like a xylophone. Bosko and Honey hug each other as ducks surround them and quack with approval."}