{"mid": "Sintel", "IMDB_id": "tt1727587", "title": "Sintel", "plot": "A woman, Sintel, is attacked while traveling through a wintry mountainside. After defeating her attacker and taking his spear, she finds refuge in a shaman's hut. He asks her why she is traveling, and she confesses that she is looking for a dragon, leading into a flashback. Sintel was a homeless loner, looking for food when she discovered an injured baby dragon. She nursed him back to health and named him Scales, and the two quickly formed an emotional bond. One day, while Scales was flying, he was captured by an adult dragon. Determined to get him back, she began the long and dangerous journey that led her to the shaman's hut.\nSintel is ready to give up when the shaman tells her that they are in dragon lands, showing her the glyph on her attacker's spear as proof. She finds the tree pictured on the spear, and near it a cave with an adult dragon and his baby. The baby runs away upon seeing Sintel, and the adult dragon attacks. After a brief battle the adult dragon pins Sintel to the ground, but freezes when he recognizes her scent. Sintel takes advantage of this momentary pause and stabs the dragon in the heart. As she is about to land the killing blow, she notices the scar on his wing is exactly the same as her old friend's. Sintel discovers in a moment of horror that she has just killed Scales.\nScales bleeds out rapidly, and Sintel stares in shock at her reflection in a pool of blood. It is revealed that she is significantly older than she has appeared throughout the film. She has much gray hair, worn and wrinkled skin, and several scars on her body. The long search for Scales had lasted many years, and she had never realized that Scales would have grown up. Her single-minded quest to get back her friend, and to take revenge on the large dragon who took Scales away, contributed to her mistaking Scales for the small dragon. The cave begins to collapse as Scales gives his last breath, and Sintel runs for the entrance.\nAfter mourning over the friend she killed, Sintel leaves, heartbroken. Scales' baby, having nowhere else to go, follows her."}