{"mid": "SixDaysSevenNights", "IMDB_id": "tt0120828", "title": "Six Days Seven Nights", "plot": "Robin Monroe (Anne Heche) is a New York journalist who works for Dazzle, a fashion magazine. She is invited by her boyfriend Frank (David Schwimmer) to spend a week holidaying with him on the island paradise of Makatea, in the South Pacific. The final leg of their journey to Makatea is in a dilapidated de Havilland Canada DHC-2 Beaver, piloted by middle-aged American Quinn Harris (Harrison Ford). They are accompanied by Quinn's girlfriend and co-pilot Angelica (Jacqueline Obradors). On their first night on the island, Frank proposes to Robin, who happily accepts. At a bar, a drunken Quinn makes a move on Robin, which she rejects as Frank appears.\nThe next morning Robin is called away by her boss to Tahiti to supervise a fashion event. She hires Quinn to fly her there, but a thunderstorm forces them to crash-land on a deserted island. Initially believing they are on an island with a peninsula to the north, they climb a mountain to disable a beacon Quinn believes to be there, but discover they are in fact on a different island with no beacon.\nIn Makatea, Frank is told that Robin and Quinn are missing. He and Angelica board a helicopter to search for them but with no success, thus leading Frank to believe that his fiancee is dead. One night, Frank gets drunk and sleeps with Angelica after she seduces him.\nAfter seeing a boat, Robin and Quinn try to reach it but discover that the boat is taken by pirates (played by a New Zealand Maori, a Samoan and two East Asian actors), who discover them and capture them. Quinn manages to distract the pirates and the two narrowly escape by jumping into the ocean from a cliff. In the jungle, they discover an abandoned World War II Japanese plane, where they camp for the night. Salvaging parts from it, they succeed in getting Quinn's plane airworthy again and manage to take off from the island, avoiding the pirates again, who accidentally destroy their own boat. Quinn is injured but Robin manages to land in Makatea, where their funerals are held. Frank is very happy to see Robin alive, but is disgusted at himself for sleeping with Angelica and not being able to tell Robin about it. Robin goes to the hospital where Quinn is recovering and tells him her feelings for him, but he rejects her.\nAfter their vacation ends, Robin decides to fly back New York with Frank, but at Tahiti, she reveals to Frank that she doesn't want to get married. Frank finally tells her he slept with Angelica and she tells him about her feelings for Quinn. They decide they are not in love and she gives him back the engagement ring.\nQuinn has a change of heart and rushes to the airport, but is too late to stop the plane. He then encounters Robin getting off an airplane, having stopped the flight. He walks up to her and they embrace and kiss each other."}