{"mid": "SixDegreesOfSeparation", "IMDB_id": "tt0108149", "title": "Six Degrees of Separation", "plot": "A young black man named Paul shows up at the home of art dealer Flan Kittredge and his wife Louisa, known simply as \"Ouisa\", who live overlooking Central Park in New York City. Paul has a minor stab wound from an attempted mugging, and says he's a friend of their children at Harvard University. The Kittredges are trying to get the money to buy a painting by Paul Cézanne and now have this wounded stranger in their home. Paul claims he is in New York to meet his father, who is directing a film version of the Broadway musical Cats. Paul continues to charm them with his story, though, in reality, it is all a lie: Paul is not a Harvard student but obtained details on the Kittredges from another male student he had seduced. Eventually Paul uses their home for an encounter with a hustler, but is caught red-handed. The police are called, but Paul escapes.\nSoon after, Paul starts up another con against a sensitive young man named Rick and his live-in girlfriend, Elizabeth. The young couple are new to the big city and, based on Paul's con, invite him to live with them until he gets everything sorted out with his wealthy father—who Paul tells them is Flan Kittredge. The trio become good friends, with Paul spinning a tale of being estranged from his racist father; the girlfriend tells Rick not to lend Paul any money. One night Paul takes Rick out on the town, and seduces him in order to get the money. Later that night, Rick tells Elizabeth that Paul is gone, that he has all their money, and that he and Paul had sex. In a fit of fury, she cruelly suggests that Rick's father had always questioned his son's sexuality. Soon afterwards Rick commits suicide.\nIn desperation, Paul calls the Kittredges for assistance. Partly due to strained relations with her children, Ouisa finds herself feeling emotionally attached to Paul, hoping to be able to help him in some way despite the fact that he has victimized them. Over a protracted and laborious phone call, he agrees to give himself up to the police; however, during the arrest, he and the couple are separated. Despite their efforts—Ouisa's more than Flan's—his fate is unresolved, except for a possibly tragic end. Towards the end of the play, in a climactic moment of reflection, she delivers the play's most famous monologue:"}