{"mid": "SixteenCandles", "IMDB_id": "tt0088128", "title": "Sixteen Candles", "plot": "High school sophomore Samantha \"Sam\" Baker (Molly Ringwald) struggles to get through the day on her 16th birthday, which her entire family has forgotten about because her older sister, Ginny (Blanche Baker), is getting married the next day. She is also plagued by infatuation with a popular and attractive senior, Jake Ryan (Michael Schoeffling). At school she fares no better when she finds out that a completed \"sex quiz\", which she tried to surreptitiously slip to her friend Randy (Liane Curtis), never reached her friend Randy and, unbeknownst to either of them, was picked up by Jake. Sam panics because the quiz contains sensitive information, such as she is a virgin and is saving herself for Jake.\nShe has a whole new set of problems when she arrives home to discover all four of her grandparents are staying at the Baker home during the wedding. One set of grandparents has brought along a bizarre foreign exchange student, Long Duk Dong (Gedde Watanabe). The grandparents force Sam to take him along to her school's senior dance that night and, to Sam's amazement, it takes \"The Donger\" only five minutes to find an unlikely girlfriend—the tall, large-breasted jock, Marlene (Deborah Pollack), nicknamed \"Lumberjack\". They are found slow dancing in the gym.\nA subplot involves a geeky freshman (Anthony Michael Hall) who tries to win a bet with his friends by continually (and unsuccessfully) trying to bed his love interest, Sam. The character is referred to on several occasions in the film as either \"Ted\" or \"Farmer Ted\", but is credited simply as \"the Geek\". On the way home on the school bus, Sam blows him off by saying, \"Go to hell.\"\nIn the school auto shop during the dance, Sam and Ted begin talking and Sam confesses her love for Jake. Upon hearing this, Ted tells her that Jake had been asking about her at the dance, and they agree that Sam should just go and talk to him. As she's leaving, Ted reveals the wager to Sam, who agrees to loan him her panties to help him win.\nLater (after a $1 admission peepshow of Sam's panties, which Sam finds out about the next day), Ted and his equally unwelcome geeky friends, Cliff (Darren Harris) and Bryce (John Cusack), go to the senior dance after-party, hosted at Jake's house. When they knock on the door, Long Duk Dong, who has come to the party with Marlene, greets them. Ted and his gang get in but they make a big mistake by knocking over the jocks' beer can pyramid. Ted and Bryce leave it up to Cliff to deal with the jocks.\nMeanwhile, upstairs in Jake's bedroom, Jake takes the opportunity to look through the yearbook and finds Sam's photo. He jots down her phone-number on a scrap of paper and calls her, only to be disappointed when her grandparents pick up the phone.\nJake's entire house is completely trashed. At night's end, Jake finds Ted trapped under a table and they begin to talk. Jake inquires further about Sam, and Ted explains the situation. Jake makes a deal with Ted: If Ted lets Jake keep Sam's panties, Jake will allow Ted to drive home his drunk popular girlfriend, Caroline Mulford (Haviland Morris), in Jake's father's Rolls Royce. Jake later uses the excuse of finding them together to break up with Caroline (who had surprisingly fallen for Ted and doesn't mind the break-up very much). Ted's friends filmed Ted and Caroline making out. Afterward, Jake drives to the church just in time to meet an incredulous Sam after her sister's wedding.\nThe film concludes with Sam and Jake sharing a kiss over a birthday cake with 16 candles."}