{"mid": "Skammen", "IMDB_id": "tt0063611", "title": "Skammen", "plot": "A husband and wife, Jan and Eva, are former violinists who are living on a farm on a rural island during a civil war. Their radio and telephone do not work, and Eva expresses frustration at Jan's apparent preference of escapism from the conflict, while they debate whether they can have children and if Jan is selfish. The couple visit the town, and hear a rumor that troops will soon come, and meet with an older man who has been called to duty.\nWhen they return, their farmhouse becomes the site of a bloody siege. Jan and Eva are captured by the invading force and interviewed by a military journalist on camera, for a segment on the viewpoints of the \"liberated\" population. Eva initially seems indifferent to the conflict, but denies neutrality, and Jan declines to speak, and they are released. They are later captured again, and as soldiers interrogate them, the troops play the interview video which dubs over Eva's words with enemy language. This is primarily a scare tactic.\nEventually, they are released by Col. Jacobi, who had formerly been serving as the mayor. After the couple returns home, their relationship is strained. Jacobi becomes a regular, if not uncomfortably constant, visitor who treats them with gifts but also has the power to send the couple to a work camp. This relationship is manipulative. Jacobi convinces Eva to provide him with sexual favors in exchange for his bank account savings. They go into the green house to have sex while Jan is resting. He wakes, calling Eva's name. Eventually, he goes upstairs and finds Jacobi's savings on the bed and begins to cry. Eva enters, Jacobi stays outside and turns to leave. She harshly comments to a weeping Jan that he can continue sobbing if he feels it will help. Soldiers arrive, and Jacobi explains his freedom can be bought, as the side of the war who is here is in desperate need of money. Jacobi, the soldiers, and Eva ask Jan for the money. Jan states he does not know what money they are talking about. The soldiers raid the house to look for it, in vain. They hand Jan a gun to execute Jacobi, and he does. After the soldiers leave, Jan reveals he had the money in his pocket, to Eva's disgust. This has split their relationship irreparably and causes repeated break downs. The relationship grows silent and cold. When Jan and Eva meet a young soldier, Eva wants to feed him and allow him to sleep. Jan violently takes him away to shoot and rob him.\nEva follows Jan towards the sea, and he uses the money from Jacobi in order to buy them seats on a fishing boat. While at sea, the boats motor fails. The man steering the boat kills himself by lowering himself overboard. The boat later finds itself stuck in the middle of floating dead bodies, unable to move forward and continue. As the boat takes away the refugees, Eva tells Jan of her dream: she walks down a beautiful city street with a shaded park, until planes come and set fire to the city and its rose vines. She and Jan have had a daughter, who she is holding in her arms. They watch the roses burn, which she states \"wasn't awful because it was so beautiful\". She feels she had to remember something, but couldn't."}