{"mid": "Sledgehammer", "IMDB_id": "tt0244800", "title": "Sledgehammer", "plot": "In a remote house, an abusive mother locks her young son in a closet, then goes into another room to meet the man she is cheating on her husband with. The man and woman intend to abandon their respective spouses, but their plans are cut short when an unknown killer appears and murders them with a sledgehammer. The bodies were found by the authorities, with the exception of the boy, being missing and is presumed dead.\nTen years later, seven friends acquire the house to party in, and travel to it in a van, which they leave with a mechanic. When night falls, Chuck convinces the others to participate in séance to try and summon the spirits of the couple that died in the house, so they can learn who killed them. The séance is just a means for Chuck and Joey to prank their friends, but it succeeds in bringing forth the ghost of the missing boy, which appears as a towering man in a smiling translucent mask. The spirit hides Joey's body after stabbing him in the neck, and the next day it attacks Jimmy and Carol while they are having sex, bludgeoning the former with a sledgehammer, and snapping the latter's neck.\nDiscovering the fates of their friends, the remaining four teenagers decide to hold up in the house until morning, at which point they will try to reach the nearest town. When the others fall asleep, John grabs a knife and goes off in search of the killer, and finds the boy's skull in a closet, a newspaper mentioning his disappearance, and Carol and Jimmy's bodies seated at a table, near Satanic imagery painted with blood. John is confronted by the ghost, and tries to fight it off, but is stabbed in the back. The phantom then captures Mary, and is found (as the boy) stabbing her to death by Chuck and Joni. The spirit assumes its adult form, wounds Chuck, and goes after Joni.\nJoni fends off the ghost long enough for Chuck to recover, and help her defeat it with its own sledgehammer. As the sun rises, Joni and Chuck flee from the house, unbeknownst that the killer's young form is glaring at them from the house's top window."}