{"mid": "SleepingWithTheEnemy", "IMDB_id": "tt0102945", "title": "Sleeping with the Enemy", "plot": "Laura Burney (Julia Roberts) lives in a beautiful home by the beach on Cape Cod with her husband, Martin (Patrick Bergin), a charming, handsome and wealthy investment counselor. Beneath his charm, however, Martin is an angry, possessive control freak who has been physically and emotionally abusing Laura throughout their marriage. One day, Martin believes Laura has been flirting with an attractive neighbor, and he physically assaults her in a jealous rage. In an effort to escape Martin, Laura fakes her own death at sea in a storm while the couple are boating. Because Laura had deliberately led Martin to believe that she could not swim, he believed she had died once she was lost overboard. However, Laura was able to swim safely to shore, because she had recently taken swimming lessons at the YWCA. Laura secretly returns home, retrieves some clothing and cash she had hidden away in preparation, disguises herself, and leaves home after \"flushing\" her wedding ring down the toilet.\nLaura moves to Cedar Falls, Iowa. In preparation, she has told Martin that her mother, Chloe Williams (Elizabeth Lawrence), died, and pretends to attend the funeral, but secretly moves her to a nursing home in Iowa. She rents a modest house and adopts the name Sara Waters. In Cedar Falls, she meets Ben Woodward (Kevin Anderson), who teaches drama at University of Northern Iowa. A relationship develops, but suffers a setback when Ben discovers that her real name is not Sara. After a date, Laura is unable to be physically intimate with Ben, and the next day, she confesses that she is on the run from her abusive husband.\nMeanwhile, Martin receives a chance phone call from a friend of Laura's from the YWCA and learns of Laura's swimming lessons. His suspicions aroused, Martin heads home and finds Laura's wedding ring in the toilet bowl where it failed to flush. From the Cape Cod nursing home, he learns that Laura's mother is alive, and has her traced to the nursing home in Iowa. He visits Laura's mother and tells her he is a police officer needing information about Laura. He learns from her that Laura is seeing a college drama teacher in Cedar Falls.\nMartin finds Laura and Ben at a local fair, then follows her home. After leaving idiosyncratic clues of his presence around the house for Laura to find, Martin confronts Laura. Ben appears at the front door and Martin, brandishing a gun, threatens to kill Ben if she doesn't make him leave. Laura talks to Ben and he appears to leave, but then he breaks down the door and struggles with Martin, who knocks him unconscious. As Martin points the gun at Ben, Laura distracts Martin then attacks him. He drops the gun and Laura manages to take control of it; she fires at Martin but misses.\nLaura holds Martin at gunpoint while she calls the police. She tells the police that she just killed an intruder, hangs up the phone and shoots Martin three times.\nWhen Martin falls to the ground, she drops the pistol and collapses, sobbing. Martin, not yet dead, picks up the gun and attempts to shoot her, but the gun only clicks empty and he dies. Ben is revived by Laura. They embrace as Martin's dead body lies on the ground with Laura's wedding ring inches from his hand."}