{"mid": "SleepawayCampIIITeenageWasteland", "IMDB_id": "tt0096119", "title": "Sleepaway Camp III: Teenage Wasteland", "plot": "In 1989, one year after the events of second film, the film opens with Maria (Kashina Kessler) heading to camp. Suddenly, she is chased into an alleyway by a large truck, driven by serial killer Angela Baker (Pamela Springsteen), before being run over. Angela disposes of the body in a trash compactor and poses as Maria in order to board the bus to Camp New Horizons, which was once Camp Rolling Hills where Angela massacred campers the year before. After arriving, news reporter Tawny Richards (Randi Layne) interviews the many campers who are taking part in \"an experiment in sharing,\" seeing different social classes living together. Tawny asks Angela to get her some cocaine, however Angela gives her Ajax cleaner instead, which kills Tawny when she snorts it.\nAfter the campers have settled in, camp councilors Herman (Michael J. Pollard), Lily (Sandra Dorsey) and Officer Barney Whitmore (Cliff Brand), who Angela realizes is the father of a previous victim, split the campers into three groups, who they will be camping with over the next few days. Angela is placed in a group with Herman, Snowboy (Kyle Holman), Peter (Jarret Beal) and Jan (Stacie Lambert). Angela goes fishing with Snowboy and Peter, but soon gets annoyed by them setting off firecrackers and returns to camp, only to find Herman and Jan having sex. Angela impales Herman through the mouth with a log, before bashing Jan's head in. Angela hides the bodies from Snowboy and Peter, who continue to annoy her throughout the day. At night, Angela sets off a firecracker in Peter's nose, killing him, before hitting Snowboy with a log and burning him alive, along with the other bodies.\nThe next morning, Angela travels to Lily's campsite, where Bobby (Haynes Brooke), Cindy (Kim Wall), Riff (Daryl Wilcher) and Arab (Jill Terashita) are camping. Angela tells Lily that Herman told her she was to switch places with Arab. As Angela escorts Arab to the other camp, she decapitates her with an axe. When Angela returns to camp, an argument breaks out between Cindy and Riff, before Lily sets the campers out on a trust building exercise. Blindfolded, Cindy doesn't realize that Angela, having grown tired of the girl's whiny and bigoted behavior, has attached her to the flag pole. Angela raises Cindy into the air, before letting her drop from a high height, killing her. Angela covers up her death by telling Lily she returned to the main camp. In another game, Angela is tied to obnoxious Young Republican Bobby, but while fishing he attempts to kiss her, annoying Angela who tells him to later meet her at the main cabin. Returning to camp, Angela convinces Lily to go check on Cindy with her, however Angela buries Lily, up to her neck, in a trash hole, before running over her head with a lawnmower. Angela then waits for Bobby to arrive, who she ties to a tree and proceeds to rip his arms off by attaching the rope to a Jeep and driving away. Angela then murders Riff by stabbing him with tent spikes.\nThe following morning Angela travels to the remaining camp, where Barney, Marcia (Tracy Griffith), Tony (Mark Oliver), Anita (Sonya Maddox) and Greg (Chung Yen Tsay) are camping. Angela tells Barney she is to switch with Marcia, but Marcia objects. As Barney accompanies Angela and Marcia to the other camp, Angela is forced to fake a leg injury. Barney tends to Angela at the main camp, but Marcia discovers Lily's body and flees, while Barney discovers Angela's identity. After a tense stand-off she shoots him dead. Angela catches up with Marcia in the Jeep and captures her. Angela returns to Tony, Anita and Greg that night and ties them together, telling them they are playing a trust game. Instead, Angela shows them the body of Barney and forces them to find Marcia in one of the cabins. But Angela had set up a booby trap in one of the cabins and it kills Greg and Anita. Angela decides to let Marcia and Tony live, as they had struck up a romance. But as she leaves, Angela is attacked by Marcia who stabs her numerous times, leaving her for dead in the grass.\nMarcia and Tony summon the police to camp, and Tony is sad to discover Marcia already has a boyfriend. Meanwhile Angela, barely alive, is being taken to the hospital in an ambulance, where a cop and paramedic plot to kill her after discovering who she is. But Angela wakes and stabs them to death with a syringe. When the ambulance driver asks what is going on, Angela weakly replies \"Just taking care of business,\" and falls unconscious."}