{"mid": "SlickHare", "IMDB_id": "tt0039839", "title": "Slick Hare", "plot": "The cartoon opens with various shots of 1940s celebrities dining and drinking at the Mocrumbo club—including such personalities as Ray Milland (in a spoof of The Lost Weekend, he pays for his drink with a typewriter and receives miniature typewriters as change) and Frank Sinatra (depicted exaggeratedly thin, so much so that he slips into his straw when trying to take a sip from his drink). Fudd is a waiter at the Mocrumbo and comes out to find that his next customer is Humphrey Bogart.\nBogart tells Elmer that he wants fried rabbit, within 20 minutes—or else! (pulls out a tommy gun). This puts Elmer in a bind, as the restaurant is \"fwesh out of wabbit.\" However, during his frantic search for one, Elmer hears the familiar sound of Bugs munching on some carrots in a corner of the kitchen. Elmer lets Bugs know that Bogart wants to \"have\" him for dinner. Bugs immediately dresses in a tailcoat and wants to have a peek at what is cooking. Elmer quickly puts a mirror into a pot. Bugs, taking a look inside, soon realizes that he himself is the main course.\nBugs eventually manages to escape the kitchen, dressing like Groucho Marx in an attempt to fool Elmer. Elmer then appears next to Bugs, dressed as Harpo Marx. Bugs tries to make a getaway, but is stopped by the large abdomen of Sydney Greenstreet. He runs into Carmen Miranda's dressing room and hides in her iconic fruit headdress. Carmen then performs a song and as she exits the stage, Elmer starts chasing Bugs. Elmer runs away from the audience leaving Bugs to dance to the orchestra's samba rhythms.\nBugs then makes his way back to the kitchen, where he reveals in the audience's appreciation of his performance (\"Ah, my public! How they love me! A-huh-huh!\" (the little laugh being a Jack Benny shtick). Fudd then runs towards Bugs, and Bugs immediately pretends to be a waiter ordering pies and twice splatters Elmer in the face. The third time (a comic triple), Elmer throws the pie at Bugs, but he ducks and it sails out into the seating area, hitting Bogart in the face. Bogart walks into the kitchen, grabs Elmer and asks him, \"Why did you hit me in the face wid a coconut custard pie wid whipped cream?\" Bogart then warns Elmer that he has just 5 minutes to come up with his fried rabbit. Elmer searches frantically, but cannot find one in time. Bogart returns, and sticks his hand in his jacket menacingly. Elmer thinks he's about to die, but Bogart only pulls out a handkerchief to dab his forehead as he says resignedly, \"Baby will just have to have a ham sandwich instead.\" Upon hearing \"Baby\", Bugs jumps out of his hiding place and takes his place as the main course (Lauren Bacall being \"Baby\"), noting, \"Remember, garçon, the customer is always right! If it's rabbit Baby wants, rabbit Baby gets!\" before howling and wolf whistling at Bacall."}