{"mid": "SlumsOfBeverlyHills", "IMDB_id": "tt0120831", "title": "Slums of Beverly Hills", "plot": "Fourteen-year-old Vivian Abromowitz's family are penniless nomads, moving from one cheap apartment to another in Beverly Hills in 1976, so that Vivian (Natasha Lyonne) and her brothers can attend the city's prestigious schools. Their father, Murray (Alan Arkin), is a divorced 65-year-old who refuses to retire, working as an unsuccessful Oldsmobile salesman whose cars are selling poorly due in large part to the Energy crisis of the time.\nVivian's wealthy Uncle Mickey (Carl Reiner) regularly sends the family money to help them survive. When Mickey's 29-year-old daughter Rita (Marisa Tomei) runs away from a rehab facility, Murray offers her shelter if Mickey will pay for a plush apartment. Vivian must babysit her adult cousin, making sure she gets to nursing school and avoids pills and booze. But Vivian has her own problems: she's curious about sex, likes an older neighbor kid, Eliot (Kevin Corrigan), has inherited her mother's ample breasts, and wants a family that doesn't embarrass her.\nVivian's older brother Ben (David Krumholtz) aspires to a show business career, while her dad aspires to feminine companionship but won't give in to wealthy lady-friend Doris Zimmerman's (Jessica Walter) desire that he send his kids back East to live with his exwife. Vivian's younger brother Rickey (Eli Marienthal) simply aspires to get attention.\nVivian and Rita are close and speak sometimes in their own invented language. Vivian learns that Rita has no desire to attend nursing school and also has no clue as to what to do with her life. Murray attempts to cover up Rita's lack of progress at nursing school, when Mickey asks for progress reports. Eventually, Mickey, frustrated at having to support his brother's family and also learning of their deception concerning his daughter (who is pregnant), explodes during a meeting between the two families, telling Murray he's tired of sending them money. Depressed and dejected, Murray once again packs the kids into his car and they take off. In an attempt to cheer her father up, Vivian suggests that the family stop for steak for breakfast—a ritual regularly shared by the family as a means of cheering themselves up."}