{"mid": "SmokeSignals", "IMDB_id": "tt0120321", "title": "Smoke Signals", "plot": "Victor Joseph (Adam Beach) and Thomas Builds-the-Fire (Evan Adams) live on the Coeur D'Alene Indian Reservation in Plummer, Idaho. Thomas is an eccentric storyteller and Victor is an angry young man who enjoys playing basketball.\nVictor and Thomas are brought together through Victor's father, Arnold (Gary Farmer). Arnold rescued Thomas as an infant from a house fire that killed his parents. Because of this, Thomas considers him a hero. On the other hand, Victor, who endures Arnold's alcoholism, domestic violence, and eventual child abandonment, regards his father with both deep love and bitter resentment. Thomas and Victor grow up together as neighbors and acquaintances, fighting with each other and simultaneously forming a close, albeit uneasy, alliance.\nWhen Arnold dies in Phoenix, Arizona, where he has stayed after leaving Victor and his mother Arlene (Tantoo Cardinal), Victor and Thomas go on an adventure to retrieve his ashes. The trip is the means for Victor and Thomas to explore their identities. Neither of them loses sight of his identity as an \"Indian,\" but their perspectives differ. Victor is more stoic and Thomas is more traditional (and romantic to the point of watching the feature film Dances with Wolves countless times). Their dichotomy is portrayed all through the film; it results in Victor being irritated with Thomas, and Thomas being fascinated with Victor.\nOnce they reach Phoenix, Victor has to confront his conflicted feelings about his father, as well as his own identity. He has to grapple with a new account of Thomas's parents' death, as told by his father's friend, Suzy Song (Irene Bedard). She says that a drunken Arnold set off fireworks, accidentally starting the fire that cost Thomas his parents. The road trip by the young men leads to Thomas reconciling with the memory of his adoptive father Arnold, as he understand more of his path to alcoholism and related abuse and abandonment. Victor also gains a better understanding of Thomas and his reverence for Arnold."}