{"mid": "SnoopyComeHome", "IMDB_id": "tt0069289", "title": "Snoopy Come Home", "plot": "Snoopy and the rest of the Peanuts gang go to the beach for the day. Once there, Snoopy promises to go back to the beach the next day to meet up with Peppermint Patty. After Charlie Brown has gone home to play Monopoly with the others, he notices Snoopy is late and remarks he is tired of Snoopy being late. The next day, Snoopy is thrown off the beach due to a new \"No Dogs Allowed on this beach\" rule (thus setting a running gag in the film). Then Snoopy gets thrown out of a library due to his disruptive behavior and another \"No Dogs Allowed in library\" rule. He then gets into a fight with Linus over his blanket, and later beats Lucy in a boxing match.\nLater, Snoopy receives a letter from a girl named Lila, who has been in the hospital for three weeks for unspecified reasons and needs Snoopy to keep her company. Upon receiving the letter, Snoopy immediately sets off with Woodstock to go see her, leaving Charlie Brown completely in the dark as to who Lila is. Linus decides to do some investigating, and discovers that Lila is Snoopy's original owner; Charlie Brown faints upon hearing this.\nEn route to see Lila, Snoopy and Woodstock are forced to face the challenges of a world full of signs declaring \"No Dogs Allowed.\" Each instance - on a bus, a train, and elsewhere - is musically accented by the deep tones of Thurl Ravenscroft. The pair are briefly adopted as pets by an animal-obsessed girl (identified as Clara in the theatrical poster and closed-captioning), but manage to escape. Snoopy and Woodstock camp out, and play football and music while preparing dinner.\nSnoopy finally reaches the hospital, but again no dogs are allowed inside. To add further insult, the hospital does not allow birds to enter either. Snoopy is foiled in his first attempt to sneak into Lila's room, but his second attempt is successful. He then keeps Lila company for the rest of his stay. Lila tells Snoopy that his visit helped her to get better. She then asks Snoopy to go home with her, but he has doubts about this idea. Snoopy decides to go back home to Charlie Brown. However, when he sees Lila watching him tearfully from her hospital window, Snoopy finds that it's too hard to leave with her feelings hurt so badly. He runs back to her, which she takes as a sign that he wants to live with her. But first, he needs to return to \"settle his affairs\" and say goodbye. Snoopy writes a letter directing that certain items of his will be given away: Linus is given his croquet and chess sets, while Schroeder receives Snoopy's record collection.\nThe kids throw Snoopy a large, tearful going-away party, each one bringing a gift. The kids closest to Snoopy get up to say a few words in his honor. But when it is Charlie Brown's turn to speak, he is overwhelmed to the point of silence. After giving Snoopy his present, he finally cries out in pain with Snoopy doing likewise. The rest of the gang, even Lucy, eventually follows suit when Schroeder plays \"It's a Long Way to Tipperary\" on his piano after Snoopy opens his mountain of presents (every single gift is a dog bone).\nAfter Snoopy leaves, Charlie Brown is unable to sleep or eat. When Snoopy arrives at Lila's apartment building the next day, he sees a sign next to the front door that says \"No dogs allowed in this building\". Snoopy is overjoyed that this gives him an excuse to return to Charlie Brown. Lila arrives and Snoopy is reluctantly introduced to her pet cat. Snoopy shows Lila the sign, and Lila has no choice but to allow Snoopy to leave. Snoopy leaves Lila behind and joyfully returns to Charlie Brown and the others.\nBack home, the children are overjoyed to see Snoopy return, carrying him on high to his dog house. Once there, Snoopy demands that the kids return the items he had given them before he left, turning their feelings to annoyance. The gang then leaves Charlie Brown and Snoopy together, then Charlie Brown walks crossly away. The film ends with end credits being typed out by Woodstock as Snoopy dictates."}