{"mid": "SnowWhiteATaleOfTerror", "IMDB_id": "tt0119227", "title": "Snow White: A Tale of Terror", "plot": "At the beginning of the story, a queen sits sewing at an open window during a winter snowfall when she pricks her finger with her needle, causing three drops of red blood to drip onto the freshly fallen white snow on the black windowsill. Then, she says to herself, \"How I wish that I had a daughter that had skin as white as snow, lips as red as blood, and hair as black as ebony.\" Some time later, the queen gives birth to a baby daughter whom she names Snow White, but dies shortly thereafter.\nA year later, Snow White's father, the king, takes a new wife, who is very beautiful, but a wicked and vain woman. The new queen possesses a magic mirror, which she asks every morning, \"Magic mirror in my hand, who is the fairest in the land?\" The mirror always replies: \"My queen, you are the fairest in the land.\" The queen is always pleased with that, because the magic mirror never lies. But as Snow White grows up, she becomes more beautiful each day and even more beautiful than the queen, and when the queen asks her mirror, it tells her that Snow White is the fairest.\nThis gives the queen a great shock. She becomes envious, and from that moment on, her heart turns against Snow White, whom the queen grows to hate increasingly with time. Eventually, the angry queen orders a huntsman to take Snow White into the deepest woods to be killed. As proof that Snow White is dead, the queen demands that he returns with her lungs and liver. The huntsman takes Snow White into the forest. After raising his knife, he finds himself unable to kill her and he spares her life. Snow White is told that her stepmother wants her dead and to get far away from the kingdom as possible. He instead brings the queen the heart of a wild animal.\nAfter wandering through the forest, Snow White discovers a tiny cottage belonging to a group of seven dwarfs. Since no one is at home, she eats some of the tiny meals, drinks some of their wine, and then tests all the beds. Finally, the last bed is comfortable enough for her and she falls asleep. When the dwarfs return home, they immediately become aware that someone snuck in secretly, because everything in their home is in disorder. During their loud discussion about who snuck in, they discover the sleeping Snow White. She wakes up and explains to them what happened, and the dwarfs take pity on her and let her stay with them in exchange for housekeeping. They warn her to be careful when alone at home and to let no one in when they are away delving in the mountains.\nMeanwhile, the queen asks her mirror once again: \"Magic mirror in my hand, who is the fairest in the land?\" The mirror replies: \"My queen, you are the fairest here so true. But Snow White beyond the mountains at the Seven Dwarfs is a thousand times more beautiful than you\". The queen is horrified to learn that the huntsman has betrayed her and that Snow White is still alive. Planning to kill Snow White, the queen disguises herself as an old peddler. The queen appears at the dwarfs' cottage and offers Snow White colorful, silky laced bodices and convinces Snow White to take the most beautiful laces as a present. Then the queen laces her up so tightly that Snow White faints, causing the queen to leave her for dead. But the dwarfs return just in time, and Snow White revives when the dwarfs loosen the laces.\nThe queen then consults her magic mirror again, and the mirror reveals Snow White's survival. The queen dresses as a comb seller and convinces Snow White to take a beautiful comb as a present. She brushes Snow White's hair with the poisoned comb and the girl faints again. She is again revived by the dwarfs when they remove the comb from her hair. When the mirror again indicates that Snow White still lives, the queen makes a third and final attempt on Snow White by disguising herself as a farmer's wife, an offering a poisoned apple to her. The girl is at first hesitant to accept it, so the queen cuts the apple in half, eating the white (harmless) half and giving the red poisoned half to Snow White. The girl eagerly takes a bite and falls into a state of suspended animation. This time, the dwarfs are unable to revive Snow White. Assuming that she is dead, they place her in a glass casket.\nAfter a short period of time, a prince traveling through the land sees Snow White. He strides to her coffin. Enchanted by her beauty, he instantly falls in love with her. The seven dwarfs succumb to his entreaties to let him have Snow White. The moment he lifts the coffin to carry it away, the piece of poisoned apple falls from between her lips and Snow White awakens saying \"Where am I?\" The Prince then declares his love for her and soon a wedding is planned. Snow White and the prince invite everyone to come to their wedding party, including Snow White's stepmother.\nMeanwhile, the queen, still believing that Snow White is dead, again asks her magic mirror who is the fairest in the land. The mirror says: \"Thou, lady, art loveliest here, I ween; but lovelier far is the new-made queen\", which enrages the queen. Not knowing that the Prince's bride is her stepdaughter, the queen arrives at the wedding and sees that the bride is Snow White, whom she thought dead. She chokes with rage, falls down, and dies. Snow White and the prince reign happily over the land for many, many years and sometimes traveling into the mountains and visiting the dwarfs, who had been so kind to Snow White."}