{"mid": "Snowpiercer", "IMDB_id": "tt1706620", "title": "Snowpiercer", "plot": "In 2014, an attempt to counteract global warming through climate engineering backfires catastrophically, unintentionally causing an ice age that extinguishes all life except the inhabitants of the Snowpiercer, a massive train powered by a perpetual motion engine that travels a circumnavigational track, created by the transportation magnate Wilford. By 2031, elites inhabit the extravagant front cars and the \"scum\" inhabit the tail in squalid and brutal conditions. Under watch by Wilford's guards, they are brought only gelatinous protein bars to eat and kept in their place in the social order by Minister Mason, while sometimes small children are taken away.\nConspiring with his mentor Gilliam, Curtis Everett leads the tail passengers in a revolt that he plans will take them all the way up to the engine. Overpowering the guards, they release security expert Namgoong Minsu and his clairvoyant daughter Yona from the prison car so as to disable the locks between cars. They take the car where insects are ground up to make their protein bars, and Gilliam suggests that if they take the subsequent water supply car, they will control any negotiation with Wilford. Instead, they are ambushed by a mass of masked men with hatchets led by Franco the Elder under Mason's orders; after a bloody battle Curtis sacrifices his second-in-command Edgar to win the fight. Mason is taken captive and Curtis, Namgoong, Yona, and three other rebels: Gilliam's bodyguard Grey, and Andrew and Tanya who have had their respective children Andy and Timmy taken away continue on with her as a hostage.\nThey travel through several luxurious cars and arrive at a classroom, where the teacher expounds to the children and the rebels on the greatness of Wilford and the \"sacred engine\". While distracted by the celebration of the New Year marking one circumnavigation of the globe, the teacher ambushes them, killing Andrew before Grey kills her. Further back, Franco and Mason's soldiers use the same distraction to kill the rebel army and many of the tail passengers. Franco executes Gilliam, and Curtis kills Mason in revenge. Curtis' group continues forward, followed by Franco, leading to a violent fight in a sauna car during which Franco kills Grey and Tanya before Curtis and Namgoong seemingly kill him.\nAt the gate to the engine, Namgoong reveals that he plans to use Kronole, a hallucinogen he has gathered from the elites they passed, as an explosive to blow a hatch to the outside, as he observed signs the world outside is thawing. Curtis confesses to him that shortly after boarding the train, the tail passengers resorted to cannibalism to survive, and he is haunted by his part in it. He was nearly ready to kill infant Edgar when Gilliam offered his own arm instead. After years of disdain for Wilford, Curtis seeks to learn what Wilford's intentions were. Franco is revealed to have survived and makes his way toward the engine.\nWilford's assistant Claude emerges from the engine, shoots Namgoong, and invites Curtis inside where he meets an aging Wilford. Wilford reveals to Curtis that his revolution was actually orchestrated by himself and Gilliam to reduce the population and maintain the balance of the sealed ecosystem, and subsequently orders the elimination of 74% of the remaining tail passengers. He explains the importance of using fear and chaos to maintain a necessary order and leadership on the train. After letting Curtis experience being alone for the first time in seventeen years, Wilford asks Curtis to replace him. Curtis appears ready to accept, when Yona runs in and pulls up a floorboard, showing Curtis that small children from the tail section are being trapped as replacement parts for \"extinct\" machinery; the tail section only serves to provide this resource to the engine. Curtis subdues Wilford and sacrifices an arm to save Timmy from this work.\nNamgoong revives and finally kills Franco as Yona lights the fuse on the Kronole. Curtis and Namgoong tightly embrace Yona and Timmy, protecting them from the blast. The explosion triggers an avalanche that derails the train. Yona and Timmy, apparently the only survivors, emerge from the wreckage and see a polar bear, proof that life exists outside the train."}