{"mid": "Snuff102", "IMDB_id": "tt0984118", "title": "Snuff 102", "plot": "Animal experimentation footage is shown, followed by a video of a man dismembering a female body in a bathtub. It is implied that the man masturbates after the corpse has been sufficiently mutilated. Next, someone browses and clicks on the link for \"Snuff Fantasy\". Images of animals and people (mostly women) being tortured and killed clutter the screen, followed by a real life video of a pig being stabbed in the throat, sqealing and bleeding out. A critic asks \"Until what point are you willing to watch? In other words, what do you want to watch?\" A wrists-bound-behind-her-back, tightly cleave-gagged, barefoot and crying woman in her bra and panties (Victim 102) is shown in a bathroom. She manages to force the gag out of her mouth, gets up and moves the shower's curtain. She then screams at what she sees.\nThe film now goes back one week (in black and white footage), and shows a beautiful female journalist (aka Victim 102, portrayed by Yamila Greco) doing her morning routines and watching a newscast about a recently captured serial killer of prostitutes. This inspires the journalist to write about violence itself. The reporter accesses the pornographic and shock websites frequented by the killer (being greatly disturbed by their content) and interviews a film critic and author (Eduardo Poli), who discusses topics such as misogyny, fetishes, new media, morality, pornography, snuff, and the value of human life. Intercut with the reporter's research are scenes of her and two other women (a pregnant prostitute and a porn star) being filmed as they are tortured by a masked man (portrayed by Rodrigo Bianco) who labels his captives... Victim 100, Victim 101, and Victim 102.\nThe pregnant woman (aka Victim 100, portrayed by Andrea Alfonso) is the first to be brutalized. All the while, Victims' 101 and 102 are sceaming and moaning through their tightly gagged mouths. Accompanying their gagged moaning is a disturnbing and relentlessly pounding industrial music score by El Hemisferio Derecho. Victim 100 is beaten, several of her fingers are cut off and a bag is pulled over her head, which is stomped and kicked repeatedly. The masked killer gropes Victim 100, stomps her stomach, bites one of her nipples off, mutilates her genitals with a chef knife, and proceeds to cut her open with the knife. Before moving on, the masked killer then removes the gag of Victim 102 and orally rapes her with the same chef knife while also masturbating. He then reapplies her gag and drags Victim 100 to the bathroom. With the killer now out of sight, Victim 102 flings a shard of broken glass from the dirty and trash-laden floor with her bare toes to her hands bound behind her to start cutting the rope that binds her wrists to the back of the chair. Coming out of the bathroom, the killer now goes to work on the porn star (aka Victim 101 portrayed by Silvia Paz). He beats her with a hammer, rips one of her eyes out, asphyxiates her with a bag, knocks her front teeth out with a chisel, and urinates on and rapes her.\nWhile the masked killer is taking Victim 101 apart with a hacksaw, the journalist is desperately trying to free her bare feet from the legs of the chair with her still-bound-behind her-hands. A flashback reveals that she was taken when she found hidden photographs depicting the film critic engaging in necrophilia. (The film critic and the masked killer are discovered to be partners in their sick fantasies.) Now freed from the chair, the still wrists bound-behind-her and gagged journalist escapes from the masked killer to the bathroom and manages to lock the door. Now... returning to the bathroom sequence from the beginning of the film, it is shown that the journalist discovered Victim 100 in the shower. The woman is still alive; something the masked killer rectifies when he breaks into the room, and at first bludgeons Victim 102 with a hammer (temporarily stunning her) but then bludgeons Victim 100 to death. The masked killer then drags the journalist out of the room with a hook impaling her belly, and as he prepares to kill her, she breaks the ropes binding her hands with another shard of glass on the floor, grabs a cellphone, and runs off.\nThe cellphone will not work, so the journalist tries to find a way out as the masked killer searches for her, machete in hand. The journalist squeezes out a barred window, and is chased into the woods by the masked killer, who catches her. As he strangles her, the journalist grabs a rock, beats the masked killer with it, and then finishes him off with his discarded machete. The journalist stumbles away, and is picked up by a passing motorist."}