{"mid": "Soapdish", "IMDB_id": "tt0102951", "title": "Soapdish", "plot": "Celeste Talbert, the long-time star of the daytime drama The Sun Also Sets, is targeted by her ambitious co-star Montana Moorehead; Montana connives to supplant Celeste as the show's star by promising sexual favors to its producer, David Seton Barnes. To make the audience hate Celeste's character, Montana and David come up with a last-minute plot change in which she will accidentally kill a young, destitute deaf-mute, played by the newly-cast Lori Craven. Despite the strong objections of head writer Rose Schwartz and Celeste herself, the scene plays out, but is interrupted by Celeste's recognition of Lori as her real-life niece. Network honcho Edmund Edwards sees potential in the relationship and makes Lori a regular cast member.\nMontana and David seek to further unnerve Celeste by bringing back Jeffrey Anderson, an actor who Celeste arranged to be fired from The Sun Also Sets decades before, after his romantic relationship with Celeste went sour. Bitter at being reduced to performing dinner theater for uninterested seniors in Florida, Jeffrey relishes the chance to needle Celeste. Outwardly despising Jeffrey but perhaps still harboring some feelings for him, Celeste becomes unhinged when Jeffrey and Lori seem to be about to begin a romantic relationship, seemingly from jealousy. However, when Lori and Jeffrey are about to enact a scripted onscreen kiss, Celeste stops them by revealing that Lori is actually her daughter by Jeffrey. On camera, Celeste explains that she was responsible for getting Jeffrey fired because she was distraught about the pregnancy. Then she went home, passed Lori off as her niece, and had her parents raise Lori, all due to pressure from the network. This incites disgust and scorn from nearly everyone on the show towards Celeste, but the scandal ignites renewed interest in the show, causing the ratings to skyrocket. A board meeting between the show's staff—including Rose, who speaks out in Celeste's defense—takes place thereafter, where David insists that she be fired, but he is quickly overruled as the situation has not only resulted in positive press for the show, but has generated a great deal of public sympathy for Celeste.\nThe next day, after an unpleasant exchange with Lori, Celeste goes to Jeffrey and pleads with him to speak to Lori on her behalf. Jeffrey is resistant at first, but after Celeste gives him advice on how to approach her and break the ice, the conversation leads to Celeste and Jeffrey embracing. Just when it seems the two are about to reconcile, Montana interrupts them and claims that she and Jeffrey slept together the previous night. Disgusted, Celeste storms off, leaving the situation between her and Jeffrey even worse than before. The dilemma is further inflamed when Rose—who by now is no longer angry with Celeste—shows her a tabloid newspaper proclaiming that Montana is pregnant with Jeffrey's child. After an explosive exchange between the three of them takes place over this, Celeste, Jeffrey and Lori go to the head of the network with their concerns and demand that some action must be taken to solve the problem. But it's Lori who delivers an ultimatum stating, \"It's them or me--that is the bottom line here! They go or I go!\"\nA decision is made by the network, and the actors head into a live episode still not knowing who will be written off the show. They will read their lines from a teleprompter so that the secret will be kept until the last minute. It is revealed that Lori's character has \"brain fever\" and will die; still hoping to be rid of Celeste, Montana ad-libs and suggests that a brain transplant can save her. Lori is shocked by the revelation, but in character, Celeste immediately plays along, offering her own brain for the operation. Touched by the sacrifice, Lori asks Celeste and Jeffrey not to leave the show, and softens to her newfound parents. Montana, desperate to stop them, reiterates that she is pregnant with Jeffrey's child, but she is publicly ruined by Rose who, with the help of vengeful Ariel Maloney, who wanted Jeffrey for herself, reveals the secret from a high school yearbook that Montana is actually a transsexual named Milton Moorehead. David is shocked and Montana flees the set, screaming in horror. Later, Celeste, Jeffrey, and Lori win soap opera awards while Montana is relegated to performing dinner theater at Jeffrey's former venue."}