{"mid": "Sob", "IMDB_id": "tt0083015", "title": "S.O.B.", "plot": "The story is a satire of the film industry and Hollywood society. The main character, Felix Farmer (Richard Mulligan), is a phenomenally successful film producer who has just made the first major flop of his career, to the dismay of his movie studio, resulting in the loss of his own sanity. Felix attempts suicide four times: He attempts to die of carbon monoxide poisoning in his car, only to have it slip into gear and drive through the side of his garage, down a sand dune and into the Pacific Ocean. He then attempts to hang himself from a rafter in an upstairs bedroom, only to fall through the floor, landing on a poisonous Hollywood gossip columnist standing in the living room below. Subsequently, he tries to gas himself in his kitchen oven, but is prevented from carrying out his intent by two house guests with other things on their mind. Thereafter he spends most of the time heavily sedated while his friends and hangers-on occupy his beach house. The occupation leads to a party which degenerates into an orgy. Finally, he tries to shoot himself with a police officer's gun but is prevented from doing so by the ministrations of a young woman wearing only a pair of panties. The experience gives him a brainstorm that the reason for his film's failure was its lack of sex.\nFelix resolves to save both the film and his reputation. With great difficulty he persuades the studio and his wife Sally Miles (Julie Andrews), an Oscar-winning movie star with a squeaky-clean image, to allow him to revise the film into a soft-core pornographic musical in which she must appear topless. He liquidates most of his wealth to buy the existing footage and to finance further production. If he fails, both he and Sally will be impoverished, at least by Hollywood standards.\nAt first the studio's executives are keen to unload the film onto Felix and move on, but when Sally goes through with the topless scene and the film seems a likely success, they plot to regain control. Using California's community property laws, they get the distribution and final-cut rights by persuading Sally to sign them over. An angry and deranged Felix tries to steal the movie negatives from the studio's color lab vault, armed only with a water pistol. He is shot and killed by police who think the gun is real.\nFelix's untimely death creates a crisis for his cronies Culley (William Holden), the director of Night Wind; Coogan (Robert Webber), Sally's press agent; and Dr. Finegarten (Robert Preston), who plan to give him a burial at sea. They steal his corpse from the funeral home, substituting the body of a well-known but underrated character actor who died in the first scene of the movie. Felix gets a Viking funeral in a burning dinghy, while the other actor finally gets the Hollywood sendoff many thought he deserved.\nThe epilogue later reveals that Felix's revamped film was a box office smash, and Sally won another Academy Award for her performance.\n=== The movie within the movie ===\nLittle is seen of the movie which is the focus of the plot, except for an extended dream sequence and a brief shot close to the end. The title is Night Wind, which provokes the headline \"Critics Break Wind\" seen on a copy of Variety at the start of S.O.B. after the initial flop. The plot of Night Wind is kept vague; it involves a frigid businesswoman (played by Sally) whose inability to love a \"male chauvinist\" rival executive stems from a childhood trauma that led to her sexual detachment.\nThe climax of Night Wind is the first scene of S.O.B., an elaborate song and dance sequence set to \"Polly Wolly Doodle\", in which Sally wanders through a room full of giant toys (several of which come to life), singing the song while dressed as a tomboy. The implication is that her father's death caused Andrews's character to renounce childhood and become a cold, frigid person.\nA second scene, taking place at the end of the film, has Andrews' character arrive at the home of her would-be lover after the dream, where he reveals that he still loves her, \"despite everything.\"\nWhen Felix rewrites the film to make it into soft porn, changes are made: Sally's character goes from sexually frigid to being a nymphomaniac. Her lover goes from male chauvinist to being a secret cross dresser. Felix axes the entire song sequence, turning it from a dream to a hallucination \"… caused by a powerful aphrodisiac put into her Bosco\" and replacing the regular version of \"Polly Wolly Doodle\" with a more haunting version. He has the \"toys\" dress in more erotic outfits, and includes a carnival barker-type muscle man (portrayed by S.O.B.'s choreographer, Paddy Stone), who tempts Andrews' character before she rejects him, by way of flashing her breasts."}