{"mid": "Society", "IMDB_id": "tt0098354", "title": "Society", "plot": "Bill Whitney seems to have it all. His family is wealthy and he lives in a mansion in Beverly Hills, California. He's popular at his high school, looks to be a shoo-in for class president, has a cute cheerleader girlfriend and owns a new Jeep Wrangler to drive around in. Despite this, he feels as though he does not fit in with his family or their high-society friends. When his sister's ex-boyfriend Blanchard gives him a surreptitiously recorded tape of what sounds like his family engaged in a vile, murderous orgy, Bill begins to suspect that his feelings are justified.\nBill gives the tape to his therapist Dr. Cleveland to listen to. When he comes back for his appointment, Dr. Cleveland plays the tape back for Bill. The audio has now changed and now merely contains the sounds of his sister Jenny enjoying her coming out party. Bill insists that what he'd heard before was real and calls Blanchard to get another copy. When he arrives at their meeting place, Bill discovers an ambulance and police officers gathered around Blanchard's crashed van. A body is placed into the back of the ambulance, but Bill is prevented from seeing its face.\nBill attends a party hosted by his upper-class classmate Ferguson. There, Ferguson lasciviously confirms that the first audio tape Bill listened to—with the sounds of an orgy on it—was the real tape. Angry and confused, he leaves the party with Clarissa, a beautiful girl he'd been admiring. They have sex at her house and Bill meets Clarissa's bizarre, hair-loving mother.\nBill returns home the next day and confronts his parents and sister, who are all in the master bedroom dressed in lingerie. At Blanchard's funeral, Bill and his friend Milo discover that Blanchard's corpse either needed a lot of reconstructive work for display, or is not real. Bill is approached by Martin Petrie, his rival for the high school presidency, who says he must speak with Bill and agrees to a secret meeting. Bill discovers Petrie with his throat cut. He sees someone race off through the woods then runs off to get the police. When he returns with the cops, the car and the body are missing, with a different car in their place.\nThe next day at school, Petrie shows up, alive and well. When Bill arrives at home, he confronts his family again, but with Dr. Cleveland's help, they drug Bill. As Milo secretly trails him, Bill is taken to a hospital. Bill awakens in a hospital bed and thinks he hears Blanchard crying out, but discovers that nothing is there. He leaves the hospital and finds his Jeep waiting for him. Milo tries to warn him, but he drives back to his house.\nBack home again, Bill finds a large, formal party. He is snared by the neck and Dr. Cleveland reveals all of the secrets he has been searching for. He is not really related to his family after all. In fact, his family and their high-society friends are actually a different species from Bill. To demonstrate, they bring in a still-living Blanchard. The wealthy party guests strip to their underwear and begin \"shunting\". The rich literally feed on the poor, physically deforming and melding with each other as they suck the nutrients out of Blanchard's body. Their intention is to do the same to Bill, but after escaping them and running about the house—seeing his family melding with each other as well—Bill manages to goad Ferguson into a fight. As the \"aliens\" cheer Ferguson on, Bill is subdued, but in a surprise attack, Bill manages to reach inside the pliable Ferguson and pull his head out through his buttocks, turning him inside-out. With the help of Milo and Clarissa—who is also of the alternate species but has fallen in love with Bill—he escapes, as one of the men at the party tells another he may have an \"opening in Washington\"."}