{"mid": "Solarbabies", "IMDB_id": "tt0091981", "title": "Solarbabies", "plot": "In a bleak post-apocalyptic future, most of Earth's water has been controlled. The Eco Protectorate, a para-military organization, governs the planet's new order. Orphan children, mostly teenagers, live in orphanages created by the Protectorate, designed to indoctrinate new recruits into their service. The orphans play a rough sport which is a hybrid of lacrosse and roller-hockey. Playing is the only thing that unites them other than the futile attempts of the Protectorate to control them. These orphans are Jason, the group's leader (Jason Patric), Terra (Jami Gertz), Tug (Peter DeLuise), Rabbit (Claude Brooks), Metron (James LeGros), and a young deaf boy named Daniel (Lukas Haas).\nWhile hiding in a cave, Daniel finds a mysterious orb with special powers. The orb is an alien intelligence called Bohdai, who miraculously restores Daniel's hearing and has other powers, such as creating rain indoors. Another orphan, Darstar (Adrian Pasdar), takes the orb, hoping that he will be able to use it. He leaves the orphanage on rollerskates and Daniel soon follows. The rest of the group chase after Daniel. The E-police learn of Bohdai while chasing the teens and catch Darstar with the sphere. The teens are eventually rescued by a band of older outlaws called the Eco Warriors. They have retired from fighting and are led by Terra's long-lost father. The teens leave the Eco Warriors and using their rollerskating skills, break into the Protectorate's high security Water Storage Building. The teens discover the E-Police are trying to destroy Bohdai and they manage to recover the alien, but as soon as they do the sphere dematerializes and destroys the facility, releasing the water back to where it belongs as they rush out. As they all gather on a nearby hillside, Bohdai sparks the first thunderstorm the teens have ever seen and returns to space, but not without leaving a bit of himself behind in each of them.\nUltimately, the orphans are seen swimming together in the newly restored ocean, Darstar being fully accepted into the group and Jason and Terra sharing a kiss."}