{"mid": "SolomonKane", "IMDB_id": "tt0970452", "title": "Solomon Kane", "plot": "The film opens in North Africa, 1600, with the English mercenary Solomon Kane as he leads his ship's crew into battle against the Ottoman occupiers of a fortress town. After defeating the defenders, Kane and his men raid the fortress, where most of the crew are killed by demons. Kane fights his way to the throne room, but, before he can loot the riches, he is confronted by a demon that tells him his soul is forfeit to Satan. Solomon rejects his fate and jumps out a window. Following this encounter, Solomon returns to England and finds sanctuary in a monastery. After a prophetic dream, the abbot apologetically expels Kane, and Kane travels by foot to his ancestral estate, from which he had been expelled in his youth after defying his father. Along the way, he is ambushed by robbers who mock his vow of pacifism and leave him for dead. He is found and treated by the Crowthorns, a family of Puritans traveling west to the New World. When the Crowthorns are slaughtered by corrupted followers of the evil sorcerer Malachi, Kane renounces his vows and swears to avenge their deaths and rescue Meredith Crowthorn, who has been marked by a witch and kidnapped by the Masked Rider, Malachi's lieutenant.\nKane battles Malachi's followers across the countryside, rescuing many captives but not finding Meredith. On his journey, he meets a deranged priest who explains Malachi's followers are taking the weaker survivors of their raids as slaves and corrupting the strong into soldiers. The priest tries to feed Kane to his parishioners, who have become ghouls, but Kane escapes, only to face the robbers who attacked him earlier, now corrupted servants of Malachi. He kills two of the robbers and interrogates the survivor, who tells Solomon that Meredith is dead. Kane throws the robber to the ghouls, and, believing his quest for redemption has failed, drinks to excess at a country inn. Former shipmates recognise him and try to recruit him as a leader of a resistance against Malachi, but Kane refuses. Malachi's followers attack the inn at dawn and crucify the leaders of the resistance, including Kane. As Kane hangs on the cross, Meredith cries out his name from her cage in the back of the raiders' wagon; Kane realises that he still has a chance to save her and pulls himself free. Before Malachi's remaining men can finish him, they are killed by survivors of the resistance, who take Kane to safety. Kane is healed by an old witch and is soon anxious to confront the raiders.\nThe resistance explain Malachi's background as a former healer who made a bargain with the Devil, and reveal that he now lives in Kane's ancestral home. Kane leads them into the castle via an underground passage, and, as the resistance fights Malachi's soldiers, Kane heads for the dungeons and frees many of the captives. There he finds not Meredith but his father, who explains that the Masked Rider is Kane's older brother Marcus, whom Kane thought he had accidentally killed after his banishment. Instead, Marcus was critically injured, and, when healers failed to revive him, his father turned to Malachi. Disfigured and turned to Malachi's will, Marcus became the Masked Rider. Solomon reluctantly acquiesces to his father's request and kills him, then heads to the throne room to confront Malachi. There, Kane finds Meredith in a cage, and as she warns him of a trap, Marcus stabs him in the back. Kane tries to reason with Marcus, but they engage in a duel; Kane wins after setting Marcus on fire and decapitating him. Malachi uses Meredith's blood to release a demon sent to claim Kane's soul, but Kane shoots Malachi dead and sacrifices himself to close the portal. Meredith believes Kane to be dead, but he awakens and explains that he has finally redeemed his soul. Kane reunites Meredith with her remaining family and buries his father and brother. In a final voice-over, he declares his intention to roam the Earth and oppose the forces of darkness."}