{"mid": "SomeCameRunning", "IMDB_id": "tt0052218", "title": "Some Came Running", "plot": "Dave Hirsh is a cynical Army veteran and an occasionally published but generally unsuccessful pre-war writer, who winds up in his hometown of Parkman after being put on a bus in Chicago while intoxicated. Ginnie Moorehead, a woman of seemingly loose morals and poor education, has taken the same bus.\nHirsh had left Parkman 16 years before when his older brother Frank placed him in a charity boarding school, and is still embittered. Frank has since married well, inherited a jewelry business from the father of his wife Agnes, and made their social status his highest priority. Dave's return threatens this, so Frank makes a fruitless stab at arranging respectability, introducing him to his friend Professor French and his beautiful daughter Gwen, a schoolteacher. Dave is entranced by Gwen, falling in love with her even though she rejects him, interested only in Dave's \"mind\" and his undeveloped talent as a writer.\nDave prefers and moves in different social circles, however. He befriends and partners with Bama Dillert, a hard-drinking southern gambler who has serendipitously settled in Parkman. Dave moves in with Bama, and they regularly gamble together, sometimes going on road trips to do so. Several young, aimless WWII veterans and Frank's daughter Dawn's boyfriend, Wally Dennis, an aspiring writer himself, hang around Frank and Bama in the bars of Parkman. Two factors seem to offer Dave hope and redemption: he takes a fatherly interest in his niece, Dawn, and continues to try to romance Gwen. Despite his somewhat notorious reputation, Dave is basically a good, honest man, well aware of his own shortcomings. His cynicism is often a mask to hide the pain of rejection.\nThough Ginnie is not his social or intellectual match, he eventually sees the basic good in her and responds to her unconditional love. Saddened by Gwen's rejection, Bama's decline from alcoholism and diabetes, disgusted by Frank's hypocrisy and social climbing, and conflicted by his feelings for Ginnie, Dave nonetheless marries Ginnie and goes to work in a defense plant while continuing to work on his writing. As Dave tires of his work in the defense plant and Ginnie becomes more materialistic, their marriage goes downhill and Dave decides to leave town. As he walks through town at night during Parkman's Centennial Celebration, Ginnie's jealous, drunken ex-husband, who had followed her to Parkman, stalks and shoots Dave in the face, killing him (in the 1958 film version, Ginnie's ex is a Chicago hoodlum, and Dave is only wounded while Ginnie is shot in the back and killed after throwing herself in front of Dave).\nThe book's plot, taking place in peacetime civilian life, is framed by two short war episodes printed in Italics - the prologue depicting Hirsh's experiences in the Second World War, describing Germans attacking (\"They came running through the fog...\"), the epilogue having Wally Dennis, after being rejected by Dawn, who had married a more socially prominent young man, fighting Chinese Communists (\"They came running through the paddy fields...\") and getting killed in the Korean War. Wally, the aspiring writer's last thought before being killed in a grenade explosion, is of the manuscript he would never complete."}