{"mid": "Somewhere", "IMDB_id": "tt1421051", "title": "Somewhere", "plot": "As the film opens a black Ferrari circles on a race track in the desert, its engine roaring in and out of the shot. When it eventually stops, Johnny Marco (Stephen Dorff) steps out. Marco is a Hollywood actor who, despite his recent rise to fame, does not feel much meaning in his daily life. He resides at the Chateau Marmont in Los Angeles from where he completes various publicity obligations for his new film: he is photographed with his co-star (Michelle Monaghan), gives interviews to the press, and attends an award ceremony in Italy. Despite drinking and socializing occasionally with Sammy (Chris Pontius), a fellow actor and childhood friend, Marco spends much time alone, driving his Ferrari motorcar, drinking beer, taking pills, and having casual sex with various women. Twice he has pole-dancing twins (Kristina and Karissa Shannon) set up their equipment and perform in his room, the first time he falls asleep and the second routine is more calisthenic than erotic.\nHe receives an unexpected visit from his 11-year-old daughter, Cleo (Elle Fanning). Her stay changes his lifestyle little at first, including his indulging an overnight visitor, a blonde woman. Johnny and his daughter spend time together in his hotel suite and he brings her with him on his daily routine and on a publicity trip to Milan (where he is awarded with a \"Telegatto\", in a show with local celebrities playing themselves), and through preparations for her departure to summer camp. As their time together grows, Johnny's fatherly emotions emerge and force him to re-assess his otherwise \"successful\" life. After Cleo leaves for camp Johnny calls his ex-wife and tearfully breaks down admitting his unhappiness at his empty life. His ex-wife is indifferent to his pain and declines his request to come see him. At the end, Johnny checks out of the hotel promising not to return, and drives his Ferrari into the countryside. He randomly stops and gets out, leaving the keys in the ignition, and walks down the highway smiling."}