{"mid": "SonOfBatman", "IMDB_id": "tt3139072", "title": "Son of Batman", "plot": "At the headquarters of the League of Assassins, Ra's al Ghul grooms Damian Wayne (son of his daughter, Talia, and Batman) to succeed him as head of the league. The league is attacked by a group of assassins led by Slade Wilson, Ra's al Ghul's initial choice for successor before meeting Batman; Feeling betrayed, Slade decides to seize power. During the battle, Ra's is defeated and fatally burned, dying before he can reach the Lazarus Pit. Damian stabs Slade's right eye during the battle, forcing him to flee. Talia takes Damian to Gotham City to meet his father and ask for his protection.\nIn Gotham City, Batman confronts Killer Croc, who is stealing mutagenic chemicals and steroids to enhance himself. Batman gets ambushed by Croc before Talia electrocutes the latter from behind. She tells Batman about her father's death and leaves their son in his care, though Damian believes that he can take care of himself and does not need Batman. Slade, now calling himself Deathstroke, captures Dr. Kirk Langstrom, who conspired with both Croc and Ra's, promising the latter a formula for his soldiers. Slade threatens Langstrom's wife Francine and his daughter Rebecca to force him to recreate the Man-Bat formula for him. Damian bypasses Wayne Towers security to speak to Bruce, telling him that Deathstroke's contact, Ubu, is stationed in Gotham. Although Damian wants to avenge Ra's al Ghul by killing Deathstroke, Bruce objects to Damian's willingness to take lives. Talia is captured by Deathstroke when she and her assassins attack his compound.\nAgainst Batman's orders, Damian leaves the Batcave and, after a chase and a long fight, defeats Ubu, whom he located by accessing the Bat-Computer. Before Damian can kill him, Nightwing arrives, mistakes him for a criminal and subdues him before bringing him back to the Batcave. Batman berates Damian for his recklessness, willingness to kill and exposing their operation. Batman then has Damian don the mantle of Robin to teach him discipline. Searching for a lead on Langstrom's location, Batman goes to Arkham to interrogate a rabid Killer Croc, who supplied the mutagens to Langstrom in exchange for his enhancements and is currently going through drastic, agonizing withdrawal symptoms that cause him to shed his scales and tail. Since others are too afraid of him to medicate him without being harmed, Batman promises Croc help in exchange for information. Batman follows Croc's lead about the formula's mutagen to Langstrom's apartment, where he finds a throwing star that he takes evidence of Deathstroke's involvement. Before he leaves, he goes throughout the building and finds a storage room filled with caged bats, with one larger cage being empty and broken open from inside. Batman then finds a rabid gorilla with bat like mutations, one of Langstrom's unstable subjects, and it attacks him until it dies from its mutations. A drone aircraft sent by Deathstroke then flies past and crashes on the building, destroying it, though Batman evades the explosion. Commissioner Gordon warns them about an abandoned stadium believed to house Deathstroke's men.\nAt the stadium, Batman and Damian question Langstrom but are attacked when Damian becomes violent. Before they successfully escape, they fight off a swarm of Man-Bats. In the cave, Langstrom reveals Deathstroke's plan to create superhuman, flight-capable assassins. While Nightwing works with Langstrom on an antidote, Batman and Damian rescue their family. Batman guesses that Talia has been abducted when he finds evidence of torture in an empty cell, which he keeps from Damian to not set him off. They find and rescue Langstrom's family, but Batman is unaware that Deathstroke challenged Damian to a fight in exchange for Talia's life through a video device he gave Langstrom's daughter in exchange for sparing them. Both Langstrom's daughter and Deathstroke's video tell him not to involve Batman in their fight.\nNightwing learns that Deathstroke is operating in an oil rig off the Scottish coast, and when Batman is distracted, Damian goes to the rig. He finds Deathstroke and Talia in an underwater base with a swarm of Man-Bats and another Lazarus Pit, whose fluid Deathstroke intends to sell. Damian pulls a gun on Deathstroke, who holds one against Talia's head until Damian drops his gun. Deathstroke fires at him, but Talia is hit instead after she jumps in the path of Deathstroke's gunfire. As Deathstroke corners Damian, Batman appears and the Man-Bats attack. Batman wards them off with sonar-emitting batarangs, while Deathstroke flees with Damian giving chase.\nBatman heals Talia in Lazarus Pit, while Nightwing and Langstrom reach the oil rig and cure the Man-Bats. At the same time, Damian fights and defeats Deathstroke, but refuses to kill him because he is his father's son. The elevator from the rig to the underwater base is destroyed when the Man-Bats, overwhelmed by the sonar devices, overcrowd the glass elevator shaft, flooding the base. Batman, Talia and Damian escape, but Deathstroke gets left behind. Batman believes that Damian should stay with him and remain as Robin while Talia still wishes to recreate the League with Batman, who would rather disband the League, and Damian at her side. She decides to let him care for their son and leaves with the League of Assassins though she says she will return for him.\nAs the credits roll, a slideshow of the fight between Damian and Nightwing is played between credits."}