{"mid": "SonsOfTheDesert", "IMDB_id": "tt0024601", "title": "Sons of the Desert", "plot": "At a meeting of the Sons of the Desert, a fraternal lodge of which both Stan Laurel and Oliver Hardy are members, it has been decided that the organization will be holding its annual convention in Chicago in a week and all members have to take an oath to attend. Stan is reluctant to take the oath, but Oliver goads him into it. Later, on the way home, Stan explains to Oliver his reluctance to take the oath; he is worried that his wife Betty will not let him go to the convention. Oliver tries to reassure Stan his wife has no choice but to let him go because he took a sacred oath. When they get home and Stan accidentally brings up the subject of the convention, however, it turns out Oliver's wife Lottie will not let him go as they had already arranged a mountain trip together (which Oliver had forgotten about). Oliver tries to cover his embarrassment by remarking to Stan that his wife is \"only clowning\", only for her to chuck a bowl at his head, followed by another one when he attempts to establish his authority as the boss of the house.\nUnwilling to go back on the oath that he swore, but equally unwilling to provoke further wrath from his wife, Oliver feigns illness to get out of the trip with his wife. Stan arranges for a doctor (actually a veterinarian) to prescribe an ocean voyage to Honolulu, with their wives staying home (Oliver is well aware how much ocean voyages disagree with his wife). Stan and Ollie go to the convention, with their wives none the wiser. Of course, they have a close call while drinking with a fellow conventioneer when as a practical joke their friend \"Charley\" calls his sister in Los Angeles who turns out to be Mrs. Hardy! However, nothing comes of this. Having tempted fate by deceiving their wives, however, one can hardly be surprised when fate is indeed tempted. While Stan and Ollie are en route home from Chicago, their supposed ship arriving from Honolulu sinks in a typhoon and the wives head to the shipping company's offices to find out any news about the survivors. At the same time, an oblivious Stan and Ollie return home as though from Honolulu (complete with leis, pineapples and a rousing ukulele song) and are confused by the empty houses. While Stan reads the paper, Ollie spots the headline and reads it out to Stan, who humorously remarks on what a good thing it was they didn't go before promptly going into a tizzy when it finally sinks in.\nPanic-stricken, knowing their wives will likely do them grievous bodily harm, they take refuge hastily in the attic just as the wives get home and, because they can't escape, decide to camp out there. Meanwhile, the wives go to the cinema to calm their rattled nerves...and what should they see but a newsreel of the convention in which their husbands are prominently featured! Furious at being deceived, they vow revenge on their wayward spouses while simultaneously challenging each other to see whose husband is more honest with them. As for the husbands, their camping in the attic is interrupted loudly enough as to attract the attention of the wives (prompting Betty to investigate with her shotgun) and they manage to flee out of sight, escaping to the rooftop. Stan wants to go back home and confess to his wife but Oliver threatens, \"If you go downstairs and spill the beans, I'll tell Betty that I caught you smoking a cigarette!\"\nThey are about to make their way to a hotel to spend the night, but are stopped by a policeman who manages to get their home addresses from them thanks to Stan. The wives notice them coming, but while Lottie is all for shooting them the moment they walk through the door, Betty reminds her of their little agreement. Upon walking into the house, they tell the wives about the shipwreck. Then, when asked about how the pair of them had managed to get home a day before the rescue ship carrying the survivors was due, their story begins to unravel; they say they jumped ship and \"ship-hiked\" their way home. Ollie still insists his story is true; \"It's too farfetched not to be the truth!\" But Stan eventually breaks down and tearfully confesses, despite Oliver's previously mentioned threat. Stan tells his wife about the smoking too, and she stalks out of the scene while Stan continues whimpering and returns with her shotgun under her arm and ominously says to her husband \"Come along, Stanley.\", highly implying that she is going to shoot him once they get home. However, for his honesty Stan ends up wrapped in her dressing gown on the sofa, sipping wine and eating chocolates. Oliver's wife, however, is furious that she was made a fool of twice by her husband and when Ollie has the audacity to suggest going on the mountain trip they arranged in the first place - the last straw. Watched by her bemused husband, she empties the kitchen cupboards and proceeds to hurl every pot, pan, ornament and piece of crockery at him. Stan returns from next-door to compare notes, sees Hardy sitting in the wreckage and tells Ollie that his wife said that \"honesty is the best politics!\" Stan puffs on a once-forbidden cigarette, and then goes out the door singing \"Honolulu Baby\". Ollie vengefully hurls a pot at his head, upending him."}