{"mid": "Sorcerer", "IMDB_id": "tt0076740", "title": "Sorcerer", "plot": "The film opens with a prologue that consists of four segments described by critics as \"vignettes\". They show the principal characters in different parts of the world and provide their backstories.\n=== Part I: Prologue ===\n==== Vignette #1: Veracruz, Mexico ====\nNilo (Rabal), an elegantly dressed man, enters a flat in Veracruz. Nilo immediately executes the unassuming tenant with a silenced revolver and proceeds to casually walk out onto the square.\n==== Vignette #2: Jerusalem, Israel ====\nA group of Arab terrorists disguised as Jews cause an explosion in Jerusalem and take shelter at their hideout, where they assemble weaponry and plan their escape. After getting surrounded by the military, they split up; two are killed and one is apprehended. The only one who manages to escape is Kassem (Amidou). The segment finishes as he helplessly stares from a crowd at his captured companion.\n==== Vignette #3: Paris, France ====\nWhile discussing a book his wife is editing, Victor Manzon (Cremer) discovers an anniversary gift from her: a watch with a special dedication. After meeting with the president of the Paris Stock Exchange, where he is accused of fraud, Victor is given 24 hours to make amends. Victor meets his business partner, Pascal, and they quarrel; Victor insists that Pascal contact his father for assistance. Victor dines with his wife and her friend in a glamorous restaurant; he later receives a message from a butler that Pascal is waiting outside. When he learns that Pascal's father has refused to help, Victor is adamant that they try again. He walks his partner to a car, but Pascal flabbergasts Victor by committing suicide. Faced with impending doom, Victor leaves both his country and wife.\n==== Vignette #4: Elizabeth, New Jersey, USA ====\nAn Irish gang robs a church with rival connections in Elizabeth that organizes bingo games, and they shoot one of the priests. Back in their car, the gang members engage in a heated argument that causes Jackie Scanlon (Scheider), the driver, to lose concentration and collide with a truck. Everyone is killed but Scanlon, escaping with serious injuries. The wounded priest turns out to be the brother of Carlo Ricci, a Mafia director who also controlled the flow of money in the church and is persistent to kill Scanlon at all costs. Jackie meets with his friend Vinnie, who reveals his fate and finds a suitable place to escape. The one option Jackie has is to agree.\n=== Part II: Life in Porvenir ===\nKassem, Victor, and Jackie all assume fake identities and end up in Porvenir, a remote village in Latin America. Its conditions provide a stark contrast to their previous lives. The village economy is heavily reliant on an American oil company. Kassem befriends a man called 'Marquez' (John), presumably a Nazi war veteran. They all live in extreme poverty and earn meager salaries. All want out, but their savings are inadequate for emigration. After some time, Nilo arrives in the village, raising suspicions. In the meantime, an oil well over 200 miles (320 km) away explodes, and the only way to extinguish the fire is to use dynamite. Since the only available dynamite has been improperly stored in a remote depot, the nitroglycerin contained inside has become highly unstable; the faintest vibration could cause an explosion. With all other means ruled out, the only way to transport it is to use trucks. The company seeks four drivers to man two of the vehicles. Kassem, Victor, Jackie and 'Marquez' are offered the job, but they have to assemble the trucks using scrap parts. Shortly before their departure, Nilo kills and replaces 'Marquez', which angers Kassem.\n=== Part III: Journey ===\nThe four drivers embark upon a perilous journey of over 200 miles, facing many hazards and internal conflicts. Despite their differences, they are forced to co-operate. Eventually, after some setbacks, only Scanlon survives the ordeal and towards the end, struggles to stay sane, overwhelmed by hallucinations and flashbacks. When his truck's engine dies just two miles short of the destination, he is forced to carry the remaining nitroglycerin on foot.\n=== Epilogue ===\nAt the bar back in Porvenir, Jackie is given legal citizenship and payment for the job by the oil company, as well an offer of another job; before he leaves, he asks a scrub woman for a dance. As the two dance, Carlo Ricci's henchmen, along with his old friend Vinnie, emerge from a taxi outside. They walk into the bar, and, after a gravid pause, and the sound of a gunshot, the screen cuts to the end credits."}