{"mid": "SouthParkBiggerLongerAndUncut", "IMDB_id": "tt0158983", "title": "South Park: Bigger, Longer & Uncut", "plot": "Stan Marsh, Kenny McCormick, Kyle Broflovski, and Eric Cartman go to a cinema to see Terrance and Phillip: Asses of Fire, which stars the boys' favorite Canadian comedy duo Terrance and Phillip. However, the boys are refused entry due to the film being R-rated, so they pay a homeless man to accompany them.\nThe following day, the boys begin swearing in class, and are sent to Mr. Mackey, the school councilor, who informs their mothers. Later, the boys see the film again, and Kenny bets Cartman $100 that he can set his fart on fire like Terrance in the film. Kenny immolates himself and ultimately dies, leading to Stan, Kyle, and Cartman being grounded. Kenny is sent to Hell, where he is tormented by Satan and Saddam Hussein. Back on Earth, the parents of South Park organize a boycott against Canada and Terrance and Phillip, which is led by Kyle's mother, Sheila. Terrance and Phillip are arrested as war criminals. When the United States refuses to release the duo, Canada retaliates by bombing the residence of the Baldwin brothers.\nSheila and President Bill Clinton announce that the United States will go to war with Canada and have Terrance and Phillip executed at a USO show. After overhearing Cartman leading the children in a song degrading her, Sheila has Dr. Vosknocker implant a V-Chip. The device gives Cartman an electric shock every time he swears. Back in Hell, Satan declares that if the blood of the two innocent Canadians touches American soil, he will invade Earth. Later, Kenny's ghost visits Cartman to warn him of the consequences of executing Terrance and Phillip. After failing to convince their parents, the boys decide to take matters into their own hands. They form La Resistance and Gregory tells Stan to recruit a God-hating French expert on covert operations named \"The Mole\".\nLa Resistance infiltrate the USO show, but The Mole is discovered and killed by guard dogs. The remaining boys attempt to warn their mothers about what will happen if Terrance and Phillip are killed, but they are laughed at, and Mr. Garrison activates the electric chair. A Canadian force attacks the base and a battle ensues between the two armies. In the confusion, the boys are able to free Terrance and Phillip, though Cartman's V-chip begins to malfunction. The mothers, seeing the destruction their movement has incited, decide to give up and look for their children.\nStan leads the kids to Terrance and Phillip, who have been cornered by the US army. La Resistance forms a human shield while Kyle tries to persuade the army and his mother against killing the two. Sheila refuses and shoots Terrance and Phillip, which results in Satan, his minions, and Saddam attacking Earth. As a result, Sheila regrets everything. Saddam tries to usurp Satan's authority, but is sent back to Hell and killed, thanks to Cartman's malfunctioning V-Chip and Kenny's encouragement. Satan then grants Kenny a wish; Kenny asks for everything to return to how it was before the war, even though it means he will have to go back to Hell. He takes off his hood to say goodbye to his friends, but instead of returning to Hell, Kenny ascends to Heaven due to his act of sacrifice. Everything returns to normal in South Park."}