{"mid": "Southpaw", "IMDB_id": "tt1798684", "title": "Southpaw", "plot": "Billy \"The Great\" Hope is an undefeated professional boxer living in New York City with his wife Maureen and their daughter Leila. During a match in which he defends his light heavyweight world title, Billy sustains an eye injury and is convinced by Maureen to retire while he's on top. After the match at a press conference, an up-and-coming boxer Miguel \"Magic\" Escobar taunts Billy and tries to get Billy to fight him. At a charity event for the orphanage where he and his wife both grew up, Escobar is in attendance, and as Billy is leaving, Escobar threatens he'll take Maureen and his title away from him, and while Maureen tells Billy to let it go and go home with her, Billy's anger gets the best of him, leading to a brawl in which Maureen is accidentally shot and killed by Miguel's brother Hector, who flees.\nBilly begins abusing alcohol and drugs while obsessively searching for Hector. He eventually gets a tip of Hector's whereabouts but only finds Hector's drug-addicted wife Maria, and leaves after learning Hector is a father. After attacking a referee out of frustration after losing a fight, Billy is suspended and left indebted, leading to his house and belongings being repossessed. He continues to spiral out of control and nearly dies after crashing his car in a suicide attempt, which also causes him to lose custody of Leila, who is put under care of Child Protective Services officer Angela Rivera. The incident drives Billy to sober up, but Leila cuts ties with him, blaming him for their predicament.\nAt the behest of friends, Billy gets a job as a cleaner at a gym owned by seasoned boxer Titus \"Tick\" Wills, and eventually convinces Tick to become his trainer. Billy's former manager, Jordan Mains, who is currently managing Miguel, arranges a fight between the two that could put Billy back in the spotlight. Tick is reluctant to train Billy, fearful he might be blinded by his vendetta against Miguel, but is motivated to do so when another of his students, Hoppy, is killed by his abusive father while attempting to defend his mother.\nSeeing Billy's hard work after securing a job and keeping it, and his ability to show responsibilities of a father, the judge removes his visitation restrictions and congratulates him for his good work. Billy then takes Leila to his apartment where they have breakfast together and Leila asks if she can attend the fight. Billy, reluctant to let his daughter go to the fight because Maureen never wanted to expose their daughter to the violence in boxing, says he is unsure because Maureen used to make all the decisions for him. Leila asks if they can go visit Maureen's grave, where Leila convinces Billy to let her go to the fight to have someone by his side. Billy tells Leila that there will be people at the fight saying some harsh things, so Leila makes an agreement to go to the fight but stay only in the locker room with Angela, watching the fight via closed circuit television in the locker room.\nAs the match begins, Miguel has the upper hand against Billy, but, with Tick's advice, Billy has the chance to turn the tables in the final round by using the Philly shell defense and countering more aggressively with his left. As the round reaches its final minute, Billy pivots hard and, although fighting from a traditional stance, delivers a powerful left uppercut which sends the champion down to the ground. Miguel manages to get up before the count is over and is saved by the bell. Billy is declared the winner by a split-decision and reunites with Leila in the locker room, where she forgives his past mistakes and they embrace."}