{"mid": "SpaceTruckers", "IMDB_id": "tt0120199", "title": "Space Truckers", "plot": "At a corporation's base on the Neptunian moon Triton, mercenaries are setting up a defense perimeter to try to hold off an unstoppable cyborg warrior. The commander Saggs and scientist Nabel, seal themselves inside the control room. The cyborg destroys the soldiers' tank and then attacks a helicopter—which crashes into the control room. The soldiers are killed one by one, until Nabel finally deactivates the cyborg with a remote control. The remaining corporate employees discover that the cyborg was created by Nabel for company owner E.J. Saggs. Saggs takes the remote from Nabel. He reactivates the cyborg and orders it to kill Nabel.\nMeanwhile, John Canyon, one of the last independent \"space truckers\", drops off his cargo of square pigs at a \"truck stop\" space station, but becomes embroiled in a brawl with the trucking company head, Keller, who is sucked out into space. He and his two passengers—Cindy, a waitress who has promised to marry him in exchange for a ride to Earth to see her mother, and Mike, an up-and-coming trucker working for the company—take on a deal to transport alleged sex dolls to Earth. Chased by police investigating Keller's death, John takes his rig into the \"scum zone\", a region controlled by pirates. The rig takes damage, leaving them adrift; they are soon captured by the pirate ship Regalia, commanded by the company-hating Captain Macanudo. Cindy agrees to have sex with him if he would take the cargo and let them go.\nThe captain is revealed to be Nabel, who rebuilt his grievously-injured body and went into piracy as revenge against Saggs for betraying him. The cargo that John's rig is carrying is in fact a full supply of the cyborg warriors Nabel designed and built for Saggs' company. One of the cyborgs comes alive, kills most of the crew, and severely damages the ship. John, Cindy and Mike take their rig and escape as the Regalia explodes. As they make their way back to Earth, John and Mike find a mortally-wounded Macanudo in the hold, who reveals the true nature of the cargo to them. John releases Cindy from any obligation of marrying him, and tells her and Mike to take the escape pod while he releases the cargo in the atmosphere, where it will burn up on re-entry. Cindy and Mike land safely, but the rig is unable to return to space and explodes in the sky; however, John is able to safely escape before the explosion.\nJohn, Cindy and Mike go to the hospital to see Cindy's mother, who became ill twenty years earlier and was frozen until a cure was found; John is smitten with her at first sight. Meanwhile, Saggs—now President of Earth after the government was privatized—visits John, Cindy, and Mike in the hospital, where he offers John a new rig and gives the trio a suitcase full of money to keep them quiet about his cyborg invasion plan. John agrees to the deal, but Mike angrily throws the suitcase out the window. Below, Saggs re-enters his presidential limousine; having planted a bomb in the suitcase, he triggers the detonator just as the suitcase lands on his limo's roof, killing him. With Saggs dead and Earth safe, Mike, Cindy, John, and Cindy's mother blast off in their brand new rig."}