{"mid": "SpaceJam", "IMDB_id": "tt0117705", "title": "Space Jam", "plot": "On a summer night in 1973, a young Michael Jordan is practicing basketball. His father steps out and tells him it's bedtime, but lets him make a few more shots. Jordan shoots while making several wishes like going to the University of North Carolina, playing on a championship team, joining the NBA, going on to play baseball, and successfully scores every shot. Impressed, Jordan's father jokingly asks if next he is going to wish he could fly, and Jordan turns to make one final shot.\nIn 1993, Jordan announces his retirement from professional basketball to follow his now deceased father's career as a baseball player. However, it becomes evident that he is not as skilled in baseball as he was in basketball. Jordan is assigned a publicist and assistant, the bumbling Stan Podolak, to make his new career less bumpy. Elsewhere, in outer space, an intergalactic amusement park called Moron Mountain faces dwindling popularity, so its owner, Mr. Swackhammer, sends his diminutive minions, the Nerdlucks, to capture the Looney Tunes as new entertainment. The Looney Tunes live in an animated world called \"Looney Tunes Land\" hidden in the center of the Earth, but ignore the Nerdlucks' threats and challenge them to a game of basketball.\nThe Nerdlucks steal the talents of professional basketball players Charles Barkley, Shawn Bradley, Patrick Ewing, Larry Johnson and Muggsy Bogues, leaving them incapable of playing. The Nerdlucks absorb the talent, transforming into the gigantic \"Monstars\" who easily intimidate the Looney Tunes. While playing golf with Bill Murray, Larry Bird and Stan, Jordan is sucked down a hole and is recruited by Bugs Bunny to help the Tunes win against the Monstars. Jordan at first refuses, saying he does not play basketball anymore, but changes his decision after he is insulted and humiliated by the Monstars when they call him \"baldy\". He then sends Bugs and Daffy Duck to his house to retrieve his basketball gear.\nMeanwhile, Stan has been digging out the golf hole to find Jordan, but spots Bugs and Daffy leaping down another one and pursues them, reuniting with Jordan in the Tunes' world and joins their team, the \"Tune Squad\". Another new recruit is Lola Bunny, a skilled basketball player whom Bugs falls in love with. On the day of the match, the Monstars dominate the first half, leaving the Looney Tunes unconfident. Stan overhears a conversation between the Monstars and Swackhammer, learning of how they gained their talent and informs Jordan and the Tune Squad. Bugs and Jordan convince the rest of the Tune Squad to fight back and the first quarter of the second half allows the Tunes to catch up using old school gags and Acme weaponry. During a timeout, Jordan raises the stakes of the game with Swackhammer: a win by the Tune Squad would require the Monstars to surrender their stolen talents, while a Monstars win would win Swackhammer Jordan as a new attraction.\nTo ensure his victory, Swackhammer has the Monstars play dirty and injure all of the Tune Squad until only Jordan, Bugs, Daffy, Lola and Stan are left. Stan becomes the fifth player and manages to score, but is literally flattened by the Monstars and is removed from the court to be inflated. The referee, Marvin the Martian, informs Jordan that unless the team gets a fifth player, they will have to forfeit the game, at which point Murray appears and volunteers to be the team's fifth member. In the final seconds of the game, Jordan gains the ball and manages to use cartoon physics to extend his arm and score the winning points. Murray retires from the sport and the Monstars blast Swackhammer to the Moon in a rocket when Jordan makes them realize that they do not have to take his abuse anymore. Jordan convinces them to give up the stolen talents, and the Looney Tunes agree to recruit the reformed Nerdlucks in their ensemble. Jordan and a recovered Stan return to the surface, the Nerdlucks dropping them off at Jordan's next baseball game. Later on, the two visit the incapacitated basketball players and return their talent. The players invite Jordan to a three-on-three match, but when he declines, they question his loss of talent. In 1995, Jordan returns to the Chicago Bulls to resume his basketball career."}