{"mid": "SpecialBulletin", "IMDB_id": "tt0086350", "title": "Special Bulletin", "plot": "A \"Special Bulletin\" slide interrupts commercials on the fictional RBS television network for its TV shows. A TV crew covering a dockworkers' strike are caught in the middle of a firefight between the U.S. Coast Guard and the crew of a tugboat sitting at a dock in Charleston, South Carolina. The coast guardsmen surrender and are taken hostage, as are the reporter and cameraman.\nThe reporter is asked to televise a statement by the terrorists calling for delivery to them of every nuclear trigger device at the U.S. Naval Base in Charleston. Without these triggers, nuclear weapons on the naval warships and nuclear-powered submarines based at Charleston cannot be used. The terrorists reveal their motive is to completely disarm America of Nuclear weapons as well as to convince the Soviet Union to the same, which they believe will completely prevent possible nuclear war. They also mention they have constructed their own nuclear device—one roughly equivalent to the bomb dropped on Nagasaki in 1945. Their device is set to detonate within 24 hours if their demand is not met, and has anti-tampering devices that will set it off if any attempt is made to move or disarm it.\nDetails about the terrorists slowly begin to emerge as the broadcast hosted by Susan Myles (Kathryn Walker) and veteran newscaster John Woodley (Ed Flanders) continues. The group is led by Dr. Bruce Lyman (David Clennon), a scientist and designer of nuclear weapons for the American government. His fellow conspirators include David McKeeson (David Rasche) a nuclear scientist who stole weapons grade plutonium and constructed the bomb; Jim Sever (Ebbe Roe Smith), a bank robber; Frieda Barton (Rosalind Cash), a poet and anti-war activist implicated in a bombing that killed several people a decade earlier; and Diane Silverman (Roberta Maxwell), a married social worker who had been friends with Lyman back in college.\nAt first the government chooses to ignore or underplay the story. McKeeson eventually reveals his device to RBS's cameraman. Public announcements include the decision to order the evacuation of downtown Charleston, which causes panic. The Government later announces, just before the terrorist's deadline, that it would accede to their demands. A van rolls up to the tugboat, allegedly containing the first load of nuclear triggers.\nThe terrorists become suspicious when the TV monitoring the RBS broadcast goes blank, to conceal a Delta Force commando team sneaking aboard the tugboat. In the ensuing gun battle, Lyman, Sever, and Silverman are killed by the commandos. The journalists survive without major injury. McKeeson commits suicide before he can be captured and Barton is taken into custody.\nMembers of the Nuclear Emergency Search Team (NEST) board the tugboat to defuse the bomb. The reporter and cameraman remain despite pleas from the news anchors in New York City that they leave the area. The NEST team argue about how to bypass McKeeson's many safeguards. As they attempt to defuse the bomb, they realize that they have made a mistake and have accidentally triggered one of the safeguard devices. At the studio, an expert says that there are conventional explosives in the device, geared to set up the chain reaction. The members of the NEST work frantically to stabilize the bomb, then begin to panic. One member rushes to leave the ship's hold as two others keep working desperately on the device. Suddenly, static fills the screen as all contact with Charleston is lost.\nThe network switches to the main RBS newsroom in New York. Woodley is stunned and alarmed as he realizes what has probably happened. Myles, nervous and fighting to control her voice, advises viewers that they \"seem to have lost contact\" with Charleston. After considerable effort to reestablish contact, the anchors manage to get hold of Megan \"Meg\" Barclay (Roxanne Hart), a reporter for the local RBS television affiliate station in Charleston, WPIV, who was two miles from the tugboat aboard the aircraft carrier museum ship USS Yorktown. Amid burning wreckage aboard the aircraft carrier, with huge fires blazing in downtown Charleston in the background, Meg veers between trying to report what happened and expressing fear of radiation. The cameraman pans across the harbor, which is now a firestorm. Seeing this, the traumatized Myles breaks down, saying \"Oh, my God!\" on the air.\nMeg's cameraman had been recording a few moments earlier, and the network anchors ask Meg to ask him to rewind and play back the tape. The tape shows Barclay standing in front of a relatively normal-seeming harbor scene, overlooking the tugboat; Meg is facing the camera, her back to the boat. We see an enormous bright light exploding into view across the harbor and then flooding the screen. When the camera recovers from the sudden flash of light, we see a mushroom cloud rising over the burning shoreline, followed by a huge blast of wind—the shock-wave from the explosion—that knocks over everything, including the cameraman and his camera. The tape ends as Woodley can only ask, over and over again, whether someone can get help to his colleagues on the carrier.\nFurther reports from Charleston follow, showing the city badly damaged and consumed by fire; there is mass destruction and many are burned and otherwise injured by the explosion. It now emerges that the government's intention was to play for time until the Delta Force team could board and capture the ship and defuse the nuclear weapon. The film moves ahead three days to reveal the aftermath of the explosion, narrated by Myles. Thanks to the evacuation order, the death toll is estimated at less than 2,000; however, another 25,000 suffer severe injuries, including 4,800 severe burn cases; half a million are left homeless due to fallout, and the region is expected to be uninhabitable for decades."}