{"mid": "SpeciesII", "IMDB_id": "tt0120841", "title": "Species II", "plot": "Three years after the events of the previous film, Commander Patrick Ross leads a manned mission to Mars. Soil samples collected by Patrick's team of astronauts contain a substance which thaws aboard their capsule and attacks them, causing a seven-minute contact gap with mission control. With seemingly no subsequent negative effects, the astronauts return to Earth to public celebration. However, an institutionalized former scientist, Dr. Cromwell, reacts to their return with violent panic. Meanwhile, Dr. Laura Baker has created a clone of Sil named Eve, whose alien DNA is suppressed to make her more docile. Her team conducts experiments on Eve, hoping to find a way to combat the alien species should it ever return to Earth. Every experiment is unsuccessful as Eve's biology adapts.\nUpon their return, Patrick and his team are told to refrain from sexual activity for ten days. Patrick disregards this advice and has a threesome with two sisters following a fundraiser. During intercourse with the second woman, he begins to sprout tentacles. The woman notices his transformation while she is stroking his body and is horrified at the sight of him where she tries to free herself from his clutches. Both women endure accelerated pregnancies, ending with Patrick's half-alien children tearing out of their abdomens. Patrick hides both corpses and his rapidly growing sons on the property of his father, U.S. Senator Judson Ross. The next day, Patrick tells his father he cannot remember the previous night's events. Senator Ross indicates that he is aware of Patrick's behavior and tells him to focus on his political goals.\nDr. Orinsky, one of the NASA scientists who examined Patrick, discovers something amiss about his blood sample and desperately tries to contact Cromwell. However, Orinsky is ambushed and disemboweled by Patrick. Laura discovers that the DNA in Orinsky's wounds is not the same as Eve's, prompting Colonel Burgess, the military supervisor in charge of her project, to reunite her with Press Lennox to contain the new threat. Press and Laura seek out Cromwell, Orinsky's former professor, and learn that he discovered that the alien species had attacked and destroyed Mars in ancient times. Because of his fears that alien DNA might remain on Mars to infect anyone who visited the planet in the future, Cromwell urged the government to abort the mission, but was institutionalized to suppress his work.\nPress and Laura report their findings to Burgess, identifying the Mars astronauts as the prime suspects. Unable to find Patrick, they pursue the other astronauts, Anne Sampas and Dennis Gamble. They arrive too late to prevent Anne from having sex with her husband, resulting in her impregnation with hybrid offspring. The tentacle-like creature bursts from Anne's womb and kills her husband before Press and Laura manage to kill it, but Anne dies of her injuries. Meanwhile, other government agents locate and examine the other astronaut, Dennis Gamble, but confirm he is not infected. Laura discovers that Anne's hybrid DNA does not match that in Orinsky's wounds, meaning Patrick is the killer. Meanwhile, Patrick has sex with his fiancée, resulting in her death and the birth of another hybrid son. Patrick commits suicide by shotgun, but the alien DNA regenerates his head and restores him back to life. Dennis witnesses this and tells Press and Laura what he saw, joining them in their mission. Patrick begins impregnating as many women as he can, hiding his victims and children at the shed.\nLaura is ordered to activate Eve's alien DNA so she can telepathically track Patrick, but this makes her unstable and strengthens her alien instincts. Press and Dennis go after Patrick at a supermarket. They infiltrate the truck only to find a couple. Patrick becomes aware of Eve. Press and Dennis then arrest Patrick. As Patrick is taken to custody, Eve shows signs of being in heat. He demands Laura open Eve's cell and nearly kills her when she refuses, but Press and Dennis chase him off with gas. Burgess confronts Senator Ross with proof of Patrick's infection and demands help in detaining Patrick. Suspicious that Patrick will instead be killed, Ross deduces that he is at the shed and apologizes for treating his son so coldly. Patrick's human side briefly returns, but while he tearfully embraces his father, the alien DNA violently reasserts itself and kills the Senator. Ross's death completely destroys Patrick's humanity, and he helps his hybrid children to cocoon, so they will soon mature into adults and begin mating themselves to overtake mankind.\nBack at the lab, Laura discovers Dennis was not infected because he is a carrier of sickle cell anemia, as the species lacks immunity to human genetic diseases. While they plan to use this as a weapon, Eve breaks out of her confinement to find Patrick. Press, Laura and Dennis pursue her, with Burgess and the military following. At the shed, they kill Patrick's offspring while Eve and Patrick transform into their alien forms and begin to mate. The mating stops by Press and Dennis, and Eve breaks free, but Patrick overpowers Eve by performing fellatio, killing her. Press stabs him in the back with a pitchfork coated in Dennis' blood, causing Patrick to disintegrate and die.\nThe military escorts Press, Laura and the injured Dennis away. Eve's lifeless body is loaded into an ambulance, but shortly after, her womb begins to swell rapidly - indicating her survival and impregnation by Patrick - while one of his youngest sons looks on. As the screen cuts to black, Eve's womb bursts and her screaming is heard."}