{"mid": "SpeciesIII", "IMDB_id": "tt0410650", "title": "Species III", "plot": "Hours after the events of the previous film, the medical van transporting the lifeless Eve has lost its way, but when the co-driver tries to radio their superiors, the driver stops and holds him at gunpoint. They are ambushed by the \"half-breed\" alien child hiding in the van, who kills the co-driver with his tongue. The driver discovers both the half-breed and a reviving Eve in the back of the van; the half-breed strangles Eve to death while she gives birth to a newborn alien, which the driver flees with. Government agent Wasach orders an autopsy, discovering Eve's pregnancy, then has her body burned.\nThe driver, Abbot, returns to his usual job teaching biochemistry at a university, where he teaches his belief that it is wrong to decide whether a species should live or die. He raises Eve's child in his home, and over a few months she has grown into a young girl he names Sara. One night at his office, Abbot is visited by the half-breed from the van, who has dramatically aged and is critically ill. Before partially decaying and dying, the half-breed demands to see Eve's child and reveals to Abbot that there are other half-breeds suffering from similar illnesses. Shocked by these events, Abbot approaches Dean, one of his students whose funding for an experimental power plant project is in jeopardy, and asks for his aid in perfecting the alien DNA to save the species. In return, Abbot promises Dean a share of any funding or awards their work receives.\nIn Abbot's absence, Sara undergoes a pupal metamorphosis that ages her into a young woman. Abbot's superior, Dr. Turner, arrives at the house seeking Abbot and comes across Sara, who initially tries to seduce him but then rejects him when she senses imperfections in his genes. He attempts to rape her, and Sara kills him. Sara leaves to seek a mate, while Abbot discovers the evidence of her transformation and disposes of Turner's body. Sara eventually connects with another half-breed but discovers his illnesses and rejects him as well. As Abbot and Dean continue their experiments on Sara, Dean begins to bond with her. Abbot informs Dean of the government's \"Project Athena,\" which created Sil in the first film and Sara's heritage as the child of an astronaut infected with alien DNA and Eve, Sil's clone. The half-breed Sara rejected breaks into the lab, mortally wounds Abbot and attempts to impregnate Sara, but is killed by hydrochloric gas Abbot sprays over the lab. Left alone, Dean ponders whether to continue Abbot's work, and Sara urges him to save her species.\nDean's roommate at the university, Hastings, discovers a website posted by a woman named Amelia who wants to date biochemists. After snooping through Dean's notes, he forwards them to Amelia, who agrees to meet him. En route, Amelia - who is another half-breed - has sex with and murders a gas station attendant who attempts to rape her. At the campus, she senses Sara and kidnaps Hastings, taking him to Abbot's home. Both Amelia and Sara force Hastings to work on perfecting the alien DNA using Sara's purer biology to save the half-breeds and create perfect mating partners for them. Agent Wasach, whose team also monitored Amelia's website and discovered its connection to Project Athena, picks up Dean and helps him save Hastings.\nDean, Hastings and Wasach flee to Dean's experimental power plant with Sara and Amelia in pursuit. While attempting to keep Sara's harvested eggs away from them, the three decide to try trapping Amelia and Sara in the plant's core, but this tactic risks causing a catastrophic meltdown. Dean drops the eggs into the core, prompting Amelia to attempt to kill him, but Sara attacks her and throws her into the core as well. Dean, Hastings and Wasach manage to close the core in time to prevent a meltdown, but Sara seemingly falls in to her death as well.\nLater, Hastings visits Dean at Abbot's home and discovers both Sara and a younger alien boy. Dean reveals that he actually managed to pull Sara to safety before sealing the plant's core, then completed the refined alien DNA to make a mate for her so she would not be alone. Dean asks Sara why she saved him from Amelia when there was no reason to; she does not answer but it is implied she has come to care for him. Once Sara's mate has aged, Dean and Hastings see them off into the world, with Dean reassuring the nervous Hastings by revealing he ensured Sara's mate would be sterile, preventing them from reproducing."}