{"mid": "Spectre", "IMDB_id": "tt2379713", "title": "Spectre", "plot": "Mexico City: a Day of the Dead parade.A man in a white suit and skull mask walks past, as another man in a skull mask and skeleton suit spots him and starts walking into a hotel with a woman.The couple enter their room for some intimacy. The man is Agent 007/James Bond (Daniel Craig). He hides a small sniper's rifle in his suit jacket and steps out onto the balcony, telling his lover he'll return soon. Bond walks toward the building next to his hotel and and takes aim at the man in white he's Marco Sciarra (Alessandro Cremona), a man Bond has been tracking.Bond overhears Sciarra and two other men talk about blowing up a stadium and inquiring about someone known as \"The Pale King\".Before Bond can make a move, the men spot him and shoot back, but, Bond kills the two men before blowing up the bomb destroying their room. A large part of the destroyed structure collapses onto the roof.Bond hides, and falls through the wreckage, but walks out into the city to pursue Sciarra.Bond follows his target through the parade as Sciarra calls for someone to meet him in the square.Sciarra goes to a descending helicopter and climbs aboard Bond catches up and beats Sciarra's thugs before jumping in the helicopter with him.As it takes off, Bond fights both Sciarra and the pilot. The helicopter flies dangerously close to the civilians, but, Bond tries to kill his target.He finally succeeds in kicking Sciarra out of the helicopter and throws the pilot out as well. Bond takes control of the helicopter and flies off. He looks in his hand at something he pulled off of Sciarra's finger; a ring with an octopus symbol on it.Back in London, M's (Ralph Fiennes) not happy with the damage Bond has done, especially as he didn't have authorisation to be in Mexico.Bond tells M he was taking an overdue holiday and his encounter with Sciarra was ust a coincidence.M officially grounds Bond.As Bond leaves, he's introduced to the new head of the Joint Intelligence Service, Max Denbigh (Andrew Scott). Bond refuses to call him by his name, and instead refers to him as C, which annoys Max.Bond meets with Miss Eve Moneypenny (Naomie Harris) and shows her the real reason he went after Sciarra; a tape from M's predecessor (Judi Dench), just prior to her death, instructing Bond to find Sciarra, kill him, and go to the funeral in Rome.Moneypenny gives Bond a box of items recovered from Skyfall. Bond looks into the box, and sees amongst other things, a picture of a man and a boy - with a third person's face burnt out of the picture.Bond takes a ride on the River Thames with Bill Tanner (Rory Kinnear) where they get a glimpse of the new JIS building. Tanner say C's plan is to create \"Nine Eyes\", a programme which will allow access to intelligence streams from nine countries.The Nine Eyes programme will also decommission the 'double-Oh' programme because, they claim, it's unnecessary and obsolete with their new electronic surveillance methods.The men meet up with Q (Ben Whishaw), who gives Bond only a single tool; a watch, but Q suggests the alarm is very loud. He also injects Bond with 'smart blood,' that'll allows Bond to be located anywhere in the world by Q's computer.Bond later steals a custom Aston Martin DB10 made for 009 and heads for Rome.Bond arrives at Sciarra's funeral, where he encounters Sciarra's widow Lucia (Monica Belucci). At night, in her home, Lucia is nearly executed by 2 men, until Bond shows up and kills them first.Despite knowing Bond killed her husband, he still seduces her, and learns of a secret meeting of a criminal organisation Sciarra was part of. She also tells him where the meeting will be held, at midnight.Bond arrives at the hideout of this organisation by using the octopus ring as entrée.There, he observes a number of people at a boardroom table discussing events in Marrakesh and Tunisia, as well as the planned bombing in Mexico.A man cloaked in shadows (Christoph Waltz) enters and oversees the meeting. They also mention The Pale King and plan to get rid of him. He calls upon a man named Gerhardt to be the muscle in their plans, but a much larger fellow, Mr. Hinx (Dave Bautista), steps in for consideration. Hinx slams Gerhardt's head on the table and kills him by plunging his thumbs into his eyes. Hinx calmly wipes the blood off his fingers, and assumes the role of the main henchman.The leader man in the shadows then sees Bond in the balcony, and refers to him by his name, saying it's been a while since they've last met.Bond appears to recognise the man as well. One of the henchmen in the building nearly attacks Bond until he throws him over the balcony. Bond gets into the Aston Martin, and tries to make a hasty retreat, but Hinx gets into a Jaguar C-X75 and a race through Rome ensues.The race enters the walkway beside the Tiber River. Bond sees most of the car's gadgets do not work, except for a flamethrower, which he uses on Hinx's car behind him. Hinx's car crashes and burns. Bond ejects himself from the car, and lands far away thanks it's parachute.Bond's car crashes into the Tiber and sinks. Bond then contacts Moneypenny and asks for information regarding The Pale King and Franz Oberhauser; the man in the shadows.Moneypenny informs Bond the Pale King is really Mr. White (Jesper Christensen) - the same shadowy middleman from the crime organisation Quantum from first two of the re-booted Bond films; Casino Royale and Quantum of Solace.Moneypenny learns Oberhauser and his father were reported to have died in an avalanche. Bond locates Mr. White in Austria, where he lives alone in a dilapidated home, dying of thallium poisoning as a result of leaving the organisation.Bond convinces White to tell him where to find his daughter, promising his former enemy he will protect her. He slides White his Walther PPK, knowing he would prefer to end his suffering.White tells Bond the clinic to find her, and tells Bond she will lead him to L'Americain, which in-turn , will bring him back to Oberhauser.White puts the gun under his chin and pulls the trigger.Bond finds White's daughter, Dr. Madeleine Swann (Lea Seydoux) at a clinic high in the Austrian Alps. She asks him some test questions before he tells he he watched her father kill himself.Madeleine orders him to leave and angrily walks away from Bond outside the building before she is captured by Hinx and his fellow goons.Bond steals a small plane and chases the villains, eventually causing them to crash their cars before he rescues Madeleine, leaving only Hinx alive.Bond brings Madeleine to meet with Q, who has done an analysis on the ring.The ring contains files which reveal Bond's most recent enemies (Mr. White, Sciarra, Le Chiffre, Dominic Greene, and Raoul Silva) were all connected to Oberhauser, and other organisations like Quantum were subsidiaries of this organisation.Madeleine says the organisation's name is \"Spectre\", and L'Americain is not a person as Bond had originally believed, but a hotel in Morocco.Meanwhile in London, M learns Bond has left the country against his orders.He must also deal with C initiating Nine Eyes, though the decision to launch it must be unanimous, the South Africans are the lone dissenting vote of the nine countries. C again says the double-oh programme must be shut down.Bond and Madeleine travel to Tangier and locate the L'Americain Hotel.After searching the room for a few hours, Bond sees a mouse run into a hole in the wall and suspects that there might be something behind the wall. Bond punches out the wall and finds a hidden room adjacent to their hotel room. They find a stash of tapes and pictures kept by Mr. White which leads to the next clue.A TV news item shows a bombing in Capetown.The two board a train headed to Spectre's main hideout inside a crater deep in the desert. As Bond and Madeleine sit together at dinner, they are interrupted by Mr. Hinx. Bond battles the gigantic man while Madeleine tries to get a good hit in. The battle spills into a storage car. Swann tries to help by shooting at the large thug, Bond wraps a handy rope around Hinx's neck and tries to choke him. In the mayhem, a string of linked beer kegs are disappearing out the open door and Bond manages to attach the rope to the barrels. Hinx realises what's about to befall him, mutters \"Shit,\" and disappears out the door. Exhausted and sweaty, the two look at each other. \"What do we do now?\" Madeleine says. Moments later they are back in their cabin feverishly having sex.Q and Moneypenny find M eating alone in a restaurant and show him Bond is headed to a large complex in the desert, M says they can do nothing as C is watching them and says Bond is on his own.The train stops at an isolated station in the middle of nowhere and are picked up by a man in an old Rolls Royce. They are driven to the Spectre facility in a meteor crater in this very isolated part of the desert. Oberhauser and his men find Bond and Madeleine, where Oberhauser states he's the mastermind behind every painful event over the last few years of Bond's life. He brings up Vesper Lynd's death, as well as the last M's death. He then pulls up a video of Bond's last meeting with White, showing him passing the gun to White before his death, proving the incredible reach of their new surveillance technology. It is also revealed that C works under Oberhauser, and Nine Eyes will give Spectre access to all the intelligence streams. Bond is then knocked out by a thug.Bond wakes up strapped in a chair, prepped for torture. Oberhauser tells Madeleine how his father looked after Bond after the death of Bond's parents, and he was something of a brother to Bond until he faked his death in the avalanche. He has since created a new identity: Ernst Stavro Blofeld. Blofeld turns on tiny robotic, high-speed drill he uses to pinpoint specific pain centers in Bond's skull. Madeleine approaches him and admits her love for him. Bond slips her his watch Q gave him, and sets the timer.Knowing what's happening, she slides the watch toward Blofeld as it explodes and unlocks the torture chair. Bond and Madeleine escape, after a firefight with henchmen. The facility is destroyed by gigantic explosions as they leave the crater.Bond returns to London to join M, Tanner, Q, and Moneypenny. Madeleine leaves Bond because she wants no part in the life he leads. The M and Bond's car is ambushed, and Bond is captured.Bond is taken to the former MI6 building and quickly takes out his captors. He finds Blofeld behind a bulletproof glass wall, now blind in his right eye and sporting a mighty scar running down his face, through his right eye. Blofeld says Madeleine is somewhere in the building, which is set to explode, Bond has three minutes to find her or escape himself. Meanwhile, M and Q are in C's office and start hacking the computer to shut down Nine Eyes which is to go live at midnight. C fights M and tries to shoot him, but M causes him to shoot the glass ceiling, throwing C off-balance and causing him to fall over the balcony to his death.Bond finds Madeleine with 45 seconds to spare and escapes with her on a boat through a tunnel onto the Thames River as the building is destroyed - collapsed by multiple charges detonated simultaneously. Blofeld is escaping on a helicopter, but Bond manages to shoot him down with only his handgun. The helicopter crashes onto a bridge over the Thames River, Blofeld is badly hurt and tries to crawl away. Bond arrives and points his gun at Blofeld who urges him to shoot. The gun is out of ammo and Bond taunts the evil mastermind by saying he has better things to do. Blofeld is apprehended by M while Bond leaves with Madeleine.Sometime later, Bond arrives at the lab asking Q for one last favor: the vintage Aston Martin DB5 from the previous films, which was under restoration. He and Madeleine drive off in the silver sports car into London traffic."}