{"mid": "SpiceWorld", "IMDB_id": "tt0120185", "title": "Spice World", "plot": "The film begins with the Spice Girls performing \"Too Much\" on Top of the Pops, but they become dissatisfied with the burdens of fame and fortune. Meanwhile, sinister newspaper owner Kevin McMaxford (Barry Humphries) is attempting to ruin the girls' reputation for his newspaper's ratings. McMaxford dispatches photographer Damien (Richard O'Brien) to take pictures and tape recordings of the girls. Less threatening but more annoying is Piers Cuthbertson-Smyth (Alan Cumming), who stalks the girls along with his camera crew, hoping to use them as subjects for his next project. At the same time, the girls' uptight manager, Clifford (Richard E. Grant) and his sympathetic assistant Deborah (Claire Rushbrook), are fending off two over-eager Hollywood writers, Martin Barnfield and Graydon (George Wendt and Mark McKinney), who relentlessly pitch absurd plot ideas for a feature film for the Spice Girls.\nAmid this, the girls must prepare for their live concert at the Royal Albert Hall in three days, the biggest performance of their career. At the heart of it, the constant practices, traveling, publicity appearances, and other burdens of celebrity affect the girls on a personal level, preventing them from spending much time with their pregnant best friend, Nicola (Naoko Mori), who is due to give birth soon. Throughout the busy schedule, the girls attempt to ask Clifford for time off to spend with Nicola and relax, but Clifford refuses after talking with the head of the girls' record label, the cryptic and eccentric \"Chief\" (Roger Moore). The stress and overwork compound, which culminate in a huge argument between Clifford and the girls. The girls suddenly storm out on the evening before their gig at the Albert Hall.\nThe girls separately think back on their humble beginnings and their struggle to the top. They reunite by chance outside the now-abandoned café where they practiced during their childhood years, they reconcile, and decide to take Nicola out dancing. However, Nicola goes into labor at the nightclub and is rushed to the hospital in the girls' bus, giving birth to a healthy baby girl. When Emma notices that the delivery \"doctor\" has a camera, the girls realize that he is Damien, who runs off with the girls in hot pursuit, only to hit his head after accidentally colliding with an empty stretcher. When Damien sees the girls standing over him, he tells them that they have made him see the error of his ways, and he goes after McMaxford, who is subsequently fired in a \"Jacuzzi scandal\".\nAfter noticing the girls' bus driver, Dennis (Meat Loaf) is missing, Victoria decides to take the wheel. It becomes a race against time as Victoria drives like a maniac through London. While approaching Tower Bridge, the bridge begins to raise to let a boat through the River Thames. Victoria drives up the bridge and over the gap. The bus finally lands safely on the other side, but when Emma opens a trapdoor in the floor, she discovers a bomb, and the girls scream before Emma slams the trapdoor shut again.\nThe girls finally arrive at the Royal Albert Hall for their performance and run up the steps. However, the girls have one more obstacle to overcome: a London policeman (Kevin McNally) charged the girls with: \"dangerous driving, criminal damage, flying a bus without a license, and frightening the pigeons\". Emma pushes forward and tells the policeman that she and the other girls were late for their performance at the Albert Hall. Emma smiles at the policeman, and he lets the girls off for their performance. The film ends when the girls perform their song \"Spice Up Your Life\" at the start of their Royal Albert Hall concert broadcast live on television around the world.\nThe supporting cast later talk about the girls' film during the closing credits. Mel C breaks the fourth wall and tells the other girls that the outgoing audience is watching them. The girls talk to the audience, commenting on \"those two in the back row snogging\" and on one's dress, and discuss their film, just minutes before the bomb in their bus explodes."}