{"mid": "SpiderMan2", "IMDB_id": "tt0411906", "title": "Spider-Man 2", "plot": "The video game picks up two years after it's predecessor with an opening narration by Spider-Man/Peter Parker (Tobey Maguire) and a pan through the large city of New York. After touching bases with the Narrator/Tour Guide (Bruce Campbell) and learning the basics of crawling and charged jumps through the tutorial, Spider-Man is late for his class with Dr. Curt Connors (Joe Alaskey). While swinging to the university, he is disrupted by a cry for help and swings over to stop a group of commandos from stealing a mysterious yet precious briefcase from a woman.Resuming on his personal life, Peter is disgraced to find he is late once again for his professor's class. As if things weren't any better, Peter realizes he is going to be late for his birthday dinner with Mary Jane (Kirsten Dunst) and Harry Osborn (Josh Keaton). Fitting into the Spidey suit again, he swings over to the restaurant and learns that Mary Jane is in a play and Harry Osborn is funding money for a brilliant scientist- Otto Octavius, soon to be Doc Ock (Alfred Molina). Mary Jane offers to give Peter a free ticket to her play and Harry agrees to set up a meeting so Peter and Octavius can meet.The following night, Peter meets Mary Jane by a museum to collect the ticket. Only seconds after receiving it, he notices a band of thieves breaking into the art museum and after humiliating himself in front of Mary Jane, reluctantly goes after the thieves as Spider-Man. Moments after Spider-Man's victory over the thieves, a strange figure catches his attention. The figure is Black Cat (Holly Fields) who leads the enticed Spidey through a chase across the rooftops of Manhattan. Black Cat rests and moment and then disappears without a trace.The next day, Spider-Man stops by the Daily Bugle and as Peter Parker- collects information for a Bugle Mission and heads off. After the mission which lead him to taking pics from the top of the Empire State Building, an explosion occurs a few blocks down. Investigating the area, Spider-Man meets the Rhino (John DiMaggio) and the two brawl only to have Spider-Man web up the burly and obnoxious foe. That night, Peter meets Harry outside of Octavius's large apartment by Central Park for dinner. Ocatvius's scientific ambitions are somewhat vague to Peter and come off as a subtle tone of greed as opposed to mankind benefit. The meeting is postponed as Rosie Ocatvius (Susan Egan) promptly calls for dinner.While making photo rounds in Greenwich Village, an alarm goes off at a jewelry store. Spotting the suspicious Black Cat, Spider-Man once more chases her across the rooftops and crevices of skyscrapers. After Cat flirts with Spidey and disappears, he realizes he must meet Mary Jane at a movie theater.The following day after the date with MJ, Peter is at the Bugle and J. Jonah Jameson (Jay Gordon) informs him of a special effects movie star from Hollywood named Quentin Beck/Mysterio (James Arnold Taylor) who is claiming that Spider-Man is a fake. Peter rushes over to Madison Square Garden for pictures- while in reality he will appear as Spider-Man against Beck.Beck and Spider-Man meet amid a fake cardboard audience and phony announcers and Beck declares a series of three challenges. The first two consist of rounding up captured criminals from a prison that Spider-Man had collected and the third is a challenging obstacle course. By the end of the competition, Spider-Man conquers and Beck is both upset and humiliated at his loss. It is during this time that one of the criminals, Herman Schultz/The Shocker (Michael Beattie), unknowingly escapes from both security and Spidey during the highlight of Beck's loss.A day later, Octavius invites Peter to come back to his apartment to discuss the science behind his vision. After the visit, Peter puts on the suit and rushes over to Mary Jane's play before he is too late. Unfortunately, a gang of robbers with snipers and explosives rob a gem store and Spidey forcefully commits to his hero work. Much to his further dismay on missing Mary Jane's play, Spider-Man arrives in the knick of time to catch Mary Jane talking with her new boyfriend, John Jameson (Charles Klausmeyer).Before Spider-Man can intervene, Black Cat sneakily appears once more and informs Spidey that she knows where the art thieves from the museum attempt to attack next. The time arrived yet again for another dazzling night chase through the rooftops in following Black Cat. It ends when Cat leads Spidey to an alleyway where the thieves are boarding crates into a getaway truck. While Spider-Man does the amazing and puts a stop to them for good- Black Cat manages to sneak away once more and this time, she's taken a golden artifact with her.Deciding to visit the Bugle the next day, Peter is instructed by his boss Jonah to go down to the press conference building where Quentin Beck shall speak about Spider-Man. Swinging over there, Spidey only finds trouble as the theater is burning, the conference reporters are in danger from alien-like machines and a large holograph of Mysterio appears centerstage. While Spider-Man saves the reporters and defeats the robots- the Mysterio hologram beckons Spidey to Lady Liberty where an alien invasion is about to occur.Surely enough, Mysterio has created a massive mothership atop the Statue of Liberty's torch where the main brain is kept. Spider-Man swings from the hovering UFO's above the water and to Liberty Island where he destroys 8 orbs and finally the brain that controls the alien illusion. As the extra terrestrial material evaporate, Spider-Man is given one final invitation by Mysterio to come to his funhouse of doom.Spider-Man gets back on the mainland and swings over to Beck's apartment where Mysterio's funhouse lair is hidden behind a bookshelf. In the first room of the funhouse, everything morphs upside down and Spider-Man faces giant, laughing toys known as Mr. Hop-N-Hack. After defeating them, he is brought into a circular room with mirrors where disfigured duplicates of him arise from the reflections. Destroying all of the mirrors brings Spider-Man out of the funhouse and to another dead end as Mysterio escaped in the nick of time.The conclusion of Mysterio's alien invasion is followed with the disastor of the birth of Doc Ock. Racing over to Octavius's apartment for a demonstration of his fusion reactor- the demonstration goes array and Rosie ends up dead while Octavius passes out with the mechanical arm aids attached to him. Even as Spider-Man shuts down the fusion reactor machine, he is too late to save Rosie and Octavius is taken to the medics.While swinging to another class of Dr. Connor's with the mindset he will finally arrive on time, Mysterio's alien robots attack and Spider-Man fights them. During this time, Octavius (now as Doc Ock) has escaped from the hospital and threatens Connors to help him. Declaring him insane, Connors attempts to escape only to be brutally wounded by Ock who flees the scene. Spider-Man arrives seconds late to find his professor in need of medical assistance.Remembering he was going to visit Aunt May (Mindy Sterling) at the Bank of Manhattan, Peter arrives to discuss money matters with a loan officer. The payment is disrupted as Doc Ock and a handful of henchmen rob the bank. Quickly outfitting in his suit, Spider-Man arrives and battles Ock. After knocking out various thugs, Ock seizes bags of cash and Aunt May and flees the building. Matters worsen when Ock as a helicopter and places Aunt May on the El Barrio train tracks and the speeding train is about to kill the loving, senior citizen. Once more, Spidey saves the day and his aunt's life by catching her in the knick of time. However, Ock is still on the loose.Spider-Man arrives at John Jameson's banquet under orders from J. Jonah Jameson- but upon the news that Mary Jane will wed John, Peter is furious and cowers in dismay upon the rooftop. Suddenly when Black Cat arrives, Spider-Man's mood changes, especially when she mentions that Shocker is out and on the loose. Following her to an old warehouse, The Shocker and Spidey have a rendezvous like old times. Shocker escapes as Spidey checks on an injured Black Cat, who is insistent on her condition that she is ok.Later, Mysterio is found in a Speedy Mart harassing the cashier until Spidey arrives and puts Beck in police custody for good. However, when J. Jonah Jameson prints the paper with Spider-Man as the villain, Spidey is furious but promptly stopped by Black Cat who states that she has once again found out where Shocker is hiding. Following Black Cat under the Queensboro Bridge and to Roosevelt Island, the chase ends at an old, run down Oscorp Factory.Once more, the Shocker and Spider-Man duke it out- and with aid from Black Cat- place him back behind bars. Black Cat disappears however before Spidey could thank her, so he decides to see Mary Jane's play in hopes he can make it. He is late however and even though he saves her from three thugs about to mug her, Mary Jane is upset at Peter and repeats that she is marrying John.Deciding to seek Black Cat for girl advice, Spider-Man finds her atop one of the gargoyles on the Chrysler Building. After a brief talk, Cat cheers Spider-Man up by racing him to a warehouse where a group of gangsters are illegally selling armored battle suits. Spidey and Cat crash the party and put an end to the dealing. With one final word of advice from Black Cat about his personal life, Spider-Man goes to MJ's apartment as Peter and tries to talk to her only to end up humiliating himself. Later that night in the Oscorp building, Harry is visited by Doc Ock who demands for more tritium in order to power his fusion reactor. Harry agrees but only if Spider-Man is captured and brought to him personally. He then reveals that Peter is the key to finding him.The following day, MJ thought about what Peter said and decides to meet him at a small cafe'. The meeting is shortlived for Doc Ock comes crashing through the window and kidnaps Mary Jane while telling Peter to have Spider-Man meet him at a tower in El Barrio. Agreeing to his demands, Spider-Man swings over to El Barrio and battles Ock atop the elevated train. However, Spidey passes out from exhaustion at the end of the bout and is brought to Harry.Unmasking him, Harry is horrified to see Peter is the real identity of Spider-Man. Promising he will talk about this matter later, Peter begs Harry for the location of Ock's lair stating that he has MJ hostage. Hypnotically telling him the location, Spider-Man swings over to Doc Ock's waterfront warehouse.The final battle occurs and after Spider-Man shuts down Ock's fusion reactor and knock's some sense into the maniacal 8 limbed supervillain, Ock agrees to destroy his own machine and sacrifice himself by drowning with it in the river. Mary Jane finally sees the truth about Peter and in the end, she goes to his apartment and tells him that she cannot live without him.Police sirens interrupt their love moment but MJ acknowledge's Peter's curse and lets him swing outward as your friendly neighborhood, Spider-Man."}