{"mid": "SpiderMan3", "IMDB_id": "tt0837564", "title": "Spider-Man 3", "plot": "NOTE: The summary concerns the Xbox360/Ps3/PC versions of the game and not the Wii/Ps2.Your friendly neighborhood Spider-Man aka Peter Parker, returns to save the city yet again. The game opens with a psychotic group known as the Mad Bombers and their leader Luke Carlyl (Neil Ross) who set a skyscraper ablaze and promptly invade it. Making his nightly rounds, Spider-Man crashes in to investigate and instantly is attacked by Mad Bomber henchmen. With aid from the Narrator (Bruce Campbell) in learning the basics, Spider-Man rounds up the thugs and saves the hostages. The Mad Bombers are still at large however having gotten away in their helicopter.From here, Spider-Man narrates his current life that he has a beautiful girlfriend, Mary Jane Watson (Kari Wahlgren), his estranged friend Harry Osborn who refuses to speak with him (James Franco), and a new rival photographer, Eddie Brock Jr. (Topher Grace) at the Daily Bugle who is keen for brown nosing the tempermental boss J. Jonah Jameson (J.K. Simmons). There are also still random criminals but the main source of crime lies with that of three gangs: Arsenic Candy (rich spoiled girls), Order of the Dragontail (kung fu fighting ninjas) and the Apocalypse (deranged, half nude psychos who liter the streets). Also, a comet crashes down into Central Park and the symbiote substance slowly slithers from it.NOTE: After the first mission, the game allows the players to pick any mission at random and play them in any order. Thus the missions tend to overlap and writing a synopsis for the way the game flows is somewhat impossible as they can be played in any order. The following is a synopsis is of the missions grouped together.Mad Bomber Missions\nAfter the burning building incident, Peter stops by the Daily Bugle to visit his angry boss J. Jonah Jameson. However, Jonah's phone rings and it is the voice of Carlyl who threatens that the city has betrayed him and it will burn. Peter rushes over to the Grand Central Terminal and into the subway tunnels where he finds Mad Bomber henchmen planting bombs all around the tunnels. He locates them all and puts a stop to them. However, one last Mad Bomber with jetpacks puts bombs on a speeding subway train. Racing towards it, Spider-Man webs it up and forces it to a stop, all the while defusing the bomb.Caryl isn't done however. During a round up at the Financial District, Spider-Man encounters Mad Bomber thugs planting bombs atop City Hall. Even though Spider-Man defeats the thugs and defuses the bomb, about 4 Mad Bomber Jetpack thugs are flying around the Financial District and planting even more bombs. Spider-Man swings to the bombs, defuses them and hunts the jetpack thugs down. With luck, he is able to stop them all.That night, Spider-Man receives tip from fellow Detective DeWolfe that there is a bombing incident occuring beneath the George Washington Bridge. Taking her advice, Spider-Man rushes to the bridge and encounters more Mad Bombers planting yet another set of bombs. Quickly defeating them, Spider-Man's attention is turned to a nearby factory that is overrun with Mad Bombers. He swings to the scene and navigates his way across the smoke filled factory. Carlyl plans to use the factory as a main base for exploding the entire city- but Spider-Man is able to stop him. Before Carlyl escapes yet again, he sees Spider-Man face to face and the helicopter flies away. There is another lurking surprise as the factory detonates and Spider-Man swiftly finds the exit out.Deciding to visit the Daily Bugle again, Peter arrives to see that it is lit on fire and the Mad Bombers have planted bombs in the main editing room and taken Jonah captive. Defusing the bombs, Spidey swings after the helicopter where Jonah is held captive. Throwing the editor from the helicopter, Spider-Man rushes and saves his bossy editor and continues to follow the helicopter. The chase ends atop a building roof where the helicopter eventually goes down but Carlyl unfortunately escapes yet again.Lizard Missions\nDr. Curt Connors (Nathan Carlson) attempts to start an experiment at 8:47PM to regenerate his arm with a serum. Unfortunately, things go astray and he transforms into the evil Lizard. The following day at the Daily Bugle, Peter Parker is told that people are crying about giant lizards running amock in the city and he instantly snaps a picture of Larry the Lizard- a cell phone promoting mascot. Jonah is furious that Parker thinks it is a joke and demands for real pictuers of the giant reptalian creatures. Sure enough on the second search, Parker gets plenty of pictures of actual giant lizards which vanish into the sewers every time he snaps a shot.That night, Peter goes to his university to see Dr. Connors (possibly to ask about the lizards) when he sees that Connors himself is the supervilalin known as the Lizard. The Lizard warns Peter to stay away and then hides in the sewers. Suiting into his spider suit, Spider-Man follows the Lizard. In the sewers, he encounters hundreds of lizards, like the ones he snapped photos of and large hives that is emitting the Lizard disease. The chase to find his professor ends up in a room with three conveyor belts. The Lizard attacks Spider-Man on each of the conveyor belts but Spidey is able to best him and tosses him into another room. From here, the two battle and while Spidey wins, the Lizard slips away further beneath Manhattan.Some time in the future of the game when Spider-Man has the symbiote, he decides to return to the sewers now that he is stronger. Upon arrival, Symbiote Spider finds dead lizards impaled by spears and instantly investigates. After swinging down waterways and running through dirty hallways, Symbiote Spider-Man encounters an old foe: Kraven the Hunter (Neil Kaplan) who came to New York City only to find a suitable equal for hunting. Declaring that the Lizard was unworthy, Kraven decides to add Symbiote Spider-Man to his collection and engages in a battle. Even though Kraven morphs into various creatures and even turns invisible, Symbiote Spider-Man is victorious and interrogates the hunter, demanding to know where his professor went. Laughing, Kraven taunts and says, \"See for yourself.\"Obliging, Symbiote Spider-Man is horrified to find that the Lizard has been transformed into a giant blue glowing 30 foot creature. The two battle in a room with four generators, that are broken causing the Ultra Lizard's shield to vanquish. Finally, Symbiote Spider-Man lets his power get ahead of him and nearly kills the Ultra Lizard by breaking his jaw and throwing him onto electric subway lines. The Lizard cries and morphs back into Dr. Connors where he is rushed to the medics.Later on when Spider-Man has rid himself of the symbiote, he visits his professor in the hospital in his suit and Connors begs Spider-Man to help him cure the rest of the lizard-turned citizens. Going into the sewers yet again, Spider-Man locates and finds three samples of Lizard DNA that Connors needs to create an antidote for. Rounding the samples up, he brings them to Connors in his lab where the professor tells Spidey to come back later for the antidote.A few days later, Spider-Man returns and is informed that he must place the antidotes in three dispensers within the sewers- the third being in the hardest place where the Lizards thrive. Spider-Man dives into the sewers for a final and last time and cures all of the Lizard turned people by placing the antidotes in the dispensers. Returning to his professor, Spidey informs him to make sure nothing like that ever happens again.Scorpion Missions\nSpidey recalls the events he witnessed after dropping Harry off at the hospital where Scorpion (Dee Bradley Baker) was taken away in another van. Remembering his first battle with Scorpion at the terminal and how he was endangered in an experiment, Spidey suspects that the MechaBioCon base on Governor's Island has something to do with it. Slingshotting over the ocean to the island base, Spidey sneaks in and locates Dr. Andrews (Iona Morris) talking to the evil Dr. Stillwell concerning the Scorpion project. Stillwell threatens that Andrews is getting too emotionally involved and if any more mishaps occur, then she will be terminated. Reminiscent of the two arguing scientists from Oscorp in the first game, Spider-Man agrees to help Dr. Andrews and he gets information where Scorpion is being kept. However, shortly afterwards, the alarms go off and Spider-Man instantly escapes the island, attaching himself to the helicopter that Stillwell is escaping in.Now at the mainland highrise base, Spider-Man invades and locates the Scorpion who is under mind control. Trying to convince the arthropod-like experiment, Scorpion refuses and battles back at Spider-Man. The fight leads to the Manhattan Bridge where the mind control devices are being kept. Resisiting as best he can, The Scorpion manages to destroy the mind control homing devices and rids himself of as much equipment as he could. Spidey and Scorpion make an agreement to meet later at a secluded warehouse where they will both take down Stillwell.Towards the end of the game when Spidey rid himself of the symbiote, he recalls Scorpion's request and meets him at the warehouse. The two contemplate to take down Stillwell at the Governor's Island laboratory. Spidey follows Scorpion as they swing down the monorail underground terminal and into the main faculty. Upon arrival, Scorpion is horrified to find The Rhino (John DiMaggio) carrying Dr. Andrews. Rhino taunts Scorpion and then heads up an large lift. Scorpion jumps after him and Spidey follows. After avoiding lasers up the big lift, Spider-Man meets up with Scorpion again and the two battle the overly large Rhino. After defeating him, Scorpion corners Stillwell and demands to become normal again. Stillwell however is not about to agree to the demands and states that he will never be normal again. Preparing to kill her, Spider-Man and Andrews convince Scorpion to refrain from murder and he reluctantly lets the witch-like scientist down. Spider-Man warns Dr. Andrews to never let anything like this ever happen again and to make sure no one else ends up like Scorpion.DeWolfe Missions\nDetective DeWolfe (Vanessa Marshall) is a tough female New York detective who catches Spider-Man's attention during a false cry for help. During this time, Spider-Man is informed that the police department is filled with rats and dirty cops. DeWolfe can't put her exact finger on it all so she gets Spider-Man's unofficial help in taking pictures of gun running operations and illegal trades. The first two nights involve Spider-Man spying on cops and Dragontail members and the second is Arsenic Candy girls and cops. The final is Spider-Man taking pictures of the final dirty cops at the docks and getting DeWolfe's back. After the final request, DeWolfe thanks Spider-Man but is persistent that a vigilante and cop don't mix.Order of the Dragontail Missions\nBeing one of the three major gangs in the city, Spider-Man is typically swinging around when a delivery van is jacked by Dragontail members and the Asian driver thrown out. The Asian driver claims he will be fired, so Spider-Man follows after the van which has dropped a few ancient statues as a trail. Spidey finally locates the gang and defeats them as the cops arrive. The inspector claims that the items belonged to a certain Mr. Chen (Keone Young), a Chinese antique collector. Later, Spidey visits Chen and asks him why the Dragontail tried to steal his statues, but suddenly Dragontail members attack. Spider-Man defeats all of them and stops the falling helicopter they are in. Days later, Chen is delivering more goods and asks Spider-Man to help defend the van. Spidey does so and once more, thwarts the attempts of the Dragontail.Sometime later, Symbiote Spider-Man angrily demands why the Dragontail seek the statues and Mr. Chen states that is is because the bell he has in his garden. When the bell is rung in front of the statues, a secret treasure shall come forth. Chen has also gotten tips on the Dragontail hideout and in seconds, Symbiote Spider-Man is following Chen's helicopter to the Dragontail lair- an old warehouse atop a skyscraper. Jumping in, Symbiote Spider-Man witnesses the entire Dragontail gang and their Dragontail leader (Ron Yuan) in the process of a ceremony to ring the ancient bell. Dropping in, he defeats all of them and then reports to Mr. Chen that he has cleaned up all of his messes.Apocalypse Missions\nBeing one of the most sadistic in the city, Spider-Man swings around to find the Apocalypse Gang Members lowering an innocent citizen down on a winch and into the water. They accused him of spying. Spidey intervenes and saves the citizen, who tells Spider-Man that there were punks in the subways. Fleeing into the subways to hunt the Apocalypse down, Spider-Man encounters various Apocalypse thugs and eventually their hidden base where they have three hostages. Spider-Man easily defeats them and saves the conductor who is about to get hit by a train. The following day, Spider-Man seeks the aid to a troubled cop who claims the Apocalypse are messing up the west power station in attempts to cause a massive blackout. Spider-Man follows the cop in his cop car to a few Apocalypse thugs and then swings over to the power station to defuse the bombs. One bomb can't be defused however so he hurls it into the water by a nearby dock. Upon Spider-Man's attempts to leave though, the Apocalypse leader and some of his best henchmen appear with battle axes and whips. Spider-Man engages in a brief melee with them and manages to defeat them all, ending the Apocalypse reign for now.Arsenic Candy Missions\nThe Arsenic Candy girls are spoiled brats with deadly weapons at their hand. The first occurence with them is at a clothing store when Spider-Man swings hearing an alarm go off. He defeats the various girls and learns that they raided the store, took clothes and headed to an abandoned theater. Spider-Man rushes over to the theater to find three hostages amid an Arsenic Candy fashion show. Spidey defeats all the girls and after saving the hostages, one hostage claims she works at a toy factory where the girls linger. Spider-Man finds his way to the factory and infiltrates the gang- but a few escape by helicopter. Following the helicopter, it lands next to a fireworks warehouse on Roosevelt Island and Spider-Man defeats the girls and saves the hostages. During this ordeal, the Arsenic Candy girls talk about a wedding which gets Spider-Man's curiosity brewing.About a week later, Symbiote Spider-Man is making his swinging rounds at the university when he finds two girls drop a librarian from the clocktower on campus. Swooping in and saving him, the librarian informs Symbiote Spider-Man that the Arsenic Candy girls were interested in the antique wedding rings held at the library which were on loan to the Natural History Museum. Symbiote Spidey instantly makes his way to the museum where he finds an entire posse of Arsenic Candy girls ransacking the museum and shooting bazookas at the precious dinosaurs. Defending the dinosaurs as best he can, Symbiote Spider-Man is incapable of taking the wedding rings but finds a letter inviting him to Priscilla's wedding. Obliging to his invite, Symbiote Spider-Man arrives at the old abandoned church on the upper east side and finds a disgruntled groom forcefully wedding to Priscilla (Erin Fitzgerald)- the leader of the gang. Dropping in, Symbiote Spidey defeats all of the girls and defeats Priscilla.Kingpin Missions\nSometime after the Arsenic Candy wedding ordeal, Peter stops at the Daily Bugle to receive an assignment by Jonah to take pictures at the courthouse as the three major gangs' bosses are going on trial. Peter goes to the courthouse and takes pictures and before he leaves, he spots Wilson Fisk/Kingpin (Bob Joles) surrounded by shady characters of each major gang. Snapping a picture of Fisk, Symbiote Spider-Man suddenly witnesses the gang make a raid of the courthouse and free their bosses. Being the only capable hero present, Symbiote Spidey attacks and defeats all of the gang members, but Fisk and the leaders have escaped. Returning to the Bugle, Peter learns from Robbie Robertson (Charlie Robinson) where Wilson Fisk lives.Furious at Fisk's responsibility for all the gangs trouble, Symbiote Spider rushes to Kingpin's penthouse and crashes through the window. The minute he arrives, the security metal blasts cover up the windows to prevent escaping and Symbiote Spidey is greeted by Apocalypse members. Defeating them with ease and after fighting more members, Symbiote Spidey is invited by the Kingpin himself to come through his fancy double glass doors. Breaking through the doors in blind rage, Kingpin threatens Spider-Man that his behavior is unncessary and then hurls a table at him. Kingpin leaves through another set of doors that promtply is covered with a metal blast seal and more gang members arrive. Symbiote Spider-Man defeats them and then breaks through the doors where he fights the slowly angering Kingpin in a fancy hallwall.After the brief duel, Kingpin tosses Spider-Man through another set of doors and heads into his office. Before Symbiote Spidey can follow however; the Apocalypse boss, Dragontail boss and Priscilla arrive in cool fashion to take on the arachnid superhero. In his rage, they are no contest and it isn't long before Symbiote Spider-Man faces Kingpin in his own office. By the end of their fight, Symbiote Spider-Man becomes so enraged after beating Kingpin to a pulp that he throws him out the penthouse window. Kingpin's fate remains unknown but Peter knows for sure that his strength as well as behavior is seriously altered.Movie Missions\nRemembering he was going to meet his girlfriend MJ, Spider-Man swings over to her work late at night and meets her on the rooftop. MJ jumps on his back and Spidey swings off into Midtown, giving his girlfriend a true roller coaster style thrill ride. Their ride ends at Central Park where the two talk. Peter is troubled that Harry won't talk to him, and MJ (knowing the truth about Norman Osborn's death), states that he must go to him and the truth needs to be revealed. While Peter is distracted in deep thought, the wandering symbiote finds him as a suitable host and unknowingly latches onto his leg.Peter Parker then decides to check on his university professor Dr. Curt Connors/The Lizard, who had vanished last night after morphing into the hideous Lizard and running into the sewers. As Peter leaves the university building, pondering what could've happened to his professor, his spider senses tingle and he is suddenly swooped up by a dark figure flying a glider/sky stick.Harry Osborn has become the New Goblin through the same strength enhancers his father took and he is intent on killing Peter who he thinks murdered his father. The two battle across the northern New York skyline, Peter desperately balances on the glider whilst battling Harry. After damaging him enough, Peter swings away but Harry is intent on following him. The two continue to battle and after a brutal fight, Harry is distracted and accidentally runs into a web that is taught like a clothesline. He falls into an alleyway and Peter, horrified, takes his unconscious friend to the nearest hospital. After Harry is in the hospital, Peter puts on his Spider-Man suit and prepares to swing away when he hears nearby commotion. Checking in the streets, he finds a van suddenly crash and within the storage compartment, the Rhino comes out into freedom.However, another familiar figure to Spider-Man shows up, that of Scorpion/Mac Gargan who quickly battles the Rhino in a one sided fight. The Rhino runs off and then another van pulls up with security guards and Dr. Jessica Andrews, who works for a company known as MechaBioCon, calms Scorpion and takes him away. Spider-Man who witnessed it all keeps that in mind.A few nights later, Spider-Man is having a vicious nightmare about his Uncle Ben's death when the symbiote takes advantage of Parker's unawareness and engulfs him in it's darkness. Waking up screaming, Spider-Man finds himself atop a large skyscraper and realizes that he has a new suit which makes him feel better, faster, and stronger. Trying out the suit by swinging around, Symbiote Spider-Man eventually runs into Flint Marko/ Sandman (Thomas Haden Church) who is escaping with bags of cash. The chase leads to the subway tunnels where Sandman places the bags of money down and engages in a duel. The fight rages back and forth as the two are fairly evenly matched, but Symbiote Spider-Man ends up knocking Sandman down the tunnels and into a puddle of water. As the stunned Sandman prepares to get up, Symbiote Spidey unleashes a huge water pipe and water spills out onto Sandman, draining him through a grate to his supposed demise.Meanwhile at work, J. Jonah Jameson offers a challenge to both Eddie Brock and Peter in who could take the best picture of Spider-Man. Eddie sneakily taunts Peter and leaves, and this entices Peter to spy on him. In his Symbiote Spider-Man suit, he spys on Eddie who has hired a friend of his to dress up in a Spidey suit while carrying bags of cash. Dropping in on them, Symbiote Spider-Man ruins Eddie's plan by breaking his camera as well as locating the hidden cameras for further evidence. Utterly outraged, Eddie vows he will remember Symbiote Spider-Man's actions.Nights later during a dinner date with MJ, Peter's attitude has been greatly affected by the symbiote. As a result, MJ demands to be taken home and Peter purposely swings carelessly and causes MJ to become scared, sick and dizzy. By the time they reach their destination, MJ is upset and breaks up with Peter. Dumbfounded and ashamed of himself for his behavior, Peter swings off to the nearby church. Recalling the symbiote hates noise, he hits himself against the church bell and finally rids himself of the suit. However, Eddie Brock (who saw Spidey slip into the belltower) watches below and sees that Spider-Man is really Peter Parker. The falling symbiote latches onto the vengeful Brock who cries and morphs into the almighty Venom.Venom somehow unknowingly kidnaps Penny Marko (Spencer Lacey Ganus) and locates Sandman who survived his incident in the subway. Venom blackmails Sandman to help him kill Spider-Man or his daughter will suffer- and much to Sandman's dismay, he agrees to the demands. That same night, Peter is watching the news on his small TV in his lowlife apartment when a live broadcast occurs. Venom and Sandman have captured Mary Jane and are holding her in a construction highrise in the Financial District. Suiting into his spider suit, Spider-Man swings over and arrives at the scene.At first Spider-Man is unsure of who Venom is until he admits that he is Eddie Brock. Horrified, the two battle atop the unfinished skyscraper. Meanwhile, Harry Osborn is out of the hospital and back at his rich penthouse. He too is watching the news and sees that Spider-Man is battling Venom. A change of heart occurs and he suits up in his New Goblin suit and flies off to the construction site to aid his superhero friend. Harry rescues MJ and takes on the giant, 300 foot Sandman while Spider-Man continues to clash with Venom in the construction site. At the end of both battles, Harry ends up exploding various pumpkin bombs at Sandman but supposedly perishes in the raging sandstorm; while Spider-Man forces Venom off the construction site where he falls to his death and is impaled on a bed of poles.Peter and Mary Jane make up and Sandman prepares to attack Spider-Man once more when Penny Marko comes running towards her father. Sandman's fate remains unknown but he thanks Spider-Man and apologizes claiming that Venom blackmailed him to do it. The game ends with closing narration and a reminder that Spidey will always be that superhero who swings in and fights crime."}