{"mid": "SplendorInTheGrass", "IMDB_id": "tt0055471", "title": "Splendor in the Grass", "plot": "Kansas, 1928: Wilma Dean \"Deanie\" Loomis (Natalie Wood) is a teenage girl who follows her mother's advice to resist her desire for sex with her boyfriend, Bud Stamper (Warren Beatty), the son of one of the most prosperous families in town. In turn, Bud reluctantly follows the advice of his father, Ace (Pat Hingle), who suggests that he find another kind of girl with whom to satisfy his desires. Bud's parents are ashamed of his older sister, Ginny (Barbara Loden), a flapper and party girl who is sexually promiscuous, smokes, drinks, and has recently been brought back from Chicago, where her parents had a marriage annulled to someone who married her solely for her money. Rumors in town, however, have been swirling that the real reason was that she had an abortion. Being so disappointed in their daughter, Bud's parents \"pin all their hopes\" on Bud, pressuring him to attend Yale University. The emotional pressure is too much for Bud, who suffers a physical breakdown and nearly dies from pneumonia.\nBud knows one of the girls in high school, Juanita (Jan Norris) who is willing to become sexually involved with him, and he has a liaison with her. A short while later, depressed because of Bud ending their relationship, Deanie acts out by modeling herself after Bud's sister, Ginny. At a party she attends with another boy from high school, \"Toots\" Tuttle (Gary Lockwood), Deanie goes outside with Bud and makes a play for him. When she is rebuffed by Bud, who is shocked, since he always thought of her as a \"good girl,\" she turns back to \"Toots,\" who drives her out to a private parking spot by a pond that streams into a waterfall. While there, Deanie realizes that she can't go through with sex, at which point she is almost raped. Escaping from \"Toots\" and driven close to madness, she attempts to commit suicide by jumping in the pond, being rescued just before swimming over the falls. Her parents sell their stock to pay for her institutionalization, which actually turns out to be a blessing in disguise, since they make a nice profit prior to the Crash of '29 that leads to the Great Depression.\nWhile Deanie is in the institution, she meets another patient, Johnny Masterson (Charles Robinson), who is working out anger issues targeted at his parents, who want him to be a surgeon. The two patients form a bond. Meanwhile, Bud is sent off to Yale, where he fails practically all his subjects. While at school, he meets Angelina (Zohra Lampert), the daughter of Italian immigrants who run a local restaurant in New Haven. In October 1929, Bud's father travels to New Haven in an attempt to persuade the dean not to expel Bud from school. While Ace is in New Haven, the stock market crashes, and he loses everything. He takes Bud to New York for a weekend, including to a cabaret nightclub, after which he commits suicide. Bud has to identify the body.\nDeanie returns home from the asylum after two years and six months, \"almost to the day.\" Ace's widow has gone to live with relatives, while Bud's sister has died in a car crash. Deanie's mother wants to shield her from any potential anguish from meeting Bud and so pretends to not know where he is. When Deanie's high school friends come over, her mother gets them to agree to feign ignorance on Bud's whereabouts. However, Deanie's father refuses to coddle his daughter and tells her that Bud has taken up ranching and lives on the old family farm. Her friends drive Deanie out to meet Bud. He is now married to Angelina, they have an infant son, \"Bud Jr.,\" and Angelina is expecting another child. Deanie lets Bud know that she is going to marry John, who is now a doctor in Cincinnati. During their brief reunion, Deanie and Bud realize that both must accept what life has thrown at them, as Bud says, \"What's the point? You gotta take what comes.\" They each relate that they \"don't think about happiness very much anymore.\"\nAs Deanie leaves with her friends, Bud only seems partially satisfied by the direction his life has taken. After the others are gone, he reassures Angelina, who has realized that Deanie was once the love of Bud's life. Driving away, Deanie's friends ask her if she is still in love with Bud. She realizes that she still loves him warmly, but that they can never recover that blazing love of youth which they once had. She does not answer her friends, but Deanie's voice is heard reciting four lines from a Wordsworth poem:\n\"Though nothing can bring back the hour\nOf splendor in the grass, glory in the flower,\nWe will grieve not; rather find\nStrength in what remains behind.\""}