{"mid": "SplittingHeirs", "IMDB_id": "tt0108207", "title": "Splitting Heirs", "plot": "The film centres on the aristocratic family of the Dukes of Bournemouth (England), upon which misfortune has fallen throughout history, leading its members to believe the family is cursed. The most recent heir, Thomas Henry Butterfly Rainbow Peace, was left in a restaurant as an infant in the 1960s; by the time his parents remembered him, he had disappeared. Meanwhile, in the 1990s Tommy Patel has grown up in an Asian/Indian family in Southall, never doubting his ethnicity despite being taller than anyone else in the house, fair-haired, blue-eyed, light-skinned—and not liking curry. From the family corner shop he commutes to the City where he works for the Bournemouth family's stockbroking firm, handling multimillion-pound deals.\nTommy is given the job of acting as host to the visiting American representative of the firm, Henry Bullock, who turns out to be the son of the head of the firm, the present Duke. They become friends and the friendship survives Henry becoming the new Duke when his father dies. Circumstantial evidence shows that the true Bournemouth heir is actually Tommy; we see a series of family portraits each of which captures something of Tommy's facial characteristics, and his Indian mother tells him the story of his adoption. He consults the lawyer who dealt with his adoption, Raoul P. Shadgrind, who says Tommy has no hope of proving his claim, but plants the idea of him obtaining his rightful place in the family by getting Henry out of the way; Shadgrind himself then engineers a variety of 'accidents' in the belief that he will share in the spoils as Tommy's partner. The delightfully-complicated love interest comes with Tommy's and Henry's (shared at the same time) lover, later the new Duchess and their (shared at different times) mother, the dowager Duchess. As befits a classical comedy of errors, the final resolution of everyone's doubts and misconceptions leaves everyone living \"happily ever after - \"well, for a bit, at least...\"\nThe setting for the Duke's stately home in the latter part of the film is Longleat."}