{"mid": "SpringBreakers", "IMDB_id": "tt2101441", "title": "Spring Breakers", "plot": "Childhood friends Faith (Selena Gomez), Brit (Ashley Benson), Candy (Vanessa Hudgens), and Cotty (Rachel Korine) seem to be the only people left on their college campus. The rest of their classmates have migrated south to Florida for spring break, and the girls are desperate to join them. Brit, Candy, and Cotty decide to rob a local fast food restaurant to get the money they need to take the vacation. Cotty drives, and Brit and Candy bust into the joint with a hammer and a fake gun. They steal hundreds of dollars, and after burning the car, the trio brings their loot to Faith. Faith, who demonstrates a bit more of a conscience than her friends, overlooks her horror at their crime in favor of a free vacation.When the foursome arrives in Florida, they quickly immerse themselves in spring break culture: drinking, drugs, and never-ending parties. Faith feels as though Florida is the most spiritual place she has ever been; she feels as though she has found herself. The days melt into a blur of alcohol, swimming at the beach, and grinding against fellow \"spring breakers.\" The only uncomfortable moment arises when Brit, Candy, and Cotty describe the robbery to Faith. Brit and Candy terrorized the people in the restaurant by threatening to kill them if they didnt give them their money. When Faith sees how much her friends enjoyed stealing and scaring people, she is taken aback.The four girls attend a beachside concert and see Alien (James Franco), a drug-dealing rapper, for the first time. Alien claims to come from another planet and also revels in the spring break culture. Later, the foursome goes to an out of control party at a motel. They snort cocaine, damage the motel, and are eventually arrested by local police. They spend the night in a county jail and appear in court the next day still dressed in their bikinis. The judge gives them a choice: pay a fine or spend two more days in jail. Brit protests that they dont have any money, and for a moment it looks like they might go back to their cell. Luckily for them, two of Alien's grunts were arrested at the same party, and he has come to post their bail. Something about the foursome appeals to him, because he bails them out of jail too.Alien greets Faith, Brit, Candy, and Cotty as they exit the jail. He wants to show them around town. While Brit, Candy, and Cotty jump at the chance to ride around in Alien's sleek car, Faith is suspicious of him. Her misgivings about Alien grow when she learns he sells drugs for a living. That evening, when Alien takes the girls to a party where older men, most of them African American, leer at them. Faith breaks down crying and decides to go home, even after Alien tries to convince her to stay. Faith heads back to college (thus is never seen again in the film), and the remaining three girls move in to Alien's house.Brit and Candy, even more wild than Cotty, giggle as Alien shows them his bedroom, which is packed with guns, Scarface memorabilia, and stacks of money. The pair take two of Alien's guns, both loaded, and playfully point them at him. He tells them to stop, but Brit tells him to get on his knees. She and Candy force Alien to fellate the barrels of the guns, which he does with gusto. When he finishes, the three begin kissing, and Alien tells him theyre his soul mates.Later, Alien takes the trio to a strip club. He gives them wads of cash to toss at the strippers and points out Big Arch, his former mentor and current competitor. Big Arch (Gucci Mane) menaces Alien and tells him to go back to ripping off spring breakers; he owns the drug trade in town, and he doesn't feel like sharing. Alien pretends that Big Arch's threats don't bother him. He buys Brit, Candy, and Cotty matching bathing suits, pink ski masks, and sweatpants. Together, the four of them bust in to spring break parties and rob the people there. The robberies become more violent, and Brit and Candy especially seem to become more depraved.Meanwhile, Big Arch is still angry that Alien sells drugs. He and an associate drive past Alien's car one night and warn him to back off; then they open fire into the car, and one bullet hits Cotty in the arm. She breaks down afterwards and sobs in the shower. Cotty also wants to go home, and she leaves the next morning.Alien wants to exact revenge on Big Arch, and so do Brit and Candy. The trio has a threesome in Alien's pool, and Alien tells Brit and Candy he loves them. Brit and Candy both call their mothers and tell them what an amazing time they're having on spring break; they pretend they are back at school and that now they want to be better people.Brit and Candy, clad only in neon bikinis and ski masks, climb into Alien's boat and drive to Big Arch's waterfront mansion. One of Big Arch's bodyguards opens fire and shoots Alien in the head as he charges down the dock. Brit and Candy return fire and kill him. The pair proceeds to shoot and kill the rest of the bodyguards at Big Arch's mansion. They find Big Arch in his bathtub and shoot him dead.The murderous and deranged Brit and Candy watch the sun rise in Florida one last time before driving out of town for places unknown in Big Arch's sports car. A flashback shows the two girls kissing Alien's corpse before running down the dock."}