{"mid": "Stagecoach", "IMDB_id": "tt0031971", "title": "Stagecoach", "plot": "In 1880, a motley group of strangers boards the east-bound stagecoach from Tonto, Arizona Territory to Lordsburg, New Mexico Territory. These travelers are unremarkable and ordinary at first glance. Among them are Dallas (Claire Trevor), a prostitute who is being driven out of town by the moralistic \"Law and Order League\"; an alcoholic doctor, Doc Boone (Thomas Mitchell); pregnant Lucy Mallory (Louise Platt), who is traveling to meet her cavalry officer husband; and whiskey salesman Samuel Peacock (Donald Meek).\nWhen the stage driver, Buck (Andy Devine), looks for his normal shotgun guard, Marshal Curly Wilcox (George Bancroft) tells him that the guard is off searching for the fugitive Ringo Kid. Ringo broke out of prison after hearing that his father and brother had been murdered by Luke Plummer (Tom Tyler). Buck tells Curly that Plummer is in Lordsburg. Knowing that Ringo has vowed to avenge his father and brother, Curly decides to ride along as guard.\nAs the stage sets out, U.S. Cavalry Lieutenant Blanchard (Tim Holt) announces that Geronimo and his Apaches are on the warpath; his small troop will provide an escort to Dry Fork. At the edge of town, two more passengers flag down the stage and board: gambler and Southern gentleman Hatfield (John Carradine), and banker Henry Gatewood (Berton Churchill), who is absconding with $50,000 embezzled from his bank.\nFurther along the road, the stage comes across the Ringo Kid (John Wayne), whose horse went lame and left him afoot. Even though they are friends, Curly has no choice but to take Ringo into custody. As the trip progresses, Ringo takes a strong liking to Dallas. Doc Boone gets drunk on Peacock's samples. When Doc Boone tells Peacock that he served as a doctor in the Union Army during the \"War of the Rebellion,\" Hatfield quickly uses a Southern term, the \"War for the Southern Confederacy.\"\nThe stage reaches Dry Fork, but the expected cavalry detachment has gone to Apache Wells. Buck wants to turn back, but Curly demands that the group vote. With only Buck and Peacock objecting, they decide to proceed on to Apache Wells. At lunch before departing, the group is taken aback when Ringo invites Dallas to sit at the main table, and Mrs. Mallory is clearly uncomfortable having lunch with a prostitute. Hatfield gives Mrs. Mallory a drink from his silver folding cup, rather than have her drink from the canteen directly. She recognizes the family crest on the cup, and asks Hatfield whether he was ever in Virginia. He says he won the flask in a card game, but also that he served in the Confederate Army under her father's command. When the stage reaches Apache Wells, Mrs. Mallory learns that her husband had been wounded in battle and has left; she faints and goes into labor. Doc Boone has to sober up and deliver the baby, and later Dallas emerges holding a healthy baby girl. Later that night, Ringo asks Dallas to marry him, and live on a ranch he owns in Mexico. Afraid to reveal her checkered past, she does not answer immediately. The next morning, she accepts, if he will give up vengeance on the Plummers. He agrees. But she does not want to leave Mrs. Mallory and the new baby, so she tells him to go alone, and that she will meet him later. Encouraged, Ringo escapes - but then sees smoke signals heralding an Apache attack, and returns. The passengers quickly gather their belongings and leave.\nThe stage reaches Lee's Ferry, where Apaches have burned the station and ferry, and killed the station-keeper and his family. Curly uncuffs Ringo to help lash logs to the stagecoach and float it across the river. Just when they think that danger has passed, the Apaches attack. A long chase scene follows, with stunt work staged by Yakima Canutt. Peacock and Buck are hit, and the party all run out of ammunition. As Hatfield is about to use his last bullet to save Mrs. Mallory from being taken alive, he is mortally wounded. Just then, the 6th U.S. Cavalry rides up to rescue the stage.\nThe stage finally arrives in Lordsburg. Gatewood is arrested by the local sheriff, and Mrs. Mallory learns that her husband's wound is not serious. Peacock invites everyone to visit him in Kansas City. Mrs. Mallory thanks Dallas, who gives Mrs. Mallory her shawl. As he dies, Hatfield asks Mrs. Mallory to tell his family that he died bravely. Dallas begs Ringo not to confront the Plummers, but he is determined to settle matters. Curly lets him go (with a gun, but with just three bullets left after the Indian fight).\nLuke Plummer, hearing that Ringo is in town, gets up from a poker game, leaving a hand of aces and eights. Plummer takes up a shotgun (an unfair weapon), but Doc Boone blocks his path, demanding that he leave it - or kill Doc first. Plummer leaves the shotgun, to Doc's relief, and joins his two brothers.\nA shootout follows, which is heard but not seen. Ringo reappears, having killed the three Plummers, and surrenders to Curly, expecting to go back to prison. He asks Curly to take Dallas to his ranch. Ringo boards a wagon and says goodbye to Dallas, and Curly invites Dallas to ride with them to the edge of town. After she climbs aboard, Curly and Doc laugh and start the horses moving, letting Ringo \"escape\" with Dallas."}