{"mid": "Stalin", "IMDB_id": "tt0105462", "title": "Stalin", "plot": "Siberia, 1917. Russia is mired in the third bloody year of the First World War, fighting against Germany. The brutal war and the Tsar's inept, autocratic rule have created an atmosphere ripe for revolution. Josef Dzhugashvili (Robert Duvall), a 38-year-old Georgian using the revolutionary nickname of \"Koba,\" has been exiled to Siberia yet again for his violent activities including bank robberies, kidnappings, and killings. In his writings, he has begun using the name Stalin- Man of Steel. Stalin is drafted into the Tsarist army but fails his physical due to a damaged left arm and a deformed foot. A devoted follower of Vladimir Lenin (Maximilian Schell), Stalin is present when the exiled Bolshevik secretly returns to Russia. Stalin meets his future wife, Nadya (Julia Ormond), while in Siberian exile. She is only seventeen and the daughter of a revolutionary friend. Stalin employs her as a personal secretary but soon takes her as a mistress.After the Tsar is toppled and murdered, Stalin's ruthlessness is fully unleashed in the service of Vladimir Lenin. He confines two dozen \"unreliable\" former Tsarist army officers on a prison barge and orders it sunk, enraging his chief rival for Lenin's favor- revolutionary Leon Trotsky (Daniel Massey).Stalin and young Nadya are married in 1919. Nadya serves as Lenin's personal secretary while Stalin agrees to serve as Party General Secretary. His fellow Politburo members look down on him as an uneducated, unsophisticated thug, but it is a fatal mistake. Stalin's sheer ambition and ruthlessness make him a supremely dangerous adversary. Shortly after the birth of Stalin and Nadya's first child in 1921, Lenin suffers a debilitating stroke. Lenin's worried followers cannot help but notice the look of steely resolve on Stalin's face. Stalin stays close to Lenin as he recuperates, but they quarrel over Stalin's ruthless tactics and ambition. Stalin is also hated by Lenin's wife, Nadezhda Krupskaya (Miriam Margolyes). In Lenin's prolonged absence, an anti-Trotsky power troika of Stalin, Zinoviev (Andras Balint), and Kamenev (Emil Wolk) is formed. When Lenin dies in 1924, Stalin plays the loyalist, directing that his body be embalmed and permanently displayed in Red Square. Stalin seeks to inherit Lenin's mantle, but It turns out that before his death Lenin had dictated a letter to the Central Committee condemning Stalin for his cruelty and encouraging his removal as General Secretary. Lenin's damning political testament is later suppressed at Stalin's orders.Fearing a conspiracy between Trotsky and the other Central Committee members, Stalin decides to strike first. He has Trotsky purged from the party and eventually exiled. Stalin's extreme paranoia leads him to systematically purge his ranks of other old comrades who might be potential competitors, first replacing Zinoviev. The unscrupulous and sexually perverted Georgian, Lavrentiy Beria (Roshan Seth), becomes Stalin's right hand man. Nadya begins to recoil at her husband's increasingly vindictive and sadistic personality.Stalin cements his iron grip on even the most remote parts of the Soviet Union, jailing or killing all who oppose him. Stalin's monstrous nature is increasingly revealed through his relationship with his son from a previous marriage, Yakov. Stalin's first wife had died from typhus at a young age, and Stalin had subsequently abandoned the young boy. When Yakov arrives in Moscow seeking a relationship with his estranged father, Stalin is cruelly contemptuous of him. Later, when Yakov asks permission to marry a Jewish girl, the harshly anti-Semitic Stalin refuses. His distraught son flees to another room and shoots himself. Stalin, seeing that the boy has only succeeded in wounding himself, sneers, \"Idiot! He can't even shoot straight.\" It is the last straw for Nadya, who leaves Stalin and flees to her parents' home in Leningrad. Receiving little moral support from them, Nadya returns to Moscow, witnessing mass deportations and evidence of widespread starvation along the way. She publicly confronts and shames her husband at a banquet celebrating the fifteenth anniversary of the Bolshevik Revolution. Stalin responds by burning her with a cigarette. In the morning, Stalin is awakened after a night with his mistress to discover that Nadya is dead- ostensibly from appendicitis, perhaps a suicide, but most probably murdered on Stalin's orders. Now the sole parent of two small children aged eleven and six, Stalin once again declines to be a father.A new rivalry draws the attention of Stalin in late 1934. Sergei Kirov, a loyal Stalinist and head of the Communist Party in Leningrad, has become increasingly popular, to Stalin's dismay. Under suspicious circumstances, Kirov is killed by a lone assassin in Leningrad. Though Stalin's involvement is widely suspected, no direct evidence emerges to implicate him. Stalin's wholesale purges are just beginning. Despite Stalin's assurances to the contrary, Zinoviev and Kamenev are soon liquidated in Lubyanka Prison by Beria and the NKVD. Upon reporting the executions to Stalin during a dinner gathering, Beria amuses the bloodthirsy attendees with a ghoulish imitation of the condemned men's last moments. Another of Stalin's old comrades, Bukharin (Jeroen Krabbe) soon fears that his turn has come when the NKVD comes for him at his home. Stalin \"just happens\" to place a phone call to Bukharin as he is being arrested and feigns surprise at the police intrusion. Stalin calls off the secret police, but a terrified Bukharin gets the message. Stalin soon attempts to coerce another old ally, a man named Sergo, into betraying Bukharin. When Sergo refuses and makes the mistake of threatening Stalin, Stalin makes it clear that suicide is his only option. He will be given a hero's burial within the Kremlin walls. Sergo complies. Bukharin is soon framed and put on trial in one of the infamous \"show trials\" of 1938. The verdict is a foregone conclusion. Like the others, Bukharin is taken to a dark prison cell and shot by Beria. Stalin also orders the murder of exiled Leon Trotsky, who is now living in Mexico City.After Stalin cynically concludes a 1939 non-aggression pact with Hitler, the massive German invasion of the Soviet Union in June 1941 comes as a nasty surprise. Stalin is panicked and angry, accusing his generals of gross incompetence. General Voroshilov (John Bowe) reacts angrily, accurately charging that Stalin's purges of the Russian military leadership during the 1930s were responsible for the failure of the Russian defenses. Stalin seemingly has a nervous breakdown, disappearing from view for ten days. When he finally recovers his wits, he takes complete charge and predicts in a radio address, \"Hitler will go the way of Napoleon...to defeat, to despair, and to his death.\" Stalin's son, Yakov, is soon taken prisoner by the Germans. When informed of his capture, Stalin callously replies, \"I have no son Yakov.\" Yakov is later killed trying to escape from a German prison camp. Stalin ruthlessly leads the Soviet Union to victory over the next four brutal years. Twenty million Russians die during the conflict. Fearing infection from Western political ideas, Stalin sends hundreds of thousands of returning Russian POWs to Siberian prison camps after the war.Stalin's sadistic sense of humor continues until the very end. A 1953 dinner gathering includes Beria, Molotov, Kruschev, Voroshilov, and Stalin's grown daughter Svetlana. Stalin, increasingly frail and suspicious (even of his doctor), notices that Beria refuses his soup. He insists that Beria taste the soup first, apparently suspecting it is poisoned. Beria tries to beg off, but Stalin forces the issue. After his guests have eaten their soup, Stalin poses a question: who will follow him as Russia's leader? In response to the stunned silence, Stalin suggests that since none of them are worthy of succeeding him, he wishes to be rid of them all. He points out that he didn't eat his own soup, since he had the soup poisoned. His horrified guests giggle nervously and uncertainly while Beria rushes from the room to throw up. After Beria leaves, Stalin chuckles, dips his spoon into his soup, and begins eating. The relieved diners laugh heartily, but none of them doubt that it could have been true. Dinner ends abruptly when Stalin grabs at his temple, having suffered the first of many strokes.Soon after, Stalin is on his deathbed, surrounded by Beria, Molotov, Kruschev, Voroshilov, and his doctor. He is suffering from congestive heart failure after years of smoking and stress. At one point, the doctor tearfully points out that he is struggling to breathe. Beria replies, \"Let him suffer- the murdering bastard!\" To Beria's horror, Stalin opens his eyes and stares at him. Beria drops to his knees, kisses Stalin's hand, and begs his forgiveness. When Stalin fades out again, Beria spits scornfully on the floor. Svetlana arrives just in time to bid him goodbye, then faints. In another room, Kruschev and Molotov quietly discuss Stalin's legacy. Kruschev bitterly condemns Stalin's atrocities and their effect on Russia, but Molotov rebukes him. He points out Russia's modernization and industrialization under Stalin, and argues that Stalin allowed Russia to take its place as a great nation. \"Our history required Stalin.\""}