{"mid": "StarTrekInsurrection", "IMDB_id": "tt0120844", "title": "Star Trek: Insurrection", "plot": "Lieutenant Commander Data (Brent Spiner) is temporarily transferred to an undercover mission observing the peaceful Ba'ku people. While on their planet, he malfunctions and reveals the presence of the joint Federation–Son'a task force observing the Ba'ku. Admiral Matthew Dougherty (Anthony Zerbe) contacts the USS Enterprise-E to obtain Data's schematics but adamantly states the presence of the Enterprise is not needed. Captain Picard decides to ignore these orders and takes the Enterprise to capture Data. After stopping Data, Captain Jean-Luc Picard (Patrick Stewart) becomes suspicious of Dougherty's insistence that the Enterprise is no longer needed. His crew investigates the cause of Data's malfunction. They discover that the Ba'ku have advanced technology, but have rejected its use to live simpler lives. Due to unique radiation or \"metaphasic particles\" emanating from their planet's rings, they are effectively immortal. Dougherty's allies, the Son'a, are a decrepit race who use medical techniques to prevent death; their excessive use of cosmetic surgery gives them a mummified appearance. The Enterprise crew also begin to experience the rejuvenation effects of the planet: Lt. Commander Geordi La Forge (LeVar Burton) finds his eyes have regenerated and he no longer requires ocular implants; Commander William Riker (Jonathan Frakes) and Counselor Deanna Troi (Marina Sirtis) rekindle their long-abandoned relationship; and Picard develops a romantic relationship with the Ba'ku woman Anij (Donna Murphy).\nData and Picard discover a submerged and cloaked Federation ship containing a gigantic holodeck set up to recreate the Ba'ku village. Data's malfunction stems from a Son'a attack, received when he discovered the vessel. Picard confronts Dougherty and learns that top Federation officers and the Son'a secretly planned to deceptively move the Ba'ku to the ship and forcibly relocate them to another planet, allowing the Son'a to collect the rejuvenating radiation (but poisoning the planet in the process). Dougherty orders the Enterprise to leave. Picard states the rejuvenation benefit of the radiation does not justify Dougherty's plans for the Ba'ku and violates the Prime Directive. He plans to alert the Federation of the forced relocation.\nPicard is joined by some of his crew to help the Ba'ku escape from being abducted while Riker takes the Enterprise to a transmission range and communicate the violation to Star Fleet. The Son'a send robotic probes to locate and capture the fleeing Ba'ku. The Son'a leader, Ahdar Ru'afo (F. Murray Abraham), convinces Dougherty to allow two Son'a ships to attack the Enterprise. Riker defeats the attacking ships and the Enterprise escapes. Their plan exposed, Ru'afo insists upon harvesting the radiation source immediately. Picard, Anij, and several Ba'ku are transported as prisoners onto the Son'a ship. Picard reveals to Dougherty that the Son'a and the Ba'ku are the same race and involving the Federation in a blood feud. The Son'a are a splinter faction of Ba'ku who gave up their bucolic existence a century earlier to embrace the use of technology. They attempted to seize power but failed, and the Ba'ku elders exiled them from the planet, denying them the rejuvenating effects of the rings. The Son'a developed an artificial and imperfect means to extend their lives at the cost of disfigurement. Ru'afo kills Admiral Dougherty when he backs out of the plan and Ru'afo proceeds with his plan.\nWhile Picard is escorted to be executed, he convinces the Son'a Gallatin (Gregg Henry) to help him stop Ru'afo. Picard masterminds a ruse to transport Ru'afo and his bridge crew to the holoship and shutdown the harvester. Ru'afo discovers the deception and transports to the radiation harvester ship to manually restart the process. Picard follows and sets the harvester to self-destruct, which kills Ru'afo while Picard is rescued by the Enterprise. The remaining Son'a are forgiven and welcomed back by the Ba'ku. Picard arranges a meeting between Gallatin and his Ba'ku mother. The Enterprise crew take a moment to enjoy their rejuvenated selves before returning to their previous mission."}