{"mid": "Starcrash", "IMDB_id": "tt0079946", "title": "Starcrash", "plot": "In a distant galaxy, a starship searches for the evil Count Zarth Arn. Closing in on a planet, the ship is attacked by a mysterious weapon (a red blobby field) which drives the crew insane. Three escape pods launch during the attack, but the ship crashes into the atmosphere of the planet and is destroyed.\nMeanwhile, smugglers Stella Star and her sidekick Akton run into the Imperial Space Police, led by robot sheriff Elle. Akton and Stella escape by jumping into hyperspace. When they emerge, they discover an escape pod from the attacked starship, and in it, a sole disoriented survivor. Before they can escape, they are apprehended by the police, who tracked their hyperspace trail.\nTried and convicted of piracy, they are each sentenced to life in prison on separate prison planets. When a riot breaks out at Stella's prison, she uses the diversion to escape the prison, which explodes shortly afterwards. Elle and Police Chief Thor recapture her, only to inform her the authorities have cancelled her sentence; she is taken to an orbiting ship, where she is reunited with Akton. They are contacted holographically by the Emperor of the Galaxy, who thanks them for recovering the starship survivor; he informs them of a feud he has with Count Zarth Arn, who has a secret weapon of immense power hidden away on a planet somewhere, and with which he plans to take over the galaxy. The Emperor orders Stella and Akton to find the Count's weapon, and they are offered clemency if they help find two more missing escape pods as well as the mother ship, one of which may contain the Emperor's only son. With Chief Thor and Elle accompanying them, Stella and Akton set off on their quest.\nUsing hyperspace, which massively cuts the time they have to travel through space, they quickly arrive at the location Akton computes for the first escape pod. Stella and Elle take a shuttle from the spaceship and land near the pod on a sandy, rocky beach. There are no living survivors. Stella meets an Amazonian warrior tribe and is escorted to their underground fortress. On arrival, Elle is ambushed, shot and left for dead, and Stella is taken captive. Stella is taken before Corelia, Queen of the Amazons, who is in league with Zarth Arn. Elle doesn't actually die, and he makes his way to the throne room, taking Corelia hostage to secure Stella's release. They escape, but the queen mentally activates a giant female robot which chases them until they are rescued by Akton and Thor, in the spaceship.\nOn a desolate and uninhabited snow-covered frozen planet, Stella and Elle investigate the mother ship crash site, but as with the first crash site, they find no survivors. Upon their return to the ship, Thor, who has ambushed and apparently knocked out Akton, reveals that he is an agent of Zarth Arn, and will shortly join him as his Prince of Darkness. Thor locks Stella and Elle outside on this planet where the temperature drops thousands of degrees at night, where he knows they will freeze to death; however, Elle preserves Stella's life by using his energy to keep her heart going while they freeze over in the snow. Meanwhile, Akton revives himself and battles Thor, killing him. When morning comes, Akton brings Elle and frozen Stella back onto the ship, where he uses his powers to thaw her out.\nApproaching the planet of the third escape pod, their ship comes under attack from the same red blobby field, but Akton steers the ship through it, saving them. Stella and Elle, inspecting the pod wreckage, are attacked by primitive cavemen who smash Elle to pieces and abduct Stella, but a man in a golden mask arrives, firing lasers through his eyes, and rescues her. He is revealed to be the Emperor's son, Prince Simon. They are again attacked and overpowered by the cavemen, but Akton appears and fights them off with his light saber; he then reveals that they are standing on the Count's weaponized planet.\nArriving at an underground laboratory, the three are captured by the guards. The Count appears and reveals his plan to use them as bait to bring the Emperor to the planet, and then have his weapon self-destruct, destroying the planet, the Emperor, and all of them. He leaves, ordering his two robot golems to keep the group there. Akton engages them in a laser sword duel, and the trio eventually defeat the robots, but Akton is mortally wounded. He says goodbye, and vanishes in a plume of electrical fuzz. The Emperor arrives at the planet. He is aware of the Count's trap, but he buys them all time to escape by using a green ray from his flagship to \"stop time\" for three minutes. The flagship pulls away as the planet explodes behind it.\nStella stands with the Emperor on his flagship, as a huge battle commences between his armada and the Count's, with the Emperor's soldiers storming the Count's space station; however, the attack fails, and the victorious Count gets set to destroy the Emperor's home planet. With no more option left, the Emperor decides to ram a massive space station, the Floating City, into the Count's space station, destroying them both. But Elle has been salvaged and rebuilt by the Emperor's men, and Stella and Elle volunteer to commandeer the City, and to smash it into the Count's station. They fly the city towards the space station, and manage to escape together just as their station crashes into the Count's, finally winning the war.\nStella and Elle are picked up by Simon, and the two humans embrace. The movie ends with the Emperor delivering a short victory speech."}