{"mid": "StarshipInvasions", "IMDB_id": "tt0076760", "title": "Starship Invasions", "plot": "The plot concerns the black-clad Legion of the Winged Serpent, a rogue group of human-like telepathic aliens led by Captain Rameses (Christopher Lee). The Legion's home planet Alpha in the Orion constellation is about to be destroyed in the imminent supernova of its star, and Rameses is leading a small force of flying saucers to Earth to examine its suitability for their race. Performing several alien abductions, they discover they are descendants of transplanted humans, and thus the Earth is perfect for them. They cover their tracks using a device that causes the abductees to commit suicide after a short time. They plan to take over after using a larger version of the device so that everyone on Earth will kill themselves.\nOpposing any attempt to interfere with less-developed planets is the Intergalactic League of Races, a highly-advanced group of bald, big-headed aliens from Zeta Reticuli. The League operates an observation base on Earth in the form of a pyramid hidden beneath the ocean. Rameses lands at the base, pretending to be a friendly researcher, and the League reminds him that under the Galactic Treaty he is to have no contact with humans. While taking a tour of the base, he is disturbed to see a television broadcast featuring human UFO expert and astronomer Professor Allan Duncan (Robert Vaughn) discussing Rameses' abductions. He laughs it off and indulges in the local entertainment.\nRameses' crew sabotages one of the League's three saucers, which is later shot down when approaching a US Army base. The League sends its remaining ships to investigate, and Rameses and his crew kill everyone left in the base. One of the League saucers manages to return to the base but its crew is killed in a shootout. Rameses' ship fights the remaining League ship, but loses the battle and is destroyed. Rameses then calls in his fleet, hiding behind the Moon, to hunt down the surviving League ship. Rameses also deploys the \"extermination device,\" the orbiting, global-scale version of the suicide device. The US armed forces discover it in orbit, but are powerless to prevent the ensuing suicide epidemic.\nThe surviving League ship has suffered minor computer damage, and contacts Duncan for assistance. He enlists the help of his friend Malcolm (Henry Ramer), a computer expert, who repairs the ship using parts picked up in downtown Toronto. They are discovered shortly after taking off and are intercepted by one of Rameses' ships, but they shoot it down and it crashes into First Canadian Place. Duncan and Malcolm's \"abduction\" makes the front page of the Toronto Star. After repairs and refueling, they leave Earth in an attempt to enlist the help of other League ships. Malcolm's improvised repairs burn out shortly past the Moon, so Duncan's knowledge of the masses of the planets is put to use by Malcolm's pocket calculator to plot their course to the outer solar system.\nThe ship successfully reaches a League squadron, and they set out to attack the Legion. Rameses uses the computer in the League base to calculate superior strategies and begins to destroy the League ships. One of the robots in the base is only damaged, not destroyed, and re-takes command. He causes the extermination unit to destroy itself, and then directs Rameses' ships to collide with each other. His fleet destroyed, the super-weapon eliminated, the League pleads with Rameses to surrender. When Rameses discovers his sun has gone supernova during the battle, he crashes his ship into the Moon.\nDuring the action the extermination unit had passed over Toronto, causing Duncan's wife (Helen Shaver) to slash her wrists. The League races to Duncan's home and easily revives her."}