{"mid": "Starstruck", "IMDB_id": "tt0084728", "title": "Starstruck", "plot": "Christopher Wilde (Sterling Knight) is a famous pop star and teen idol, whose music is very successful all around the world. Sara Olson (Maggie Castle) of Kalamazoo, Michigan is an obsessive fan of Christopher Wilde who seeks to use her family's trip to Hollywood, California to visit her widowed grandmother as an opportunity to meet him (Starstruck) for spring break. Christopher, meanwhile, is on the brink of landing a movie deal and has agreed to remain out of the tabloids in order to prove that he is serious about landing the role.\nOnce in California, Sara convinces her younger sister Jessica (Danielle Campbell), to accompany her to a nightclub where he is rumored to be delivering a surprise performance for his pseudo-girlfriend Alexis Bender (Chelsea Staub). Sara leaves Jessica outside the club to watch the car while she goes inside in a futile attempt to meet Christopher (Shades).\nFed up with waiting, Jessica leaves the car in search for Sara and meets Christopher when he hits her in the head while opening a door. Eager to avoid being caught by the paparazzi, Christopher takes Jessica to a hospital to be examined, then brings her to his house so that he can make an appearance for the film director (Hero). He then brings Jessica home, and Jessica allows him to stay in her grandmother's garage for the night when he learns the paparazzi have followed him.\nThe next day Sara brings Jessica to Malibu in the hopes of running into Christopher there. Sara goes off to sit down on the beach, but Jessica recognizes Christopher's disguise and sits down with him. The two are forced to make a quick exit from the beach when the paparazzi arrive; once they get away, Christopher shows Jessica around Los Angeles (Something About The Sunshine).\nWhile attempting to return to Malibu, they are again spotted by the paparazzi, but manage to elude them by driving off the main road, losing Jessica's grandmother's car in a mud pool quicksand in the process. While walking back to Malibu, they get into a heated argument, with Jessica calling Christopher's life \"fake\". He tries to convince her his life is real. Christopher drags Jessica into a river and they forget their argument. Eventually, Christopher confides that he enjoyed hanging out with Jessica because she was not actually asking for anything from him. She agrees that it was fun having him alone.\nWhen they return to the beach they almost kiss, but are interrupted when Christopher panics about being recognized. Christopher tells Jessica that no one can know what happened between them that day, telling her that the paparazzi would ruin her life as well as his (Hero (Reprise)). Heartbroken and angry, Jessica returns home to Kalamazoo with her family, but not before the paparazzi establish a connection between her and Christopher.\nBack in Kalamazoo, Jessica watches Christopher tell a talk show host that he had never met her. Angry with the way the paparazzi forced Christopher to lie and hide himself from the real world, she confronts the paparazzi camped outside her house, and tells them that they destroyed him and that she \"never met [the Christopher that they were all so obsessed with].\" Christopher's best friend, Stubby (Brandon Mychal Smith) convinces Christopher to make his own choices. Alexis finds out that Christopher has been with someone who is not famous, and she breaks up with him. Christopher realizes that he is free to pursue Jessica. Christopher then proceeds to fire his parents as his managers and turn down the movie role that made him lie and lose himself in the tabloids.\nAfter Sara's equally Christopher-obsessed friend A.J. (Abbie Cobb) viciously insults Jessica for what she said on television, Sara kicks A.J. out of the house and offers to take Jessica to the school dance with her. Jessica accepts, and Sara helps her get ready for the dance. At the dance, Christopher makes an appearance and apologizes to Jessica through a song (What You Mean To Me). She wants more than just his apology though.\nWhen the paparazzi appear at the dance, he tells them that he was the one that lied and says he is crazy about Jessica. She smiles and accepts his apology, and he becomes her boyfriend. He gives her a pair of \"Christopher Wilde\" sunglasses (Party Up). Starstruck is a disney movie"}