{"mid": "Stargate", "IMDB_id": "tt0111282", "title": "Stargate", "plot": "Egyptologist and linguist Daniel Jackson, Ph.D. is invited by Catherine Langford to translate Egyptian hieroglyphs on cover stones that her father had unearthed in Giza, Egypt in 1928. Jackson is taken to a U.S. Air Force installation, and told the project is classified information by its commander Special Operations Colonel Jack O'Neil. Jackson determines that the hieroglyphs refer to a \"stargate\" which uses constellations as spatial coordinates. On this revelation, Jackson is shown that the base has this Stargate, also discovered by Langford's father. They use Jackson's coordinates to align the Stargate's metal ring with markings along its outside, and once all seven are locked in, a wormhole opens, connecting the Stargate with a distant planet. Jackson joins O'Neil and other soldiers as they pass through the wormhole, though expresses concern at a nuclear bomb they brought as a last resort.\nOn the arid desert planet, they find themselves in a pyramid-like structure. Jackson locates the Stargate and its controls, but lacks the coordinates to return home. O'Neil orders some men to stay behind to guard the Stargate. Nearby, they discover a tribe of humans working to mine a strange mineral from the planet. Jackson is able to communicate with them as they speak a variation of Ancient Egyptian, and finds the tribe sees them as emissaries of their god Ra (Jaye Davidson). The tribe's chieftain Kasuf presents Jackson with his daughter Sha'uri as a gift, and though Jackson initially refuses her, he becomes romantically attached to her. O'Neil befriends the teenaged boy Skaara and his friends, in part because Skaara reminds him of his long-deceased son. Through hidden markings and discussions with the tribe, Jackson learns that Ra is an alien being who had come to Earth during the Ancient Egyptian period, looking to possess human bodies to extend his own life. Ra enslaved these humans and brought some to this planet through the Stargate to mine the mineral that is used in the alien technology. The humans on Earth revolted, overthrew Ra's overseers, and buried the Stargate to prevent its use. Ra forbade the humans in the tribe from becoming literate, fearing another revolt. During this investigation, Jackson comes across a cartouche containing six of the seven symbols for the Stargate, but the seventh has been broken off.\nThat night, Ra's ship lands atop the pyramid structure, and O'Neil's men there are captured or killed by Ra's soldiers. When Jackson, O'Neil, and the other men return, they end up in a firefight against Ra's soldiers. Jackson is killed and the others captured. Ra places Jackson's body in a sarcophagus-like device that regenerates him. Ra then explains to Jackson that he has found the nuclear bomb the humans brought and has used his alien technology to increase its explosive power a hundred-fold, and threatens to send it back through the Stargate. Ra orders the human tribe to watch as he prepares to execute Jackson and the others to demonstrate his power, but Skaara and his friends create a diversion that allows Jackson, O'Neil, and the others to escape. They flee to nearby caves to hide from Ra. Skaara and his friends celebrate, and Skaara draws out a sign of victory in a wall, which Jackson recognizes as the final symbol.\nO'Neil and his men aid Skaara in overthrowing the remaining overseers, and then launch an attack on Ra. Ra sends out fighter ships against the humans while he orders his ship to take off. The humans outside are forced to surrender to the fighter ships' pilots when they run out of ammo, but the rest of the tribe, having finally learned of their false gods, rebel against the pilots and overthrow them. Sha'uri is killed, but Jackson takes her body and sneaks aboard Ra's ship, using a teleportation system, leaving O'Neil to fight Ra's lead soldier. After Jackson places Sha'uri in the regeneration device. Ra discovers them, but O'Neil activates the teleportation system, killing Ra's lead soldier, and allowing Jackson and Sha'uri to escape. O'Neil realizes that Ra had rigged the bomb to prevent him from disarming it. O'Neil and Jackson decide to use the teleportation system to transport the bomb to Ra's ship. The ensuing blast destroys the ship in space. With the humans freed, the remaining team prepares to return to Earth, but Jackson tells O'Neil he plans to stay behind with Sha'uri and the others. O'Neil acknowledges Jackson's request and, with the others, enters the Stargate to return home.\n=== Director's cut ===\nThe director's cut had several scenes which were cut from the theatrical release. The first such scene took place immediately after the excavation of the Stargate in 1928 and showed petrified Horus guards near the cover stones; the producers had tried to introduce the idea that beings had attempted to come through the Stargate after its burial, but they cut the scene for time concerns."}