{"mid": "Star80", "IMDB_id": "tt0086355", "title": "Star 80", "plot": "In 1978, eighteen-year-old Dorothy Hoogstraten is working at a Dairy Queen in her hometown of Vancouver, British Columbia when Paul Snider, a brash, narcissistic, small-time scam artist and pimp, makes her acquaintance. He charms her into letting him take her to her high-school prom. Dorothy's mother is immediately suspicious of Paul, particularly his attempts to ingratiate himself with Dorothy's younger sister. At the dance, quick-tempered Paul stabs her snide ex-boyfriend with a pocketknife. Afterwards, however, he wins over Dorothy with his attention and flattery, until finally he gets her to agree to pose nude for Polaroid photographs. He then sends the pictures to Playboy, after forging Dorothy's mother's signature on an age consent form. Playboy invites Dorothy to come to Los Angeles to pose for a professional photographer.\nPlayboy founder and publisher Hugh Hefner is taken with Dorothy's beauty and innocence, and gives her a job as a \"Bunny\" at an L.A. Playboy Club. She then becomes Playmate of the Month for the issue of August 1979 under a new name, Dorothy Stratten. Paul pressures her into marrying him, which Dorothy agrees to, mostly out of gratitude. She is named Playmate of the Year for 1980, and begins an acting career with small film and television roles.\nPaul begins spending money they don't have, going as far as to purchase a Mercedes with the vanity license plate STAR 80. He squanders more of her money on failed business ventures and is evermore eclipsed by Dorothy's success, making him feel dejected. Paul begins coming to the Playboy Mansion, with or without Dorothy, which annoys Hefner. At a party at the Mansion, Dorothy catches the eye of movie director Aram Nicholas, whom Hefner wheedles into letting her read for a part in his upcoming film. Paul is convinced that Aram is sleeping with her, and harasses her at home and work. He hires a private investigator to follow her, who tells him that Dorothy and Aram are indeed sleeping together. Paul then buys a shotgun.\nPaul begs Dorothy for one last chance, but she insists that she is going to leave him. Disregarding Aram's plea for her to not see Paul again, she agrees to one last surreptitious meeting with her estranged husband at their house, hoping to placate him with a financial settlement. He first pleads with her not to leave him, then flies into a rage and rapes her. He picks up the shotgun and shoots Dorothy point-blank in the face, killing her. He then sexually violates her lifeless body before turning the gun on himself."}