{"mid": "StayingAlive", "IMDB_id": "tt0086361", "title": "Staying Alive", "plot": "Six years after a previous dance contest, Anthony \"Tony\" Manero, a former disco king, is now living in Manhattan. He lives in a flophouse and works as a dance instructor and a waiter at a dance club, and searches for a big break in the modern dance productions on Broadway. The break from his Brooklyn life, family, and friends seems to have matured Tony and refined his personality, including his diminished Brooklyn accent, an avoidance of alcohol and less use of profanity. Other attitudes remain unchanged, such as his disregard for his most recent girlfriend, the forgiving Jackie. Still immature, Tony maintains some of his other macho and childish double standards, such as seeing other women but offended if he sees Jackie with other men.\nTony watches a show which features Jackie as a dancer in the chorus, but focuses on the lead, a seemingly-wealthy English dancer, Laura. Tony pursues her with seduction in mind, and spends the night with her. He's annoyed when she dismisses him afterward, not understanding that she intended their encounter to be a one-night stand. Laura coldly justifies her treatment of him with a statement that \"Everybody uses everybody,\" and implies that Tony used her in order to get his dance role in her upcoming show.\nJackie is hurt when Tony breaks several promises to meet with her. Jackie is the vocalist for a local rock band in addition to her dance career. Unable to trust Tony, and tired of being disregarded when other women catch his eye, Jackie finally ends their personal relationship. She displays an apparent interest in her band's rhythm guitarist. Tony's wounded ego takes another blow in addition to his conflict with Laura.\nJackie, Tony, and Laura audition for the Broadway production Satan's Alley. Jackie and Tony land small roles and Laura is cast in the role of the lead female dancer.\nTony begins to realize how callous he's been to Jackie, and walks all the way from Manhattan to his old Bay Ridge neighborhood in Brooklyn in the middle of the night. When he walks past The 2001 Odyssey, he sees that the Discothèque which was his former Saturday night hangout is now a gay nightclub, and that's when realizes how much his life has changed in those six years since he left Brooklyn. When Tony goes to visit his mother, and apologizes for his selfishness and trouble-making ways of his youth, she points out that his selfish behavior as a teen was what helped him escape a dead-end life in Bay Ridge. Tony feels better after this and heads back to Manhattan to repair his relationship with Jackie. His hostility and distance from the arrogant Laura increase as the production progresses.\nTony decides to take a shot at replacing the male lead of \"Satan's Alley\" and asks Jackie to help him practice the number. Laura is disgusted when Tony succeeds and openly displays her resentment at having to partner him in the show. They can't hide their chemistry on stage despite her animosity, which pleases the show's director.\n\"Satan's Alley\" sells out and the cast takes the stage to a standing-room-only crowd. The first act is a success despite Tony's brash disregard for the script when he kisses Laura at the end of their number. Laura angrily retaliates by clawing Tony's face. The director blasts Tony backstage, telling him to take his personal war away from the production. Laura seems to offer a truce when she asks to see him after the show to \"clear things up.\" Tony now fully aware of her manipulative ways coldly tells her he has other commitments, and Laura snidely tells him \"you don't have it,\" presumably what it takes to be a star dancer.\nThe second act is a dazzling display of dance and special effects, and Tony suddenly abandons the script near the end of the show. He hurls Laura away and gives way to his anger in a solo dance. He finishes and holds out his hand to Laura with a command to jump. She halts amid Jackie's and the director's commands, but finally leaps in his arms for a climactic finish to the show. Their thrilled audience erupts into cheers and a standing ovation.\nTony celebrates with his jubilant cast mates and reconciles with Jackie. He says he's got to get out and what he really must do is \"strut\" in celebration. Tony Manero leaves the theater and struts through Times Square, beaming with his newfound success."}