{"mid": "SteelMagnolias", "IMDB_id": "tt0098384", "title": "Steel Magnolias", "plot": "Annelle Dupuy (Daryl Hannah), a reserved beauty school graduate, is hired by Truvy Jones (Dolly Parton) to work in her home-based beauty salon in northwestern Louisiana. At the same time, in another part of the neighborhood, M'Lynn Eatenton (Sally Field), and her daughter, Shelby (Julia Roberts), are preparing for Shelby's wedding, which is taking place later that day. They arrive, along with Clairee Belcher (Olympia Dukakis), the cheerful widow of the former mayor, to have their hair done. Suddenly, Shelby, who has type 1 diabetes, falls into a hypoglycemic state, but recovers quickly with the help of her mother's quick thinking. Later that afternoon, short-tempered, grouchy, and sarcastic Louisa \"Ouiser\" Boudreaux (Shirley MacLaine) arrives in the salon and questions Annelle about where she has moved from, forcing Annelle to reveal that her husband has recently left her while fleeing the police, taking all their money and their car. Moved by Annelle's emotional confession, Shelby invites her to the wedding, where Annelle meets Sammy (Kevin J. O'Connor), who is tending bar.\nSeveral months pass and Shelby returns to town to celebrate Christmas. During the festivities, she announces that she and her husband, Jackson Latcherie (Dylan McDermott), are expecting their first child. Shelby's father Drum (Tom Skerritt) is thrilled, but M'Lynn is too worried to share in the joy. Truvy, Annelle, and Clairee had originally thought that Shelby couldn't have children, but on the night of the big announcement, M'Lynn clarifies for them that the doctors said Shelby shouldn't have children because of her health. It becomes clear that Shelby could actually die due to pregnancy complications related to her diabetes. Unable to give her any words of wisdom, Truvy suggests they focus on the joy of the situation: Jackson and Shelby's first child, as well as Drum and M'Lynn's first grandchild, as well as their sons, Jonathan (Jonathan Ward) and Tommy's (Knowl Johnson), first niece or nephew. M'Lynn agrees, saying that nothing pleases Shelby more than proving her wrong.\nShelby successfully delivers a baby boy, Jackson Jr., but begins showing signs of kidney failure and starts dialysis around the time Jackson Jr. turns one. M'Lynn successfully donates a kidney and Shelby seemingly resumes a normal life. Clairee and Ouiser offer to make sure that M'Lynn's husband, Drum, Jonathan, and Tommy have enough food to last until M'Lynn returns home after the transplant. Later, on Halloween, Ouiser, Clairee, Truvy, and M'Lynn throw Annelle a surprise wedding shower, as she is now engaged to Sammy. Shelby is unavailable to attend due to a conflicting schedule with her nursing job, and is later found by Jackson unconscious on the porch of her house. Shelby is rushed to the hospital, where it is determined that her body rejected the new kidney, and she is now in a coma. The doctors inform the family that Shelby is likely to remain comatose indefinitely, and they all jointly decide to take her off life support. At the funeral, after the other mourners have left, M'Lynn breaks down in hysterics in front of Ouiser, Clairee, Truvy, and Annelle, but is comforted by them.\nLater, at the wake, M'Lynn begins to accept her daughter's death and focuses her energy on helping Jackson raise Jackson Jr. Annelle, now married and pregnant, asks M'Lynn if she could name her own baby after Shelby, since Shelby was the reason Annelle and Sammy met. M'Lynn gives her blessings and assures Annelle that Shelby would've loved it. Months later, on Easter morning, Annelle goes into labor during an Easter egg hunt, is rushed to the hospital by Truvy and her husband Spud (Sam Shepard), and another life begins."}