{"mid": "StElmosFire", "IMDB_id": "tt0090060", "title": "St. Elmo's Fire", "plot": "Recent Georgetown University graduates Alec, his girlfriend Leslie, Kevin, Jules, and Kirby are waiting to hear about the conditions of their friends Wendy, a sweet-natured girl devoted to helping others, and Billy, a former frat boy and now reluctant husband and father, after a car accident. At the hospital, Kirby sees a female medical student named Dale, with whom he has been infatuated since college.\nThe group gathers at their favorite college hangout, St. Elmo’s Bar. Billy has been fired from the job Alec helped him secure and his marriage is unstable. At their apartment, Alec pressures Leslie to marry him, but she is convinced they are not ready. Kirby is telling Kevin of his love for Dale when Billy shows up, asking to spend the night as he cannot deal with his wife.\nKevin worries about his romantic life when Jules accuses him of being gay and loving Alec. When he visits Alec and Leslie for dinner, Alec confesses to Kevin that while buying lingerie for Leslie he had sexual intercourse with the saleswoman.\nBilly and Wendy get drunk together and Wendy reveals that she is a virgin. She and Billy kiss but Wendy insists they just remain friends, especially since she realizes Billy is taking advantage of her crush on him.\nDuring Halloween at St. Elmo’s Bar, Jules reveals to a disapproving Leslie that she is having an affair with her married boss. Billy sees his wife with another man in the crowd and attacks him. Billy is thrown out of the bar but reconciles with his wife. The girls confront Jules about the affair and her reckless spending but she insists that everything is under control.\nKirby takes a job working for Mr. Kim, a wealthy Korean businessman, and invites Dale to a party he is holding at Mr. Kim’s house. Wendy arrives with Howie, a boy her parents set her up with. Alec announces that he and Leslie are engaged, upsetting Leslie. She confronts him about her suspicions of his infidelity and the two break up. Alec is also angry with Kevin, who he believes confessed everything to Leslie. After the party, Jules gives Billy a ride home. As she is about to confide in him, Billy makes a pass at her. Furious, Jules throws him out of her car.\nStill pursuing Dale, Kirby drives to the ski lodge where she is staying but learns she has a boyfriend. His borrowed car becomes stuck in the snow and Dale and her boyfriend invites him to come inside. The next morning, as Kirby prepares to leave Dale’s cottage, Dale tells him she is flattered by his affections. He kisses her, and she does not resist. Kirby then takes a photo with Dale and departs the lodge, happy.\nLeslie goes to Kevin’s place to stay the night after the breakup and discovers photographs of her. Kevin confesses his love for her, and the two sleep together but the next morning, Alec comes by to apologize to Kevin for attacking him the night before. Alec is shocked to find Leslie there and the two argue over his infidelity.\nWendy meets her father at a café and announces she wants to be independent from her family and move into her own place. Jules has been fired from her job and fallen behind on her credit card payments; as a result, her possessions have been seized. Jules locks herself in her apartment and opens the windows, intending to freeze to death. The friends attempt to coax her out, but she is unresponsive. Kirby fetches Billy, who landed a job at a gas station courtesy of Kevin, to calm Jules down. Billy convinces Jules to come back out.\nWendy moves into her own place, where Billy visits and informs her that he is getting a divorce and moving to New York City. The two make love as a going away present. At the bus station, the group gathers once more to say goodbye to Billy. Billy urges Alec to make up with Leslie but Leslie declares that she does not want to date anyone for a while. Alec and Kevin make up and the group decides to get brunch. However, they decide not to go to St. Elmo's bar and instead choose Houlihan's because there are \"not so many kids\" there."}