{"mid": "StewieGriffinTheUntoldStory", "IMDB_id": "tt0385690", "title": "Stewie Griffin: The Untold Story", "plot": "=== Opening ===\nThe DVD version shows the premiere of the film, where celebrities such as Drew Barrymore and her date the Kool-Aid Man, the Greased-Up Deaf Guy, the Evil Monkey, David Bowie, and the Griffin family. Everyone goes into the theatre where Channel 5 reveals they have hired Glenn Quagmire to provide them with a bootleg copy of the film. We then see an advertisement for a new movie, People Who Look Like They Never Sleep... starring Susan Sarandon and Vince Vaughn, and another film, The Littlest Bunny, made by Disney and featuring music by Randy Newman. After this, the film begins.\n=== \"Stewie B. Goode\" ===\nWhen the Griffins go swimming at the Quahog Community Pool, Peter tries teaching Stewie to swim and attempts to toss him into the pool, despite Stewie begging to be put down. Lois takes Stewie to swimming lessons, where Stewie meets Brad, a child about his age who is the \"Star Swimmer.\" In jealousy, Stewie does everything he can to steal Brad's glory. As a last resort he tries to kill him by rigging a lifeguard chair with dynamite and luring Brad beneath it with marzipan; however, Stewie's detonator malfunctions, blowing up the legs of chair and causing it to fall on Stewie himself. He ends up in hell with Steve Allen. When Stewie is revived by Lois, he believes it is a sign for him to be a good boy.\nAfter Peter learns that the new video store will not let him rent pornography, he vents his frustration in front of newscaster Tom Tucker, who gives him a job at Quahog 5 hosting a segment called \"What Really Grinds My Gears,\" in which he rants about things that bother him. Peter becomes extremely popular, overshadowing Tucker, who is fired after attempting to distract Peter during filming.\nStewie attempts to be a good boy by smothering Brian with affection. Brian finally goads Stewie into reverting to his old, violent ways by crushing a spider web and eating the spider. Stewie starts drinking heavily, following Brian's way of coping. Brian attempts to cure Stewie of his alcoholism by taking him out for a night of drinking at the Drunken Clam. While drunk, Stewie crashes Brian's car through the wall of the bar. Knowing Stewie is Peter's son, Tom takes advantage of the situation and presents footage of the accident at the news station. Peter is fired and Tom is rehired as the anchor. The next morning, Stewie has a hangover and realizes his lonely existence in the world, wishing that there were someone else to whom he could relate. At the end Stewie says it is good that he stopped drinking now, so that it would not have any repercussions later in life.\n=== \"Bango Was His Name, Oh!\" ===\nPeter buys a TiVo. While watching it, Stewie spots a man in San Francisco on the news that has the same face and hairstyle as him. Stewie then believes that he may be his true father. Learning that Quagmire is going on a cross-country tour in which he plans to have sex with a different woman in every state of America, Brian and Stewie hitch a ride in his RV. At a motel in New Jersey, Quagmire is handcuffed to a bed and mugged by the latest woman. Then Stewie and Brian drive off with his RV leaving Quagmire at the motel.\nMeanwhile, Peter and Lois are trying to get intimate, but are constantly interrupted by Chris and Meg. To solve this problem, Peter and Lois decide to teach the children how to find dates. After several \"lessons\", Peter and Lois send them to the mall. However, Lois is concerned that people will think they're bad parents simply because they wanted their children out of the way.\nStewie crashes the RV in the desert after going insane from ingesting an entire bottle of \"West Coast Turnarounds\". After wandering through the desert, Stewie breaks down crying and nearly decides to give up until Brian encourages him to keep going. The two manage to get a rental car and arrive in San Francisco. Stewie mysteriously leaves Brian and confronts the man from TV on a cable car, and is shocked to discover that the man is actually himself from 30 years in the future.\n=== \"Stu and Stewie's Excellent Adventure\" ===\n\"Stu\", as Stewie's future self is called, tells Stewie that he is on vacation (Stu explains that rather than just simply travel to different places in the world, people from his time travel to other time periods). Stu reveals he cannot tell anyone about his time and leaves for his time, Stewie stows away with him. Stewie learns he will not become ruler of the world but rather \"a 35-year-old Parade magazine-reading virgin\". Stu passes off Stewie as a Nicaraguan boy named Pablo to everyone until Stu can send him back to his own time. Stewie learns he will work at the Quahog Circuit Shack while living with Rupert, his childhood teddy bear, in a filthy apartment. Disgusted with the way his life will turn out, Stewie remodels Stu's apartment and gets him to lose his virginity to his co-worker, Fran (though he spends more time crying than having sex). The next day, Fran tells everyone about the humiliating experience, costing Stu his job for having relations with a co-worker. Returning home, he finds that his apartment is in flames due to the stress-relieving candles Stewie put there.\nHis life now ruined, Stu laments the day of his near-death experience at the community pool, revealing that memories of the experience will re-surface when Stewie is 20 years old, causing him to repress most of his major emotions and preventing him from taking any risks. They visit Lois (who reveals that she had recognized \"Pablo\" as her \"little Stewie\" immediately) at a retirement home for a loan and get a new time travel watch. Stewie travels back in time to the day of the accident and prevents himself from getting crushed by the chair. However, future Stewie gets vaporized by present Stewie, thus creating a paradox and skipping the formalities of Future Stewie disappearing eventually. As the family packs up and heads for home, Meg bids farewell to a boy to whom she's been talking to, considering how much she likes his name: Ron.\nDuring this episode, it's revealed that (1) Meg will have a sex change after college and become a man named Ron, (2) Brian will die after eating chocolate out of the garbage (Brian was seen in heaven with Ernest Hemingway, Vincent van Gogh, and Kurt Cobain, who all committed suicide by shooting themselves: Hemingway because he was overwhelmed by his genius; van Gogh because he couldn't reconcile his feelings with society's feelings; and Cobain because he didn't want to live to see his music be bastardized by corporate greed) and (3) Chris will become a police officer and marry a foul-mouthed chain smoker named Vanessa, who forces Peter and Lois into a rest home so she can inherit their home. However, while going back in time to prevent the tower from falling, Stewie, on future Lois's advice, travels back in time to Chris' wedding and kills Vanessa, thus creating a paradox. If this episode is viewed independently of the film version, the beginning is a parody of 24, with Kiefer Sutherland saying \"Previously on Family Guy...\", a reference to 24.\n=== The Afterparty ===\nIn another DVD addition, Tricia Takanawa talks with the fans and asks them how they liked the film, receiving completely negative feedback. After this, Tricia asks the family what they did during the show's cancellation from Seasons 3 to 4. Peter talks about how he did several part-time jobs which involved wearing costumes, although he always wound up fired because he kept peeing in them because he thought it was like an astronaut suit, but when he finally did become an astronaut, he did not believe he had to pee in the suit and almost died. Brian talks about how he met his fans and competed in the Iditarod Dog Race, only to get very tired and lose. Lois talks about how she became a prostitute and shows video footage of her trying to beat up a policemen and of her having an argument in a convenience store over her wanting to taste the chips. Meg talks about entertaining the U.S. Navy by singing and dressing like Cher for \"If I Could Turn Back Time\". However, she was actually repulsing the Navy-men causing them to abandon and sink the ship. Stewie talks about his appearances in those \"damn\" talk shows. Chris then talks about his guest appearance on The West Wing."}