{"mid": "StitchTheMovie", "IMDB_id": "tt0348124", "title": "Stitch! The Movie", "plot": "The film starts out with ex-Captain Gantu on his new spaceship (his original got destroyed in the first film), being hired by Hämsterviel to retrieve the other 625 experiments.\nMeanwhile on Earth, Stitch is still not fitting in and causes another disaster. Lilo Pelekai tries to encourage him by saying he's one-of-a-kind, comparing him to Frankenstein's monster. Naturally, that just makes him feel worse. Suddenly, a crash is heard from below. Running downstairs, the pair encounters Gantu, breaking into their home. In the ensuing chaos, Stitch thrusts his belly out at Gantu, only to be blasted into a net. Gantu finds and takes a blue pod with the number 625 on it before abducting Jumba for interrogation. Lilo and Stitch manage to take Jumba's ship to chase Gantu into space and engage him in battle, before being defeated and falling back towards Earth.\nBack at the house, Lilo, Stitch and Pleakley find the container Jumba was hiding. Pleakley realizes that these are the other 625 experiments, in dehydrated form. He warns them not to tell anyone or put the experiments in water. Deliberately disobeying Pleakley, Stitch and Lilo retrieve the container and hydrate Experiment 221, who promptly escapes.\nMeanwhile, Jumba is being held captive on the ship of Dr. Hämsterviel, who is surprisingly a small gerbil/poodle/rabbit-like alien. Unable to intimidate Jumba, Hämsterviel activates Experiment 625, who has all of Stitch's powers, to attack him. Fortunately for Jumba, while 625 has all of Stitch's powers, he's an incredibly lazy coward who prioritizes sandwiches above all else.\nMeanwhile, Pleakley is able to come into contact with Hämsterviel's ship via telephone. Hämsterviel tells Pleakley that he wants a ransom of the other 624 experiments in return for Jumba. When Pleakley informs the other family members what the ransom is, Nani proceeds to call Cobra Bubbles while Lilo and Stitch go out to find 221. When Cobra arrives the next morning, he seems to already know about what happened. Meanwhile, Lilo and Stitch finally catch a troublesome Experiment 221 at a hotel.\nThe rendezvous time arrives and Pleakley and Cobra show up with the container, not knowing that it contains only 623 experiments. Pleakley hands the container over to Hämsterviel, who is shocked to find that one is missing. Lilo then shows up with Experiment 221 trapped in a glass vase. Announcing that she has named it \"Sparky\", she says that Sparky is part of Stitch's, and thus her, ohana. Hämsterviel tells her to give him the experiment or Jumba will be shot dead.\nAfter several moments of thinking and hearing Cobra, Pleakley, Jumba and Hämsterviel persuading them, Lilo and Stitch set Sparky free and break Jumba from his bonds. On Cobra's signal, the Grand Councilwoman's ship rises out of the nearby ocean and aims several guns at Hämsterviel. Lilo protests, saying that Hämsterviel has the other experiments and Sparky overhears.\nSparky proceeds to use his electrical abilities to blow the power on the Councilwoman's ship, while Hämsterviel and Gantu climb back aboard their own ship with the experiments. In a last attempt to stop Hämsterviel, Lilo and Stitch stow away on it as it leaves, with Sparky following.\nLilo and Stitch manage to swipe the container with the other experiments in it. The struggle for the container between Lilo, Stitch and Gantu results in releasing the dehydrated pods to rain down and scatter throughout Hawaii. Having captured the heroes, Hämsterviel tells his plans to clone Stitch a thousand times over and orders Gantu to do what he wants with Lilo. While Gantu puts Lilo in a teleportation pod to send her to an intergalactic zoo, Stitch is strapped to a weight just heavier than he can lift.\nWatching as Stitch tries to avoid being vivisected by a laser for the cloning process, Sparky shows that he has reformed by causing the cloning machine to short-circuit. He then breaks Stitch free and the two strap Hämsterviel to the device before rescuing Lilo.\nHaving locked Hämsterviel in handcuffs, Lilo, Stitch, and Sparky short-circuit Gantu's ship, causing it to crash near a waterfall on Kauai. Landing Hämsterviel's ship back at the rendezvous point, they give Sparky a new home powering the Kilauea Lighthouse, which hasn't been running in years because powering it was very expensive. They then persuade the Grand Councilwoman to let them rehabilitate the other 623 experiments. The Councilwoman places Hämsterviel under arrest, and Jumba whispers to Pleakley that he has plans for making 627. At the end of the movie, Experiments 202, 529, 455, 489, and 390 are activated."}