{"mid": "StoneCold", "IMDB_id": "tt0431420", "title": "Stone Cold", "plot": "Jesse Stone (Tom Selleck) is the police chief of Paradise, Massachusetts, a small coastal town north of Boston. A former homicide detective in Los Angeles, Jesse was fired from the LAPD because of a drinking problem that began following his divorce. He was hired for the Paradise position by the corrupt president of the town council who thought he would be easy to control. After five years, Jesse is still in contact with his ex-wife Jenn, who calls him regularly. He also has a relationship with a beautiful lawyer named Abby Taylor (Polly Shannon), who sits on the town council. Although their relationship is mainly physical, they have a genuine affection and concern for each other.\nOne cold November night, a body is discovered on a rocky shoreline by Jesse's deputy, Officer Luther \"Suitcase\" Simpson (Kohl Sudduth). The victim was shot twice in the heart with a .22 caliber weapon. With no suspect, motive, or weapon, Jesse begins his investigation by gathering the names of gun owners in Paradise who have registered a .22. He also adopts the victim's loyal dog, Reggie. Soon a second victim is discovered in a parking lot—also shot twice in the heart by a .22. Jesse orders photographs taken of all the vehicles in the lot and their license plates, suspecting that the killer or killers are still in the area. Following a third killing with the same modus operandi, an eyewitness is found who saw a red Ford Explorer driving away from the scene of the crime. Jesse checks the photos from the parking lot of the second murder and discovers a red Ford Explorer, registered to someone who is also on the list of .22 caliber gun owners in Paradise, Andrew Lincoln.\nBrianna and Andrew Lincoln are middle-aged thrill killers, independently wealthy from a patent Andrew obtained for an optical scanner he invented while practicing medicine. The couple moved to Paradise and began selecting random people and murdering them while videotaping their crimes. Later they find erotic pleasure in watching the videos of the murders while having sex. Jesse and Luther pay the Lincolns a visit and briefly interview the couple, who show interest in the murders. As they leave, Jesse tells Luther that the Lincolns are the killers.\nMeanwhile, Jesse investigates the rape of a high school girl, Candace Pennington (Alexis Dziena), who refuses to talk about the incident and whose parents refuse to report the crime, to avoid scandal. Assisted by Officer Molly Crane (Viola Davis), Jesse discovers the identity of the three boys who raped Candace. After one of the rapists, Bo Marino (Shawn Roberts), is brought in on drug charges, Jesse discovers photos in the boy's possession of the naked Candace being raped. Bo's father and his attorney arrive at the police station, but the boy spends one night in jail. After Candace agrees to testify against the boys, Bo and his father storm into Jesse's office and force a confrontation, that ends with Candace's father knocking both Bo and his father to the floor. The attorneys for the three rapists agree to have their clients plead guilty, in exchange for sentences of \"community service\".\nWhile Jesse struggles to find evidence on the Lincolns, the murderous couple begin to stalk Abby Taylor. One afternoon, while walking through a park trying to reach Jesse on her mobile phone, Abby is murdered by the Lincolns in cold blood. Devastated by his girlfriend's murder, Jesse devises a plan that will encourage the killers to attempt to kill him. He goes to the Lincolns' home and returns the .22 rifle. As they taunt the police chief with subtle talk of the murders, Jesse makes it clear that he knows they are the killers.\nJesse calls Andrew Lincoln and asks to meet later that night at the parking lot scene of the second crime and Andrew agrees. Jesse suspects that the Lincolns have other plans and while Molly and Luther wait at the parking lot, Jesse waits outside Candace's house, knowing the killers intend to kill Candace. The Lincolns show up at Candace's house and enter the living room where a tape recording of Candace and her parents is playing. Just as they realize they've been set up, Jesse enters the room. Brianna pulls out two .22 caliber pistols and shoots Jesse in the chest. Knowing of their ritualistic technique of shooting their victims in the heart, Jesse has come prepared with a bulletproof vest. Jesse returns fire and shoots Brianna dead. He turns to Andrew and tempts him to pick up his gun, but the cowering murderer refuses, saying no court will give him the death penalty and that he will outlive the police chief. Jesse responds by punching him in the face.\nAfterwards, Jesse returns to his house by the water and pours himself a drink. His wife calls and begins to leave a message on the answering machine, but Jesse doesn't pick up the phone. Instead he walks outside and watches the tide beneath the evening sky."}