{"mid": "StrangerThanParadise", "IMDB_id": "tt0088184", "title": "Stranger Than Paradise", "plot": "The film is a three-act story about Willie (John Lurie), who lives in New York City, and his interactions with the two other main characters, Eva (Eszter Balint) and Eddie (Richard Edson).\nIn the first act, Willie's cousin Eva comes from Hungary to stay with him for ten days because Aunt Lotte, whom she will be staying with, will be in the hospital. Willie at first makes it clear that he does not want her there. He even orders Eva to speak English for the ten-day period, not Hungarian. However, Willie soon begins to enjoy her company. This becomes especially true when Eva steals food items from a grocery store and gets a TV dinner for Willie, \"You're alright.\" He ends up buying her a dress, which she later discards. After ten days, Eva leaves, and Willie is clearly upset to see her go. Eddie, who had met Eva previously, sees her right before she goes.\nThe second act starts a year later and opens with a long take showing Willie and Eddie winning a large amount of money by cheating at a game of poker. Willie decides, because of all the money they now have, to leave the city. They decide to go to Cleveland to see Eva. However, when they get there they are just as bored as they were in New York. They end up tagging along with Eva and a friend, Billy, to the movies. They play cards with Willie and Eva's aunt. They eventually decide to go back to New York.\nThe final act begins with Willie and Eddie, on their way back to New York, deciding instead to go to Florida. They turn around and \"rescue\" Eva. The three of them get to Florida and get a room at a motel. The two men leave Eva in the Motel-room and end up losing all of their money on dog races. Eva wanders outside in the windy bleak rainy afternoon to the beach--which appears not much more appealing than the windy bleak snowy Lake Erie scene from which they fled, in Cleveland. When they come back Eva is annoyed. At this point, Willy and Eddie decide to go back and bet on horse races. Willie refuses to let Eva come along, so she goes out on the beach for a walk. Given her flamboyant wide-brimmed straw hat, she is mistaken by a drug carrier to be a dealer waiting to be paid, and is given a large sum of money. She goes back to the motel, leaves some of the money for Willie and Eddie, and writes them a note explaining that she is going to the airport. Willie and Eddie, having won all of their money back at the horse races, return to the motel, and find Eva is gone. Willie reads her note and they go to the airport to stop her from leaving. We see Eva conversing with the airline employee about various options for flying to Europe, ending with a mention that there is a plane leaving in 44 minutes for her home city of Budapest. She appears indecisive. When Willie and Eddie get to the airport, Willie conceives a plan: buy a ticket to Budapest, get on the plane, and convince Eva to stay in the United States. The second to last shot shows Eddie outside watching the plane flying overhead, lamenting that Willie was apparently not able to get off the plane and that now both Willie and Eva are headed to Budapest. The final shot, however, shows Eva back at the motel, returning to an empty room, toying with the striped straw hat."}