{"mid": "StrangersOnATrain", "IMDB_id": "tt0044079", "title": "Strangers on a Train", "plot": "Amateur tennis star Guy Haines (Farley Granger) wants to divorce his vulgar and promiscuous wife Miriam (Laura Elliott), so he can marry the elegant Anne Morton (Ruth Roman), the daughter of a senator, and hopefully have a career in politics. On a train, Haines accidentally meets Bruno Anthony (Robert Walker), who recognizes Guy from the sports pages and knows about his situation from the gossip pages. Bruno tells Guy about his idea for the perfect murder scheme: the two should \"swap murders\". Bruno will kill Miriam, and, in exchange, Guy will kill Bruno's hated father. Each murderer will kill a perfect stranger, having no identifiable motive, so neither will be suspected. Guy does not take Bruno's suggestion seriously; he humors Bruno by pretending to find it amusing, but Bruno interprets Guy's response as agreement to the scheme. Guy lets Bruno light a cigarette with his (Guy's) monogrammed cigarette lighter; instead of returning it, Bruno puts it in his own pocket.\nGuy meets with Miriam, who is pregnant by someone else. She tells him that she is no longer willing to agree to a divorce. She threatens to follow Guy to Washington, D.C. and cause a scandal. Guy calls Anne with the bad news and, speaking figuratively, tells her he would like to \"break [Miriam's] neck\"...that he could \"strangle her.\" Meanwhile, Bruno follows Miriam and her two beaux to an amusement park, stalks her through various rides, and strangles her to death on the \"Magic Isle\". Later, Bruno tells Guy that Miriam is dead and that Guy must honor his part of the deal and kill Bruno's father. Bruno sends Guy his house key, a map to his father's room, and a pistol.\nSenator Morton, Anne's father, (Leo G. Carroll) informs Guy that his wife has been murdered. The police question Guy; his alibi, that he was on a train with another passenger at the time of the murder, fails because the police examine the train schedule and determine that he could have left the train in time to commit the murder, and then completed his trip on another train. The police do not arrest Guy, but assign a police escort to ensure he does not flee while they continue to investigate.\nTo pressure Guy into fulfilling his obligation, Bruno introduces himself to Anne. Soon after, Bruno appears at a party at Senator Morton's house. To amuse another guest (Norma Varden), Bruno demonstrates how to strangle someone by playfully putting his hands around her neck. His gaze falls upon Anne's sister Barbara (Patricia Hitchcock), who physically resembles Miriam. Her resemblance to Miriam triggers a flashback. Staring at Barbara, he begins actually strangling the guest, and then blacks out. Barbara tells Anne: \"His hands were on her throat, but he was strangling me.\" Her suspicions aroused, Anne confronts Guy, who tells her the truth about Bruno's crazy scheme.\nGuy pretends to agree to Bruno's original plan. He creeps into Bruno's father's room hoping to warn him of his son's murderous intentions, but the father is away, and Bruno is waiting for Guy there. Guy tries, unsuccessfully, to persuade Bruno to seek psychiatric help. Bruno responds by threatening to punish Guy for betraying him. He menacingly reminds Guy that he, Bruno, is \"a very clever fellow\".\nAnne visits Bruno's house and attempts to explain to his befuddled mother (Marion Lorne) that her son is responsible for a murder, but the demented woman does not believe her. Bruno tells Anne that he has Guy's cigarette lighter and intends to incriminate Guy by planting it at the amusement park. Anne and Guy devise a plan for Guy to finish his tennis match quickly, evade his police escort, and reach the amusement park first and prevent Bruno from planting the lighter.\nGuy eventually wins the long match at Forest Hills, then, eluding the police, heads for the amusement park. Bruno is also delayed when he accidentally drops Guy's lighter down a storm drain and has to recover it. Guy arrives at the amusement park. Bruno stays out of sight until sunset when he can plant the lighter on the \"Magic Isle\". A worker recognizes him from the night of the murder and informs the police. Guy catches up to Bruno, and they fight on the park's carousel. Thinking Guy is trying to escape, a police officer shoots at him, but his shot misses and kills the carousel operator instead. The dead man falls onto the carousel's control panel and the carousel spins wildly out of control and crashes. Bruno is mortally injured. The worker who recognized Bruno tells the police chief that Guy is innocent. Guy tells the police that Bruno was attempting to plant Guy's lighter at the murder scene. Bruno lies to the police, but, as he dies, his fingers open to reveal Guy's lighter in his hand.\n=== U.S. version ===\nIn the American version of the movie, a final scene shows Guy reunited with Anne on a train home. A minister, who is also a tennis fan, recognizes Guy and attempts to strike up a conversation, but Guy, hardened by his traumatic experience, turns away coldly and leaves with Anne, without replying to the eager fan."}