{"mid": "StrikingDistance", "IMDB_id": "tt0108238", "title": "Striking Distance", "plot": "Thomas Hardy, a Pittsburgh Police homicide detective, has broken the ranks by informing on his partner and cousin, Jimmy Detillo, for using excessive force. En route to the Policemen's Ball with his father, Vince Hardy, the ball is postponed after a call indicating a serial killer nicknamed the Polish Hill Strangler has been spotted. As Tom and Vince pursue the killer's vehicle, the vehicles collide and both roll down an embankment. When Tom regains consciousness, he learns his father has been shot dead and the killer has escaped. Police arrest a criminal named Douglas Kesser as the Strangler. Later, rather than go to prison, Jimmy climbs to the top of the 31st Street Bridge and jumps off. His body is never found.\nTwo years later, Tom is drinking heavily and has been reassigned to the River Rescue Squad. His cousin Danny, Jimmy's brother, has stepped down from the force and also drinks heavily. Called to the scene of a body dump, Tom finds the victim is an ex-girlfriend. Tom is assigned a new partner, Jo Christman, who learns from District Attorney Frank Morris that Tom had been demoted after telling a television reporter that he believed the Polish Hill Strangler was a policeman.\nA nurse is abducted. Tom receives a phone call similar to ones left by the Polish Hill Strangler: the nurse screams before she is shot and the phone goes dead. Detective Eddie Eiler, who hates Tom for turning in Jimmy, states on TV the murder was committed by a copycat. Tom is met with strong opposition by his uncle, Captain Nick Detillo, after suggesting the Strangler is back. Tom goes to the precinct and steals the Strangler file in order to conduct an unauthorized investigation. Soon after, the body of another of Tom's ex-girlfriends is found.\nTom attends the Policeman's Ball, where he is still unpopular with all most police, except for his extended Hardy police family. When a drunken cousin Danny starts acting belligerent, a fistfight occurs between Tom and Eiler which is broken up by Jo. Later that night, the two partners fall in love and have sex at Hardy's boathouse. Outside the docks, an unseen person silently observes the lovemaking, which ends with Tom and Jo romancing each other into a deep slumber.\nOn patrol, Tom and Jo stumble upon the scene of someone dumping what appears to be a wrapped body off a bridge. Tom destroys the suspect's car but the unidentified individual escapes. Divers retrieve the body only to find it to merely a bunch of rugs, which leads to Tom and Jo being humiliated by their peers.\nWhile Jo stumbles upon Tom's investigation notes of the Stangler, Eiler informs Nick he suspects Tom. Nick discloses Tom has been under scrutiny by Internal Affairs. During a court hearing to have Tom removed from the force, it is revealed Jo is really Emily Harper of the Pennsylvania State Police, who has been monitoring Tom to find evidence of misconduct. Harper perjures herself and Tom goes unpunished.\nEmily is kidnapped from her apartment just as Tom finds the body of another female victim, a police dispatcher he knows, outside his trailer. Thinking that Danny is the killer, angry about Jimmy's death, Tom heads upriver to the Detillo family cabin. Just as Danny arrives, someone from behind knocks Tom unconscious. Tom awakens to find himself, Danny, and Emily handcuffed to chairs, with the killer, who turns out to be none other than Jimmy, who survived the fall into the river two years earlier, standing in front of them. Jimmy is about to kill Emily when Nick suddenly walks in and he tells his son to turn himself in, but Jimmy is defiant and commands Nick to tell how \"Uncle\" Vince really died.\nA flashback reveals Nick arrived on the scene immediately after Tom and the Strangler crashed their cars. He was horrified to find Jimmy and let him escape. Vince emerged from the wrecked car and took aim at the fleeing killer, unaware it was Jimmy. Nick tried to stop him and, in the ensuing struggle, accidentally killed Vince.\nAfter this revelation, Jimmy takes aim at Nick, who shoots first. Jimmy is wearing a bulletproof vest and returns fire, killing his father. In a fit of rage, Danny charges at Jimmy, giving Tom a chance to free himself. As the police close in, Jimmy flees on a motorboat with Tom in pursuit. The two get into a scuffle in which Tom kills Jimmy by tasering him in the mouth. After Tom is escorted by a paramedic, an officer attempts to remove the handcuffs from Tom's wrists, but Eiler steps in to remove them, and apologizes in the process, which he offers Tom to punch him in the face, which Tom briefly declines and after a second of reluctance, he punches Eiler in the face. Afterwards, Tom and Emily embrace each other.\nThe movie ends with Tom, who has been reinstated as a detective, visiting his father's grave with Emily and her daughter at his side."}