{"mid": "Stripes", "IMDB_id": "tt0083131", "title": "Stripes", "plot": "John Winger is a cab driver who, in the span of a few hours, loses his job, his apartment, his car, and his girlfriend. Realizing that he is a loser with no prospects, he decides to join the Army. Talking his best friend Russell Ziskey, a teacher of English as a second language, into joining with him, they go to a recruiting office and are soon sent off to basic training.\nUpon arriving at Fort Arnold, they meet their fellow recruits, and their drill sergeant, Sergeant Hulka. Moments after arriving, John angers Sgt. Hulka and is ordered out to do push-ups. He stands out as a slacker throughout basic training. Their commanding officer is the arrogant and incompetent Captain Stillman. As basic training progresses, Russell and John become romantically linked to female MPs Louise Cooper and Stella Hansen. Not long before graduation, Sgt. Hulka is injured when Stillman, trying to impress a visiting colonel, orders a mortar crew to fire without setting target coordinates.\nThe men go to a mud wrestling bar, where John convinces Dewey \"Ox\" Oxberger to wrestle a group of women. When the club is raided by MPs and police, Stella and Louise cover for John and Russell. The rest of the platoon are returned to base, where a furious Stillman threatens to make them all repeat basic training.\nAfter partying with Stella and Louise, the buddies return to the barracks, and John motivates the platoon with a passionate speech and begins to get them in shape for graduation. After a long night of practice, they oversleep and almost miss the ceremony. They rush to the parade grounds in their fatigues; there they give an eccentric, yet highly coordinated, drill display led by John. General Barnicke is impressed when he finds out that they had to complete training without a drill sergeant, and decides they are just the kind of \"go-getters\" he wants working on his EM-50 project in Italy.\nOnce in Italy, the platoon is reunited with a recovered Sgt. Hulka and assigned to guard the EM-50 Urban Assault Vehicle. Fed up with their boring assignment, John and Russell steal the EM-50 to visit their girlfriends, stationed in West Germany. When Stillman finds the EM-50 missing, he launches an unauthorized mission to get the vehicle back before his superiors find out it is gone. Hulka urges Stillman not to go, but is overruled.\nStillman inadvertently leads the platoon across the border into Czechoslovakia. Hulka, recognising where they are, jumps out of the truck just before it is captured. He makes a mayday radio call that is heard by John and Russell, who realize that the platoon came looking for them and are now in danger. John, Russell, Stella, and Louise take the EM-50 and infiltrate a Russian base where the platoon is being held. With some assistance from Hulka, they save the entire platoon.\nUpon returning to the US, John, Russell, Louise, Stella, and Hulka are treated as heroes, each being awarded the Distinguished Service Cross. Hulka retires and opens the HulkaBurger franchise. Stella appears on the cover of Penthouse, Ox makes the cover of Tiger Beat, Russell recreates his firefight with the Russians for Guts magazine, and John is featured on the cover of Newsworld. Captain Stillman is reassigned to a weather station near Nome, Alaska."}