{"mid": "StTrinians", "IMDB_id": "tt0964587", "title": "St. Trinian's", "plot": "Annabelle Fritton (Talulah Riley), an uptight daddy’s girl, unwillingly transfers to St Trinian’s from the distinguished Cheltenham Ladies’ College at her father’s (Rupert Everett) request. Annabelle is clearly different and doesn’t fit in, telling her father, Carnaby Fritton, that the school is \"like Hogwarts for pikeys\". She is taken around the school by Kelly Jones (Gemma Arterton), the head girl, who introduces her to the various cliques within the school.\nOn her first night at St Trinian’s, Annabelle is pranked by the girls, resulting in a video of her running around the school naked being broadcast live on the internet. She calls her father to pick her up, but he pretends to have bad phone reception so he can stay at a bar. Annabelle is drafted to the hockey team when she hits her phone with her hockey stick, smashing a statue. The girls of St Trinian’s are involved in business with Flash Harry (Russell Brand), who pays them to make cheap vodka. Flash is shown to be romantically interested in Kelly, who initially turns him down.\nThe Cheltenham Ladies’ College hockey team arrive at St Trinian’s, along with Education Minister Geoffrey Thwaites (Colin Firth). Thwaites is shown to have romantic history with the headmistress of St Trinian’s, Camilla Fritton (Rupert Everett). Annabelle is forced to face her former bullies, including captain Verity Thwaites (Lucy Punch). The hockey match is violent, ending in Kelly shooting a winning goal for St Trinians, which is followed by a brawl between the two schools. As the match is being played, Geoffrey Thwaites inspects the school, finding the illegal vodka-making business and the chatline being run by the Posh Totty clique.\nThe following morning, a banker arrives at the school and serves Camilla with a foreclosure notice, as the school owes the bank in excess of £500,000 and has ignored six previous final demands. A subsequent meeting between Camilla and Carnaby is watched by the girls using hidden cameras, in which Carnaby confesses his distaste towards his daughter. Annabelle is clearly upset, despite Camilla defending her. Carnaby encourages Camilla to turn the school into a boutique hotel, telling her that \"when this school closes down, you'll have lost everything. More importantly, so will I.\"\nKelly and Flash work with the students to devise a plan to save the school. They must get into the final of School Challenge, a TV quiz show held in the National Gallery in London, as a cover for stealing Vermeer’s “Girl With a Pearl Earring”. Chelsea, Peaches and Chloe (the Posh Totty clique) are chosen as the School Challenge Team. By cheating in every round, they make it to the grand final. As the final is being filmed, Kelly, Taylor and Andrea manage to steal the painting, with help from the Geeks, as well as Annabelle and Camilla.\nCamilla paints an exact copy of the painting and has Flash, posing as a German art dealer, sell it to Carnaby in a black market deal. The school then receives a further £50,000 reward for returning the real painting to the National Gallery. The loans are able to be repaid and the school is saved."}