{"mid": "StuckInLove", "IMDB_id": "tt2205697", "title": "Stuck in Love", "plot": "Novelist and part-time teacher Bill Borgens (Greg Kinnear) has been floundering since his ex-wife Erica (Jennifer Connelly) left him for a younger man two years ago. Instead of working on a new book, he spies on Erica and her new husband Martin while pretending to be jogging. Bill's son Rusty (Nat Wolff) is a high school student in love with a classmate named Kate (Liana Liberato) but lacks the courage to talk to her. Bill's daughter Sam (Lily Collins) is a cynical college student who prefers one-night stands and hook-ups with people she knows are less intelligent than herself, in order to shield herself from love.\nOn Thanksgiving, Bill has a reluctant Rusty set a place for Erica. At dinner, Sam announces that her first novel has been accepted for publication. Bill, having raised his children to be writers from birth, is thrilled, but becomes annoyed when she admits the book is not the one he had been helping her write. Rusty goes to have Thanksgiving with Erica and Martin, but Sam refuses, citing Erica's perceived betrayal of Bill.\nWhile at a bar, Sam's classmate Louis aka Lou (Logan Lerman) tries to prevent her from initiating another hook-up. Despite being rebuffed, he continues to pursue her and eventually strong-arms her into a cup of coffee. While discussing their favorite books, Sam is unnerved by their similar tastes in literature and runs off, refusing to be roped into a relationship. When Lou stops coming to the writing seminar they both attend, Sam tracks him down to the house where he takes care of his mother, who is dying. Sam is humbled by this and agrees to go out with Lou. When they discuss Sam's novel she reveals that a scene in which the main character sees her mother having sex with a man on the beach was about Erica and Martin. When Martin worried if Bill might see them, Erica replied, \"I don't care.\" While listening to Lou's favorite song Sam begins to cry, afraid of being hurt. Lou tells her he won't hurt her, and they share a kiss.\nRusty reads a poem in class about an angel. Bill reads Rusty's journal, which he has paid both Sam and Rusty to keep over the years. When Rusty catches him, Bill says that Rusty needs to really experience life in order to become a better writer. Rusty and his friend Jason bribe their way into a party held by Kate's boyfriend, Glen (Patrick Schwarzenegger). Rusty inadvertently sees Kate and Glen doing cocaine in the bathroom, leaving him dispirited. He and Jason are about to leave when they witness Kate and Glen arguing; when Glen shoves Kate to the ground, Rusty punches him in the face and flees with Kate and Jason. Since Kate can't go home bruised and high, Rusty brings her to his house. While tucking her into bed, she asks Rusty if his angel poem was about her; he admits it was. They share a kiss and begin a relationship. Rusty gives Kate a copy of It, his favorite novel, and she gives him her favorite album. On Christmas Day they have sex in his closet, which she believes neither of them will forget (as it is Rusty's first time). At the same time Kate struggles with her drug addiction; while visiting Erica's house, she rifles through a medicine cabinet and is on the verge of stealing prescription drugs when Erica walks in on her.\nBill has regular sexual liaisons with his married neighbor, Tricia (Kristen Bell), with whom he occasionally jogs. However, he continues to mope over his failed marriage. While Christmas shopping he runs into Erica and they talk over coffee. He tells her that, if given a second chance, he would be a much better husband, leaving Erica visibly uneasy. Tricia urges him to move on and begin dating again, helping him dress better and creating an online dating profile. After going on a somewhat successful date, he stops by Erica's house and peeks in her window. Seeing her read a book, he leaves his wedding ring as a sign that he has moved on. However, he does a double take and realizes she is reading one of his own books. Heartened, he takes back his ring.\nSam has a party for the launch of her book, where Bill makes a speech about the process of writing, quoting What We Talk About When We Talk About Love, his favorite book. Erica is invited by Lou, but is clearly uncomfortable and avoids conversation. Bill encourages her to talk to Sam, who pretends not to know her when signing Erica's copy of her novel. When Sam gives Kate champagne—unaware of Kate's addiction and the fact that she's underage—Kate goes back for more and eventually goes home with Gus, one of Bill's students. The Borgens track her down; Bill and Erica barge into Gus's apartment and find her asleep in his bedroom after a night of drinking and doing drugs. As Kate is loaded into the car, Rusty lifts the blanket covering her and realizes she had sex with Gus (perhaps while unconscious), which leaves him in tears.\nHeartbroken, Rusty turns to alcohol and comes home drunk almost every night. While at a convenience store with Jason he runs into Glen, who chases down and beats him. Kate writes Rusty a letter apologizing and telling him she's in rehab, having realized the only person who could truly fix her is herself. She hopes that one day she could be worthy of somebody like him. Bill, worried about Rusty, tells him to channel his pain into his writing. Rusty asks if he did the same when Erica left, prompting Bill to ground him. Rusty writes a story entitled \"I've Just Seen A Face\" (after the Beatles song of the same name, which he told Sam he hears when thinking of Kate) and finds it therapeutic. Later, he gets a call from Stephen King, his favorite author, who tells him that Sam sent his story to King, who had it published in The Magazine of Fantasy and Science Fiction.\nBill reveals to Sam that he walked out on Erica when Sam was a baby, and that when he came back six months later she accepted him, having waited the whole time. He promised that if she ever left him, he'd give her a second chance. When Lou's mother dies, Sam realizes how much her mother means to her and they tearfully reconcile. A year later, Bill shows he's moved on from Erica by not setting a place for her at the table for Thanksgiving. As the family sits down to eat, joined by Lou, Erica arrives and tearfully asks if there is a place for her. She joins them at the table and Rusty announces his story is being published. While the family celebrates, Bill again quotes from What We Talk About When We Talk About Love: \"I could hear my heart beating. I could hear everyone's heart. I could hear the human noise we sat there making, not one of us moving, not even when the room went dark.\""}