{"mid": "Subspecies", "IMDB_id": "tt0103002", "title": "Subspecies", "plot": "Three scholars -- two Americans (Michelle [Laura Mae Tate] and Lillian [Michelle McBride]) and native Transylvanian Mara [Irina Movila] -- arrive at historic Pledmar Fortress in Pledmar, Transylvania where they have obtained permission to reside while studying Transylvanian folklore. One legend has it that, some 500 years ago, a handful of peasants from Vlad Tepes' army barricaded themselves in the fortress against the Turks. When food and water was gone and the peasants ventured from the fortress, they found dead Turks with bloody throats, victims of vampires. A second legend tells about the presentation of the bloodstone, a stone from which drips the blood of saints and keeps vampires alive, keeps the vampires from biting any resident of Pledmar.The upcoming Festival of the Undead is held each year to celebrate the night that the vampires saved the people of Pledmar. In fact, the peasants believe that vampire King Vladislav Valescu still lives nearby in Castle Vladislav. But they're wrong. Unbeknown to the villagers, King Vladislav has just been murdered by his firstborn son, the evil Radu [Anders Hove], who has taken the bloodstone as his birthright and created four subspecies to do his bidding. The king's secondborn, Stefan [Michael Watson], summoned back by his father before his death, is residing at the Fortress under cover as a zoologist studying nighttime animals in and around Pledmar. Michelle and Stefan meet and are attracted to each other.On their first day in Pledmar, the girls visit the castle. It is locked but Lillian attempts to break in by feeling through the door for a lock. Unfortunately (or fortunately), she cuts herself on a nail and the girls go off for aid just as Radu answers the door. The next day, tired after a day of interviewing gypsies, the girls fall asleep outside the castle. When they awake, it is almost dark and they take a shortcut back to the Fortress. As night overtakes them, they realize that they are being followed. Before Radu can attack, however, they run into Stefan who sees them safely back and then returns to the castle where he finds his murdered father and is attacked by his evil brother. While Stefan stumbles back to the Fortress, Radu finds Lillian and sucks blood from her arm. Just as Radu prepares to drink from her neck, Stefan makes it back to the Fortress and opens her door in time to interrupt. Stefan pursues Radu back to the castle but the dawning sun almost kills him.Lillian falls ill. Michelle and Mara attend the Festival of the Undead where they photograph the villagers, all wearing masks and dancing in a cemetery. A white horse is made to jump over fresh graves. Any grave over which the horse will not jump is said to be the grave of a vampire who is promptly dug up, staked and his or her heart boiled. Michelle is pleased to see Stefan there; the two share their first kiss. Radu is also there. When Michelle leaves the festival to check on Lillian, Radu abducts Mara. Lillian dies of \"blood poisoning.\" To protect her body from mutilation by the villagers, Karl and Michelle bury Lillian in the cemetery at the castle ruins. Then they look for Radu's coffin, but it is empty. That night, Lillian awakens and joins Radu. When Stefan wakes, he takes Michelle and Karl to a church for safe-keeping then goes looking for Mara whom he finds in chains at the castle. Before he can free her, however, Stefan is netted by the subspecies.Lillian comes calling to Michelle at the church. Michelle goes out to her and is abducted, taken to the castle, and placed in chains with Mara. Michelle manages to break the chains away from the wall. She frees Mara who turns vampire and turns on Michelle. Mara, Lillian and Radu take Michelle to Stefan who is also being held in chains. Radu plans to desecrate Michelle in front of Stefan. Just as Radu bites her neck, Karl arrives. He stops Radu, shoots rosary beads into Mara, and frees who stakes Radu with a firey pole and cuts off his head. Lillian is eventually impaled on a chandelier, and Karl cuts off her head. Stefan retrieves the bloodstone and, at Michelle's request (\"Make me like you, Stefan. There's no other hope for me.\"), Stefan turns Michelle vampire, and they sleep together in Stefan's coffin. Meanwhile, Radu's head, lying on the floor, is approached by his subspecies. [Full Synopsis by BJ Kuehl]"}