{"mid": "SummerRental", "IMDB_id": "tt0090098", "title": "Summer Rental", "plot": "Overworked air traffic controller Jack Chester (Candy) is given four paid weeks off as an alternative to being fired after nearly causing a mid-air collision on the job and having an outburst over what turned out to be a fly covering a radar blip. He uses this time off to take his wife Sandy and children Jennifer, Bobby, and Laurie on a summer vacation from the Atlanta area to the Gulf Coast resort town of Citrus Cove, Florida, where they are beset by a never-ending barrage of problems. First they are bumped out of the front of the line of an upscale seafood restaurant in favor of arrogant local sailing champion Al Pellet, who becomes Jack's main nemesis throughout the film. Then the family misreads the address, moves into the wrong house, and are forced to leave in the middle of the night, ending up in a decrepit shack on a public beach with a constant stream of beach-goers tromping through. Jack then receives a leg injury that prevents him from spending time with his family.\nLater, Jack again locks horns with Pellet, the owner of the dubious piece of real estate where the Chesters are staying after the previous owner died. Jack gives Pellet the check for $1,000 to cover the rent for the next two weeks, but Pellet tears up the check and orders the Chesters to leave the house when their first two weeks expire or he'll throw them out personally.\nTo avoid an early eviction, Jack challenges Pellet to a race at the upcoming Citrus Cove Regatta: If Pellet wins, Jack will pay him the $1,000 rent and take his family home; if Jack wins, he keeps the money and earns the right to stay in the house for two more weeks rent-free. Pellet scoffs at the notion that Jack could ever defeat him in a race, but accepts the challenge. However, Jack hasn't sailed for many years and doesn't even have a boat. Scully, a local saloon keeper with a pirate's mentality whom the Chesters met earlier, befriends Jack and volunteers to help him on both counts.\nThe bored Chesters come to life by helping Jack make his new vessel seaworthy. This motley crew is at first no match for Pellet or anybody else in the race, but tossing useless garbage overboard, a strong breeze and a large pair of pants enable Jack to enjoy a victory at sea."}