{"mid": "SupermanII", "IMDB_id": "tt0081573", "title": "Superman II", "plot": "Before the destruction of Krypton, the criminals General Zod, Ursa and Non are sentenced to banishment into the Phantom Zone. Years later, the Phantom Zone is shattered near Earth by the shockwave of a space-borne hydrogen bomb. The three criminals are freed and find themselves with superpowers granted by the yellow light of Earth's sun. They travel to the White House and force the President of the United States to surrender on behalf of the entire planet during an international television broadcast. When the President pleads for Superman to save the Earth, Zod demands that Superman come and \"kneel before Zod!\"\nThe Daily Planet sends journalist Clark Kent—whose secret identity is Superman—and his colleague Lois Lane to Niagara Falls. Lois suspects Clark and Superman are the same person. That night, when Clarks recovers Lois' comb from a lit fireplace, Lois discovers that his hand is unburned, forcing Clark to admit he is Superman. He takes her to his Fortress of Solitude in the Arctic, and shows her the traces of his past stored in energy crystals. One is the green crystal that created the Fortress and opened Superman's contact with his parents. Superman declares his love for Lois and his wish to spend his life with her. After conferring with the artificial intelligence of his mother Lara, Superman removes his superpowers by exposing himself to red Kryptonian sunlight in a crystal chamber, becoming a mortal. Clark and Lois spend the night together, then leave the Fortress and return from the Arctic by automobile. Arriving at a diner in Metropolis, Clark is beaten up by a truck driver named Rocky. It is there that Clark and Lois learn of Zod's conquest. Realizing that humanity alone cannot fight Zod, Clark returns to the Fortress to try to regain his powers.\nLex Luthor escapes from prison with Eve Teschmacher's help, leaving his accomplice Otis behind. Luthor and Teschmacher infiltrate the Fortress of Solitude before Superman and Lois arrive. Luthor learns of Superman's connection to Jor-El and General Zod. He finds Zod at the White House and tells him Superman is the son of Jor-El, their jailer, and offers to lead him to Superman in exchange for control of Australia. The three Kryptonians ally with Luthor and go to the offices of the Daily Planet. Superman arrives, after having found the green crystal that restores his powers, and battles the three. Zod realizes Superman cares for the humans and takes advantage of this by threatening bystanders. Superman realizes the only way to stop Zod and the others is to lure them to the Fortress. Superman flies off, with Zod, Ursa, and Non in pursuit, kidnapping Lois and taking along Luthor. Upon arrival, Zod declares Luthor has outlived his usefulness and plans to kill both him and Superman. Superman tries to get Luthor to lure the three into the crystal chamber to depower them, but Luthor, eager to get back in Zod's favor, reveals the chamber's secret to the villains. Zod forces Superman into the chamber and activates it; however, Superman crushes Zod's hand and tosses him into a crevice. Luthor deduces that Superman reconfigured the chamber to expose the trio to red sunlight while Superman was protected from it. Non falls into another crevice and Lois knocks Ursa into a third. Superman flies back to civilization, returning Luthor to prison and Lois home.\nAt the Daily Planet the following day, Clark finds Lois upset about knowing his secret and not being able to be open about her true feelings. He kisses her, using his abilities to wipe her mind of her knowledge of the past few days. Later, Clark returns to the diner and has a rematch with Rocky the truck driver and defeats him easily. Superman restores the damage done by Zod, replacing the flag atop the White House."}