{"mid": "SupermanDoomsday", "IMDB_id": "tt0934706", "title": "Superman/Doomsday", "plot": "In Metropolis, Lois Lane tries to sell editor Perry White on a story exposing Lex Luthor's phony charity scam. Perry will have none of it and tells Lois to let it go, then urges Clark Kent to be careful on his foreign correspondent assignment--and to try to remember to write the occasional story. Clark bids Lois and Jimmy Olsen goodbye.Later, at his Fortress of Solitude, Superman agonizes over the fact that even with all his amazing powers he cannot come up with a cure for cancer, lamenting that he wants to be more than Earth's resident strongman. Lois asks Superman why he insists on bringing her to the Fortress so they can be alone, and then accuses him of hiding his greatest secret from her--his true identity, which she claims she all but knows for certain already. Superman claims that he's doing so to keep her protected, but she insists he's doing it because he's afraid to commit.Elsewhere, outside of Metropolis, scientists working for Luthor uncover an alien spaceship. They accidentally open the ship, releasing a monster who kills them all and begins a destructive and murderous rampage towards the city. At the Fortress, Superman's robot alerts him to the trouble, identifying the monster as a genetically engineered Doomsday weapon designed to destroy anything in its path. Superman flies Lois to Metropolis, then engages the monster in a terrific battle. The battle rages across the city until Superman flies Doomsday up into the stratosphere and brings the monster hurling down again, smashing a crater into the city of Metropolis. Doomsday is defeated, but Superman falls lifeless to the ground and dies in Lois's arms.Lois, Perry, and Jimmy are among the thousands at Superman's funeral. Lois sees an elderly woman whom she recognizes from a photo on Clark's desk as his mother. Even Luthor arrives to apparently pay his respects. Later, when Perry urges Lois to take some time off, she journeys to Smallville and visits Martha Kent, saying that she (Lois) and Martha's son (as Superman) had been intimate for several months, and that Martha was the only other person who could understand how Lois felt in the aftermath of Superman's death. Martha invites Lois in for a cup of coffee.With the loss of its greatest protector, the city of Metropolis is overrun by criminal activity. When the Toyman holds a schoolbus filled with children hostage atop a tall building, Lois attempts a rescue. She manages to free most of the children, but the Toyman throws the bus from the roof with Lois inside it. The bus plummets to the ground, but is caught at the last minute--by Superman, who has miraculously returned from the grave! Superman flies Lois to her apartment, where they say goodbye. Lois is concerned that Superman doesn't seem quite himself, but he passes that off as lingering effects from his near death experience. Superman makes his way to Lexcorp towers, where he finds Luthor in a room lit by red sunlight and brandishing a pair of kryptonite-studded gloves. Luthor beats Superman mercilessly, accusing him of leaving before his time. Luthor compliments the unconscious Superman for doing a very good job convincing the world that the Man of Steel had returned, then goes to a private lab where the body of the real Superman hangs in a suspension tank.Later, at the Fortress of Solitude, Superman awakens on medical bed, attended by his robot. The robot explains that Superman's body had all but shut down following his battle with Doomsday, and that it took the robot some time to locate its master after Luthor stole the body. The robot tells Superman that Luthor had created a clone which was passing itself off as the real deal. Superman instructs the robot to do everything possibe to help him get back to full strength. Luthor discovers that Superman's body is missing from his lab.Meanwhile, in Metropolis, the clone Superman hears that the Toyman had escaped prison and killed a little girl. Enraged, the clone grabs the Toyman and flies him high into the air, throwing him back to the ground. He explains to a shocked public that an example needed to be set, to prevent other criminals from similar actions. The dark clone then receives an assignment from Luthor--investigate Lexcorp competition and find Superman's body.Lois visits Luthor, seemingly grieving, but knocks him out with a sedative and, with Jimmy's help, uncovers Luthor's secret lab, where he has grown hundreds of Superman clones to serve as his personal army. The dark Superman arrives and destroys the lab. Luthor hides in his red sunlight room, but the clone locks him in there, tears the room out of the building, and hurls it to the ground.The real Superman has been receiving direct sunlight exposure and undergoing massive physical therapy to bring him back up to full strength. Although he still has recovery to do, he realizes he has to face his dark clone and flies to Metropolis. His robot gives him a kryptonite gun as a way of evening the odds.The army confronts the dark Superman, insisting that he must answer for his recent actions. Superman destroys their tanks and jets with his heat vision just before the real Superman arrives. The dark Superman claims that he is doing what is best for the people of Metropolis, but the real Superman says that the killing has to stop. Dark Superman easily disarms the real deal of the kryptonite gun, sending it miles away. The two fight in a massive battle, but the real Superman is poorly matched against his full strength doppleganger. Lois and Jimmy drive to the other side of town and retrieve the kryptonite gun.In the final confrontation at the Superman memorial, Superman again gives all he has to defeat his enemy. Just as it looks like this fight will end as tragically as his last one, Lois arrives with the kryptonite gun. After a lucky shot, however, Dark Superman destroys the weapon. In the scuffle, the kryptonite charge gets wedged into Dark Superman's costume, and Superman detonates it with a blast of heat vision. With his dying breath, Dark Superman begs Superman to protect the people of the Earth, and Superman affirms that that's why he is here.Superman convinces Lois that he really has returned this time, and agrees that they should have no more secrets--confirming that he is, in fact, Clark Kent. From his office in Lexcorp, Lex Luthor vows that one day, he will destroy Superman."}