{"mid": "SupportYourLocalGunfighter", "IMDB_id": "tt0067809", "title": "Support Your Local Gunfighter", "plot": "Latigo Smith (Garner), a gambler and confidence man, is traveling by train in frontier-era Colorado with the rich and powerful Goldie (Marie Windsor). Goldie is besotted with Latigo and wants desperately to marry him, a fate that he wants no part of. He manages to slip off the train at Purgatory, a jerkwater mining town. Assessing the situation, he discovers that two rival companies of miners, led by Taylor Barton (Harry Morgan) and Colonel Ames (John Dehner), are racing each other to find a \"mother lode\" of gold buried somewhere nearby. Massive dynamite blasts periodically rock the town to its foundations, creating or embellishing various moments of comic relief throughout the film.\nLatigo consults the town doctor (Dub Taylor) about an embarrassing problem that is not immediately revealed, but turns out to be a Goldie-related tattoo that he learns, to his chagrin, cannot be removed. Latigo's seminal weakness is gambling; he soon loses all of his money, and more, at roulette, playing his \"lucky\" number (23/red). After hearing a rumor that the infamous gunslinger \"Swifty\" Morgan (Chuck Connors) is expected in town, Latigo concocts a scam: With the help of amiable ne'er-do-well Jug May (Jack Elam) impersonating Swifty, he schemes to pay off his debts and skip town before the real Swifty makes his appearance. In the process, Latigo attracts the attention of Patience \"The Sidewinder\" Barton (Suzanne Pleshette), the hot-tempered daughter of Taylor, who desperately wants to escape this backwater frontier existence, attend \"Miss Hunter's College on the Hudson River, New York, For Young Ladies of Good Families\", and live a life of refinement in New York City. Latigo falls hard for Patience, and when he and Jug side with the Bartons in a dispute, Ames sends a telegram to Swifty informing him of the situation.\nSwifty arrives in town and immediately challenges the hapless Jug to a gunfight; but at the appointed time and place, Latigo is there in place of Jug, sitting atop a donkey loaded with crates of dynamite in an attempt to bluff the gunfighter. Swifty calls Latigo's bluff; but as he draws his six-shooter, a particularly massive mining blast startles him, and he shoots himself in the foot. The blast also panics the donkey, who charges into the Bartons' saloon with Latigo aboard, blowing the building to smithereens; but the blast uncovers the mother lode, which conveniently sits beneath the Bartons' land. The resulting inferno also fortuitously burns off Latigo's troublesome tattoo, while miraculously leaving him uninjured.\nLatigo finally wins big at roulette, betting $10,000 of the Bartons' money (on 23/red). Latigo and Patience, now both rich beyond their wildest dreams, are married. Jug narrates the outcomes from the back of a train carrying the happy couple off to the east coast: Patience doesn't get to go to Miss Hunter's College, but sends her seven daughters there; Swifty is still trying to get his boot off; and Jug becomes a big star in Italian westerns."}