{"mid": "SurfNinjas", "IMDB_id": "tt0108258", "title": "Surf Ninjas", "plot": "Johnny and Adam are teenage surfers who live in Los Angeles with their father, Mac. Two weeks before Johnny's 16th birthday, ninjas attack the teenagers, but they are defeated by Zatch, a mysterious warrior with an eye patch. A follow-up attack results in Mac's kidnapping, though Zatch is able to protect the teenagers and their friend Iggy from the ninjas. Adam discovers that the video game on his Sega Game Gear matches the events happening around him and finds he can control some events through his Sega. Zatch reveals to Johnny and Adam that they are actually the sons of the king of Patusan, whose land and monarchy was overthrown by the evil Colonel Chi when the boys were young. It is their destiny to return to Patusan, overthrow Colonel Chi, and free the people. Zatch takes them to the Patusani district in Los Angeles, where Johnny is introduced to a Patusani princess, Ro-May, who has been betrothed to Johnny since they were infants.\nNinjas again attack, but Johnny's abilities as a warrior prince emerge and he defeats several of his foes. Johnny, Adam, Iggy, Zatch, and Ro-May decide to return to Patusan. They are followed by a Los Angeles detective, Lieutenant Spence, who had been investigating the ninja attacks. They reach Patusan and discover what Colonel Chi's rule has wrought, including a burned village and a chain gang of political prisoners. The guards spot them and they are forced to fight. Johnny and Adam defeat them and free the villagers from their captivity.\nZatch leads the crew to a hidden cave in which the ancient weapons of the Patusani monarchy are preserved. Zatch arms Johnny and attacks him to prepare him for future challenges. Johnny is beaten repeatedly, but he is finally able to disarm Zatch. They rally the villagers and they travel to the coast opposite from an island that houses the royal city and Colonel Chi's dungeon. Unable to go by boat due to an impassable reef, Johnny and Adam tell the Patusanis to make surfboards. They then paddle to the unguarded side of the island.\nLanding on the island, Johnny and Zatch lead the attack on the royal city, taking down Chi's henchmen and freeing Mac. Johnny confronts Colonel Chi, successfully defeating him by knocking him into a body of water with the help of Adam and his Game Gear. With Chi's rule undone, peace is restored to Patusan. Johnny is seated as the heralded warrior prince with Ro-May as his princess and Adam as a prince. Johnny declares the monarchy to be dissolved and announces that Patusan will operate as a democracy. His reason for doing this is for the people to finally be free of rule, good or evil."}