{"mid": "SusieQ", "IMDB_id": "tt2516720", "title": "Susie Q", "plot": "In the fictional town of Willow Valley, Washington during the year 1955, teenager Susie Quinn prepares for her Winter Formal. She and her boyfriend, Johnny Angel, are oblivious to the fact that an inebriated motorist would soon force their car into a waterway where they subsequently drown. Forty years later, a teenager named Zach Sands moves into that very house with his widowed mother Penny who has a new job as a news reporter. Zach's father had died in a car accident on his way to Zach's basketball game — and Zach feels so guilty he abandons basketball. Now a student at the local high school, Zach befriends the drama group but also makes enemies of the envious Ray Kovich whose father, Roger, is a banker.\nWhile fishing with his younger sister Teri, Zach finds a bracelet that causes Susie's ghost to visibly manifest herself before Zach. Eventually, Zach researches Susie and discovers that she died 40 years ago. That night, Susie visits Zach again, and proves to him that he is the only one who can see her. Later Susie arrives at Zach's school, where he's distracted by the other girls in school - until Susie rips off part of the winter formal dress she's wearing to get his attention. Susie begs Zach to help her find out what happened to her parents but, while doing so, causes a scene in Zach's class. She apologizes, but continues to cause trouble at school and home until Zach agrees to help.\nWhile visiting Susie's parents, Zach finds out they are facing homelessness at the hands of the local bank because of a missing title deed, and that the bank is demanding an unaffordable $25,000 balloon payment. However, this is only one part of a larger plan, led by Roger Kovich, that would eventually destroy the town. Heading back home, Susie confesses that before she died, her grandfather was looking for the deed for Willow Valley. She reveals to Zach that she is still earth-bound because of a mistake she had made in persuading her grandfather to rest, rather than help him find the deed that could have secured her family. Teri discovers that much of the town's land legally belongs to the Quinn family, and it becomes a fierce race to the finish as Zach locates the requisite title deed. It draws the attention of the police; meanwhile Roger is warned and makes his own plans. After the police arrest Zach and Teri, Susie manages to save them by scaring the officer into letting them go free.\nFinally, Zach and Teri make it to the local news station just in time to provide their mother with all of the information about the Quinn family's history, which is broadcast on live television. In the aftermath, the bankers give up and apologize to the Quinns, the Kovich family leave town in an attempt on Roger's part to avoid criminal prosecution and Zach returns to playing basketball in honor of his late father. Susie, her mistake rectified, returns to the bridge where she died, where she reunites with the spirits of her boyfriend, Johnny Angel and her grandfather in Johnny's car. The ghostly trio depart for heaven, but not before Susie gives Zack her bracelet whilst bidding him an emotional farewell. In the closing scene, Zach meets a girl who looks identical to Susie and who introduces herself as Maggie."}