{"mid": "SweeneyToddTheDemonBarberOfFleetStreet", "IMDB_id": "tt0408236", "title": "Sweeney Todd: The Demon Barber of Fleet Street", "plot": "=== Prologue ===\nThe citizens of London, acting as a Greek chorus to raise commentary throughout the play, drop a body bag into a shallow grave. Sweeney Todd rises forth (\"The Ballad of Sweeney Todd\"), and introduces the play, set some months before the burial.\n=== Act I ===\nIn 1846, young sailor Anthony Hope and Sweeney Todd, whom Anthony has recently rescued at sea and befriended, dock in London, where a half-crazed Beggar Woman sexually solicits them, appearing to briefly recognize Todd (\"No Place Like London\"). Todd tells Anthony of his troubled past as a naïve barber, when a crooked judge banished him in order to pursue his wife (\"The Barber and His Wife\"). Leaving Anthony, Todd enters a meat pie shop on Fleet Street, where the owner, Mrs. Lovett, laments about the scarcity of meat (\"Worst Pies in London\"). When Todd asks about her empty upstairs apartment, she reveals that its former tenant, Benjamin Barker, was transported out of England on false charges by Judge Turpin, who, along with his servant, Beadle Bamford, then lured Barker's wife Lucy to the Judge's home and raped her (\"Poor Thing\"). Todd's reaction reveals that he is himself Benjamin Barker. Promising to keep his secret, Lovett explains that Lucy poisoned herself and that their then-infant daughter, Johanna, became a ward of the Judge. Todd swears revenge on the Judge and Beadle, and Mrs. Lovett presents Todd with his old collection of sterling silver straight razors, which persuades Todd to take up his old profession (\"My Friends\" and \"The Ballad of Sweeney Todd – Reprise\"). Elsewhere, Anthony notices an exquisite blonde girl singing out her window (\"Green Finch and Linnet Bird\"), and the Beggar Woman tells him that her name is Johanna. Unaware that Johanna is his friend Todd's daughter, Anthony is immediately enamored (\"Ah, Miss\") and he pledges to return for her, even when the Judge and Beadle chase him away (\"Johanna\").\nIn the crowded London marketplace, faux-Italian barber Adolfo Pirelli and his simple-minded assistant, Tobias Ragg, pitch a dramatic cure-all for hair loss (\"Pirelli's Miracle Elixir\"). Todd and Lovett soon arrive; Todd exposes the elixir as a sham, challenges Pirelli to a shaving competition, and easily wins (\"The Contest\"), inviting the impressed, onlooking Beadle to a free shave (\"The Ballad of Sweeney Todd – Reprise 2\"). Several days later, Judge Turpin flagellates himself in a frenzy over a growing lust for Johanna, but instead resolves to marry her himself. (\"Johanna – Mea Culpa\"). Todd impatiently continues to wait for the Beadle's arrival, but Mrs. Lovett attempts to calm him (\"Wait\"). When Anthony tells Todd of his plan to ask Johanna to elope with him, Todd, eager to reunite with his daughter, agrees to let them use his barbershop as a safehouse. As Anthony leaves, Pirelli and Tobias enter, and Mrs. Lovett takes Toby downstairs for a pie. Alone with Todd, Pirelli reveals that he is actually an Irishman named Daniel O'Higgins, an assistant to Todd fifteen years ago, who knows Todd's true identity. When O'Higgins attempts to blackmail his former employer, however, Todd injures and hides him, later slitting his throat (\"Pirelli's Death\" and \"The Ballad of Sweeney Todd – Reprise 3\"). Meanwhile, Johanna and Anthony plan their elopement (\"Kiss Me\"), while the Beadle recommends Todd's services to the Judge, so that he can better win Johanna's affections (\"Ladies in Their Sensitivities\").\nAt first panicked upon learning of Pirelli's murder, Mrs. Lovett seizes his leftover coin purse and then discusses with Todd plans to dispose of the body. Suddenly, the Judge enters; Todd quickly seats him and lulls him into a relaxed conversation (\"Pretty Women\"). Before Todd can kill the Judge, however, Anthony re-enters to explain the specifics of his and Johanna's plans, accidentally informing the Judge, who storms out and vows never to return. Todd drives Anthony away in a furious fit of madness, determining that he will kill all future customers, since all people deserve to die: the rich to be punished for their corruption, and the poor to be relieved of their misery (\"Epiphany\"). Mrs. Lovett slyly suggests that they use the flesh of Todd's victims in her meat pies, and Todd joyously agrees (\"A Little Priest\").\n=== Act II ===\nSeveral weeks later, Mrs. Lovett's pie shop has become a thriving business, and Toby is now working there as a waiter (\"God, That's Good!\"). Todd and Mrs. Lovett acquire a specially-designed mechanical barber's chair that allows Todd to kill his clients and then send their bodies directly through a chute into the pie shop's basement bakehouse. Mundanely slitting his customers' necks, Todd despairs about ever seeing Johanna again, while Anthony discovers that Johanna is missing (\"Johanna–Quartet\"), having been locked away in an insane asylum by the Judge. After a day of hard work, Mrs. Lovett envisions a seaside retirement (\"By the Sea\"), but Todd remains fixed on his revenge. Anthony arrives to beg Todd for help to free Johanna, and Todd, revitalized, devises a plan to rescue her by having Anthony pose as a wigmaker intent on purchasing inmates' hair (\"Wigmaker Sequence\" and \"The Ballad... – Reprise 4\"). Todd later sends a secret letter to notify the Judge of Anthony's plot, hoping to lure the Judge back to his shop (\"The Letter\").\nIn the pie shop, Toby expresses suspicions against Todd and his own desire to protect Mrs. Lovett (\"Not While I'm Around\"). When he recognizes Pirelli's coin purse in Mrs. Lovett's possession, she distracts him by showing him the bakehouse, instructing him how to work the meat grinder and the oven, before locking him down there. Upstairs, she encounters the Beadle at her harmonium, requested by neighbors to investigate the strange smoke emitted by the pie shop's chimney. Mrs. Lovett stalls the Beadle until Todd returns to offer the Beadle his promised \"free shave\"; Mrs. Lovett loudly plays her harmonium to cover the Beadle's screams above, as Todd is killing him (\"Parlor Songs\"). In the basement, Toby discovers human remains in a pie, just as the Beadle's fresh corpse comes tumbling through the chute. Mrs. Lovett then informs Todd that Toby has discovered their secret, and they plan to kill him.\nAnthony arrives at the asylum to rescue Johanna, but cannot bring himself to shoot Jonas Fogg, the deranged asylum owner who tries to stop them; Johanna does so herself, grabbing the pistol. Now, the asylum's inmates pour out into the streets, ecstatically proclaiming the end of the world, while Todd and Mrs. Lovett hunt for Toby, and the Beggar Woman fears what has become of the Beadle (\"City on Fire/Searching\"). Anthony and a disguised Johanna arrive to find Todd's shop empty. Anthony leaves to seek a coach after he and Johanna reaffirm their love (\"Ah Miss – Reprise\"). Left alone, Johanna hears the Beggar Woman enter and so she hides. The Beggar Woman seems to recognize the room, but, before she can make sense of it, the frantic Todd appears to greet the approaching Beggar Woman and lethally cuts her, sending her down the chute just a moment before the Judge bursts in (\"Beggar Woman's Lullaby\"). Todd assures the Judge that Johanna is repentant and the Judge asks for a quick splash of cologne. Once he has the Judge in his chair, Todd soothes but then suddenly mocks him. The Judge recognizes him as \"Benjamin Barker!\" just before Todd slashes his throat and sends him hurtling down the chute (\"The Judge's Return\"). The disguised Johanna finally stands, horrified, from her hiding place, surprising Todd. Todd next decides to kill her too, before Mrs. Lovett shrieks from the bakehouse below, providing a distraction for Johanna to escape. Downstairs, Mrs. Lovett is struggling with the dying Judge, who claws at her. She then attempts to drag the Beggar Woman's body into the oven, but Todd arrives and sees the lifeless face clearly for the first time: the Beggar Woman is his wife Lucy. Todd is in shock as Lovett confesses that she did not tell him the full story of Lucy because she loves him herself. Todd then feigns forgiveness, dancing manically with Lovett until pushing her into the raging fires of the oven. Full of despair, Todd embraces the dead Lucy. Toby, with his hair now white from shock and babbling nursery rhymes to himself, picks up Todd's fallen razor, and cuts Todd's throat. As Anthony, Johanna, and some constables break into the bakehouse, Todd falls dead and Toby drops the razor, heedless of the others, while absentmindedly turning the meat grinder (\"Final Scene\").\n=== Epilogue ===\nThe citizens, soon joined by the ghosts of Todd, Mrs. Lovett, and the others, recite \"The Ballad of Sweeney Todd.\" The company exits, with Todd and Mrs. Lovett being the last, with Todd exiting with an abrupt slam of a door."}