{"mid": "SweetSixteen", "IMDB_id": "tt0313670", "title": "Sweet Sixteen", "plot": "In a few weeks, Scottish teenager Liam will turn 16. The film opens with him using his tripod-mounted telescope outdoors on a clear night to show other children the stars and planets. He and his friends exemplify the violent \"ned\" subculture; they no longer attend school, but instead, hang around isolated areas or wander about all day long. They get money by illicitly selling untaxed cigarettes in a pub, and defy the police. Liam's mother is currently in prison, for a crime she did not commit. She will be released in a few weeks, in time for her son's 16th birthday. She has a boyfriend named Stan, who works as a drug dealer with Liam's grandfather, Rab.\nStan and Rab take Liam in Rab's car on a visit to his mother in Cornton Vale Prison, and try to force him to smuggle drugs to his mother while they create a distraction. In the event, Liam refuses to cooperate by passing the drugs over. When driving home his companions beat him up; he fights back and gets away. Liam arrives back to find that he has been expelled from his grandfather's flat, and his belongings thrown down into the front garden (including his telescope, which has been broken). Liam then moves to his sister Chantelle's nearby home in Port Glasgow. Chantelle agrees to let Liam live in her house if he's good to Chantelle's little son, Calum. She has been taking free evening classes to get work in a call centre, and implores Liam to do the same because she wants Liam to do something more 'constructive' with his own life.\nWhen Liam takes Calum for a walk along Greenock Esplanade, his friend Pinball arrives in a stolen car and insists on taking them joyriding along the coast. They drive up through the Cloch caravan (trailer) park where Liam sees a caravan for sale in a spot overlooking the scenic Firth of Clyde. Liam, who loves his mother very much, fantasizes that he, his sister, and his mother can escape to the seaside and live in the caravan, away from Stan and Rab's wrath. To purchase it he and Pinball steal a delivery of drugs from Stan's house and sell them, doing the very things Liam once hated – claiming that they will never get anywhere by selling cheap cigarettes. They soon develop 'entrepreneur skills' and raise several thousand pounds, which they pay as a deposit towards the caravan in Liam's mother's name.\nLiam's efforts attract the attention of the local drug 'godfather'. Liam, who only wanted a peaceful life with his mother, agrees to work with them after the local godfather tells him to 'stay away from our shops'. Pinball, meanwhile, is thrown into the health club showers due to his disrespectful manner towards the dealer, and vows revenge. Liam and Pinball carry on selling drugs to the local area, with the help of Liam's other friends who deliver pizzas. Liam and Pinball meet again with members of the drug godfather's gang, and Liam joins them in their car. Pinball is kicked out, angering him further; the gang members advise Liam to 'dump' Pinball for good. They take Liam to a Glasgow nightclub and instruct him that he has to kill someone to join the gang. Liam attempts to do so, but is stopped by the gang, who inform him it was a test (which he has passed).\nLiam, Chantelle, Calum and Suzanne (Chantelle's friend) drive to the caravan to have a picnic, only to discover that it has been burned down. Liam believes it was Stan who did it, and throws a rock through his window. That evening, Pinball turns up in the drug godfather's (stolen) car, telling Liam that he wants revenge. He proceeds to crash the car into the health club. Liam speaks to the godfather in the morning and, to his chagrin, is ordered to \"take care of\" the Pinball problem (i.e. to kill his friend). The next morning, Pinball - aware of Liam's intentions - first tries to stab Liam, then proudly tells him that he's the one who burnt down the caravan, not Stan. He then cuts his own face in rage. Liam is seen reassuring his injured friend after phoning for an ambulance, but in the next scene he notifies the godfather that the deed has \"been done\", leaving a viewer to infer that he has indeed murdered his friend.\nThe godfather promises to buy Liam an upscale apartment, and on the day before his birthday Liam's mother is released from the prison and taken to this new house on the coast of Gourock where she is welcomed with a party. She appears uneasy, and the next morning is found to have escaped to Stan's house. Liam blames this on Chantelle. Chantelle, now fully aware that Liam is dealing drugs, attempts to warn her little brother about their mother probably not being so thankful for Liam's efforts because she is too devoted to Stan, but this only provokes Liam even further. An enraged Liam goes to Stan's house, trying to convince his mother to go back to their new home, only to receive insults from Stan. In a struggle, Liam stabs Stan.\nLiam is then seen walking alone on the stony beach. He is phoned by Chantelle, who reminds him that the day is his 16th birthday. She also tells him that the police have been looking for him, but that after everything that he has done, Chantelle still loves him. He walks towards the sea."}