{"mid": "SweetCharity", "IMDB_id": "tt0065054", "title": "Sweet Charity", "plot": "=== Act I ===\nThe young woman Charity Hope Valentine is a taxi dancer at a dance hall called the Fandango Ballroom in New York City. With a shoulder bag and a heart tattooed on her left shoulder, Charity meets her boyfriend Charlie in Central Park. While Charlie silently preens himself, Charity speaks the pick-up lines she imagines him saying, and tells him how handsome he is (\"You Should See Yourself\"). Charlie then steals her handbag and pushes her into the lake (usually the orchestra pit) before running off. Passers-by discuss the apparent drowning but do nothing, until a young Spaniard finally rescues her. In the Hostess Room of the Fandango Ballroom, Charity tries to convince both herself and the other skeptical taxi dancers that Charlie tried to save her. Nickie, a fellow dancer, tells Charity that her problem is \"you run your heart like a hotel — you've always got people checking in and checking out\". The manager, Herman, arrives to tell them it is time for work. The hostess dancers proposition the audience in the front room of the Fandango Ballroom (\"Big Spender\"). Helene and Nickie try to comfort Charity about Charlie's absence (\"Charity's Soliloquy\").\nOn the street, after work, Charity gives to every beggar who approaches her until she realizes she has no money. Just then, film star Vittorio Vidal rushes out of the smart Pompeii Club, in pursuit of his beautiful mistress, Ursula. Ursula refuses to go back inside with Vittorio, who promptly takes the only-too-willing Charity instead. Inside the Pompeii Club, the dancers are dancing the latest craze, The Rich Man's Frug. To everyone's astonishment, the famous Vittorio is accompanied by the unknown Charity. She tries to steer him away from the subject of Ursula. Finally, he wants to dance. Not having eaten since breakfast, Charity faints. There is general agreement amongst the dancers that she needs to be \"laid down\". Vittorio asks \"where?\", and Charity recovers enough to prompt Vittorio with \"your apartment!\".\nLying down on Vittorio's bed, Charity claims she is no longer hungry. She admits she is a dance hall hostess, putting it down to \"the fickle finger of fate\" (a favorite expression of hers). Vittorio is struck by her humor and honesty. Starstruck, Charity asks for a signed photograph to prove to the girls she was really in his apartment. While Vittorio fetches props from his old movies for further evidence, Charity remarks on her good fortune (\"If My Friends Could See Me Now\"). Ursula arrives to apologize for her jealousy; Charity is swiftly bundled into a closet before Vittorio opens the door to Ursula. (\"Too Many Tomorrows\") While Charity watches from the closet, Vittorio and Ursula make love inside his four-poster bed. The following morning, Charity is escorted from the room by a mortified Vittorio. In the Hostess Room, the girls are disappointed that Charity failed to get more out of Vittorio. Nickie announces she is not going to remain at this job for the rest of her life, prompting the girls to speculate on alternative careers (\"There's Gotta Be Something Better Than This\"), but Herman brings them back down to earth. Charity decides to seek some cultural enlightenment from the YMHA on 92nd Street, where she gets stuck in a broken elevator with shy tax accountant Oscar Lindquist. While trying to calm him down, Charity learns that he is not married. She declares, \"Oh Oscar... You're gonna be all right.\" After helping Oscar overcome his claustrophobia (\"I'm the Bravest Individual\"), the pair are plunged into new panic when the lights stop working.\n=== Act II ===\nAfter being trapped in a broken elevator, Oscar and Charity are finally rescued when it starts working again. Oscar invites Charity to go to church with him, to which she hesitantly agrees. As they walk under the Manhattan Bridge to the church, the faint cries of the next person to be stuck in the elevator are heard. The Rhythm of Life Church turns out to be a thin veneer on hippie culture (\"The Rhythm of Life\"). A police raid breaks up the meeting. Traveling home on the subway, Oscar proposes another date and tries to guess Charity's job, deciding that she works in a bank. Charity lies, saying she works for First National City, Williamsburg Branch. As they part, Oscar kisses her hand, and dubs her Sweet Charity (\"Sweet Charity\").\nAfter two weeks, Oscar and Charity have continued dating, and she still has not confessed what she actually does for a living. At Coney Island Amusement Park they become trapped again when the Parachute Jump ride breaks. This time, Oscar is the calm one while Charity is scared — scared that she is starting to depend on him. Once again, Charity loses her nerve about telling him what her real job is. As the crowd look on, the couple kiss. On a slow night at the Fandango, Charity loses the opportunity to snare one of the few customers by a new co-worker, Rosie. Disgusted by the whole business, she quits. However, in Times Square, she wonders what the alternative is (\"Where Am I Going?\"). Sending a telegram to Oscar, she asks to meet him at Barney's Chile Hacienda. She admits that she is a dance hall hostess; he admits he already knows, having followed her one night and watched her dancing. He says he does not care and wants to marry her. Relieved and elated, Charity leaves (\"I'm A Brass Band\") and packs a suitcase on which is printed 'Almost Married'.\nAfter a farewell party at the Ballroom (\"I Love to Cry at Weddings\"), Charity and Oscar walk in the park, whereupon Oscar announces that he cannot go through with the wedding, saying he is unable to stop thinking about the \"other men\". Eventually, he pushes her into the lake and runs off. Emerging from the lake, Charity, speaking directly to the audience, asks \"Did you ever have one of those days?\". Realizing that unlike Charlie, Oscar has not stolen her bag, she shrugs and reprises her opening dance.\nThe stage blacks out onto three neon signs, reading \"And so she lived … hopefully … ever after\"."}