{"mid": "SwimmingWithSharks", "IMDB_id": "tt0114594", "title": "Swimming with Sharks", "plot": "Buddy Ackerman, an influential movie mogul, hires Guy, a naïve young writer, as his assistant. Guy, who has just graduated from film school, believes that his new job is a golden opportunity. Despite warnings from Rex, the outgoing assistant who has become hardened under Buddy's reign, Guy remains optimistic.\nBuddy turns out to be the boss from hell; he treats Guy like a slave, subjects him to sadistic (and public) verbal abuse, and has him bending over backwards to do meaningless errands that go beyond just his work life. Guy is humiliated and forced to bear the brunt of his insults. Guy's only solace is his new girlfriend, Dawn, a producer at Buddy's firm. When Buddy apparently fires Guy in a phone call, Guy snaps and takes Buddy hostage in order to exact revenge. He ties Buddy up and subjects him to severe beatings, torture and mind games. It is later revealed that due to a botched call waiting function on Buddy's home phone, Guy hears Buddy and Dawn arranging a rendezvous at Buddy's house.\nOnce in Guy's power, Buddy reveals for the first time a human, vulnerable side. He tells a tragic story about his wife's death on Christmas Eve 12 years prior and reveals that he, too, was once a bullied assistant to powerful, tyrannical men and spent a decade putting up with such abuse to get to where he is today. He also reveals that abusing Guy was his way of teaching him that he must earn his success. Dawn arrives at the scene to find Guy aiming a gun at Buddy's face, whereupon Buddy tells Guy that he has to pull the trigger in order to get ahead in the business. After a moment's indecision, Guy fires the gun.\nThe climax of the film reveals that Guy killed Dawn (who is blamed for kidnapping and torturing Buddy), and was subsequently promoted. In the final scene, Guy coldly tells a former colleague to find out what he really wants and then do anything to get it, echoing the numerous times he has been told this by both Buddy and Dawn. During this speech, Buddy passes by his office, makes eye contact with Guy and gestures to call Guy into his office for a meeting. Guy excuses himself, takes a pass on a request for dinner since he has to wrap Christmas presents and goes into Buddy's office. The movie ends with Buddy shutting his office doors as other personnel pass by."}