{"mid": "SwingShiftCinderella", "IMDB_id": "tt0038143", "title": "Swing Shift Cinderella", "plot": "At the beginning, the Big Bad Wolf is chasing the young version of Little Red Riding Hood from the beginning of Red Hot Riding Hood. But then Little Red stops and points out that the two of them are in the wrong cartoon. The Wolf shoos away Little Red and decides to go and meet Cinderella (played by Red from Red Hot Riding Hood). He takes a taxi to her house and immediately falls in love with her upon seeing her, but she sternly rebuffs him. Eventually, Cinderella calls her Fairy Godmother (played by Grandma from Red Hot Riding Hood) to get rid of him and set her up for that night's ball. The second the Fairy Godmother hears that there's a Wolf, she rushes right over. The Fairy Godmother traps the Wolf, then gives Cinderella a sexy dress and transforms a pumpkin into a Woodie for her to go the ball, but tells Cinderella that she has to get home by midnight (just like in the classic fairy tale).\nThe oversexed Fairy Godmother then keeps the Wolf busy. She appears before him in an old-fashioned 1890s swimsuit (\"Miss Repulsive 1898\") and then an evening gown before trying to snuggle up to him on the couch. She chases him all around Cinderella's house, but the Wolf escapes when he gets the Fairy Godmother's wand, turning Cinderella's bathtub into a convertible. He leaves for the nightclub where Cinderella is performing, with the Fairy Godmother in pursuit. Soon after arriving, the Wolf accidentally kisses the Fairy Godmother, thinking she was Cinderella, which only further deepens her lust for the Wolf. Cinderella soon comes out on-stage and performs an exotic dance while singing the song \"Oh Wolfie\" (to the tune of \"Oh Johnny, Oh Johnny, Oh!\"). The Wolf howls and chases after Cinderella, but the smitten Godmother uses various methods (usually a mallet) to keep him in line.\nAfter the performance, more brief chasing ensues until the clock strikes midnight. Cinderella rushes home as the Fairy Godmother's transformation wears off, but she manages to make it home in time--it turns out that Cinderella's a Rosie the Riveter and that the reason she had to be home by midnight was so she wouldn't be late for the night shift. Cinderella's relieved to be rid of the Wolf, but it's revealed that the bus is full of wolves, who start wolf-whistling and catcalling at her."}