{"mid": "SwingKids", "IMDB_id": "tt0108265", "title": "Swing Kids", "plot": "In Hamburg in 1939, Peter Müller and Thomas Berger join their friends Arvid and Otto at a swing club called the Bismarck. They have a good time, dancing and enjoying the music.\nPeter goes home to find his mother in an argument with a Nazi officer. Herr Knopp, head of the local Gestapo, arrives and curtly dismisses the officer. Herr Knopp begins asking Frau Müller questions about some of her late husband's friends. Herr Müller had been accused of being a communist, and was irreparably damaged by an interrogation at the hands of Nazi agents.\nAt Arvid's house, Thomas accidentally ruins one of Arvid's prized records. Upset, Arvid kicks Thomas, Peter and Otto out. To apologize to Arvid, Peter and Thomas steal a radio (which Peter knows was stolen from a ransacked Jewish home) from a bakery. Thomas escapes, but Peter is caught. Herr Knopp, who is attracted to Peter's mother, intercedes for him; in return, Peter must enroll in the Hitlerjugend (HJ).\nPeter, who has a job delivering books, is asked to spy on his boss, whom the Nazis suspect is working against the Reich. In HJ school, the boys are encouraged to spy on their friends and families. Thomas accuses his father of insulting Hitler, hoping to cause trouble for him, but is unnerved when the Nazis come to his home and take his father away. His subsequent attempts to resume his friendship with Peter and persuade him to collaborate with the Nazis are tinged with fear.\nArvid, who is working at a jazz club, refuses to play a German song, lashing out at the club's patrons for being blind to the Nazi agenda. Peter is sympathetic but Thomas loudly argues the Nazi side. Peter angrily proclaims Thomas to be a \"fucking Nazi\" and storms off. As time goes on, Arvid realizes there is nothing for him in Germany and commits suicide.\nAs Thomas begins to believe fully in Nazi ideology, Peter feels as though there is no hope for him. Peter, disenchanted with how his life is coming apart, dresses up and goes to a swing club which is scheduled to be raided by members of the Hitlerjugend (HJ). As Thomas begins assaulting the club's patrons he attacks Peter; however, during the fight Peter is able to reach Thomas. Thomas begs Peter to run away but Peter won't. Willie Müller is there and as Peter is driven away by the police, he loudly screams \"Swing Heil!\" over and over again, proud that his brother stood up for being a swing kid."}