{"mid": "SymphonyInSlang", "IMDB_id": "tt0044095", "title": "Symphony in Slang", "plot": "John Brown (a real swinging hep cat) goes to Heaven and steps before St. Peter. But his life story is so peppered with slang that neither St. Peter nor Noah Webster can understand him. What follows is a series of sight gags based on Webster's literal interpretations of the slang terms, such as John's first job being helping out a proprietor who is 'short handed', but being 'unable to cut the mustard', he is 'given the gate', and goes back to his 'hole in the wall'.\nIn general outline the story follows John's life. Beginning with being born with a silver spoon in his mouth, seeming 'to grow up overnight', 'getting up with the chickens' at the 'crack of dawn, his first job 'slinging hash' because the proprietor is 'short-handed', not being able to 'cut the mustard', being 'given the gate', going back to his 'little hole in the wall', being 'beside himself with anger', moving to Texas to 'punch cattle', 'flying' to Chicago, where a beautiful girl named Mary 'steps into the picture'. Their eyes 'meet'. John's breath comes in 'short pants'. He gets 'goose pimples' and is 'all thumbs'. Mary's clothes 'fit her like a glove'. She looks mighty pretty with her hair 'done up in a bun'. She has good-looking 'pins' too. She gives him a 'date', he puts on his white tie and 'tails', and she puts on the 'dog'. They 'go around together', 'painting the town red', going to the 'Stork Club', in a 'box at the opera'. John has a 'cocktail' and Mary has a 'Moscow mule', and 'lets her hair down'. However, as Mary 'eats like a horse', John's money 'runs out on him'. John writes a check, it 'bounces', and he is 'in a pickle'. An angry restaurateur 'draws a gun on him', John 'gives him the slip' and hides in the 'foothills', but the law is 'on his heels'. On the witness stand, the judge tries to 'pump' John. Every time John opens his mouth, he 'puts his foot in it'. He is 'sent up the river' for a 'stretch in the jug' and is 'up against it' and feels himself 'going to pot', but after 'raising a big stink', and 'getting through a lot of red tape' he is 'sprung' by an 'undercover man'.\nOnce out of prison, John 'stretches' his legs, goes to the bus station and catches a 'Greyhound' to New York City. After this he 'drops in' on Mary and 'throws himself' at her feet, but she 'turns her back', and 'gets on her high horse'. John can't 'touch her with a 10-foot pole'. She won't say a word, because 'the cat has her tongue'. After 'walking out on her', he 'goess to pieces'. Feeling lonely, he goes to Joe's Malt Shop, where a bunch of the boys are 'hanging around' and the pianist 'plays by ear'. John feels a 'tug' at his elbow; it's the soda clerk. They 'chew the rag' a while; John eventually hears from the 'grapevine' that Mary is going around with an 'old flame', who is 'connected to the railroad', but is really just 'feeding her a line' as he 'spends his money like water'. John feels 'burned up'. He tries to 'chisel in', the old flame 'gets in John's hair' and John is made to leave. Outside it is 'raining cats and dogs'. He 'feels blue', and 'everything looks black', but he 'carries on'.\nAfter moving to 'the thousand islands' and becoming a 'beach comber', he still misses Mary, and a tear 'runs down his cheek'. He 'sends her a cable', and she responds with a 'wire'. So he catches a 'cattle boat' back to the states, but after 'hot-footing it' to her apartment he discovers things have changed; Mary now has a 'bunch of little ones', and her old flame is now a suffering husband. All of this amuses him so much that he 'dies laughing'.\nBack in Heaven, John asks if Webster has followed him. The Master of the Dictionary stammers, to which John asks if the 'cat has his tongue'. It does."}