{"mid": "T2Trainspotting", "IMDB_id": "tt2763304", "title": "T2 Trainspotting", "plot": "It has been 20 years since Mark \"Rent boy\" Renton stole from his friends the money they had made in a drug deal and fled the country. He has apparently made a decent – but unfulfilling – life for himself in Amsterdam, and returns to Edinburgh to make contact with those in his former life. Daniel \"Spud\" Murphy continues to struggle with his heroin addiction, which has caused him to lose his construction job and estranged him from Gail Houston and their son Fergus. Simon \"Sick Boy\" Williamson, now a cocaine addict, runs the Port Sunshine pub he inherited from his aunt, and with his Bulgarian girlfriend Veronika attempts to blackmail men by luring them into sex videos. Francis \"Franco\" Begbie is serving a 25-year prison sentence and is denied parole due to his violent temper.\nMark stops by his childhood home, where his father tells him of his mother's death while he was away. He visits Spud at his flat, narrowly preventing him from committing suicide. Spud initially resents the intervention, but Mark offers to help him out of his addiction. Mark visits Simon at the pub intending to apologize and pay back Simon's share of the money he stole. They get into a fist fight, but ultimately make peace.\nBegbie escapes from prison, then reunites with his wife and meets his university-bound son, whom he wants to instead join him in burgling houses. Begbie visits Simon, and learns that Mark has returned. Simon pretends to collaborate with him in getting revenge upon Mark, but keeps both of them unaware of his contacts with the other.\nMark, Simon, and Veronika become partners in various crimes, using the money from their deeds to begin renovating the Port Sunshine into a brothel. They fraudulently apply for an EU business-development loan, and are given £100,000. But friction develops as Simon slips ever deeper into his cocaine habit and Veronika begins an affair with Mark. One of Simon's blackmail targets reports him to the police, and Mark seeks legal advice from his former girlfriend Diane Coulston, now a solicitor. A menacing encounter with the owner of a rival brothel intimidates Mark and Simon into ending their plans.\nBegbie and Mark accidentally meet in the toilets of a nightclub, resulting in a chase that ends with Mark barely escaping Begbie with a knife injury to his arm. Begbie visits Spud for help finding Mark, and discovers that Veronika has encouraged him to begin writing a memoir of events from the first film. From the drafted pages spread throughout Spud's apartment, Begbie learns for the first time that Renton had left Spud his £4,000 share of the £16,000 drug deal earnings. When Veronika stops by, Begbie takes her phone, which he uses to trick Mark and Simon into meeting him at Simon's pub.\nVeronika tries to convince Spud to go away with her, promising him half of the money they received from the EU loan and their other schemes, but he refuses, saying he would only spend it on drugs. But he helps her by forging Mark and Simon's signatures to move the money to her bank account.\nSimon and Mark meet at the pub, and Spud arrives to warn them of Begbie's trap. Begbie arrives and succeeds at knocking Simon unconscious. He traps Mark upstairs, who falls and gets caught in loose cables from the renovations, strangling him. Simon revives and works to save Mark, but Begbie is about to shoot them with his shotgun, when Spud knocks him out with a toilet bowl.\nIn the epilogue, Begbie has been left by his former friends in the boot of a car parked at the prison he'd escaped from. Veronika returns to Bulgaria with the money she took from Mark and Simon, where she reunites with her son. Spud begins a new career as a writer and begins mending his relationship with Gail and Fergus. Mark reconciles with Simon, and moves back into his father’s home, embracing his father before going into his bedroom and playing \"Lust for Life\" on his record player."}