{"mid": "Tabu", "IMDB_id": "tt2153963", "title": "Tabu", "plot": "Prologue\nA narrator, Miguel Gomes himself, reads in voice-over a poetic and philosophical text that invokes a legend in which the Creator orders, but the heart commands: the suicide of an intrepid explorer who, somewhere in Africa, long ago, plunges into a turbid river after a frustrated love affair and is devoured by a crocodile. Many swear they have seen a beautiful woman and a sad crocodile on the riverbank and that the two share a mysterious empathy.\nPart 1—Paradise Lost\nThree disparate women dwell in an old building in Lisbon. Aurora, an octogenarian living off her pension, eccentric, talkative and superstitious, seeming more dead than alive, and Santa, her housemaid from Cape Verde, live at the same apartment. Santa is semi-literate, but proficient in the divinatory art of voodoo. Pilar, their neighbor and friend, a Catholic middle-aged woman, and militant social benefactor, involves herself in their psychodramas.\nPilar has another friend, a romantic painter in love, a gentleman who insists on offering her tacky pieces of art. But Pilar is more concerned with Aurora: with Aurora's solitude, with her frequent escapes to the casino. She is even more worried about Santa, with her long silences and devil arts. Santa thinks it better to take care of oneself without annoying others, so keeps quiet.\nSomething else concerns the old lady: understanding she will die soon, she feels someone is missing her, someone her friends have never heard about: Gian-Luca Ventura. So she asks Pilar to find him. She succeeds in doing so and the man appears. He is an old colonist, a disturbed man, from Mozambique, an ancient Portuguese colony. Another story emerges, beginning: \"Aurora had a farm in Africa at the foothill of Mount Tabu...\"\nPart 2—Paradise\nFlashback: The story of Aurora’s life, told by Gian-Luca Ventura in voice over. This part takes place shortly before the Portuguese Colonial War began.\nIn 1960s Portuguese Africa, Aurora and her husband live together near the Tabu Mountain. She is a skilled hunter, never missing a shot. She owns a small crocodile, a gift from her husband, which moves around the house as a pet.\nOne day, the animal runs away. The pregnant Aurora finds it in Ventura’s house, where they consummate their existing mutual attraction; a passionate and dangerous love affair ensues. Gian-Luca confides in his friend, Mario, about the affair. Mario demands that Gian-Luca end the affair and when he is ignored, the two start fighting. The heavily pregnant Aurora picks up a revolver and shoots and kills Mario. She later gives birth to a girl. Two days later, Gian-Luca leaves Africa for good."}