{"mid": "TakingChance", "IMDB_id": "tt1019454", "title": "Taking Chance", "plot": "The film opens on a black screen, with white letters describing the date and place, as we hear radio chatter about a \"suspicious vehicle\" followed by the sound of an explosion and gunfire. We then cut to see two Marines driving, wearing dress blue uniforms, to an unmarked house in the middle of the night and knocking on the door. Finally we cut to Lt. Colonel Michael Strobl (played by Kevin Bacon) searching on his computer the casualty report for the Middle East. After a couple clips of Michael running through the woods, service members' coffins getting put into an airplane, and some driving. We find the Lt. Col. at work giving a presentation to several other Marines. The Lt. Col. makes his way home with his family for a short while, then the camera cuts to five Marines in woodland MarPat camouflage taking US Flag draped coffins off of an airplane in the rain. After a short clip of the Lt. Col. eating dinner with his family, we find him looking at the casualty report yet again but this time he writes down some information. The movie then cuts to him in an interview with a higher ranking Marine and he asks to escort a Marine named PFC (Private First Class) Chance Phelps. He says it is because the PFC is from his hometown, then we see him discuss his choice with his wife. After he explains that he is doing this only because the PFC is from his hometown and has no other meaning, the film cuts to several people doing medical procedures on a dead body which one can assume to be PFC Phelps. After the morticians are shown, the film then cuts to the Lt. Col. leaving and telling his wife goodbye.\nHe then arrives at Dover Port Mortuary where he gets his instructions along with other Marines on how to go about escorting a fallen Marine. After the instruction, all the service member escorts who are awaiting their turn to depart head outside and render honors as each of them departs. The Lt. Col. is informed that Phelps isn't ready to be transported due to the amount of casualties. He checks into a hotel room and the next day does an inventory, with another Marine, of Phelps' personal items including: a cross on a string, a Saint Christopher necklace, a wristwatch, and Phelps' dog tags. He is told that PFC Phelps's private effects are not to leave his side, under any circumstances. The Lt. Col. then verifies that the body in the van is in fact the PFC and then begins his drive to the airport where he has a talk with Rich Brewer (played by John Magaro) of the Dover Port Mortuary. They talk about the military and how the driver knew two men from his high school who enlisted, one of whom returned after sustaining severe injuries (who is recovering at Walter Reed), and the other who was killed. Lt. Col. Strobl arrives at the airport, where he first renders honors to the PFC as he is offloaded to a cargo area, before saying a curbside goodbye to the driver (telling him, he's \"a good man\"). Lt. Col. Strobl heads to the check-in counter, where the ticketing agent tells him that he has been upgraded to First Class. As he goes through security, he tells a somewhat annoyed TSA agent that he can't put Phelps' personal items into the x-ray scanner (because they are not allowed to leave his side at any time for any reason). He also says that he won't take off his Marine Dress Uniform Jacket to go through the metal detector because it would degrade the uniform. Eventually he is screened in private, with the TSA agent using a metal-detector wand, while the Lt. Col. holds on to the PFC's personal effects in his hand. He then renders honors to the PFC again as the coffin is loaded onto the airplane. On board, the man next to him in first class orders a Jack Daniels, and he orders a water, after which the man asks him \"What, are you on duty?\" He replies, \"Yes, I am,\" and they take off. While in the air the flight attendant hands him a crucifix and tells him that she wants him to have it.\nA few hours later, the plane touches down and Strobl and the PFC's casket wait to change flights in Minneapolis. After the casket is unloaded, Strobl requests to stay with the casket overnight in the airport's cargo area. Despite reservations from the foreman, his request is granted; one of the workers offers him a sleeping bag from his jeep. During this time, Strobl meets a U.S. Army Sergeant of the 1st Cavalry Division who he recognized from the Dover Port Mortuary. The sergeant tells Strobl that he is escorting his deceased brother home. The following morning, the PFC's casket is loaded onto a Northwest Airlines flight as the baggage handlers and even the flight captain pay their respects. On this flight, Lt. Col. Strobl sits next to a young woman who cheerily offers him a magazine to read, and also texts someone that she is sitting next to a \"HOT soldier,\" which Lt. Col. Strobl happens to catch a glimpse of and corrects her that he is actually a Marine. Upon landing, the airliner captain, a retired U.S. Air Force officer and former A-10 attack jet pilot in the first Persian Gulf War, makes a special announcement, asking for the other passengers to remain seated so that Lt. Col. Strobl has a chance to deplane first and render honors for PFC Phelps as his casket is unloaded. The woman sitting next to the Lt. Col, who had no idea he was on an escort mission for a fallen Marine, is visibly touched, and apologizes for potentially being insensitive with her earlier actions; Lt. Col. Strobl instead warmly thanks her for her company.\nAfter unloading, Lt. Col. Strobl is greeted by the funeral director, and they load PFC Phelp's casket for the final part of his journey. Along the way, an impromptu funeral procession forms along the highway, as people in passing cars see Lt. Col. Strobl and realize what the hearse is carrying. After arriving in the town where PFC Phelps's parents reside, the Lt. Col. is greeted by a younger fellow Marine, who along with a partner had driven up from Salt Lake City a few days earlier to inform PFC Phelps's family of his death. The men proceed into the funeral home, where the younger Marine suggests that this would be a good time to place some personal items that PFC Phelps's family had asked him to place into the casket; Lt. Col. Strobl agrees, and despite it being a closed casket ceremony, insists that he wants to make sure PFC Phelps's uniform is correct and in place. As the men open the casket, both Marines have a strong, emotional reaction to seeing PFC Phelps; Lt. Col. Strobl remarks that even though the staff at Dover Port Mortuary knew it was going to be a closed casket ceremony, they still made every effort to make sure that PFC Phelps was prepared and dressed perfectly.\nLater that evening, a memorial event is held at the local VFW, to which Lt. Col. Strobl was invited earlier. The local veterans, along with PFC Phelps's sergeant (who was with him when he was killed) and others, all welcome Lt. Col. Strobl with sincere gratitude for \"bringing Chance home.\" They reminisce about Chance's outgoing personality, and recount some war stories of his, including, eventually later in the evening, the sergeant's story of what happened the day that PFC Phelps was killed (apparently in the firefight following the IED attack on their convoy, heard at the beginning of the film, in which PFC Phelps was the gunner on a machine gun and was able to draw the focus of much of the enemy fire, allowing for his comrades to safely find cover for themselves). As the attendees of the memorial leave at the end of the evening, Lt. Col. Strobl remarks to the U.S. Marine 1.st Division Korean War veteran who first introduced himself at the bar, that he was eligible for a tour of duty in Iraq himself, but instead \"got used to the sight of his wife and kids\" and put in an application for an office tour instead, which was granted. Even though colonel Strobl is a recipient of the Marine Combat Action Ribbon from his service in the First Gulf War, he feels somewhat ashamed of his actions, to which the Korean War veteran reminds him that there is no shame in loving his family, and that he is not any less of a Marine than PFC Phelps or his sergeant or any of the other men serving in combat in Iraq, because now, he is a witness for PFC Phelps, having served this escort mission, and he is now responsible in no small part for PFC Phelps's legacy.\nPrior to the funeral the next day, Lt. Col. Strobl meets PFC Phelps's family for the first time, and makes a point of mentioning that PFC Phelps was treated with great care and dignity across his entire journey. He hands over PFC Phelps's personal effects, as well as a letter from PFC Phelps's platoon leader. He finally leaves them with the cross that was given to him by a flight attendant, saying that eventually he realized it wasn't really given to him, only that he was carrying it for them. With the father's voiceover reading the platoon leader's letter in the background, we see PFC Phelps receive a funeral with full military honors, and his divorced parents are each presented with a flag, \"on behalf of the President, the Commandant of the Marine Corps, and a grateful nation,\" honoring their son. As the attendees all pay their respects, Lt. Col. Strobl renders one final salute as the last one left at the ceremony. The film ends as Lt. Col. Strobl reminisces about his experience, saying that despite the fact he didn't know PFC Chance Phelps prior to his death, somehow after escorting him home and laying him to rest, he now misses him. We then see Lt. Col. Strobl returning home and embracing his wife and children, as the final shot of the film reveals that the mailbox of the unknown house depicted at the beginning of the film says \"Phelps.\"\n                            In Memory of Lance Corporal Chance Russell Phelps \n                                          An American Hero"}