{"mid": "TalesOfTerror", "IMDB_id": "tt0056552", "title": "Tales of Terror", "plot": "The film uses an anthology format, presenting three short sequences based on the following Poe tales: \"Morella\", \"The Black Cat\" (which is combined with another Poe tale, \"The Cask of Amontillado\"), and \"The Facts in the Case of M. Valdemar\". Each sequence is introduced via voiceover narration by Vincent Price, who also appears in all three narratives.\n=== \"Morella\" ===\nWhen Lenora Locke (Maggie Pierce) travels from Boston to be reunited with her father (Vincent Price) in his decrepit and cobwebbed mansion, she finds him drunk, disordered, and depressed. He refuses her company, insisting that she killed her mother Morella (Leona Gage) in childbirth. Lenora then discovers her mother's body decomposing on a bed in the house. Lenora cannot return to Boston and remains in the house to care for her father. His feelings soften towards her when he learns she has a terminal illness. One night Morella's spirit rises, and kills Lenora in revenge for her childbed death. Morella's body is then resurrected, becoming as whole and as beautiful as she was in life. This is in exchange for Lenora's, which is now decomposing where Morella lay. Morella strangles her horrified husband as a fire breaks out in the house. Then Morella and Lenora return to their original bodies, Lenora smiling as she lies on her dead father, rotten Morella cackling as the flames consume the house. The cast includes Edmund Cobb as a coach driver.\n=== \"The Black Cat\" ===\nMontresor Herringbone (Peter Lorre) hates his wife Annabelle (Joyce Jameson) and her black cat. One night on a ramble about town, he happens upon a wine tasting event and challenges the world's foremost wine taster, Fortunato Luchresi (Vincent Price), to a contest. Herringbone becomes drunk. Luchresi escorts him home and meets his wife. Time passes, and Annabelle and Luchresi become intimate. The cuckolded Herringbone then entombs them alive in an alcove in the basement. The authorities become suspicious and two policemen (John Hackett and Lennie Weinrib) visit the house to investigate. Hearing screeching behind a basement wall, they knock the wall down to discover the dead lovers — and Annabelle's black cat, which Herringbone had accidentally walled up with the lovers. Cast includes Wally Campo as bartender Wilkins and Alan DeWitt as the Wine-Tasting Chairman.\n=== \"The Facts in the Case of M. Valdemar\" ===\nDying from a painful disease, M. Valdemar (Vincent Price) employs a hypnotist, Mr. Carmichael (Basil Rathbone), to alleviate his suffering by putting him under various trances. He then remains between the world of the living and the dead. In a trance, Valdemar begs Carmichael to release his soul so he can die but Carmichael cruelly refuses. Months pass and Valdemar's putrefying body remains in his bed under the complete control of Carmichael. The hypnotist tries to force Valdemar's wife Helene (Debra Paget) to marry him. When she refuses, he attacks her. Valdemar's putrid body rises from the bed and kills Carmichael. Helene is rescued by Valdemar's physician (David Frankham) and carried from the scene of horror."}