{"mid": "TalesFromTheCrypt", "IMDB_id": "tt0069341", "title": "Tales from the Crypt", "plot": "Five strangers go with a tourist group to view old catacombs. Separated from the main group, they find themselves in a room with the mysterious Crypt Keeper (Ralph Richardson), who details how each of the strangers may die.\n… And All Through the House (The Vault of Horror #35) \nAfter Joanne Clayton (Joan Collins) kills her husband (Martin Boddey) on Christmas Eve, she prepares to hide his body but hears a radio announcement stating that a homicidal maniac (Oliver MacGreevy) is on the loose. She sees the killer (who is dressed in a Santa Claus costume) outside her house but cannot call the police without exposing her own crimes.\nBelieving the maniac to be Santa, Joanne's young daughter (Chloe Franks) unlocks the door and lets him into the house, whereupon he starts to strangle Joanne to death.\nReflection of Death (Tales from the Crypt #23) \nCarl Maitland (Ian Hendry) abandons his family to be with Susan Blake (Angela Grant). After they drive off together, they are involved in a car accident. He wakes up in the wrecked car and attempts to hitch-hike home, but no one will stop for him. Arriving at his house, he sees his wife (Susan Denny) with another man.\nHe knocks on the door, but she screams and slams the door. He then goes to see Susan to find out that she is blind from the accident. She says that Carl died two years ago from the crash. Looking in a reflective tabletop he sees he has the face of a corpse. Carl then wakes up and finds out that it was a dream but the moment he does, the crash occurs as it did before.\nPoetic Justice (The Haunt of Fear No. 12, March–April 1952) \nEdward Elliott (David Markham) and his son James (Robin Phillips) are a snobbish pair who resent their neighbour, dust man Arthur Grimsdyke (Peter Cushing) who owns a number of animals and entertains children in his house. To get rid of what they see as a blight on the neighbourhood, they push Grimsdyke into a frenzy by conducting a smear campaign against him, first resulting in the removal of his beloved dogs (one of them came back to him), persuading a member of the council to have him removed from his job, and later exploiting parents' paranoiac fears about child molestation.\nOn Valentine's Day, James sends Grimsdyke a number of poison-pen Valentines, supposedly from the neighbours, driving the old man to suicide. One year later, Grimsdyke comes back from the dead and takes revenge on James: the following morning, Edward finds his son dead with a note that says he was bad and that he had no heart-- the word \"heart\" represented by James's heart, torn from his body.\nWish You Were Here (The Haunt of Fear #22, November–December 1953), is a variation on W. W. Jacobs' famed short story \"The Monkey's Paw.\"\nIneffective businessman Ralph Jason (Richard Greene) is close to financial ruin. His wife Enid (Barbara Murray) discovers a Chinese figurine that says it will grant three wishes to whoever possesses it; Enid decides to wish for a fortune; surprisingly, it comes true. However, Ralph is killed on the way to his lawyer's office to collect it. The lawyer (Roy Dotrice) then advises Enid she will inherit a fortune from her deceased husband's life insurance plan. She uses her second wish to bring him back to the way he was just before the accident but learns that his death was due to a heart attack (caused by fright when he sees the figure of \"death\" following him on a motorcycle).\nAs she uses her final wish to bring him back alive and to live forever, she discovers that he was embalmed. She tries to kill him to end his pain but because she wished him to live forever, every bit of him is alive. She has now trapped him in eternal pain.\nBlind Alleys (Tales from the Crypt No. 46, February–March 1955)\nMajor William Rogers (Nigel Patrick), the new incompetent director of a home for the blind (making up mostly of elderly and middle-aged men), makes drastic financial cuts, reducing heat and rationing food for the residents, while he lives in luxury with his dog Shane, a German Shepherd. When he ignores complaints and a man dies due to the cold, the blind residents, led by the stone-faced George Carter (Patrick Magee) exact an equally cruel revenge.\nAfter Carter and his group subdue the staff, they lure and trap Major Rogers as well as his dog in two separate rooms in the basement. The blind men then begin constructing in the basement a maze of narrow corridors, some of them lined with razor blades. They starve the Major's dog, then place the Major in the maze's centre and turn off the lights. As the major attempts to escape, cutting himself and bleeding, the inmates release the starving dog...\nAfter completing the final tale, the Crypt Keeper reveals that he was not warning them of what would happen, but telling them what had happened; they have all \"died without repentance\". Clues to this twist can be spotted throughout the film, including Joan Collins' character wearing the brooch her husband had given her for Christmas just before she killed him. The door to Hell opens, and the visitors all enter. \"And now… who is next?\" asks the Crypt Keeper, turning to face the camera. \"Perhaps you?\" (The earlier Amicus anthology Torture Garden featured a similar ending, breaking the fourth wall)."}