{"mid": "TallTale", "IMDB_id": "tt0111359", "title": "Tall Tale", "plot": "In 1905, Daniel Hackett (Nick Stahl), a young farmer from the western town of Paradise Valley, is unhappy with his life as a farmer and dreams of life in New York City. His father, Jonas (Stephen Lang), likes to tell Daniel tall tales about Pecos Bill, Paul Bunyan and John Henry to which Daniel has heard many times leading him to doubt their existence. Meanwhile, Paradise Valley is being coveted by a greedy developer, J.P. Stiles (Scott Glenn). Stiles attempts to convince area farmers to sell their land to him, most notably Jonas as his farm lies in the center of where he wants to develop. However, when Jonas refuses to hand up his deed, Stiles hunts him down and shoots him, but not before Jonas hands the deed off to Daniel for safe keeping.\nWith Jonas in critical condition and unable to farm, his land is put at risk. Upset, Daniel runs out to hide in his father's boat and falls asleep. When Daniel awakes, he discovers that the boat had come untied and drifted downstream to the deserts of Texas. After a brief encounter with some thieves, Daniel is rescued by legendary cowboy Pecos Bill (Patrick Swayze). The duo later team up with lumberjack Paul Bunyan (Oliver Platt), and strong African American ex-slave John Henry (Roger Aaron Brown). Each of these heroes hooks up with Daniel and becomes involved in an increasingly bitter and boisterous fight against Stiles, whose plans to buy up land threaten the very strength of the folk heroes and the well-being of the common people.\nWhen Stiles takes the deed, Daniel wakes up realizing it was just a dream. He ventures towards Stiles train who was about head out into the lands. Daniel confronts him, and they attempt to run him over, until John arrives and holds the train. Stiles orders his men to kill them, but Pecos arrives and shoots off their trigger fingers, and the villages join in to help, while Paul, who went inside while nobody noticed, cuts down the mine poles. Daniel then finishes off the last pole killing Stiles and his men, and the crowd cheers for him.\nDaniel then returns to the farm and admits that the stories were true and their land is important. Paul with his blue ox Babe, and John with his mule Cold Molasses, say goodbye to Daniel and disappear afterwards. Pecos leaves his horse, Widow-Maker to Daniel and twirls his lasso at a twister for his departure."}