{"mid": "Tangerine", "IMDB_id": "tt3824458", "title": "Tangerine", "plot": "Transgender sex worker Sin-Dee Rella, who has just finished a 28-day prison sentence, meets her friend Alexandra, another trans sex worker, at a donut shop in Hollywood on Christmas Eve. Alexandra accidentally reveals that Sin-Dee's boyfriend and pimp Chester has been cheating on her with a cisgender woman. Sin-Dee storms out to search the neighborhood for Chester and the woman.\nAlexandra hands out flyers for her musical performance that evening, and argues with a client who refuses to pay; their argument is broken up by the police. Razmik, an Armenian cab driver, picks up a prostitute, but ejects her from his cab when he discovers she is not transgender. He meets Alexandra and fellates her in a car wash, then goes home to eat Christmas dinner with his family. Alexandra goes to the bar for her performance, but no customers have arrived.\nSin-Dee finds the woman she is looking for, Dinah, at a brothel in a motel. She hauls her onto a bus to find Chester. Dinah taunts her for believing she is Chester's only girlfriend. Sin-Dee realizes she is late for Alexandra's performance and drags Dinah there. The two smoke crystal meth in the bar bathroom and Sin-Dee applies Dinah's make-up. Alexandra performs to a mostly empty bar.\nRazmik leaves his family to attend Alexandra's performance, saying he has to work, but discovers he is too late and searches for Sin-Dee. Suspicious, his mother-in-law asks another Armenian cab driver to take her to him.\nSin-Dee, Alexandra and Dinah go to the donut shop, where Sin-Dee confronts Chester. He insists Dinah means nothing to him. Razmik arrives, followed by his mother-in-law; she calls Razmik's wife, who arrives with their infant daughter. An argument escalates until the shop owner calls the police. Razmik and his family go back to their apartment. Dinah walks back to the brothel, but is told there is no room for her.\nOutside the donut shop, Chester tells Sin-Dee that he also slept with Alexandra. Hurt, Sin-Dee leaves and tries to pick up some clients; they throw urine in her face and drive away shouting transphobic slurs. Alexandra takes Sin-Dee to a laundromat to clean her clothes and wig, and gives her her own wig to wear while they wait."}