{"mid": "TankGirl", "IMDB_id": "tt0114614", "title": "Tank Girl", "plot": "In 2022, a comet strikes Earth causing an 11-year drought. By 2033, most of the little remaining water is held in reserve by Kesslee (Malcolm McDowell) and his Water & Power (W&P) corporation, which uses the water to control the population. Rebecca Buck – \"Tank Girl\" (Lori Petty) – is a member of a commune in the Australian outback that operates the last water well not controlled by the corporation. In an attack on the commune, W&P troops kill Tank Girl's boyfriend, Richard (Brian Wimmer), and capture Tank Girl and her young friend Sam (Stacy Linn Ramsower). Rather than killing her, Kesslee tortures and enslaves the defiant Tank Girl. Jet Girl (Naomi Watts), a talented but introverted jet mechanic who has given up trying to escape W&P, urges Tank Girl to make less trouble for their captors, though Tank Girl refuses. Among other forms of torture, W&P personnel push her down into a long pipe to induce claustrophobia.\nThe mysterious Rippers slaughter guards at the W&P compound, then escape undetected. Kesslee uses Tank Girl to lure the Rippers into the open, but they gravely wound Kesslee and let Tank Girl and Jet Girl escape. Jet Girl steals a fighter jet from W&P and Tank Girl steals a tank, which she modifies heavily. The girls learn from the eccentric Sub Girl (Ann Cusack) that Sam is working at a sex club called Liquid Silver. They infiltrate the club, rescue Sam from a pedophile, Rat Face (Iggy Pop), and then humiliate the club's owner, \"The Madame\" (Ann Magnuson), by making her sing Cole Porter's \"Let's Do It\" at gunpoint. W&P troops break up the performance and re-capture Sam. Tank Girl and Jet Girl wander the desert and find the Rippers' hideout. They learn that the Rippers are supersoldiers created from human and kangaroo DNA by a man called Johnny Prophet. Tank Girl befriends a Ripper named Booga (Jeff Kober), while a Ripper named Donner (Scott Coffey) shows romantic interest in Jet Girl. Despite the objections of the Ripper T-Saint (Ice-T), who is suspicious of the girls, the Rippers' leader Deetee (Reg E. Cathey) sends the pair out to capture a shipment of weapons. The girls bring the weapon crates back, though most of them are empty. After finding Johnny Prophet dead in one of the containers, the girls and the Rippers realize that W&P has tricked them.\nThe girls and the Rippers sneak into W&P, where they are ambushed. Kesslee, whose body had been reconstructed by the cybernetic surgeon Che'tsai (James Hong), reveals that Tank Girl has unknowingly been bugged. Deetee is killed. While the Rippers turn the tide of the battle, Jet Girl kills Sergeant Small (Don Harvey), who had earlier sexually harassed her. Kesslee reveals that Sam is in the pipe, her life endangered by rising water. Tank Girl uses her tank to kill Kesslee, then pulls Sam out of the pipe. The film ends with an animated sequence showing water starting to flow freely. Tank Girl drives down rapids, pulling Booga behind on water-skis, then takes them over a waterfall, shouting for joy."}