{"mid": "Taps", "IMDB_id": "tt0083169", "title": "Taps", "plot": "Bunker Hill Military Academy has just concluded another school year. Cadet Brian Moreland, a junior, meets privately with the academy commandant, retired Brigadier General Harlan Bache. Bache promotes Moreland to Cadet Major, the paramount rank at BHMA. Bache also reflects on the time when he was a cadet at West Point (Moreland's intended college), as well as a graduate of BHMA prior to that, and how he dreads his forthcoming retirement. Moreland is congratulated first by his friend Cadet Captain Alex Dwyer, as well as by Cadet Captain David Shawn and Cadet Lieutenant Edward West. Shawn leads a celebration in the hallway. The commencement is celebrated with a parade and pass and review. Following the ceremonies, General Bache announces that BHMA's board of trustees is selling the school to real estate developers. The school will remain open for one year in order to allow the seniors to graduate and give the underclassmen time to apply to other schools. The delay gives many cadets hope that BHMA can be saved. Bache also hopes that the institute can be saved, as he remarks to Moreland \"We are here, and the condos are not\".\nThe graduation ceremony is followed by a ball that evening. Outside the gates, a brawl erupts when several local teenagers harass the cadets, which escalates into one local assaulting a sentry. General Bache tries to break up the fight, but his service pistol is seized by one of the teens and the weapon discharges, killing a second teen. Although the magazine had been removed, a round was still in the chamber. Bache is arrested and charged with manslaughter. However, the trauma of the event combined with the arrest triggered a heart attack and Bache is hospitalized in critical condition. The board of trustees closes BHMA immediately.\nSince Bache is ill, Moreland meets with the officers of the cadet corps and they take control of Bunker Hill. The Dean of Students arrives with the local Sheriff to empty the armory. They find the weapons in the hands of an armed cadre led by Major Moreland, who demands to meet with General Bache and the trustees so that BHMA will be kept open. The Dean and Sheriff are escorted off the campus by armed cadets, who secure the perimeter.\nMore cadets are sent to a local warehouse for the purpose of restocking BHMA's provisions, but one of the trucks breaks down on the way back. As Dwyer is fixing the engine, townies surround the truck, demanding vengeance for the death of their friend. Shawn fires several bursts from his M16 into the air, dispersing the mob. The cadets abandon the stalled truck, fleeing the scene in the second truck, ramming a police car that was blocking their path.\nThe police surround the campus, but Shawn oversees a defense of the wall which turns into a standoff. A delegation of parents and trustees is admitted. The parents include Moreland's father, a master sergeant in the US Army, who bluntly orders his son to end the standoff. He fails to sway Moreland. To show the police and parents that none of the boys are being held against their will, Moreland assembles the cadets and offers them a chance to walk out. They all choose to stay. The siege grows more tense when the National Guard, led by Colonel Kerby, arrives. Kerby negotiates with Moreland; the Colonel admires the academy, and does not wish to see it closed. But his loyalty is to the state legislature, which has been inundated with calls from concerned families and from locals who are scared by the standoff. Despite the Colonel's diplomatic approach, he fails to sway Moreland.\nThe next morning, it is discovered that eleven cadets have fled. Moreland assembles the battalion, to whom he again offers the opportunity to leave. Led by Lt. West, a number of the cadets discard their weapons and leave. Shortly thereafter, the Academy's water and electricity are shut off. Cadet Pierce is burned while restarting the school's gasoline-powered generator. An ambulance is permitted to enter and take the injured Pierce away. Colonel Kerby once again tries to reason with Moreland, and Moreland agrees, provided he be brought to the hospital and Bache orders him to stand down. Kerby says that Bache died the night before. The cadets hold a military memorial service in his honor. Kerby and the Guardsmen stand at attention at the front gates.\nThe next night, a tank approaches the main gate. Two young cadets, Derek and Charlie, are on sentry duty. Derek, the younger of the two, panics and rushes to surrender. Charlie tries to stop him. Derek drops his rifle, which goes off as it hits the ground. The Guardsmen open fire. Derek safely reaches the gate, but Charlie is killed.\nCharlie's death weakens Moreland’s resolve and Dwyer persuades him to end the occupation. They muster the cadets and order them to stand down. Everyone complies except Shawn, who opens fire from the barracks with an M60 machine gun. As the Guardsmen return fire, Dwyer and Moreland rush inside to stop Shawn. When Moreland attempts to stop Shawn, they are both riddled with bullets. Dwyer carries Moreland's body out of the barracks as Kerby, the National Guardsmen, and the remaining Cadets look on."}