{"mid": "Tarantula", "IMDB_id": "tt0048696", "title": "Tarantula", "plot": "A severely deformed man stumbles through the Arizona desert, falls and dies. Dr. Matt Hastings, a doctor in the nearby small town of Desert Rock, is called in by the Sheriff to examine the body at the local mortuary. Asked to define the cause of death, he finds himself perplexed: the deceased was someone he knew and had just seen recently – biological research scientist Eric Jacobs – whose deformity appears to be acromegaly, a distortion which takes years to reach its apparent present state. Dr. Hastings asks to be allowed to perform an autopsy to clarify the diagnosis. The sheriff refuses, judging an autopsy unnecessary because there is no indication of foul play. Hastings then approaches Jacobs' colleague, Dr. Gerald Deemer, who more bluntly refuses permission, then signs Jacobs' death certificate in lieu of Hastings, with heart disease listed as the cause of death.\nBothered still by the anomaly, and also by Deemer's abruptness, Hastings later drives to Deemer's combined home and research lab, located in an isolated mansion in the desert far from town. Deemer apologizes for his hostility, blaming it on his grief, then insists that Jacobs had developed acromegaly incredibly rapidly, over just four days. He cannot offer an explanation but attempts to convince Hastings this was only an anomaly, not a result of anything sinister. Hastings appears to accept this apology.\nAfter Hasting leaves, Deemer goes to his closed lab, where huge cages contain white rabbits and mice, some of enormous size. Deemer examines each of the oversized specimens, noting when each last received an \"injection\", and how many each has had altogether. Then he turns to observe a glass-fronted inset in the back wall, as a different sort of specimen slides into view inside - a tarantula bodily the size of a large dog, plus legs.\nAs Deemer finishes his observations of this creature, a second deformed man appears, attacks Deemer and begins destroying the lab. During this rampage the lab catches fire and the glass covering the tarantula's cage is shattered. The man grabs a hypodermic that Deemer was preparing, knocks him out, and injects him with the contents. As flames and electrical sparking rage over the lab, the arachnid escapes outdoors, and the deformed man collapses and dies. Deemer regains consciousness, grabs a fire extinguisher, and puts out the fire. That night, Deemer calmly buries the body of his assailant - whom he has recognized from the first attack as his other assistant, Paul Lund - in the desert.\nThe following day, the intercity bus brings a newcomer to town, a young, beautiful woman who is expecting to be met by Dr. Deemer. Told by the hotel clerk that she will have to wait until the only taxi in town returns from a mission, she accepts a ride from Dr. Hastings, who is again going to Deemer's place and is apprised of her plight. She introduces herself to him as Stephanie Clayton, nicknamed \"Steve\", who has signed on to assist in the lab, to replace Paul Lund, as part of her doctoral degree program.\nWhen they arrive at the mansion, Deemer tells them that the fire was caused by an equipment malfunction. He indicates that all the animals were killed in the fire, and explains that Lund has already left his employ. As Steve's contract stipulates that she live in Dr. Deemer's residence, Dr. Hastings leaves her there with her suitcases. Steve begins working in the lab and proves to be a capable lab assistant.\nA couple of days later, Dr. Hastings finds a mystery has arisen, involving clean-picked cattle carcasses and pools of a thick white liquid up to eight feet in diameter, when the Sheriff calls on him for help. Unknown to anyone, the cause is the tarantula, now the size of Deemer's mansion, which is hungrily beginning to ravage the countryside: the next night, a horse-rancher is killed by the spider outside his stable, and later a pickup truck is flipped by the tarantula in order to get at the two men inside. Elsewhere, two hoboes trying to enjoy a meal and a smoke on the open range are chased and killed.\nWhile this carnage is occurring, Hastings has decided to pay a call on Steve. Explaining that Deemer has been acting and looking ill recently and gone to bed, she shows Matt what they have been working on - the use of radioactive elements to produce an artificial super-nutrient which, once perfected, could provide an unlimited food option for humanity. She shows Matt some of the giant lab-animals created just since her arrival as an unintended side-effect of the nutrient. Suddenly Deemer appears, furious. He chews out Steve for revealing \"secret\" work and orders Matt to leave. Before he goes, he notices there are some subtle changes in Deemer's appearance as well as in his demeanor.\nThe following day at the destroyed horse ranch, Hastings once again appears at the request of the Sheriff and, finding again pools of the strange, thick liquid, decides an analysis of this substance might solve the mystery. He takes a sample and flies it to the university in Phoenix, where Dr. Townsend determines that it is tarantula-venom, only in such a quantity that only a monster-spider could produce. After viewing a film prepared by Townsend, showing the predatory ferocity of a normal tarantula, he phone calls Dr. Deemer but is told by Steve that he has become even more ill and is again abed. He again appears behind her, this time hanging up the phone. Matt thus hastens to his airplane and flies quickly back to Desert Rock.\nUpon arriving there, he drives to the Deemer mansion, where he finds Deemer, severe acromegalic deformities rapidly setting in, resignedly under the care of Steve as he knows he is nearing death. He divulges all he knows about the nutrient's effects on humans and animals and tells of Lund's death. Matt then returns to town to brief the sheriff on what he has learned from Dr. Townsend and at the mansion. As night falls, the tarantula comes to the mansion. Deemer is killed but Steve escapes when Hastings returns by car. The tarantula pursues them down the highway toward the town. The Sheriff and his men intercept the pursuit, but their guns don't faze the tarantula. Hastening to town, they gather dynamite, but a blast big enough to blow up the highway doesn't faze the monster either. As they complete a hasty evacuation of the town, the Air Force, summoned by the Sheriff, arrives in the form of a jet squadron which launches a napalm attack, successfully incinerating the giant tarantula at the town's edge."}