{"mid": "TeachingMrsTingle", "IMDB_id": "tt0133046", "title": "Teaching Mrs. Tingle", "plot": "Leigh Ann Watson is a high school student living in a small sleepy town of Grandsboro in Northern California with her single mother Faye who works as a waitress. Leigh Ann's aim is to achieve top grades to become valedictorian and leave the rather dead end town. However, her grade in history class is threatened by her sadistic and thoroughly vindictive teacher, Mrs. Eve Tingle. Mrs. Tingle has a special dislike for Leigh Ann and down-grades Leigh Ann's well-designed, though slightly misfired, project.\nFellow student Luke Churner takes the final exam papers from Tingle and makes a copy. He offers Leigh Ann, whom he has feelings for, the papers but she insistently refuses to cheat. Ultimately, Luke stashes the papers in Leigh Ann's backpack without her consent. Out of nowhere Tingle happens by, discovers the papers in Leigh Ann's backpack, and threatens to expel her for cheating. Mrs. Tingle heads to Principal Potter's office, however he has left for the day and decides to tell him tomorrow morning. This gives Leigh Ann, her best friend, Jo Lynn Jordan, an aspiring actress who has feelings for Luke, and Luke time to think of a plan to stop Mrs. Tingle.\nLeigh Ann, Jo Lynn, and Luke head to Mrs. Tingle's house that night and try to convince Mrs. Tingle that Leigh Ann is innocent. Mrs. Tingle, however, refuses to listen and hints that she believes them but doesn't care. Luke picks up a loaded crossbow and aims it at Mrs. Tingle, threatening her. A physical struggle ensues, the crossbow goes off, and in the ensuing mêlée Mrs. Tingle is accidentally knocked unconscious. The students panic and tie Mrs. Tingle to her bed. Leigh Ann returns to her house and promises to return in the morning, while Luke and Jo Lynn are left to watch Mrs. Tingle in the bedroom. While under Jo Lynn's watch, Mrs. Tingle regains consciousness and playing on her guilt, Mrs. Tingle feigns dizziness and understanding for the prank and asks to be untied. Jo Lynn proceeds to untie her from the bed, and Mrs. Tingle immediately attacks Jo Lynn and tries to throttle her on the bed. Luke, with loaded crossbow aimed at Mrs. Tingle, convinces her otherwise, and she is retied to her bed, this time with a gag.\nThe trio gathers together at Mrs. Tingle's house the next morning. Jo Lynn then calls the school and impersonates Mrs. Tingle calling in sick in order to buy the trio some time, but all are unsure of what they should do next. Leigh Ann and Luke go to school, leaving Jo Lynn to watch Mrs. Tingle. When they return home, the trio devise a plan to blackmail Mrs. Tingle by using fake photos of Luke and Mrs. Tingle in bed together, suggesting they were having an affair. Meanwhile, Mrs. Tingle plays mind-games with Jo Lynn, planting seeds of jealousy about Leigh Ann's supposed relationship with Luke. Later that day, the plan goes awry when the school's gym teacher, Coach Richard Wenchell, called 'Spanky' by Mrs. Tingle, arrives and is revealed to be having an affair with her. Jo Lynn, again, impersonates Mrs. Tingle and blindfolds Coach Wenchell to hide her identity. When Wenchell passes out after a high intake of alcohol, Leigh Ann, Luke and Jo Lynn decide to blackmail Mrs. Tingle by producing photographic evidence of her love affair with Wenchell.\nWhile Leigh Ann and Luke leave to have the pictures printed and take an unconscious Coach Wenchell home undetected, Mrs. Tingle manipulates Jo Lynn into turning against Leigh Ann by revealing to her that Leigh Ann and Luke spent the night together at a party. Distraught, Jo Lynn leaves. Leigh Ann and Luke arrive back and cannot find Jo Lynn, thinking Mrs. Tingle had something to do with it. Mrs. Tingle eventually reveals that she hates Leigh Ann because Leigh Ann has, unlike herself, the potential to leave their small town and experience life. Mrs. Tingle's romantic self-revelations are incredible, furthering her captors' disdain of her. Later, she also opines that Leigh Ann does not have the guts to do anything risky that might get her in trouble; in response, an angry and infuriated Leigh Ann kisses Luke and has sex downstairs with him on Mrs. Tingle's couch. Luke and Leigh Ann find Mrs. Tingle's history grade book, and with little persuasion from Luke, decides to cheat by changing Mrs. Tingle's grade book. Leigh Ann marks down her rival, Trudie Tucker's top A grade down to a B, and upgrades her own C to an A+.\nThe next day at school, Jo Lynn ignores Leigh Ann, still hurt over her betrayal. A regretful Leigh Ann tries to make amends with Jo Lynn, but an admission that she'd had sex with Luke further infuriates Jo Lynn and she accuses Leigh Ann of being just like Mrs. Tingle.\nMrs. Tingle escapes from her bonds, ties Luke down in her place and, using the loaded crossbow, once again threatens Leigh Ann. Jo Lynn also appears to be on Mrs. Tingle's side now saying she'll help blackmail and ruin Leigh Ann, but turns out to be only faking it so she could help her friends. After a violent fight, Mrs. Tingle appears to tumble to her death down the staircase, but quickly recovers, scrambles to her feet, and picks up a crossbow. She fires it wildly, trying to hit Leigh Ann. Trudie Tucker walks through the door, gets hit in the chest by the bolt, and collapses. Leigh Ann checks her pulse and says she's dead. Principal Potter arrives to check up on Mrs. Tingle and is horrified by the scene. Guilt-ridden, Tingle confesses that she shot Trudie while trying to kill Leigh Ann and wanted to make her fail. However, Trudie was protected by the thick textbook she was holding to her chest and is completely unharmed, which Leigh Ann already knew. Tingle is fired by Potter, who then calls the police. The film ends with Leigh Ann being named as valedictorian at graduation."}