{"mid": "TedBundy", "IMDB_id": "tt0284929", "title": "Ted Bundy", "plot": "In Seattle, Washington, 1974, law student Ted Bundy (Michael Reilly Burke) appears to be the typical friendly guy-next-door; but underneath this gentle facade lies a monster. After watching women from their home window while masturbating, Bundy builds the courage to commit his first murder. From there, he always manages to lure a young woman to his car by faking a broken arm or an illness then asking for help or by disguising himself as a police officer. Then he knocks her unconscious with a tool, ties her up and drives her to an arranged location where he rapes and murders her. Driving his yellow VW Beetle, he leaves a bloody trail through the United States. The police are left in the dark, as no one suspects the young man for his reputable character in the community; being a model citizen and top-student.\nIn 1975, one of his victims, Tina Gabler, escapes him when she throws herself from his moving car. Based on her description of his car, Bundy is stopped by a police officer and arrested. In his trunk, the officers find pantyhose masks, a hand saw, a crowbar, knives, ropes and handcuffs. Even though he is identified by Tina Gabler in a lineup, he denies ever having seen the woman. When he is visited by his girlfriend at the Colorado State Prison, he admits to her that charges are being brought against him for multiple murders but stresses the fact that there is no evidence, however, and that he will never be convicted; at this point she distances herself from him. Due to his wish to defend himself, he is granted access to the courthouse law library, and promptly escapes by jumping from an upper story window. He is jailed again after an auto theft, but manages to escape yet again months later. This time he overpowers four women in their home and brutally beats them. After the murder of a little girl he becomes heavily intoxicated and is recognized by a police officer and arrested after a short chase. At trial the judge sentences Ted to be executed by electric chair. After a brief chat on the phone, he makes a final statement before the execution is carried out."}