{"mid": "TeenWolfToo", "IMDB_id": "tt0094118", "title": "Teen Wolf Too", "plot": "Todd Howard (Jason Bateman), the cousin of Scott Howard, has recently been accepted into Hamilton University on a full athletic scholarship on the recommendation of Coach Bobby Finstock (Paul Sand), who was Scott's basketball coach at Beacontown High. Finstock's hope is that Todd has the family genes to become a werewolf and turn Finstock's new struggling boxing team into championship contenders. Having never been much good at sports, and because he is more interested in being a veterinarian, Todd is certain that Finstock has the wrong guy. During a meet and greet reception of school alumni, Todd has his first \"wolf-out\" while dancing with a seductive hostess. At first, Todd is horrified by his \"family affliction\", and fellow students begin to harass him. Then, during his first boxing match, after nearly getting knocked out, Todd has his second \"wolf-out\" only this time he is able to display his supernatural agility and strength and has a dramatic come from behind victory, thus earning the admiration of the students as well as the strict Dean Dunn (John Astin).\nWith his newfound fame comes girls, top grades and even the dean's car but as the year goes on, Todd realizes that he is losing his friends and self-respect. Todd seeks out advice from his uncle, Scott's father, Harold Howard (James Hampton), who helps Todd comes to terms with his responsibilities and prepares him for the championship. Todd also reconnects with his girlfriend, Nicki (Estee Chandler), who helps him regain his focus of being humble. Todd then decides that he will fight his championship match against Steve \"Gus\" Gustavson (Robert Neary), who Todd had prior issues with, as himself rather than the wolf much to the dismay of all except his uncle, girlfriend and Professor Tanya Brooks (Kim Darby) who unbeknownst to Todd is also a werewolf. After losing round after round, and nearly getting knocked out, Todd is tempted to become the wolf until he sees Nicki mouth the words \"I love you\" to him. This gives Todd the strength to overcome Gus and knocks him out to a roaring ovation."}