{"mid": "TeenTitansTroubleInTokyo", "IMDB_id": "tt0816671", "title": "Teen Titans: Trouble in Tokyo", "plot": "Jump City is attacked by a Japanese ninja called Saico-Tek. The Teen Titans manage to capture him, having their tower damaged in the process. Under interrogation, Saico-Tek reveals the identity of the one who sent him - Brushogun - then he ruptures the room's fire extinguisher system and mysteriously vanishes. Subsequently, the Titans head to Tokyo, Japan, to search for his master.\nUpon arriving Tokyo, after overcoming the language barrier (Starfire kisses a Japanese boy and learns how to speak Japanese, much to Robin's shock and jealousy) and fighting a Gorgo-like giant reptile, the Titans meet Tokyo's own supernatural defense force - the Tokyo Troopers - led by Commander Uehara Daizo. He shows the Titans around the Tokyo Troopers headquarters, and when Robin questions him on Brushogun, Daizo claims that Brushogun is nothing more than an urban legend.\nLeft with no villains to pursue, the Titans can do nothing else than to enjoy Tokyo as tourists. Beast Boy follows a girl around and is eventually lured to a karaoke bar, while Cyborg goes to an \"all-you-can-eat\" restaurant. Raven searches for book stores to read and incidentally finds a book describing the origins of Brushogun. Robin and Starfire explore Tokyo, then while sitting on Tokyo Tower they finally start to express their feelings for each other. They are about to share a kiss together, when suddenly Robin starts to focus on Brushogun again, and tells Starfire that they are heroes and can't be anything more. Upset, Starfire flies away with tears in her eyes.\nInvestigating alone, Robin is attacked once again by Saico-Tek and they get into a violent fight, which ends with Robin pummeling the ninja into the ground. When Saico-Tek does not rise, the crowd watching believes Robin has killed him. Despite his protestations of innocence, Robin is apprehended by Daizo. Elsewhere, Beast Boy and Cyborg are being chased by Beast Boy's fangirls from the karaoke bar (because they're infatuated with his performance) and the chefs from the restaurant (because Cyborg's bottomless appetite aroused their ire). Starfire, alone by herself, when a little girl manages to help her overcome her depression as she finally realizes that Robin does in fact have feelings for her.\nThe Mayor of Tokyo announces Robin's arrest and orders that the other Teen Titans must either turn themselves in or leave Tokyo at once. Starfire calls the other Titans for emergency. They are about to regroup when Brushogun sends out his minions to destroy each of the Titans. Cyborg is beset by a giant yellow robot who keeps trying to eat him, Beast Boy is attacked by a pink cat girl who turns out to be the girl he was following earlier, Raven is pursued by a ghostly figure in a graveyard, and Starfire is attacked by a small blue robot boy in the sky.\nRobin is transferred, but during the ride a slip of paper bearing the name \"Brushogun\" fits into the armored car carrying him and turns into a bomb and explodes, freeing him. Now on the run, Robin co-opts the identity of a Shinjuku mugger to collect information that Brushogun is in fact real. He is eventually found by the Tokyo Troopers, which leads to a car chase. Robin is surrounded front to back when Starfire comes to his rescue. Starfire takes Robin to a shrine hideout, where they try to kiss again when suddenly Cyborg, Raven, and Beast Boy, who have come back safely, barge in on them.\nAs Raven relates from the book she found, Brushogun was an artist who dreamed of bringing his beloved drawings to life using Japanese dark magic. The spell ultimately turned against the young artist, and he was transformed into Tokyo's first super villain, Brushogun, a being of paper and ink - capable to bring any creation he could imagine to life - until he suddenly disappeared. With this knowledge, Robin deduces Brushogun's hideout: the comic book publishing factory that they encountered earlier in the film. Breaking in, the Titans discover the withered form of Brushogun, trap-wired into a cursed printing press that taps into his powers to create the enemies the Titans have faced. He reveals that he had sent the first Saico-Tek to the Titans to lure them to Tokyo in order to stop the real culprit who had enslaved him: Daizo himself, who used Brushogun's power to create both his Tokyo Troopers and the monsters that they captured in order to gain a reputation as a hero.\nHowever, Daizo drops in on the heroes and forces Brushogun to create an army of animated ink minions. A mass battle ensues, culminating in Robin facing Daizo. With no options of escape left, Daizo hurls himself from a catwalk into the ink reservoir of the press, taking control of Brushogun's magic and transforming himself into a giant, hulking mass of ink and machinery, with Brushogun at the center. As the other Titans battle the creatures Daizo hurls at them, Robin frees Brushogun. As the old man peacefully fades away in his arms into the afterlife, his powers disappear and Daizo is left defeated and exposed. With the battle concluded, Robin tries to explain his true feelings for Starfire, but getting the message, she silences him. The two romantically share their first real kiss as the other three Titans look on, with Cyborg stating, \"Well, it's about time\".\nLater on, with Robin's name cleared, and Daizo sent to prison, the Titans are awarded medals of honor by the mayor for their actions of unlocking the truth, and the inhabitants of Tokyo welcome their new heroes. Robin and Starfire are seen as a romantic couple, Cyborg earns his own \"all-you-can-eat\" meal, Beast Boy remains popular among the girls from the karaoke bar, and Raven has been made a mascot for Japanese confections. Robin remarks that even superheroes need a vacation once in a while, to which Beast Boy declares that he wants to go to Mexico on their next vacation. This prompts Raven to slap him on the back of the head (albeit offscreen).\nThe end credits roll as each of the Titans sing the karaoke version of their theme song."}