{"mid": "TeenWolf", "IMDB_id": "tt0272412", "title": "Teen Wolf", "plot": "Scott Howard is a seventeen-year-old high school student who is sick of being average. Living in a small town, his only claim to popularity is playing on the Beavers; his school's basketball team (which is very unsuccessful) and fawning after his crush Pamela Wells, who is dating his rival Mick. Mick plays for the Dragons, an opposing team who tends to bully Scott on the court. Completely oblivious to his best friend Boof's affections, he constantly rebuffs her advances due to their history together.\nAfter a series of startling changes such as long hair suddenly sprouting, hands suddenly getting hairy, he decides to quit the team, but his coach changes his mind. Scoring a keg with his friend Stiles for a party, Scott and Boof end up alone in a closet and Scott gets rough when they begin making out, accidentally clawing Boof's back. When he returns home, he undergoes a strange transformation and discovers he is a werewolf. His father Harold confronts him and reveals he too is a werewolf, and that he'd hoped Scott wouldn't inherit the curse because \"sometimes it skips a generation\".\nScott reveals his secret to Stiles, who agrees to keep it a secret, but when Scott becomes stressed on the court at the next basketball game, he becomes the wolf and helps win their first game in three years. This has an unexpected result of fame and popularity as the high school is overwhelmed with \"Wolf Fever\", which quickly alienates Scott from Boof and from his teammates as he begins to hog the ball during games.\nStiles merchandises \"Teen Wolf\" paraphernalia and Pamela finally begins paying attention to Scott. After he gets a role as a 'werewolf cavalryman' in the school play alongside her, she comes onto him in the dressing room and the two have sex. Later, after a date set up to intentionally make Mick jealous, Pamela tells Scott that she's still seeing him and is not interested in Scott as a boyfriend, much to his disappointment. Harold tells Scott he is responsible for vice principal Rusty Thorne breathing down his neck, due to a scare he'd given him when he was in high school, and advises him to be himself and not the wolf.\nWith the upcoming spring dance, Boof agrees to go with Scott, but only if he goes as himself, not the Wolf. Scott goes by himself as the Wolf and has a great time. Boof, however, isn't impressed. She takes Scott out into the hallway and they kiss, which turns Scott back into himself. When they return to the dance, everyone pays attention to him, including Pamela. Mick gets upset and taunts Scott until the Wolf comes out and attacks him. His fans then turn on him and he runs out right into Thorne, who threatens to expel Scott from school. Harold appears and after sending Scott home, tells Thorne to back off. He then reminds Thorne of what he is capable of by leaning into him and growling, causing the Vice Principal to pee himself.\nScott renounces using the wolf all the time, quitting the play and the basketball team, who have come to expect it. During the championship game, Scott arrives and rallies his teammates to play without the wolf in order to win the game. Despite the odds, the team begins to play together and they make ground against the Dragons. During the final quarter, behind by one point, Scott is fouled by Mick at the buzzer. He makes both shots, winning the game and the championship to everyone's delight. Brushing past Pamela, Scott kisses Boof as his father comes down and hugs the two of them. Mick tells Pamela that they should leave, but she tells him to \"drop dead\" and storms off while everyone else celebrates the victory."}