{"mid": "Tekken", "IMDB_id": "tt0411951", "title": "Tekken", "plot": "Mere moments after Jin Kazama's departure from the Hon-Maru dojo, G Corporation helicopters approach and begin deploying Jack-4s pods into the building. Heihachi Mishima and his son, Kazuya, are awoken to a squadron bursting through the walls. At first, the two battle the Jacks together until Kazuya leaves Heihachi for dead while escaping. The Jacks hold down Heihachi while one activates its detonator, creating a huge explosion that seemingly kills Heihachi. The only witness to the event is Raven, a mysterious ninja clad in black, who relays Heihachi's death to his superiors.\nHeihachi's death is declared all over the world with everyone foreseeing the end of the Mishima Zaibatsu. However, somebody else takes over the company from the shadows and business continues as usual. Two months later, the King of Iron Fist Tournament 5 is announced. Meanwhile, Jin is plagued by nightmares triggered by his Devil Gene and tries to end it by entering the tournament. His father, Kazuya deduces that the Jack-4s were sent by G Corporation to assassinate him and decides to enter the tournament to take revenge against whoever had sent them.\nThe secret sponsor of the tournament and owner of the Mishima Zaibatsu is finally revealed to be Jinpachi Mishima, the father of Heihachi who was confined below Hon-Maru by Heihachi after a coup forty years ago. However, he was possessed by the Devil entity who granted him insurmountable power, after which he broke out of Hon-Maru during the Jacks' attacks. Jinpachi, in his last act of morality, had announced the tournament in the hope that someone would be able to kill him before his potential reign of terror could start. Jin makes it to the final round and faces his great-grandfather in a ferocious duel. Ultimately, Jin manages to defeat Jinpachi, who dissolves into dust and disappears shortly after, with his wish being fulfilled. Jin, after defeating him, becomes the new head of Mishima Zaibatsu, unaware that Heihachi survived the explosion and is working to retake the Zaibatsu."}