{"mid": "TempleGrandin", "IMDB_id": "tt1278469", "title": "Temple Grandin", "plot": "The film follows Temple Grandin's (Danes) life, providing background through a series of flashbacks. As a child, Grandin is uncommunicative and prone to tantrums and is diagnosed with autism. The medical consensus at that time was that autism is a form of schizophrenia resulting from insufficient maternal affection. Despite recommendations to place her in an institution, Grandin's mother (Ormond) hires therapists and works to help her daughter adapt to social interaction.\nAs a teenager, Temple travels to her aunt (O'Hara) and uncle's ranch to work. She observes cows being placed into a squeeze chute to calm them, and, during an anxiety attack, she uses the chute to calm herself. Inspired by her teacher, Dr. Carlock (Strathairn) to pursue science, she is admitted to Franklin Pierce College where she develops an early version of the squeeze machine to calm her during stressful times. Her college misinterprets the use of the machine as a sexual act and forces her to remove it. In response, she develops a scientific protocol to test subjects' reactions to the machine, proving it to be a purely therapeutic device. Grandin graduates with a degree in psychology and pursues a master's degree in animal science.\nTemple faces sexism while attempting to integrate into the world of cattle ranching but ultimately designs a new dip structure designed to allow cattle to voluntarily move through rather than being forced. Initially, the device works as intended, and garners favorable coverage in local press, but ranch hands, not understanding her design, dismissively alter it, resulting in the drowning of several cows. Angered, Grandin visits Carlock, and leaves the meeting encouraged to continue her efforts to improve the industry.\nThe conclusion of the film depicts an autism convention that Temple and her mother attend. Given the rudimentary state of autism research, the speaker cannot answer many questions from the audience, but Temple speaks out from the crowd explaining how she has adapted. Temple also describes her mother's contributions to her success. Excited by the opportunity to hear from someone with real experience, the audience calls her to the podium, marking Temple's transition into autism advocacy."}