{"mid": "Tenebre", "IMDB_id": "tt0084777", "title": "Tenebre", "plot": "Peter Neal, an American writer of violent horror novels, is in Italy to promote his latest work, Tenebrae. He is accompanied by his literary agent, Bullmer and his assistant, Anne. Neal is unaware that he has also been followed to Rome by his embittered ex-wife, Jane. Just before Neal arrived in Rome, Elsa, a young female shoplifter, was murdered with a razor by an unseen assailant. The murderer sends Neal a letter informing him that his books have inspired him to go on a killing spree. Neal is soon contacted by the police in the form of Detective Giermani and his female partner, Inspector Altieri.\nMore killings take place. Tilde, a beautiful lesbian journalist, is murdered at her home along with her lover Marion. Maria, the young daughter of Neal's landlord, is later hacked to death with a axe after discovering the killer's lair. Neal notices that TV interviewer Christiano Berti has an unusually intense interest in his work. That night, Neal and his Italian assistant Gianni watch Berti's house. Gianni approaches the house alone to get a better view and sees an assailant hack Berti to death with an axe. However, Gianni is unable to see the murderer's face. He returns to Neal to find the novelist has been knocked unconscious on the lawn.\nGiermani discovers that Berti was obsessed with Neal's novels, and believes the killings will stop now that Berti is dead. However, Bullmer, who is having an affair with Jane, is stabbed to death while waiting for his lover in a public square. Gianni is haunted by the thought that he missed the importance of something he saw at Berti's house. He returns to the house and suddenly remembers that he had heard Berti confessing to his attacker: \"I killed them all, I killed them all!\" Before Gianni can share this detail with anyone, he is strangled to death from the back seat of his car.\nJane sits at her kitchen table with a pistol when a figure leaps through her window and hacks off one of her arms. The wound sprays blood over the kitchen walls before Jane falls to the floor. The killer continues to hack at her until she is dead. A woman enters the house and is attacked from behind by the ax. As she falls down, the killer is revealed to be Neal, who thinks he just killed Anne. He turns the body over to discover he actually murdered Inspector Altieri. Giermani and Anne arrive soon afterwards; when Neal sees that he cannot escape, he slits his throat in front of them. Finding the telephone out of order, Giermani and Anne go outside to report the incident from the car radio. Giermani explains to Anne that, upon learning the details of Berti's sadistic murder spree, Neal recovered a previously repressed memory involving his murder of a girl who had sexually humiliated him when he was a youth in Rhode Island. The memory torments Neal and inflames his previously repressed lust for blood, driving him insane. Giermani returns to the house and is murdered by Neal, who had faked his own death. Neal waits inside for Anne to return, but when she opens the door, she accidentally knocks over a metal sculpture that impales and kills Neal. The horror-stricken Anne stands in the rain and screams repeatedly."}