{"mid": "TestamentOfYouth", "IMDB_id": "tt1441953", "title": "Testament of Youth", "plot": "The film starts with the image of a cheering crowd, celebrating the end of the war in 1918. Vera Brittain goes through the crowd, the only one not cheering, and ends up in a church, where several women are praying.\nIn 1914 Vera fights to become a student at Somerville College, Oxford. While her father is against it, her brother Edward supports her, along with his close friend Roland Leighton, and their friend Victor. Together the \"three musketeers\" and Vera have a good summer, swimming in a lake together and having long walks in the countryside. Roland, who is himself an aspiring poet, supports Vera in writing her own poems and pursuing her dream of becoming a writer someday. Roland and Vera start a shy romance. With the support of her brother Vera convinces her father to let her visit Oxford. The First World War breaks out and all three musketeers enlist. Vera helps convince her father to let Edward join the army.\nWhen she arrives in Oxford she sees, for the first time, two amputees being assisted. In a newspaper, Vera sees that four of the pages of the paper consist of only the names of the fallen (i.e. the dead). Vera volunteers to join the VAD Voluntary Aid Detachment as a nurse tending the wounded in a hospital. Some of the other nurses know that she is from Oxford and therefore try to \"break\" Vera. For the first time Vera is confronted with the wounded from the front, when she has to wash a stinking soldier, brought covered in mud and blood from the battlefield in Flanders to the hospital in London. Roland comes back on home leave and is traumatised by his experiences at the front. After a talk with Vera he proposes to her and they decide to get married on his next home leave. They have a good day together after which Roland has to get back to France, this time accompanied by Vera's brother Edward. Vera's father has a breakdown after his son leaves. In the hospital a stream of wounded soldiers arrive. Roland writes that he has been granted a leave at Christmas, and has been sent far behind the lines and is safe. Just before Christmas, he is killed and Vera finds this out via a telephone call received on Christmas day. Vera eventually finds out that Roland did not die \"bravely and painlessly\", as the letter she receives from the Army states. Due to a lack of morphine he suffered a long time at a casualty clearing station in France, shot in the abdomen. Later, her friend Victor is blinded by a gas attack and arrives at the hospital. Vera proposes to him, so they \"can take care of each other\", but he refuses, although he has been in love with Vera for a long time. The next night he dies.\nVera decides to go work in France herself. Her father is very proud of her. It's August 1917 and in France the situation of the wounded is very bad. Due to a lack of surgeons often the nurses have to perform amputations. Vera works in a hospital behind the lines, where she is first tasked with treating wounded Germans. Although she and her superior at first seem to not care much about the wounded enemy, they later both comfort a dying German soldier. After a big offensive the hospital is so crowded that the wounded have to lay in the mud outside. In a huge pile of corpses Vera discovers her brother, who is still alive. His infected wound gets treatment and he is saved. After that he is sent to Italy, which seems to be good news, because the fighting there is lighter. Edward wants Vera to proceed her academic career after the war, by visiting Oxford. Vera's mother has a nervous breakdown and Vera goes home. There she takes over the households, by cleaning the house and hiring a maid.\nEdward is killed on the Italian front.\nThe day of the truce comes. Like in the first minutes of the movie, Vera is shown as she marches stoically through a cheering crowd, to end up in a church where some women are praying. Honouring her brother's wish, Vera finally goes to Oxford, where she has nightmares about Roland's and Edward's death. Winifred Holtby, another student at the college, helps her cope with her trauma and to get back into the everyday world.\nAt a political discussion, about whether to punish or to forgive the Germans, most of the audience is for a \"revenge treaty\". George Catlin, who calls for a \"forgiving peace\" is booed upon. Vera gets on the stage and gives a speech about how she held the hand of a dying German soldier and that he was not different from her brother or her fiancé. Therefore she calls for a \"No more\" to war and revenge.\nThe last scenes show Vera swimming in the lake, where she swam with the \"three musketeers\" in 1914. She promises not to forget the dead and the screen turns to black."}