{"mid": "ThatDarnCat", "IMDB_id": "tt0120317", "title": "That Darn Cat", "plot": "\"Darn Cat\" or \"DC\" is a wily, adventurous Siamese tomcat who lives with young, suburbanite sisters Ingrid \"Inkie\" (Dorothy Provine) and Patricia \"Patti\" Randall (Hayley Mills), whose parents are traveling abroad at the time of the story.\nOne night, while making his rounds around town, teasing Blitzy the Bulldog as usual, DC follows Iggy (Frank Gorshin), a bank robber, to an apartment where he and his bank robber partner Dan (Neville Brand) are holding hostage a bank employee Miss Margaret Miller (Grayson Hall), whom they nickname \"Moms\". Without intention, the robbers let the cat in and he tries to eat the food that caused him to follow Iggy.\nWhen Miss Miller is alone for a moment (but still under total eye surveillance of the robbers) being forced to cook the meal for them, she removes DC's collar and tries to put her watch around his neck with a help inscription. In the process, she attempts to scratch the word \"help\" into the back of her watch. Then she releases him into the outdoors.\nWhen DC comes home, Patti discovers the watch. She has a gut feeling that it belongs to the kidnapped woman and visits the FBI. She tells Agent Zeke Kelso (Dean Jones) of her discovery, and Supervisor Newton (Richard Eastham) assigns Kelso to follow DC in hopes he will lead them back to the robbers' hideout.\nKelso sets up a headquarters in the Randalls' house and assigns a team to keep the cat under surveillance, but through a couple of careless moves, DC manages to elude them. Eventually a bugging device is implanted in DC's collar and the cat leads Kelso into a comical chase at a drive-in movie and several backyards. After several failed attempts and without hard evidence about the watch, Supervisor Newton shuts down the operation. Patti disguises herself as a hippie merchant who pretends to be a niece of a jeweler she knows well, Mr. Hoffsteddar (Ed Wynn), and she calls the FBI to persuade them that the watch belonging to Miss Miller was indeed hard evidence. Patti and Kelso rescue Miss Miller and bring the robbers to justice.\nSubplots involve a \"romance\" between Patti's sister Ingrid and Gregory Benson (Roddy McDowall) and a \"romance\" between Patti herself and a surf-obsessed slacker neighbor, Canoe Henderson (Tom Lowell), and the meddling of nosey neighbor Mrs. MacDougall (Elsa Lanchester) and her disapproving husband, Wilmer MacDougall (William Demarest). At the end, it is revealed that the gray cat in the opening sequence and DC have started a family. At the end, they are taking their kittens on a prowl."}