{"mid": "The13ThWarrior", "IMDB_id": "tt0120657", "title": "The 13th Warrior", "plot": "Ahmad ibn Fadlan is a court poet to the Caliph of Baghdad, until his amorous encounter with the wife of an influential noble gets him exiled as an \"ambassador\" to Northern Barbarians. Traveling with Melchisidek, his caravan is saved from Turkic raiders by the appearance of Norsemen (presumably Varangian). Taking refuge at their settlement on the Volga river, communications are established through Melchisidek and Herger, a Norseman who speaks Latin. Ahmad and Melchisidek are in time to witness a fight, which establishes Buliwyf as heir apparent, followed by the Viking funeral of their dead king, cremated together with a young woman who agreed to accompany him to Valhalla.\nA youth enters the camp requesting Buliwyf's aid: his father's kingdom in the far north is under attack from an ancient evil so frightening that even the bravest warriors dare not name it. The \"angel of death\", a völva (wisewoman), determines the mission will be successful if thirteen warriors go to face this danger—but the thirteenth must not be a Norseman. Ahmad is recruited against his will.\nAhmad learns Norse during their journey by listening intently to his companions' conversations. He is looked down upon by the huge Norsemen, who mock his physical weakness and his small Arabian horse, but he earns a measure of respect by his fast learning of their language, his horsemanship, ingenuity, and ability to write.\nReaching King Hrothgar's kingdom, they confirm that their foe is indeed the ancient \"Wendol\", fiends who come with the mist to kill and eat human flesh. While the group searches through a raided cabin they find a venus figurine. On their first night three of their number - Hyglak, Ragnar and Haltaf are killed. In a string of clashes, Buliwyf's band establishes that the Wendol are humanoid cannibals who appear as, live like, and identify with bears.\nTheir numbers dwindling and their position all but indefensible, an ancient völva of the village tells them to track the Wendol to their lair and destroy their leaders, the \"Mother of the Wendol\" and their Warlord who wears \"the horns of power\". Buliwyf and the remaining warriors infiltrate the Wendol cave-complex and kill the Mother, but not before Buliwyf is scratched deeply across the shoulder by her poisoned \"fingernail claw\".\nThe remaining warriors return to the village and prepare for a final battle they do not expect to survive. Buliwyf staggers outside before the fight and inspires the warriors with a Viking prayer for the honored dead who will enter Valhalla. Buliwyf succeeds in killing the Wendol Warlord, causing their defeat, before succumbing to the poison. Ahmad ibn Fadlan witnesses Buliwyf's royal funeral before returning to his homeland, grateful to the Norsemen for helping him to \"become a man, and a useful servant of God\". He is shown at the movie's end writing down the tale of his time with them."}