{"mid": "TheAdventuresOfPriscillaQueenOfTheDesert", "IMDB_id": "tt0109045", "title": "The Adventures of Priscilla, Queen of the Desert", "plot": "Anthony \"Tick\" Belrose, using the drag pseudonym of Mitzi Del Bra, is a Sydney based drag queen who accepts an offer to perform his drag act at Lasseter's Hotel Casino Resort managed by his estranged wife Marion in Alice Springs, a remote town in central Australia. After persuading his friends and fellow performers, Bernadette Bassinger, a recently bereaved transgender woman, and Adam Whitely, a flamboyant and obnoxious younger drag queen who goes under the drag name Felicia Jollygoodfellow, to join him, the three set out for a four-week run at the casino in a large tour bus, which Adam christens \"Priscilla, Queen of the Desert\".\nWhile on the long journey through remote lands bordering the Simpson Desert, they meet a variety of characters, including a group of friendly Aboriginal Australians for whom they perform, the less accepting attitudes of rural Australia in such towns as Coober Pedy, and are subjected to homophobic abuse, violence, including having their tour bus vandalised with the words \"AIDS Fuckers Go Home\".\nWhen the tour bus breaks down in the middle of the desert, Adam spends the whole day repainting it lavender to cover up the vandalism. The trio later meet Bob, a middle-aged mechanic from a small outback town who joins them on their journey. Before they arrive at Alice Springs, Tick reveals that Marion is actually his wife, as they never divorced, and that they are actually going there as a favour to her. Continuing their journey, Adam is almost mutilated by a homophobic gang before he is saved by Bob and Bernadette. Adam is shaken and Bernadette comforts him, allowing them to reach an understanding. Likewise, the others come to terms with the secret of Tick's marriage and resolve their differences. Together, they fulfil a long-held dream of Adam's, which, in the original plan, is to climb Uluru in full drag regalia (\"A cock in a frock on a rock\"), although the location was changed to King's Canyon in the film (see below).\nUpon arrival at the hotel, it is revealed that Tick and Marion also have an eight-year-old son, Benjamin, whom Tick has not seen for many years. Tick is nervous about exposing his son to his drag profession and anxious about revealing his homosexuality, though he is surprised to discover that Benjamin already knows and is fully supportive of his father's sexuality and career. By the time their contract at the resort is over, Tick and Adam head back to Sydney, taking Benjamin back with them, so that Tick can get to know his son. However, Bernadette decides to remain at the resort for a while with Bob, who has decided to work at the hotel after the two of them had become close."}