{"mid": "TheAwfulTruth", "IMDB_id": "tt0028597", "title": "The Awful Truth", "plot": "Jerry Warriner (Cary Grant) returns home from a trip, which he falsely says was to Florida, to find that his wife, Lucy (Irene Dunne), is not at home. When she returns in the company of her handsome music teacher, Armand Duvalle (Alexander D'Arcy), Jerry learns that Lucy spent the night in the country with Armand, after his car, they claim, broke down unexpectedly. Lucy then discovers that Jerry did not actually go to Florida, though he went so far as to get an artificial tan and write multiple fake letters home to convince her that he did. Mutual suspicions result in divorce.\nDuring the divorce proceedings, Lucy moves into an apartment with her Aunt Patsy (Cecil Cunningham) and becomes engaged to a neighbor, Oklahoma native Dan Leeson (Ralph Bellamy), while Jerry is seen on a date with singer Dixie Belle Lee (Joyce Compton). However, Leeson's mother (Esther Dale) does not approve of her. Eventually, Lucy realizes that she still loves Jerry and decides to break off the engagement. However, before she can inform Dan, Armand shows up at her apartment to discuss Jerry's earlier interruption of Lucy's singing recital. When Jerry knocks on the door, Armand decides it would be prudent to hide in the bedroom. Jerry wants to reconcile, much to Lucy's delight, but then Dan and his mother make an appearance. Wanting to avoid complications, Jerry slips into Lucy's bedroom, too. A fight erupts when he finds Armand already there. When Jerry chases Armand out of the apartment in front of the Leesons, Dan and his mother stalk out.\nAfterwards, Jerry is seen around town with heiress Barbara Vance (Molly Lamont). To break up this relationship, on the night before the final divorce decree, Lucy crashes a party at the Vance mansion, pretending to be Jerry's sister. She acts like a showgirl (recreating a risqué musical number she had seen performed by Dixie Belle) and lets on that Jerry's father (\"their\" father) had been a gardener at Princeton University, not a student athlete as Jerry had claimed. Realizing that his chances with Barbara have been effectively sabotaged, Jerry drives Lucy away in her car.\nMotorcycle policemen stop them on the road, and Lucy, plotting to spend more time with Jerry, wrecks the car. The couple get a lift to her aunt's cabin from the policemen. Once there, Jerry admits having made a fool of himself and the Warriners are happily reconciled, just before the clock strikes midnight."}