{"mid": "TheAssault", "IMDB_id": "tt3660850", "title": "The Assault", "plot": "The novel consists of a brief prologue and five \"episodes\" dated 1945, 1952, 1956, 1966, and 1981.\nTwelve-year-old Anton Steenwijk is living with his parents and older brother on the outskirts of Haarlem in January 1945 under Nazi Occupation. One evening they hear shots and discover that Fake Ploeg, a prominent Dutch collaborator, has been shot. They watch as their neighbors, the Kortewegs, a father and his teen-age daughter, move the body from where it fell in front of their house to a position in front of the Steenwijks' house. In the chaotic hours that follow, Anton's family is killed and their house torched, while he spends a night in a dark police station cell in Heemstede being comforted by an unseen young woman prisoner. As Nazi authorities transport him to Amsterdam a German soldier dies trying to protect him when the convoy is attacked from the air. They place him in the care of an aunt and uncle there.\nThe author writes: \"All the rest is postscript–the cloud of ash that rises from the volcano, circles around the earth, and continues to rain down on all its continents for years.\" In the decades that follow, Anton becomes an anesthesiologist, marries twice, and has a child by each of his wives. He lives with his repressed memories and limited understanding of the events that destroyed his family, uncertain of others' motivations that night and suppressing any instinct to discover more about the way events unfolded, though what he knows is incomplete and presents riddles more than resolution. He learns more details through a series of chance encounters, not by seeking out witnesses and survivors. Only occasionally do his emotions overwhelm him. He weighs motivations and unintended consequences, the moral judgments made and risks taken, the interplay of intention and accident, the actions he and his brother and parents took or failed to take. Anton's discoveries take place against the background of the emergence of Dutch society from the war, the development of new political alignments associated with the Cold War, the anti-establishment Provo movement, and a huge anti-nuclear demonstration.\nHe returns to Haarlem for the first time in 1952 to attend a party. He visits his old neighbors, the Beumers, and then the monument erected to honor in his parents and 29 others who died the same night in reprisal for Ploeg's assassination. A few years later, he chances upon an old schoolmate, Fake Ploeg's son who bears his father's name. This Fake compares their outcomes, Anton an orphan and he the son of collaborators whose mother became a cleaning woman to support her children: \"'We're in the same class, your parents are shot, but you're doing medical studies all the same, whereas my father was shot and I repair water heaters.'\" Fake defends his father as an anti-Communist and blames the death of the Steenwijks on the Communist resistance fighters who knew that reprisals would follow their assassination of his father. Anton rejects his logic: \"'Your father was killed by the Communists with premeditation because they decided that it was essential, but my family was senselessly slaughtered by Fascists, of whom your father was one.'\" Fake counters: \"'As your house went up in flames, we got the news that our father was dead.... I've thought of what you went through; did you ever do the same for me?'\"\nIn 1966, Anton attends a funeral of an older man, an associate of his father-in-law. Socializing after the service, as many old resistance members debate current politics, Anton overhears someone recounting a resistance action and realizes the subject is Ploeg's assassination. He speaks at length with this man, Cor Takes, one of those for whom the battle against fascism is very much alive, who opposes commuting the sentences of collaborators just because they have become old and infirm: \"'Just hand him to me and I'll split his throat. With a pocketknife if necessary.'\" Anton learns more details of how Ploeg's assassination was planned and executed as well as the likely identity of the woman who comforted him that night. He shares what he knows with Takes, whose own knowledge of that night has just as many gaps as Anton's. Finally, in 1981, when Anton is soon to become a grandfather, he meets one of the neighbors who moved Ploeg's body in front of his family's house. He learns why the Kortewegs rushed out to move the body and why they moved it toward the Steenwijks and not in the other direction, the one reason absurd and the other incontestably the moral choice based on what the Kortewegs knew that night."}