{"mid": "TheATeam", "IMDB_id": "tt0429493", "title": "The A-Team", "plot": "The A-Team is a naturally episodic show, with few overarching stories, except the characters' continuing motivation to clear their names, with few references to events in past episodes and a recognizable and steady episode structure. In describing the ratings drop that occurred during the show's fourth season, reviewer Gold Burt points to this structure as being a leading cause for the decreased popularity \"because the same basic plot had been used over and over again for the past four seasons with the same predictable outcome\". Similarly, reporter Adrian Lee called the plots \"stunningly simple\" in a 2006 article for The Express (UK newspaper), citing such recurring elements \"as BA's fear of flying, and outlandish finales when the team fashioned weapons from household items\". The show became emblematic of this kind of \"fit-for-TV warfare\" due to its depiction of high-octane combat scenes, with lethal weapons, wherein the participants (with the notable exception of General Fulbright) are never killed and rarely seriously injured (see also On-screen violence section).\nAs the television ratings of The A-Team fell dramatically during the fourth season, the format was changed for the show's final season in 1986–87 in a bid to win back viewers. After years on the run from the authorities, the A-Team is finally apprehended by the military. General Hunt Stockwell, a mysterious CIA operative played by Robert Vaughn, propositions them to work for him, whereupon he will arrange for their pardons upon successful completion of several suicide missions. In order to do so, the A-Team must first escape from their captivity. With the help of a new character, Frankie \"Dishpan Man\" Santana, Stockwell fakes their deaths before a military firing squad. The new status of the A-Team, no longer working for themselves, remained for the duration of the fifth season while Eddie Velez and Robert Vaughn received star billing along with the principal cast. The missions that the team had to perform in season five were somewhat reminiscent of Mission: Impossible, and based more around political espionage than beating local thugs, also usually taking place in foreign countries, including successfully overthrowing an island dictator, the rescue of a scientist from East Germany, and recovering top secret Star Wars defense information from Soviet hands. These changes proved unsuccessful with viewers, however, and ratings continued to decline. Only 13 episodes aired in the fifth season. In what was supposed to be the final episode, \"The Grey Team\" (although \"Without Reservations\" was broadcast on NBC as the last first-run episode in March 1987), Hannibal, after being misled by Stockwell one time too many, tells him that the team will no longer work for him. At the end, the team discusses what they were going to do if they get their pardon, and it is implied that they would continue doing what they were doing as the A-Team. The character of Howling Mad Murdock can be seen in the final scene wearing a T-shirt that says, \"fini\".\n=== Connections to the Vietnam War ===\nDuring the Vietnam War, the A-Team were members of the 5th Special Forces Group (see episode \"West Coast Turnaround\"). In episode \"Bad Time on the Border\", Colonel John \"Hannibal\" Smith, portrayed by George Peppard, indicated that the A-Team were \"ex-Green Berets\". During the Vietnam War, the A-Team's commanding officer, Colonel Morrison, gave them orders to rob the Bank of Hanoi to help bring the war to an end. They succeeded in their mission, but on their return to base four days after the end of the war, they discovered that Morrison had been killed by the Viet Cong, and that his headquarters had been burned to the ground. This meant that the proof that the A-Team members were acting under orders had been destroyed. They were arrested, and imprisoned at Fort Bragg, from which they quickly escaped before standing trial.\nThe origin of the A-Team is directly linked to the Vietnam War, during which the team formed. The show's introduction in the first four seasons mentions this, accompanied by images of soldiers coming out of a helicopter in an area resembling a forest or jungle. Besides this, The A-Team would occasionally feature an episode in which the team came across an old ally or enemy from those war days. For example, the first season's final episode \"A Nice Place To Visit\" revolved around the team traveling to a small town to honor a fallen comrade and end up avenging his death, and in season two's \"Recipe For Heavy Bread\", a chance encounter leads the team to meet both the POW cook who helped them during the war, and the American officer who sold his unit out.\nAn article in the New Statesman (UK) published shortly after the premiere of The A-Team in the United Kingdom, also pointed out The A-Team's connection to the Vietnam War, characterizing it as the representation of the idealization of the Vietnam War, and an example of the war slowly becoming accepted and assimilated into American culture.\nOne of the team's primary antagonists, Col. Roderick Decker (Lance LeGault), had his past linked back to the Vietnam War, in which he and Hannibal had come to fisticuffs in \"the DOOM Club\" (Da Nang Open Officers' Mess). At other times, members of the team would refer back to a certain tactic used during the War, which would be relevant to the team's present predicament. Often, Hannibal would refer to such a tactic, after which the other members of the team would complain about its failure during the War. This was also used to refer to some of Face's past accomplishments in scamming items for the team, such as in the first-season episode \"Holiday In The Hills\", in which Murdock fondly remembers Face being able to secure a '53 Cadillac while in the Vietnam jungle.\nThe team's ties to the Vietnam War were referred to again in the fourth season finale, \"The Sound of Thunder\", in which the team is introduced to Tia (Tia Carrere), a war orphan and daughter of fourth season antagonist General Fulbright. Returning to Vietnam, Fulbright is shot in the back and gives his last words as he dies. The 2006 documentary Bring Back The A-Team joked that the scene lasted seven and a half minutes, but his death actually took a little over a minute. His murderer, a Vietnamese colonel, is killed in retaliation. Tia then returns with the team to the United States (see also: casting). This episode is notable for having one of the show's few truly serious dramatic moments, with each team member privately reminiscing on their war experiences, intercut with news footage from the war with Barry McGuire's Eve of Destruction playing in the background.\nThe show's ties to the Vietnam War are fully dealt with in the opening arc of the fifth season, dubbed \"The Court-Martial (Part 1–3)\", in which the team is finally court-martialed for the robbery of the bank of Hanoi. The character of Roderick Decker makes a return on the witness stand, and various newly introduced characters from the A-Team's past also make appearances. The team, after a string of setbacks, decides to plead guilty to the crime and they are sentenced to be executed. They escape this fate and come to work for a General Hunt Stockwell, leading into the remainder of the fifth season."}