{"mid": "TheAbominableDrPhibes", "IMDB_id": "tt0066740", "title": "The Abominable Dr. Phibes", "plot": "Dr. Anton Phibes was an expert in theology and music who was supposedly killed in a car crash in 1921, shortly after the death of his beloved wife, Victoria, during an operation. However, he survived the crash, horribly scarred by the accident and left unable to speak, forcing him to remake his face with prosthetics and use his knowledge of acoustics to regain his voice. Resurfacing in 1925, Phibes believes that his wife died a victim of incompetent doctors, and begins elaborate plans to kill them.\nPhibes begins his quest for vengeance with the help of his beautiful and silent female assistant Vulnavia, using the ten plagues of Egypt as a basis, wearing an amulet with Hebrew letters corresponding with the appropriate plagues as he commits the murders. After three doctors are killed, Inspector Trout, a detective from Scotland Yard, learns that they had all worked together under the direction of Dr. Vesalius, who reveals that all of the deceased had been on his team in Victoria's case, as well as four other doctors and a nurse. When another murder is reported, Trout suspects Phibes is alive, and he and Vesalius go to the Phibes mausoleum at Highgate Cemetery. They find ashes in a box in Phibes' coffin, which Trout believes are the remains of Phibes' chauffeur; Victoria's coffin is empty.\nDespite all of the police's best efforts, Phibes is able to kill the remaining doctors and the nurse. Reserving the final punishment for Dr. Vesalius, he kidnaps the doctor's son, Lem, then calls Vesalius and tells him to come alone to his mansion on Maldene Square if he wants to save his son's life. Despite Trout's protests, Vesalius knocks the inspector unconscious and immediately races to Phibes' mansion, where he confronts the mad doctor. Phibes has placed Vesalius' son under anesthesia and prepared him for surgery; a small key implanted near the boy's heart will unlock his restraints, but Vesalius must perform the surgery within six minutes (the same amount of time Victoria was on the operating table before her death) to get the key before acid from a container above Lem's head falls and destroys his face. Vesalius succeeds and moves the table out of the way; Vulnavia, backing away from the police, is sprayed with the acid instead.\nConvinced he has accomplished his vendetta, Phibes retreats to the basement of his house to lie in the stone sarcophagus containing the embalmed body of his wife. He drains out his own blood and replaces it with embalming fluid as the coffin's inlaid stone lid slides into place, concealing them both in darkness. Trout and the police arrive and discover that Phibes has mysteriously disappeared. Trout and Vesalius recall that the \"final curse\" was darkness, and they speculate that they will encounter Phibes again."}