{"mid": "TheAdventuresOfBuckarooBanzaiAcrossThe8ThDimension", "IMDB_id": "tt0086856", "title": "The Adventures of Buckaroo Banzai Across the 8th Dimension", "plot": "Buckaroo Banzai (Peter Weller) and his mentor Dr. Hikita (Robert Ito) perfect the \"oscillation overthruster\", a device that allows one to pass through solid matter. Banzai tests it by driving his Jet Car through a mountain. While passing through it, Banzai discovers himself in another dimension, and on returning to his normal dimension, he finds an alien organism has attached itself to his car.\nNews of Banzai's success reaches Dr. Emilio Lizardo (John Lithgow), currently held at the Trenton Home for the Criminally Insane. In 1938, Lizardo and Hikita had build a prototype overthruster, but Lizardo tested it before it was ready, and became stuck between dimensions. Though freed, it caused him to go insane. Aware that Banzai has succeeded, Lizardo breaks out.\nBanzai meets a suicidal Penny Priddy (Ellen Barkin), and finds she is a long-lost twin sister of his late wife, distraught over the loss. Banzai attempts to lift her spirits and brings her with the rest of his group, the Hong Kong Cavaliers, as they hold a press conference about the overthruster and the existence of alien life. Strange men disrupt the event and kidnap Hikita and the overthruster; due to an electrical shock from an unknown source, Banzai sees these men as reptilian humanoids. The others give chase, and Penny happens to encounter Hikita who passes her the overthruster before he is recaptured.\nWhile planning what to do next, Banzai and the Cavaliers are met by John Parker (Carl Lumbly), a messenger from John Emdall (Rosalind Cash), the leader of the alien Black Lectroids of Planet 10, currently in Earth's orbit. Emdall explains that they have been at war with the hostile Red Lectroids for years, but had managed to banish them to the eighth dimension. Lizardo's failed test of the overthruster in 1938 allowed the Red Lectroids' leader, John Whorfin, to take over Lizardo's mind and enable several dozen others to escape. Now that Banzai has perfected the overthruster, Emdall fears Whorfin and his allies will try to acquire it to free the other Red Lectroids. Emdall had shocked Banzai previously to allow him to see the Lectroids for who they are, and now tasks him with stopping Whorfin or otherwise the Black Lectroids will fake a nuclear explosion to start World War III that will annihilate the Earth and the Red Lectroids with it. The Cavaliers track down the Red Lectroids to Yoyodyne Propulsion Systems in New Jersey, finding that their arrival in 1938 was told by Orson Welles' broadcast of The War of the Worlds until the Lectroids forced him to admit it was a work of fiction. Yoyodyne has been building a spacecraft to cross over to the eighth dimension under the pretense of a new United States Air Force bomber.\nThe Red Lectroids invade Banzai's headquarters and kidnap Penny, unaware she has passed the overthruster off to one of Banzai's allies. Banzai and the Cavaliers set off to gather allies and confront Whorfin at Yoyodyne, as well as warning the President of the United States as to avoid a nuclear war. At Yoyodyne, Penny refuses to tell the Lectroids where the overthruster is, and they start to torture her. Banzai arrives and chases off the Lectroids, though Penny is wounded and unconscious. While the Cavaliers tend to her, Banzai and Carter sneak into a pod on the spacecraft. Without Banzai's overthruster, Whorfin insists they use his imperfect model, which fails to make the dimensional transition and instead breaks through the Yoyodyne wall, flying off into the atmosphere. Banzai and Carter separate the pod from the main craft, and use its weapon systems to destroy Whorfin and all the other Red Lectroids. Banzai parachutes back to Earth while Carter returns to his people. With the situation resolved and war averted, Banzai finds Penny remains comatose. When he goes to kiss her, Emdall causes another brief shock to Banzai that revives Penny.\nThe end credits announce an unproduced sequel Buckaroo Banzai Against the World Crime League."}