{"mid": "TheAmericanizationOfEmily", "IMDB_id": "tt0057840", "title": "The Americanization of Emily", "plot": "Lieutenant Commander Charlie Madison (James Garner), United States Naval Reserve, is a cynical and highly efficient adjutant to Rear Admiral William Jessup (Melvyn Douglas) in London in 1944. Madison's job as a dog robber is to keep his boss and other high-ranking officers supplied with luxury goods and amiable Englishwomen. He falls in love with a driver from the motor pool, Emily Barham (Julie Andrews), who has lost her husband, brother, and father in the war. Madison's pleasure-seeking \"American\" lifestyle amid wartime rationing both fascinates and disgusts Emily, but she does not want to lose another loved one to war and finds the \"practicing coward\" Madison irresistible.\nProfoundly despondent since the death of his wife, Jessup obsesses over the US Army and its Air Force overshadowing the Navy in the forthcoming D-Day invasion. The mentally unstable admiral decides that \"The first dead man on Omaha Beach must be a sailor\". A combat film will document the death, and the casualty will be buried in a \"Tomb of the Unknown Sailor\". He orders Madison to get the film made.\nDespite his best efforts to avoid the duty, Madison and his now gung-ho friend, Commander \"Bus\" Cummings (James Coburn), find themselves and a film crew with the combat engineers, who will be the first sailors ashore. When Madison tries to retreat from the beach, the manic Cummings shoots him in the leg with a Browning .45 pistol. A German artillery shell lands near the limping-running Madison, making him the first American casualty on Omaha Beach. Hundreds of newspaper and magazine covers reprint the photograph of Madison running ashore, alone (in reality trying to escape from Cummings), making him a war hero. Jessup, having recovered from his breakdown, is horrified by his part in Madison's death. He makes plans to use the heroic death in support of the Navy when testifying before a Senate committee in Washington, D.C. Losing another man she loves to the war devastates Emily.\nThen comes unexpected news: Madison is not dead but alive and well and at the Allied 6th relocation center in Southampton. A relieved Jessup plans to show him off during his Senate testimony as the \"first man on Omaha Beach\", a sailor. Madison, limping from his injury and angry about his senseless near-death, uncharacteristically plans to act nobly by telling the world the truth about what happened, even if it means being imprisoned for cowardice. Emily persuades him through his earlier spoken words to her to instead choose happiness with her by keeping quiet and accepting his role as a hero."}