{"mid": "TheAdventuresOfBaronMunchausen", "IMDB_id": "tt0096764", "title": "The Adventures of Baron Munchausen", "plot": "In an unnamed war-torn European city in \"The Age of Reason\", amid explosions and gunfire from a large Turkish army outside the city gates, a fanciful touring stage production of Baron Munchausen's life and adventures is taking place. In a theatre box, the mayor, \"The Right Ordinary Horatio Jackson,\" reinforces the city's commitment to reason by ordering the execution of a soldier who had just accomplished a near-superhuman feat of bravery, claiming that his bravery is demoralizing to other soldiers and citizens.\nNot far into the play, an elderly man claiming to be the real Baron interrupts the show, protesting its many inaccuracies. Over the complaints of the audience, the theatre company and Jackson, the \"real\" Baron gains the house's attention and narrates through flashback an account of one of his adventures, of a life-or-death wager with the Grand Turk, where the younger Baron's life is saved only by his amazing luck plus the assistance of his remarkable associates: Berthold, the world's fastest runner; Adolphus, a rifleman with superhuman eyesight; Gustavus, who possesses extraordinary hearing, and sufficient lung power to knock down an army by exhaling; and the fantastically strong Albrecht.\nWhen gunfire disrupts the elderly Baron's story, Jackson cancels the acting troupe's contract because of the Baron. The Baron wanders backstage, where the Angel of Death tries to take his life, but Sally Salt, the young daughter of the theater company's leader, saves him and persuades him to remain living. Sally races to the wall yelling for the Turkish army to go away, and the Baron accidentally fires himself through the sky using a mortar and returns riding a cannonball, narrowly escaping the Angel of Death once again. Insisting that he alone can save the city, the Baron escapes over the city's walls in a hot air balloon constructed of women's underwear, accompanied by Sally as a stowaway.\nThe balloon expedition proceeds to the Moon, where the Baron, who has grown younger, finds his old associate Berthold, but angers the King of the Moon, a giant with separate minds in his head and body, who resents the Baron for his romantic past with the Queen of the Moon. The death of the King's body, and a bungled escape from the Moon, brings the trio back to (and beneath) the Earth, where the Roman God Vulcan hosts his guests with courtesy and Albrecht is found. The Baron and Vulcan's wife, the Goddess Venus, attempt a romantic interlude by waltzing in the air, but this cuts short the hospitality and Vulcan expels the foursome from his kingdom into the South Seas.\nSwallowed by an enormous sea creature, the travellers locate Gustavus, Adolphus, and the Baron's trusty horse Bucephalus. The Baron (who again appears elderly after being \"expelled from a state of bliss\") encounters the Angel of Death for the third time. Finally they escape by blowing \"a modicum of snuff\" out into the sea creature's cavernous interior, causing it to sneeze the heroes out through its whale-like blowhole. The Baron, young once again, sails to where the Turkish army is located but the Baron's associates are too elderly and tired to fight.\nThe Baron lectures them firmly but to no avail, and he storms off intending to surrender to the Sultan. His companions rally to save the Baron, and through a series of fantastic acts they rout the Turkish army and liberate the city. During the city's celebratory parade, the Baron is shot dead by Jackson and the Angel of Death appears a final time to take the Baron's life. An emotional public funeral takes place, but the denouement reveals that this is merely the final scene of yet another story the Baron is telling to the same theater-goers in the city. The Baron calls the foregoing \"only one of the many occasions on which I met my death\" and closes his tale by saying \"everyone who had a talent for it lived happily ever after.\"\nThe Baron leads the citizens to the city gates to reveal the city has indeed been saved, though it is unclear if the events of the battle occurred in a story or in reality. Sally asks, \"It wasn't just a story, was it?\" The Baron grins, rides off on Bucephalus, and then disappears."}