{"mid": "TheAutopsyOfJaneDoe", "IMDB_id": "tt3289956", "title": "The Autopsy of Jane Doe", "plot": "An unidentified corpse of a woman is found half-buried in the basement of a house where a bloody and bizarre homicide has occurred. One of the police officers concludes that there are no signs of forced entry and the victims seemed to be trying to escape the house instead.\nSmall-town coroner Tommy Tilden and his son Austin, who assists him, have just finished the autopsy of a burned corpse when Austin's girlfriend, Emma, arrives and gets curious about the bodies in the morgue. When she notices a bell tied to the ankle of a dead body, Tommy explains to her that, in the past, the bells were used to signal if someone was actually just in a comatose state instead of really dead. The sheriff arrives with the mysterious body and tells Tommy that he needs the cause of death (COD) by morning. Austin decides to help his dad instead of going to the theater with Emma, but asks her to come back later.\nSince the body's identity is unknown and its fingerprints are not on police records, they refer to her as Jane Doe. Austin and Tommy start the autopsy with an external examination of the corpse, which has no visible signs of trauma,scars or marks. They discover that her eyes are cloudy, something that only happens when bodies have been dead for a few days, yet the corpse looks fresh. Her wrist and ankle bones are shattered without any outward signs of injury and her tongue has been non-surgically removed.\nThey begin the internal examination as the radio they listen to starts to randomly switch channels by itself. When Tommy cuts her chest open, the corpse bleeds profusely, something that usually only happens to fresh corpses. Tommy attributes her abnormally small waist to the use of a corset, which were commonly worn by women in the past. Austin discovers that the blood he stored in the freezer strangely started to leak. Examination of her lungs reveals that they are severely blackened, which is consistent with someone who has suffered third-degree burns. Her internal organs reveal numerous cuts and scar tissue, likely from repeated stabbing.\nAustin hears a sound outside the examination room and sees a standing figure in a mirror, but finds nothing once he turns around. He then discovers that the sound is coming from an airshaft; where he finds their cat, Stanley, badly hurt and bleeding in the vent. Tommy kills Stanley out of mercy and burns his body in the cremation furnace. Back in the examination room, they find Jimsonweed (Datura stramonium) in Jane Doe's stomach, a paralyzing agent that, again, is only found in the north of the country. Austin hears over the radio about a strong storm coming and wants to leave. Tommy states that he will finish what he started, and Austin concurs.\nLater, Tommy finds her missing tooth wrapped in a piece of cloth in her stomach. They find Roman numerals, letters, and a drawing on the cloth. When Tommy finally separates the skin on her chest from the body, they find similar symbols on the inside of her skin. All the lights in the room suddenly explode. During the confusion, they see that the storage chambers are empty, and that the three corpses inside them are missing. They decide to leave, but the elevator does not work and something is blocking the exit door. Tommy tries to call the sheriff using a landline, but the connection is disrupted. They hear a bell in the hallway, presumably from the movement of now living corpses, and the office door violently starts to bang, only to suddenly stop.\nAustin says that everything is caused by the mysterious body. Tommy is attacked in the bathroom by an unseen figure. He has bruises on his body but only saw the attacker's grey eyes. They decide to burn Jane Doe's body in the cremation furnace, but the door to the autopsy room locks on its own, trapping them inside. Austin breaks a hole in it with an axe and, through the hole, sees one of the living corpses. They then choose to burn her in the examination room, but the fire spreads wildly and burns the camera that was recording the autopsy. They manage to put out the fire using a fire extinguisher, but the body is not burned at all. The elevator turns back on and they rush to get in; however, the door does not close completely. In the ensuing chaos, Tommy uses an axe to attack the living corpse that appeared to be chasing them, but it turns out to be Emma. Emma's death from the injury devastates Austin and leaves Tommy ridden with guilt.\nAustin says that the corpse has been stopping them finding out the truth, and as they decide to go back into the examination room the cremation furnace produces smoke which makes them unable to see. Tommy is violently attacked in the smoke. However, they eventually make it into the examination room, and Austin opens her skull. The brain tissue cells turn out to still be active, to the surprise of both of them. Tommy deduces that some mysterious force is keeping her alive. Austin folds the piece of cloth and discovers the name of a passage from the Bible and that the Roman numerals read 1693. Tommy finds the corresponding passage in the Bible, Leviticus 20:27, that condemns witches. Austin concludes that she must be a witch who died during the Salem trials, since all of the evidence adds up. Tommy rebuts this by stating that those women were not actually witches, it was only a case of mass hysteria, and that her injuries are not similar to the methods used during the trials. He then says that probably the very things that were done to her made her a witch instead and that now she wants revenge. Tommy then sacrifices himself to the witch, in the hope that she will not harm Austin. The witch's body begins to heal as Tommy suffers the same horrific injuries she suffered. Austin is forced to kill his father in order to end his misery. The lights and radio promptly come back on. Austin hears the sheriff calling to him from outside the building, and runs up the stairs to meet him. The voice turns out to be another hallucination. Austin turns around to see his dead father standing next to him. Startled, he falls backward over the railing and dies from his injuries.\nThe police arrive the next morning. The radio announces the fourth sunny day in a row, indicating that the previous night's storm and all of the incidents only happened in Tommy and Austin's imagination, controlled by the witch. A police officer notices no signs of forced entry and is again confused by another inexplicable crime scene. The Jane Doe body is then transported to another county. The last glimpse of her reveals a twitch of her big toe, her very first movement, accompanied by the sound of a bell."}