{"mid": "TheAdventuresOfRobinHood", "IMDB_id": "tt0786915", "title": "The Adventures of Robin Hood", "plot": "Richard the Lionheart (Ian Hunter), the King of England, is taken captive in 1191 by Leopold V, Duke of Austria while returning to England. Richard’s treacherous brother Prince John (Claude Rains) usurps the throne and proceeds to oppress the Saxons, raising taxes to secure his own position.\nOnly the Saxon nobleman Sir Robin of Locksley (Errol Flynn) opposes him. Robin acquires a loyal follower when he saves Much the Miller's Son (Herbert Mundin) from being arrested for poaching by Sir Guy of Gisbourne (Basil Rathbone). At Gisbourne's castle, Robin boldly tells Prince John and his followers and a contemptuous Lady Marian Fitzwalter (Olivia DeHavilland) that he will do all in his power to restore Richard to the throne. Robin escapes, despite attempts by John's men to stop him.\nRobin and friend Will Scarlet (Patric Knowles) take refuge in Sherwood Forest and recruit Little John (Alan Hale, Sr.), while other men join their growing band, including the rotund Friar Tuck (Eugene Pallette), one of the best swordsmen in all England.\nNow known as the outlaw Robin Hood, he binds his men by an oath: to fight for a free England until the return of Richard, to rob the rich and give to the poor, and treat all women with courtesy, \"rich or poor, Norman or Saxon.\" Robin and his band immediately begin guerrilla warfare against Prince John and his minions, systematically killing the Prince's tax collectors, rapists, and any nobleman who abuses his power over the people of his lands.\nRobin and his men capture a large party of Normans transporting tax money extorted from the people of England. Among Robin's \"guests\" are Sir Guy of Gisbourne, the cowardly Sheriff of Nottingham (Melville Cooper) and the Lady Marian. At first disdainful of Robin, Marian comes to accept his good intentions and begins to see the reality of Norman brutality. Robin allows the humiliated Sir Guy and the Sheriff to leave Sherwood, telling them that they have Marian's presence to thank for his sparing their lives.\nThe Sheriff comes up with a cunning scheme to capture Robin by announcing an archery tournament with the prize of a golden arrow to be presented by the Lady Marian, sure that Robin will be unable to resist the challenge. All goes as planned: Robin wins the match, is taken prisoner, and is sentenced to hang.\nMarian helps Robin's men rescue Robin, and he later scales a castle wall to thank her. Each pledges their love for each other but Marian declines to leave, believing she can best help the rebellion as a spy by staying where she is.\nKing Richard and several trusted knights have returned, disguised as monks. At a roadside inn, the Bishop of the Black Canons (Montagu Love) discovers their presence and alerts Prince John and Gisbourne. Dickon Malbete (Harry Cording), a degraded former knight, is given the task of disposing of Richard in return for the restoration of his rank, with Robin's manor and estate to support it.\nMarian overhears their plot and writes a note to Robin, but Sir Guy finds it and has her arrested, pending trial and execution. Marian's nurse, Bess (Una O'Connor), romantically involved with Much, sends her paramour to warn Robin. On his way, Much intercepts and kills Dickon, being wounded in the process.\nKing Richard and his liegemen journey through Sherwood Forest and are soon stopped by Robin and his men. Richard assures him that he is traveling on the King's business; when asked if he supports Richard, the incognito King replies, \"I love no man better.\" He accepts Robin's invitation to eat with him and the Merry Men, and humbly accepts Robin's rebuke of the King for not staying at home to give justice to his people instead of traveling to fight in foreign lands.\nWill finds the injured Much, who tells Robin of Marian's peril and that Richard is now in England. Robin orders a thorough search to find Richard and bring him to Robin for safety. Now certain of Robin's loyalty, Richard reveals himself to the outlaws.\nRobin devises a plan to sneak his men into Nottingham Castle. He coerces the Bishop of the Black Canons to include his men, disguised as monks, in his entourage. During John's coronation in the great hall, Richard reveals himself to the assembled nobles to their shock, and a huge melee breaks out between the outlaws and the noblemen who support John. Robin and Sir Guy engage in a prolonged swordfight, ending with Gisbourne's death. Robin releases Marian from her prison cell and Prince John's men, defeated, throw down their swords, shields, and banners in token of surrender.\nRichard exiles John and his followers for his lifetime and pardons the outlaws. He elevates Robin Hood to be Baron of Locksley and Earl of Sherwood and Nottingham, and commands that Robin marry the Lady Marian. With Marian by his side, from across the great hall Robin replies with enthusiasm, \"May I obey all your commands with equal pleasure, Sire!\""}