{"mid": "TheAdventuresOfHuckFinn", "IMDB_id": "tt0106223", "title": "The Adventures of Huck Finn", "plot": "Huckleberry Finn (Elijah Wood) is a half-literate son of a drunk (Ron Perlman). One night, his father arrives and Huck is taken away to his father's home. Jealous of Huck's money being kept away, he attacks Huck, but eventually passes out from exhaustion.\nHuck fakes his own death and runs away. He is accompanied by Jim (Courtney B. Vance), a slave who worked for Huck's foster family, and escaped the family out of fear for being sold off. The duo follow the Mississippi River to Cairo, Illinois, so Jim can escape to freedom without being arrested.\nThey come across a wanted poster for Jim, falsely saying that he murdered Huck. Jim and Huck come across a sinking barge one night, and Jim notices Huck's father's corpse on the ship. Huck notices two sailors leaving one to drown in a room as the water comes crashing through. Huck and Jim's canoe sinks, but they steal another one, as the barge completely sinks underwater.\nThe canoe is struck by a steamboat, and Huck is at first captured by a few men, then taken to the home of the Graingerford family. Huck lies about his life to the Graingerfords to avoid suspicion. The Graingerfords are in a feud with another family, the Shepherdsons. Huck even befriends Billy Graingerford (Garette Ratliff Henson), the Graingerford patriarch's son, but is horrified that Jim is found by the family and has become a slave. Billy's older sister Sophie runs away to marry a Shepherdson, thus a short firefight happens, killing all the male Graingerfords in the process, including Billy.\nJim and Huck find themselves past Cairo, and two con men: The Duke (Robbie Coltrane) and The King (Jason Robards), join Huck and Jim. The quartet land at Phelps Landing, and The King and The Duke impersonate British members of the Wilks family to con 3 sisters, Mary Jane (Anne Heche), Julia (Renee O'Connor), and Susan (Laura Bell Bundy) out of their fortune.\nMeanwhile, Jim has been taken to prison for Huck's murder, and tells Huck about his dead father, thus Huck rebukes Jim. Huck puts the money in the coffin of a recently-deceased family member. He exposes The King and The Duke as con men to Mary Jane, and tells her to tell the town at 10:00, when a scheduled steamboat to Cairo departs.\nDr. Robinson (Tom Aldredge) doesn't trust The King and The Duke's scheme, and the real members of the family, whom The King and The Duke were impersonating, show up. The town dig up the buried coffin where the money was put, and thus tar and feather The Duke and The King, and become an angry mob. Huck breaks Jim out of prison, but are spotted by the mob in the process.\nWhile escaping, Huck is shot in the back by a man. Jim decides to sacrifice his chance to escape to freedom, and carries Huck to the mob, allowing himself to be hanged. Before the mob can hang Jim, however, Mary Jane, Julia, and Susan arrive and stop the hanging from happening. The mob sets Jim free, and Huck passes out.\nHuck wakes up in the Wilks homestead, and learns that one of Huck's caretakers (Mary Louise Wilson) died, setting Jim free in her will. The other caretaker (Dana Ivey) plans on civilizing Huck, but Huck, narrating the story, says, \"I've been there before.\" The film ends with Huck running off into the sunset."}