{"mid": "TheAngelsShare", "IMDB_id": "tt1924394", "title": "The Angels' Share", "plot": "In the opening scenes, the protagonists are sentenced to hours of community payback. During his first community payback session, Robbie (Paul Brannigan), under the guidance of Harry (John Henshaw), is interrupted and taken to the hospital by Harry as his girlfriend, Leonie (Siobhan Reilly), has gone into labour. At the hospital, Robbie is assaulted by two of his girlfriend's uncles and her dad (Gilbert Martin) before he can see her. Harry takes Robbie back to his house to clean him up, at which point Leonie calls to announce Robbie's son, Luke, has been born. Harry insists that he and Robbie celebrate, and brings out a vintage whisky. With Leonie's encouragement, Robbie agrees to meet with a victim of his former violent crimes, Anthony (Roderick Cowie), who recollects the attack in front of both his family and Leonie. Afterwards, Leonie makes clear that she does not want her son to grow up around violence and long-term feuds.\nHarry takes the group to a distillery as a reward for their good behaviour, where they learn what \"the angels' share\" is. Afterwards, the tour guide gives them each a dram of whisky and asks them to smell it, and Robbie is complimented on his ability to identify flavours.\nHowever, Robbie is still being pursued by his old enemy, Clancy (Scott Kyle). He is about to undergo a beating by Clancy and his followers when he is unexpectedly rescued by Leonie's father. Robbie pleads to be given one last chance but the older man tells him that it's too late, and even if he wanted to change, he cannot escape the feuds and violence of the world he grew up in. Leonie's father tells him that the only way for him to escape the cycle is to leave Glasgow altogether and go to London, but without Leonie. He offers Robbie £5,000 to sweeten the deal and leaves Robbie to think it over.\nAt the next community service session, Harry approaches Robbie and asks if he'd like to come to a whisky tasting session in Edinburgh. Robbie, in turn, invites the other members of the group, where they learn about a cask of priceless whisky, the Malt Mill, set to go on auction soon, and Robbie is passed a card by a whisky collector, Thaddeus (Roger Allam). After they leave, Mo (Jasmin Riggins) reveals she spotted and stole documents detailing the warehouse in which the \"Malt Mill\" is kept but Robbie tells her that he is not interested in crime and is determined to stay straight for the sake of Leonie and Luke.\nRobbie and Leonie view a flat which they could rent for six months while the owner is away. Robbie seems touched but it is then revealed they have been followed by one of Clancy's men and Clancy will know where they are going to live. Robbie, realising that he can't continue living under threat of assault on himself and his family, begins planning to steal the Malt Mill with his community service partners. They secure an invitation to the tasting and auction, during which Robbie hides in the warehouse overnight and siphons some whisky into empty Irn Bru bottles, before he is interrupted by Thaddeus and Angus Dobie (David Goodall). Robbie covertly witnesses Thaddeus attempting to bribe Dobie into selling him some of the whisky before the cask goes on auction but he refuses and the two leave, after which Robbie then tops up the cask with cheaper whisky from an adjacent cask. At the auction, the group see Thaddeus outbid by an American, who tastes the cask, and is apparently happy with the slightly diluted blend.\nAfterwards, Robbie approaches Thaddeus and negotiates a sale of three bottles for £200,000, and \"a real job\". They plan to make the exchange in Glasgow, and so begin the trek home, but inadvertently break two of their four bottles during an encounter with the police. Robbie is furious, but goes ahead with meeting Thaddeus, and negotiates a sale for £100,000 and a permanent job far away from Glasgow. Afterwards, Robbie reveals to his friends that he didn't sell two bottles, but one. The scene cuts to show Harry coming home to find a bottle of Irn Bru sitting on his kitchen table next to an open window, with a note thanking him and presenting his \"angels' share\", next to a newspaper piece showing a photo of the community payback group next to the cask. He smells the bottle and rejoices at the Malt Mill inside.\nIn the final scene, we see Robbie and Leonie leave for Stirling in an immaculate old Volkswagen Type 2, having made temporary goodbyes to the rest of the group. After they leave, the rest of the group resolve to go get wasted. The film ends with The Proclaimers' \"500 Miles\" playing."}