{"mid": "TheBigHit", "IMDB_id": "tt0120609", "title": "The Big Hit", "plot": "Melvin Smiley (Mark Wahlberg) is a hitman leading a secret life and maintaining two relationships, one with the demanding and demeaning Chantel (Lela Rochon), who does not accept his work, and another with Pam (Christina Applegate), who knows nothing of his job. Melvin is somewhat of a pushover, trying to appease all of Chantel's demands, even her most expensive wishes, as well as rolling over whenever one of his co-workers takes credit for his achievements. Perhaps as a result of his helplessness in asserting himself, throughout the early scenes Melvin is often seen drinking Maalox to relieve a developing ulcer.\nFeeling underpaid for their work for mob boss Paris (Avery Brooks), the assassin team of Smiley, Cisco (Lou Diamond Phillips), Crunch (Bokeem Woodbine), Vince (Antonio Sabato Jr.) and Gump (Robin Dunne) take an independent job, kidnapping Keiko Nishi (China Chow), the teenage daughter of local electronics magnate Jiro Nishi (Sab Shimono), for a hefty ransom. Unfortunately, the team does not realize that Nishi has recently gone bankrupt over his failed foray into films and furthermore, their boss Paris is the girl's godfather. Enlisted by the group to hold Keiko, Melvin has to hide the bound and gagged schoolgirl on his property, attempting to keep her presence hidden from Pam and her parents, who are coming for dinner.\nMelvin feels sorry for the girl and relieves her from her bondage. In the ensuing hours they build up a rapport preparing dinner together, an act which leads into a love scene reminiscent of the pottery scene from Ghost, but which is cut short when Keiko attempts to escape.\nOrdered by Paris to discover the kidnappers of his goddaughter, a panicked Cisco kills Gump, but not before coaxing him into also implicating Melvin for the kidnapping.\nA team of assassins crash Melvin's dinner with Pam's family, leading to a shootout during which Melvin realizes Pam was going to break up with him under pressure from her stereotypically Jewish mother (Lainie Kazan). Melvin and Keiko's feelings for each other lead them to form an awkward romance, and she and Melvin attempt to escape from the fiasco, pursued by Cisco. In the chaos, Melvin happens to run into Chantel and finally takes the opportunity to stand up to her and end their relationship.\nA fight ensues between Cisco and Melvin, culminating at a video store where the ever-honest Melvin stops to return an overdue tape. Melvin kills Cisco by stabbing him in the chest, but not before Cisco arms an explosive device. Melvin leaves the building and is confronted by Keiko, her father and Paris. He re-enters the building, which explodes.\nParis and Nishi, believing Melvin to be dead, call off the manhunt. Soon Melvin is revealed to have survived, sheltered from the blast by an enormous solid gold film stand-up made for the flop that destroyed Nishi's career. Melvin and Keiko are reunited and ride off together, while Nishi recoups his losses by making a film out of the story of his daughter's kidnapping."}