{"mid": "TheBigHeat", "IMDB_id": "tt0045555", "title": "The Big Heat", "plot": "Homicide detective Sergeant Dave Bannion (Glenn Ford) is an honest cop who investigates the death of fellow officer Tom Duncan. It would seem to be an open-and-shut case, suicide brought on by depression, but Bannion is then contacted by the late cop's mistress, Lucy Chapman (Dorothy Green), who claims that it could not have been suicide.She explains that Duncan was in perfect health and had no reason to do it. All the evidence points to a self-inflicted gunshot wound and Bannion is prepared to believe that Chapman is just talking tales as a means of making a little money. But he is intrigued to learn that the Duncans had a second home which would simply not have been possible on his salary.Bannion visits Mrs Duncan (Jeanette Nolan) and raises the subject but she resents the implication of his suspicions. The next day Bannion gets a dressing-down by Lieutenant Ted Wilks (Willis Bouchey) who is under pressure from \"upstairs\" to close the case with as little grief to the widow as possible.Chapman is later found dead after being tortured and covered with cigarette burns. After counting \"every single one of them\" Bannion sets about investigating her murder even though it is not his case or his jurisdiction. Threatening calls are then made to his home and he goes to confront Mike Lagana (Alexander Scourby), the local mob boss. It's an open secret that Lagana runs the city, even to the point that he has cops guarding his house while his daughter hosts a party. Lagana resents Bannion's accusations in his own home during such an event: \"I've seen some dummies in my time, but you're in a class by yourself.\"Bannion's main problem is that people are just too scared to stand up to the crime syndicate that controls the city, including Lieutenant Wilks, who fears for his pension and whom Bannion dismisses as a \"leaning tower of jelly\". But, when the warnings to him go unheeded, Bannion's car is blown up and his wife (Jocelyn Brando) is killed.Feeling that the department will do little to bring the perpetrators to justice (they insist on going over all his old cases which will just delay matters), and disgusted by Police Commissioner Higgins' (Howard Wendell) clichéd condolences, Bannion resigns the force and sets off on a one-man crusade to get Lagana and his second-in-command Vince Stone (Lee Marvin).When Stone drunkenly attacks a girl in a nightclub, Bannion stands up to him and orders him and his bodyguard out of the joint. This impresses Stone's girlfriend Debby Marsh (Gloria Grahame). She tries to get friendly with Bannion who keeps pointing out that she gets her money from a thief. Marsh states: \"I've been rich and I've been poor. Believe me, rich is better.\" But when she unwittingly reminds him of the time he courted his late wife he sends her packing: \"Well, you're about as romantic as a pair of handcuffs,\" she remarks.Marsh was seen with Bannion and when she returns to Stone's penthouse, he accuses her of talking to Bannion about his activities and throws boiling hot coffee at her face.She is taken to hospital by none other than Commissioner Higgins who was playing poker with Stone and his friends at the flat. When Higgins warns that he will have to file a report, Stone reminds him that he pays him to deal with that sort of thing.Her lovely face half-scarred, Marsh returns to Bannion who agrees to put her up for a while. He's been looking for a man called Larry who hired a mechanic to set the dynamite in the car that killed his wife. Marsh reveals that it is Larry Gordon (Adam Williams), one of Stone's associates.Bannion confronts and strangles Gordon until he admits that he did organise the bombing of his car. This whole thing has started because Bertha Duncan, widow of the cop who committed suicide, has papers he collected that could expose Stone and Lagana. They were really intended for the DA, but Mrs Duncan has kept them for herself and is collecting from Lagana. If she is not paid, or if anything happens to her, the well-hidden papers will be made public.Bannion has been warned by Marsh that killing for revenge would make him no better than those who killed his wife. He thus refrains from killing Gordon, instead spreading the word that he talked. Gordon is seized and murdered by Stone's men before he can make his escape.Bannion now confronts Mrs Duncan accusing her of betraying Chapman to her death and of protecting \"Lagana and Stone for the sake of a soft plush life\", but then cops sent by Lagana make him leave.Stone decides to try and kidnap Bannion's little daughter Joyce (Linda Bennett) who is staying with her aunt and uncle with a police guard outside their flat. When the guard suddenly leaves the uncle calls in a few army buddies to take over. Satisfied that she is in good hands, Bannion sets off to deal with Stone. On the way he meets Lieutenant Wilks, the \"leaning tower of jelly\", who is now prepared to make a stand against the mob, admitting that, in spite of his own wife's pressure over what will happen to his pension, \"It's the first time in years I've breathed good clean air.\"Debbie Marsh, slowly coming to terms with her disfigurement, confronts Mrs Duncan. They've both benefited from their association with mobsters as can be shown by their very-similar and expensive mink coats: \"We're sisters under the mink,\" says Marsh. She then kills Mrs Duncan, thus starting the process that will see Tom Duncan's evidence surface and bring about Stone and Lagana's downfall. When Stone returns to his penthouse, Marsh throws boiling coffee over him like he did to her.Stone shoots Marsh and after a short gun battle is captured by Bannion who had followed him to the flat. As Marsh lies dying, Bannion describes his late wife to her in terms of their relationship rather than the physical \"police description\" he gave earlier: \"You and Katie would have gotten along fine,\" he tells her.Stone is arrested for Marsh's murder. When Duncan's evidence is made public Lagana and Commissioner Higgins are indicted. Bannion returns to his job at Homicide."}