{"mid": "TheBraveLittleToasterGoesToMars", "IMDB_id": "tt0147926", "title": "The Brave Little Toaster Goes to Mars", "plot": "Now newly married and having moved to a new home, the 'Master' of the appliances Toaster, Lampy, Kirby, Radio and Blanky, Rob, and his wife Chris have an infant son named Robbie. At first the appliances all fear that Rob and Chris will pay more attention to him but later grow accustomed to him (\"I See a New You\"). Later that night, Hearing Aid, an ancient hearing aid left in the house's kitchen junk drawer by the previous owner escapes the drawer and sneaks past the sleeping appliances, However, Toaster sights him and follows him up to the attic, where he witnesses Hearing Aid receiving a message which appears to be transmitting from space.\nThe next morning, Toaster informs the other appliances and Ratso, the family's pet rat, of the events occurring the previous night, leading to the appliances and Ratso agreeing to carefully watch the junk drawer in case of Hearing Aid suspiciously escaping again. Later, at midnight, everyone falls asleep just as Hearing Aid escapes from the drawer. Suddenly, Robbie, dubbed \"the Little Master\" by the appliances, is awakened by the sound of the transmission, climbs out of his crib and follows Hearing Aid. The appliances awaken, find Robbie going up the stairs and pursue him, leading them to enter the attic just as a beam of light appears. The shocked appliances pursue Hearing Aid, but in spite of this, Robbie is beamed into space. Following this, Calculator, another appliance from the kitchen junk drawer, interprets the signals transmitting to Hearing Aid onto his screen, revealing that Robbie has been transported to Mars.\nThe appliances subsequently contact Wittgenstein, an old supercomputer from the previous film, per Ratso's suggestion, by connecting a computer to a security camera in the museum that acts as a phone, between them and Wittgenstein. Upon informing him of their situation, Wittgenstein informs them that in order to travel to Mars, they must attach a ceiling fan to a laundry basket, with cheddar cheese flavored popcorn acting as fuel (due to the fuel source needing to be 'organic'). Furthermore, Wittgenstein supplies Calculator with the necessary power required to be the appliances' navigator. The appliances follow Wittgenstein's instructions, advising Ratso (who, being a mammal, cannot breathe in space) and Blanky (as it would be 'too scary' for him) to stay behind and prevent the baby monitor in Robbie's empty crib of alerting Rob and Chris of their son's disappearance. The appliances then set off to Mars, but not before they find that Blanky has stowed away in the laundry basket.\nDuring their flight through space, the appliances run across a pack of sentient balloons who have been let go by human hands and now float endlessly through the cosmos (\"Floating\"). Eventually, due to a mistake of Blanky's part, the appliances crash land on Mars, where they encounter multiple satellites sent from Earth (among them being Viking 1), in addition to a Christmas angel named Tinselina who was sent to Mars with the former. However, soon following their arrival, the appliances and Tinselina are taken hostage by a gang of military toasters, who are part of a large group of appliances known as the 'Wonderluxe appliances' and led by an enormous refrigerator known as the 'Supreme Commander'. Tinselina subsequently reveals to the appliances that the Wonderluxe appliances were deliberately built poorly by a corrupt manufacturer, designed to fail from the get-go under a scheme of planned obsolescence. When the company inevitably failed, the useless appliances were used as extra weight by the military in rocket launches, being abandoned afterwards on Mars, now harboring an extreme hatred of humans. The Earthling appliances learn that the angry, rejected Wonderluxe appliances are plotting to blow up the Earth via use of a large missile because the Wonderluxe company threw them out when they failed. Seeing the issues with the Wonderluxe appliances, Toaster decides to fight for the role of Supreme Commander in an attempt to talk them out of destroying the Earth, while Blanky and Robbie, concealed within a protective bubble, happily reunite. Meanwhile, Toaster and the Supreme Commander stage an election and display their differing opinions on humans (\"Humans\"). During the election, Robbie is able to push a hand out of his bubble. His hand touches Supreme Commander, and the refrigerator inexplicably begins to turn pink. He smiles at the child, before returning to his original color.\nFollowing the election, Toaster emerges victorious and becomes the new Supreme Commander. They then rediscover the grief-stricken Supreme Commander, who allows the appliances to discover what is behind his doors. Subsequently, the appliances venture into the freezer of the Supreme Commander and find that the Supreme Commander's true form is the brother of Hearing Aid, who he has not seen in sixty years. Hearing Aid's brother then reveals that he also originally belonged to Albert Einstein, but fell into the hands of a Nazi leader, whose ideals influenced him, leading him to become disillusioned with humans and to escape to Mars. When asked by Toaster why he changed his mind about blowing up Earth, he says \"the touch of the small boy's hand\" reminded him that not all humans are bad. With the conflict resolved, the appliances and Robbie, now joined by Tinselina and Hearing Aid's reformed brother, are about to return to Earth when suddenly Hearing Aid's brother realizes he forgot to deactivate the missile set to destroy the Earth. The missile counts down as Toaster jumps off the 'spacecraft', with Hearing Aid's brother contained within his crumb drawer, and destroys the missile. Toaster is almost left on Mars, but the others come back for him. After Toaster is on board, Tinselina gives up her clothes and hair so the spacecraft can be provided with organic fuel necessary to return to Earth.\nThe appliances happily ride back to Earth as the sun sets. (\"Home Again\"). The appliances return to Earth just in time as the baby monitor that Ratso has been restraining all night, finally wakes Rob and Chris up. One day, when they are taping Robbie, Rob finds Tinselina, now stripped of her beauty and deemed 'worthless' by herself, in a garbage can and restores her. The film then concludes happily as Rob, Chris, Robbie and the appliances celebrate Christmas, with Robbie demonstrating his appreciation for the five appliances that rescued him, stating his first word ('Toaster'), and Tinselina finally fulfilling her function and being placed on top of a Christmas tree, while Ratso, Hearing Aid and his brother, Calculator and the other appliances celebrate in their own ways, such as engaging in games of tic-tac-toe and playing cards."}