{"mid": "TheBridesOfDracula", "IMDB_id": "tt0053677", "title": "The Brides of Dracula", "plot": "A gloomy wood is seen as a voice is heard, narrating:\nTransylvania, land of dark forests, dread mountains and black unfathomable lakes. Still the home of magic and devilry as the nineteenth century draws to its close. Count Dracula, monarch of all vampires is dead. But his disciples live on to spread the cult and corrupt the world...\nMarianne Danielle, a young French schoolteacher en route to take up a position in Transylvania, is abandoned at a village inn by her coach driver. Ignoring the warnings of the locals, she accepts the offer of Baroness Meinster to spend the night at her castle. There, she sees the Baroness's handsome son, whom she is told is insane and kept confined. When she sneaks into his quarters to meet him, she is shocked to find him chained by his leg to the wall, and when he tells her that his mother has usurped his rightful lands and pleads for her help, she agrees to steal the key to his chain from the Baroness' bedroom. Discovering this, the Baroness is horrified; yet when her son appears, she obeys him and accompanies him back to his room. Later, Marianne discovers the Baroness' servant Greta, who has also taken care of the Baron since he was a baby, in hysterics: She shows Marianne the Baroness' corpse, and the puncture marks in her throat. Marianne flees into the night upon seeing this, while Greta chastises the Baroness for raising her son on cruelty and cavorting with bad company in the past, which lead to one such being (Dracula) turning him into a vampire and the Baroness having to chain him in his room (while feeding him any girls that she lured to the castle). Despite knowing the evil he intends to the village, Greta remains loyal to the Baron.\nMarianne is later found, exhausted, by Dr. Van Helsing the following morning. She doesn't remember all that has happened, nor is she familiar when asked about the words \"undead\" or \"vampirism.\" He escorts her to the school where she's to be employed.\nWhen Van Helsing reaches the village inn, he finds there is a funeral in progress. A young girl has been found dead in the woods with wounds upon her throat. He contacts Father Stepnik, who had requested Van Helsing's presence, having suspicions about the castle and the Baroness. He tries to dissuade the girl's father from burying her, but he doesn't listen, allowing more time for her transformation to be completed. Indeed, Stepnik's fears are confirmed when Helsing (and later Stepnik himself) goes to the cemetery that night in hopes of stopping the transformation, only to find Greta already there; Greta aides the newly vampirised village girl to rise from her grave. The men try to stop her, but Greta holds them off and allows the girl to flee. Van Helsing goes to the castle and discovers the Baroness, now risen as a vampire herself, as well as the Baron. After a brief scuffle, the Baron flees on a coach driven by the village girl, abandoning his mother, who is full of self-loathing and guilt over her actions with her son. Knowing that the Baron has no interest in controlling her — and that the transformation was his revenge on her for locking him up — Helsing takes pity on her and, after sunrise the next morning, kills her with a wooden stake as she slumbers.\nThe Baron, meanwhile, visits Marianne at the school and asks her to marry him. She accepts, much to the good-natured envy of her roommate Gina. However, once Gina is alone, Baron Meinster appears in her room and drains Gina of her blood. When Van Helsing visits the next day, he finds the school in a small uproar over Gina's death. After inspecting Gina's body and finding bite wounds on her neck, Helsing orders that her body be placed in a horse stable with people watching it until he returns. That night, Marianne relieves the headmaster's wife of her watch. Initially she is with the stable keeper, Severin, when, in a scene derived from M. R. James' \"Count Magnus,\" one of the padlocks on the coffin falls off without unlocking. Severin goes outside to fetch another lock, but is killed by a vampire bat (presumably the Baron or the village girl from earlier) while inside the last lock falls from the coffin. The coffin lid is pushed opened and Gina rises, now a vampire, and smiles her newly formed fangs at Marianne. She approaches Marianne, asking forgiveness for letting the Baron \"love her\". She also reveals the whereabouts of the Baron, who is hiding at the old mill, and tries to convince Marianne to come with her so \"they can both love him\".\nVan Helsing discovers the body of Severin, and enters the stable, saving Marianne from being bitten by Gina, who then flees. Van Helsing takes Marianne back to the school to calm her down. Marianne doesn't want to believe that Gina or the Baron are vampires, but Van Helsing confirms that they are, stating to Gina she once knew is indeed dead and has been resurrected as the Baron's newest vampire bride, now evil and completely under his control. If not stopped, neither the Baron nor she will have qualms attacking school under his commands and adding to their undead ranks. Reluctantly, Marianne tells Van Helsing what Gina told her. The vampire hunter goes to the old mill and manages to find the Baron's coffin, but is soon confronted by both of Meinster's \"Brides\" as well as Greta, who commands Gina and the village girl to obey their master's commands and kill Helsing. Helsing wards the brides off with his cross, but Greta, who is human and unaffected, manages to wrestle it away from him only to trip and plummet from the rafters, dying in the fall. However the cross falls into the well below the mill and is now out of Van Helsing's reach as the Baron arrives, brandishing a length of chain. In the fight that follows, the Baron manages to subdue Van Helsing and bites him, inflicting him with vampirism before leaving. When Van Helsing wakes, he realizes what has happened. He heats a metal tool in a brazier until it is red hot, then cauterises his throat wound and pours holy water on it to purify it. The wounds disappear as Gina and the village girl watch from the rafters, shocked that Van Helsing overcame a vampire bite and saved himself from vampirisim.\nBaron Meinster, meanwhile, abducts Marianne from the school and brings her to the mill, intending to vampirise her in front of Van Helsing. As Meinster attempts to hypnotise her, to make her compliant to his will, Van Helsing seizes a canteen of holy water that dropped in their earlier fight and throws its contents into the Baron's face, which sears him like acid. Meinster kicks over the brazier of hot coals, starting a fire. The Baron runs outside and his brides make their escape. Van Helsing takes Marianne up into the mill, then out via the huge sails, which he moves to form the shadow of a gigantic cross over Meinster. Van Helsing goes to ground level to make sure he's dead, then comforts Marianne as the mill burns."}