{"mid": "TheBabadook", "IMDB_id": "tt2321549", "title": "The Babadook", "plot": "Amelia Vanek is a troubled and exhausted widow who has brought up her six-year-old son Samuel alone after her husband Oskar's death from a car accident that occurred as he drove Amelia to the hospital during her labour. Sam begins displaying erratic behaviour: he becomes an insomniac and is preoccupied with an imaginary monster, against which he has built weapons to fight. Amelia is forced to pick up her son from school after Sam brings one of the weapons there. One night, Sam asks his mother to read a pop-up storybook: Mister Babadook. It describes the titular monster, the Babadook, a tall pale-faced humanoid in a top hat with pointed fingers who torments its victims after they become aware of its existence. Amelia is disturbed by the book and its mysterious appearance, while Sam becomes convinced that the Babadook is real. Sam's persistence about the Babadook leads Amelia to often have sleepless nights as she tries to comfort him.\nSoon after, strange events occur: doors open and close mysteriously by themselves, strange sounds are heard and Amelia finds glass shards in her food. She attributes the events to Sam's behaviour, but he blames the Babadook. Amelia rips up the book and disposes of it. At Sam's cousin Ruby's birthday party, Ruby bullies Sam for not having a father, in response to which he pushes her out of her tree house and breaks her nose in two places. Amelia's sister Claire admits she cannot bear Sam to which Amelia takes great offence. On the drive home, Sam has another vision of the Babadook and suffers a febrile seizure, after which Amelia makes a successful plea for sedatives to a paediatrician.\nThe following morning, Amelia finds the Mister Babadook book reassembled on the front door step. New words taunt her by saying that the Babadook will become stronger if she continues to deny its existence, containing pop-ups of her killing her dog Bugsy, Samuel and then herself. Terrified, Amelia burns the book and runs to the police after a disturbing phone call. However, Amelia has no proof of the stalking, and when she then sees the Babadook's suit hung up behind the front desk, she leaves. Amelia starts to become more isolated and shut-in, being more impatient, shouting at Samuel for 'disobeying' her constantly, and having frequent visions of the Babadook once again.\nOne night, Amelia sees a vision of Oskar, who agrees to return if she gives him Sam. Fleeing, Amelia is stalked by the Babadook through the house until it takes over her and finally possesses her, breaking Bugsy's neck, and attempting to kill Sam. Eventually luring her into the basement, Sam knocks her out. Amelia awakens, tied up in the basement, with a terrified Sam nearby. When she tries to strangle him, he lovingly caresses her face, causing her to throw up an inky black substance, an action which seemingly expels the Babadook. When Sam reminds Amelia that \"you can't get rid of the Babadook\", an unseen force drags him into Amelia's bedroom. After saving Sam, Amelia is forced by the Babadook to rewatch a vision of her husband's death, to her utter despair. She then furiously confronts the Babadook, and is then able to make the beast retreat into the basement, where she locks the door behind it.\nAfter the ordeal, Amelia and Samuel have managed to recover. Amelia is attentive and caring toward him, encouraging him with the weapons he makes and being impressed at Sam's magic tricks. They gather earthworms in a bowl and Amelia takes them to the basement, where the Babadook resides. She places the bowl on the floor for the Babadook to eat. However, as the beast tries to attack her, Amelia calms it down, and it retreats to the corner taking the earthworms along with it. Amelia returns to the yard to celebrate Sam's birthday."}