{"mid": "TheBullfighters", "IMDB_id": "tt0037563", "title": "The Bullfighters", "plot": "Private detectives Stan Laurel and Oliver Hardy travel to Mexico City in pursuit of an infamous female larcenist named Hattie Blake (Carol Andrews), who is publicly known as ”Larceny Nell”. Meanwhile, an American sports promoter, Richard K. Muldoon (Ralph Sanford) meets with publicity man ”Hot Shot” Coleman (Richard Lane), and his assistant (Irving Gump) to discuss an upcoming bullfight featuring famed Spanish matador Don Sebastian. But when Muldoon sees pictures of the bullfighter he is enraged; Don Sebastian looks exactly like Laurel. Hot Shot is confused until Muldoon tells him the story: Eight years earlier, Laurel and Hardy both testified against Muldoon in a criminal case, and Muldoon was wrongfully convicted of the crime (the details of which were never specified) and granted a twenty-year jail sentence; However, after five years the true criminal confessed to the crime and Muldoon was subsequently released. But while in prison he had lost his wife and business and had to start all over in Mexico. He still holds a grudge against Stan and Ollie and vows revenge showing a large knife: \"Someday our paths will cross! And when they do, I'll skin them alive! First the little one, then the big one! I'll skin them both alive!!\"\nMeanwhile, Ollie and Stan confront Blake in an attempt to arrest her only for her to snatch the papers that permit them to arrest her outside the States followed by an egg-breaking tit for tat sequence before she escapes. They run into Coleman who sees Stan's uncanny resemblance to the bullfighter. Since the real Don Sebastian's arrival is delayed because of passport trouble, Coleman, after telling the confused Ollie and Stan about Stan's resemblance to Don Sebastian and the vengeful Muldoon's wrongful conviction, forces Stan to impersonate the bullfighter in the meantime, threatening to reveal his and Ollie's presence to Muldoon if he doesn’t cooperate, but promising them a very handsome payment for their trouble if he does. Stan reluctantly agrees only because Hot Shot promises he won't have to fight bulls. But eventually, the real Don Sebastian's passport trouble turns out to be worse than originally thought and so Stan will have to take his place in the ring and fight bulls after all.\nOn the day of the fight Stan, nervous about fighting bulls, gets drunk. But then, unbeknownst to anyone, the real Don Sebastian has somehow miraculously contrived to making it to Mexico City just in time for the big bullfight. Ollie mistakes him for Stan and forces him into the arena. Stan staggers up, and Hardy sends him into battle. With two Laurels in the ring, the outraged spectators cry foul and every bull in the arena is turned loose. Stan and Ollie try to escape the vengeful Muldoon, but not fast enough. The film ends with Muldoon catching up with them at their hotel as they are about to pack before attempting to escape to the airport. Just like he promised, he skins them alive, leaving them, except their heads, in bare bones. Then Ollie says his \"another nice mess…\" catchphrase to Stan. Stan whimpers before they decides to go home."}