{"mid": "TheBitterTeaOfGeneralYen", "IMDB_id": "tt0023814", "title": "The Bitter Tea of General Yen", "plot": "In the late 1920s in Shanghai during the Chinese Civil War, as throngs of refugees flee the rainswept city, a couple of elderly missionaries welcomes guests to their home for the wedding of Dr. Robert Strike (Gavin Gordon), a fellow missionary, and Megan Davis (Barbara Stanwyck), his childhood sweetheart whom he has not seen in three years. Some of the missionaries have a cynical view of the Chinese people they have come to save. Shortly after Megan arrives, her fiancé Bob rushes in and postpones the wedding so he can rescue a group of orphans who are in danger from the spreading civil war. Megan insists on accompanying him on his mission.\nOn the way they stop at the headquarters of General Yen (Nils Asther), a powerful Chinese warlord who controls the Shanghai region. While Megan waits in the car, Bob pleads with the general for a safe passage pass so he can save the orphans. Contemptuous of Bob's missionary zeal, General Yen gives him a worthless paper that describes Bob's foolishness. Bob and Megan reach St. Andrews orphanage safely, but the pass only makes the soldiers laugh and steal their car when they try to leave with the children. The missionaries and children eventually reach the train station, but in the chaos, Bob and Megan are both knocked unconscious and are separated.\nSometime later, Megan regains consciousness in the private troop train of General Yen, attended by his concubine, Mah-Li (Toshia Mori). When they arrive at the general's summer palace, they are greeted by a man named Jones (Walter Connolly), Yen's American financial advisor, who tells him that he has succeeded in raising six million dollars, hidden in a nearby boxcar, for General Yen's war chest. Megan is shocked by the brutality of the executions conducted outside her window. Fascinated and attracted by the young beautiful missionary, the general has his men move the executions out of earshot and assures her that he will send her back to Shanghai as soon as it is safe.\nOne evening, Megan drifts off to sleep and has an unsettling erotic dream about the general who comes to her rescue and kisses her passionately. Soon after, she accepts the general's invitation to dinner. While they are dining, the general learns that his concubine Mah-Li has betrayed him with Captain Li (Richard Loo), one of his soldiers. Later, after General Yen arrests Mah-Li for being a spy, Megan tries to intervene, appealing to his better nature. The general challenges her to prove her Christian ideals by forfeiting her own life if Mah-Li proves unfaithful again. Megan naively accepts and ends up unwittingly helping Mah-Li betray the general by passing information to his enemies about the location of his hidden fortune.\nWith the information provided by Mah-Li, the general's enemies steal his fortune, leaving him financially ruined and deserted by his soldiers and servants. General Yen is unable to take Megan's life—it is too precious to him. When she leaves his room in tears, he prepares a cup of poisoned tea for himself. Megan returns, dressed in the fine Chinese garments he gave her. She waits on him in the gentle manner of a concubine. When she says she could never leave him, he only smiles, then drinks the poisoned tea.\nSometime later, Megan and Jones are on a boat headed back to Shanghai. While discussing the beauty and tragedy of the general's life, Jones comforts Megan by saying that one day she will be with him again in another life."}