{"mid": "TheBeguiled", "IMDB_id": "tt0066819", "title": "The Beguiled", "plot": "During the middle of the American Civil War in 1863, injured Union soldier John McBurney is rescued from the verge of death by twelve-year-old Amy, a student at an all-girl boarding school in rural Mississippi, the Miss Martha Farnsworth Seminary for Young Ladies. The eponymous headmistress reluctantly agrees to take him in until he has built up his health, under the condition that he is locked in the music room and kept under watch. Edwina, the schoolteacher, takes an immediate liking to John, as does Carol, a teenage student.\nJohn begins to bond with each of the women in the house, including the slave, Hallie. As he charms each of the women, the sexually-repressed atmosphere of the school becomes filled with jealousy and deceit, and the women begin to turn on one another. After Carol witnesses John kissing Edwina in the garden, she ties a blue rag to the school's entrance gate to alert the Confederacy of a Yankee soldier. When a band of Confederate soldiers pass by the school and go to investigate, Martha lies and convinces them John is part of the Confederacy.\nMartha also becomes secretly infatuated with John, and it is revealed through flashback that she had an incestuous relationship with her deceased brother when he lived in the house. Martha considers keeping John at the school as a handyman, and later makes sexual advances toward him, which he declines.\nLate one night, Edwina witnesses John having sex with Carol in her bedroom and, in a jealous rage, beats him with a candlestick, causing him to fall down the grand staircase and break his leg. Martha insists he will die of gangrene as a result of his bone breaking the skin unless they amputate his leg. The women carry him to the kitchen where they tie him to the table and feed him wine before Martha saws off his leg at the knee. John awakens to Amy standing by his bedside, and Martha and Edwina enter the room. When they reveal that his leg has been amputated, he goes into a fury, convinced that Martha went through with the amputation in retaliation for his declining her romantic advances.\nIn the aftermath of the amputation, John and Edwina's romance begins to grow, while his relationships with the other women in the house begin to deteriorate. One night in a drunken rage, John, convinced that Martha plans to hold him prisoner, acquires a pistol and threatens the women before killing Amy's pet turtle.\nMartha convinces the women—aside from Edwina, who is not present—that their only option is to kill him. She asks Amy to pick poisonous mushrooms in the woods, which they serve to him at dinner that evening. At the dining table, John apologizes for his actions, and Edwina reveals that she and John have made plans to leave the school and marry. Edwina begins to help herself to the mushrooms, but Martha stops her. John realizes he has been poisoned, and leaves the dining room disoriented, before collapsing in the hallway. The following day, the women tie his corpse in a makeshift body bag, and carry him out of the gate, to burial."}