{"mid": "TheBlackRoom", "IMDB_id": "tt0086971", "title": "The Black Room", "plot": "Larry [Jimmy Stathis] thinks it's a dream come true when he rents an exotic \"fantasy\nroom\" in a mansion in the Hollywood Hills for only $200 a month. He uses\nit for his trysts with various women and then goes home at night to tell\nhis wife Robin [Clara Perryman] all about them. Robin doesn't believe a word of it, but she\ndoes like how Larry's fantasies are having a stimulating effect on their\nlovelife, which is too often interrupted by the demands of their two\nchildren, Mark [Edwin Avedissian] and Jenny [Allisun Kale].Larry's landlords, Jason [Stephen Knight] and Bridget [ Cassandra Gaviola], are brother and sister. Jason\nhas a blood disorder called thalassemia aka Cooley's anemia. Bridget helps\nJason to find victims whose blood they exsanguinate and transfuse into\nJason when he starts having one of his spells, which are becoming more and\nmore frequent. They also take great delight in peeking through the one-way\nmirror and photographing Larry and his activities in the black room. After\na few weeks, Larry and Bridget start playing together, too.Everything is going along smoothly until Robin borrows Larry's car to\ndo some shopping and comes upon both the ad and the keys for the black\nroom. Shaken in her realization that Larry has been telling the truth,\nRobin makes a copy of the key and goes snooping. The room is real enough,\nand when she happens upon Jason, he shows her pictures of Larry and his\nsex partners as proof. Robin is horrified and stays to watch Larry the\nnext time he brings one of his girls (Lisa [Charlie Young]) to the room.Jason suggests that Robin join in her husband's game and bring her\nown lovers to the room. Mostly out of revenge but also curiosity, Robin\ninvites Lisa's boyfriend Terry [Christopher McDonald]. While they have sex, Larry watches through\nthe mirror and does a slow burn. Later that evening, after they have\nreturned home, Larry gives Robin an ultimatum...him or the room. Robin\nneeds some time alone, so she leaves the kids with Larry and goes to the\nroom to think.Meanwhile, Bridget and Jason have lured Terry and Lisa to the room\nand fed them wine laced with knock-out drops. They carry their bodies down\nto the lab and proceed to drain them of their blood. When Robin arrives,\nshe drinks some of the drugged wine and passes out. Larry calls their\nbabysitter Milly [Linnea Quigley] to stay with the kids, and then he drives to the mansion.\nWhen he arrives, Jason chloroforms him and chains him in the black room\nwith Robin. Bridget telephones Milly and tells her to bring the kids and\njoin Robin and Larry. When Milly arrives, Bridget lures the kids out to\nthe garden while Jason takes Milly down to the lab.Jason then returns to the black room where Robin and Larry are\nchained together. When he releases the chains to prepare Robin for\nexsanguination, Larry suddenly leaps up and strangles Jason with a chain.\nLarry then releases Robin and goes looking for the kids. He finds Milly in\nthe lab but, before he can release her, Bridget locks the lab door.\nRobin wakes up and twists a coathanger into a point. When she\nencounters Bridget, she jabs the point into Bridget's neck. Robin releases\nLarry from the lab, and they go looking for the kids. They find them\nasleep on the couch and take them out to the car. Then they remember\nMilly, and Larry goes back to get her. Meanwhile, Jason has come to\nconsciousness. He tries to attack Larry, but Larry stabs him in the\nstomach and drowns him in a bathtub of blood. Larry carries Milly out to\nthe car and, after having some trouble getting the car to start, the five\nof them drive away.Meanwhile, inside the mansion, Jason and Bridget both revive. A few\ndays later, an ad appears in the newspaper for an exotic \"fantasy room\" in\na mansion in the Hollywood Hills for only $200 a month. [Original Synopsis by bj_kuehl]"}