{"mid": "TheBradyBunchMovie", "IMDB_id": "tt0112572", "title": "The Brady Bunch Movie", "plot": "Larry Dittmeyer, an unscrupulous real estate developer, explains to his supervisor that almost all the families in his neighborhood have agreed to sell their property as part of a plan to turn the area into a shopping mall, except for the Brady family.\nAt the Bradys' house, Mike and Carol are having breakfast prepared by their housekeeper, Alice, while the six children prepare for school. Jan is jealous of her elder, popular sister Marcia. Cindy is tattling about everything she's hearing. Greg is dreaming of becoming a singer (but sings folk songs more appropriate to the seventies). Peter is nervous that his voice is breaking. Bobby is excited about his new role as hall monitor at school.\nCindy gives Mike and Carol a tax delinquency notice (which was earlier mistakenly delivered to the Dittmeyers) stating that they face foreclosure on their house if they do not pay $20,000 in back taxes. The two initially ignore the crisis, but when Mike's architectural design (which is exactly the same as their house) is turned down by two potential clients, he tells Carol that they may have to sell the house. Cindy overhears this and tells her siblings and they look for work to raise money to save the house, but their earnings are nowhere near enough to reach the required sum. Mike manages to sell a Japanese company on one of his dated designs, thereby securing the money, only for Larry to sabotage it by claiming that Mike's last building collapsed.\nOn the night before the Bradys have to move out, Marcia suggests that they enter a \"Search for the Stars\" contest, the prize of which is exactly $20,000. Jan, having originally suggested this and been rejected, runs away from home. Cindy sees her leave and tattles, and the whole family goes on a search for her. They use their car's citizens' band radio, and their transmission is heard by Schultzy, a driver who picks up Jan and convinces her to return home.\nThe next day, the children join the \"Search for the Stars\" contest with a dated performance that receives poor audience response compared to the more modern performances of other bands. However, the judges — Davy Jones, Micky Dolenz, and Peter Tork of The Monkees — vote for them, and they win the contest as a result. The tax bill is paid and their neighbors withdraw their homes from the market, foiling Larry's plan and securing the neighborhood.\nLater, Carol's mother arrives and finally convinces Jan to stop being jealous of Marcia, only for Cindy to start feeling jealous of Jan."}