{"mid": "TheBigCountry", "IMDB_id": "tt0051411", "title": "The Big Country", "plot": "Successful sea captain James McKay (Gregory Peck) travels to the American West to join his fiancée Patricia (Carroll Baker) at the enormous ranch owned by her father, Henry Terrill (Charles Bickford), referred to by all as \"The Major.\" Terrill has been feuding with Rufus Hannassey (Burl Ives), the patriarch of a poorer, less refined ranching clan, over water rights in the arid grazing lands of the high plains.\nPatricia's friend, schoolteacher Julie Maragon (Jean Simmons), owns the \"Big Muddy\", a large ranch itself, with a source of water that is vital to both Hannassey and Terrill in times of drought. Julie allows all to water their cattle and refuses to sell or lease the Big Muddy to either side, so as to keep the fragile peace.\nMcKay brings a pair of dueling pistols to the Major as a gift. But he repeatedly refuses to be provoked into proving his manhood; he tells the Major that his father died in a meaningless duel. He does nothing when Hannassey's trouble-making son Buck (Chuck Connors) and his shiftless companions harass him. He also declines an invitation by Terrill's foreman, Steve Leech (Charlton Heston), to ride an unbroken horse named \"Old Thunder.\" Consequently, everyone, including Patricia, considers him a coward.\nWhen the Major and his men ride to the Hannassey ranch in retribution for Buck's harassment of a Terrill guest, McKay declines to participate. Buck makes his escape from Terrill's men while others in his posse are punished and beaten senseless. Alone at Terrill's ranch except for ranch hand Ramon (Alfonso Bedoya), McKay then breaks Old Thunder, after being thrown out of the saddle numerous times. He swears Ramon, the only witness, to secrecy.\nTerrill hosts a Grand Gala to formally announce Patricia's upcoming wedding. A ruffled and grizzled Hannassey, armed with a shotgun, spoils the festive mood when he confronts Terrill in front of all his guests over the brutal beating of his men. He threatens to start a range war over Terrill's steadfast practice of denying water to Hannassey's cattle.\nMcKay rides out to the Big Muddy and persuades Julie to sell him the land, promising to continue her policy of unrestricted access to the river. A search party, led by Leech, spends two days looking for McKay, believing he has become lost. McKay explains that he was never in danger, but Leech calls him a liar. Again refusing to be goaded into a fight, McKay sees that both Patricia and her father are disappointed; they agree to reconsider their engagement. Early the next morning, before anybody else is up, McKay seeks out Leech to settle their quarrel. They fight, without witnesses, to an exhausted draw. McKay quietly asks Leech exactly what they proved by fighting. Leech has a new understanding and respect of McKay.\nJulie tells her friend Patricia that McKay bought the Big Muddy for her. Patricia is excited because her father will be so pleased with her wedding gift. Once she learns McKay plans to give Hannassey access to his water, however, Patricia leaves, understanding their engagement is over.\nActing on Terrill's orders, Leech and his men chase Hannassey's cattle away from the Big Muddy. Hannassey, in retaliation, kidnaps Julie and uses her as bait to lure Terrill into an ambush in the narrow canyon leading to Hannassey's homestead. Buck tries to force himself on Julie, but his father stops him. Buck, furious, tries to strangle his father, but is overpowered. His father states, \"One day I know I'm going to have to kill you.\"\nMcKay finds out about Julie and rides to the Hannassey place, where he shows Hannassey the deed to Big Muddy and promises him equal access to the water. Hannassey says he intends to fight Terrill anyway, whereupon McKay tells him that it is plain that this is just a personal vendetta between two old men.\nWhen it becomes obvious that McKay and Julie have feelings for each other, Buck attacks McKay. They fight, but Hannassey steps in when Buck draws his gun on the unarmed McKay and insists on a fair, formal duel. After walking apart ten paces, Buck fires before the signal, grazing McKay's forehead. Hannassey is furious. McKay slowly takes aim, but Buck drops to the ground in terror and crawls behind a wagon wheel. McKay fires into the dirt, ending the duel, and Hannassey spits on Buck in disgust. McKay and Julie are about to leave when Buck grabs a gun, forcing Hannassey to shoot his son dead.\nTerrill insists on riding into Blanco Canyon for a final confrontation. Leech and the rest of his men initially refuse to accompany him, but after Terrill rides out alone, Leech joins him, followed by the rest of the outfit. They are quickly pinned down. Hannassey, acknowledgeing the truth of McKay's accusation, orders his men to stop shooting and challenges Terrill to a one-on-one showdown. Terrill promptly agrees. Armed with rifles, the two old men advance and kill one another.\nMcKay and Julie ride off to start a new life together."}