{"mid": "TheBfg", "IMDB_id": "tt0096866", "title": "The BFG", "plot": "As the book starts, a young girl named Sophie lies in bed in an orphanage. She can’t sleep, and sees a strange sight in the street. A giant man is walking in the street, carrying a suitcase and what looks like a trumpet. He sees Sophie, who runs to her bed and tries to hide. This doesn’t work, and the giant picks her up through the window. Then, he starts to run incredibly fast, until he reaches a large cave, which he enters.\nWhen he sets Sophie down, she begins to plead for her life, believing that the giant will eat her. The giant laughs, and explains that most giants do eat human beings, and that the people’s origins affect their taste. For example, people from Greece taste greasy. The giant then says that he will not eat her, as he is the BFG, or the Big Friendly Giant.\nThe BFG then explains that he must stay with her forever, as no one can know of his existence. He warns her of the dangers of leaving his cave, as his neighbors are sure to eat her if they catch her. The BFG then explains what he was doing with the trumpet and suitcase. He catches dreams, stores them in the cave, and then gives the good ones to children all around the world. He destroys the bad ones. The BFG then explains that he only eats snozzcumbers, which are disgusting vegetables that taste of frogskins. Another giant, the Bloodbottler, then storms in. Sophie hides in a snozzcumber and is nearly eaten by the Bloodbottler.\nAfter this, Sophie and the BFG vow to make the other giants disappear. The BFG and Sophie then partake in some frobscottle, which is a carbonated liquid that causes extreme flatulence. After this, the two go to Dream Country to catch some dreams and the BFG shows Sophie his collection of dreams. Later, Sophie has an idea on how to beat the other giants. She has the BFG give the Queen of England a dream that shows the malevolent giants. This frightens the Queen and wakes her up, at which point Sophie explains that her dream was real. The Queen then vows to help the two.\nWith other countries' assistance, they construct a giant pit. With the BFG’s help, they lure the other giants into the trap, where they can’t eat anyone else. Instead, they must eat snozzcumbers. At the end, it is revealed that the BFG and Sophie live in a mansion, where Sophie is teaching the BFG how to read and write, and the BFG is actually writing the book."}