{"mid": "TheBigRedOne", "IMDB_id": "tt0080437", "title": "The Big Red One", "plot": "The film begins in black and white in November 1918 at the end of World War I. A private (Marvin), using his trench knife, kills a German soldier who was approaching with his arms raised and speaking in German. When he returns to his company's headquarters, the private is told that the \"war's been over for four hours.\" The 1st Division patch is shown in color.\nThe film then moves to November 1942, when the soldier, now a sergeant in the \"Big Red One\", leads his squad of infantrymen through North Africa, where they are initially fired on by a Vichy French general, who is then overpowered by his French troops who are loyal to Free France. Over the next two years the squad serves in campaigns in Sicily, where they are given intelligence by a peasant boy, and are fed by grateful women, Omaha Beach at the start of the Normandy Campaign, the liberation of France where they battle Germans inside a mental asylum, and the invasion of western Germany.\nThroughout the film, the sergeant's German counterpart, Schroeder, participates in many of the same battles and displays a ruthless loyalty to Hitler and Germany. At different times he and the sergeant express the same sentiment that soldiers are killers but not murderers.\nDuring the advance across northern France the squad crosses the same field where the sergeant killed the surrendering German at the start of the film, where a memorial now stands. The following short conversation takes place:\nJohnson: Would you look at how fast they put up the names of all our guys who got killed?\nThe Sergeant: That's a World War One memorial.\nJohnson: But the names are the same.\nThe Sergeant: They always are.\nThe squad's final action in the war is the liberation of Falkenau concentration camp in Czechoslovakia. Shortly after this, the sergeant is in a forest at night, having just buried a young boy he had befriended after liberating the camp. Schroeder approaches, attempting to surrender, but the sergeant stabs him. His squad then arrives and informs him that the war ended \"about four hours ago.\" This time, as the squad walks away, Pvt. Griff (Mark Hamill) notices that Schroeder is still alive; the sergeant and his men work frantically to save his life as they return to their encampment."}