{"mid": "TheBachelorAndTheBobbySoxer", "IMDB_id": "tt0039169", "title": "The Bachelor and the Bobby-Soxer", "plot": "Margaret Turner (Myrna Loy) and Susan Turner (Shirley Temple) are sisters who live together. Susan is an intelligent 17-year-old high-school student with a habit of forming short-lived interests after hearing the regular guest lectures at the school. Margaret is a judge, and Susan's guardian.\nRichard Nugent (Cary Grant), a handsome and sophisticated artist, is a defendant in Margaret's courtroom, charged by ADA Tommy Chamberlain (Rudy Vallee) with starting a nightclub brawl. She releases him with a warning when it becomes clear that the fight was started by two women fighting over him.\nHe proceeds to Susan's school, where he is the guest lecturer for the day—and as he speaks, Susan becomes infatuated with him. After the talk she finds a reason to spend time with him and suggests she model for him; that evening, she puts on a sophisticated dress and sneaks away from home and into his apartment while he is out.\nRichard has no sooner discovered Susan in his apartment than Tommy and Margaret arrive to rescue her from his presumed seduction. Richard assaults Tommy and is held in jail until Matt Beemish (Ray Collins), who is the court psychiatrist and also Margaret and Susan's uncle, intervenes and explains the true situation. He recommends allowing Susan to date Richard until the infatuation burns itself out; Tommy will drop the assault charge if Richard complies.\nAt a high-school basketball game, Richard tries unsuccessfully to boost Susan's image of Jerry White (Johnny Sands), the boyfriend she dumped for him. Later, at a school picnic, Susan persuades Richard to enter a series of novelty races (open to adult family members), where he loses repeatedly to Tommy. But in the main event, an obstacle course, she asks Jerry to help Richard win. Because he still loves her, Jerry complies, helping him directly at one point, then colliding with Tommy so that Richard does win the event.\nMeanwhile, Richard and Margaret are becoming attracted to each other, to the discomfiture of Tommy, who sees Richard as a habitual troublemaker and wants Margaret for himself. Hoping Richard will stop seeing Margaret if he no longer has to date Susan, Tommy announces he is dropping the charge. But Richard and Margaret go out to a nightclub, where they are interrupted in succession by all the other main characters as well as a former girlfriend of Richard's. They all part angrily.\nAfterwards, though, Matt is able to talk sense into Susan, and she returns to Jerry. Matt finds out that Richard has decided to take a trip and is able to manipulate affairs so that Margaret will travel with him. Learning that Tommy is coming to arrest Richard on trumped-up charges, Matt forestalls him by telling police at the airport that Tommy is a mental patient with delusions of being an ADA. Richard and Margaret are happily surprised to meet each other as they approach the plane to board."}