{"mid": "TheBlackPirate", "IMDB_id": "tt0016654", "title": "The Black Pirate", "plot": "The film begins with the looting of a ship already captured and badly mauled, by the pirates. After relieving the ship and crew of valuables, the pirates fire the ship, blowing up the gunpowder on board, sinking her. While the pirates celebrate, two survivors wash up on an island, an old man and his son. Before dying, the older man gives his signet ring to his son (Douglas Fairbanks). His son buries him, vowing vengeance.\nThe Pirate Captain and Lieutenant bring some crew to the other side of the same island to bury some of their plunder. They then plan to murder the other pirates: \"Dead men tell no tales.\" But first, Fairbanks appears as the \"Black Pirate\", who offers to join their company and fight their best man to prove his worth. After much fighting, the Black Pirate kills the Pirate Captain. The Pirate Lieutenant sneers, and says there is more to being a pirate than sword tricks. To further prove his worth, the Black Pirate says he will capture the next ship of prey single-handed, which he does. He then uses his wits to prevent the pirates from blowing up the ship along with the crew and passengers, suggesting that they hold the ship for ransom.\nWhen a woman is discovered on board, the Pirate Lieutenant claims her. In love at first sight, the Black Pirate finds a way to temporarily save her from this fate by presenting her as a \"princess\" and urging the crew to use her as a hostage to ensure their ransom will be paid, as long as she remains \"spotless and unharmed\".\nThe pirates cheer the Black Pirate, and want to name him captain. The Pirate Lieutenant jeers but consents to wait to see if the ransom is paid by noon the next day. However, he secretly has a confederate destroy the ransom ship later that night to ensure it will not return. Then, when the Black Pirate is caught trying to release the woman, the Pirate Lieutenant exposes him as a traitor and the pirates force him to walk the plank.\nAt noon the next day, with the ransom ship having failed to show, the Pirate Lieutenant goes to the woman to claim his prize. But just then, the Black Pirate, who with the help of the sympathetic one-armed pirate MacTavish had survived being sent overboard, returns leading troops to stop the pirates. After a long fight, the pirates are routed. In the end, the Black Pirate is revealed to be a Duke, and the \"Princess\" he loves a noble Lady. Even MacTavish is moved to tears of joy by the happy ending."}