{"mid": "TheBermudaDepths", "IMDB_id": "tt0077223", "title": "The Bermuda Depths", "plot": "On a Bermuda beach, a sleeping Magnus Dens (Leigh McCloskey) is approached by a beautiful but mysterious woman (Connie Sellecca), who seems to recognize him. In the meantime, Magnus is dreaming of his childhood, playing on the same beach, watching a turtle egg hatch with his friend Jennie. Jumping a few years later, both are playing with a grown turtle, Magnus carves \"J+M\" inside a heart on the turtle's shell while Jennie makes a cowrie shell necklace for Magnus. Follow on to young Magnus on the beach spotting Jennie riding the turtle heading out to open sea and disappearing beneath the water as he calls after her. Then jumping to his nightmare of the night his father, Lionel was knocked into the water by an unseen horror in the cave beneath the house and part of his house on a cliff crumbling down to the beach as the storm rage on.\nFinally awakening and groggily gathering his things to go to town, Magnus sees a woman swimming in the ocean. He meets his childhood friend Eric (Carl Weathers) at the docks. When Eric asks him where he's been, he admits he's been drifting for a few years. Eric introduces Magnus to Dr. Paulis (Burl Ives), whom Eric is working for to finish his master's degree in marine biology. Suddenly the boat lists violently to one side and the net they pulled up has been shredded by something very large and strong.\nThat evening, the three men are joined by Eric's wife Doshan (Julie Woodson) for dinner at Dr. Paulis' house. He explains that he and Eric are doing teratology. Dr. Paulis calls out to Delia (Ruth Attaway) to hurry up with dinner. Magnus is intrigued by the necklace she wears, which resembles his own.\nAfter dinner, upon not getting answers to his query about his father's death from Dr. Paulis, Magnus steps outside. He again sees the mysterious woman swimming by the boat. He jumps into the water to follow her, but he is saved from drowning and revived on the beach by the woman, whom he doesn't recognize. She returns to the ocean, telling him her name is Jennie Haniver. His description of the incident to Dr. Paulis is not taken seriously and he went off angrily. But when Delia tells him about the legend of Jennie Haniver he becomes upset.\nThe next morning, the police brings in Eric to examine enormous tracks on the beach. Magnus goes down to the beach and meets Jennie. Finally remembering her as his young playmate, he takes her to his father's wrecked house. He tells her some of his memories from childhood, while she describes the quadrilles her father would hold in their great hall. Then Eric calls him away to go out on a boat with Dr. Paulis. Again, the boat lurches uncontrollably forcing Eric to cut the cable to the trawling net.\nIn the evening, Magnus again confronts Dr. Paulis about his father's death. Paulis explains that Lionel was conducting tests regarding mutation in sea life when he was attacked and apparently eaten. Magnus asks him if he remembers the turtle from his childhood, and describes how he carved initials on the shell, for himself and Jennie. Paulis is dismayed.\nMagnus awakens to Eric and Dr. Paulus arguing. Eric wants to use the Horror, a harpoon-firing bazooka. Paulis is aghast at the idea, withdraws his support for the expedition. Eric collects Magnus and heads out in the boat. After some trawling, they again find something dragging on the line. Taking a small harpoon gun, Eric dives to try to save the net. He shoots at a form he could see only vaguely. It turns out to be Jennie. Eric and Magnus resume trawling. Magnus tells Eric he had been with Jennie the night before on the beach, and how she was his friend from when he was young. Eric doesn't remember her, and dismisses her as an imaginary friend. The trawl lines finally catch the turtle, which is so large it begins to tear through the net. Eric blasts it with the Horror, and allows it to run out the line, waiting for it to resurface.\nAfter sundown, the boat's power mysteriously gives out, the compass spins crazily. Magnus leaves the boat's cabin, finds Jennie on board the ship. She begs him to free the turtle, nebulously saying she made a promise long ago she'll forever regret.\nAt Doshan's insistence, Dr. Paulis boards a helicopter to fly out to the boat. Upon arriving, he observes a huge shape underwater near the boat. The turtle surfaces, swimming quickly towards the helicopter, then leaping out of the water, sending the helicopter crashing into the ocean. Upon seeing the crash, Eric rushes out onto the deck but is confronted by Jennie. To his horror, her eyes glow an eerie green, just as the turtle surfaces under the boat, capsizing it. Magnus climbs aboard the lifeboat amidst the wreckage and desperately tries to help Eric on board, but he is entangled in the line from the Horror. The turtle surfaces, its eyes glowing exactly like Jennie's, before it dives down into the depths, dragging Eric helplessly behind.\nJennie approaches an unconscious Magnus lying face flat on the beach, sadly kisses him, then returns to the ocean for the last time.\nDoshan approaches Magnus in the graveyard where his parents are buried and expresses her horror at the losses of her husband and Dr. Paulis. Magnus tells her he is leaving Bermuda and wants nothing to do with the sea ever again. He walks away without noticing the statue of Jennie and the inscription \"Jennie Haniver, 1701-, Lost at Sea\" on her gravestone\nOn the ferry leaving Bermuda, Magnus removes the necklace Jennie had given him and sadly throws it into the sea. It sinks past the giant turtle, which is shown to have the initials Magnus inscribed on its shell so many years ago."}