{"mid": "TheBabysitter", "IMDB_id": "tt0112438", "title": "The Babysitter", "plot": "Jennifer (Alicia Silverstone) is a beautiful teenager who is hired to babysit the children of Harry Tucker (J.T. Walsh) and his wife, Dolly Tucker (Lee Garlington), while they attend a party hosted by their friends, Bill Holsten (George Segal) and his wife, Bernice Holsten (Lois Chiles). Harry often fantasizes about Jennifer, while Dolly misinterprets Bill's compliments as a sign of attraction and fantasizes about him. Meanwhile, Jennifer's ex-boyfriend Jack (Jeremy London), whom she broke up with after he began pressuring her for sex, runs into his estranged troublemaking friend Mark (Nicky Katt), Bill and Bernice's son, who once had a fling with Jennifer and still harbors feelings for her. Throughout the night, Harry, Jack and Mark have increasingly racy fantasies about Jennifer.\nJack calls Jennifer and asks to visit her at the Tuckers' residence, but she refuses. Mark later steals beer from Bill's party, where they run into Harry, who becomes fixated on the notion Jack might go to his house to have sex with Jennifer. Jack and Mark get increasingly drunk and show up uninvited to see Jennifer, but she refuses to let them in. They then spend the rest of the night stalking around the house and spying on her through the window. Meanwhile, Harry gets drunk and falls asleep in his car, where he has a nightmare of Jennifer and Jack having sex, which drives him to rush home and confront them. In his absence, Dolly makes a pass at Bill, who rejects her, but agrees to keep her secret and offers to drive her home.\nAt the Tuckers' residence, Jack and Mark force their way in while Jennifer is taking a bath and, after a tense argument, Mark knocks Jack unconscious and attempts to rape Jennifer, who runs out of the house. Mark pursues her and ends up being fatally run over by Harry, who is arrested for drunk driving just as Bill and Dolly arrive and hear about the accident. Before being escorted home, Jennifer confronts Jack, who is being questioned by the police, and asks him, \"What were you thinking?\" before leaving an ashamed and guilt-stricken Jack behind."}