{"mid": "TheBarefootContessa", "IMDB_id": "tt0046754", "title": "The Barefoot Contessa", "plot": "Down on his luck, a washed-up movie director and writer Harry Dawes (Humphrey Bogart) is reduced to working for abusive, emotionally-stunted business tycoon Kirk Edwards (Warren Stevens), who has decided that he wants to produce a film to stroke his monumental ego. Looking for a glamorous leading lady, they go to a Madrid night club to see a dancer named Maria Vargas (Ava Gardner), whom Kirk had already been told about. Maria is a blithe but proud spirit who likes to go barefoot and has a troubled home life. Maria immediately likes Harry, whose work she knows, but takes an instant disliking of Kirk. Although she flees during their meeting, Harry tracks her down to her family home and convinces her to fly away with them to America to make her first film. Thanks to his expertise and the help of sweaty, insincere publicist Oscar Muldoon (Edmond O'Brien), her film debut is a sensation. With subsequent films by this team, Maria becomes a respected actress, Harry's career shines bright once again, and their relationship becomes a healthy friendship.\nDuring a party at Maria's house, Kirk and wealthy Latin American playboy Alberto Bravano (Marius Goring) become involved in an argument over Maria. Alberto had conspicuously admired Maria during the evening, while believing that she is Kirk's mistress. When Alberto invites her to join him on his yacht in the Riviera, Kirk orders her to stay away from him. Freeing herself from the dictates of Kirk, she accepts Alberto's invitation. Also seeing an opportunity, Oscar, tired of stooging for Kirk, switches his allegiance to Alberto.\nShe is a great star, but Maria is not satisfied. She envies the happiness her friend Harry has found with his wife Jerry (Elizabeth Sellars) and wants a prince charming of her own. Alberto is too frivolous and shallow for her. One evening at a casino, while Alberto is gambling, Maria takes some of his chips and cashes them, throwing the money to her gypsy lover from a window. When Alberto goes on a losing streak, he berates Maria in public for ruining his luck. Subsequently, he receives a slap in the face from Count Vincenzo Torlato-Favrini (Rossano Brazzi), who escorts Maria from the casino.\nMaria has found the great love of her life. They wed in a lavish ceremony, but there is a problem. The count and his widowed sister (Valentina Cortese) are the last of the Torlato-Favrinis; without offspring, the noble line will die out. The Count has a secret. Due to a war injury, he is impotent. He does not tell Maria about this until their wedding night.\nSome time later, Harry is in Italy and an unhappy Maria tells him about her husband and confesses that she is pregnant. She believes the count will want this child and plans to tell him about it that night. However, her husband has suspected she was unfaithful and shoots both her and her lover before she can tell him about the child. Harry arrives just as the shots are fired and does not tell the count about the pregnancy. The story ends (as it began) with flashbacks at her funeral."}