{"mid": "TheBlackCauldron", "IMDB_id": "tt0088814", "title": "The Black Cauldron", "plot": "In the land of Prydain, Taran is an \"assistant pig-keeper\" on the small farm of Caer Dallben, home of Dallben the Enchanter. Dallben learns that the Horned King is searching for a mystical relic known as the Black Cauldron, which is capable of creating an invincible army of undead warriors, the \"Cauldron-Born\". Dallben fears the Horned King may try to steal his pig Hen Wen, which has oracular powers, and use her to locate the cauldron. Dallben directs Taran to take Hen Wen to safety; unfortunately, Taran's foolish daydreaming causes Hen Wen to be captured by the Horned King's forces.\nTaran follows them to the Horned King's stronghold. Along the way, he encounters the small, pestering companion Gurgi, who joins Taran on his search. Frustrated by Gurgi's antics, Taran leaves the former to sneak into the castle and rescues Hen Wen, but although Hen Wen escapes from the castle, Taran is arrested and thrown into the dungeon. A fellow captive named Princess Eilonwy frees Taran as she is trying to make her own escape. In the catacombs beneath the castle, Taran and Eilonwy discover the ancient burial chamber of a king, where Taran arms himself with the king's sword. It contains magic that allows him effectively to fight the Horned King's minions and so to fulfill his dream of heroism. Along with a third prisoner, the comical, middle-aged bard Fflewddur Fflam, they escape from the castle and are soon reunited with Gurgi. Upon discovering that Taran has escaped, the Horned King orders his dwarf companion Creeper to send the Gwythaints to follow Taran and bring him back alive.\nFollowing Hen Wen's trail, the four stumble into the underground kingdom of the Fair Folk who reveal that Hen Wen is under their protection. When the cheerful, elderly King Eiddileg reveals that he knows where the cauldron is, Taran resolves to go destroy it himself. Eilonwy, Fflewddur, and Gurgi agree to join him and Eiddileg's obnoxious right-hand man Doli is assigned to lead them to the Marshes of Morva while the Fair Folk agree to escort Hen Wen safely back to Caer Dallben. At the marshes they learn that the cauldron is held by three witches—the grasping Orddu, who acts as leader; the greedy Orgoch; and the more benevolent Orwen, who falls in love with Fflewddur at first sight, which causes a frightened Doli to abandon the group. Orddu agrees to trade the cauldron for Taran's sword, and he reluctantly agrees, although he knows that to yield it will cost his chance for heroism. Before vanishing, the witches reveal that the cauldron is indestructible, and that its power can only be broken by someone who climbs in under his own free will, which will kill him. Although Taran feels foolish for aspiring to destroy the cauldron alone, his companions show their belief in him; and it seems that Eilonwy and Taran will kiss. Suddenly, the celebration is interrupted by the Horned King's soldiers who have finally reached the marshes themselves. They seize the cauldron and arrest everyone but Gurgi, and take their prisoners back to the castle. The Horned King uses the cauldron to raise the dead and his Cauldron-born army begins to pour out into the world.\nGurgi manages to free the captives and Taran decides to cast himself into the cauldron, but Gurgi stops him and jumps into the cauldron himself. The undead army collapses. When the Horned King spots Taran at large, he infers the turn of events and saying that Taran has interfered for the last time, throws the youth toward the cauldron; however, the cauldron's magic is out of control. It consumes the Horned King in a tunnel of fire and blood, as well as destroying the castle, using up all its powers forever. The three witches come to recover the now-inert Black Cauldron. However, Taran has finally realized Gurgi's true friendship, and he persuades them to revive the wild thing in exchange for the cauldron, forcing him to give up his magical sword permanently. Fflewddur challenges the reluctant witches to demonstrate their powers by the revival, and upon hearing Fflewddur's remarks, the witches honor the request, restoring Gurgi back to life. The four friends then journey back to Caer Dallben where Dallben and Doli watch them in a vision created by Hen Wen, and Dallben finally praises Taran for his heroism despite the fact that he prefers to be a Pig-Boy."}