{"mid": "TheBestYearsOfOurLives", "IMDB_id": "tt0036868", "title": "The Best Years of Our Lives", "plot": "After World War II, Fred Derry (Dana Andrews), Homer Parrish (Harold Russell), and Al Stephenson (Fredric March) meet while flying home to Boone City (a fictional city patterned after Cincinnati, Ohio). Fred was a decorated Army Air Forces captain and bombardier in Europe. Homer lost both hands from burns suffered when his aircraft carrier was sunk, and now uses mechanical hook prostheses. Al served as an infantry platoon sergeant in the Pacific. All three have trouble adjusting to civilian life.\nAl has a comfortable home and a loving family: wife Milly (Myrna Loy), adult daughter Peggy (Teresa Wright, who was only thirteen years Loy's junior), and college freshman son Rob (Michael Hall, who is absent after the first one-third of the film). He returns to his old job as a bank loan officer. The bank president views his military experience as valuable in dealing with other returning servicemen. When Al approves a loan (without collateral) to a young Navy veteran, however, the president advises him against making a habit of it. Later, at a banquet held in his honor, a slightly inebriated Al expounds his belief that the bank (and America) must stand with the vets who risked everything to defend the country and give them every chance to rebuild their lives.\nBefore the war, Fred had been an unskilled drugstore soda jerk. He wants something better, but the tight postwar job market forces him to return to his old job. Fred had met Marie (Virginia Mayo) while in flight training and married her shortly afterward, before shipping out less than a month later. She became a nightclub waitress while Fred was overseas. Marie makes it clear she does not enjoy being married to a lowly soda jerk.\nHomer was a football quarterback and became engaged to his next door neighbor, Wilma (Cathy O'Donnell), before joining the Navy. Both Homer and his parents now have trouble dealing with his disability. He does not want to burden Wilma with his handicap so he eventually pushes her away, although she still wants to marry him.\nPeggy meets Fred while bringing her father home from a bar where the three men meet once again. They are attracted to each other. Peggy dislikes Marie, and informs her parents she intends to end Fred and Marie's marriage, but they tell her that their own marriage overcame similar problems. Concerned, Al demands that Fred stop seeing his daughter. Fred agrees, but the friendship between the two men is strained.\nAt the drugstore, an obnoxious customer, who claims that the war was fought against the wrong enemies, gets into a fight with Homer. Fred intervenes and knocks the man into a glass counter, costing him his job. Later, Fred encourages Homer to put his misgivings behind him and marry Wilma, offering to be his best man.\nOne evening, Wilma visits Homer and tells him that her parents want her to leave Boone City for an extended period to try to forget him. Homer bluntly demonstrates to her how hard life with him would be. When Wilma is undaunted, Homer reconsiders.\nOn arriving home, Fred discovers his wife with another veteran (Steve Cochran). After complaining to Fred that she has \"given up the best years of my life,\" Marie tells him that she is getting a divorce. Fred decides to leave town, and gives his father his medals and citations. His father is unable to persuade Fred to stay. After Fred leaves, his father reads the citation for his Distinguished Flying Cross as composed by General Doolittle. At the airport, Fred books space on the first outbound aircraft, without regard for the destination. While waiting, he wanders into a vast aircraft boneyard. Inside the nose of a B-17, he relives the intense memories of combat. The boss of a work crew rouses him from his flashback. When the man says the aluminum from the aircraft is being salvaged to build housing, Fred persuades the boss to hire him.\nAt the bride's home, people have gathered for the wedding of Homer and Wilma. Fred, now-divorced, is Homer's best man. While the vows are exchanged Fred and Peggy glance across at one another. At the conclusion everyone gathers around the newlyweds. Still gazing over at Peggy, Fred walks across the room, takes her in his arms and kisses her. He asks if she knows how things will be for them, that it will be a hard at first, that it could take years before they can get a life established. All the while Peggy smiles fondly at Fred, and then kisses him back."}