{"mid": "TheBat", "IMDB_id": "tt0052602", "title": "The Bat", "plot": "Murder-mystery writer Cornelia van Gorder [Agnes Moorehead] has leased a large country\nhouse called \"The Oaks\". After being in the house for only a few days,\nCornelia's longtime maid, Lizzie Allen [Lenita Lane], informs her that the servants are\nupset over rumors they have heard about the murders committed in the house\nlast winter by the archcriminal who goes by the name of The Bat. They fear\nhe is back, and they're also concerned about rabid bats that have\nsupposedly been released by The Bat. That's hysterical nonsense, Cornelia\nsays as she heads into Zenith to conduct some business at the Zenith City\nbank. She has another surprise when vice-president and head cashier of the\nbank, Victor Bailey [Mike Steele], mentions that the bank president and owner of The\nOaks, John Fleming [Harvey Stephens], once said that he would never rent the house. Again,\nCornelia is not concerned since she rented the house from his nephew, Mark\nFleming [John Bryant].As Cornelia chats with Victor's wife Dale [Elaine Edwards] and Lieutenant \"Andy\"\nAnderson [Gavin Gordon],a detective with the Zenith City Police Department and a member\nof the board of directors of the Zenith Bank, Victor is informed that the\nbank has been looted of over $1,000,000 in bonds and negotiable\nsecurities. Since the only two people with access to the vault are Victor\nhimself and bank president John Fleming, who is currently away on a\nhunting trip in the Northwoods, Victor is arrested and attempts are made\nto contact Fleming.Meanwhile, at his lodge in the Northwoods, John Fleming informs his\nhunting partner and physician, Doctor Malcolm Wells [Vincent Price], that he has just\nembezzled over $1,000,000 from the bank and he needs help in covering it\nup. His plan is to murder their hunting guide and disfigure the body\nenough that Wells can pass it off as Fleming. After \"Fleming\" is declared\ndead and buried, the two of them will split the million. The money is\ncurrently hidden in the Fleming family crypt in Zenith, he explains. Wells\nrecalls a time, however, when Fleming was very sick and, in fever, talked\nabout hiding the money in a hidden room in The Oaks. When Fleming\nannounces that, if Wells doesn't go for the deal, he'll kill Wells and\ncall it a \"hunting accident,\" Wells turns his shotgun on Fleming.I ain't afraid of ghosts, Lizzie tells Cornelia when they read in the\npaper of John Fleming's death. Although the rest of the staff, except for\nWarner [John Sutton], the chauffeur, have quit their jobs, Lizzie intends to stay with\n\"Miss Corny\" under any circumstances. Because there's a storm brewing,\nLizzie and Cornelia check to be sure all the doors and windows are shut.\nLizzie suddenly sees a black-clawed hand reach through the front door,\njust about to grab Cornelia's throat. Lizzie's screams scare him off;\nCornelia calls the police. They send someone over to check the grounds,\nbut no one is found.Cornelia and Lizzie go upstairs and lock themselves in a bedroom.\nMeanwhile, The Bat has cut a hole in the front-door window, unlocked the\ndoor, and entered the house. As Cornelia and Lizzie try to sleep, he opens\nthe transom into their room and releases a bat that flits around for a\nmoment, lands on Lizzie's arm, and bites her. Concerned that the bat may\nbe rabid, Cornelia phones Dr Wells. He's in his laboratory conducting an\nexperiment (on a bat!), but he comes over to look at Lizzie. He dresses\nher arm and gives her a sleeping pill. After examining the bat, he\nproclaims that it doesn't look sick but that he won't know for sure until\nhe examines its brain under a microscope. Meanwhile, Lt Andy has taken\nadvantage of Dr Wells' absence and let himself into the lab where he\nsnoops around and notices the experimental bat and a figure of a large bat\nin one of the windows. Andy then drives over to The Oaks, arriving just as\nWells is leaving. Andy points out the hole in the glass where The Bat\ngained entrance and assures Cornelia that an officer will keep watch on\nthe house for the rest of the night.Several days/weeks? have gone by, and Victor Bailey's trial is coming\nup. His secretary, Judy Hollister [Darla Hood], apparently has some information that\nwill help to acquit him, so people are beginning to suspect that John\nFleming robbed his own bank. Lt Anderson, concerned that his holdings at\nthe bank will be wiped out if the money isn't found, pays a visit to Mark\nFleming. Mark reveals that he hasn't received a dime of his inheritance\nfrom his uncle because the money is nowhere to be found. Meanwhile,\nCornelia has managed to retain John Fleming's old maid, Jane Patterson [Riza Royce].\nWhen Dr Wells, Dale Bailey, and Judy Hollister drop by for tea, they all\ndiscuss the possibility that it was John Fleming who actually robbed the\nbank. Cornelia suggests that Fleming may have hidden the money in The\nOaks, and Dale phones Mark to see whether there are any floorplans of the\nhouse. Mark isn't sure why she would want the floorplan, so Lt Andy\nsuggests that maybe Uncle John DID steal the money and hid it in the\nhouse. Mark agrees to come over that evening and help look for the plans.Come over Mark does, but he lets himself into the house with his own\nkey while Cornelia, Dale, and Judy are eating dinner. He moves aside a\ngrandfather clock and opens a panel to a secret closet. While he looks\nover the floorplans, The Bat enters the house and sneaks up behind,\nclobbers Mark, and makes off with the floorplans. After dinner, Cornelia\nis amazed to hear the grandfather clock striking the hour, when it hasn't\ndone so in years. They notice that the clock has been moved, then Dale\nsees the panel behind it. They open the panel to find Mark Fleming...dead.\nLt Anderson and Dr Wells are notified after the police are called. After\nseeing the claw marks on Mark's throat, Anderson proclaims it the work of\nThe Bat.Later that night, after the police have combed the house for clues\nand Mark's body has been taken to the morgue, Lt Anderson remains to make\nsure all the windows and doors are locked. As he checks the rooms, he\ndoesn't notice that Warner is watching him. After the ladies have gone to\nsleep, Cornelia and Lizzie in one room, Judy and Dale in another, The Bat\ncomes in through the unlocked front door. First, he cuts the phone line.\nHe then goes up to the third floor and into a storage room where he starts\ntapping on the walls. The noise wakes up Judy and Dale. Thinking she may\nbe able to find the hidden money and clear her husband, Dale sneaks up to\nthe third floor. The Bat locks her in the room and runs downstairs. On the\nway down, he runs into Judy and kills her, then he flees out the front\ndoor, after first being struck in the neck by a poker thrown by Cornelia.Shortly thereafter, Lt Andy comes in the front door. He explains that\nhe was chasing someone on the grounds and asks as to the whereabouts of\nWarner the chauffeur. Warner suddenly comes in the front door and explains\nthat he was following Anderson when he was suddenly hit on the head. It's\nthen that Anderson remembers seeing a wanted poster with Warner's picture\non it, but Warner says that he was tried and acquitted. He vehemently\ndenies being The Bat. Suddenly, Dr Wells walks in the front door. He had\nan accident about a mile down the road, he says, and walked back to the\nhouse to use the phone. Andy notices blood on Wells' neck. Hmmm, could Dr\nWells be The Bat?Several nights later, after the house had been searched from top to\nbottom without finding any money or a hidden room, Cornelia decides to\nconduct an investigation of her own. When the detective on duty falls\nasleep in his chair, Cornelia goes up to the third floor to look around in\nthe storage room where The Bat was tapping on the walls. Measuring the\ndistance between the storage room and the room next to it, Cornelia\nnotices a loss of about five feet between the two rooms. She pounds on the\nwalls, then on the panels of a fireplace. Suddenly, one of the panels\nopens up, revealing a switch that allows the fireplace to swing open.\nCornelia has found the hidden room. It is empty, except for a safe in the\nwall. As she kneels before the safe, the fireplace swings closed, trapping\nher in the room.Meanwhile, The Bat has gone to Dr Wells' lab where he hangs a note on\nthe wall. It says: \"Here lies The Bat -- threatened with exposure he\ndestroyed himself.\" As The Bat turns around, Wells walks into the room with\nhis gun drawn. The doctor taunts The Bat with the fact that he knows where\nthe money is hidden and that he's going to shoot The Bat and put his own\nsign on his own chest. Just as Wells cocks the gun, The Bat leaps at him.\nThey struggle, the gun goes off, and it is Wells who is shot.Cornelia's pounding on the walls wakes Lizzie, who notices that\nCornelia's bed is empty. She goes down to the parlor and tries to wake up\nDetective Davenport [Robert Williams], only to find him drugged into sleep. Lizzie wakes\nthe maid who goes to get Warner, only to find him missing. The detective\ncalls headquarters to alert Lt Anderson only to find that he's been sent\nto investigate the death of Dr Wells. The three of them -- Lizzie, Jane,\nand Davenport -- look outside for Cornelia, but she doesn't answer their\ncalls. Suddenly, Lizzie notices a light on the third floor and redirects\neveryone up there. The air in the hidden room is rapidly depleting.\nCornelia can barely manage call out. She tells them to hit the panels over\nthe fireplace and then passes out. Lizzie gives each panel a pound, finds\nthe switch, and opens the fireplace just in the nick of time.Outside the house, The Bat is slinking around in the bushes. He has\nstarted the garage on fire, but Cornelia is wise to him. That fire was set\nto get us out of the house, she tells everyone. Instead of leaving, they\nturn out the lights and wait. A few minutes later, The Bat appears. When\nThe Bat enters the hidden room, Davenport fires a shot. But The Bat is\nquicker and shoots Davenport. He then turns to the ladies who are hiding\nbehind some boxes. Just as he's about to open fire on the ladies, he is\nshot from behind. Warner enters the room, his gun smoking. They remove the\nhood from over the Bat's face to find ... Lt Anderson. [Original synopsis by bj_kuehl]"}