{"mid": "TheBoogeyMan", "IMDB_id": "tt0080464", "title": "The Boogey Man", "plot": "The film opens with Willy and Lacey as children watching their mother and her boyfriend preparing to make out. When the mother notices them, she has her boyfriend tie Willy to his headboard before sending Lacey to her room. She frees Willy from his bed and Willy enters their room and repeatedly stabs his mother's boyfriend with a chef knife in front of a large mirror.\nTwenty years later, Lacey now an adult, is married with a young son and lives with her aunt and uncle on a farm. Willy who also lives with them, but has not spoken a word since the night he killed his mother's boyfriend and sometimes, Willy takes various knives from the kitchen and hides them in a drawer. One night over dinner, Lacey finds a letter in the mail from her mother, who claims to be on her deathbed and wishes to see them one last time that night, but Willy burns the letter.\nLacey suffers from nightmares, and has a particularly frightening dream where she is dragged, tied to a bed and almost stabbed by an unseen entity. Her husband, Jake takes her to a psychiatrist to help her confront her fears, and decides to go visit the house she grew up in. They arrive not knowing who is actually living there and meets two teenage girls and their younger brother. Their parents, the homeowners, have apparently just placed the home for sale and then gone out of town. The daughter thinks Lacey and Jake have been sent by the real estate company to view the house. Jake and Lacey pretend they want to buy the house so they can look around. At the house, however Lacey sees a reflection of her mother's deceased boyfriend coming towards her in a mirror inside the bedroom where he died and smashes the mirror in a panic with a chair. Her husband takes the broken mirror with him in an attempt to repair it, but a piece is left behind which later glows red as the teenage girls and their brother are all killed by an unseen force. However, the vengeful spirit of the deceased lover has been released from the mirror.\nWilly who's also having problems with mirrors. Seeing his reflection in one caused him to strangle a girl and so he paints all the mirrors in the house black. Later, pieces of a broken mirror in a bag at his feet cause a pitchfork to levitate and nearly impaled him, but misses the attack as he gets saved from it.\nAnother shard from the broken mirror becomes stuck to Lacey's son's shoe and is left on the ground where the light refracts across a lake where a group of teenagers are partying at the lake by an abandoned house. A couple who are soon impaled by a screwdriver while kissing in their car as another couple drove off and leaves them. Soon after, Lacey flees to get in the house, only to see that her shirt supernaturally starts to tear apart which also leads to her aunt and uncle who are also killed when they're found dead in the barn.\nLater, Lacey's husband brings in the family priest to investigate the mirror, only to see that when the priest's hand touches the mirror, it suddenly turns red. A piece of the mirror floats across the room and becomes lodged over Lacey's eye, letting the ghost possess her body. Controlling Lacey's body, the ghost kills her husband and attacks the priest. Before he dies, the priest removes shard from Lacey's eye, releasing her from the ghost's control, and throws it into the kitchen sink, where it bursts into flames as it touches the water. The remainder of the mirror is then thrown into a well, where the same thing happens, as an explosion releases and destroying the mirror once and for all.\nThe film ends with Lacey, her brother and Kevin visiting the graveyard. After they leave, the final shard of the mirror on the ground, which had gotten stuck to her son's shoe, glowed red."}