{"mid": "TheBlueGardenia", "IMDB_id": "tt0045564", "title": "The Blue Gardenia", "plot": "In Los Angeles, California, Norah Larkin (Anne Baxter) is a single woman who works as a switchboard operator along with her roommates, Crystal Carpenter (Ann Sothern) and Sally Ellis (Jeff Donnell). On her birthday, she decides to celebrate by dining alone at home, with the picture of her fiancé, a soldier serving in the Korean War. At the candlelight dinner table, she opens the latest letter from him and learns to her shock that he instead plans to marry a nurse he met in Tokyo.\nDevastated, Norah accepts a date over the telephone with womanizing calendar girl artist Harry Prebble (Raymond Burr). When she arrives at the Blue Gardenia restaurant and nightclub, Harry is surprised to see Norah, since he was expecting Crystal. However, he has dinner with her, and encourages her to drink six strong Polynesian Pearl Diver cocktails. Harry then takes her to his apartment, where he shows her his pictures and plays the record \"The Blue Gardenia\", sung by Nat King Cole, whom they had just seen perform the same song at the restaurant. Norah passes out on Harry's couch, and he makes a sexual advance. She awakens and resists, and apparently strikes him with a fire poker, causing a shattered mirror. Norah flees the scene, leaving behind her black suede pumps, and returns home.\nThe next morning, Norah is awakened by Crystal, and has suffered a blackout as to the events of the previous night. Meanwhile, at the crime scene, police question a maid (Almira Sessions) about what she found before she discovered Harry's body. She admits to cleaning the poker, which would have removed any fingerprints, and placing the shoes in the closet, so valuable evidence has been compromised.\nAt Norah's workplace, the police arrive to question women who had posed for Harry. When Norah asks her colleague about the questioning, she is startled, and goes to read the Los Angeles Chronicle newspaper's account of the slaying. Norah has a vague flashback of the wielding of a fire poker and the shattering of a mirror.\nNewspaper columnist Casey Mayo (Richard Conte) dubs the presumed killer the \"Blue Gardenia murderess.\" He learns from the Blue Gardenia waiter that the woman was a blonde, and from a blind female flower seller (Celia Lovsky) that the woman possessed a \"quiet voice\". That same night, at her apartment, Sally reads the newspaper report that the suspect wore a black dress at the time of the murder. Frightened, Norah wraps her own black dress in a newspaper and burns it in an outdoor incinerator. A patrolman arrives and demands to know why she is burning materials at an illegal hour, but he lets her off with a warning after she apologizes.\nWanting to catch the killer before the police do, Casey writes a column, titled \"Letter to an Unknown Murderess\", calling for her to turn herself in. Casey receives many bogus phone calls from local women, but when Norah calls, he realizes she is genuine. After one botched attempt, he meets her in his office. She convinces him that she is actually speaking for a friend, not herself, and Casey tells Norah that he is willing to pay for top legal representation if her friend agrees to surrender. The two later go to a diner, where Norah tells her supposed friend's account of the murder, but still insists her friend does not remember the actual killing. Casey asks to meet her friend at the diner the next day. Norah agrees and returns home, where she confesses to roommate Crystal, who is sympathetic.\nThe next day at the diner, Crystal meets Casey but quickly takes him to Norah's booth, where Norah finally admits that she herself is the woman he has been looking for. He feels shocked, because he had begun to fall in love with her. He also feels guilty, admitting to Norah that he was only pretending sympathy for the alleged killer when he thought it was someone other than her. Shortly afterward, the police arrive and arrest Norah. Bitter and confused, she mistakenly believes that Casey is the one who turned her in. (It was actually a diner employee.)\nAt an airport, Casey, with his colleague Al (Richard Erdman), notices that the piped-in music is identical to the music the maid found playing on Harry's phonograph. Finally grasping the significance of the fact that the records on the machine had been changed, Casey realizes it's possible that Norah was not the killer. Following up this hunch, Casey and Police Captain Sam Haynes (George Reeves) question a local music shop clerk about the record. Harry's ex-girlfriend Rose Miller (Ruth Storey), who sold Harry the record, is working at the shop. Realizing the police are closing in, Rose attempts suicide.\nFrom a hospital bed, Rose confesses that while Norah was passed out at Harry's apartment, she herself arrived, telling him she was pregnant with his child and demanding that he marry her. He refused, she says, and started playing the record that had brought them together. (That record being Toscananni Tristan and Isolde RCA Victor 78 rpm) Then, Rose recalls, she noticed Norah's handkerchief by the record player, and out of jealousy killed Harry with the poker. Norah, everyone finally understands, was simply an intoxicated and confused witness.\nAfter Rose's confession, Norah is freed. She confides to friends that she has forgiven Casey and wants him as the new man in her life. Casey wants her as well, and hands over his \"little black book\" to his buddy Al."}