{"mid": "TheCompanyOfWolves", "IMDB_id": "tt0087075", "title": "The Company of Wolves", "plot": "In the present day, a young girl named Rosaleen (Sarah Patterson) dreams that she lives in a fairytale forest with her parents (Tusse Silberg and David Warner) and sister (Georgia Slowe), but one day her sister is killed by wolves. While her parents are mourning, Rosaleen goes to stay the night with her grandmother (Angela Lansbury), who knits a bright red shawl for her granddaughter to wear. The superstitious old woman gives Rosaleen an ominous warning, to beware men whose eyebrows meet. Rosaleen returns to her village, but finds that she must deal with the advances of an amorous boy (Shane Johnstone). Rosaleen and the boy take a walk through the forest, but the boy discovers that the village's cattle have come under attack from a wolf. The villagers set out to hunt the wolf, but once caught and killed, the wolf's corpse transforms into that of a human being.\nRosaleen later takes a basket of goods through the woods to her grandmother's cottage, but on her way she encounters an attractive huntsman (Micha Bergese), whose eyebrows meet. He challenges her, saying that he can find his way to her grandmother's house before she can, and the pair set off. The hunter arrives at Rosaleen's grandmother's house first, where he reveals his bestial nature and kills her. Rosaleen arrives later and discovers the carnage, but her need to protect herself is complicated by her desire for the hunter. In the ensuing exchange, Rosaleen accidentally injures the huntsman with his own rifle. Upon this blow, the hunter contorts in pain and transforms into his wolf shape. Rosaleen takes pity on the wounded beast, noting that his pack could leave him behind. She sits down, and begins petting the wolf kindly and tenderly while telling him a story.\nUltimately the villagers arrive at the house some time later, looking for a werewolf within. Instead, they discover that Rosaleen herself has become a werewolf. Together, she and the huntsman escape to the forest, joined by a growing pack.\nBack in the present day, Rosaleen awakes with a scream, and discovers wolves outside her house, followed by their breaking through the window of her bedroom.\nPerrault's Le Petit Chaperon Rouge is then heard being read, with the moral warning girls to beware of charming strangers."}