{"mid": "TheCrucible", "IMDB_id": "tt0061534", "title": "The Crucible", "plot": "=== Act One ===\nBetty Parris, the ten-year-old daughter of Salem preacher Reverend Samuel Parris, lies motionless. The previous evening, Reverend Parris discovered Betty, some other girls, and his Barbadian slave, Tituba, engaged in some sort of ritual in the woods. The village is rife with rumors of witchcraft and a crowd gathers outside Rev. Parris' house. The Reverend questions the girls' apparent ringleader, his niece Abigail Williams, who denies they were engaged in witchcraft. Parris decides to invite Reverend John Hale, an expert in witchcraft and demonology, to investigate and leaves to address the crowd.\nThe other girls involved in the incident join Abigail and a briefly roused Betty. Abigail coerces and threatens the others to \"stick to their story\" of merely dancing in the woods. The other girls are frightened of the truth being revealed (that in actuality, they tried to conjure a curse) and being labelled witches, so they go along with Abigail. Betty then faints back into unconsciousness.\nJohn Proctor, a local farmer and husband of Elizabeth, enters. He sends the other girls out (including Mary Warren, his family's maid) and confronts Abigail, who tells him that she and the girls were not performing witchcraft. It is revealed that Abigail once worked as a servant for the Proctors, and that she and John had an affair, for which she was fired. Abigail still harbors feelings for John and believes he does as well, but John says he does not. Abigail angrily mocks John for denying his true feelings for her. As they argue, Betty bolts upright and begins screaming.\nRev. Parris runs back into the bedroom and various villagers arrive: the wealthy and influential Thomas and his wife, Ann Putnam, respected local woman Rebecca Nurse, and the Putnam's neighbor, farmer Giles Corey. Tensions between them soon emerge. Mrs. Putnam is a bereaved parent seven times over; she blames witchcraft for her losses and Betty's ailment. Rebecca is rational and suggests a doctor be called instead. Mr. Putnam and Corey have been feuding over land ownership. Parris is unhappy with his salary and living conditions as minister, and accuses Proctor of heading a conspiracy to oust him from the church. Abigail, standing quietly in a corner, witnesses all of this.\nReverend Hale arrives and begins his investigation. Before leaving, Giles fatefully remarks that he has noticed his wife reading unknown books and asks Hale to look into it. Hale questions Rev. Parris, Abigail and Tituba closely over the girls' activities in the woods. As the facts emerge, Abigail claims Tituba forced her to drink blood. Tituba counters that Abigail begged her to conjure a deadly curse. Parris threatens to whip Tituba to death if she doesn't confess to witchcraft. Tituba breaks down and falsely claims that the devil is bewitching her and others in town. With prompting from Hale and Putnam, Tituba accuses Sarah Osborne and Sarah Good of witchcraft. Mrs. Putnam identifies Osborne as her former midwife and asserts that she must have killed her children. Abigail leaps up, begins contorting wildly, and names Osborne and Good, as well as Bridget Bishop as having been \"dancing with the devil\". Betty suddenly rises and begins mimicking Abigail’s movements and words, and accuses George Jacobs. Hale orders the arrest of the named people and sends for judges to try them.\n=== Act Two ===\nAct Two is set in the Proctor's home. John and Elizabeth are incredulous that nearly forty people have been arrested for witchcraft based on the pronouncements of Abigail and the other girls. John knows their apparent possession and accusations of witchcraft are untrue, as Abigail told him when they were alone together in the first act. Elizabeth is disconcerted to learn her husband was alone with Abigail. She believes John still lusts after Abigail and tells him that as long as he does, he will never redeem himself.\nMary Warren enters and gives Elizabeth a 'poppet' (doll-like puppet) that she made in court that day while sitting as a witness. Angered that Mary is neglecting her duties, John threatens to beat her. Mary retorts that she saved Elizabeth's life that day, as Elizabeth was accused of witchcraft and was to be arrested until Mary spoke in her defense. Mary refuses to identify Elizabeth's accuser, but Elizabeth surmises accurately that it must have been Abigail. She implores John to go to court and tell the judges that Abigail and the rest of the girls are pretending. John is reluctant, fearing that doing so will require him to publicly reveal his past adultery.\nReverend Hale arrives, stating that he is interviewing all the people named in the proceedings, including Elizabeth. He mentions that Rebecca Nurse was also named, but admits that she is too pious to be a witch. Hale is skeptical about the Proctors' devotion to Christianity, noting that they do not attend church regularly and that their second child has not yet been baptized; John replies that this is because he has no respect for Parris. Challenged to recite the Ten Commandments, John fatefully forgets \"thou shalt not commit adultery\". When Hale questions her, Elizabeth is angered that he doesn't question Abigail first. Unsure of how to proceed, Hale prepares to take his leave. At Elizabeth's urging, John tells Hale he knows that the girl's afflictions are fake. When Hale responds that many of the accused have confessed, John points out that they were bound to be hanged if they didn’t: Hale reluctantly acknowledges this point.\nSuddenly, Giles Corey and Francis Nurse enter the house and inform John and Hale that both of their wives have been arrested on charges of witchcraft; Martha Corey for reading suspicious books and Rebecca Nurse on charges of sacrificing children. A posse led by clerk Ezekiel Cheever and town marshal George Herrick arrive soon afterwards and present a warrant for Elizabeth's arrest, much to Hale's surprise. Cheever picks up the poppet on Elizabeth's table and finds a needle inside. He informs John that Abigail had a pain-induced fit earlier that evening and a needle was found stuck into her stomach; Abigail claimed that Elizabeth stabbed her with the needle through witchcraft, using a poppet as a conduit. John brings Mary into the room to tell the truth; Mary asserts that she made the doll and stuck the needle into it, and that Abigail saw her do so. Cheever is unconvinced and prepares to arrest Elizabeth.\nJohn becomes greatly angered, tearing the arrest warrant to shreds and threatening Herrick and Cheever with a musket until Elizabeth calms him down and surrenders herself. He calls Hale a coward and asks him why the accusers' every utterance goes unchallenged. Hale is conflicted, but suggests that perhaps this misfortune has befallen Salem because of a great, secret crime that must be brought to light. Taking this to heart, John orders Mary to go to court with him and expose the other girls' lies, but she refuses. Aware of John's affair, she warns him that Abigail is willing to expose it if necessary. John is shocked but determines the truth must prevail, whatever the personal cost.\n=== Act Three ===\nThe third act takes place thirty-seven days later in the General Court of Salem, during the trial of Martha Corey. Francis and Giles desperately interrupt the proceedings, demanding to be heard. The court is recessed and the men thrown out of the main room, reconvening in an adjacent room. John Proctor arrives with Mary Warren and they inform Deputy Governor Danforth and Judge Hathorne about the girls' lies. Danforth then informs an unaware John that Elizabeth is pregnant, and promises to spare her from execution until the child is born, hoping to persuade John to withdraw his case. John refuses to back down and submits a deposition signed by ninety-one locals attesting to the good character of Elizabeth, Rebecca Nurse and Martha Corey. Herrick also attests to John's truthfulness as well.\nThe deposition is dismissed by Parris and Hathorne as illegal. Rev. Hale criticizes the decision and demands to know why the accused are forbidden to defend themselves. Danforth replies that given the \"invisible nature\" of witchcraft, the word of the accused and their advocates cannot be trusted. He then orders that all ninety-one persons named in the deposition be arrested for questioning. Giles Corey submits his own deposition, accusing Thomas Putnam of forcing his daughter to accuse George Jacobs in order to buy up his land (as convicted witches have to forfeit all of their property.) When asked to reveal the source of his information, Giles refuses, fearing that he or she will also be arrested. When Danforth threatens him with arrest for contempt, Giles argues that he cannot be arrested for \"contempt of a hearing.\" Danforth then declares the court in session and Giles is arrested.\nJohn submits Mary's deposition, which declares that she was coerced to accuse people by Abigail. Abigail denies Mary's assertions that they are pretending, and stands by her story about the poppet. When challenged by Parris and Hathorne to 'pretend to be possessed', Mary is too afraid to comply. John attacks Abigail's character, revealing that she and the other girls were caught dancing naked in the woods by Rev. Parris on the night of Betty Parris' alleged 'bewitchment'. When Danforth begins to questions Abigail, she claims that Mary has begun to bewitch her with a cold wind and John loses his temper, calling Abigail a whore. He confesses their affair, says Abigail was fired from his household over it and that Abigail is trying to murder Elizabeth so that she may \"dance with me on my wife's grave.\"\nDanforth brings Elizabeth in to confirm this story, beforehand forbidding anyone to tell her about John's testimony. Unaware of John's public confession, Elizabeth fears that Abigail has revealed the affair in order to discredit John and lies, saying that there was no affair, and that she fired Abigail out of wild suspicion. Hale begs Danforth to reconsider his judgement, now agreeing Abigail is \"false\", but to no avail; Danforth throws out this testimony based solely upon John's earlier assertion that Elizabeth would never tell a lie.\nConfusion and hysteria begin to overtake the room. Abigail and the girls run about screaming, claiming Mary's spirit is attacking them in the form of a yellow bird, which nobody else is able to see. When Danforth tells the increasingly distraught Mary that he will sentence her to hang, she joins with the other girls and recants all her allegations against them, claiming John Proctor forced her to turn her against the others and that he harbors the devil. John, in despair and having given up all hope, declares that \"God is dead\", and is arrested. Furious, Reverend Hale denounces the proceedings and quits the court.\n=== Act Four ===\nAct Four takes place three months later in the town jail, early in the morning. Tituba, sharing a cell with Sarah Good, has gone insane from all of the hysteria, hearing voices and now actually claiming to talk to Satan. Marshal Herrick, depressed at having arrested so many of his neighbors, has turned to alcoholism. Many villagers have been charged with witchcraft; most have confessed and been given lengthy prison terms and their property seized by the government; twelve have been hanged; seven more are to be hanged at sunrise for refusing to confess, including John Proctor, Rebecca Nurse and Martha Corey. Giles Corey was tortured to death by pressing as the court tried in vain to extract a plea; by holding out, Giles ensured that his sons would not be disinherited. The village has become dysfunctional with so many people in prison or dead, and with the arrival of news of rebellion against the courts in nearby Andover, whispers abound of an uprising in Salem.\nDanforth and Hathorne have returned to Salem to meet with Parris, and are surprised to learn that Hale has returned and is meeting with the condemned. Parris reports that Abigail and Mercy Lewis stole his life's savings from his house and have disappeared, and that he has received death threats. He begs Danforth to postpone the executions in order to secure confessions, hoping to avoid executing some of Salem's most well-regarded citizens. Hale, blaming himself for the hysteria, has returned to counsel the condemned to falsely confess and avoid execution. He presses Danforth to pardon the remaining seven and put the entire affair behind them. Danforth refuses, stating that pardons or postponement would cast doubt on the veracity of previous confessions, not to mention the hangings.\nDanforth and Hale summon Elizabeth and ask her to persuade John to confess. She is bitter towards Hale, both for doubting her earlier and for wanting John to give in and ruin his good name, but agrees to speak with her husband, if only to say goodbye. She and John have a lengthy discussion, during which she commends him for holding out and not confessing. John says he is refusing to confess not out of religious conviction but through contempt for his accusers and the court. The two finally reconcile, with Elizabeth forgiving John and saddened by the thought that he cannot forgive himself and see his own goodness. Knowing in his heart that it is the wrong thing for him to do, John agrees to falsely confess to engaging in witchcraft, deciding that he has no desire or right to be a martyr.\nDanforth, Hathorne, and a relieved Parris ask John to testify to the guilt of the other hold-outs and the executed. John refuses, saying he can only report on his own sins. Danforth is disappointed by this reluctance, but at the urging of Hale and Parris, allows John to sign a written confession, to be displayed on the church door as an example. John is wary, thinking his verbal confession is sufficient. As they press him further John eventually signs, but refuses to hand the paper over, stating he does not want his family and especially his three sons to be stigmatized by the public confession. The men argue until Proctor renounces his confession entirely, ripping up the signed document. Danforth calls for the sheriff and John is led away, to be hanged. Hale pleads with Elizabeth to talk John around but she refuses, stating John has \"found his goodness\"."}