{"mid": "TheCurseOfTheWerewolf", "IMDB_id": "tt0054777", "title": "The Curse of the Werewolf", "plot": "The story is set in 18th Century Spain. A beggar is imprisoned by a cruel marquis after making inappropriate remarks at the nobleman's wedding. The beggar is forgotten, and survives another fifteen years. His sole human contact is with the jailer and his beautiful mute daughter (Yvonne Romain). The aging, decrepit Marques makes advances on the jailer's daughter while she is cleaning his room. When she refuses him, the Marques has her thrown into the dungeon with the beggar. The beggar, driven mad by his long confinement, rapes her and then dies.\nThe girl is released the next day and sent to \"entertain\" the Marques Siniestro. She kills the old man and flees. She is found in the forest by the kindly gentleman-scholar Don Alfredo Corledo (Clifford Evans) who lives alone with his housekeeper Teresa (Hira Talfrey). The warm and motherly Teresa soon nurses the girl back to health, but she dies after giving birth to a baby on Christmas Day (a fact that Teresa considers \"unlucky\" since the child was born out of wedlock).\nAlfredo and Teresa raise the boy, whom they name Leon. Leon is cursed by the evil circumstances of his conception and by his Christmas Day birth. An early hunting incident gives him a taste for blood, which he struggles to overcome. Soon, a number of goats are found dead, and a herder's dog is blamed.\nThirteen years later, Leon as a young man (Oliver Reed) leaves home to seek work at the Gomez vineyard. Don Fernando Gomez (Ewen Solon) sets Leon to work in the wine cellar with Jose Amadayo (Martin Matthews) with whom he soon forms a friendship. Leon falls in love with Fernando's daughter, Cristina (Catherine Feller), and becomes despondent at the seeming impossibility of marrying her, and allows Jose take him to a nearby brothel, where he transforms and kills Vera and Jose, then returning to Alfredo's house. Too late, he learns that Cristina's loving presence prevents his transformation, and he is about to run away with her when he is arrested and jailed on suspicion of murder. He begs to be executed before he changes again, but the mayor does not believe him. His wolf nature rising to the surface, he breaks out of his cell, killing an Old Soak and the Gaoler. Shocked and disgusted by his appearance, the local people summon his scholarly stepfather, who has obtained a silver bullet made from a crucifix blessed by an archbishop. Though torn with grief, Alfredo shoots Leon dead and covers his body with a cloak."}