{"mid": "TheCaseOfTheHowlingDog", "IMDB_id": "tt0024958", "title": "The Case of the Howling Dog", "plot": "Severely agitated by the howling of a police dog next door, millionaire Arthur Cartwright comes to Los Angeles lawyer Perry Mason to draw up his will, stating that the howling is a sign that a death has occurred. He wants to leave his money to the apparent wife of Clinton Foley, another millionaire and the dog's owner, explaining that while \"Evelyn Foley\" pretends to be Foley's wife, he is still legally married to someone else. Perry explains how Cartwright should word his odd bequest and after receiving a huge retainer fee, gives him a form to fill out and return. When Perry receives the form the next day, Cartwright has changed the beneficiary to Foley's actual wife. The fee paid by Cartwright obligates Perry to legally and morally represent the real Mrs. Foley to the best of his ability.\nFoley attempts to file a complaint of insanity against Cartwright, claiming he is a homicidal maniac whose bizarre behavior prompted most of Foley's household staff to quit. A sheriff's deputy is assigned to investigate the complaint. He and Perry accompany Foley back to his house, where Perry questions why an addition to his garage is being built for yet another car if his chauffeur has quit. Attractive Lucy Benton, who Foley states is his housekeeper, rushes from the house with her right hand heavily bandaged to tell Foley that she was bitten by the dog while giving it an emetic, thinking it had been poisoned. When they ask to talk to Foley's \"wife\" Evelyn, Lucy tells them that she has just packed her bags and disappeared. A note left behind states that she loves Cartwright and is going away with him. Perry goes next door and finds that Cartwright has also disappeared overnight. A telegram sent from Ventura and signed by Evelyn is sent to Foley asking him to stop his actions.\nPerry's private detectives investigate and learn that Evelyn was actually Cartwright's wife who ran away with Foley when they were friends in Santa Barbara with Foley and his wife Bessie. Lucy was Foley's private secretary then, unbeknownst to Evelyn. One of Perry's men is assigned to watch Foley's house and sees Lucy drive away with an unknown man. A cab arrives with a woman in black. When Foley shows annoyance that she \"found him\", she tells him that she \"wants justice\" and he releases the dog to attack her. Two shots are fired, killing the dog and Foley, followed by the slamming of the garden door, and the woman flees. Perry arrives for a meeting with Foley and discovers the bodies. He immediately tracks down the cab driver at his cab stand, learning that a perfumed handkerchief left in the cab links \"Bessie\" to the murder scene, and then finds the woman, who is the actual wife and his client, in a hotel under an assumed name. He sends his secretary, Della Street, to impersonate Bessie and claim the handkerchief before the cabbie turns it in. Bessie denies killing her husband. Perry warns her that she is going to be arrested for Foley's murder and orders her to say nothing to the police. Later, acting on a hunch when none of the handwriting samples of the three women gathered by his operatives matches the note and the handwritten copy of the telegram, Perry devises a ruse to obtain a page from Lucy's diary of the day after the Cartwrights disappeared.\nDuring the trial, Perry discredits the cab driver's identification of his passenger when he demonstrates that he misidentified Della as Bessie. During his cross-examination of Lucy, Perry has the trial shifted to the scene of the crime, shows that the dog was devoted to all three women, and proves that Lucy was Foley's lover and is ambidextrous, writing the note, the telegram, and the diary page with her left hand. Just then, workers excavating the foundation of the garage addition discover the bodies of Cartwright and Evelyn, murdered by Foley. Bessie is acquitted after Perry in closing arguments states that because the dog loved her, he would never have attacked Bessie and been killed, destroying the prosecution's only other link of Bessie to the crime. After the trial, Perry presents Bessie with a dog that looks just like the dead animal, and the dog delightedly greets Bessie. Perry states that when the howling suddenly stopped, he searched kennels in the area and found one where a man matching Foley's description exchanged the dog for a lookalike. He gives Bessie the dog and orders her not to tell anyone what really happened. Perry later tells Della that he is sure that whatever Bessie did was in self-defense."}