{"mid": "TheChangeling", "IMDB_id": "tt0080516", "title": "The Changeling", "plot": "John Russell (George C. Scott), a composer living in New York, New York, moves cross-country to Washington state following the deaths of his wife and daughter in a traffic accident while on a winter vacation in upstate New York. In suburban Seattle, John rents a large, old and eerie Victorian-era mansion and begins piecing his life back together.\nHowever, John soon discovers that he has unexpected and unwelcome company in his new home. The presence makes its existence felt by various phenomena such as shattering windows, abruptly opening and shutting doors, and manifesting itself dramatically during a seance. John investigates the house and its previous tenants and finds that the mystery is linked to a powerful local family, the heir of which is a wealthy United States senator, Joseph Carmichael.\nJohn subsequently discovers that the real Joseph Carmichael (who was born in 1900) was murdered in 1906 by his father, Richard. Joseph was a crippled, sickly child, and in the event of his death before his 21st birthday, the family fortune (which in 1905, he inherited from his late maternal grandfather) would pass to charity. Desperate to keep control of the fortune, Joseph's father drowned young Joseph in the bathtub, secretly replaced him with a healthy orphan, and took the orphan to Europe in the guise of seeking a treatment or cure. He returned several years later with the impostor, now grown and \"cured\" of his illness, and continued as if nothing had happened.\nNow, the ghost of the real Joseph haunts the house, making great efforts to persuade John to investigate his murder, and give him some form of justice. John's investigation leads him to a property that was once owned by the Carmichael family, and after convincing Mrs. Gray (the owner of the property and whose daughter has seen Joseph's ghost), John discovers the skeletal remains of Joseph in a well underneath the house, as well as his birth medal.\nAfter taking the medal without handing it over to the police, John attempts to speak to Senator Carmichael as he is about to depart by plane but is restrained by police. It is then revealed that the Senator has an identical medal to the one John found. The Senator then sends a detective, Captain DeWitt, to John's home in an attempt to retrieve the medal. John refuses, and when DeWitt leaves to obtain a search warrant, his vehicle \"mysteriously\" crashes, killing him.\nAfter hearing of DeWitt's death, the Senator finally agrees to listen to John's story and meets with him. John reveals the entire story to the Senator, that his father murdered his natural son and replaced him with a changeling, which is the Senator. The Senator refuses to believe the story and angrily berates John for accusing his father (whom he claims was a \"loving man\") of murder. John then leaves the real Joseph's medal, files and the only copy of the seance recording and apologizes. The Senator threatens John that there will be consequences if he has told anyone else of his story.\nMeanwhile, John's realtor and friend, Claire, goes to the house alone in an attempt to find John and is chased by Joseph's wheelchair until she falls down the stairs. Meanwhile, the house begins to shake and rumble. John arrives, and escorts Claire outside, and then goes back inside to try and stop the ghost of Joseph. A strong wind causes John to fall from the second story, but he survives. Joseph then lights the house on fire.\nMeanwhile, back at the Senator's home, he is observing the two birth medallions, and throws his duplicate medal away, placing Joseph's medal on a portrait of his father. Suddenly, the picture and the desk start shaking violently and an illusion of the Senator is transported to the house and begins to climb the stairs which then crumble. John sees the Senator's illusion walking up the main staircase, and narrowly escapes being crushed by a chandelier. Meanwhile, the Senator's illusion then climbs the stairs to Joseph's attic room where he witnesses how his father murdered the real Joseph by drowning him. Meanwhile, back at the mansion, the Senator himself suffers a heart attack and dies as Joseph's attic room explodes. John and Claire arrive and see the Senator's body being hoisted away. The ambulance then passes the Carmichael mansion, which is now completely engulfed in flames.\nThe next morning, Joseph's burnt wheelchair sits upright amid the ruins of the mansion. His music box opens and begins playing a lullaby."}