{"mid": "TheComedyOfTerrors", "IMDB_id": "tt0056943", "title": "The Comedy of Terrors", "plot": "Set in a late 19th century in a New England town, the film tells of unscrupulous undertaker Waldo Trumbull (Price) and his assistant, Felix Gillie (Lorre), who make a habit of re-using the coffins of the people they are supposed to bury. Also a part of the household are Trumball's old (and senile) business partner Mr. Hinchley (Karloff), who originally started the business, and the beautiful Amaryllis (Joyce Jameson), Trumbull's neglected wife and Hinchley's daughter, who has dreams (or rather delusions) of becoming a great opera singer and with whom Gillie is passionately in love.\nWhen customers (and therefore money) begin to become scarce and money-grubbing landlord Mr. Black (Rathbone) begins demanding his unpaid rent, Trumbull and the unwilling Gillie make a nighttime visit to the home of Mr. Phipps, an elderly gentleman with a very young and attractive wife. Trumbull smothers Phipps and in the morning makes a fortuitous return so that the Hinchley and Trumbull funeral parlor will get the job of burying Mr. Phipps. However, on the day of the funeral, Trumbull discovers to his horror that Mrs. Phipps has decamped with all of the money and household furnishings ... and, incidentally, without paying Trumbull's fee.\nReceiving another demand for immediate payment of rent, Trumbull and Gillie decide to murder Mr. Black, who has bouts of deathlike sleep, something that Trumbull and Gillie are unaware of.\nAfter discovering Gillie (who had climbed into the house through an upstairs window and escaped the same way), Black seemingly dies of a heart attack but revives in the funeral parlor's cellar. After a prolonged chase and struggle to keep Black inside a coffin, Trumbull knocks Black out with a mallet to the head and places the supposedly deceased Black in his family crypt, returning home to celebrate his new-found wealth. However, Black awakes again, escapes from the coffin and crypt and returns to the funeral parlor, quoting random lines from Shakespeare's Macbeth (from which he was reciting from a script at the time of his first cataleptic attack). Humorous events follow as Black chases Trumbull and Gillie around the house with an ax before (finally) being shot and (presumably) killed by Trumbull after a lengthy monologue.\nMore complications arise when Amaryllis believes Gillie to be dead (he's only unconscious) and believing Trumbull to have killed both him and Black threatens to go to the police, whereupon Trumbull strangles her. Gillie comes to and seeing Amaryllis' body goes after Trumbull in revenge. The two men engage in a comical fight (Gillie with a sword and Trumbull with a poker) until Trumbull hits Gillie on the head with the poker, knocking him out, and Trumbull collapses in a depressed heap on the floor.\nGillie and Amaryllis come to at the same time and elope together. Hinchley appears and gives Trumbull some \"medicine\" (actually poison that Trumbull had been attempting to administer to Hinchley earlier in the film). The \"medicine\" works as intended and Trumbull drops dead as Hinchley makes his way back to bed, oblivious to the fact he has just committed murder.\nAt the end of the film, Black exhibits an allergic reaction to Cleopatra the cat, indicating that he is still alive."}