{"mid": "TheCowboys", "IMDB_id": "tt0068421", "title": "The Cowboys", "plot": "When his ranch hands abandon him to join a gold rush, aging rancher Wil Andersen (John Wayne) is forced to find replacement drovers for his upcoming 400-mile (640 km) long cattle drive. He rides into deserted Bozeman, Montana. There, Anse Peterson (Slim Pickens) suggests using local schoolboys. Andersen visits the school but departs unconvinced. The next morning, a group of the boys show up at Andersen's ranch to volunteer for the drive. Andersen tests the boys' ability to stay on a bucking horse. As the boys successfully take turns, Cimarron (A Martinez), another young man slightly older than the others, rides up. After successfully subduing and riding the test horse, Cimarron gets into a fight with Slim (Robert Carradine), the oldest of the boys. Andersen, though impressed by Cimarron's abilities, has misgivings because of his angry nature and sends him away. Andersen reluctantly decides to hire the boys.\nWhile Andersen and the boys prepare for the cattle drive, a group of mysterious men led by \"Long Hair\" Asa Watts (Bruce Dern) show up asking for work. Andersen catches Watts in a lie about his past, and refuses to hire them. Jebediah \"Jeb\" Nightlinger (Roscoe Lee Browne), a Black camp cook arrives with a chuck wagon, making Anderson's trail crew complete.\nUnder Andersen's continued tutelage, the boys learn to rope, brand and herd the cattle and horses. Much to Andersen's concern, Cimarron follows the drive from afar. However, while crossing a river, Slim slips off his horse and, unable to swim, starts to drown. Although Slim is saved by Cimarron, Andersen berates one of the boys for his stuttering problem which nearly caused Slim's death. The stuttering boy swears at Andersen repeatedly, losing his stutter in the process. Satisfied, Andersen decides to let Cimarron stay. During another episode, the boys steal Nightlinger's whiskey and drink it, all of them getting severely drunk. Afterwards, one of the boys, Charlie, falls off his horse and is trampled to death by the herd. Slowly, the boys learn under Andersen's tutelage and become rather good cowhands, impressing both Andersen and Nightlinger.\nSoon after, Mr. Nightlinger's chuck wagon throws a wheel. As the cowboys continue to drive the herd, Mr. Nightlinger stays behind to fix the wagon. The rustlers led by Watts begin paralleling the herd, and that night, surprise Andersen and the cowboys in their camp. Watts announces his intention to steal the herd and taunts the boys, but Andersen intervenes and tells Watts it's between the two of them. A brutal fistfight then begins between Andersen and Watts in which Andersen ultimately gains the upper hand. An infuriated Watts grabs a gun, shoots the unarmed Andersen multiple times, and steals the herd.\nThe following day, Nightlinger catches up to the group to find the boys tending to the dying Andersen. Before succumbing to his wounds, Andersen tells the boys how proud he is of all of them, that every man wants his children to be better than he was, and that they have become so. Following Andersen's burial and on a prearranged signal, the boys overpower and bind Nightlinger, seizing the weapons stored in his chuck wagon and vowing to re-take the herd and finish the trail drive. When the group catches up to the herd and the rustlers, Nightlinger offers to help the boys make a plan to overcome the outlaws. Using ruses, trickery, and ambush, the boys kill the rustlers to a man, including Watts, who is tangled in a horse's harness. Cimarron shoots a gun in the air that spooks the horse and carries Watts to his death.\nAfter the boys complete the drive to Belle Fourche and sell the cattle, they use some of the proceeds to pay a stonemason to carve a marker with Andersen's name and the legend \"Beloved Husband and Father,\" in clear reference to the position that Andersen had earned in their lives. They place the marker in the approximate location of Andersen's grave and head for home."}