{"mid": "TheChocolateWar", "IMDB_id": "tt0094869", "title": "The Chocolate War", "plot": "Jerry Renault is a freshman attending an all-boys Catholic high school called Trinity, while coping with depressive feelings and existential questions that stem largely from his mother's recent death and his father's enduring grief. Jerry is quickly recruited onto Trinity's football team, where he meets \"The Goober,\" a fellow freshman and instant friend.\nTrinity's vice-principal, Brother Leon, has recently become acting headmaster and overextends his rising ambition by committing Trinity to selling double the previous year's amount of chocolates during an annual fundraising event, quietly enlisting the support of Archie Costello, the genesis and leader behind The Vigils: the school's cruelly manipulative secret society of student pranksters.\nArchie arrogantly plans to alternate between betraying and supporting Leon in a frenzied series of power plays. His first \"assignment\" is to incite Jerry to refuse to sell any chocolate for ten days. However, Jerry, inspired after reading a quotation inside his locker: \"Do I dare disturb the universe?\" from T. S. Eliot's \"The Love Song of J. Alfred Prufrock,\" feels strangely determined to sell nothing even after the ten days have passed, thus estranging himself from both Leon and The Vigils.\nAt first, Jerry's refusal to cooperate with the corrupt school culture and fundraiser is seen by many classmates as heroic, but the gesture threatens Brother Leon and The Vigils' ability to coerce the student population. Leon presses Archie to put The Vigils' full force behind the chocolate sales and so they set up Jerry as an enemy for the rest of the student body to harass through bullying, prank calls, and vandalism. Only The Goober remains Jerry's friend but does little to protect him. Ultimately, Archie enlists the school bully Emile Janza to beat up Jerry just outside the school, but, even in the aftermath, Jerry maintains his defiant nonconformity.\nFinally, Archie concocts a showdown: a boxing match at night between Jerry and Emile. On the football field, the match is watched by all students, who can select which blows will be laid during the fight through a randomized lottery system; however, the fight ends when a teacher shuts down the electrical power on the field, and Jerry is brutally injured in the ensuing darkness. Half-conscious, he tells The Goober that there was no way to win and he should have just complied, conceding that it is best, after all, not to \"disturb the universe.\" Though Archie is apprehended as the mastermind of the fight, Brother Leon intervenes on his behalf and privately praises his efforts in the unprecedented success of the chocolate sales. Leon implies that next year, if he is officially made the new headmaster, he will work to preserve Archie's power."}