{"mid": "TheCandySnatchers", "IMDB_id": "tt0069840", "title": "The Candy Snatchers", "plot": "Candy (Susan Sennett) is a 16-year-old girl who is kidnapped on her way home from her Catholic school. Her three kidnappers include Eddy (Vince Martorano), his partner Jessie (Tiffany Bolling), and Jessie's brother, Alan (Brad David), who bury her alive in a Southern California field. They give her a pipe for air, expecting they will soon gain a ransom from her father. Unbeknownst to them, Candy's burial is witnessed by a young mute child living nearby, Sean Newton (Christopher Trueblood), who tries to tell his intolerant parents, Dudley (Jerry Butts) and Audrey (Bonnie Boland), about what he saw.\nThe kidnappers contact Candy's father, Avery Phillips (Ben Piazza), demanding that he pay her ransom in all the diamonds in the jewelry store he manages. However, Avery does not report the abduction to anyone, including Candy's mother Katherine (Dolores Dorn).\nThe kidnappers dig Candy up and bring her to their hideout. Jessie and Alan intend to remove Candy's ear to present to Avery as leverage, but Eddy prevents this. Jessie and Alan visit the morgue, where they bribe the coroner Charlie (Bill Woodard) to remove an ear from a cadaver. Meanwhile, Eddy and Candy bond, with the former promising the latter that he will not let harm come to her. After Jessie and Alan return to the hideout, Eddy rapes Jessie, who shows signs of mental illness.\nEddy presents the ear to Avery, who dismisses the threat of killing Candy, as he is really her stepfather and hopes to obtain two million dollars Candy is set to inherit from her late biological father when she turns twenty-one. Meanwhile, Alan heads to the hideout to kill Candy. Sean infiltrates the hideout, where he discovers Candy, who tells him to contact the police. Alan returns to the hideout and rapes Candy. Eddy interrupts the assault and beats Alan. Sean escapes unseen. When he goes home, he misunderstands Candy's instructions and uses a police doll to call a Jewish deli in Brooklyn.\nJessie and Alan insist that Candy must be killed. In the night, Eddy takes Candy to her grave, promising to return to save her. The next morning, he tells Alan he killed the girl. As Sean watches them drive off, he tries to sneak back with a pair of scissors. However, his mother catches him, and gives him a Downer to keep him quiet. The kidnappers visit Katherine, who becomes intoxicated and is seduced by Alan. The kidnappers have Katherine call Avery, who is having an affair with his employee, Lisa (Phyllis Major). Avery returns home, where he is held at gunpoint by the kidnappers while Alan murders Katherine.\nAvery leads the kidnappers to the jewelry store, where he delivers to them the contents of the safe. Avery unsuccessfully attempts to retrieve his snubnosed revolver, but is shot by Alan. Alan attempts to shoot Eddy, who kills him. Eddy and Jessie attempt to escape, but Avery kills Jessie and pursues Eddy to the grave site, where they have a gunfight that ends with Avery's death.\nEddy attempts to dig Candy up, but is shot dead by Sean with Avery's gun. Sean listens to Candy's breathing through a drain pipe. Audrey calls Sean with a cowbell, prompting him to make a trail to his house by scooting down the hill on his backside. Then a gunshot is heard, followed by the sound of the cowbell dropping, and Candy's breathing in her underground prison."}