{"mid": "TheCongress", "IMDB_id": "tt1821641", "title": "The Congress", "plot": "Robin Wright plays a fictional version of herself, an aging actress with a reputation for being fickle and unreliable, so much so that nobody is willing to offer her roles. Her son, Aaron, suffers from Usher syndrome that is slowly destroying his sight and hearing. With the help of Dr. Barker (Paul Giamatti), Robin is barely able to stave off the worst effects of her son's decline. Robin agrees to sell the film rights to her digital image to Miramount Studios (a portmanteau of Miramax and Paramount) in exchange for a hefty sum of money and the promise to never act again. After her body is digitally scanned, the studio will be able to make films starring her, using only computer-generated characters.\nTwenty years later, as her contract is about to expire, Robin travels to Abrahama City where she will speak at Miramount's \"Futurological Congress\" and also renew her contract. By then, Robin's digital likeness has become the star of a popular science-fiction film franchise, \"Rebel Robot Robin\". Abrahama City is an animated zone, where individuals use chemicals to become animated avatars of themselves, entering a mutable illusory state, they can become anything they want to be. While discussing the new contract with Miramount, Robin learns that the studio has developed a new technology that will allow anyone to transform themselves into her.\nRobin agrees to the deal but has a crisis of conscience and does not believe she or anyone else should be turned into a product. Asked to speak at the Congress, Robin publicly voices her views, enraging the hosts of the Congress. Shortly afterwards, the Congress is attacked by rebels ideologically opposed to the technology. During the attack, Robin is protected by Dylan Truliner (Jon Hamm) but is soon captured by \"Miramount Police\". Still in the animated world, Robin is executed; without coming out of the animated world, Robin is shown on a hospital bed, while doctors, also animated, discuss her case. One of the doctors reveals that when Robin was found, she pleaded with her rescuers to execute her. The doctors decide that Robin is so ill that she must be frozen until a time when a treatment for her mental illness is found.\nMany years later, still animated, Robin is revived and reunites with Dylan, who guides Robin to a new animated world in which anything is possible and the ego no longer exists. Dylan reveals that he had once been Miramount's lead animator and had used her digital likeness to make movies for Miramount. The two fall in love, but Robin is still desperate to return to the real world and be with her son. The only way to do that is using a capsule that Dylan was given by Miramount, his reward for twenty years of service. The capsule is only powerful enough for one person and Dylan has no more. Dylan gives it to Robin, begging her not to look at the real him when she returns to the real world.\nRe-entering the un-animated real world, Robin finds it in extreme disrepair and the inhabitants severely dysfunctional. Those who are still able to cope in the real world hover over its ruined cities in large airships. On one of the ships, Robin finds Doctor Barker, who reveals the state of the world in which most people have changed to an existence in an animated, unreal world. Hoping to find Aaron, Robin's hopes are dashed when Barker reveals that Aaron \"crossed over\" into the animated world only six months earlier, when his condition had left him virtually blind and deaf. Because Aaron likely created a new identity for himself in the animated world, there is no way for anyone to find him. While Robin can return to an animated existence, she cannot return to the one she left behind, including Dylan, because that world was not real but created by her consciousness.\nDr. Barker gives Robin an inhalation ampule that will allow her to return to the animated world. Taking it, Robin experiences memories of her son's life, being born, seeing his mother for the first time, as an infant watching his mother act, as an older child being taken to Dr. Barker, as a young adult watching his mother leave for The Congress, finding his mother in suspended animation, and finally taking the capsule that will take him away from the real world forever. The story ends with an animated Robin, having the same appearance as Aaron, discovering Aaron in the middle of an animated desert; it is left for the viewer to decide if the reunion is real or a dream."}