{"mid": "TheChildrensHour", "IMDB_id": "tt0054743", "title": "The Children's Hour", "plot": "Former college classmates Martha Dobie (Shirley MacLaine) and Karen Wright (Audrey Hepburn) open a private school for girls. Martha's Aunt Lily (Miriam Hopkins), an aging actress, lives and teaches elocution at the school. After an engagement of two years to Joe Cardin (James Garner), a reputable obstetrician, Karen finally agrees to set a wedding date. Joe is related to the influential Amelia Tilford (Fay Bainter), whose granddaughter Mary (Karen Balkin) is a student at the school. Mary is a spoiled, conniving child who bullies her classmates, particularly Rosalie Wells (Veronica Cartwright), whom she blackmails when she discovers her in possession of a student's missing bracelet.\nWhen Mary is caught in a lie, Karen punishes her by refusing to let her attend the weekend's boat races. Mary goes home to her grandmother and twists a story so that she will not have to return to school that day. Karen learns what the story is from a father of a departing student and confronts Amelia about Mary accusing Martha and Karen of being lovers. Mary is foiled at convincing others that she personally saw the interactions between Martha and Karen. Mary coerces Rosalie to corroborate her story. Joe is frustrated by the situation, saying that he has finished cleaning up his grandmother's home, and maintains his engagement to Karen and his friendship with Martha. The two women intend to file a suit of libel and slander against Mrs. Tilford.\nMartha and Karen are isolated at the school. Aunt Lily returns after the suit has been lost because she would not return to testify on behalf of her niece and Karen. The incident had been circulated widely by the media. Joe wants to continue with his intention to marry Karen and wants Martha to restart life with them in a rural area where he has found a practice.\nKaren insists that Joe tell her whether he believes that there was a relationship between Martha and Karen. Joe tells Karen that he believes it's untrue. She then says that nothing ever happened and that she could not continue with the engagement.\nRosalie's mother (Sally Brophy) discovers a cache of items among her daughter's belongings, including the bracelet inscribed to Evelyn. Mrs. Wells takes her daughter to Mrs. Tilford who, while walking over to meet her granddaughter, Mary, on the stairs collapses on the floor.\nKaren tells Martha that Joe will not come back. Martha is distraught at Karen's cryptic explanation and urges her to not let Joe go. Karen, however, wants to leave town with Martha the next day. She believes they can go where they will not be recognized and can start a new life, but Martha does not. As Martha tries to talk herself into believing she and Karen are just good friends, she realizes that she does truly love Karen. While Karen does not believe her, tries to dissuade her and maintains her own heterosexuality, Martha comes to believe she has loved Karen ever since they met and that she was simply unaware of the true nature of her feelings. Despite Karen's assurances to the contrary, Martha feels responsible for ruining both their lives and is appalled by her feelings towards Karen.\nMrs. Tilford visits the two teachers. She has learned about the falsehood perpetrated by her; the court proceedings will be reversed and the award for damages settled. Karen refuses Mrs. Tilford's gesture.\nMartha no longer wants to continue with the conversation. Karen leaves her for a walk on the school grounds. Aunt Lily asks Karen about the whereabouts of Martha as her door is locked. Karen breaks loose the door's slide lock with a candleholder and discovers Martha has hanged herself in her room. After Martha's funeral, Karen walks away alone, while Joe watches her from the distance."}