{"mid": "TheChantOfJimmieBlacksmith", "IMDB_id": "tt0077318", "title": "The Chant of Jimmie Blacksmith", "plot": "Jimmie Blacksmith, a half-caste child of an Aboriginal mother and a white father, is raised to adulthood by the Reverend Neville and his wife Martha, hoping their influence will civilize him and provide him greater opportunities in early twentieth century Australia. With a letter of recommendation from his foster family, he goes out in search of work to establish himself, but is taken advantage of by multiple parties. His first employer, Healey, repeatedly shortchanges his pay by nitpicking his fencebuilding work, and refuses to write a job recommendation to avoid admitting he himself is illiterate. Jimmie then works for a local constable, Farrell, who uses him as muscle against other local Aboriginals, including capturing a former friend who is later molested and murdered while in custody, and forced to cover up the death. Jimmie finds some stability working on the farm of the Newby family, who still treat him little better than other employers, and decides to summon and marry a white girlfriend, Gilda Marshall, who is already very pregnant when she arrives to move in with him. Gilda later gives birth to a white child, obviously not fathered by Jimmie; while upset at the public embarrassment, he eagerly embraces being a parent.\nShortly after the birth, Jimmie's full-caste brother Mort and uncle Tabidgi come to the Newby property, and Jimmie enlists their help in his fence-building work. However, Mr. Newby uses their presence as an excuse to deny Jimmie his pay and needed provisions, claiming the extra men were not part of their arrangement. Meanwhile, Mrs. Newby and a schoolteacher friend Miss Graf try to convince Gilda to take her baby and leave Jimmie for a teaching opportunity in another part of the country, which Gilda refuses. Furious at the mistreatment his family is facing, Jimmie enlists Tabidgi to help put a \"scare\" into the Newby women while the men are away, planning to threaten them with hatchets. This suddenly and brutally turns into a rampage that leaves Mrs. Newby, Miss Graf, and all the Newby daughters but one infant dead. Jimmie's family flee the compound, and shortly after Tabidgi, Gilda, and the child are left behind as Jimmie and Mort continue on the run. They soon murder Jimmie's previous employer Healey as well, with Jimmie announcing that he has declared war, in the manner he once heard the fighting against the Boers described. As press coverage about Jimmie's killings become nationwide news, a reporter makes regular probing inquiries to his butcher, whom he is aware doubles as the city's hangman for the police, about what may take place when Jimmie is captured. Tabidgi, since captured and sentenced to death for accessory to murder, tells the convicting court that the decision to kill was not part of the plan and came to them on impulse.\nStill uncaptured, Jimmie and Mort come upon a schoolteacher, McCready, who they initially wound by gunfire; he convinces them not to kill him by showing them a newspaper article about their national notoriety. They decide to take him as a hostage instead and take him from his home. As the brothers argue about the morality of their crimes of killing women and children, McCready makes bitterly humorous observations about the influence of white people on the native Aboriginies. He convinces Jimmie to go on alone and abandon Mort by indicating that Mort's soul has had none of Jimmie's detrimental white influences. Mort in turn takes McCready to a farm to recover, but is killed by a hunting party led by the Newby males and Miss Graf's fiancee Dowie Steed. Jimmie himself is shot at in a lake, but manages to crudely tend to his wounds and hide out in a convent for a night. He is found the next morning and taken by police, who vainly try to prevent townspeople from beating him as they take him to jail. In the final scene, Jimmie is read the last rites by Rev. Neville in his cell, as the butcher/hangman from earlier observes them, and declares that despite the (perceived) unique physical characteristics of Jimmie, his hanging will likely go as normal as any other."}