{"mid": "TheColorOfFriendship", "IMDB_id": "tt0213565", "title": "The Color of Friendship", "plot": "In 1977, Piper Dellums (Shadia Simmons) is a black girl who lives in Washington, D.C. with her father, Congressman Ron Dellums (Carl Lumbly), an outspoken opponent of the South African apartheid system and the oppression of black South Africans, her mother Roscoe Dellums (Penny Johnson), and two younger twin brothers, Brandy (Anthony Burnett) and Erik (Travis Davis). Piper, who has been taking an interest in the different nations of Africa, begs her parents to host an African exchange student.\nMeanwhile, in South Africa, Mahree Bok (Lindsey Haun) is a white South African who lives in a manor house with her parents and little brother. They comfortably benefit from the system of apartheid without questioning its morality; Mahree's father, Pieter Bok, is a South African policeman who cannot hide his joy when Steve Biko (a black South African man fighting against apartheid) has just been captured. They also have a black maid, Flora (Melanie Nicholls-King), whom Mahree, in her racial blindness, considers her best friend, not realizing that Flora is not satisfied with her life under apartheid. However, Mahree's observation is not entirely wrong, as Flora is a kindly woman who is indeed friendly with the Bok children, believing that gentleness and persuasion work better than agitation. Flora tells Mahree that when she was a little girl she would observe the weaver bird, which has many different styles of plumage, and its communal nest-building, which is used as a metaphor for the possibility of racial harmony that Mahree does not understand at the time. Mahree also asks her parents for permission to study in America, which is granted by her father, who believes she will either get homesick or realize that America is not a paradise. However, Mahree is slightly aware of some of the injustices of her society, as a black busboy gets slugged for spilling a tray, which she finds revolting.\nBoth Mahree and Piper have misconstrued notions about each other's countries: Mahree does not think that there are black politicians, only knowing the patriarch of her host family is \"Congressman Dellums\", and although Piper is expecting a South African exchange student, she does not realize there are white residents.\nTheir assumptions are not corrected until Piper and her mother meet Mahree at the airport and bring her home. Piper is bitterly disappointed. Mahree reacts with horror bordering on panic when confronted with this new situation, as does Ron. Piper goes to his office where he is meeting with several black Congressmen, and they all look surprised to see that he will be hosting a white South African. Once Mahree gets back to the Dellums' house, she locks herself in Piper's bedroom and refuses to come out.\nEventually, Piper picks the lock on the door to bring Mahree some fries and a chocolate shake. Mahree is standoffish, and Piper, upset by her attitude, tells Mahree how disappointed she is in her. Stunned by this, Mahree sees how rude she's been, and agrees to stay and try to make this work. Roscoe tries to play peacemaker, chalking up Mahree's reaction to misunderstanding and culture shock, while telling Ron and Piper they have been judgmental as well. Everyone tries to make this work out.\nDuring Mahree's stay, she and the Dellumses grow close. Mahree sees people of different races getting along and realizes how much she and Piper have in common. The two become good friends. Mahree also begins to see her host family as individuals and learns to live among them day to day. Gradually, she develops a better understanding of what life under South African apartheid must be like for people of color.\nWhen Steve Biko dies under suspicious circumstances in the custody of South African police, there are mass protests around the world, including at the South African embassy in Washington, D.C. In the wake of these protests, South African embassy diplomats arrive at the Dellums' house and take Mahree to the embassy, intending to send her back to South Africa.\nIn response, Ron goes to the South African embassy. After he threatens to tell the press that the embassy kidnapped Mahree from her host family, the embassy releases Mahree. Mahree returns to the Dellumses without fully understanding what happened to her and why.\nWhen Mahree returns to the Dellums' house, she makes a cold offhand comment about Biko's death. Outraged, Piper shouts at her for being blind to the racial struggle happening in South Africa. Hurt, Mahree runs from the house. At first, it seems that their friendship is over; but Piper's parents soon bridge the gap between the girls. In private, Ron tells Mahree that the United States had a long, hard history of trying to overcome problems, which is what South Africa is doing now, and she finally fully grasps what the liberation fighters in South Africa stand for. She and Piper reconcile.\nSoon, Mahree leaves the United States, now a very different person. When she returns home, the first person she greets is Flora. Secretly, Mahree shows her an ANC flag sewn inside her coat, signifying her decision to side with the black liberation movement. Flora is touched and pleased.\nAn epilogue-like scene at the end of the movie shows Mahree with the Dellumses at an African pride event back in America. Ron Dellums delivers a speech that includes the weaver-bird story, as told to him by \"a new friend from South Africa.\""}