{"mid": "TheCareBearsMovie", "IMDB_id": "tt0088885", "title": "The Care Bears Movie", "plot": "Mr. and Mrs. Cherrywood are a middle-aged couple who run an orphanage. Mr. Cherrywood tells the orphans a story about the Care Bears and Care-a-Lot, their home in the clouds. In the story, Friend Bear and Secret Bear travel looking for people to cheer up. They meet Kim and Jason, two lonely orphaned children. Friend Bear and Secret Bear introduce themselves and remind the children of their ambitions, but neither of them are interested.\nAt an amusement park, Tenderheart Bear spots a magician's apprentice named Nicholas. While unloading a trunk of goods for his master, the \"Great Fettucini\", Nicholas finds an old book with a diary-style lock. When he unlocks it, an evil spirit appears as a woman's face, and starts corrupting him. With his help, it lays waste to the park, and begins a quest to remove all caring from the world.\nBack at Care-a-Lot, some of the other bears are working on their new invention: the Rainbow Rescue Beam, a portal that can send any bear to Earth and back. The two Care Bear cubs belonging to Grams Bear, Baby Hugs and Baby Tugs, interfere with it and bring forth a group of unexpected visitors: Friend Bear, Secret Bear, Kim, and Jason. The bears introduce themselves to the children, and give them a tour of their home. Tenderheart Bear returns on his now out of control Rainbow Roller just before a \"Cloud Quake\" caused by the spirit, which ruins Care-a-Lot. He informs the others of Nicholas' troubles on Earth. Using the Rainbow Rescue Beam, he sends Kim and Jason to the park, along with Friend Bear and Secret Bear. They end up in the Forest of Feelings when the portal malfunctions. From a nearby river, the rest of the bears begin searching for them aboard a cloud ship called the Cloud Clipper.\nWithin the Forest, the children and their friends are introduced to Brave Heart Lion and Playful Heart Monkey, two of the Care Bear Cousins. Later on, the other bears discover more of these creatures, among them Cozy Heart Penguin, Lotsa Heart Elephant, Swift Heart Rabbit, and Bright Heart Raccoon. During their stay, the spirit attacks them in several disguises: a spearfish, tree, and eagle. After the Care Bears and their Cousins defeat it, they venture back to Earth to save Nicholas from its influence.\nAt the park, Nicholas obtains the ingredients for his spell against the children and the creatures. After he casts it, the Care Bears and company engage in a long battle. The bears shoot beams of bright light on him, forming their \"Stare\"; the Cousins help with their \"Call\". As the creatures' power drains away, Nicholas and the spirit briefly regain control. After Kim and Jason assist him, he finally realizes his misdeeds. With Secret Bear's help, he closes the spirit's face back into the book and saves himself, the park, and the world. He thanks the group and reunites with Fettucini, while Tenderheart Bear inducts the Care Bear Cousins into the Care Bear Family, and Kim and Jason find new parents who take them to one of Nicholas' shows.\nAs Mr. Cherrywood finishes his story, it is revealed that he is actually Nicholas, and that his wife is Kim. Tenderheart Bear, who has been listening from outside a window, returns to Care-a-Lot in his Cloudmobile. The film ends with every member of the Care Bear Family waving good-bye."}