{"mid": "TheCrimsonPirate", "IMDB_id": "tt0044517", "title": "The Crimson Pirate", "plot": "In the Caribbean, late in the 18th century, Captain Vallo (Burt Lancaster), a pirate known as \"The Crimson Pirate\", and his crew capture a frigate of the King's navy. The ship is carrying Baron Gruda (Leslie Bradley), a special envoy of the King on his way to the sland of Cobra to crush a rebellion. Vallo proposes selling the frigate's weapons cache to El Libre, the leader of Cobra's rebels. Baron Gruda counters by proposing that Vallo capture El Libre and bring him to the Baron for a sizable reward. Vallo accepts, and Baron Gruda and his crew are released, while Vallo keeps the frigate. Some of his crew complain that this is not pirate business, but they come around when they find out the large amount of profit to be made.\nVallo and his crew sail to Cobra, where the captain and his lieutenant, Ojo (Nick Cravat), go ashore and meet with the island's rebels, led by Pablo Murphy (Noel Purcell) and Consuelo (Eva Bartok). Vallo and Ojo learn that El Libre has been captured and is in prison on the island of San Pero. The meeting is interrupted by the King's guards, and Consuelo quickly leads Vallo and Ojo to safety. Returning to the frigate, Vallo informs his crew he will rescue El Libre, though Consuelo only believes Vallo is interested in selling weapons to him. While promising Vallo that he will receive his payment, she informs him that El Libre is actually her father.\nAfter sailing to San Pero, Vallo impersonates the Baron and goes to a dinner held in Gruda's honor by the Colonel of the island's garrison (Frank Pettingell). For the disguised Vallo, the Colonel puts on display El Libre (Frederick Leister) and another captured rebel, Professor Elihu Prudence (James Hayter). Vallo orders the prisoners released into his custody, and he leaves, returning with them to the frigate, which sets sail for Cobra.\nConsuelo is grateful to Vallo for rescuing her father, but is distraught to hear that Vallo intends on selling her, El Libre, and the professor to Baron Gruda. Ojo suggests that Vallo has fallen in love with Consuelo, but he denies this after releasing all three prisoners. Consuelo now begs Vallo to come with them but he refuses. Vallo's first mate, Humble Bellows (Torin Thatcher), overhears this exchange, and turns against his captain for breaking his word, sending a message ashore to Baron Gruda.\nVallo lets El Libre and Consuelo leave, but the King's guards are waiting, and El Libre is killed and Consuelo is captured. The pirates mutiny against Vallo, and Humble Bellows is elected their new captain. Baron Gruda promises Bellows gold for dealing with Vallo. So the professor, Ojo, and Vallo are cast adrift in a skiff in the outgoing current and left to die. Gruda proposes a toast, presenting the pirates with a barrel of rum. Unknown to them, the rum has been drugged; after consuming the rum and passing out, they are captured and transferred back to Vallo's ship, now prisoners for Gruda to sell to the King.\nBaron Gruda informs Consuelo that she will now marry Herman (Eliot Makeham), the governor of Cobra, or he will execute the island's population. Consuelo is compelled to accept, and Gruda announces the wedding date and mandatory attendance by everyone. In the meantime Vallo, Ojo, and the clever professor escape their dilemma by capsizing their skiff, trapping a large air pocket for them to breath; walking along the sea bottom toward Cobra, they come ashore, where they quickly find out about the wedding. Vallo intends to rescue Consuelo, but the professor convinces him to first enlist the island's cooperation. Vallo agrees, and along with the professor's advanced knowledge, the people of Cobra build his advanced weapons for their coming revolt. Nitroglycerin grenades, multiple cannon tanks, flamethrowers, rapid-fire rifles on revolving drums, and a large inflatable balloon with gondola are constructed in secret.\nOn the day of the wedding, the people unleash the advanced arsenal just before the ceremony, over-throwing the governor and his guards. Baron Gruda manages to escape to his frigate, taking Consuelo with him. Vallo and Ojo go after them in the large balloon. They spot their old ship below and slide down the balloon's tie-down ropes to its deck, and release the pirates. They then pursue Gruda's frigate. As the pirate ship gets close, Vallo orders the pirates below deck, making Gruda believe they are about to launch a full broadside. Instead, they sneak out through the gun ports, drop into the sea, and swim underwater to Gruda's frigate. A repentant Humble Bellows stays aboard to keep the ship on course, sacrificing himself after Gruda orders a broadside, which destroys the pirate ship. Vallo and his pirates surface, climbing aboard the frigate; the guards are defeated in the ensuing battle, while the Baron is killed. In victory Vallo and Consuelo embrace."}