{"mid": "TheDirtyDozen", "IMDB_id": "tt0061578", "title": "The Dirty Dozen", "plot": "In Britain, in the spring of 1944, Allied forces are preparing for the D-Day invasion. Among them are Major John Reisman (Lee Marvin), an OSS officer; his commander, Regular Army Major General Sam Worden (Ernest Borgnine); and his former commander Colonel Everett Dasher Breed (Robert Ryan). The personalities of the three men are shown to clash and the characters of the individualistic Reisman and the domineering Breed are established. Reisman is aided by his friend, the mild-mannered Major Max Armbruster (George Kennedy).\nMajor Reisman is assigned an unusual and top-secret mission, code-named Operation Amnesty. He is to train a small band of the Army's worst convicts (previously selected by the Army) and turn them into commandos to be sent on a virtual suicide mission, the airborne infiltration and assault on a château near Rennes in Brittany. The chateau will be hosting a meeting of dozens of high-ranking German officers, the elimination of whom will hamper the German military's ability to respond to D-Day by disrupting the chain of command. Those who survive the mission will be pardoned and returned to active duty at their former ranks. However, as Reisman repeatedly tells the men, few of them will be coming back from this one.\nAfter witnessing a hanging in a military prison, Reisman is assigned 12 convicts (the 'Dirty Dozen'), all either serving lengthy sentences or awaiting execution. Sergeant Bowren (Richard Jaeckel) reads out their sentences of each man (during the credits of the film) as Major Reisman walks down the line of prisoners.\nOn March 19, Reisman visits Franko, Wladislaw, Maggott, Posey and Jefferson in their cells. Some details of their crimes are revealed and he uses a different approach with each in an effort to gain their cooperation.\nUnder the supervision of Reisman and MP Sergeant Bowren (Richard Jaeckel), the group begins training. After being forced to construct their own living quarters, the 12 men are trained in combat by Reisman and gradually learn how to operate as a group. For parachute training, they are sent to the base operated by Colonel Breed. Under strict orders to keep their mission secret, Reisman's men run afoul of Breed and his troops, especially after Pinkley - under Reisman's orders - poses as a general and inspects Breed's troops. Angered at the usurpation of his authority, Breed attempts to discover Reisman's mission by having two of his men attack Wladislaw in the latrine, but they are both knocked out by Posey and Jefferson.\nThe 12 men think Reisman sent them until Breed and his men investigate the Dirty Dozen's camp, and recognize the two men who jumped Wladislaw in the latrine. Reisman, who had been away when Breed and his paratroopers arrived, infiltrates his own post and opens fire on the paratroops as the convicts jump them. They disarm the paratroops, Colonel Breed is ordered to take his men and leave, and Major Reisman is called on the carpet by General Worden and his chief of staff, Brigadier General Denton.\nDenton, siding with Breed, insists that Reisman has exceeded his authority and urges General Worden to terminate Operation Amnesty. Reisman rises ferociously to the defense of his men, pointing out they had crammed six months of training into as many weeks and deserved a chance to prove themselves. Major Armbruster suggests a test that would show whether Reisman's men are ready. During practice maneuvers in which Breed will be taking part, the \"Dirty Dozen\" will attempt to capture the Colonel's headquarters. During the maneuvers, the men use various unorthodox tactics, including theft, impersonation, and rule-breaking, to infiltrate Breed's headquarters and hold his men and him at gunpoint. This proves to General Worden that Reisman's men can be used for the mission and that the operation is a go.\nDue to the men's nature, Reisman makes them recite the details of the attack in a rhyming chant to help them remember their roles:\nDown to the road block, we've just begun.\nThe guards are through.\nThe Major's men are on a spree.\nMajor and Wladislaw go through the door.\nPinkley stays out in the drive.\nThe Major gives the rope a fix.\nWladislaw throws the hook to heaven.\nJiminez has got a date.\nThe other guys go up the line.\nSawyer and Gilpen are in the pen.\nPosey guards Points Five and Seven.\nWladislaw and the Major go down to delve.\nFranko goes up without being seen.\nZero Hour: Jimenez cuts the cable; Franko cuts the phone.\nFranko goes in where the others have been.\nWe all come out like it's Halloween.\nThe night of the raid, the men are flown to France, and practice a rhyme they have learned which details their roles in the operation. A slight snag occurs, when upon landing in a tree, one of the dozen, Jiminez (Trini Lopez), breaks his neck and dies, but as trained, the others proceed with the mission, Gilpin taking on Jiminez's duties. Wladislaw and Reisman infiltrate the meeting disguised as German officers, while Jefferson and Maggott sneak onto the top floor of the building. The others set up in various locations around the chateau.\nThe plan falls apart when Maggott sees one of the women who had accompanied the officers, abducts her at knifepoint, and orders her to scream. The German officers downstairs ignore her, thinking she is just having sex. Maggott stabs her and begins shooting wildly at enemy and ally alike, alerting the German officers. Jefferson kills Maggott because he has compromised the mission and evidently gone mad.\nAs the officers and their companions retreat to an underground bomb shelter, a firefight ensues between the Dirty Dozen and the chateau's guard force. As planned, Wladislaw and Reisman lock the Germans in the bomb shelter, then pry open the ventilation ducts to the shelter, drop unprimed grenades down, then pour gasoline inside. Jefferson throws a live grenade down each shaft and sprints for the stolen half-track the team has \"liberated,\" but is shot down as the grenades explode. Over the course of the battle, all but two of the convicts are killed, leaving Reisman, Bowren, Wladislaw and Franko as the remaining survivors of the assault team. As they make their escape Franko, shouting triumphantly that he has survived, is shot by a stray round. Only Reisman, Bowren and Wladislaw (the lone prisoner) manage to get out alive.\nA voiceover from Reisman confirms that General Worden exonerated the surviving members of the Dirty Dozen, and communicated to the next of kin of the rest that \"they died in the line of duty\"."}