{"mid": "TheDescentPart2", "IMDB_id": "tt1073105", "title": "The Descent: Part 2", "plot": "Two days after the events of the first film, a traumatized and blood-covered Sarah (Shauna Macdonald) escapes the cave with no memory of the events. She is taken to a hospital, where it is found that some of the blood on her belongs to Juno Kaplan (Natalie Mendoza). Sheriff Vaines (Gavan O'Herlihy) takes his deputy Elen Rios (Krysten Cummings), Sarah, and three spelunking specialists – Dan (Douglas Hodge), Greg (Josh Dallas), and Cath (Anna Skellern) – to the cave to find the missing women. The team members are sent down via an old mine shaft operated by the old, mysterious Ed Oswald (Michael J. Reynolds).\nThe group discovers Rebecca's mutilated body, causing Sarah to have flashbacks of the crawlers and causing Vaines to believe Sarah may be responsible for the girls' disappearance. While crawling through a tunnel, she attacks Vaines and the others, causing the others to split up. Vaines runs to search for Sarah, and in the process is surprised by a crawler, and fires his gun in a panic, causing a minor collapse in the cavern which traps Cath, separating her from Rios, Dan, and Greg. The three decide to find an alternate way around in order to try and free Cath and arrive in a room full of bones, where they find Holly's video camera. They watch it and realize the women were attacked by the crawlers. The three are then themselves attacked by crawlers and separated.\nRios starts calling for help, alerting the crawlers to her location, but is rescued by Sarah. The two then watch as a crawler kills Dan and drags his body away, prompting Sarah to inform Rios that the crawlers are blind and hunt via sound. After escaping from and killing a crawler Cath finds Greg before the two escape from another crawler and find Sam's body. They decide to try to use her to swing across a chasm, but are attacked again. Greg falls down the chasm, while Cath is killed.\nRios reveals to Sarah that she has a daughter. Elsewhere, Vaines is attacked by a crawler but saved by Juno, who is alive and adept at hunting the crawlers. They reunite with Rios and Sarah, who is shocked to see Juno alive. Juno is furious that Sarah left her to die but the four decide to work together to survive. Juno leads them to a feeding pit, which she claims has a passage to the surface that the crawlers use to gather food from above the ground. Vaines handcuffs Sarah to himself so that she will not abandon them like she did Juno. When he falls over a ledge, he almost drags Sarah with him. Juno orders Rios to cut off Vaines' hand to save Sarah. Despite his protests, she does so, causing Vaines to fall to his death.\nSarah, Juno, and Rios reach the exit, but are blocked by a group of crawlers led by their large leader. They try to quietly sneak past the crawlers, but Greg, who is dying from his injuries, appears and grabs Juno's leg in a last effort to save himself. This causes her to scream in surprise and attract the attention of the crawlers. Greg dies and the women are left to fight them off. After all the crawlers are killed, Sarah tries to rescue Juno from the leader, but it slashes Juno's stomach, mortally wounding her. Sarah then kills it before Juno dies in her arms. More crawlers arrive, but Sarah draws their attention to herself, giving Rios a chance to escape.\nAs Sarah is presumably killed, Rios escapes from the cave. When she tries to call for help, she is attacked by Ed, who drags her back to the opening as food for the crawlers. As Rios regains consciousness, a blood-covered crawler pops out and presumably takes her back into the cave."}