{"mid": "TheDeadPool", "IMDB_id": "tt0094963", "title": "The Dead Pool", "plot": "Fame finally catches up with Harry Callahan. His testimony against crime kingpin Lou Janero puts the mobster in prison and Callahan on the cover of San Francisco Magazine as the city's ace crime fighter. Callahan is attacked by Janero's men at a turnoff near the San Francisco–Oakland Bay Bridge while driving. He knocks down one with his car and shoots the remaining men dead. Callahan discovers he has been assigned a partner: Asian American, martial arts-skilled partner Al Quan (Evan Kim). Unimpressed, he advises Quan to get a bulletproof vest, as his partners often get killed. They are assigned to investigate the death of rock singer Johnny Squares (Jim Carrey), who was killed in his trailer outside a meatpacking plant during filming of a music video for a slasher film directed by Peter Swan (Liam Neeson).\nLater, Dean Madison, Swan's executive producer, is shot and killed during a Chinatown restaurant stickup. Harry and Quan see the holdup and rush to stop it. Harry manages to gun down four of the robbers inside the restaurant; the one who manages to escape out the front door is subdued by Quan, an expert martial artist. Harry wryly compliments Quan's skill, accepting him as his partner in fact. When they examine the dead producer's belongings, they discover a list in his pocket with Harry's and Johnny Squares's names on it. It turns out that the dead producer and Swan are participants in a \"dead pool\" game, in which participants try to predict celebrity deaths, either by natural causes, old age, or as a result of working in dangerous professions. In a turn of events, another celebrity on Swan's list, movie critic Molly Fisher, is stabbed and killed in her condominium by an intruder claiming to be Swan.\nCallahan is asked to cooperate with the media, particularly reporter (and later love interest) Samantha Walker (Patricia Clarkson), to balance their interference with the investigation. Walker proposes to do an in-depth profile on Callahan for her news report, to make up for an incident earlier in the film where Harry threw and ruined Walker's camera in an attempt to stop her crew from harassing Squares' hysterical girlfriend. However, Callahan wants to simply perform his job and stay out of the limelight. Days later, Callahan apologizes for his rude exit at their first dinner, and he and Samantha have a second dinner date. Afterwards, they narrowly escape being killed by Janero's men, leading the reporter to reconsider the plight of police officers versus the public's right to know.\nCallahan drives to San Quentin, where Janero is serving his sentence. He promises a huge, chain-smoking triple murderer named Butcher Hicks a carton of cigarettes for his help in convincing Janero that if anything bad happens to Callahan, the vicious Butcher will pay him a visit. This results in Janero calling off his men, and assigning a couple as Callahan's personal bodyguards to keep any other hoods from killing him.\nCallahan and Quan receive a call that a troubled man named Gus Wheeler, claiming responsibility for the murders, is trying to get on the TV news by dousing himself in gasoline and threatening to immolate himself if he sees a fire truck or a hose. Ultimately, it turns out that Wheeler is just an attention-seeker desperate to appear on camera. He accidentally sets himself on fire, but Harry saves him, allowing officers to extinguish the flames covering him. Samantha is praised by Harry for showing professionalism and not allowing the attention-seeker to have his suicide filmed.\nHarry and Quan later interview Swan and get the name of another suspect: Harlan Rook, a schizophrenic and deranged fan of Swan who thinks his ideas and work have been stolen by the director. Swan had obtained a restraining order against Rook about a year before.\nRook next kills controversial talk show host Nolan Kennard, another person on the dead pool list, using an ingenious device: he drives a remote controlled toy car filled with C4 explosive under the victim's vehicle as he is backing out of his driveway and detonates it. Rook's car bomb goes undetected by Callahan at the crime scene. Although he does find a wheel from the radio control car, he thinks nothing of it until he later spots a radio controlled car following him in the streets. Recognizing the threat, Callahan and Quan flee in their unmarked car through San Francisco's hilly streets, reminiscent of the famous chase sequence in Bullitt, pursued by Rook's radio controlled car and Rook himself in a real car. Eventually Callahan and Al Quan are trapped in an alleyway and the bomb car advances on them. Harry slams the car into reverse seconds before the bomb explodes, with the engine taking the brunt of the blast and the firewall protecting the two cops. Quan is injured but survived with only broken ribs thanks to his bulletproof vest.\nWhen Callahan visits Quan in the hospital and asks about the vest, Quan reveals a piece of advice he was given by his grandfather: \"When your partner gives you advice ... you TAKE it.\" Callahan leaves with a smile.\nRook, disguised as Swan, calls Walker at the television station and invites her to Swan's film studio for an interview, which is actually a trap. Meanwhile, the police raid Rook's apartment and discover torn posters of Swan's films and large quantities of explosives. Callahan hurries to Swan's studio, where Walker is being held captive by Rook. He reluctantly surrenders his .44 Magnum revolver after Rook nearly slits her throat. Callahan lures him to a pier after a chase through a warehouse, with Rook shooting at him with his own gun. Rook eventually runs out of ammunition, and Callahan takes the opportunity to shoot Rook with a Svend Foyn harpoon cannon, impaling him. Callahan leaves with Walker as the police arrive at the scene."}