{"mid": "TheDevilsArithmetic", "IMDB_id": "tt0179148", "title": "The Devil's Arithmetic", "plot": "The book is a little different from the film. Hannah Stern is a 13-year-old Jewish girl living in the present day (time of publication: 1980s). She is bored by her relatives' stories about the past, is not looking forward to the Passover Seder, and is tired of her religion. When Hannah symbolically opens the door for the prophet Elijah, she is transported back in time to 1942 Poland, during World War II. At that time and place, the people believe she is Chaya Abramowicz, who is recovering from cholera, the fever that killed Chaya's parents a few months ago. The strange remarks Hannah/Chaya makes about the future and her inability to recognize her \"aunt\" Gitl and \"uncle\" Shmuel are blamed on the fever.\nAt her \"uncle's\" wedding, the Nazis come to transport the entire population of the village to a concentration camp near Donavin, and only Hannah knows all the terrors they will face: starvation, mistreatment, forced labor, and finally execution. She struggles to survive at the camp, with the help of a girl named Rivka. Uncle Shmuel and some other men try to escape; the men are caught. Fayge, who was going to be married to Shmuel, is killed because she runs to Shmuel when he is about to be shot with the men that were caught. Yitzchak escaped and lived in the forest with the partisans, fighting the Germans.\nLater, when Hannah, Rivka, Esther, and Shifre are working, a guard overhears them talking instead of working. Shifre tries to reassure the guard they have been working, but he takes them anyway and leaves Hannah by herself. As the three are about to leave, Hannah takes Rivka's place by putting on her babushka. Since the guards don't know their faces, this goes unnoticed by the officer. The women are led to the gas chamber. She is then transported back to her family's Seder. Aunt Eva calls her over. Hannah looks at Aunt Eva's number; it is the same as Rivka's.\nHannah (when she was Chaya) was really the woman she was named after, Rivka was Aunt Eva, and Rivka's brother, Wolfe, was Grandpa Will. (Aunt Eva said that they changed their names when they got to America.)\nThe epilogue at the end of the novel reveals that when the camp was liberated, the survivors were Gitl (weighing a mere seventy-three pounds), Yitzchak, Rivka, and Leye (a worker in the camp) and her baby. Gitl and Yitzchak immigrate to Israel where Yitzchak becomes a politician while Gitl organizes a rescue mission that is dedicated to salvaging the lives of young survivors and locating family members. The organization is named after Chaya, her niece that died a hero."}