{"mid": "TheDayAfter", "IMDB_id": "tt0085404", "title": "The Day After", "plot": "The story follows several citizens—and people they encounter—in and around Kansas City, Missouri and the college town of Lawrence, Kansas, 40 miles (64 km) to its west.\nThe film's narrative is structured as a before-during-after scenario of a nuclear attack: the first segment introduces the various characters and their stories; the second shows the nuclear disaster itself, and; the third details the effects of the fallout on the characters.\nDuring the first segment, as the characters are introduced, the chronology of events leading up to the war is depicted entirely via television and radio news broadcasts as well as communications among US military personnel and hearsay, enhanced by characters' reactions and analysis of the events.\n=== Chronology of the war ===\nThe Soviet Union is shown to have commenced a military buildup in East Germany (which the Soviets insist are Warsaw Pact exercises) with the goal of intimidating the United States, the United Kingdom, and France into withdrawing from West Berlin. When the United States does not back down, Soviet armored divisions are sent to the border between East and West Germany.\nDuring the late hours of Friday, September 15, news broadcasts report a \"widespread rebellion among several divisions of the East German Army.\" As a result, the Soviets blockade West Berlin. Tensions mount, and the United States issues an ultimatum that the Soviets stand down from the blockade by 6:00 a.m. the next day, and noncompliance will be interpreted as an act of war. The Soviets refuse, and the President of the United States orders all U.S. military forces around the world on DEFCON 2 alert.\nOn Saturday, September 16, NATO forces in West Germany invade East Germany through the Helmstedt checkpoint to free Berlin. The Soviets hold the Marienborn corridor and inflict heavy casualties on NATO troops. Two Soviet MiG-25s cross into West German airspace and bomb a NATO munitions storage facility, also striking a school and a hospital. A subsequent radio broadcast states that Moscow is being evacuated. At this point, major U.S. cities begin mass evacuations as well. There soon follow unconfirmed reports that nuclear weapons were used in Wiesbaden and Frankfurt. Meanwhile, in the Persian Gulf, naval warfare erupts, as radio reports tell of ship sinkings on both sides.\nEventually, the Soviet Army reaches the Rhine. Seeking to prevent Soviet forces from invading France and causing the rest of Western Europe to fall, NATO halts the Soviet advance by airbursting three low-yield tactical nuclear weapons over advancing Soviet troops. Soviet forces counter by launching a nuclear strike on NATO headquarters in Brussels. In response, the United States Strategic Air Command begins scrambling B-52 bombers.\nThe Soviet Air Force then destroys a BMEWS station at RAF Fylingdales, England and another at Beale Air Force Base in California. Meanwhile, on board the EC-135 Looking Glass aircraft, the order comes in from the President for a full nuclear strike against the Soviet Union. Almost simultaneously, an Air Force officer receives a report that a massive Soviet nuclear assault against the United States has been launched, further updated with a report that over 300 Soviet intercontinental ballistic missiles (ICBMs) are inbound. It is deliberately unclear in the film whether the Soviet Union or the United States launches the main nuclear attack first.\nThe first salvo of the Soviet nuclear attack on the central United States (as shown from the point of view of the residents of Kansas and western Missouri) occurs at 3:38 p.m. Central Daylight Time, when a large-yield nuclear weapon air bursts at high altitude over Kansas City, Missouri. This generates an electromagnetic pulse (EMP) that shuts down the electric power grid to any remaining of nearby Whiteman AFB's operable Minuteman II missile silos and of the surrounding areas. Thirty seconds later, incoming Soviet ICBMs begin to hit military and population targets. Kansas City, Sedalia, Missouri, and all the way south to El Dorado Springs, Missouri are blanketed with ground burst nuclear weapons. While the story provides no specifics, it strongly suggests that America's cities, military, and industrial bases are heavily damaged or destroyed. The aftermath depicts the central United States as a blackened wasteland of burned-out cities filled with burn, blast, and radiation victims. Eventually, the U.S. President delivers a radio address in which he declares there is now a ceasefire between the United States and the Soviet Union (which, although not shown, has suffered the same devastating effects) and states there has not been and will not ever be any surrender by the United States.\n=== Storyline ===\nDr. Russell Oakes lives in the upper-class Brookside neighborhood with his wife and works in a hospital in downtown Kansas City. He is scheduled to teach a hematology class at the University of Kansas (KU) hospital in nearby Lawrence, Kansas, and is en route when he hears an alarming Emergency Broadcast System alert on his car radio. He exits the crowded freeway and attempts to contact his wife but gives up due to the long line at a phone booth. Oakes attempts to return to his home via the K-10 freeway and is the only eastbound motorist. The nuclear attack begins, and Kansas City is gripped with panic as air raid sirens wail. Oakes' car is permanently disabled by the EMP from the first high altitude detonation, as are all motor vehicles and electricity. Oakes is about 30 miles (48 km) away from downtown when the missiles hit. His family, many colleagues, and almost all of Kansas City's population are killed. He walks 10 miles (16 km) to Lawrence, which has been severely damaged from the blasts, and, at the university hospital, treats the wounded with Dr. Sam Hachiya and Nurse Nancy Bauer. Also at the university, science Professor Joe Huxley and students use a Geiger counter to monitor the level of nuclear fallout outside. They build a makeshift radio to maintain contact with Dr. Oakes at the hospital as well as to locate any other broadcasting survivors beyond their area.\nAirman Billy McCoy is stationed at a Minuteman missile silo near Whiteman Air Force Base, 70 miles (110 km) east-southeast of Kansas City, and is called to duty during the DEFCON 2 alert. His crew are among the first to witness the initial missile launches, indicating full-scale nuclear war. After it becomes clear that a Soviet counterstrike is imminent, the airmen panic. Several stubbornly insist that they should stay at their post and take shelter in the silo, while others, including McCoy, point out that it is futile because the silo will not withstand a direct hit. McCoy tells them they have done their jobs and speeds away in an Air Force truck to retrieve his wife and child in Sedalia (20 miles (32 km) east of Whiteman AFB), but the truck is permanently disabled by an EMP from an airburst detonation. McCoy abandons the truck and takes shelter inside an overturned semi truck trailer, barely escaping the oncoming nuclear blast. After the attack, McCoy walks towards a town and finds an abandoned store, where he takes candy bars and other provisions, while gunfire is heard in the distance. While standing in line for a drink of water from a well pump, McCoy befriends a man who is mute and shares his provisions. McCoy asks another man along the road about Sedalia, and the man indicates that Sedalia and Windsor no longer exist. As McCoy and his companion both begin to suffer the effects of radiation sickness, they leave a refugee camp and head to the hospital at Lawrence, where McCoy ultimately succumbs to the radiation sickness.\nFarmer Jim Dahlberg and his family live in rural Harrisonville, Missouri, very close to a field of missile silos about 37 miles (60 km) south-southest of Kansas City. While the family is preparing for the wedding of their elder daughter, Denise, to KU senior Bruce Gallatin, Jim prepares for the impending attack by converting their basement into a makeshift fallout shelter. As the missiles are launched, he forcefully carries his wife Eve, who refuses to accept the reality of the escalating crisis and continues making wedding preparations, downstairs into the basement. While running to the shelter, the Dahlberg's son, Danny, inadvertently looks behind him just as a missile detonated in the distance and is instantly blinded and carried back to the shelter by Dahlberg.\nKU student Stephen Klein, while hitchhiking home to Joplin, Missouri, stumbles upon the farm and persuades the Dahlbergs to take him in. After several days in the basement, Denise, distraught over the situation and the unknown whereabouts of Bruce, who, unbeknownst to her, was killed in the attack, escapes from the basement and runs about the field that is cluttered with dead animals. She sees a clear blue sky and thinks the worst is over. However, the field is actually covered in radioactive fallout. Klein goes after her, attempting to warn her about the effects of the invisible nuclear radiation that is going through her cells like x-rays, but Denise, ignoring this warning, tries to run from him. Eventually, Klein is able to chase Denise back to safety in the basement, but not before Denise runs to the stairs to find her wedding dress. During a makeshift church service, while the minister tries to express how lucky they are to have survived, Denise begins to bleed externally from her groin due to radiation sickness from her run through the field.\nKlein takes Danny and Denise to Lawrence for treatment. Dr. Hachiya attempts to treat Danny, and Klein also develops radiation sickness. Dahlberg, upon returning from an emergency farmers' meeting, confronts a group of silent survivors squatting on his farm and attempts to persuade them to move somewhere else, only to be shot and killed mid-sentence by one of the silent survivors.\nUltimately, the situation at the hospital becomes grim. Dr. Oakes collapses from exhaustion and, upon awakening several days later, learns that Nurse Bauer has died from meningitis. Oakes, suffering from terminal radiation sickness, decides to return to Kansas City to see his home for the last time, while Dr. Hachiya stays behind. Oakes hitches a ride on an Army National Guard truck, where he witnesses US military personnel blindfolding and executing looters. After somehow managing to locate where his home was, he finds the charred remains of his wife's wristwatch and a family huddled in the ruins. Oakes angrily orders them to leave his home. The family silently offers Oakes food, causing him to collapse in despair, as a member of the family comforts him.\nAs the scene fades to black, Professor Huxley calls into his makeshift radio: \"Hello? Is anybody there? Anybody at all?\" There is no response."}