{"mid": "TheDucksters", "IMDB_id": "tt0042418", "title": "The Ducksters", "plot": "Porky Pig is on a radio quiz show called Truth or AAAAHHH!!, a somewhat macabre parody of the popular quiz show Truth or Consequences (but with potentially fatal consequences) hosted by Daffy Duck, sponsored by \"Eagle Hand Laundry\" (\"If your eagle's hands are dirty, we'll wash them clean!\"), and broadcast by the Ajax Broadcasting Company, in which the object is to answer near-impossible or ridiculously obscure questions, such as \"Who, mind you WHO, was the referee for the New Zealand heavyweight championship fight in 1726?\" (here, Porky actually knew it was \"Arbuckle Dreen,\" and even knew that Dreen's Second Grade teacher was \"Abigail Twitch\"). Failing to answer the other questions correctly or in time required him to \"pay the penalty\" (for instance, when Daffy asks who was the father of his country, Porky's stuttering prevents him from answering \"George Washington\" in time). These penalties include Porky being threatened by a buzz saw, pounded with a mallet, blown up with dynamite, crushed by a safe, crushed by the Rock of Gibraltar, rained upon by Niagara Falls, and other forms of abuse, to Daffy's amusement. Porky tries several times to back out, but each time Daffy manages to reel him back in, even shooting an audience member dead when he shouts \"You'll be sorry!\".\nEventually, after a particularly snide line from Daffy (\"listen, Mac; You've got 32 teeth, would you like to try for 16?,\" a play on the then-popular game Take it or Leave It), Porky threatens to retaliate, forcing Daffy to offer his final challenge for a huge jackpot. Porky must guess who Miss Shush is with his only clue being a recording of her brushing her teeth on Wednesdays. Porky fails to answer correctly (obviously) and Daffy invites him into Miss Shush's dressing room to meet her, but it's revealed by Daffy to be his final torture; Miss Shush is really Mamie, a 600 pound gorilla who appears in Obnoxious Pictures' \"Jungle Jitters\", and who proceeds to viciously and loudly maul Porky. Porky eventually emerges and advances on Daffy menacingly, and Daffy finally gives in: awarding Porky the jackpot of 26 million dollars and three cents. Porky immediately contacts the president of the Ajax Broadcasting Company and, upon learning that they will sell for the exact amount of the jackpot, buys it out.\nNow Daffy's boss, Porky takes over the quiz show and then asks a very nervous Daffy: \"in what latitude and longitude did the Wreck of the Hesperus occur?\" Daffy fails to answer correctly in time, and Porky turns the tables, submitting Daffy to the same \"penalties and prize\" that he had received earlier. The cartoon ends when Daffy is then tied to a long plank being cut by the same buzz saw Porky was on at the start of the cartoon, quickly irising out after Daffy screams at the studio audience: \"Have you got a doctor in the balcony, lady?!\" (this line was a takeoff of another radio quiz show, Doctor IQ, where the announcer would note \"I have a lady in the balcony, doctor\" to introduce a new contestant)."}