{"mid": "TheDogsOfWar", "IMDB_id": "tt0080641", "title": "The Dogs of War", "plot": "Having escaped from Central America, mercenaries James Shannon, Drew, Derek, Michel, Terry and Richard, get an offer from a British businessman, Roy Endean. He is interested in \"certain resources\" in the small African nation of Zangaro, which is run by the brutal dictator, General Kimba.\nShannon goes on a reconnaissance mission to Zangaro's capital of Clarence and meets a British documentary filmmaker named North. However, Shannon’s activities arouse the suspicions of the police and he is arrested, severely beaten and imprisioned. His wounds are treated by Dr. Okoye, a physician who was formerly a moderate political leader. North agitates for Shannon’s release and he is deported after two days of torture.\nWhen Shannon tells Endean that there is no chance of an internal coup, Endean offers him $100,000 to overthrow Kimba by invading Zangaro with a mercenary army. Endean intends to install a puppet government led by Colonel Bobi, Kimba's greedy former ally. This would allow Endean to exploit the country's newly discovered platinum resources, an agreement guaranteed by Colonel Bobi. Shannon refuses the offer and instead proposes to his estranged wife that they start a new life in America. When she turns him down, he accepts Endean's offer on condition that he will have complete control of the operation.\nProvided with a million dollars for expenses, Shannon contacts some of his associates from Central America and they meet up to plan the coup. The group illegally procures a supply of Uzi submachine guns, ammunition, rocket launchers, mines and other weapons from arms dealers. North encounters Shannon by chance and suspects him of being a CIA agent. Shannon asks Drew to scare North away without hurting him but instead North is killed by someone hired by Endean to follow Shannon and his crew. A furious Shannon kills the assassin in turn and leaves his body at Endean's house during a dinner party held for Colonel Bobi.\nTo transport the team to the coast of Zangaro, Shannon hires a small freighter and crew. At sea, the team is joined by a group of Zangaron exiles trained as soldiers by a former mercenary colleague. Once ashore, the mercenaries use their array of weapons to attack the military garrison where Kimba lives. Drew enters a shack in the barracks' courtyard and is killed by a young woman with a baby who shoots him in the back with a pistol. After the mercenaries storm the burning, bullet-scarred ruins of the garrison, Shannon blasts his way into Kimba's mansion. There he finds the dictator stuffing bricks of bills into a briefcase and kills him.\nEndean arrives by helicopter with Colonel Bobi and they enter the presidential residence, where they find Shannon and Dr. Okoye awaiting their overdue arrival. Shannon introduces Dr. Okoye as Zangaro's new president and silences Endean by shooting Bobi when he protests.\nShannon, Derek and Michel load the body of Drew onto a Landrover in line with the toast they drank on planning the operation, \"Everyone Comes Home\". The scene finishes with the mercenaries driving through the deserted streets of Clarence."}