{"mid": "TheDeltaForce", "IMDB_id": "tt0090927", "title": "The Delta Force", "plot": "Operation Eagle Claw is being aborted after a fatal helicopter crash, with the U.S. Delta Force evacuating to their C-130 transports. Among them is Captain Scott McCoy (Chuck Norris), who, against orders, rescues his wounded comrade, Peterson (William Wallace), from the burning helicopter before the team finally evacuates. McCoy expresses his disgust for the politicians and the military hierarchy that forced the mission to launch despite the risks, and announces his resignation.\nFive years later, a group of Lebanese terrorists hijack American Travelways Flight 282, a Boeing 707 flying from Cairo, Egypt to New York City via Athens, Greece and Rome, Italy. Taking all 144 passengers and crew hostage on the Athens-Rome leg, the pro-Khomeini New World Revolutionary Organization, led by two terrorists named Abdul Rafai (Robert Forster) and Mustafa (David Menahem), force Captain Roger Campbell (Bo Svenson) and his crew to fly the 707 to Beirut, Lebanon, where they make demands to the United States government that, if not met, will result in the death of each of the hostages. During the crisis, they separate the Jewish passengers from the Americans by forcing the flight attendant to identify them. She is hesitant to do so because of her German heritage. A Catholic priest O'Malley joins the Jews in solidarity. Unbeknownst to the authorities, the Jewish hostages are then taken off the 707 and transported to a militant-controlled area of Beirut, while a dozen additional henchmen are brought on board.\nThe Boeing 707 departs for Algiers, where the terrorists release the female hostages and children. Meanwhile, Delta Force, led by Colonel Nick Alexander (Lee Marvin) and McCoy (who has been recalled to duty and promoted to Major) are deployed to resolve the crisis. Once the female hostages are evacuated, they launch their assault, only to discover too late that there are additional hijackers on board. When the Delta Force blow their cover, Abdul kills a United States Navy Diver named Tom Hale (Charles Floye). He then forces the pilots take the 707 back to the skies and then to return to Beirut and takes the remaining male passengers with him.\nUpon returning to Beirut, the terrorists transport the passengers to a separate location, while the pilots remain in the 707. Using a sympathetic Greek Orthodox priest, Israeli Army Intelligence prepares an operation to free the hostages. In a prolonged campaign against the terrorists, the Delta Force bide their time to identify the terrorist leaders and locate the hostages. Once the hostages are located, the Delta Force assault the terrorist holdouts, freeing the hostages and evacuating them to the airport. During the battle, McCoy, Peterson and their team hunt for Abdul and the Jewish hostages. They kill most of the militants but Abdul gravely injures Peterson and flees. While the commandos tend to Peterson, McCoy chases Abdul and tracks him down to an abandoned home. He then engages him into a vicious hand-to-hand fight, breaking Abdul's arm. As the terrorist leader prepares to shoot McCoy, he is killed when McCoy launches a rocket into his car.\nWith the hostages and rescue teams secured, the team seizes Flight 282 by secretly infiltrating the airfield through a cotton field. Using silenced weapons, Alexander and the Delta team assassinate the terrorist guards and save the crew. They board the 707 with all of the hostages, taking off to Israel just as McCoy storms the runway on his motorcycle; managing to board after destroying several terrorist jeeps. On board, the team tends to the wounded passengers and the dying Peterson. After having confirmed the hostages are safe and en route home, Peterson says his farewells to McCoy before succumbing to his wounds. In the main cabin the ex-hostages and Delta commandos join together in a rousing rendition of \"America The Beautiful\", not knowing about Peterson's death, except for Alexander and Bobby. In Israel, the boeing 707 lands safely and the hostages are greeted by their families, while Delta Force disembarks with Peterson's body in tow to take the C-130 Hercules back to USA. The team concludes their operation and departs for the United States amidst celebrations by the people."}