{"mid": "TheDaffyDoc", "IMDB_id": "tt0030033", "title": "The Daffy Doc", "plot": "Dr. Quack is preparing for an important operation and asks his assistant Dr. Daffy Duck (also a quack) to please keep things quiet for him. Everything starts out calmly enough, but Daffy goes insane when Dr. Quack starts barking orders faster and faster (Scalpel, scissors, clamps, needle, etc). Daffy goes completely crazy and grabs the tools, throws them in the air and runs around the operating room acting like a lunatic while yelling a constant crazed \"WHOO-HOO! WHOO-HOO!\" After using the oxygen bag as a punching bag, Daffy is kicked out of surgery and lands in an \"artificial lung\" machine that inflates Daffy's body parts. Insulted, he vows to get his own patient and prove his worth. Daffy grabs a mallet, puts it behind his back, and walks off to look for a patient.\nWhile back in the operating room, Dr. Quack complains to the audience about Daffy's disregard of the \"seriousness\" of the situation as he is finishing up the operation on his patient (which turns out to be a football) and kicks it around the operating room. He continues to play with it, acting almost as insane as Daffy was, while the audience puts on football fan paraphernalia and cheers the Doc on. Daffy, on the hunt for his own patient, opens the window and looks outside when he sees Porky strolling by. Daffy hides behind the window pane at first so Porky doesn't see him then jumps out of the window and follows him around the corner to the back of the building where he hits Porky on the head with the mallet. He proceeds to carry Porky in on a stretcher with a satisfied look on his face since he has now found his patient!\nNext, Porky is lying in a hospital bed with a thermometer sticking out of his mouth (which later turns out to be a lollipop) as Daffy is examining him. Daffy is listening to Porky's heartbeat with a giant ragged stethoscope. After Daffy pulls the \"thermometer\" out of Porky's mouth, Porky tries to tell him that he's not sick and that he feels fine, but Daffy ignores him and thrusts the lollipop back into his mouth. He then states that he must hold a consultation in order to decide what to do about Porky. He then knocks himself on the head with a mallet and two ghostly images of himself appear. They begin to discuss what should be done about Porky when they all agree that an operation is in order. Daffy reaches into his medical bag and pulls out a big saw. He walks over to Porky, pulls the covers down, lifts his gown and attempts to cut him open. As soon as Porky sees what Daffy's intentions are, he panics and yells, \"Hey! W-W-What's the big idea?\"\nPorky then struggles to get away from the insane duck and avoid the even more insane \"operation\" by wiggling around, slipping through the covers and ultimately running from the room as Daffy starts shouting a crazed and excited \"Whoo-Hoo! Whoo-Hoo!\" and chases after Porky. Porky runs through a door, slams it shut and holds it in an effort to keep Daffy out and away from him only to find Daffy standing behind the door where he greets Porky with a cheery \"Hello chum!\" and motions Porky over so they can continue with the operation. Porky panics and crashes through the door and runs off again with Daffy hot on his trail. As Porky is running through the hallway, Daffy catches up with him and grabs the end of his gown and tries to stop him so he can proceed with the operation. Porky, having no desire to be cut open by Daffy, continues running from the crazed duck until they both crash into the iron lung machine that was seen earlier. After it spits them both out, their bodies inflate and deflate continuously."}