{"mid": "TheDeadlyBees", "IMDB_id": "tt0061557", "title": "The Deadly Bees", "plot": "The film opens with two men from an unnamed ministry commenting on a spate of letters from a beekeeper claiming to have developed a strain of killer bees. They dismiss him as a lunatic, though his letters claim he will start killing people if he is not taken seriously.\nMeanwhile, pop singer Vicki Robbins (Suzanna Leigh) collapses from exhaustion on television, and is sent to recuperate in a cottage on Seagull Island. The reason for this is that her doctor knows Ralph Hargrove. The proprietors of the \"rest home\" are a depressed and disgruntled couple, Ralph and Mary Hargrove (Guy Doleman and Catherine Finn). Ralph is a beekeeper, as is his neighbor, H.W. Manfred (Frank Finlay).\nVicki begins noticing a spate of mysterious happenings. Mary Hargrove's dog and later Mary herself are attacked by the bees and killed, leading Vicki to suspect Hargrove. She and Manfred begin to snoop around. Manfred keeps his bees in an apiary within his home, behind a pair of doors which open to view the bees. He claims to control them via a tape-recording of a high note made by a death's head moth, of which the bees are afraid. He encourages her to search through Hargrove's papers. In doing this, she finds that Hargrove has managed to isolate \"the smell of fear\" into a liquid form. Manfred tells her this must mean that Hargrove has been baiting the bees with this substance.\nVicki's snooping methods do not go unnoticed; she soon gets attacked by bees in her room at the cottage. She eventually escapes to Manfred's house, where she decides to stay until she can catch the next boat off the island. Manfred begins acting suspiciously, so Vicki decides to do some more of her own detective work. She discovers his secret laboratory, which leads him to admit that he indeed is the one who has been causing this all along. He tells Vicki he has been intending to kill Hargrove all along, but now that she knows the secret, he will have to kill her too.\nShe thwarts his attempt, leading him to be stung to death and crash through the stair-rail,and her to set the house on fire. She escapes the burning house, and leaves the island the next day just as someone in a bowler hat from the ministry finally arrives to investigate the deaths."}