{"mid": "TheDevilsCarnival", "IMDB_id": "tt2204379", "title": "The Devil's Carnival", "plot": "God, in his heavenly workshop, is painting the face onto a doll. He messes up on the eyebrows, and tosses the doll into a bin labeled Broken, and begins working on another one. Meanwhile, on Earth, three people are about to meet their deaths. John, a grieving father, slits his wrists in his own grief after losing his son, Daniel. A thief, Ms. Merrywood, is killed in her trailer after a shootout with police. Tamara, a teenage girl, is killed by her angry boyfriend. All three are greeted by denizens of Hell as they die (Heaven's All Around).\nIn Hell, which is a Carnival, Lucifer's second-in-command, The Ticket Keeper, rallies the Carnies in a Big-Top circus tent. There, he calls out the names of the Carnies who will be \"performing\" that night for the recent arrivals. He selects The Painted Doll, a mute woman with a cracked face, The Twin, a chameleon-like character, The Hobo Clown, a mute man, and The Scorpion, a knife-thrower. The Scorpion is absent from the meeting, so Ticket-Keeper sends Painted Doll to go find him. The Magician, another carnie, opposes Ticket-Keeper and demands to be in the show. Ticket-Keeper threatens him with Lucifer's wrath, and he backs down. In other parts of the Carnival, John, Ms. Merrywood, and Tamara all awaken, given an envelope containing a ticket to enter. John, Ms. Merrywood, and Tamara all begin to wander to the entrance. John and Ms. Merrywood bump into each other, and they arrive at Ticket-Keeper's booth as the Carnies welcome them to the Carnival (The Devil's Carnival). John attempts to cut ahead of Ms. Merrywood, believing his lost son is in the Carnival. Ticket-Keeper admonishes him for attempting to break the rules, and explains all the 666 laws of the Carnival (666). They are welcomed in.\nTamara, wandering in the back of the Carnival, finds The Scorpion, who resembles a typical \"bad boy\". She releases him from a cage, and he woos her over with his deadly knife-throwing act. Meanwhile, John, in search for his son, finds himself in the Big-Top tent. He is harassed by Wick and her three cohorts, the Woe-Maidens, as the circus band. The Hellharmonic, led by The Major, play a tune (Kiss The Girls). The tormentors vanish suddenly, however, and John sees Painted Doll in a kissing booth. She offers John knowledge of Daniel's location in exchange for a kiss. However, she bites his ear off, which spontaneously reappears.\nMeanwhile, Daniel meets Lucifer, who begins reading him Aesop's Fables, starting with \"The Dog and Her Reflection\". Ms. Merrywood, following a pamphlet to find a large diamond, unintentionally litters, and runs from the Carnival's enforcer, The Tamer, into a dark tent. There, The Twin has the large diamond, and morphs into Merrywood herself. Merrywood, not noticing her own reflection, fails The Twin's game, and is stripped naked (\"Beautiful Stranger\") and whipped for the Carnies, while The Hobo Clown sings a metaphorical song that retells the fable Lucifer is reading (A Penny For A Tale).\nLucifer begins reading Daniel another fable, this time \"The Scorpion and The Frog\". Tamara is continually wooed by The Scorpion, and follows him into a dark tent where a knife-throwing wheel has been set up. The Painted Doll is there, and she and The Scorpion are kissing, disappointing Tamara. The Scorpion accuses Tamara of not trusting him, which she denies. He straps her to his knife-throwing wheel, and tosses three knives at her, all of them missing. He brandishes a fourth knife, a switch blade, and throws it directly into Tamara's heart, killing her (Trust Me). The Painted Doll then retells the fable to the Carnies through song, showing off Tamara's body for them (Prick! Goes The Scorpion's Tale).\nLucifer reads one final fable for Daniel, \"Grief and his Due\". John finds an entrance-way to find his son, and wanders through a room of red balloons, swings, a hallway of mirrors, and eventually to a recreation of his bathroom where he slit his wrists. John, distraught over losing his son, claims Heaven has abandoned both Daniel and himself (Grief). John finds Daniel in Lucifer's study, only for him to morph into The Fool, a midget carnie, much to Lucifer's amusement. Lucifer taunts John, revealing to him that he is in fact in Hell as he could not let go of his grief. John weeps but eventually decides he no longer wants to grieve and Lucifer sends John to heaven. John crawls out of God's Broken bin, surprising him.\nLater, Ticket-Keeper questions Lucifer about letting John go to Heaven. Lucifer rallies the Carnies together, announcing a grand plan to offer the condemned souls redemption and thus, access to Heaven (Grace For Sale). Ticket-Keeper informs the Carnies that, come tomorrow, they will wage war with God and his Angels, in order to \"put Heaven out of business\". The Carnies dance and celebrate, excited to start their battle with Heaven (Off To Hell We Go).\nIn a Post-Credits scene, Tamara finds Lucifer in the Big-Top tent. She blindly places her trust in him, like she did with The Scorpion, and is seduced by Lucifer, ultimately repeating the sin that brought her to Hell (In All My Dreams I Drown)."}