{"mid": "TheDeerHunter", "IMDB_id": "tt0077416", "title": "The Deer Hunter", "plot": "=== Act I ===\nIn Clairton, a small working class town in western Pennsylvania, in late 1967, Russian-American steel workers Michael \"Mike\" Vronsky (Robert De Niro), Steven Pushkov (John Savage), and Nikanor \"Nick\" Chevotarevich (Christopher Walken), with the support of their friends and co-workers Stan (John Cazale) and Peter \"Axel\" Axelrod (Chuck Aspegren) and local bar owner and friend John Welsh (George Dzundza), prepare for two rites of passage: marriage and military service. The opening scenes set the traits of the three main characters. Mike is the no-nonsense, serious, but unassuming leader; Steven the loving, groom-to-be, pecked-at by his mother; and Nick the quiet, introspective man who loves deer hunting because, he likes \"…the trees…the way the trees are\". The recurring theme of hunting with \"one shot\", which is how Mike prefers to take down a deer, is introduced.\nBefore the trio ships out, Steven and his girlfriend Angela (Rutanya Alda), who is pregnant by another man, but loved by Steven nonetheless, marry in a Russian Orthodox wedding. In the meantime, Mike works to control his feelings for Nick's girlfriend Linda (Meryl Streep). At the wedding reception held at the local VFW hall, the guys drink, dance, sing, and enjoy the festivities, but then notice a soldier in a U.S. Army Special Forces uniform. Mike attempts to ask what Vietnam is like, but the soldier ignores him. After Mike explains that he, Steven, and Nick are going to Vietnam, the Green Beret raises his glass and says \"fuck it\". After being restrained by the others from starting a fight, Mike goes back to the bar and, in a mocking jest to the soldier, raises his glass and toasts him with \"fuck it\". The soldier then glances over at Mike and grins.\nLater, Steven and Angela drink from conjoined goblets, a traditional part of the Orthodox wedding ceremony. It is believed that if they drink without spilling any wine, they will have good luck for life. Two drops of blood-red wine unknowingly spill on her wedding gown. After Linda catches the bride's bouquet, Nick asks her to marry him, and she agrees. Later that night, a drunken Mike runs through the town, stripping himself naked along the way. After Nick chases him down, he begs Mike not to leave him \"over there\" if anything happens in combat. The next day, Mike, Nick, Stan, John, and Axel go deer hunting one last time. Mike is exasperated by his friends, especially Stan, who drinks and clowns, showing little respect for the ritual of hunting, which to Mike is a nearly sacred experience. Only Nick understands Mike's attitude, but he is more indulgent toward his friends. Mike goes hunting afterwards and kills a deer with one, clean shot.\nAct one finishes with the friends arriving back at Welsh's bar, with Michael's deer strapped to the hood of the car. They enter rambunctiously, spraying beers over each other and singing loudly. Welsh then makes his way to a piano and begins playing methodically as the others sit quietly. They sit in silence, strewn all over the bar, as their friend plays Chopin's Nocturne No. 6 Op. 15-3, a peaceful, yet ominous melody.\n=== Act II ===\nThe film then jumps abruptly to war-torn Vietnam, where U.S. helicopters attack a Communist-occupied village with napalm. A North Vietnamese soldier throws a stick grenade into a hiding place full of civilians. An unconscious Mike (now a Staff Sergeant in the U.S. Army Special Forces) wakes up to see the NVA soldier shoot a woman carrying a baby. Mike kills him with a flamethrower. Meanwhile, a unit of UH-1 \"Huey\" helicopters drops off several U.S. infantrymen, Nick and Steven among them. Mike, Steven, and Nick unexpectedly find each other just before they are captured and held together in a riverside prisoner of war camp with other U.S. Army and ARVN prisoners. For entertainment, the sadistic guards force their prisoners to play Russian roulette and gamble on the outcome. All three friends are forced to play. Steven plays against Mike, who offers moral support, but Steven breaks down and points the gun upwards whilst pulling the trigger, grazing himself with the bullet when it discharges. As punishment, the guards put him into an underwater cage full of rats and the bodies of others who earlier faced the same fate. Mike and Nick hatch a plan to escape by playing against each other, with Mike convincing the guards to let them play Russian roulette with three bullets in the gun. After a tense match, they kill their captors and escape.\nMike earlier argued with Nick about whether or not Steven could be saved, but after killing their captors, he rescues Steven. The three float downriver on a tree branch. An American helicopter finds them, but only Nick is able to climb aboard. The weakened Steven falls back into the water, and Mike plunges in the water to rescue him. Mike helps Steven to reach the river bank, but Steven's legs are broken, so Mike carries him through the jungle to friendly lines. Approaching a caravan of locals escaping the war zone, Mike stops a South Vietnamese military truck and places the wounded Steven on it, asking the soldiers to take care of him.\nNick, who is psychologically damaged, recuperates in a military hospital in Saigon with no knowledge on the status of his friends. After being released, he goes AWOL and aimlessly stumbles through the red-light district at night. At one point, he encounters Julien Grinda, a champagne-drinking, friendly Frenchman, outside a gambling den where men play Russian roulette for money. Grinda entices the reluctant Nick to participate and leads him into the den. Mike is present in the den, watching the game, but the two friends do not notice each other at first. When Mike does see Nick, he is unable to get his attention. When Nick is introduced into the game, he grabs the gun, fires it at the current contestant, and then again at his own temple, causing the audience to riot in protest. Grinda hustles Nick outside to his car to escape the angry mob. Mike cannot catch up with Nick and Grinda as they speed away.\n=== Act III ===\nBack in the U.S., Mike arrives home but maintains a low profile. While en route home, he tells a cab driver to drive past the house where all his friends are assembled with a large banner outside, as he is embarrassed by the fuss Linda and the others have made. He visits Linda the following day and grows close to her, but only because of the friend they both think they have lost. Mike eventually learns about Angela, whom he goes to visit at the home of Steven's mother. Angela is apathetic and barely responsive. When asked by Mike about Steven's whereabouts, she writes a phone number on a scrap of paper, which leads Mike to the local veterans' hospital where Steven has been for several months. Mike goes hunting with Axel, John, and Stan one more time, and after tracking a deer across the woods, takes his one shot but pulls the rifle up and fires into the air. He then sits on a rock escarpment and yells out, \"OK?\", which echoes back at him from the opposing rock faces leading down to the river, signifying his fight with his mental demons over losing Steven and Nick. He also berates Stan for carrying around a small revolver and waving it around, not realizing it is still loaded. Mike visits Steven, who has lost both of his legs and is partially paralyzed. Steven reveals that someone in Saigon has been mailing large amounts of money to him, and Mike is convinced that it is Nick. Mike brings a reluctant Steven home to Angela and then travels to Saigon just before its fall in 1975.\nHe tracks down Grinda, who has made a lot of money from the Russian roulette-playing Nick. He finds Nick in a crowded gambling club, but Nick appears to have no recollection of his friends or his home in Pennsylvania. Mike enters himself in a game of Russian roulette against Nick, hoping to jog Nick's memory and persuade him to come home, but Nick's mind is gone. To keep him from taking another turn, Mike grabs Nick's arms, which are covered in scars (implied to be heroin tracks). At the last moment, after Mike reminds Nick of their hunting trips together, he finally breaks through, and Nick recognizes Mike and smiles. Nick then tells Mike, \"one shot\", raises the gun to his temple, and pulls the trigger. The round is in the gun's top chamber, and Nick kills himself. Horrified, Mike tries reviving him, but to no avail.\n=== Epilogue ===\nBack home in 1975, the friends have gathered for Nick's funeral, whom Mike has brought home, staying good to his promise. The film ends with everyone at John's bar, singing \"God Bless America\". Mike toasts in Nick's honor."}