{"mid": "TheDreamers", "IMDB_id": "tt0309987", "title": "The Dreamers", "plot": "Matthew (Michael Pitt) is an American exchange student who has come to Paris to study French. While at the Cinémathèque Française protesting the firing of Henri Langlois, he meets the free-spirited twins Théo (Louis Garrel) and Isabelle (Eva Green). The three bond over a shared love of film.\nAfter dinner with their parents (Anna Chancellor and Robin Renucci), Théo and Isabelle offer Matthew the chance to stay with them while their parents are on a trip. Matthew accepts, considering them his first French friends.\nMatthew becomes suspicious of their relationship after seeing them sleeping nude together; he soon discovers that they accept nudity and sexuality liberally. After Théo loses at a trivia game, Isabelle sentences him to masturbate to a Marlene Dietrich poster in front of them. After Matthew loses at another game, he is forced to take Isabelle's virginity. The two then become lovers.\nMatthew begins to accept Théo and Isabelle's sexuality and his time living with them soon becomes idyllic. The three re-enact a famous scene from Bande à part by \"breaking the world record for running through the Louvre\", and Matthew and Théo engage in playful arguments about Charles Chaplin and Buster Keaton, Eric Clapton and Jimi Hendrix, as well as the subject of Maoism, which Théo fervently believes in. Matthew and Isabelle also continue their relationship, although Matthew attempts to take her on regular dates, which she has not experienced before.\nOne night, while the three are sleeping naked together in the living room, Théo and Isabelle's parents arrive to leave a cheque for groceries. They are startled and disturbed by what they find. After they leave, Isabelle wakes up and discovers the cheque, realizing that their parents have found them. Wordlessly, she attaches a hose to the gas outlet and lies back down with Théo and Matthew, attempting to commit suicide. After a few moments, however, they are woken by a brick being hurled through the window; they discover hundreds of students rioting in the streets. All three of them are overjoyed and proceed to join the protesters. Later on, Théo joins a small team of protesters preparing molotov cocktails. Matthew stops him, arguing against violence, but he is shunned by both Théo and Isabelle.\nAs Matthew mournfully walks away through the chaos, Théo takes Isabelle's hand and hurls a molotov cocktail at a line of police. The film ends as the police charge the crowd."}