{"mid": "TheDevilsOwn", "IMDB_id": "tt0118972", "title": "The Devil's Own", "plot": "In 1972, eight-year old Francis McGuire witnesses his father being gunned down in front of him due to being an Irish republican sympathizer.\nBy 1992, an adult Francis (Brad Pitt) and three other I.R.A. men are caught up in a firefight in Belfast when members of the British Army try to capture him. One gunman is killed and another, Desmond, is wounded as Frankie and the last gunman, Sean Phelan (Paul Ronan), flee. Hiding out in the countryside, Francis and his friend Martin MacDuf (David O'Hara) see a British Army helicopter circling overhead and decide they need Stinger missiles.\nFrancis, traveling under the alias \"Rory Devaney,\" is picked up at Newark Airport by IRA sympathizer Judge Peter Fitzsimmons (George Hearn), who has arranged for \"Rory\" to stay with New York City Police Department Sergeant Tom O'Meara (Harrison Ford), his wife, Sheila (Margaret Colin), and their three daughters in Staten Island. The judge gives Francis a handgun. \"Rory\" befriends Tom during his stay.\nMeanwhile, Sean has acquired a large fishing boat, and repairs it with Francis so that they can use it to sail back to Ireland with the missiles.\"Rory\" meets with black market arms dealer Billy Burke (Treat Williams). Burke agrees to purchase the missiles with his own money, waiting for Francis to pay him on delivery in six to eight weeks. Judge Fitzsimmons has his family's nanny, Megan Doherty (Natascha McElhone) deliver the bag of money he has raised to Francis. During an Irish celebration of the confirmation of one of Tom's daughters, Megan phones Rory to tell him Martin has been killed and to postpone his deal with Burke.\nTom decides to retire from the police force after an incident involving the shooting of a carjacker by his partner, Eddie Diaz (Rubén Blades). When Tom and Sheila arrive home that afternoon, they are attacked by masked intruders. As sirens are heard approaching, Tom persuades them to leave while they still can. Even though his bag of cash is still hidden under the floor in his room, Francis knows that Burke is behind this attack and confronts him. Burke reveals he's kidnapped Sean, ordering Francis to get him the money or his friend will die.\nFrancis attempts to collect the money at the O´Meara house but Tom has already found it, forcing him to reveal his true identity. Tom and Eddie arrest Francis, but Francis escapes captivity, shooting Eddie in the process.\nThe FBI and the British authorities question Tom about his association with Francis. Tom refuses to cooperate, aware that the British would kill Francis.\nThat night, Francis meets Burke in a warehouse, and one of Burke's thugs tosses Sean's severed head at Francis's feet. Francis gives them a bomb-laden bag that explodes when the thug opens it. Francis grabs one of their guns, and kills Burke and his men. He drives off in a van with the missiles, stopping by the Fitzsimmons house to ask Megan to tell his superiors that he is returning with the missiles. He plans to spend the night and leave the next morning.\nTom crashes a cocktail party there to confront the judge. He recognizes Megan from a photo that Sean had taken of Francis and Megan dancing, which he found in Francis's bag. He chases after her, but Frankie escapes. Tom persuades Megan to tell him where Francis is going by promising to protect Francis from being assassinated. Tom finds Francis, just as Francis sails away from the pier, Tom jumps aboard. The two fire on each other, wounding each other respectively. Francis seemingly has the upper hand, but collapses from his wound when he hesitates on shooting Tom. As the two men embrace out of mutual respect, Francis dies. Saddened by Francis death, Tom turns the boat to shore as the sun starts to rise over the ocean."}