{"mid": "TheDeadDontDie", "IMDB_id": "tt0071395", "title": "The Dead Don't Die", "plot": "THE DEAD DONT DIE-synopsis On a dark and stormy night in Illinois State Penitentiary in 1934 Ralph Drake (Jerry Douglas) is waiting to be executed. His brother Don (George Hamilton) visits him and apologizes for not being there during the trial where Ralph was convicted of killing his wife. Don promises his brother that he will try to find out who the real killer was. A sealed letter is given Don from Ralph, who tells him to open it after his death. At this point the guard (Russ Grieve) comes and tells Don to leave. Ralph is prepared for the electric chair and led to the execution chamber where he is strapped in. The prison chaplain (Brendan Dillon) recites the 23rd Psalm as a final prayer. Don sits as one of the witnesses. The switch is thrown (twice) and Don sheds a tear.At the graveside another priest (William OConnell) recites final rites and encourages Don to leave. A woman has come up during the ceremony and stands behind at some distance. The coffin is lowered into the grave as she watches.A few days later in Chicago at the Loveland Ballroom a dance marathon is going on where several couples (some appearing near death) are vying for the prize of $1500. Don watches until Jim Moss (Ray Milland) appears and introduces himself to Moss as Ralphs brother. They watch as a lady gasps and collapses on the dance floor and is carried out on a stretcher. Don produces the letter to give to Moss, who suggests they go to his office.The letter (telling Moss to give Ralphs saved money to his brother) is presented and Don receives $1500 in cash. It is discussed that an employee, Frankie Specht (James McEachin), found the body and Ralph unconscious. Although Moss (who was technically Ralphs employer) testified on his behalf, there were witnesses who claimed the couple was fighting on the dance floor. Don explains that he was on a carrier in the Indian Ocean serving in the navy when the death occurred. He asks about Specht and is told that he disappeared after discovering the body.Don enters his hotel and asks for any messages. He is told there are none by the hotel clerk (William Billy Benedict). He is referred to the grill for a meal. As he turns to go, the mysterious woman from the gravesite is seen sitting by the hotel desk.In the restaurant the woman, Vera LaValle (Linda Cristal), approaches Don and joins him. She tells him he is in danger and that he should leave Chicago before  he  finds out. When Don asks who  he  is, he is distracted to the window where Ralph is standing outside looking in. Don immediately rises to go to his brother, but Vera cautions him not to. He follows down the dark street to a door where Ralph appears to have entered. Knocking on the door, he demands entrance but is told they are closed by Levenia (Joan Blondell). Pushing his way inside, he is told that no one entered but he wants to see for himself. Perdido (Reggie Nalder) comes from the back room and informs him that no one else is here. A struggle leaves Perdido lying on the floor while Don sees that no one is in the back room. Levenia tells Don that he has killed Perdido. As he bows to examine the body, Don is struck over the head by a large object. From the door window we see Vera watching.Don wakes up with a bad headache, attended by Vera, who explains that she followed him to the antiques shop and found him unconscious. She was able to bring him back to the hotel with the help of a cab driver. He tries to get up and is unable.Meanwhile Specht arrives at the hotel desk and asks for Don. Told he hasnt been seen since the night before, Specht turns away. When the clerk asks for a message, he refuses. When asked who is calling, Specht replies  no one .The next morning Vera is seen packing and hiding a small gun in her suitcase. Don comes in and demands answers. She pulls the gun on him and he takes it away. She explains that she only wanted to threaten him with it so she could get away. He asks about the events of the night before and she tells him he is in danger from Varek, the zombie master who is enslaving the dead. He demands she take him to Varek.They take a cab to a funeral home where Don gets out and speaks to Vera, who remains in the cab. She reminds him that this was his idea, then tells the driver to go. Don is left standing alone on the street.Inside, Don asks the funeral receptionist Frazier (Milton Parsons) to see Varek. He is told there is no one there by that name. As Frazier reads off the names of the deceased Don stops him on the name  Perdido . He is directed to the chapel where he approaches an open casket. As he gazes upon the body of Perdido, a voice speaks and calls his name. Don asks who he is and is told  Varek . Suddenly the corpse grabs Don by the throat but he slips away. He watches in horror as the corpse rises and pursues him to the door. Don fires all his bullets to no avail. Finally he is able to get the door open and escape.At the police station Lt. Reardon (Ralph Meeker) calls the funeral home to confirm Dons story but is told he was not seen there and neither is there any body there named Perdido. Don persuades Reardon to come with him.At the antiques shop Levenia tells Reardon she remembers Don coming in before. He is surprised when she calls Perdido from the back room. He comes out wearing dark sunglasses and identifies himself as Perdido. Don runs out the door and is followed by Reardon.Back at the ballroom, Don approaches as Moss announces on the p. a. system that it will be another twelve hours until the dance marathon ends. Coming offstage, Moss joins Don, who tells him that he saw his brother Ralph and is not sure if he is crazy. They go to Mosss apartment and talk. Moss suggests that Don sleep there in a pull-out bed. Saying Don will be safer there from the police and Varek, Moss promises to ask around and will be back in a few hours.Later in a dream, Don sees his dead brother and the walking corpse of Perdido, who gets into a deadly struggle with Don. Suddenly he wakes and sits up in bed. Vera speaks to him, telling him that Varek has sent her to kill him. He gets up and confronts her. She tells him she doesnt want to harm him but came to warn him. They kiss and embrace. When he begins unzipping her dress, she tells him no, that he cannot have her. Removing her necklace, she shows him a scar around her throat. She tells him she belongs to Varek and that she is dead.Vera tells him that although he saw Ralph, Varek has made him a zombie. She reveals that she was executed in Haiti by guillotine and revived as a zombie by voodoo. She shows him a mark on her hand of a snake which was given her by Varek. He asks her how she was able to disobey Varek and she says once she learned she was deceived by Varek the spell was broken. Don expresses his disbelief but Vera insists that he leave now while he can. Becoming excited, she tells him she feels that Varek knows she has betrayed him and will kill her. She explains that a doll baptized in her name will be burned by a candle. When we see this happening, she screams in pain, running into another room as she bursts into flames. Looking in the room, Don sees her body destroyed by fire.Don goes back to the police, who refuse to help him. Meanwhile a new woman, Miss Adrian (Yvette Vickers), is applying for a job with Moss. As she is leaving, Don enters and tries to tell Moss about Vera burning up. They go for a drive in Mosss car. Moss informs Don that after some checking there is nothing found about Vera, Varek and Specht. Moss reveals that Veras address turned out to be a vacant lot. When Don insists that what he saw is true and wishes he could prove it, Moss suggests going to the cemetery and digging his brother up. Meanwhile, a car follows them.After digging up the coffin, Moss steps out of the grave and tells Don to open it. When the coffin is revealed to be empty, Don sees that Moss has disappeared. Suddenly Perdido approaches and Don fights him off with the shovel. Specht appears and offers Don his hand to exit the grave. He introduces himself to Don, saying he had been following him for a few days and wanted to warn him about Moss, whom he says is Varek.Driving back to town, Specht tells Don that it was he who killed Frances under the control of Varek. He says he was prevented from saving Ralph by zombies. They drive to a storage place where Specht says he has proof. When Specht refuses to go inside, Don asks to see his hands. Seeing no snake mark, Don goes into the building. Specht gives him a tool to open the door, telling him to check the cold storage.Entering the storage office, Don picks up a flashlight from the desk and begins looking around. Outside, Specht is run down by a car driven by Perdido. Inside, Don opens some morgue drawers to find bodies, including that of Frances.Suddenly Moss appears, turning on the lights. He tells Don that his army of children is now complete to take over the city and that Don will be one of them. Moss summons Ralph to kill Don. Pulling out the drawer with Frances in it, Don tells Ralph that it was not he who killed her, but Moss who is Varek. When Ralph hears the truth, the spell is broken and he turns on Moss. They go into the meat locker but Don is unable to open the door. Looking through the glass window, he observes Ralph strangle Moss and hang him up on a meat hook. Ralph collapses on the sawdust floor.Outside, Don hears police sirens and finds a policeman at the body of Specht. Reardon arrives and inform Don that his brother was cleared by a full confession from Specht. Don tells him that Moss is inside with the others. They follow Don into the cold storage. At the door they are met by a night watchman who insists no one has been there all night. Reardon insists and they enter. Finding no bodies anywhere inside, Don is dumbstruck again. They exit and Reardon puts Don in the police car to take him back to the hotel. As they are leaving, the storage guard waves goodbye. Don notices as they drive away, the snake-mark symbol on the hand of the guard."}