{"mid": "TheEyesOfMyMother", "IMDB_id": "tt5225338", "title": "The Eyes of My Mother", "plot": "Francisca and her mother live on a farm where they raise cows and other animals. A trained surgeon, Francisca's mother teaches her how to remove eyeballs from farm animals, and is taught the legend of Francis of Assisi. Suddenly, Charlie, a door to door salesman, appears and asks to use her bathroom. Against her better judgment, Francisca's mother lets him into the house. After a struggle, Charlie kills Francisca's mother. Charlie is injured, presumably by Francisca's father, who arrives home while Charlie is still attacking the mother in the bathtub. Francisca's father seems undisturbed by these events and chains Charlie in the barn. Francisca and her father bury Francisca's mother in the backyard. Charlie explains the incomparable thrill of killing others. Off camera, Francisca removes Charlie's eyes and vocal cords and bags them and onscreen puts them in the refrigerator. Francisca explains to Charlie that he was not killed because he is her only friend and she will look after him. Over time she tortures him with her mother's surgical implements.\nYears later, the adult Francisca's father dies, and she preserves the body. She meets Kimiko, a Japanese student, at a bar. Kimiko and Francisca return to Francisca's home but Kimiko is perturbed at Francisca's description of the death of her mother and the revelation that she murdered her father. Kimiko tries to leave, but Francisca murders her and offscreen chops her up and bags the organs, putting them in her refrigerator with Charlie's and presumably her father's parts.\nAfterwards, she bathes Charlie, who was still chained up in the shed, and it is assumed that she has sex with him. Charlie is then stabbed by Francisca as he tries to escape. Back in the barn, she admits he was right about murder and kills him.\nFrancisca goes hiking in the woods and catches a ride with Lucy back to the house. Lucy has a baby son who Francisca kidnaps upon reaching the house. Francisca stabs Lucy before praising her dead mother and keeping Lucy's son as her own child, who she names Antonio. Like Charlie, Lucy has her eyes and vocal cords cut out by Francisca, but this time her surgery is visible.\nAntonio grows into a school age child and is shocked at seeing Lucy when he enters the barn, which he is told never to go into. Antonio later unlocks the barn and Lucy escapes. A trucker finds Lucy and police are called to the barn. Francisca is shown digging up the grave of her mother in the woods while talking to her skull. After holding her son as a hostage, Francisca is killed by the police."}