{"mid": "TheEagleHasLanded", "IMDB_id": "tt0074452", "title": "The Eagle Has Landed", "plot": "The book makes use of the false document technique, and opens with Higgins describing his discovery of the concealed grave of thirteen German paratroopers in an English graveyard. The characters discuss the real life rescue of Hitler's ally Benito Mussolini by Otto Skorzeny. A similar idea is considered by Hitler, with the strong support of Himmler. Admiral Wilhelm Canaris, head of the Abwehr (German military intelligence), is ordered to make a feasibility study of the seemingly impossible task of capturing British Prime Minister Winston Churchill and bringing him to the Reich. Canaris realizes that although Hitler will soon forget the matter, Himmler will not. Fearing Himmler may try to discredit him, Canaris orders one of his officers, Oberst Radl, to undertake the study, despite feeling that it is all just a waste of time and effort.\nAn Unteroffizier on Radl's staff finds that one of their spies, code named Starling, has provided a tantalizing piece of intelligence. \"At any other time, in any other place, this information would be useless\", Radl said. \"And then synchronicity rears its disturbing head.\" Winston Churchill is scheduled to spend a relaxing weekend at a country house near the village of Studley Constable, Norfolk, where Joanna Grey, an Afrikaner woman and longtime Abwehr agent, lives. She detests England because she was abused and raped by British soldiers, and her husband, daughter, and parents were killed during the Anglo-Boer War. As a result of her reports, Radl devises a detailed plan to intercept Churchill and return with him to Germany. Although Radl is certain the plan has real possibilities, Admiral Canaris orders him to abandon it.\nHimmler, however, has already learned of the scheme and summons Radl. He orders him to proceed, but without notifying Canaris. In response, Radl arranges for Liam Devlin, a member of the Irish Republican Army, to be smuggled to Norfolk by way of Northern Ireland. Posing as a wounded veteran of the British Army, he contacts Mrs. Grey, who arranges a position for him as game warden to the estate of Studley Grange. While awaiting further developments, Devlin becomes romantically involved with Molly Prior, a girl from the village.\nMeanwhile, Radl selects the members of the \"commando style\" unit, led by disgraced Fallschirmjäger commander Lieutenant Colonel Kurt Steiner, which is supposed to carry out the operation. While returning from the Eastern Front, Steiner had intervened when SS soldiers were rounding up Jews at a railway station in Poland. To the outrage of the SS and Polizei, he took one of their men hostage and helped a teenage Jewish girl to escape on a passing freight train. For this he was court-martialled, along with his men, who backed his actions. Too highly decorated to face a firing squad, Steiner and his men were allowed to transfer to a penal unit in the Channel Islands. There they are forced to make high-risk attacks with manned torpedoes against Allied ships in the English Channel.\nRadl travels to Alderney and recruits Steiner and his surviving men. Steiner's father, General Steiner, is being tortured by the Gestapo for his alleged ties to the German Resistance. This serves as an additional incentive for the Colonel to accept the mission. Radl relocates Steiner and his men to an airfield on the north western coast of Holland, where they familiarise themselves with the British weapons and equipment they will be using. The team will be air dropped into Norfolk via a captured C-47 Dakota with Allied markings. The commandos outfit themselves as Free Polish troops, as few of them speak English; the plan is to infiltrate Studley Constable, capture Churchill, rendezvous with an E-boat at the nearby coast and make their escape. As part of the ruse they arm themselves with Sten guns, M1 Garands, Bren guns and revolvers, as well as Browning Hi-Powers instead of German weaponry.\nAt first, the plan seems to go off without a hitch. Then, however, one of Steiner's NCOs rescues a young girl who fell into a mill race. He is killed by the water wheel and his German uniform (worn, by Himmler's order, under the Polish uniforms, as protection against being executed as spies) is seen by several of the villagers. Determined to continue the mission, Steiner arranges for the locals to be rounded up, but the sister of Father Vereker, the local priest, escapes and alerts a nearby unit of US Army Rangers. Colonel Robert Shafto, an inexperienced but glory-seeking officer, rallies his forces to retake the hostages. Without notifying headquarters, he orders a foolhardy assault in which many Americans are killed. After the Colonel is shot in the head by Mrs. Grey, Major Kane organizes a second, successful attack.\nSteiner, his second-in-command Ritter von Neumann, and Devlin manage to escape with Molly's aid. Determined to finish the mission, Steiner allows Devlin and Neumann to escape without him and decides to make one last attempt at Churchill. He succeeds in reaching Churchill, but hesitates, is shot and supposedly killed. (However, Steiner reappears alive in The Eagle Has Flown, a sequel.) In Germany, Radl has had a heart attack, implied to be fatal, although at about the same time, Himmler, upon discovering that the mission has failed, orders Radl's arrest for high treason.\nAs in many novels of Higgins, this story is surrounded by a 'frame story' with a prologue and epilogue. The author, whilst doing historical research in Norfolk, supposedly meets various surviving characters. Some paperback editions have more historical backstory than others, including a meeting with an older Liam Devlin in a Belfast hotel. The final revelation comes from an aged and terminally ill Father Vereker: at the time of his supposed visit to Norfolk, Churchill was actually en route to the Tehran Conference. The \"Churchill\" that Steiner almost killed was an impersonator, meaning that even if Steiner had shot him, it would not have mattered."}