{"mid": "TheEmperorsNewGroove", "IMDB_id": "tt0120917", "title": "The Emperor's New Groove", "plot": "Kuzco, a young selfish Inca emperor, rejects the appearances of potential brides and throws an elderly man out the window for \"throwing off his groove.\" After Kuzco fires his conniving advisor, Yzma, for abusing her power, she comes up with a scheme to take the throne with the help of Kronk, her dim-witted but jovial henchman. Later, Kuzco meets Pacha, a kind peasant and village leader, and tells him that he plans to demolish his hilltop family home to build himself a lavish summer home called \"Kuzcotopia\". Pacha protests, but is dismissed.\nYzma and Kronk later devise a plan to assassinate Kuzco through having him drink poison at a supper, but end up giving him the wrong potion that instead transforms him into a llama. After knocking Kuzco out, Yzma orders Kronk to dispose him and hide the body, but Kronk has a stroke of conscience and saves him. He accidentally drops him on the back of Pacha's cart as Pacha leaves the city. Pacha returns home but does not tell his pregnant wife or children about Kuzco's decision. After awakening in the cart, Kuzco reveals himself as a llama and orders Pacha to take him back to the palace, but Pacha will only do so if Kuzco agrees to spare his family's home. Kuzco haughtily sets off into the jungle alone, only to be chased by jaguars. Pacha rescues Kuzco and he promises him, as they make their way to the palace.\nMeanwhile, Yzma takes the throne, but Kronk reveals that he had lost Kuzco. The two then set off to find him. Pacha and Kuzco fail to return to the palace, when Pacha falls through a bridge and Kuzco refuses to help him up, admitting he never meant to keep his promise. However, he soon finds himself in danger too, and they work together to save both of their lives. Without the bridge their journey is delayed, giving Pacha hope that Kuzco will change his mind. They stop at a jungle restaurant at the same time Kronk and Yzma do. Neither party realizes the other is there until Pacha overhears Yzma and Kronk attempting to kill Kuzco. However, Kuzco does not believe Pacha's warning and leaves him. Kuzco only then overhears Yzma's plot and that the kingdom doesn't even miss him. Realizing Pacha was right Kuzco finds he has already left and wanders in the jungle alone. That night, Kronk learns that Pacha must had brought Kuzco to the village.\nA repentant Kuzco is soon reunited with Pacha, and they enlist the help of Pacha's family to keep Yzma and Kronk occupied while they make head start. The race to the palace seems to end with Yzma and Kronk falling off a cliff, but they still inexplicably reach the palace first. Yzma orders Kronk to kill the both, but Kronk cannot bring himself to commit murder, which leads Yzma to insult Kronk and his cooking then resign to do it herself. Yzma calls in the guards (who do not recognize Kuzco) while Pacha and Kuzco escape with all the potions in hopes of turning Kuzco back to a human. After several guards are transformed into animals while testing potions and Yzma is transformed into a kitten, Pacha and Kuzco work together try to get the last vial. Yzma steals it, but is surprisingly defeated by Kronk.\nNow human again and a more selfless ruler, Kuzco decides to build his summer home elsewhere, and Pacha suggests a neighboring hilltop. In the end, Kuzco is shown living next door to Pacha's in a modest cabin, sharing a swimming pool with Pacha and his family. Yzma, still a kitten, grudgingly joins Kronk's Junior Chipmunk troop."}