{"mid": "TheEast", "IMDB_id": "tt1869716", "title": "The East", "plot": "Jane, an operative for the private intelligence firm Hiller Brood, is assigned by her boss Sharon to infiltrate The East, an underground activist, anarchist and ecologist organization that has launched several attacks against corporations in an attempt to expose their corruption. Calling herself Sarah, she joins local drifters in hitching rides on trains, and when one drifter, Luca, helps her escape from the police, she identifies the symbol of The East hanging from Luca's car mirror. Sarah self-inflicts an arm injury that she tells Luca was caused in the escape so he can get medical attention for her. He takes her to an abandoned house in the woods where members of The East live and one of the members, Doc, treats her cut.\nSarah is given two nights to recover before she must leave the squat. At an elaborate dinner involving straitjackets, Sarah is tested and fails. Exposing how selfishly she and many others live their lives. Sarah is caught one night when spying by the deaf Eve and has a conversation in sign language with her. Sarah tells Eve that she is an undercover agent and threatens Eve with jail if she stays with the group; Eve leaves the next morning. Sarah is recruited to fill the missing member's role on a \"jam,\" which is an old fashioned term for a direct action. After seeing the effectiveness of the pharmaceutical jam, compounded by her growing attraction to charismatic Benji (Alexander Skarsgård), Sarah gradually questions the moral underpinnings of her undercover duty. Sarah reluctantly participates in The East's next jam and comes to learn that each member of The East has been personally damaged by corporate activities. For example, Doc has been poisoned by a fluoroquinolone antibiotic and his neurosystem is degenerating. The East infiltrates a fancy party for the senior executives of the pharmaceutical company responsible for Doc's poisoning and puts a strong dose of the risky antibiotic into everyone's champagne. The East announce this action via YouTube and over time one executive's mind and body begins to degenerate as a side effect of the antibiotic, revealing publicly the extreme risks of the drug.\nAnother East member, Izzy (Ellen Page) is the daughter of a petrochemical CEO. The group uses the father/daughter connection to gain intimate access to the CEO and forces him to bathe in the waterway he has been using as a toxic dumping ground. This jam goes wrong when security guards arrive and shoot Izzy in the back as she and the others flee. Back at the squat, because of his poisoning, Doc's hands tremble too much for him to perform surgery on Izzy. Sarah offers to do it for him and he tells her what to do. She manages to remove the bullet from Izzy's abdomen, but Izzy dies and is buried near The East's house.\nEven though Sarah and Benji have grown closer and Sarah implores him to just disappear, he insists that they go together to complete the final jam. Sarah refuses at first but finally gives in and the two begin a long drive, during which Sarah falls asleep. When she awakens, she realizes that Benji is driving her to the Hiller Brood headquarters outside Washington, D.C. He reveals that he has always suspected her of being a Hiller Brood operative, and that Luca also thought this, but brought her in as a test. Benji wants Sarah to obtain a NOC list of Hiller Brood agents all over the world, which will be The East's third and final jam, to \"watch\" them. Having successfully obtained the NOC list using her cell phone's memory card, Sarah runs into Sharon in the hall. She confronts Sharon about the firm's activities, thus revealing her new allegiances. Sharon has Sarah's cellphone confiscated as she leaves the building. As Hiller Brood was sharing information about their activities with the FBI, The East's hideout is raided and Doc is arrested. He sacrifices himself to ensure the getaway of the remaining members. Sarah tells Benji she's failed to get the NOC list. Benji reveals he means to use the list to expose publicly all the Hiller Brood agents. Since they are undercover, however, it is likely they could be killed. Sarah chooses not to go on the run with Benji. She and Benji part at a truck-stop as Benji heads out of the country. In truth, Sarah has the NOC list (because it wasn't on her phone, she'd swallowed the memory card instead). It is clear that her time undercover with The East has changed her. The film ends with an epilogue of her personally contacting her former coworkers (those undercover) and attempting to demonstrate what nefarious corporate crimes Hiller Brood clients want to protect. She hopes to change each operative's mind about their undercover activities and perhaps join her in ecological activism. She is paying tribute to the things The East believes in and attempting to make a difference in her own way, without causing harm to anyone."}