{"mid": "TheExterminator", "IMDB_id": "tt0080707", "title": "The Exterminator", "plot": "During a firefight in Vietnam, U.S. soldiers John Eastland and his best friend, Michael Jefferson, are captured by the Viet Cong. They are tied to wooden stakes with several other men, and tortured for information. When Eastland refuses to answer, the VC commander decapitates the soldier beside him. Jefferson escapes moments later and unties Eastland. Eastland then kills the VC commander.\nThe film then shifts to New York, where Eastland and Jefferson work in a warehouse. One day, Eastland catches a group of thugs, called the Ghetto Ghouls, trying to steal beer. He is attacked, but Jefferson comes to his aid. They defeat the thugs, but the gang return to cripple Jefferson; by gouging his spine with a meathook. Feeling let down by the police, Eastland decides to take the law into his own hands, and interrogates one of the gang members with a flame thrower. He then attacks the gang's base of operations, shooting one gang member and leaving two others tied up in the basement, which is full of hungry rats.\nEastland's vigilante justice doesn't end there. The warehouse where he works has been forced into paying protection money. Gino Pontivini, the mob boss behind the scheme, has even taxed the workers paychecks. Eastland kidnaps Pontivini, and chains him above an industrial meat grinder. In order to steal Pontivini's money, Eastland needs to know how to get through any obstacles to the safe. Pontivini gives him his house keys, tells him which room the safe is in, and the combination to the safe, after being lowered dangerously close to the jaws of the meat grinder. Pontivini confirms that is all he needs to know to access the safe. Eastland barely survives an attack by Pontivini's Doberman, so upon returning, he lowers Pontivini into the grinder for lying about the dog. Jefferson and his family are given Pontivini's money; to help pay their bills.\nDetective James Dalton begins investigating the attacks, while the press dub Eastland the \"Exterminator\". Meanwhile, Eastland kills the ring leader of a child prostitution ring, as well as a state senator from New Jersey who sexually abuses children. He also kills a group of muggers, after witnessing them rob an elderly woman.\nMeanwhile, the CIA has heard of the Exterminator and reaches an odd conclusion. Based on the current administration's promise to cut down crime rates, they believe the Exterminator is either an opposition party's stunt, or a foreign power's ruse to humiliate the current administration; by exposing their inability to handle the city's crime problem. They monitor Dalton's investigation of the Exterminator. And Dalton, working from a bootprint found at Pontivini's home, discovers the Exterminator wears hunting boots manufactured by a mail order firm in Maine. Asking them for a list of clients in New York, and following the hunch that the Exterminator may be a Vietnam War veteran; since he killed the Ghetto Ghouls with an M-16 assault rifle, Dalton has narrowed his suspects accordingly.\nEastland visits Jefferson in the hospital, and because he will never be able to walk again, Jefferson asks Eastland to kill him. Eastland does, but coincidentally, Dalton is visiting the hospital at the same time. When he learns about Jefferson's death, Dalton surmises that one of Jefferson's friends was the Exterminator, and learns that one of his suspects, Eastland, was Jefferson's closest friend.\nEastland is aware that Dalton is staking out his apartment, so he arranges a private meeting with him, where he hopes to explain why he became a vigilante. However, the CIA are aware of the rendezvous after bugging Eastland's phone. They ambush him at his meeting with Dalton, which results in Dalton being killed while helping Eastland escape. And although he is presumed dead, Eastland survives, but in some territories, he dies as opposed to surviving."}