{"mid": "TheFaculty", "IMDB_id": "tt0133751", "title": "The Faculty", "plot": "One evening at Herrington High School in Ohio (home of the Hornets), several teachers and Principal Drake leave after discussing the school's budget. When Drake returns to retrieve her keys, Coach Willis becomes increasingly erratic and stabs a pencil through Drake's hand when she attempts to leave. Drama teacher Mrs. Olsen emotionlessly stabs Valerie with scissors as Drake flees the school.\nThe following morning, the students arrive, including Casey Connor, the dedicated but perpetually harassed photographer for the school newspaper. Connor is the unappreciated assistant to spiteful Delilah Profitt, the paper's editor-in-chief and head cheerleader. Delilah's mistreated boyfriend Stan Rosado is contemplating quitting the football team to pursue academics. Zeke Tyler is an intelligent yet rebellious student repeating his senior year. Tyler sells, among other illegal items, a powdery ecstasy-like drug he manufactures and distributes; he is confronted by Miss Elizabeth Burke, who expresses concern for him over his illegal activities. Naive transfer student Marybeth Louise Hutchinson, befriends self-styled outcast Stokely Mitchell. Delilah has spread rumors that Stokely is a lesbian though she has a crush on Stan. Marybeth develops a crush on Zeke.\nCasey notices a strange creature and takes it to science teacher Mr. Furlong, who believes it is a new species of cephalopod-specific parasite called a mesozoan. Delilah and Casey hide in the teachers' lounge to find a story. They witness Coach Willis and Ms. Olsen force one of the creatures into the ear of school nurse Ms. Harper. They also find the body of Mrs. Brummel. Casey and Delilah flee, and Casey calls the police. Principal Drake claims nothing is wrong and that Casey is seeking attention.\nThe next day, Casey tells Delilah, Stan and Stokely he believes the teachers are being controlled by aliens. After Zeke and Marybeth tease them about their theory, Mr. Furlong confronts them. Furlong suddenly becomes defensive and attempts to infect them. Zeke cuts off Furlong's fingers and injects his homemade drugs into Furlong's eye, apparently killing him. Zeke takes the five to his house, where he experiments on Casey's specimen. He discovers it needs water to survive and can be killed by his drugs. Zeke makes everyone take his drug to prove they are uninfected humans. Delilah is revealed as infected, and she destroys Zeke's lab and most of his drug supply before escaping.\nActing on Stokely's speculation that killing the alien queen will revert everyone to normal, the group returns to the school, where their football team is playing and infecting opposing players. Believing Principal Drake to be the queen, they isolate her in the gym and fatally shoot her. Stan confronts the coach and team to see if it worked but becomes infected. Zeke and Casey retrieve more of Zeke's drugs from his car. Casey leads infected students away from Zeke, who encounters Miss Burke in the parking lot and seemingly kills her while escaping.\nAt the gym, Stokely becomes suspicious of Marybeth during a conversation about pretending to be what one is not. Marybeth subsequently reveals herself to be the alien queen. Earlier on, she faked taking the drug. Casey and Stokely flee to the swimming pool, where Stokely is injured and becomes infected. Zeke and Casey hide in the locker room, where Marybeth reverts to her human disguise. She explains she is taking over Earth because her own planet is dying. Marybeth transforms back into her true form and hurls Zeke across the room into the lockers, knocking him out. Casey seizes the drug and tricks the queen into following him into the retracting bleachers, trapping her. Casey stabs the drug into the queen's eye. The queen infects Casey with her dying breath, but Casey almost immediately returns to normal upon her death. Casey returns to the locker room and finds Stokely and Zeke alive.\nOne month later, everyone has returned to normal. Stan and Stokely begin dating, and Zeke takes Stan's place on the football team (while Miss Burke affectionately watches him practice). Mr. Furlong has miraculously survived the attack, now sporting an eyepatch and bandages on his hand. Casey begins dating Delilah and is considered a local hero."}