{"mid": "TheFullMonty", "IMDB_id": "tt0119164", "title": "The Full Monty", "plot": "The once-successful steel mills of Sheffield, South Yorkshire, have shut down and most of the employees have been laid off. Former steel workers Gary \"Gaz\" Schofield and Dave Horsefall have resorted to stealing scrap metal from the abandoned mills to sell. Gaz is facing trouble from his former wife, Mandy and her boyfriend Barry over child support payments that he has failed to make since losing his job. Gaz's son, Nathan, loves his father but wishes they could do more \"normal stuff\" in their time together.\nOne day, Gaz spots a crowd of women lined up outside a local club to see a Chippendale's striptease act. He gets the idea to form his own strip tease group using local men in hopes of making enough money to pay off his child support obligations. The first to join the group is Lomper, a security guard at the steel mill where Dave and Gaz once worked. Depressed, Lomper attempts suicide, but is rescued by Dave who convinces him to join the group. Next, they recruit Gerald Cooper, their former foreman at the mill, who is hiding the fact that he is unemployed from his wife. Gaz and Dave see Gerald and his wife, Linda, at a dance class and recruit him to teach them some actual dance moves.\nThe four men hold an open audition to recruit more members and settle on Horse, an older man who is nevertheless a good dancer, and Guy, who can't dance but proves himself to be well-endowed. The six men begin to practice their act. Gaz then learns that he has to pay £100 in order to secure the club for the night. He cannot afford this, but Nathan gets the money out of his savings. When they are greeted by two local women while they put up posters for the show, Gaz boasts they're better than the real Chippendales because they go \"the full monty\". Dave drops out due to body image issues and gets a job as a security guard at Asda. The others do a public rehearsal at the mill in front of some female relatives of Horse, but are caught mid-show by a passing policeman, and Gaz, Gerald and Horse are arrested for indecent exposure.\nThis costs Gaz the right to see Nathan. Lomper and Guy manage to escape arrest, and go to Lomper's house where they look lovingly at each other, starting a relationship. Gerald, meanwhile is thrown out by Linda after bailiffs arrive at their house and seize their belongings to pay Gerald's debts, resulting in him having to stay with Gaz. Later Gaz goes to Asda and asks Dave if he could borrow a jacket for Lomper's mother's funeral. Dave agrees and also decides to quit his job and they go to the funeral together. Soon, the group find the act and arrest has made them famous.\nThey decide to forgo the plan, until Gaz learns that the show is sold out. He convinces the others to do it for one night only. Gerald is unsure as he has now got the job that Gaz and Dave earlier tried to sabotage his interview for, but agrees to do it just once. Initially, Dave still refuses, however re-gains his confidence after encouragement from his wife, Jean, and joins the rest of the group minutes before they go on stage. Nathan also arrives with Dave, having secretly come, and tells Gaz that Mandy is there but she would not let Barry go with her.\nHowever, Gaz himself refuses to do the act because there are men in the audience (including the police force members who watched the footage of the security camera's recording of them earlier), when the posters said it was for women only. The other five are starting the act when Nathan orders his father to go out on stage. Gaz, proud of his son, joins the others and performs in front of the audience and Mandy, who seems to see him in a new light.\nThe film ends with the group performing on stage in front of a packed house, stripping to Tom Jones' version of \"You Can Leave Your Hat On\" (their hats being the final item removed) with an astounding success."}