{"mid": "TheFirm", "IMDB_id": "tt0106918", "title": "The Firm", "plot": "Clive Bissel (nicknamed \"Bex\", or \"Bexy\") is a married man with a baby son. He is the leader of a hooligan firm known as the ICC (Inter City Crew). His wife no longer approves of his activities as a football hooligan, which contrast to his respectable job as an estate agent. Even when his baby son injures himself with a craft knife Bexy has carelessly left lying around, he is unwilling to give up violence as he admits it gives him a \"buzz\". Conversely, Bexy's father shows acceptance of his son's lifestyle, happily taking a group photograph of the 'tooled up' gang and boasting of similar activities in his own era. However, he feels that Bex and his friends have gone soft because they now use weapons and worry too much about strategy, instead of just getting on with fighting rival mobs.\nThe film begins with a rival gang called \"The Buccaneers\" vandalising Bexy's Ford Sierra XR4x4 and spraying graffiti in a football dressing room while Bexy and his mates are playing football. Bexy's arch nemesis and leader of the Bucaneeers Yeti then drives a white Volkswagen Golf GTi cabriolet across the football pitch.\nWith an imminent international football tournament in Holland, Bexy wants to form a 'National Firm' - comprising several rival gangs - big enough to take on the well organised and large international hooligan groups. Bexy meets leaders from other firms in the Tower Hotel in London, including the Buccaneers. The other gangs like the idea but don't like the idea of Bexy being top boy. The rival firms then agree to fight each other in order to determine who will lead the new, amalgamated firm into Europe.\nBex and his fellow hooligans only possess any kind of social status amongst their own groups, and Bex relishes being looked up to and admired by the younger men in his own firm. Bexy used his natural leadership qualities to cajole and encourage his peers, and uses intimidation to cement his position as leader of the ICC. These young men think of themselves as important, respected figures in their local community, but Bexy's wife tells him that the truth is somewhat different. Everyone thinks of him as a joke, she says, but because they fear his violent nature, few are willing to point out to him that he isn't the working class hero he thinks he is.\nThe ICC survive violent clashes with the other gangs but must still defeat the Buccaneers. Bexy is relishing the chance to defeat Yeti. Bexy beats up Yeti during the ICC's clash with the Buccaneers in a pub but is then shot dead by an injured Yeti. Just before being shot, Bexy expresses astonishment and disbelief Yeti has a gun and say's 'Oh, come on!' before Yeti pulls the trigger.\nThe closing scene depicts the surviving ICC members in a pub, honouring Bexy as a hero. They claim when they are fighting European firms at the forthcoming tournament, they will be doing so in memory of their dead leader. The hooligans from three different firms, who were fighting each other not long ago, agree that Bex was a visionary who brought them together giving him legendary status. The death of Bexy doing nothing to make them change their behaviour and they vow to continue."}