{"mid": "TheFinalCountdown", "IMDB_id": "tt0080736", "title": "The Final Countdown", "plot": "The USS Nimitz, one of the United States' largest aircraft carriers, is on maneuvers in the Pacific Ocean near Hawaii. The ship's captain, Yelland, oversees training flights of the ship's compliment of F14A Tomcat fighter jets. Also on the carrier is a reporter, Warren Lasky, who will be observing the Nimitz on its maneuvers.One of the ship's sonar crew notices a large and unusual storm approaching the Nimitz. When Yelland orders the ship's course to be changed, the storm follows. Yelland orders a red alert just before the storm overtakes them and swallows them. The Nimitz emerges from the storm unharmed and is able to land a stray F14 that went through as well. Yelland orders reports from all stations and the ship appears to be in perfect order. The radio operator of the boat receives strange broadcasts from Hawaii; they sound like classic radio from the pre-World War II era. Everyone is puzzled. A surveillance aircraft is sent up to take photos of Pearl Harbor. The ship's Wing Commander, Owens, who is also a World War II history expert, compares the shots to several from a book he has and he determines that they are nearly identical and that fleet in Pearl at the present moment was sunk by the Japanese Imperial Air Force nearly 40 years before.The ship's radar operator reports the presence of a small boat not far from the Nimitz. Yelland has two F14s launched to investigate. The nearby boat is a yacht, the personal boat of a popular United States Senator, Samuel Chapman and his personal assistant, Laurel Scott, whom are enjoying a day in the sun. They spot the two F14s as they speed over the boat, unable to comprehend the speed of the jets. The F14s are sent out to investigate another pair of radar contacts. When they arrive at the location, one pilot excitedly reports that the two contacts are World War II era Japanese \"Zero\" planes.A few minutes later, the Zeros fly over Chapman's boat. The Zeros suddenly execute sharp turns and open fire on the boat. Chapman, Scott and the yacht's other crewman all abandon ship, which explodes when the Zeros make another pass and again open fire. The pilots also strafe the survivors in the water, killing the crew member. The F14 pilots witness the attack but are under orders not to engage the Zeros. Yelland's XO has the F14 pilots make a supersonic run over the Zeros in an attempt to frighten them off. The Zeros open fire on the Tomcats; the American pilots are given permission to open fire and easily down both Zeros. A helicopter is dispatched from the Nimitz to pick up Chapman, Scott and one of the Zero pilots.Back on board the Nimitz the three survivors are sequestered belowdecks. Chapman, angry at being held against his will, is identified by Commander Owens. Owens determines that the storm that swallowed the Nimitz hours before has displaced the carrier in time and deposited them in the Pacific Ocean on December 6, 1941, one day before the Japanese sneak attack on Pearl Harbor.Owens also shares the story of Chapman himself; just prior to the Japanese attack, Chapman and Scott were both declared lost at sea under unsolved circumstances. Chapman himself was considered to be a strong contender to beat Franklin Roosevelt for the presidency of the United States. By interfering with the attack on Chapman's yacht, the presence of the Nimitz has altered history and Chapman's survival may severely disrupt the space-time continuum. Yelland is, of course, opposed to simply executing the Senator and orders him held until they can figure out how best to deal with the disruption they've started.Another, larger question arises: should the Nimitz, presumably unable to return to it's own time, and with it's superior armaments and aircraft, engage the Japanese fleet and air force and prevent the attack on Pearl Harbor? Yelland believes so and Owens and Lasky immediately object to Yelland's idea, stating that this type of interference in history could have very serious consequences, the most serious being that they could stop much of the Pacific fleet from being destroyed. Yelland grapples with the idea himself and determines that the Nimitz, bound by its loyalty to engage all enemies no matter the place or time, will participate in the battle.Meanwhile, the Japanese prisoner converses with a Japanese-speaking member of the Nimitz' crew and demands access to a radio to contact his own superiors. At one point, Chapman's Golden Retriever escapes from the room where his master is being held and runs into the room holding the Japanese pilot. The pilot is able to disarm a marine guard and seize his rifle, opening fire and killing a few crew members. He reiterates his demands through the translator and holds several people hostage, including Owens and Lasky. Owens is ordered by Yelland to tell the pilot that they are from the future, citing his knowledge of the names of the ships of the Japanese Imperial fleet nearby. The pilot is temporarily overwhelmed by the news and is distracted long enough for marines to move in and kill him.Yelland's intention of stopping the destruction of the American fleet at Pearl remains unchanged. As a safety precaution and the method best determined to restore the space-time continuum to normality, Chapman and Scott will be left on a nearby deserted island while the attack takes place. A helicopter takes them out, with Owens, to the island. Scott and Owens both jump out onto the sand, however Chapman seizes a flare pistol and demands to be flown back to Hawaii. A crew member tries to take the pistol, which goes off, causing the chopper to explode, killing Chapman and the crew. Owens and Scott are stranded.Back on the Nimitz, Yelland addresses his crew, telling them that they will engage the Japanese Air Force as they attack Pearl Harbor. However, before the Nimitz' strike force can be launched, the same sort of storm that propelled the Nimitz through time appears again. The ship is consumed again and delivered to the same spot and the same date and time where it was initially displaced. The Nimitz returns to Pearl Harbor and Lasky is met at the pier. The door of a nearby limousine opens and Senator Chapman's dog, still on the Nimitz when it was sent back into the future, jumps inside. Lasky gets in the limo and sees both Laurel Scott and Commander Owens, both aged nearly 40 years. Lasky is told by one of them that they \"have a lot to talk about.\""}