{"mid": "TheFlyingDeuces", "IMDB_id": "tt0031322", "title": "The Flying Deuces", "plot": "While on holiday in Paris, Ollie falls so much in love with Georgette, the beautiful daughter of an innkeeper, he intends to marry her. Unfortunately, she turns down his marriage proposal because there is someone else, \"very much so\". (Unbeknownst to him at the moment, a Foreign Legion officer named Francois is her husband, and has returned briefly to see her.) Ollie is heartbroken to the point of committing suicide. Just as he about to jump into a river (with Stan joining him), Francois, happening to catch sight of them about to do so, convinces the duo to enlist in the Foreign Legion in order to forget Ollie's failed romance. When Stan asks him how long it will take Ollie to forget, should they join the Foreign Legion, Francois points out it will only take a matter of a few days. Enticed by Francois's offer, plus the fact that Ollie will completely forget his failed romance very shortly, they enlist.\nRight from the start they wreak havoc in training camp, and when they are taken to see the commandant to be introduced to their daily legionnaire duties, he gives them a full litany of long tasks, for which their daily wage is 100 centimes, which, translated into American currency amounts to only three cents. Hardy flatly tells the commandant neither he nor Stan will have any part of it for only three cents a day, to which Stan concurs that they don't work for less than 25 cents a day. For this uppity attitude they are sentenced to very menial hard labor, washing and ironing a mountain of laundry, with legion officers constantly on their backs (\"Go ON!! Get back to WORK!!! Whaddya think this IS?!!\"). Finally and 'miraculously', Ollie manages to forget his broken romance completely, (thus no longer having to work in the legion) and, his and Stan's purpose in joining the Foreign Legion fulfilled, they prepare to leave the legion and go back home to the United States...but before they do, fed up with the harsh discipline and the endless punishments they had to suffer, Ollie intends to tell off the commandant on their way out. They are unable to find the commandant and unwilling to search for him. So Ollie writes him a very insulting farewell letter and signs it.\nBefore long they meet Georgette again, and Ollie is at first delighted that she has changed her mind and come back to him and proceeds to embrace and kiss her. Ollie, however, becomes un-delighted by Francois, the same Foreign Legion officer who had encouraged them to join the Legion earlier, who icily informs him that Georgette happens to be his wife and threateningly warns him to stay away from her, or else. After Francois leaves, the commandant appears on the scene and grimly tells Stan and Ollie he received their stern farewell note, and it has now become their death warrant. He then pronounces them under arrest for desertion. They are then taken to the prison, locked up and summarily sentenced to be shot at dawn. At one point the jailor forgets to lock the door. Stan amazes Ollie by playing The World Is Waiting for the Sunrise on the bedsprings. As he is about to play another piece, the jailor yells at them to be quiet. Later in the evening, someone throws a hint informing them that they can escape by means of a tunnel leading from their cell to the outside wall. Stan brings on an accidental cave-in which causes the underground path to lead to, of all places, Francois and Georgette's dwelling. In no time at all, the whole legion engages in hot pursuit of the boys, who manage to flee to a nearby hangars and hide out in an airplane, which Stan accidentally starts up, forcing the boys to fly it until it ultimately crashes. Stan manages to emerge seemingly unharmed from the crash, but Ollie has died, seen ascending into the heavens, complete with wings. Eventually, however, he is reincarnated (earlier in the film, the duo contemplated being reincarnated) as a horse (complete with mustache and hat), which pleases Stan. In the final seconds of the film, Ollie makes his famous remark, \"Well, here`s another nice mess you`ve gotten me into\"."}