{"mid": "TheFirstWivesClub", "IMDB_id": "tt0116313", "title": "The First Wives Club", "plot": "At Middlebury College in 1969, four young friends, Annie MacDuggan, Elise Elliot, Brenda Morelli, and Cynthia Swann, are graduating. As graduation gifts, valedictorian Cynthia presents the girls with matching Bulgari pearl necklaces. As the graduates take a commemorative picture of the four of them (presumably for the last time), Cynthia makes Annie, Brenda and Elise promise that they will always be there for each other throughout the remainder of their lives.\nIn the present time, the four friends eventually lose touch with one another, as evident when Cynthia (Stockard Channing) is tearfully gazing at the picture of the four of them on that graduation day. Now wealthy and living in a luxurious penthouse, she gives her maid her own Bulgari pearl necklace (matching the three she gave to her friends on graduation day), and has the maid mail letters to them. She later walks outside of the balcony of her penthouse in a floor length fur coat, a cigarette and a drink, and then commits suicide by jumping to her death after learning through the tabloids that her ex-husband Gil (whom Cynthia made wealthy through her connections, according to narrator Annie) married his much younger mistress the day before.\nHer former friends aren't doing much better: Annie (Diane Keaton), meanwhile, is separated, suffering extreme self-esteem issues, and going through therapy with her husband. Brenda (Bette Midler) is divorced, left for a younger woman, depressed, and struggling financially. Elise (Goldie Hawn), whose husband also left her for a younger woman, is now an aging alcoholic movie actress who has become a plastic-surgery addict to keep her career afloat. Shortly after Cynthia's funeral, at which the three remaining friends are reunited for the first time since college, Annie's husband, Aaron (Stephen Collins), leaves her for her younger therapist (Marcia Gay Harden) and asks her for a divorce after spending a night together (and leading Annie to believe it would reconcile them); Brenda has a rather unpleasant encounter at a clothing store with her ex, Morty (Dan Hedaya) and his younger and rather hateful mistress Shelly (Sarah Jessica Parker), and Elise finds out that her soon-to be ex-husband, Bill (Victor Garber), is requesting alimony and half of their marital assets claiming that Elise owes her fame to him. Also, during a meeting with a director for a possible leading lady movie role, she discovers that she is only to play the lead female's mother; she later learns the lead female is Bill's current girlfriend. Shortly thereafter, the three friends receive the letters that Cynthia mailed to them before her suicide. After each one reads her letter from Cynthia, and feeling that they have been taken for granted by their husbands, the women decide to create the First Wives Club, aiming to get revenge on their exes. Annie's lesbian daughter Chris (Jennifer Dundas) also gets in on the plan by asking for a job at her father's advertising agency so she can supply her mother with inside information, as payback for Aaron's unfairness toward Annie.\nBrenda finds out through her uncle Carmine (Philip Bosco) who has Mafia connections that Morty is guilty of income tax fraud, while Annie makes a plan to revive her advertising career and buy out Aaron's partners. However, as their plan moves through, things start to fall apart when they find out that Bill has no checkered past and nothing for them to use against him. Elise, feeling sorry for herself, gets drunk which only results in her and Brenda hurling vicious insults at each other, and the women drift apart. When Annie starts thinking about closing down the First Wives Club, her friends come back, saying that they want to see this to the end and Bill hasn't done anything blatantly wrong, but only as far as he knows. As a result, the wives manage to uncover information revealing that Bill's mistress (Elizabeth Berkley) is actually a minor.\nDeciding that revenge would make them no better than their husbands, they instead use these situations to push their men into funding the establishment of a nonprofit organization dedicated to aiding abused women, in memory of their college friend Cynthia. The film ends with a celebration at the new Cynthia Swann Griffin Crisis Center for Women. Annie narrates that Elise started a relationship with a cast member in her new, successful play, that Brenda and Morty reconciled their differences and got back together, and that when Aaron tried to get back together with her, Annie told him to \"drop dead\". While outside the center Bill meets Shelly and the two start to flirt. The film concludes with the three women joyfully singing Lesley Gore's hit \"You Don't Own Me\". This sequence was choreographed by Patricia Birch and her assistant choreographer was Jonathan Cerullo."}