{"mid": "TheFourthProtocol", "IMDB_id": "tt0093044", "title": "The Fourth Protocol", "plot": "On New Year's Eve 1986, professional thief Jim Rawlings breaks into the apartment of a senior civil servant, and inadvertently discovers stolen top secret documents. Despite being one of the most notorious thieves in London, he is enough of a patriot to anonymously send the documents to MI5 so that they might locate the traitor.\nIn Moscow, British defector Kim Philby drafts a memorandum for the Soviet General Secretary stating that, if the Labour Party wins the next general election in the United Kingdom (scheduled for sometime in the subsequent eighteen months), the \"hard left\" of the party will oust the moderate populist Neil Kinnock in favour of a radical new leader who will adopt a true Marxist-Leninist manifesto, including the expulsion of all American forces from the United Kingdom and the country's withdrawal from and repudiation of NATO. In conjunction with a GRU general, an academic named Krilov, and a master strategist, Philby devises \"Plan Aurora\" to ensure a Labour victory by exploiting the party's support for unilateral disarmament—although it is noted that the strategist, a nuclear physicist and chess Grand Master, has come up with most of the plan's strategy.\nJohn Preston, an ex-Parachute Regiment soldier-turned-MI5 officer, who was exploring hard-left infiltration of the Labour party, investigates the stolen documents and finds that they were leaked by George Berenson, a passionate anti-communist and supporter of South Africa. Berenson passed on the documents to Jan Marais, a man he believes is a South African diplomat, but is in fact a Soviet false flag agent. SIS chief Sir Nigel Irvine eventually confronts Berenson with the truth and \"turns\" him, using him to pass disinformation to the KGB.\nAs part of Plan Aurora, Soviet agent Valeri Petrofsky arrives under deep cover in the United Kingdom and sets up home in Ipswich. From there, he travels around the country collecting packages from various couriers who have smuggled them into the country either hidden, or disguised as harmless-looking items.\nOne of the couriers, disguised as a sailor, is attacked by 'Neds' in Glasgow and taken to hospital, where he commits suicide rather than submit to questioning. Preston investigates and finds three out-of-place looking metal discs in a tobacco tin in his gunny sack. He shows the discs to a metallurgist who identifies the outer two as aluminium but the other as polonium, a key element in the initiator of an atomic bomb. Preston reports his findings to his antagonistic MI5 superior, who ignores them and has Preston taken off the politically embarrassing case. Irvine, however, suspects that a major intelligence operation is under way, and has Preston work unofficially for him to search for other Soviet couriers. Simultaneously, he uses Berenson to pass a deliberate piece of disinformation to the KGB.\nIn Moscow, the director of operations for the KGB, General Karpov, discovers Aurora's existence. He identifies that the general secretary is responsible, and blackmails Krilov into revealing the plan: in contravention of the Fourth Protocol, the component parts of a small atomic device are to be smuggled into the United Kingdom, to be assembled and exploded near RAF Bentwaters a week before the general election. Substantial evidence will be left that the explosion was an accidental detonation of an American weapon, leading to a wave of anti-Americanism, support for unilateral disarmament and for the only major party committed to disarmament, the Labour Party. The day after they win the election, the hard left will take over and begin to dismantle the Western alliance in Europe.\nMeanwhile, Preston tries in vain to uncover other couriers connected to the operation. A month into the investigation, a bumbling Czechoslovakian agent, originally mistaken for an Austrian, under the name Franz Winkler arrives at Heathrow with a forged passport and is shadowed to a house in Chesterfield. Preston's patience is rewarded when Petrofsky shows up to use the radio transmitter that is located there. He trails Petrofsky to his rented house, where the bomb has been assembled. An SAS team is called in to storm the house, and manages to wound Petrofsky before he can detonate the bomb. Defying Preston's express wishes, the leader of the SAS team shoots the Soviet agent in the head during the raid. Before dying Petrofsky manages to say one last word: “Philby”.\nPreston confronts Irvine with his theory that the operation was deliberately blown by Philby; the latter did not know Petrofsky's location but instead sent Franz Winkler, with an obviously false passport, to the location of the transmitter, and ultimately, to Petrofsky. Irvine admits to sabotaging the KGB's British operation by leaking disinformation through Berenson to General Karpov that they were closing in on their suspect. In turn, Karpov (and not Philby) sent Winkler, sabotaging Plan Aurora. By sending Winkler, Karpov has thwarted a British publicity victory as Irvine understood the implication that Petrofsky must not be captured alive or exposed in the media.\nAt the novel's end, Preston's MI5 superior and adversary is denied a senior leadership role because of his misjudgment in the case, and subsequently resigns from MI5 altogether. Preston also resigns but, through Irvine, finds lucrative private-sector employment that enables him to obtain full custody of his son. Marais is taken into custody by South African intelligence and Berenson's work is left unusable to the KGB, as Irvine intends to use his own spy network and plant the suspicion that Berenson was in fact a double agent, so that his information will be considered suspect."}