{"mid": "TheFifthElement", "IMDB_id": "tt0377917", "title": "The Fifth Element", "plot": "In 1914, aliens known as Mondoshawans arrive at an ancient Egyptian temple to collect, for safekeeping concerning World War I, the only weapon capable of defeating a great evil that appears every 5,000 years. The weapon consists of four stones, containing the energies of the four classical elements, and a sarcophagus containing a fifth element in the form of a human, which combines the power of the other four elements into a divine light capable of defeating the evil. The Mondoshawans promise their human contact, a priest from a secret order, that they will come back with the element stones in time to stop the great evil when it returns.\nIn 2263, the great evil appears in deep space in the form of a giant ball of black fire, and destroys an attacking Earth spaceship. The Mondoshawans' current contact on Earth, priest Vito Cornelius, informs the President of the Federated Territories of the history of the great evil and the weapon that can stop it. As the Mondoshawans return to Earth they are ambushed by Mangalores, a race hired by the industrialist Jean-Baptiste Emanuel Zorg, who has been directed by the great evil (sending messages as “Mister Shadow”) to acquire the stones.\nThe Mondoshawans' spacecraft is destroyed, though the stones are not on board; the only item recovered is a hand of The Fifth Element. Scientists take it to a New York City laboratory and use it to reconstruct a powerful humanoid woman who takes the name Leeloo. Terrified of the unfamiliar surroundings, she breaks out of confinement and jumps off a high ledge, crashing into the flying taxicab of Korben Dallas, a former major in the special forces.\nDallas delivers Leeloo to Cornelius and his apprentice, David, whereupon Cornelius learns that the Mondoshawans entrusted the four element stones to the alien Diva Plavalaguna, an opera singer. Zorg kills many of the Mangalores because of their failure to obtain the stones, but their compatriots determine to seize the artifacts for themselves. Upon learning from the Mondoshawans that the stones are in Plavalaguna's possession, General Munro, Dallas' former superior, recommissions Dallas and orders him to travel undercover to the planet Fhloston to meet Plavalaguna on a luxury cruise; Dallas takes Leeloo with him. Meanwhile, Cornelius instructs David to prepare the ancient temple designed to house the stones, then stows away on the space plane transporting Dallas to the cruise liner.\nPlavalaguna is killed when the Mangalores attack the cruise ship, but Dallas succeeds in retrieving the stones from the Diva. During his struggle with the Mangalores he kills their leader. Meanwhile, Zorg shoots and seriously wounds Leeloo, before finding a carrying case that he presumes contains the stones and takes it back to his spacecraft, leaving behind a time bomb that forces the liner's occupants to evacuate. Discovering the case to be empty, Zorg returns to the ship and deactivates his bomb, but a dying Mangalore sets off his own device, destroying the ship and killing Zorg. Dallas, Cornelius, Leeloo, and talk-show host Ruby Rhod escape with the stones aboard Zorg's spacecraft.\nThe four join up with David at the weapon chamber in the Egyptian temple as the great evil approaches. They arrange the stones and activate them with their corresponding elements, but having witnessed and studied so much violence, Leeloo has become disenchanted with humanity and refuses to cooperate. Dallas confesses his love for Leeloo and kisses her. In response, Leeloo combines the power of the stones and releases the divine light on the great evil and destroys its power, causing the planet to be proclaimed dead by Earth scientists as it becomes another moon in Earth orbit."}