{"mid": "TheFan", "IMDB_id": "tt0116277", "title": "The Fan", "plot": "Gaurav Chandana (Shah Rukh Khan) is a Delhi-based die-hard and obsessive fan of Bollywood superstar Aryan Khanna (also Shah Rukh Khan); Aryan is Gaurav's whole life. Gaurav's face bears an uncanny similarity to Aryan's, which helps him win the local talent show competition impersonating Aryan. He then embarks on a journey to meet Aryan in person.\nWhen Sid Kapoor (Taher Shabbir Mithaiwala), a fellow actor, expresses harsh sentiments about Aryan to the press, Gaurav gets furious and invades Sid's cabin. He holds him hostage, beats him, and makes him apologise to Aryan while he records it. The video is uploaded to the internet, where Aryan sees it. He considers Gaurav's actions a crime and gets Gaurav arrested. In jail, Gaurav is mercilessly beaten, and Aryan comes to meet him. Gaurav is delighted, but Aryan angrily reprimands him and declares that Gaurav is not his fan. He reveals that he was the one who got Gaurav arrested, and tells him to forget they ever met. Shattered and disillusioned, Gaurav returns home and burns all of his Aryan memorabilia, vowing to get revenge against Aryan for turning his fan away.\nOne year later in London, Gaurav heads to Madame Tussauds wax museum, impersonating Aryan and purposely creating a havoc situation in which he triggers the police. The real Aryan is then arrested despite declaring that he is innocent. Aryan is bailed out and departs to Dubrovnik for a show. He gets a call from Gaurav, who warns him to apologise or he will destroy Aryan's stardom. Gaurav disguises himself as a crew-member to get into Aryan's show; though Aryan instructs his personnel to look out for him, they fail to catch him.\nAryan is next scheduled to perform at a billionaire’s wedding. Gaurav poses as Aryan and molests the billionaire's daughter. The billionaire berates the real Aryan and makes him leave the event. Outside, Aryan spots Gaurav and gives chase, though Gaurav escapes. The molestation incident gets all over the news, resulting in a tarnished reputation and fans boycotting Aryan's shows. In a press conference, Aryan explains that someone else is impersonating him and asks for time so he can prove his innocence.\nBack in India, Gaurav invades Aryan’s home and vandalises his trophy collection. Aryan visits Gaurav's parents and meets Neha, Gaurav's crush. He then devises a plan to impersonate Gaurav and declare his love to Neha at the local talent show. This provokes Gaurav, who shoots at Aryan with a gun. Aryan chases him and subdues Gaurav after a bloody fight. He asks Gaurav to stop this and live his own life. Gaurav says that his life is nothing without Aryan and flings himself off the roof, dying with a smile. A horrified Aryan watches him fall.\nAryan’s name is cleared from all the controversies, but the ordeal still haunts him. On his next birthday, when he goes out to the roof to greet his fans, Aryan sees a hallucination of Gaurav smiling up at him."}