{"mid": "TheFootballFactory", "IMDB_id": "tt0385705", "title": "The Football Factory", "plot": "Tommy Johnson (Danny Dyer) is a member of a violent Chelsea hooligan firm. His friends and fellow hooligans include Tommy's best friend Rod King (Neil Maskell), the hot-tempered Billy Bright (Frank Harper), and impulsive younger members Zeberdee (Roland Manookian) and Raf (Calum MacNab). Tommy spends his days drinking, using drugs, womanising and fighting, much to the disappointment of his grandfather Bill Farrell (Dudley Sutton), a pensioner and veteran who plans to move to Australia with his best friend Albert (John Junkin).\nTommy has an epiphany about his lifestyle during a fight with the Tottenham hooligan firm. Tommy, Billy and Rod are arrested for assaulting two Stoke City fans whilst travelling to an away match. These actions draw the fury of Harris (Tony Denham), the leader of the Chelsea firm, whose attempts to keep order are thwarted by Billy's aggressive outbursts.\nRod begins a relationship with Tamara (Sophie Linfield), the court clerk at their arraignment, and she pressures him to skip his weekend meets. Zeberdee and his friend Raff accidentally burgle Billy's house and are forced to stand in his living room, whilst Billy's children throw darts at them. Billy deals with his increasing loneliness after he overhears Harris discussing his irrelevance. Bill's plan to retire to Australia are postponed when Albert dies the night before they are to leave.\nEarly in the film, Tommy is caught and held hostage by the brother of Shian (Michele Hallak), a girl he picked up at a club. He is saved when Rod hits the man on the head with a cricket bat. Sian's brother turns out to also be the brother of the rival Millwall firm's leader, Fred (Tamer Hassan), who then hunts Tommy down throughout the entire film. The film culminates in a pitched battle between the Chelsea and Millwall firms. Rod (after a few espressos and a line of cocaine), leaves a dinner with Tamara's parents after offending them, and attends the \"meet\". Tommy is severely beaten by Fred and a group of Millwall hooligans, and ends up in the hospital with Bill, who, in the meantime, has suffered a heart attack.\nA recurring sub-plot concerns a racist taxi driver (Jamie Foreman), whom the characters encounter at various points throughout the film.\nAt the end of the film, Tommy decides that his place is at the firm with his friends, Bill moves to Australia and Billy Bright is incarcerated for seven years after being arrested at the Millwall meet (ironically, whilst saving Harris from being arrested). Zeberdee is killed by a drug dealer whom he had previously mugged, fulfilling a recurring bad dream that tormented Tommy throughout the film."}