{"mid": "TheFlintstones", "IMDB_id": "tt0053502", "title": "The Flintstones", "plot": "In Bedrock, Slate and Co. executive vice-president Cliff Vandercave and secretary Miss Sharon Stone discuss their plan to swindle the company of its vast fortune and flee, and that they need one of their employees to be responsible for it. Fred Flintstone loans his best friend and neighbor Barney Rubble money so that he and his wife Betty can adopt a child named Bamm-Bamm, who can only pronounce his own name. Although the child is initially difficult to control due to being raised by mastodons, as well as having super strength, he eventually warms up to his new family. Barney vows to repay his friend. Despite his mother-in-law Pearl Slaghoople's objections, Fred's wife Wilma remains supportive of his decision.\nCliff holds an aptitude test, where the worker with the highest mark will become the new vice president of the company. Barney gets the highest score but he switches his paper with Fred, who he knows will fail. Fred receives the promotion, but his first order is to dismiss Barney, since Barney now effectively has the lowest score. Fred accepts, but does his best to help Barney support his family, even inviting the Rubbles to live with them so that they can rent out their home. However, Fred's job and newfound wealth put a strain on his relationships with Wilma and the Rubbles. Cliff eventually tricks Fred into dismissing the workers, over the objections of his office Dictabird. Later, Barney confronts Fred after seeing worker riots on the news revealing that he switched tests with Fred and the Rubbles move out, despite having nowhere to live. Wilma and Pebbles also move out to her mother's house, leaving Fred behind.\nFred goes to the quarry and realizes his mistake and Cliff's plan, but also finds out that Cliff has manipulated events to make it look as if Fred stole the money, and has reported it to the police. A manhunt for Fred ensues by the police and the workers. Wilma and Betty see this on the news, and break into Slate and Co. to get the Dictabird, the only witness who can clear Fred's name, unaware that Cliff saw them from his office window. As Fred attempts to enter a cave where the workers are seeking refuge, they see through his disguise and attempt to hang him. Barney is almost hanged as well after he admits his part. Fred and Barney reconcile, but before they can be hanged, Wilma and Betty arrive with the Dictabird, who tells them the true story. The workers release Fred and Barney after realizing that Cliff was the one who fired them.\nCliff kidnaps Pebbles and Bamm-Bamm and demands the Dictabird in exchange for the children's safe return. Fred and Barney confront Cliff at the quarry, where Cliff has tied Pebbles and Bamm-Bamm to a huge machine. Though they hand him the Dictabird, Cliff activates the machine to stall them. Barney rescues the children while Fred destroys the machine. The Dictabird escapes from Cliff and lures him back to the quarry, where Miss Stone knocks him out, having had a change of heart after learning that Cliff was planning to betray her. The police arrive and Cliff attempts to flee, but he is petrified by a substance falling from the machine.\nWith the Dictabird's help, all charges against Fred are dropped, while Miss Stone is arrested as Cliff's accomplice, though Fred is confident she will be granted leniency for helping them stop Cliff. Impressed with the substance that Fred inadvertently created by destroying the machine, Mr. Slate dubs the substance \"concrete\" and makes plans to produce it with Fred as the president of its division, thus ending the Stone Age. Having realized the negatives of his wealth and status as a vice president, Fred declines and asks that the workers be rehired and given the job benefits he initially set out to achieve, which is granted. As the Flintstones and Rubbles have finally made amends, Fred and Barney get into a humorous quarrel when Fred once again asks Barney for a small amount of money for breakfast."}