{"mid": "TheFortuneCookie", "IMDB_id": "tt0060424", "title": "The Fortune Cookie", "plot": "CBS cameraman Harry Hinkle (Jack Lemmon) gets injured when football player Luther \"Boom Boom\" Jackson (Ron Rich) of the Cleveland Browns runs into him while he is running a hand-held sideline camera during a home game at Municipal Stadium. Harry's injuries are minor, but his conniving lawyer brother-in-law William H. \"Whiplash Willie\" Gingrich (Walter Matthau) convinces him to pretend that his leg and hand have been partially paralyzed, so they can receive a huge indemnity from the insurance company. Harry reluctantly goes along with the scheme because he is still in love with his ex-wife, Sandy (Judi West), and being injured might bring her back.\nThe insurance company lawyers at O'Brien, Thompson and Kincaid (Harry Holcombe, Les Tremayne, and Lauren Gilbert) suspect that the paralysis is a fake. All but one of their medical experts say that it is real, convinced by the remnants of a compressed vertebra Hinkle suffered as a child, and Hinkle's responses, helped by the numbing shots of novocaine Gingrich has had a paroled dentist (Ned Glass) give him. The one holdout, German Professor Winterhalter (Sig Ruman), is convinced that Hinkle is a fake.\nWith no medical evidence to base their case on, O'Brien, Thompson and Kincaid hire Cleveland's best private detective, Chester Purkey (Cliff Osmond), to keep Hinkle under constant surveillance. However, Gingrich sees Purkey entering the apartment building across the street and lets Hinkle know they are being watched and recorded – and after Sandy returns, warns him not to indulge in any hanky-panky with her. Knowing now that he has a way to feed the insurance company lawyers misinformation, through the watching P.I.s, he incorporates the \"Harry Hinkle Foundation\", a non-profit charity to which all the proceeds of any settlement are to go, above and beyond actual medical expenses. When Sandy questions Gingrich about this in private, he tells her that it's just a scam to put pressure on the insurance company to settle, and that there will be enough money in the settlement for everyone to get some.\nHinkle begins to enjoy having Sandy back again, but he also starts to see how Boom-Boom's guilt over the accident is affecting him, especially when he is booed by the fans for his lackluster performance on the field, and then grounded by the team for getting drunk and involved in a bar fight. Hinkle wants Gingirch to help out Boom-Boom by representing him, but, to Hinkle's displeasure, Gingrich says he is too busy negotiating with O'Brien, Thompson & Kincaid. Hinkle also finds out that Sandy is back by his side strictly out of greed, to get enough money to put on a first class singing act and play the Persian Room.\nHinkle shows up with the $200,000 settlement check, and shouts up from the street to Purkey that the game is over. When Gingrich brings the check upstairs, Hinkle is distressed by the avaricious behavior of Sandy. Meanwhile, Purkey has a plan to get Hinkle to break down: he shows up at the apartment to collect his hidden microphones, and while he is there begins to make racist remarks about Boom-Boom and \"our black brothers\" getting out of hand. Hinkle, incensed, jumps up out his wheelchair and decks Purkey, who gets up and yells across the street to his assistant Max (Noam Pitlik) to find out if he got the shot. Told that he's not sure because \"It's a little dark\", Hinkle asks Purkey if he'd like a second take, turns on a light and advises the cameraman how to set his exposure. He then punches Purkey again, and follows up by going on a tear around the apartment, swinging from curtain rods and bouncing on the bed, all to show that he is not actually injured. Sandy is crawling on the floor looking for her lost contact lens, and just before he leaves the apartment, Hinkle roughly pushes her down to the ground with his foot.\nPurkey is packing up his equipment to leave, but Gingrich tell him to keep rolling, and launches into a speech about his having no idea that his client (Hinkle) was deceiving him, but announcing his intention of suing the insurance company lawyers for invasion of privacy, and reporting Purkey's racist remarks to various organizations. As he proceeds, a crunching sound lets him know that he's just stepped on Sandy's contact lens.\nHinkle drives to the football stadium where he meets Boom-Boom sitting on the bench on the field, ready to leave the team, and perhaps become a wrestler named \"The Dark Angel\". Hinkle manages to snap Boom-Boom out of his funk, and the two run down the fields passing and lateraling a football back and forth between them."}