{"mid": "TheFrenchLieutenantsWoman", "IMDB_id": "tt0082416", "title": "The French Lieutenant's Woman", "plot": "Set in the mid-nineteenth century, the narrator identifies the novel's protagonist as Sarah Woodruff, the Woman of the title, also known as \"Tragedy\" and as \"The French Lieutenant's Whore\". She lives in the coastal town of Lyme Regis as a disgraced woman, supposedly abandoned by a French ship's officer named Varguennes who had returned to France and married. She spends some of her limited free time on The Cobb, a stone jetty where she stares out the sea.\nOne day, Charles Smithson, an orphaned gentleman, and Ernestina Freeman, his fiancée and a daughter of a wealthy tradesman, see Sarah walking along the cliffside. Ernestina tells Charles something of Sarah's story, and he becomes curious about her. Though continuing to court Ernestina, Charles has several more encounters with Sarah, meeting her clandestinely three times. During these meetings, Sarah tells Charles of her history, and asks for his emotional and social support. During the same period, he learns of the possible loss of place as heir to his elderly uncle, who has become engaged to a woman young enough to bear a child. Meanwhile, Charles's servant Sam falls in love with Mary, the maid of Ernestina's aunt.\nIn fact, Charles has fallen in love with Sarah and advises her to leave Lyme for Exeter. Returning from a journey to warn Ernestina's father about his uncertain inheritance, Charles stops in Exeter as if to visit Sarah. From there, the narrator, who intervenes throughout the novel and later becomes a character in it, offers three different ways in which the novel could end:\nFirst ending: Charles does not visit Sarah, but immediately returns to Lyme to reaffirm his love for Ernestina. They marry, though the marriage never becomes particularly happy, and Charles enters trade under Ernestina's father, Mr. Freeman. The narrator pointedly notes the lack of knowledge about Sarah's fate. Charles tells Ernestina about an encounter which he implies is with the \"French Lieutenant's Whore\", but elides the sordid details, and the matter is ended. The narrator dismisses this ending as a daydream by Charles, before the alternative events of the subsequent meeting with Ernestina are described. Critic Michelle Phillips Buchberger describes this first ending as \"a semblance of verisimilitude in the traditional 'happy ending'\" found in actual Victorian novels.\nBefore the second and third endings, the narrator appears as a character sharing a railway compartment with Charles. He tosses a coin to determine the order in which he will portray the other two possible endings, emphasising their equal plausibility. They are as follows:\nSecond ending: Charles and Sarah have a rash sexual encounter in which Charles realises that Sarah was a virgin. Reflecting on his emotions during this, Charles ends his engagement to Ernestina, and proposes to Sarah through a letter. Charles's servant Sam fails to deliver the letter and, after Charles breaks his engagement, Ernestina's father disgraces him. His uncle marries and his wife bears an heir, ensuring the loss of the expected inheritance. To escape the social suicide and depression caused by his broken engagement, Charles goes abroad to Europe and America. Ignorant of Charles' proposal, Sarah flees to London without telling her lover. During Charles' trips abroad, his lawyer searches for Sarah, finding her two years later living in the Chelsea house of the painter and poet Dante Gabriel Rossetti, where she enjoys an artistic, creative life. Sarah shows Charles the child of their affair, leaving him in hope that the three may be reunited.\nThird ending: The narrator re-appears outside the house at 16 Cheyne Walk and turns back his pocket watch by fifteen minutes. Events are the same as in the second-ending version until Charles meets Sarah, when their reunion is sour. The new ending does not make clear the parentage of the child and Sarah expresses no interest in reviving the relationship. Charles leaves the house, intending to return to the United States, wondering whether Sarah is a manipulative, lying woman who exploited him."}