{"mid": "TheFirstDeadlySin", "IMDB_id": "tt0080738", "title": "The First Deadly Sin", "plot": "The film opens outside Mount Pleasant Baptist Church on West 81st Street in Manhattan. A man is viciously attacked by another man wielding an ice axe. The attack is intercut with graphic closeups of a woman undergoing surgery. The NYPD arrive to process the scene. The coroner, Dr. Ferguson (Whitmore), shows Detective Edward Delaney (Sinatra) that the fatal wound on the skull was made with a round object.\nMeanwhile, the 20th Precinct receives news that Delaney's wife Barbara (Dunaway) is recovering from emergency surgery. The information is relayed to Delaney at the scene, and he rushes to the hospital. Barbara's surgeon, Dr. Bernardi (Coe), explains that complications from her kidney stones forced him to remove the organ. Over the course of the film, Barbara's condition worsens, and Delaney harbors deep suspicions that Bernardi is incompetent.\nThe murder on 81st Street is a kind of solace for Delaney. Much to his colleagues' surprise, he throws himself into the case, despite constant admonitions from his friends and supervisors that the NYPD's priorities are elsewhere. One of his first visits is to the Metropolitan Museum of Art, where he consults with Arms and Armor curator Christopher Langley (Gabel) about the type of weapon that could make such a unique wound. The elderly Langley is thrilled to have such a unique problem to solve, and he devotes a great deal of time to research.\nThe angle of entry and the perfectly spherical nature of the wound rule out most of the weapons familiar to Langley. He decides the weapon must have been some kind of tool, and he visits a hardware store, where he explicitly asks for the best implement to kill someone with. A bemused clerk helps Langley deduce that the weapon was most likely an ice axe.\nDelaney has discovered that a similar attack had occurred recently on West 79th Street. After consulting with the perpetually harried Ferguson, he discovers that the wound patterns are nearly identical. As they investigate, they realize that similar attacks have been taking place all over New York City. Langley uses the new information to locate the exact model of ice axe that would cause such injuries. At one sporting goods store, the owner hands over the addresses that he collected from every customer who bought that ice axe. The addresses eventually lead Delaney to the highrise building of Daniel Blank (Dukes).\nBlank has been seen intermittently throughout the film cleaning up after his murders. As Delaney closes in on him, Blank attempts one more attack, but it does not go as planned. After striking several blows, his victim escapes only to be run over by a passing car. Delaney's investigation of Blank confirms that he is the killer. Delaney realizes that his chances of arresting and obtaining a murder conviction against Blank are slim due to Blank's wealth and high social position in the city. Before going to confront Blank in his luxury apartment Delaney gets a Luger nine millimeter pistol from a closet in his home. It is a souvenir that Delaney brought home as a soldier returning from World War Two.\nDelaney finds Blank curled up in a closet in a deeply disturbed state. He confesses to his crimes before composing himself. Blank brags about how respectable and well-connected he is, and he guarantees that he will get away with his crime. He confidently goes to the phone to report Delaney for breaking and entering. Delaney shoots Blank in the head with the Luger pistol as Blank is speaking with the police operator on the telephone. Delaney goes to his office at the police precinct station house and retires from the police department. As he is leaving the station house the desk sergeant tells him of the discovery of Blank's body and asks him if he want to respond to the call. Delaney informs the sergeant that he has just retired as he walks out of the building. The film ends with Delaney reading to his wife in the hospital as she passes away. He cries as she dies in his arms."}