{"mid": "TheFury", "IMDB_id": "tt0077588", "title": "The Fury", "plot": "The movie opens with a scene on the beach with bikini clad women everywhere. A U.S. agent, Pete Sandza (Kirk Douglas) is watching the beach as it is suddenly attacked by Islamist terrorists. His son Robin is watching as his dad gets armed and fires back. Thinking his father was killed in an explosion, the son is taken away. Later, on a different beach, more women are walking around in bikinis. Two of them are students studying as a strange older man name Raymond follows them. Gillian is psychic like Robin is and knows the follower's name. He goes to a phone booth and calls Pete, who is interested in finding more psychics. Some operatives have Pete's phone tapped and move in on the hotel where he is hiding. Sensing the pursuit, Pete jumps out the window and escapes. Pete lands in an apartment and gets some new clothes before he moves on. As Gillian's powers are tested, she starts to see disturbing images of a stranger's death. Disguised as an old man, Pete walks the streets to continue searching for his son. Pete is soon made and goes on the run. Three cars are after him, and when he escapes (in riveting fashion), they report back to Childress, Pete's nemesis. Gillian is coming apart meanwhile, as her newly discovered powers are scaring her. She goes to see Doctor McKeever (Charles Durning) at an institution where she will stay a few weeks. Meanwhile Pete connects with an old flame ( Hester) who worked at Gillian's old school. Though he is after information, the romance rekindles. Then Pete's girl visits Gillian and befriends her again. Then Gillian has a vision of the doctor shoving Pete's son Robin out the window. She freaks out and runs, and then the doctor realizes what she is. He schedules more tests for the next day as Gillian rests. The next day, Childress visits the doctor because he is trying to harness every psychic's powers that he can. He is in charge of a military project that uses psychics, and that is why he uses this doctor. He wants Gillian, to take her to where he has Robin hidden. She is feeling more and more connected to Robin. During the tests, Gillian flips out again, accidentally using her power to crush the doctor's assistant, and Gillian runs as the woman bleeds to death. Gillian escapes the hospital with Pete and Hester's help. Though Pete wasted several of his men while getting Gillian, and Hester was accidentally killed, Childress is hot on their trail. He threatens the Dr. McKeever if he can't find her. Now her powers are making her quite valuable to both Childress and Pete. The doctor no longer wants to help Childress because of how he kidnapped Robin. Meanwhile, Robin is having anger problems, and his rage is making his powers stronger by the day. Pete and Gillian are on the run and as they get to know each other they talk about Robin. When she leads Pete to Robin, Pete tries to send Gillian to Seattle , so she will be safe. She insists on coming because Pete is the only one she trusts and she wants to help him find Robin. Inside the compound where he is held prisoner, Robin's rage is getting worse. But now he and Gillian sense each other's presence. Robin knows that she is psychic and thinks is there to replace him. He fears that Childress's people are going to kill him so Gillian can take his place. After Robin starts to use his power to kill, Pete and Gillian are capture by Childress's men. Pete goes upstairs and finds Robin, who has gone insane. He attacks Pete and flies out through the window. Pete tries to save him but fails. As Robin dies in Gillian's arms he gives her his power. Pete sees that he is dead and lets himself fall to the ground next to his son. The next day, Childress explains things to Gillian as she wakes up. Suddenly, Gillian refuses to be his soldier and the movie ends with Childress exploding into bits."}