{"mid": "TheFWord", "IMDB_id": "tt1486834", "title": "The F Word", "plot": "Wallace (Daniel Radcliffe) has an odd job and lives with his sister and nephew in Toronto, Ontario. He dropped out of medical school after discovering his girlfriend having sex with his anatomy teacher and has not been social for more than a year. He is coerced by his best friend Allan (Adam Driver) into going to a house party, where he meets Allan's cousin Chantry (Zoe Kazan). At the same time, Allan meets Nicole (Mackenzie Davis) and they begin flirting with each other.\nChantry and Wallace leave the party and he walks her home where he finds out that Chantry has a boyfriend. Even so, she gives him her phone number, but he decides against calling her. They later run into each other at a movie theater, where they had both gone alone, and end up having dinner together.\nOver time the friendship grows and Wallace is invited to meet Ben (Rafe Spall), Chantry's long-term boyfriend, who works for the United Nations. Ben, however, ends up in the hospital due to a series of unexpected accidents when Wallace visits their house for the first time. At the hospital, Wallace and Chantry run into Wallace's ex-girlfriend, Megan. Ben later moves to Dublin, Ireland for six months due to requirements of his job. During this time, Wallace and Chantry begin to see their relationship develop further and they begin to have deeper feelings for each other.\nAllan and Nicole get married. Chantry's sister Dalia (Megan Park) tries to seduce Wallace in her car, but he does not reciprocate, because Wallace is worried that it would ruin any chance he would have with Chantry. Allan and Nicole invite the two to have a walk on the beach at night. They decide to go skinny dipping and soon Wallace and Chantry decide to join, whereupon Allan and Nicole steal their clothes, forcing them to sleep naked together on the beach. Wallace and Chantry feel forced into the intimate situation and begrudgingly decide to share the sleeping bag. The next day they leave the beach angrily.\nChantry is given a promotion to direct an animated project in Taiwan. However, she is pressured because of her strained relationship with Ben so she travels to Dublin to join him. On arriving, she discovers that Ben has accepted more work commitments that require him to travel frequently and she decides to break off the relationship. Meanwhile, Wallace decides to follow Chantry; upon arriving Ben punches him in the face, knocking him down the front stairs. He then checks his voicemail, learning that she has returned to Toronto. They meet, but Wallace tells Chantry about the trip and his feelings for her and she responds unfavorably.\nWallace considers going back to medical school and moving on with his life; however, he decides to attend Chantry's farewell party and they have a tearful goodbye. They finally admit to their mutual feelings while giving each other a Fool's Gold Sandwich, something they had previously discussed while hanging out together, and kiss.\nIn an epilogue set 18 months later, it is revealed that Wallace followed Chantry to Taiwan and proposed to her there while he completed his medical studies. They marry and contemplate the rest of their lives while sitting on Wallace's rooftop."}