{"mid": "TheFoxAndTheHound", "IMDB_id": "tt0082406", "title": "The Fox and the Hound", "plot": "After a young red fox is orphaned, Big Mama the owl, Boomer the woodpecker, and Dinky the finch arrange for him to be adopted by a kindly farmer named Widow Tweed. Tweed names him Tod, since he reminds her of a toddler. Meanwhile, her neighbor, a hunter named Amos Slade, brings home a young hound puppy named Copper and introduces him to his hunting dog Chief. Tod and Copper become playmates and vow to remain \"friends forever\". Slade becomes frustrated with Copper for frequently wandering off to play and puts him on a leash. While playing with Copper at his home, Tod awakens Chief. Slade and Chief chase him until they are confronted by Tweed. After a violent argument, Slade threatens to kill Tod if he trespasses on his farm again. Hunting season comes and Slade takes his dogs into the wilderness for the interim. Meanwhile, Big Mama, Dinky and Boomer attempt to explain to Tod that his friendship with Copper can no longer continue, as they are natural enemies, but Tod naively refuses to believe them, hoping that he and Copper will remain friends forever.\nAs months pass, Tod and Copper both reach adulthood. Copper has become an experienced hunting dog, while Tod has grown up into a strong handsome fox. On the night of Copper's return, Tod sneaks over to visit him. Copper explains that while he still values Tod as a friend, he is now a hunting dog and things are different. Their conversation awakens Chief, who alerts Slade. In the ensuing chase Copper catches Tod. Copper lets the fox go and diverts Chief and Slade. Tod tries escaping on a railroad track, but is caught and pursued by Chief as a train suddenly passes by them. Tod ducks under the train, but Chief is struck by the train and falls into a river below, breaking his leg. Angered by this, Copper and Slade blame Tod for the accident and vow vengeance. Tweed, realizing that Tod is no longer safe with her, takes him on a drive and leaves him at a game preserve.\nTod's first night alone in the woods proves disastrous, inadvertently entering an irritable badger's den. Thankfully, a friendly porcupine offers Tod shelter. That same night, Slade and Copper plan revenge on Tod. The next morning, Big Mama finds Tod and introduces him to a female fox named Vixey. Wanting to impress her, Tod tries to catch a fish, but fails due to not having survival skills. Vixey and the other animals laugh at him, but Big Mama directs Tod to be himself. The two foxes reconcile and Vixey helps Tod adapt to life in the forest.\nMeanwhile, Slade and Copper trespass into the preserve to hunt Tod. As Tod manages to escape Slade's leghold traps, Copper and Slade pursue both foxes. They hide in their burrow while Slade tries trapping them by setting fire to the other end of the burrow. The foxes narrowly escape without getting burned as Slade and Copper chase them up the top of a hill until they reach a waterfall. There, Slade and Copper close in for the kill, but a large bear suddenly emerges and attacks Slade, who then falls and steps into one of his own traps, dropping his gun slightly out of reach. Copper tries fighting the bear but is no match for it. Not willing to let his old friend die, Tod intervenes and fights off the bear until they both fall down the waterfall.\nWith the bear gone, a bewildered Copper approaches Tod as he lies exhausted near the bank of a waterfall-created lake. When Slade appears, Copper positions himself in front of Tod to prevent Slade from shooting him, refusing to move away. Slade lowers his gun and leaves with Copper. The former friends share one last smile before parting. At home, Tweed nurses Slade back to health while the dogs rest. Copper, before resting, smiles as he remembers the day when he first met Tod. On a hill, Vixey joins Tod as they look down on the homes of Slade and Tweed."}