{"mid": "TheGoodSon", "IMDB_id": "tt0107034", "title": "The Good Son", "plot": "In Arizona, 12-year-old Mark Evans (Elijah Wood) has recently experienced the death of his mother, Janice (Ashley Crow). Heading for a business trip to Tokyo, Mark's father Jack (David Morse) drives Mark to the home of his uncle Wallace (Daniel Hugh Kelly) and aunt Susan (Wendy Crewson) in Maine where he will stay during the winter break. Mark is reintroduced to his extended family, including his cousins Connie (Quinn Culkin) and Henry (Macaulay Culkin). Mark and Henry get along at first and Henry seems to be nice and well-mannered. However, Henry displays an abnormal fascination with death and his talk of the death of Mark's mother and that of his younger brother Richard, makes Mark feel uneasy.\nHenry begins to display psychopathic behavior, which Mark is unable to tell Wallace and Susan about due to Henry's dark threats. One of Henry's violent actions is to throw a dummy off a bridge and on to the highway, causing a massive pileup. Later, Henry plans to kill his sister Connie. Afraid that something might happen to her, Mark spends the night in her room. The next morning, Mark awakens to find Henry has taken Connie ice skating. At the pond, Henry purposely throws Connie toward thin ice. The ice collapses and Connie nearly drowns but is rescued and taken to hospital. Susan becomes suspicious and sitting in the dark, out of view, is able to interrupt Henry when he visits Connie's room, planning to smother her.\nSusan finds a rubber duck that Henry has hidden in the shed. It had once belonged to Richard and was with him in the bathtub the night he drowned, after which it went missing. When Susan confronts Henry, he coldly reminds her that the toy had belonged to him before it had been Richard's. He asks for the duck back but Susan refuses and Henry tries to take it from her. After a violent tug-of-war, Henry snatches the duck and runs to the cemetery where he throws it down a well. As Susan and Mark grow closer, Henry insinuates he will kill Susan rather than let Mark continue to develop a relationship with her.\nWhen a fight breaks out between the two boys, Wallace locks Mark in the den. Henry asks a suspicious Susan to go for a walk with him, while Mark escapes the den and chases after them. Susan confronts Henry, asking him if he killed his brother. Henry replies, \"What if I did?\" Horrified by what her son has become, Susan tells Henry that he needs help but Henry flees into the woods. Susan gives chase and upon arriving at a cliff, Henry shoves her over the edge. As Susan dangles precariously, Henry picks up a large rock he intends to throw down at her but Mark intervenes and tackles his cousin. They fight and Henry viciously tries his best to kill Mark. Susan manages to pull herself up on to the clifftop and is just in time to dive forward and grab hold of the boys as they roll over the edge. Lying flat on the rock she hangs on to both boys, one in each hand. Henry holds on with both hands but Mark's one-handed grip begins to slip. Henry says, \"Mom, I love you.\" Then Henry says to his mother, \"I need your other hand.\" With only enough strength to save one of them. Susan, realizing the malevolence in Henry's nature, reluctantly releases him and he falls to his death. Susan pulls Mark up from the ledge and they look down upon Henry's body on the rocks below, before it is washed away into the sea. When Mark returns to Arizona, he reflects upon Susan's choice to save him instead of Henry and wonders if she would make the same choice again but knows it is something he will never ask her."}