{"mid": "TheGhostWriter", "IMDB_id": "tt1139328", "title": "The Ghost Writer", "plot": "A British ghostwriter (Ewan McGregor) is hired by the publishing firm Rhinehart, Inc. to complete the autobiography of former Prime Minister Adam Lang (Pierce Brosnan). His predecessor and Lang's aide, Mike McAra, has recently died in an apparent drowning accident. The writer travels to Old Haven on Martha's Vineyard, Massachusetts, where Lang and his wife Ruth (Olivia Williams) are staying, along with Lang's personal assistant (and implied mistress), Amelia Bly (Kim Cattrall). Amelia forbids the writer from taking McAra's manuscript outside, emphasizing that it is a security risk.\nShortly after the writer's arrival, former Foreign Secretary Richard Rycart (Robert Pugh) accuses Lang of authorizing the illegal seizure of suspected terrorists and handing them over for torture by the CIA, a possible war crime. Lang faces prosecution by the International Criminal Court unless he stays in the U.S. (or one of the few other countries that does not recognise the court's jurisdiction). While Lang is in Washington, the writer finds items in McAra's room suggesting he might have stumbled across a dark secret. Among them is an envelope containing photographs and a phone number the writer discovers is Rycart's.\nDuring a bike ride, the writer encounters an old man (Eli Wallach) who tells him the current couldn't have taken McAra's body from the ferry where he disappeared to the beach where it was discovered. He also reveals a neighbour saw flashlights on the beach the night McAra died, but later fell down the stairs and went into a coma. Later, Ruth admits to the writer Lang had never been very political, and until recently always took her advice. When he tells her the old man's story, she suddenly rushes out into the rainy night to \"clear her head.\" Upon returning, she reveals Lang and McAra had argued the night before the latter's death, and the ghost writer and Ruth have a one night stand while Adam is away.\nThe next morning, the writer takes the BMW X5 McAra used on his last journey. Unable to cancel the pre-programmed directions on the car's sat-nav, he decides to follow them. He arrives in Belmont at the home of Professor Paul Emmett (Tom Wilkinson). Emmett denies anything more than a cursory acquaintance with Lang, despite the writer showing him two pictures of the pair among photographs found in McAra's possessions, as well as another on the wall of Emmett's study. When the writer tells Emmett the sat-nav proves McAra visited him the night he died, Emmett denies meeting McAra and becomes evasive. The writer leaves, and successfully eludes a car that is pursuing him. He boards the ferry back to Martha's Vineyard, but when he sees the pursuit car drive aboard, he flees the boat at the last moment and checks into a small motel by the ferry dock.\nWith no one else to turn to, the writer redials Rycart's number, asking for help. While waiting, the writer does research on Emmett and links his think tank to a military contractor. He also finds leads connecting Emmett to the CIA. When Rycart arrives, he reveals McAra gave him documents linking Lang to so-called \"torture flights,\" where terrorist suspects were placed on private jets owned by Emmett's company, to be tortured while airborne.\nRycart further claims that McAra found new evidence, which he wrote about in the \"beginning\" of the manuscript. The men cannot, however, find anything in the early pages. The writer discusses Emmett's relationship with Lang, while Rycart recounts how Lang's decisions as Prime Minister uniformly benefited U.S. interests. When the writer is summoned to accompany Lang on his return flight by private jet, he confronts Lang and accuses him of being a CIA agent recruited by Emmett. Lang derides his suggestions.\nUpon leaving the aircraft, Lang is assassinated by a British anti-war protester, who is in turn shot by Lang's bodyguards. Nevertheless, the writer is asked to complete the book for posthumous publication, as in light of Lang's death it will be a certain bestseller. Amelia invites him to the book's launch party in London, where she unwittingly tells him the Americans tightened access to the book, as the \"beginnings\" contained evidence threatening national security. She also tells him Emmett, who is in attendance, was Ruth's tutor when she was a Fulbright scholar at Harvard.\nThe writer realizes the clues were hidden in the original manuscript in the opening words of each chapter, and discovers the message: \"Lang's wife Ruth was recruited as a CIA agent by Professor Paul Emmett of Harvard University.\" He concludes Ruth shaped Lang's every political decision to benefit the USA under direction from the CIA.\nThe writer passes a note to Ruth reveaing his discovery. She unfolds the note, and is devastated. When she sees the writer raising a glass, she is kept from following him by Emmett and other assistants. As the writer leaves the party he attempts to take a taxi, without success. As he crosses the street off-camera, a car accelerates in his direction to an impending collision. As witnesses react in horror, the pages containing McAra's manuscript are blowing in the wind, leaving the writer's fate unconfirmed."}