{"mid": "TheGhostAndTheDarkness", "IMDB_id": "tt0116409", "title": "The Ghost and the Darkness", "plot": "In 1898, Sir Robert Beaumont, the primary financier of a railroad project in Tsavo, Kenya, is furious because the project is running behind schedule. He seeks out the expertise of Lt. Colonel John Henry Patterson, a British military engineer, to get the project back on track. Patterson travels from England to Tsavo, telling his wife, Helena, he will complete the project and be back in London for the birth of their son. He meets British supervisor Angus Starling, Kenyan foreperson Samuel, and Doctor David Hawthorne. Hawthorne tells Patterson of a recent lion attack that has affected the project.\nThat night, Patterson kills an approaching lion with one shot, earning the respect of the workers and bringing the project back on schedule. However, not long afterwards, Mahina, the construction foreperson, is dragged from his tent in the middle of the night. His half-eaten body is found the next morning. Patterson then attempts a second night-time lion hunt, but the following morning, another worker is found dead at the opposite end of the camp from Patterson's position.\nPatterson's only comfort now is the letters he receives from his wife. Soon, while the workers are gathering wood and building fire pits around the tents, a lion attacks the camp in the middle of the day, killing another worker. While Patterson, Starling and Samuel are tracking it to one end of the camp, another lion leaps upon them from the roof of a building, killing Starling with a slash to the throat and injuring Patterson. Despite the latter's efforts to kill them, both lions escape. Samuel states that there has never been a pair of man-eaters; they have always been solitary hunters. The workers, led by Abdullah, begin to turn on Patterson. Work on the bridge comes to a halt. Patterson requests soldiers from England to protect the workers, but is denied. During a visit to the camp, Beaumont tells Patterson he will ruin his reputation if the bridge is not finished on time and that he will contact the famous hunter Charles Remington to help because Patterson has been unable to kill the animals.\nRemington arrives with skilled Maasai warriors to help kill the lions. They dub the lions \"the Ghost\" and \"the Darkness\" because of their notorious methods of attack. The initial attempt fails when Patterson's borrowed gun misfires. The warriors decide to leave, but Remington stays behind. He constructs a new hospital for sick and injured workers and tempts the lions to the abandoned building with animal parts and blood. When the lions fall for the trap, Remington and Patterson shoot at them; they flee and attack the new hospital, killing many patients and Dr. Hawthorne. Abdullah and the construction men leave, and only Patterson, Remington, and Samuel remain behind to face the marauders. Patterson and Remington locate the animals' lair, discovering the bones of dozens of the lions' victims. That night, Remington kills one of the pair by using Patterson and a baboon as bait. The workers celebrate, though later Patterson dreams about his wife and infant son visiting him in Tsavo, only for them to be killed by the remaining lion before he can get to them.\nWaking from his nightmare the next morning, Patterson discovers that the remaining lion has dragged Remington from his tent and killed him; Patterson and Samuel cremate Remington's corpse on a pyre at the spot where he died. Grief-stricken and desperate to end the carnage, the two men burn the tall grass surrounding the camp, driving the surviving lion toward the camp (and the ambush they set there). The lion attacks Patterson and Samuel on the partially constructed bridge and after a lengthy fight, Patterson finally kills it. Abdullah and the construction workers return, and the bridge is completed on time.\nThe film ends with Patterson's wife arriving with their son, and a narration by Samuel, who informs the audience that the lions are now on display at the Field Museum in Chicago, Illinois. Even today, he says, \"If you dare lock eyes with them, you will be afraid\"."}