{"mid": "TheGirlWithAllTheGifts", "IMDB_id": "tt4547056", "title": "The Girl with All the Gifts", "plot": "Twenty years ago humanity was infected by a variant of the fungus Ophiocordyceps unilateralis. The infected, referred to as \"hungries\", quickly lose their mental powers and feed on the flesh of healthy humans. The disease spreads through blood and saliva, but can also spread through spores created by the fungus. In England, the few surviving uninfected humans either live in heavily-guarded areas such as Beacon, or roam in packs of hostile, scavenging \"junkers\".\nThe authorities in Beacon set up a remote military base for the study of a specific group of child hungries. They, unlike others, are able to retain their mental powers and only lose control when they get too close to human scent. Soldiers, led by Sergeant Eddie Parks, find such child hungries and bring them to the base, where they are educated by teachers and tested by the head scientist, Dr. Caroline Caldwell. This often means she vivisects the children, which Helen Justineau, a behavioural psychologist and teacher at the base, dislikes. Justineau sees the child hungries as people, and is especially fond of Melanie, a 10-year-old with a genius-level IQ. Melanie loves Justineau as a surrogate mother. Like the other children, Melanie does not understand that she is different from the adults.\nDr. Caldwell, who believes that she is close to a cure for the fungus, chooses to dissect Melanie. As Justineau interrupts and tries to save her the base is attacked by a group of junkers and hungries; Caldwell is badly wounded, and in saving Justineau, Melanie eats flesh for the first time, awakening the \"hunger\" of the fungus. The three find Parks and Private Kieran Gallagher, and flee the base together. The group decides to travel to Beacon, 74 miles away, but the adults argue over whether to bring Melanie. Parks only agrees after placing a muzzle and handcuffs on the child; Melanie cooperates, now aware of the danger she poses to the others.\nMelanie proves useful to the adults; hungries do not attack her, and she can lead them away from the humans. While Caldwell still sees Melanie as a specimen, the others begin to trust the child. After several encounters with hungries, including a few adults that also retain some human-like behavior, the group finds the mobile laboratory Rosalind Franklin. It was built soon after the epidemic began with state-of-art facilities for experimentation and attack, but disappeared on its research mission. Caldwell, who is dying from sepsis, uses its equipment to urgently continue her research.\nWhile Melanie sates her hunger away from the others by eating wild animals, she finds a group of child hungries. Melanie sees that they, too, retain their mental functions, although they have no language of their own, being uneducated. Afraid that they will be experimented on, Melanie instead tells the adults she saw a large group of junkers, but reveals the truth to Justineau. Gallagher, scared of junkers, flees the lab. He is found by the intelligent hungries, killed, and eaten.\nWhile Parks and Justineau search for Gallagher, Caldwell—obsessed with finishing her research before dying—captures one of the intelligent hungries and experiments on him. She makes remarkable findings but does not let the others inside, fearing that they will interfere. Melanie finds a giant mass of fungal fruiting bodies that have grown in the years since the infection began; while there are enough spores to infect the entire world by air currents, the pods that contain the spores (sporangia) do not open on their own.\nMelanie tricks Caldwell into letting her inside. Before dying, Caldwell shares her findings with Melanie: There is no cure or vaccine for the fungus. Intelligent hungries are second-generation ones, conceived by hungries who retained some human behavior. Those born in this way retain their mental abilities.\nOutside the lab, Parks and Justineau are cornered by hungries. Melanie frightens them away, but Justineau is knocked unconscious and Parks is bitten and infected. Parks asks Melanie to shoot him before the infection cycle finishes so he does not turn into a hungry; she agrees to do so. She asks him to shoot the mass of spores with a flamethrower, deducing correctly that the environmental trigger to open the spores is fire. Before Melanie complies with Parks' request to kill him, she explains that as long as there are healthy humans, the war between them and the hungries will continue. For second-generation hungries to be born and rebuild the world, every human must first be infected.\nJustineau awakens in the Rosalind Franklin. Melanie leads her to a group of intelligent hungries, to whom Justineau, wearing an environmental protection suit, starts teaching the alphabet."}