{"mid": "TheGrinchGrinchesTheCatInTheHat", "IMDB_id": "tt0213689", "title": "The Grinch Grinches the Cat in the Hat", "plot": "The special opens on a morning that is so beautiful, even the Grinch wakes up in a good mood. However, his cheerfulness is soon revoked when his reflection in the mirror prompts him to repeat the \"Grinch's Oath\" and prove himself a Grinch. Meanwhile, the Cat in the Hat goes on a picnic. Their paths cross when the Grinch can't get his car around the Cat's, and things quickly escalate into a fierce car chase after the Cat unintentionally insults the Grinch by calling him \"Mr. Greenface.\"\nThe Cat returns to the safety of his house, but the Grinch follows him there and tampers with his voice using a device he has invented, the \"Vacusound Sweeper\", in the process sabotaging other sounds within a 50-mile radius. The Grinch then proceeds to his \"darkhouse\", a lighthouse that spreads darkness, to tamper with the Cat's sight.\nThe Cat becomes upset with the Grinch's hijinks and has a psychiatric session with him in a thought bubble to find out what makes him so mean-spirited. Predictably, he gets nowhere with the imaginary Grinch, so he then decides to go over and have a talk with him, but the Grinch makes it so dark that he can't see where he's going, and he crashes his car when he passes a \"Dead End\" sign.\nThe Cat attempts to hide from the Grinch in a nearby restaurant, but the Grinch's machine continues to mess with reality, making the restaurant and everything with it literally come crazily to life, and his hijinks result in confusion all over the restaurant. The Cat is now furious with the Grinch and ponders to himself how he can change the Grinch, eventually racing through a door and sending himself hurtling into the Grinch's Dimension. He soon figures it out and rallies everybody in the restaurant to follow him to the Grinch's house.\nThere, he leads everyone in a song to remind the Grinch of all of the love he received from his mother and implore him to change his ways and be a better person (\"Deep down in your brain, must you give her more pain? / Please soften your heart, make Mum happy again\"). The Grinch cries when he hears this, disassembles his machines, and continues his change of heart into the next morning. When his reflection tries to convert him back to his old self, though, Max drains out his voice with the Vacusound Sweeper."}