{"mid": "TheGoodbyeGirl", "IMDB_id": "tt0076095", "title": "The Goodbye Girl", "plot": "Dancer Paula McFadden (Marsha Mason) and her ten-year-old daughter Lucy (Quinn Cummings) live in a Manhattan apartment with her married boyfriend, Tony DeForrest, until one day, he deserts her to go act in a movie in Italy. Before he left and unbeknownst to Paula, Tony subleased the apartment to Elliot Garfield (Richard Dreyfuss), a neurotic but sweet aspiring actor from Chicago, who shows up in the middle of the night expecting to move in. Though Paula is demanding, and makes clear from the start that she doesn't like Elliot, he allows her and Lucy to stay.\nPaula struggles to get back into shape to resume her career as a dancer. Meanwhile, Elliot has landed the title role in an off-off-Broadway production of Richard III, but the director, Mark (Paul Benedict), wants him to play the character as an exaggerated stereotype of a homosexual, in Mark's words, \"the queen who wanted to be king.\" Reluctantly, Elliot agrees to play the role, despite full knowledge that it may mean the end of his career as an actor. Many theater critics from television stations and newspapers in New York City attend opening night, and they all savage the production, especially Elliot's performance. The play quickly closes, much to his relief.\nDespite their frequent clashes and Paula's ungrateful attitude to Elliot helping her, the two fall in love and sleep together. However, Lucy, although she likes Elliot, sees the affair as a repeat of what happened with Tony. Elliot convinces Paula that he will not be like that and later picks up Lucy from school and takes her on a carriage ride, during which Lucy admits that she likes Elliot, and he admits that he likes her and Paula and will not do anything to hurt them.\nElliot gets a job at an improv theater, and is soon seen by a movie producer. He is offered an opportunity for a role in a movie that he cannot turn down, the only catch is that the job is in Seattle and Elliot will be gone for four weeks. Paula is informed of this and is scared that Elliot is leaving her, never to return, like all the other men in her life. Later, Elliot calls Paula from the phone booth across the street from the apartment, telling her that the flight was delayed, and at the last minute, Elliot invites Paula to go with him while he is filming the picture and suggests Lucy stay with a friend until they return. Paula declines but is happy because she knows that Elliot's invitation is evidence that he loves her and will come back. Before hanging up, Elliot asks Paula to have his prized guitar restrung, which he had deliberately left at the apartment, and she realizes this as further proof that he will indeed return and that he really does love her."}