{"mid": "TheGetAway", "IMDB_id": "tt0033577", "title": "The Get-Away", "plot": "Carter \"Doc\" McCoy, in prison in Texas, is denied parole. When his wife Carol visits him, he tells her to do whatever is necessary to make a deal with Jack Beynon, a corrupt businessman in San Antonio, in order to free him. Beynon uses his influence and gets Doc paroled on the condition that he takes part in a bank robbery with two of his minions, Rudy and Frank. During the robbery, Frank kills a guard. Rudy attempts a double-cross, shooting Frank and drawing a gun on Doc, who beats him to the draw and shoots Rudy several times. Doc leaves Rudy for dead, but Rudy, having secretly worn a bulletproof vest, is alive albeit wounded.\nDoc meets with Beynon, who attempts a double-cross before Carol shoots and kills him. Doc realizes that Carol had sex with Beynon to secure his release from prison. Doc angrily gathers up the money and, after a bitter quarrel, the couple flees for the border at El Paso. A bloodied Rudy forces rural veterinarian Harold and his young wife Fran to treat his injuries, then kidnaps them to pursue Doc and Carol. Beynon's brother Cully and his thugs also pursue the McCoys. At a train station, a shifty con man swaps locker keys with Carol and steals their bag of money. Doc follows him onto a train and forcefully takes it back. The injured con man and a train passenger – a young African-American boy whom Doc had rebuked earlier for deriding him –  are taken to the police station, where they identify Doc's mug shot.\nCarol buys a car, and the McCoys drive to an electronics store. As Doc buys a portable radio, he switches off the television set near the proprietor's desk, which telecasted the news reporting the earlier incidents they were involved in. Suddenly, all the television sets in the store show Doc's picture, prompting him to leave immediately. The proprietor, however, gets a glimpse of the picture, and calls the police. Doc steals a shotgun, leading to several shoot-outs and police chases. The couple escape by hiding in a large trash bin, only to end up in the back of a garbage truck that dumps its load at the local landfill. Filthy and frustrated, they argue about whether to stay together or split up. They decide to see things through.\nRudy's attraction to the veterinarian's wife results in the two having sex in front of her husband. Humiliated, the vet hangs himself in a motel bathroom. Rudy and Fran move on, barely acknowledging the suicide. They check into an El Paso hotel used by criminals as a safe house because Rudy knows that the McCoys will be heading to the same place. When Doc and Carol check in at the hotel, they ask for food to be delivered, but the manager, Laughlin, says he is working alone and can't leave the desk. Doc soon realizes that Laughlin sent away his family because something is about to happen. He urges Carol to dress quickly so they can escape. An armed Rudy comes to their door while Fran poses as a delivery girl who needs to be paid for the food. Peering from an adjacent doorway, Doc is surprised to see Rudy alive. He sneaks up behind Rudy, knocks him out, and does the same to the screaming Fran.\nCully and his thugs arrive as the McCoys try to leave. A violent gunfight ensues in the halls, stairwell, and elevator; and all of Cully's men are killed but one, whom Doc allows to run away. Cully himself dies when Doc shoots the cables of the elevator Cully is in and it crashes to the bottom of the shaft. Rudy comes to his senses, follows Doc and Carol outside on a fire escape, and shoots at them, but Doc returns fire and kills him. With the police on the way, the couple hijack a pickup truck and force the driver, a cooperative old cowboy, to take them to Mexico. After crossing the border, Doc and Carol pay the cowboy $30,000 ($171,800 today) for his truck. Overjoyed, the cowboy heads back to El Paso on foot, while the couple continue on into Mexico."}