{"mid": "TheGreasyStrangler", "IMDB_id": "tt4381236", "title": "The Greasy Strangler", "plot": "Big Ronnie runs a disco-themed walking location tour in his town, alongside his son Big Brayden. Ronnie allows Brayden to live with him on the condition that Brayden prepares excessively greasy food for him. Ronnie is a pathological liar who fabricates stories about disco groups like the Bee Gees, as well as his supposed friendship with Michael Jackson. Brayden aspires to be a space fantasy author. Ronnie asserts that Brayden drove his mother away, though Brayden says that she left Ronnie for a man named Ricky Prickles. Ronnie and Brayden frequently call each other \"bullshit artist\"s.\nAt night, Ronnie completely covers himself in grease and strangles residents of the town, starting with three people who were part of his tour group. After his killings, he cleans himself of the grease by standing in a car wash run by a blind man named Big Paul. During one of the disco walking tours, Brayden meets a woman named Janet, and the two begin a romantic relationship. One night, Ronnie buys a hot dog from a vendor and forcibly covers it in grease, against the vendor's pleas. Later, as the vendor is defecating in his trailer, Ronnie strangles him through a window, causing his eyes to pop out of his head, which Ronnie cooks and eats.\nBrayden and Janet have sex, and the next morning, Ronnie attempts to seduce Janet by eating a grease-covered grapefruit. Ronnie takes Janet out to a discotheque, threatening to evict Brayden if he does not allow them to. Ronnie attempts to kiss Janet, but she resists, saying that she may be in love with Brayden. Ronnie kills Oinker, one of Brayden's friends, and goes to the discotheque with Paul. Against Brayden's wishes, Ronnie has sex with Janet, and he and Brayden have a heated argument the next day. Ronnie and Janet have sex again, and when Brayden confronts them, they mock him, prompting him to run from the house in despair.\nOne night, Brayden confronts Janet in the kitchen and admits that he is in love with her. Ronnie overhears this, covers himself in grease, and pretends to stand in the car wash, allowing himself to sneak up on Paul and strangle him. He decapitates Paul with a nearby saw and dances with Paul's head. The next morning, Brayden calls a detective named Jody and reports that Ronnie may be \"the greasy strangler\". Jody comes to the house the next day, and Brayden and Janet show him a spot of oil left behind on the carpet as evidence that Ronnie is \"the greasy strangler\". Downstairs, Jody concludes that the oil is meaningless circumstantial evidence, and demands that they end all inquiries about Ronnie having committed the murders. Jody removes his glasses in a mirror, showing that he is Ronnie in disguise.\nThat night, Janet declares her mutual love for Brayden, and they decide to get married. Ronnie, hiding under the bed, reveals himself, claiming Janet as his lover and evicting Brayden. Janet replies that Brayden can stay at her residence, and Ronnie leaves. He re-enters, covered in grease, slaps Brayden, and grabs Janet by the arm, leaving with her. Brayden covers himself in grease as well, and follows Ronnie and Janet to a movie theatre, where Ronnie is strangling her. Brayden strangles Janet instead, causing her eyes to pop out of her head, which both he and Ronnie consume.\nThe next day, on a beach, Ronnie reveals that he cares for Brayden, despite his annoyance with him, and says that he would rather be with him than co-owning a discotheque with John Travolta in New Orleans. They bond over, in hindsight, their disgust with Janet. They cover themselves in grease and head to a forest where they murder Ricky Prickles, and then witness themselves be executed by firing squad, watching as liquid and confetti explode from their heads. They venture deeper into the forest, still covered in grease, and primally shake wooden spears at the camera."}