{"mid": "TheGreatMuppetCaper", "IMDB_id": "tt0082474", "title": "The Great Muppet Caper", "plot": "The film begins with Kermit the Frog, Fozzie Bear, and Gonzo the Great commenting on the opening credits from a hot-air balloon and introducing the premise of the movie to the audience. Throughout the film, the characters frequently break the fourth wall, discussing (for example) each other's acting choices and singing ability in the middle of a scene.\nKermit, Fozzie, and Gonzo play investigative reporters for the Daily Chronicle. Kermit and Fozzie, specifically, play identical twin reporters, which becomes the source of a running gag—supposedly, nobody can tell they are twins unless Fozzie removes his hat. After the trio fail to report on a major jewel robbery, they ask their editor to allow them to travel to London to investigate the robbery and interview the victim, prominent fashion designer Lady Holiday.\nWith only $12 for the trip, they are forced to travel in an aeroplane's baggage hold and are thrown out of the plane as it passes over Britain. They stay at the dilapidated (but free) Happiness Hotel, which is populated by other Muppet characters such as Scooter, Rowlf the Dog, Dr. Teeth and The Electric Mayhem, Sam Eagle, the Swedish Chef, and Rizzo the Rat. When Kermit seeks out Lady Holiday in her office, however, he instead finds her newly-hired receptionist, the alluring Miss Piggy, and mistakes her for the fashion designer. Piggy poses as Lady Holliday, and asks Kermit out for dinner; to keep up the pose, she allows Kermit to assume she lives at a \"highbrow\" address. She sneaks into a townhouse at 17 Highbrow Street to wait for him, much to the surprise of the actual upper-class British residents, and they go to dinner at a nightclub.\nAt the nightclub, Lady Holiday's necklace is stolen by her jealous brother Nicky and his accomplices Carla, Marla, and Darla, three of her put-upon fashion models, the very same thieves who robbed her before. After the robbery, Miss Piggy's charade is revealed and she flees, leaving Kermit behind, though they later reconcile in a park. Despite Nicky's instant attraction to Miss Piggy, they frame her for the theft and plan to steal an even more valuable prize: Lady Holliday's largest and most valuable jewel, the fabulous Baseball Diamond, now on display at the local Mallory Gallery. Gonzo overhears their plot; and Kermit, Fozzie, Gonzo, and the other Muppets decide to intercept the thieves and catch them red-handed to exonerate Miss Piggy.\nThe Muppets sneak into the Mallory Gallery, and get to the Baseball Diamond at the same time as the thieves. They try to keep the diamond out of the theives' hands via a game of keep away, which turns into baseball, but Nicky eventually catches the diamond and takes Kermit hostage. However, in the meantime, Piggy has escaped from prison, and she races to the Mallory Gallery, crashing through the window on a motorcycle that serendipitously fell off a truck in front of her. She knocks Nicky out and dispatches Carla, Marla and Darla with a flurry of furious karate chops. As the police arrive, all charges against Piggy are dropped, Nicky and his fashion model-accomplices are arrested, and the Muppets get their deserved credit for foiling the heist.\nThe Muppets then return to the United States the same way they departed, being thrown out of the cargo hold and parachuting back to the USA, over the end credits."}