{"mid": "TheGallows", "IMDB_id": "tt2309260", "title": "The Gallows", "plot": "In October 1993, there is a high school performance of \"The Gallows\". The parents of Charlie Grimille record the play and admire their son's performance. Near the end of the play, Charlie's character is set to be hung at the gallows. Tragedy strikes when the door beneath Charlie's feet opens and he falls through with a noose around his neck, effectively hanging and killing him in front of his co-stars and the entire audience.In the present, 20 years later, a student at the same high school, Ryan (Ryan Shoos) tapes his friend (and the events of the film) Reese Houser (Reese Mishler) as he is in a production of \"The Gallows\" playing the same character Charlie played. Reese acts alongside his crush Pfeifer (Pfeifer Brown), but he never gets to kiss her during their big scene together. Ryan follows Reese and mocks the play while also recording several parents watching the rehearsals. Ryan speaks to a woman who was there during the original performance and witnessed Charlie's death.During the day, Ryan continues to mess around with the theater crew and also to hang out with his girlfriend Cassidy (Cassidy Gifford). Ryan finds out about Reese's crush on Pfeifer and decides to play wingman, so he finds Pfeifer and asks her how she feels about Reese and doing the play with him. She dances around the questions and expresses confidence in the play. As Ryan leaves her, he finds a door that never locks. This gives him an idea that he pitches to Reese and Cassidy in which they will sneak in at night and sabotage the play's set. Ryan knows Reese doesn't want to do the show for any reason other than to impress Pfeifer, so he coerces Reese into doing it so he can later console Pfeifer when she's devastated to see the set ruined.Ryan goes to Reese's house where he's arguing with his dad Rick (John Tanksly) over Reese doing the play. Reese takes Ryan and Cassidy to the school to set off their plan. They knock over some set trees and smash a few things before unscrewing the stairs leading to the gallows. Pfeifer shows up after claiming to have seen Reese's car. Ryan not-so-discreetly leaves the camera to record Reese trying to tell Pfeifer his reason for being there. As they talk, Ryan hears a loud thump that sounds like a bell tolling. The kids get a bit worried and try to leave, only to discover that the door that doesn't lock has somehow now been locked. They can't call for help because they have no signal. In their frustration, Cassidy blabs to Pfeifer that they were there to destroy the set, making Pfeifer angry with all of them, but especially Reese.The four look for an exit when they come across a room filled with files and other documents. They go into an office with a TV that plays footage featuring news coverage of Charlie's death, including the actual incident as well as an interview with Charlie's girlfriend Alexis Ross, the same woman that Ryan spoke to earlier that day. A cast photo is shown of the original cast, and they learn that Charlie was the understudy for the real actor that called in sick. Reese recognizes the person in the photo and runs all the way to the school's memorial of the play to find the same photo. They look on the back of the photo to see the name \"Rick Houser\", meaning it was Reese's dad that Charlie replaced.Ryan gets separated from the others and we see some footage through his phone. He gets spooked by more loud noises and runs to rejoin his friends. An invisible force pulls Cassidy up by the neck and leaves a mark around it, convincing everyone that there is something unfriendly amongst them.They then go back to the auditorium to spot a vent through which they can crawl. As the noises intensify, Ryan gets frustrated and starts taunting the presence by constantly saying Charlie's name, which has always been bad luck to utter. Ryan climbs a ladder to reach the vent, only to get thrown off by a strong force, causing him to break his leg. Reese and Pfeifer go look for help while Cassidy stays with him. Moments later, Reese and Pfeifer find Cassidy outside the auditorium, unable to re-enter. They hear Ryan yelling until a loud snap is heard. The door opens and the kids can't find Ryan. They find his phone with the screen cracked.We see the last bit of footage from Ryan's phone, showing his messed up leg while Cassidy is with him. She steps out to call the others when the door slams shut. Ryan panics and momentarily sees a figure dressed as the Hangman from the play, holding a noose. Ryan tries crawling away and doesn't see the figure anymore. Seconds later, he is pulled up by his neck.Reese holds the camera to try and keep the light on. While continuing to find a way out, Reese walks through the locker room and hears his phone ringing. It's been placed in a locker, but he sees it's his dad calling. Reese smashes the lock and gets the phone. He tries talking to his dad but only hears static, and then his own voice saying, \"He wants me. He's coming for me.\"Outside, Cassidy cries by herself, unaware that the Hangman is walking behind her. She grabs the camera and looks at the mark on her neck, which has gotten more bruised. She then sees a noose around her neck, and she is pulled away quickly.Reese and Pfeifer pull the fire alarm to try and get the authorities to respond. It goes off but also alerts the Hangman to their presence. He follows them through the auditorium as they make their way to the top of the auditorium, with him nearly grabbing Reese. Up there, they find Ryan and Cassidy's bodies still hanging. They keep running until they see the unlockable door is now re-opened, but no authorities are there. Reese runs outside, but Pfeifer doesn't follow him. Reese makes it outside but hears Pfeifer gasping for air. He runs back in for her and sees her choking onstage. As he tries to help her, the spotlight hits them. Realizing what the spirit wants them to do, they act out their final scene in the play, in which the dialogue parallels their actual thoughts and words, since Reese knows it's him that the Hangman/Charlie wants. Reese finally kisses Pfeifer and walks over to the now-illuminated gallows. He puts the noose around his neck while Pfeifer continues to recite her lines in character. Charlie's spirit tightens the noose around Reese and pulls the lever, hanging Reese. Pfeifer stands onstage and joins hands with Charlie's invisible spirit. Together, they take a bow, while one person in the auditorium starts clapping.... Alexis Ross.The in the final scene, two policemen are entering Pfeifer's home. There's pictures on the wall of Pfeifer and Alexis together. Putting the pieces together, it becomes clear that Pfeifer is Charlie's daughter born after his death. One officer enters the bedroom where footage of the original play is being shown. He looks to the side and is startled to see Alexis brushing Pfeifer's hair. He sees Charlie's death on TV and asks, \"Charlie Grimille?\" The two ladies look at him with soulless eyes, and Pfeifer responds, \"You really shouldn't say that name.\" The officer looks out the room to see a noose pull his partner against the wall. He turns around to find Charlie, who promptly attacks him."}