{"mid": "TheGoonies", "IMDB_id": "tt0089218", "title": "The Goonies", "plot": "Facing foreclosure of their homes in the Goon Docks area of Astoria, Oregon to an expanding country club, a group of children who call themselves \"the Goonies\", gather for a final weekend together. The Goonies include optimist Mikey Walsh, his older brother, Brand, the inventive Data, the talkative Mouth, and the overweight klutz Chunk. While rummaging through the Walshes' attic, they come across a 1632 doubloon and an old treasure map purporting to lead to the famous pirate \"One-Eyed\" Willy's hoard located nearby. Evading Brand for one last adventure together, the kids find themselves at a derelict restaurant near the coast, which coincides with the doubloon and the map. They encounter the Fratellis, a family of criminals hiding out at the restaurant. Evading detection by returning outside, the kids run into Brand and two girls: the popular cheerleader Andy, who has a crush on Brand, who shares the same feelings for her, and Stef, a nerdy, tough-talking girl and Andy's best friend.\nMikey convinces Brand to return to the restaurant to explore after the Fratellis leave, discovering that the criminals are running a counterfeiting operation. As the Fratellis return, the group finds a tunnel beneath the restaurant and hides in there, sending Chunk to notify the authorities. They explore the tunnel and find the remains of a previous explorer, who also searched for the treasure, and Mikey is sure they are on the right trail. Evading various booby traps, set up by Willy, they find themselves under an old wishing well. The kids have a chance to be pulled out of the tunnel by Andy's obnoxious boyfriend Troy, whose family owns the country club, but Mikey convinces the group to continue on their journey. Meanwhile, Chunk, who has escaped the restaurant, tries to flag down several passing cars, but is intercepted and kidnapped by Jake and Francis Fratelli. When the Fratellis threaten to shred his hands with an active blender, a terrified Chunk reveals not only where his friends are, but also the existence of the treasure. The Fratellis tie Chunk to a chair and lock him in the basement next to Sloth, their deformed younger brother kept chained to the wall. While the Fratellis pursue both the Goonies and the treasure, Chunk befriends Sloth, and Sloth is able to break their bonds; they form a third party headed into the tunnel.\nMikey and the others discover the Fratellis on their trail, and hasten through the remaining traps. They ultimately find an enclosed grotto and Willy's pirate ship, the Inferno, which has been sealed in the cave for centuries. They explore the ship, finding a hoard of treasure in front of the skeletal remains of Willy and his crew. Mikey gives a sober speech to Willy, naming him as the first \"Goonie\", then he and the others fill their pockets with riches; Mikey insists that the coins directly in front of Willy remain untouched, as Willy's tribute. As they leave, however, the Fratellis have already caught up with them. They make them drop the treasure before threatening to kill them by forcing them to walk the plank, when suddenly Sloth and Chunk arrive. Sloth, angered by how the other Fratellis have treated him in the past, easily subdues them and helps the rest of the Goonies to escape the boat. Though Mikey insists they go back for the treasure, Brand worries more for their lives, and the group escapes through a hole in the grotto, eventually arriving on a nearby beach shore. Police quickly come to their help and reunite them with their families.\nMeanwhile, the Fratellis free themselves and begin to loot the boat. When they take the coins that Mikey had left earlier, they trigger another booby trap that causes the grotto to start to cave in. The Fratellis are forced to abandon the loot and flee to the beach, where police quickly take them into custody. As the Goonies are taken care of by their families, including Chunk offering to bring Sloth into his family, the owners of the country club show up and demand that Mr. Walsh sign away their homes and the Goon Docks. As he is about to do so, their housekeeper, Rosalita, finds Mikey's marble bag in his wet clothes, filled with gems that the Fratellis had neglected to confiscate. Mr. Walsh triumphantly tears up the paperwork, as the gems are more than enough to negate the foreclosure. As the Goonies celebrate, the attention of all on the beach is caught by the sight of the unmanned Inferno, now clear of the grotto, and the Goonies wave her goodbye as she sets off once more upon the sea."}