{"mid": "TheGreatZiegfeld", "IMDB_id": "tt0027698", "title": "The Great Ziegfeld", "plot": "The son of a highly respected music professor, Florenz \"Flo\" Ziegfeld, Jr. yearns to make his mark in show business. He begins by promoting Eugen Sandow, the \"world's strongest man\", at the 1893 Chicago World's Fair, overcoming the competition of rival Billings and his popular attraction, belly dancer Little Egypt, with savvy marketing (allowing women to feel Sandow's muscles).\nZiegfeld returns to his father and young Mary Lou at the Chicago Musical College, and departs to San Francisco, where he and Sandow are deemed frauds for putting on a show in which Sandow faces a lion who falls asleep as soon as it is let out of the cage. Flo travels to England on an ocean liner, where he runs into Billings again who is laughing at a newspaper article denouncing him as a fraud.\nFlo discovers that Billings is on his way to sign a contract with beautiful French star, Anna Held. Despite losing all his money gambling at Monte Carlo, Flo charms Anna into signing with him instead, pretending that he doesn't know Billings. Anna twice almost sends him away for his rudeness and for being broke, before revealing that she appreciates his honesty. Ziegfeld promises to give her \"more publicity than she ever dreams of\" and to feature her alongside America's most prominent theatrical performers.\nAt first, Anna's performance at the Herald Square Theatre is not a success. However, Flo manages to generate publicity by sending 20 gallons of milk to Anna every day for a fictitious milk bath beauty treatment, then refusing to pay the bill. The newspaper stories soon bring the curious to pack his theater, and Ziegfeld introduces eight new performers to back her. Audience members comment on how the milk must make her skin beautiful and the show is a major success. Flo sends Anna flowers and jewelry and a note saying \"you were magnificent my wife\", and she agrees to marry him, flaunting her new diamonds to her fellow performers.\nHowever, one success is not enough for the showman. He has an idea for an entirely new kind of show featuring a bevy of blondes and brunettes, one that will \"glorify\" the American girl. The new show, the Ziegfeld Follies, an opulent production filled with beautiful women and highly extravagant costumes and sets, is a smash hit, and is followed by more versions of the Follies.\nZiegfeld tries to make a star out of Audrey Dane, who is plagued with alcoholism, and he lures Fanny Brice away from vaudeville, showering both with lavish gifts. He gives stagehand Ray Bolger his break as well. Mary Lou, now a young woman, visits Ziegfeld, who doesn't recognize her initially, and hires her as a dancer.\nThe new production upsets Anna, who realizes that Flo's world does not revolve around just her, and she becomes envious of the attention he pays to Audrey. She divorces him after walking in on Flo and a drunk Audrey at the wrong moment. Audrey walks out on Flo and the show after an angry confrontation. Broke, Flo borrows money from Billings for a third time for the new show.\nFlo meets the red-headed Broadway star Billie Burke and soon marries her. When she hears the news, a heartbroken Anna telephones Flo and pretends to be glad for him. Flo and Billie eventually have a daughter named Patricia.\nFlo's new shows are a success, but after a while, the public's taste changes, and people begin to wonder if the times have not passed him by. After a string of negative reviews in the press, Flo overhears three men in a barber's shop saying that he'll \"never produce another hit\". Stung, he vows to have four hits on Broadway at the same time.\nHe achieves his goal, with the hits Show Boat (1927), Rio Rita (1927), Whoopee! (1928), and The Three Musketeers, and invests over $1 million (US$13,947,674 in 2016 dollars) of his earnings in the stock market. However, the stock market crash of 1929 bankrupts him, forcing Billie to return to the stage.\nShaken by the reversal of his financial fortunes and the growing popularity of movies over live stage shows, he becomes seriously ill. Billings pays him a friendly visit, and the two men agree to become partners in a new, even grander production of The Ziegfeld Follies. But the reality is that both men are broke and Ziegfeld realizes this. In the final scene in his apartment overlooking the Ziegfeld Theatre, in a half-delirium, he recalls scenes from several of his hits, exclaiming, \"I've got to have more steps, higher, higher\", before slumping over dead in his chair."}