{"mid": "TheGrapesOfWrath", "IMDB_id": "tt0032551", "title": "The Grapes of Wrath", "plot": "The narrative begins just after Tom Joad is paroled from McAlester prison, where he had been imprisoned after being convicted of homicide. On his return to his home near Sallisaw, Oklahoma, Tom meets former preacher Jim Casy, whom he remembers from his childhood, and the two travel together. When they arrive at Tom's childhood farm home, they find it deserted. Disconcerted and confused, Tom and Casy meet their old neighbor, Muley Graves, who tells them the family has gone to stay at Uncle John Joad's home nearby. Graves tells them that the banks have evicted all the farmers, but he refuses to leave the area.\nThe next morning, Tom and Casy go to Uncle John's. Tom finds his family loading their remaining possessions into a Hudson Motor Car Company saloon converted to a truck; with their crops destroyed by the Dust Bowl, the family has defaulted on their bank loans, and their farm has been repossessed. Consequently, the Joads have no option but to seek work in California, described in handbills as fruitful and offering high pay.\nThe Joads put everything they have into making the journey. Although leaving Oklahoma would violate his parole, Tom decides it is worth the risk, and invites Casy to join him and his family.\nTraveling west on Route 66, the Joad family find the road crowded with other migrants. In makeshift camps, they hear many stories from others, some returning from California, and the group worries about lessening prospects. The family unit dwindles, too: Granpa dies along the road, and they bury him in a field; Granma dies close to the California state line; and both Noah (the eldest Joad son) and Connie Rivers (the husband of the pregnant Joad daughter, Rose of Sharon) split from the family. Led by Ma, the remaining members realize they can only continue, as nothing is left for them in Oklahoma.\nReaching California, they find the state oversupplied with labor, so wages are low, and workers are exploited to the point of starvation. The big corporate farmers are in collusion, and smaller farmers suffer from collapsing prices. Weedpatch Camp, one of the clean, utility-supplied camps operated by the Resettlement Administration, a New Deal agency, offers better conditions, but does not have enough resources to care for all the needy families. Nonetheless, as a Federal facility, the camp protects the migrants from harassment by California deputies.\nIn response to the exploitation, Casy becomes a labor organizer and tries to recruit for a labor union. The remaining Joads work as strikebreakers in a peach orchard, where Casy is involved in a strike that eventually turns violent. When Tom Joad witnesses Casy's fatal beating, he kills the attacker and flees as a fugitive. The Joads later leave the orchard for a cotton farm, where Tom is at risk of being arrested for the homicide.\nTom bids his mother farewell and promises to work for the oppressed. Rose of Sharon's baby is stillborn. Ma Joad remains steadfast and forces the family through the bereavement. With rain, the Joads' dwelling is flooded, and they move to higher ground. In the final chapter of the book, the family takes shelter from the flood in an old barn. Inside, they find a young boy and his father, who is dying of starvation. Rose of Sharon takes pity on the man and offers him her breast, to save him from starvation."}