{"mid": "TheGhostAndMrChicken", "IMDB_id": "tt0059221", "title": "The Ghost and Mr. Chicken", "plot": "Luther Heggs is a typesetter at the Rachel Courier Express the local newspaper in Rachel, Kansas, but he aspires to be a reporter. One night, observing what he believes to be a murder outside of an old, supposedly haunted house known as the Simmons Mansion, Heggs rushes to the police station with his scoop. Unfortunately, as he relates the details of his story to the Chief of Police, the murder \"victim\" walks into the room, a local drunk who had merely been knocked unconscious by his irate wife, who had brought him in to be jailed. The next morning, Heggs walks downstairs to the dining room at the Natalie Miller boarding house and overhears Ollie Weaver (Homeier), a full-time reporter at the newspaper, mocking Luther's mistakes of the night before. Ollie is also dating Heggs' love interest, Alma Parker (Joan Staley). According to local lore, the Simmons Mansion was a \"murder house\" 20 years earlier, when Mr. Simmons murdered his wife (with some unknown sharp instrument that was never located — ultimately revealed to be a pair of gardener's pruning shears), and then jumped to his death from the organ loft. Legend has it that the ghost of Mr. Simmons can still occasionally be heard playing the organ at midnight.\nTo increase newspaper sales, Luther is assigned to spend the night in the house on the 20th anniversary of the murder/suicide. At midnight, Heggs sees the old organ begin to play by itself. There are a few other mysterious happenings, including Luther's discovery of a secret staircase to the organ loft, hidden behind a sliding bookshelf, and a pair of gardener's shears in the throat of a painting of Mrs. Simmons. His eerie story gets the town abuzz and causes a delay in the plans of Nicholas Simmons (Philip Ober), nephew of the deceased couple, who intends to demolish the mansion. In retaliation, and to discredit Heggs, Simmons sues both Heggs and the Rachel Courier Express for libel.\nIn the courtroom, Heggs' credibility is impeached by damaging testimony from his grade school teacher (Ellen Corby) who testifies that Luther was \"keyed up\" as a child, prone to telling tall tales for attention. Luther's own testimony is twisted by Simmons' attorney, suggesting that Luther concocted the story about his spooky night in the mansion in order to win a job as a full-time reporter. Luther's dramatic denial prompts the judge to order the jury and all interested parties to appear at the Simmons house at just before midnight to allow Heggs to prove his story. But with everyone now inside the mansion, nothing happens, and they conclude that Luther made up the whole story. Everyone leaves the mansion except for Alma, who lingers behind in secret, hoping to find evidence to restore Heggs' reputation.\nOutside the mansion, alone and dejected, Luther begins to walk home. However, he hears the old organ playing the creepy music again. Courageously, he re-enters the mansion and discovers his friend Mr. Kelsey (Liam Redmond), the newspaper's janitor, playing the organ. Kelsey, the former gardener for the Simmons family, confesses to being responsible for the mysterious happenings Heggs witnessed (including playing the organ remotely from an additional \"tuning\" keyboard located under the pipes). He tells Luther that Herkie, the overzealous police officer and acting security guard, kept him from entering the house earlier to help Luther confirm his story for the judge, jury and interested parties. Upon hearing a scream, they both descend the secret staircase to find Nicholas Simmons holding Alma captive. Kelsey confronts Simmons for killing his aunt and uncle for their fortune and leaving Kelsey's pruning shears behind to frame him (Kelsey had removed them before the police arrived to avoid being implicated in the murder). Nicholas Simmons' planned demolition of the house was an effort to destroy the hidden staircase that would ruin his alibi. Luther rescues Alma by knocking Simmons unconscious with a full body lunge (\"made my whole body a weapon\") from behind.\nNicholas Simmons is arrested and tied to a chair. Kelsey explains the details to the police chief and other persons (who have now returned to the mansion), and the case is closed. Alma takes Luther's hand, grateful for his heroic act in saving her. In the final scene, Heggs marries Alma at a small ceremony. At the end, the wedding's organ music suddenly changes to the spooky organ music of the Simmons' mansion. Everyone turns to see the small organ's keys moving by themselves, hinting that there really is a ghost after all."}