{"mid": "TheGoldenVoyageOfSinbad", "IMDB_id": "tt0071569", "title": "The Golden Voyage of Sinbad", "plot": "While sailing, Sinbad (John Phillip Law) comes across a golden tablet dropped by a mysterious flying creature. He wears the tablet as an amulet around his neck. That same night, Sinbad dreams about a man dressed in black, repeatedly calling Sinbad's name, as well as a beautiful girl with an eye tattooed on the palm of her right hand.\nA sudden storm throws the ship off course, and the next day Sinbad and his men find themselves near a coastal town in the country of Marabia. Swimming to the beach, Sinbad encounters a man demands that he turn over the amulet. Sinbad narrowly escapes into the city, where he meets the Grand Vizier of Marabia (Douglas Wilmer). The Vizier, who wears a golden mask to hide his disfigured face, explains that Sinbad's amulet is but one piece of a puzzle, of which the Vizier has another. The Vizier relates to Sinbad a legend, which claims that the three pieces, when joined together, will reveal a map showing the way to the fabled Fountain of Destiny, hidden on the lost continent of Lemuria. He who takes the three pieces to the Fountain will receive \"youth, a shield of darkness, and a crown of untold riches.\"\nSinbad agrees to help the Vizier in his quest for the Fountain, and they join forces against the evil Prince Koura (Tom Baker), the man from Sinbad's dream, a magician bent on using the Fountain's gifts to conquer Marabia. Koura had previously locked the Vizier in a room and set it on fire, resulting in the maiming of the Vizier's face. The creature that dropped the gold tablet was one of Koura's minions, a homunculus created by his black magic. Koura uses the creature to spy on Sinbad and the Vizier and learn of their plans.\nShortly afterward, Sinbad meets the woman he saw in his dream, a slave named Margiana (Caroline Munro). Her master hires Sinbad to make a man of his lazy, no-good son, Haroun (Kurt Christian). Sinbad agrees on the condition that Margiana comes along. Koura hires a ship and a crew of his own and follows Sinbad, using his magic several times to try to stop Sinbad. However, each attempt drains away a part of his life-force, and he ages noticeably each time.\nOn his journey, Sinbad encounters numerous perils, including a wooden siren figurehead on his own ship, animated by Koura's black magic, which manages to steal the map, enabling Koura to locate Lemuria. The wizard uses another homunculus to overhear the Oracle of All Knowledge (an uncredited Robert Shaw) describe to Sinbad what he will face in his search for the Fountain. Koura seals the men inside the Oracle's cave, but Sinbad uses a rope to get everyone out. Haroun manages to destroy the homunculus as it attacks Sinbad. After he is captured by hostile natives, Koura animates a six-armed Kali idol, causing the worshipful natives to set him free. Sinbad and his men arrive soon after. They fight and defeat Kali, and find the final fragment of the puzzle within Kali's remains; but the natives capture Sinbad and his crew and prepare to sacrifice Margiana to a one-eyed centaur, the Fountain's Guardian of Evil.\nSinbad and the others escape after the Vizier terrifies the natives into fleeing by removing his mask to reveal his charred face. After rescuing Margiana, they finally reach the Fountain of Destiny. They watch as the centaur fights the Guardian of Good, a griffin. With Koura's aid, the centaur prevails, only for Sinbad to stab and kill it. However, this gives Koura the opportunity to seize all three pieces of the puzzle. He drops two of them into the Fountain; the first restores his youth, while the second turns him invisible (the \"shield of darkness\"). Before he can claim the \"crown of untold riches\", however, Sinbad slays Koura in a sword duel. A jewel-encrusted crown then rises from the depths of the Fountain, which Sinbad gives to the Grand Vizier. The crown's magical properties cause the Vizier's mask to dissolve, revealing a restored, unscarred face. Their quest completed, Sinbad and his crew journey back to Marabia."}