{"mid": "TheHungerGamesCatchingFire", "IMDB_id": "tt1951264", "title": "The Hunger Games: Catching Fire", "plot": "Six months after winning the 74th Hunger Games, Katniss Everdeen and Peeta Mellark have resumed their life in the coal mining town in District 12. As part of their victory, they now have a luxurious house in the so-called Victor's Village, where Katniss lives with her mother and sister. On the day Katniss and Peeta are set to begin a victory tour of the country, President Coriolanus Snow visits her. He explains that her approach to ending the last Hunger Games, where she and Peeta attempted a suicide pact after learning they could not both survive, inspired rebellions in the districts. He orders that Katniss not only convince the entire country of her and Peeta's love as the reason for their actions, but convince Snow himself as well; if not, her loved ones will be killed, and District 12 will be destroyed, just as District 13 was during the uprising years ago.The first stop of the tour is in District 11, former home of Rue, Katniss' 12-year-old ally who was killed in the previous games. After Katniss and Peeta voice their personal thoughts regarding both the districts' fallen tributes, a man in the crowd whistles the tune Katniss and Rue shared to ensure each another of their safety, and makes the three-finger salute of District 12. Everyone follows the man's example until a Peacekeeper shoots the man dead, leaving Katniss angry, afraid, and upset. Their mentor, Haymitch Abernathy, informs Katniss and Peeta that they must display their relationship for the remainder of their lives.Katniss proposes a public engagement between herself and Peeta, which is carried out and celebrated at Snow's home in the Capitol. There, Katniss meets with the new Game-maker, Plutarch Heavensbee, who has specifically requested the position, in spite of his predecessor, Seneca Crane, ending up dead due to his inability to control the ending of the previous Hunger Games. Upon returning to District 12, Katniss warns her close friend, Gale Hawthorne, of President Snow's threat to kill both their families.In the meanwhile, Heavensbee assists President Snow in his efforts to quell the uprising in the District. His strategy is to taint Katniss' public image, in an attempt to destroy her as symbol for the uprising. To that end, Peacekeepers crack down in District 12, causing Gale to be publicly whipped after attacking newly placed Head Peacekeeper Romulus Thread. However, Katniss and Haymitch intervene, making them even stronger advocates for rebellion. That evening, Snow devises a different strategy; if Katniss refuses to play by his rules, he will get rid of her by other means. He announces Panem's third Quarter Quell, a version of the Hunger Games every 25 years that contains a special provision: all tributes are selected from the existing pool of victors. Since Katniss is the only surviving female victor of District 12, this means she is a tribute by default. She immediately devotes herself to ensuring Peeta becomes the Quarter Quell's victor, should he compete in the games.At the reaping, Katniss and Haymitch are reaped by chaperon Effie Trinket. However, Peeta volunteers to take Haymitch's place and is sent directly to the train with Katniss, without a chance to say goodbye to their loved ones. This also cancels their wedding, which was supposed to take place the next day.Katniss and Peeta are taken to the capital city, ride the parade again and are forced into training. They meet their fellow victors from the other Districts. The two of them are immediately wanted as allies by the majority of the tributes, although some of them are old, weak or ill-suited for the physical match. Still, she finds that some of them, while lacking in brute strength, may have valuable surviving skills. During their individual evaluations, Peeta creates a drawing of a deceased Rue covered in flowers on the floor; an emotion-stricken Katniss creates a puppet in the likeness of Seneca Crane, and suspends it by its neck on the ceiling, as a a warning to a stunned Heavensbee.During the personal interviews with Caesar Flickerman, Katniss wears a wedding dress (as ordered to by President Snow). As a special effect, her designer Cinna has designed it to turn into a costume resembling a Mockingjay, which has become a symbol of silent protest against the Capitol. When it is time for Peeta's interview, he reveals (falsely) that Katniss is pregnant, which incites an overwhelming reaction from the public to cancel the game; however, President Snow orders that the game proceed anyway.Before entering the arena, as the pedestal rises, Katniss witnesses Thread and his men entering the room and beating Cinna to death, in punishment over his controversial dress design for Katniss. Katniss is devastated, but unable to stop them. She ends up in the arena, which is a tropical forrest with a central salt water lake, with an island in the middle containing the Cornucopia.The games start in the usual chaotic way, with most tributes going for weapons at the Cornucopia, resulting in a lot of initial deaths. Katniss and Peeta manage to survive the first wave of killings, and hide inside the forrest. Snow hopes that Katniss will kill and betray as many other tributes as possible to stay alive, and thereby make herself unpopular. However, as the games get underway, Katniss and Peeta ally with Finnick Odair and Mags, both from District 4. They find that the arena is a dome protected by electrical orcefields; Peeta nearly dies after hitting the field, but is resussitated by Finnick. Later that night, they are attacked by a chemical weapon made up of a fog of painful poisonous gas. Mags sacrifices herself early on, allowing the others to escape. The remaining trio rests in the middle of the forest where they are attacked by mandrills. During the attack the woman from District 6, a camouflage expert and drug addict, sacrifices her life for Peeta. After they escape the mandrills and rest at the beach, they are met by District 3's intelligent tributes, Wiress and Beetee, and District 7's female tribute, the cunning Johanna Mason.Johanna tells about how her group was surprised by a rain of blood, causing them to become blinded, and one tribute getting killed by an electric forcefield. The group subsequently witnesses a large flooding, killing an unknown tribute in one section on the other side of the jungle. Wiress discovers that the arena is designed like a clock and every hour a specific attack occurs in its designated section. The other group of tributes then launches a suprise attack, causing several deaths in both teams, including Wiress. Heavensbee causes the Cornucopia island to start spinning violently. The spinning causes the team to break apart. Finnick and Katniss make it to the jungle, to be subsequently lured into the woods by screams from their respective girlfriend and sister; however, it appears that they are fooled by jabberjays, genetically engineered birds that mimic the sounds of human voices. They re-group with the others.Beetee suggests a plan to electrocute the two remaining tributes outside the alliance, District 2's Brutus and Enobaria, by connecting a wire to a tree that is struck by lightning at noon and midnight each day. Beetee secures the wire to the tree, and Katniss and Johanna are required to take the other end back to the beach. The plan fails when the wire snaps, cut by Brutus and Enobaria, who are ready to kill Katniss. However, Johanna suddenly attacks Katniss, but cuts the tracker out of her arm and smears blood on her neck. With Katniss appearing dead, Johanna lures the other tributes away. After recovering enough to track down Peeta, Katniss finds the rest missing and Beetee unconscious. Finnick approaches and Katniss draws her bow, no longer knowing who she can trust, but hesitates to shoot. The storm clouds swirl and the lightning bolt starts to form. She quickly attaches the remaining wire to an arrow and shoots it at the force field during the lightning strike. This causes a massive blackout in the dome, and the arena to shut down. President Snow enters the game room demanding answers, only to find that the game is off the air and Heavensbee is gone.Due to the impact of the electric blast, Katniss is near unconsciousness, but witnesses the arena dome starting to crumble. In her last waking moment, she notices an aircraft entering and picking her up.She awakens in an aircraft with an unconscious Beetee. Upon entering the cockpit she finds Haymitch, Finnick and Plutarch Heavensbee, who reveals himself as an ally and a turncoat-rebel against Snow. Learning she is on her way to District 13, and Johanna and Peeta were taken away by the Capitol, she attempts to attack Haymitch for not fulfilling his promise of returning Peeta home safely. Plutarch sedates her and she awakens days later with Gale by her side, who informs that her family is safe but District 12 has been destroyed by a government airstrike."}