{"mid": "TheHost", "IMDB_id": "tt1517260", "title": "The Host", "plot": "In 2002, an American military pathologist orders his Korean assistant to dump 200 bottles of formaldehyde down a drain leading into the Han River. Over the next four years, there are sightings of a strange amphibious creature in the waterway, and the fish in the river die off. A suicidal man, just before jumping into the river, sees something dark moving in the water.\nIn 2006, a slow-witted young man named Park Gang-du (Song Kang-ho) runs a small snack-bar in a park near the River with his father, Hee-bong (Byun Hee-bong). Other family members are Gang-du's daughter, Hyun-seo (Go Ah-sung); his sister Nam-joo (Bae Doona), a national medalist archer; and his brother, Nam-il (Park Hae-il), an alcoholic college graduate and former political activist.\nWhile Gang-du is delivering food to some customers, a huge creature emerges from the Han River and begins attacking people. Gang-du sees his daughter in the crowd and tries to grab her and run. As he realizes he grabbed on the wrong girl, he sees the creature snatching Hyun-seo and diving back into the river. After a mass funeral for the victims, government representatives and the American military arrive and quarantine people who had contact with the creature, including Gang-du and his family. It is announced that the creature is not only a direct danger, but also the host of a deadly, unknown virus.\nGang-du is in a hospital when he receives a phone call from Hyun-seo. She is on the phone long enough to explain that she is trapped somewhere in the sewers with the creature, but her phone stops working shortly after. Gang-du tries to explain this to others, but his claims go ignored by all except his family. The four of them escape the hospital. Hee-bong buys a truck, weapons, and a map of the sewers to look for Hyun-seo. They find a snack bar, have a meal and rest. Upon waking up, they encounter the creature. Soon, they discover their gun only serves to anger it, and Hee-bong gets himself killed buying time for his children to escape. Gang-du is captured by the Army. Nam-il and Nam-joo escape but are separated from each other.\nTwo homeless boys, Se-jin and Se-joo, are searching for food when they are attacked and swallowed by the creature. It returns to its sleeping area in the sewer, a large hole, and regurgitates them. Only Se-Joo is alive. Hyun-seo helps Se-Joo hide in a spot the creature cannot reach.\nNam-il meets an old friend to trace the location of Hyun-seo's call. He learns that the government has placed a bounty on his family. The friend tries to capture Nam-il, but he manages to escape after obtaining Hyun-seo's general location. He texts the location to Nam-joo and Gang-du. He meets a homeless man (Yoon Je-moon) who knows about the quarantine but decided to stay in the city. After learning of Nam-il's intentions, the man decides to help him. Gang-du overhears the scientists discussing the fact that there is no virus; it is all made up to distract people from the creature's origin. The scientists decide to lobotomize Gang-du to silence him. Gang-du escapes by taking one of the nurses hostage and continues searching for his daughter.\nBack in the sewers, while the creature is sleeping, Hyun-seo makes a rope from old clothes and uses it to get out of the hole. She realizes too late that the creature only feigns sleep to lure her out of her hiding spot. Hyun-seo and Se-joo are swallowed by the creature.\nThe government announces the plan to release a chemical called Agent Yellow into the river and the surrounding area, hoping it will kill the creature. Gang-du finds the creature's sleeping spot but sees no one there. As Gang-du climbs down to the hole, the monster passes over him. He sees Hyun-seo's arm hanging out of its mouth and gives chase, meeting Nam-joo on the way. The creature makes its way to the location where Agent Yellow is released and a large crowd has formed in protest.\nAs the creature attacks the crowd, Agent Yellow is released, which appears to stun the creature. Gang-du pulls Hyun-seo out of its mouth and sees her still clutching Se-joo. The boy is still alive, but Hyun-seo is already dead.\nAs the creature wakes up, Gang-du starts to attack it but is knocked to the ground. Nam-il and the homeless man come to Gang-du's aid. While Nam-il throws Molotov cocktails at the creature, the homeless man pours gasoline onto it. Nam-il accidentally drops his last bottle. Nam-joo picks up the flaming cloth from the bottle with one of her arrows and fires it at the creature, setting it on fire. Before the creature can escape into the water, Gang-du impales it with a metal pole, finally killing it. As Nam-il and Nam-joo hold Hyun-seo, mourning her death, Gang-du picks up Se-joo and takes him to safety.\nIn the final scene, Gang-du has adopted Se-joo. The two live in his food stand, and he still watches over the river. They have a meal together, ignoring a news broadcast about the aftermath of the incident."}