{"mid": "TheHealing", "IMDB_id": "tt2290836", "title": "The Healing", "plot": "Odong (Robert Arevalo) suffers from a severe stroke, Seth (Vilma Santos) decides to bring him to Manang Elsa (Daria Ramirez), a faith healer. Elsa, who apparently has the ability to heal people from illnesses, performs the \"healing\" and prescribes herbal medicine. As Seth and her father prepare to leave, a man, who is next in line to see Elsa, collapses and loses consciousness and so the people immediately brings him inside. Seth looks back at the commotion before going home with her father.\nThe following day, Seth is welcomed by her father, who has now regained his strength thanks to the healing. His recovery and miraculous healing astounds their whole neighborhood. Amazed by his grandfather's new-found health, Jed (Martin del Rosario), Seth's perturbed son, asks his mother for help for his half-sister Cookie (Kim Chiu), who is suffering from glomerulonephritis so that he could take her to Manang Elsa. Seth refuses because she does not want to be held accountable by her ex-husband Val (Mark Gil) and his wife Bles (Carmi Martin) in case anything goes wrong. Jed pleads very intensely and Seth eventually agrees to give them the address under the condition that they do not tell anyone that she gave it to them.\nOne evening, Seth arrives home and sees that there's a party. She's extremely disappointed to see that her father, who has much improved health, has gone back to his old drinking and even \"womanizing\" habits. Seth decides to veer her attention away from that and started talking to the guests at the party. She finds out that they also want to be healed. Seth's housekeeper Alma (Pokwang) reveals that she has a strange growth on her foot which has prevented her from migrating to Dubai; policeman Ding (Cris Villanueva) is suffering from psoriasis; neighbors: Chona (Ces Quesada), suffers from goiter and Greta (Ynez Veneracion) has found a lump in her breast. Cacai (Abby Bautista), the young daughter of Seth's close friend Cita (Janice de Belen), is blind.\nEventually, the group - along with Greta's husband Ruben (Allan Paule) and Chona's husband Rex (Simon Ibarra), go to seek Manang Elsa's help but Melchor (Joel Torre), her brother, informs them that Manang Elsa is sick and refuses to see anyone. Due to Seth's pleading, Manang Elsa eventually cures all of them. On the way home, Seth crosses paths with Jed and Cookie, who are now secretly going to the faith healer.\nThe following day, everyone except Cookie is healed. She is taken to a hospital due to a high fever. Seth is then confronted by her ex-husband and grows angry. Days pass and Cookie is finally healed. One night, Seth invites Chona to go to Ding's wedding reception, but Chona just smiled and went home, which confuses Seth and the others. When everyone went home, they were terrified after Chona is found dead after slashing her own neck with a knife after stabbing a man passing by. At her wake, Rex tells Seth that Chona had seen a crow in her dream before she died. The batch of people who were healed speak out about having had the same dream. Seth saw Dodi (Chinggoy Alonzo), a man they met at Manang Elsa's house, walk past her.\nThe following day, during a breaking news bulletin, they found out that Dodi murdered men at the gym and held his partner hostage. Dodi, looking insane, kills his partner and himself with a piece of broken glass. Seth and her neighbors discussed if there's a pattern of deaths. Ruben annoys his wife Greta that she's going to die next, much to Greta's anger.\nDuring a blackout that night, Seth was shocked to see Greta in her home. When Greta was walking away, Seth called her, but Greta suddenly looked back at her by stretching her neck backwards. Greta, who suddenly looked insane and is at home, stabs Ruben. Ruben then asked people passing by to help him, but the people were horrified when they saw Greta holding a huge machete while walking towards Ruben. Seth and Alma heard the screams of the people so they went out. Greta then decapitates Ruben before going back to the house to almost kill their sons. Seth and Alma followed Greta, but were horrified when Greta hanged herself. The next day Ding, who is on a raid at a sex den, kills the tenants and his teammates before his remaining teammates shoot him dead. Seth, worried about Cookie, explain to Jed on her behavioral changes and urges him to protect her. It turns out that the mysterious people who were healed that Seth saw were actually doppelgangers, who demonized the images of the people who were healed before their deaths. Seth is confused as to why her father has not suffered the same fate. She asks him if had seen a crow in his dreams, but instead tells her he had a wet dream, which annoys her. Seth, along with Cita, decides to confront Manang Elsa about the chain of deaths, only to be informed by Melchor, that she, along with his wife, had been killed by Dario, the man who much earlier, was thought to have only fainted but who had actually died from a heart attack. Melchor reveals the curse's real dark history that Manang Elsa unknowingly \"cured\" the dead, and now the life that was used to revitalize him was the lives of the following murdered patients that Manang Elsa \"cured\" after him. Melchor tells her that the best way to destroy the curse is to kill Dario again.\nSeth sets out to warn the others. While stuck in traffic, she sees Alma's doppelganger walk down the street towards Alma's dormitory. Seth calls Alma to warn her that her doppelganger is on its way to possess her. When Alma refuses to believe her, Seth sneaks into her apartment to find her but is too late. Alma, who has already been possessed by her doppelganger, murdered her dorm mates by throwing them off the balcony and sets herself on fire. Afraid for her daughter's life, Cita brings Cacai to a Chinese temple to be guarded by their relative monks. Inevitably, Seth sees Cacai's image and warns Cita. However, Cita is distracted by a dragon dance and loses Cacai who is then controlled by her doppelganger. Cacai massacres the praying monks and kills herself by jumping from the roof and getting impaled on a flagpole. Seth is haunted by the spirits of her dead friends, who blame her for their deaths because Seth is the key to the healer. Seth then goes to Cita who is watching her daughter get embalmed. Seth apologizes for not saving Cacai, but Cita tells her that there's still a chance to end the terror: Cookie.\nDetermined to save Cookie, Seth and Jed (who finally knows everything and resolved the mystery about the curse) takes her to a secluded house and installs CCTV cameras to monitor her. To avert the curse and the brutal killings and suicides, Seth goes to jail to see Dario (Jhong Hilario) and bring him food that she has poisoned. Dario reveals to her that he is no longer Dario but a different entity. He warns her that those who have been cured by Manang Elsa will be possessed by their own alter-egos and their souls shall be offered to him. He then tells her that the best way to end the bloodshed and the continuous spread of the curse is to kill him. Seth discards the plan of poisoning him as she cannot kill anyone. When she returns to the house where Cookie and Jed are hiding, she is attacked by Cookie's doppelganger who has yet to possess the real one, and manages to get rid of her by electrocuting her with a toaster. At the hospital, Cookie's parents apologized to a confined Seth. Seth then watched a news report about a suicide bomber that implanted a bomb on a bus, killing him and some other passenger. The bomber was also healed by Manang Elsa.\nAfter a few days, Cookie is chased by her doppelganger and possessed her. Jed found this out because of the CCTV camera showing Cookie's doppelganger chasing her. At her father's birthday party, Seth is visited by Cookie, who is already possessed but is only acting normal. When Seth is about to answer Jed's telephone call, Cookie then stabs her. While running away from the possessed Cookie, Seth finds Boni, her houseboy, dead with his neck twisted by Cookie. Jed arrives and stops the possessed Cookie from killing Seth.\nAs the fight rages, Cookie's doppelganger touches Jed's head, creating another doppelganger in Jed's image who then tries to stab Seth. At the prison, Dario is anticipating the new life that will be transported to him, but Melchor shows up at the prison and shoots him dead. A crow falls from the sky hitting the camera, showing the curse has ended. The doppelgangers disappear, the bloodshed ceases, and Melchor is pinned down by police officers. Seth and Jed,who are now free from the curse's reign of terror,shake the unconscious Cookie, who suddenly wakes up."}