{"mid": "TheHelp", "IMDB_id": "tt1454029", "title": "The Help", "plot": "In civil-rights era Jackson, Mississippi, 23-year-old Eugenia \"Skeeter\" Phelan (Emma Stone), a recent graduate of the University of Mississippi and an aspiring writer, attends a bridge game at the home of her friend Elizabeth Leefolt (Ahna O'Reilly). Skeeter's girlhood friends have all gotten married and started families, but Skeeter is disturbed to see how they treat their African American maids.Elizabeth's maid, Aibileen Clark (Viola Davis), fields a call from \"white trash\" Celia Foote (Jessica Chastain), who wants to help with a benefit being organized by the Junior League. Elizabeth and fellow socialite Hilly Holbrook (Bryce Dallas Howard), head of the local Junior League chapter, laugh at Celia's efforts to be accepted, as they don't think she's up to their social standards. (We learn later that Celia's married to Hilly's former boyfriend, which might have something to do with Hilly's attitude.) Celia mentions to Aibileen that she's looking for a maid. After refusing to use Elizabeth's toilet because Aibileen uses it (\"they carry different diseases than we do!\"), Hilly describes the Home Health Sanitation Initiative she hopes to get passed in the state legislature. The bill would require white-owned homes to have a separate toilet for the Negro \"help.\" This conversation is conducted within earshot of Aibileen.Skeeter has been assigned to write the Miss Myrna housekeeping column for the local newspaper. Because she has never had to do much housework herself, she asks Aibileen for assistance. In addition to doing all the cooking and cleaning for Elizabeth's family, Aibileen is the de facto mother of Elizabeth's toddler daughter, Mae Mobley (Eleanor Henry and Emma Henry), for whom Elizabeth shows heart-rendingly little concern. Every day Aibileen tells Mae Mobley, \"You is kind. You is smart. You is important.\"When Skeeter gets home, her mother, Charlotte (Allison Janney), is trying on a dress. Charlotte gets Skeeter to try it on and bugs her about still being single. Skeeter mentions the job she landed, and her mother frets that she'll never get married. Charlotte asks whether Skeeter is attracted to women, as she's \"heard of an herbal remedy than can cure such 'unnatural' urges.\" Skeeter is horrified.At dinner that night Skeeter makes a rude remark about liking girls and her mother excuses herself from the table because Skeeter has upset her cancerous ulcer. Skeeter runs to a favorite spot outdoors, a small bench under a tree, and remembers how Constantine (Cicely Tyson), the maid who raised her from a child, comforted her when she wasn't asked to a dance. Skeeter desperately misses Constantine, who according to Charlotte quit while Skeeter was away at college. Skeeter can tell there's more to the story, but no one will say what really happened. Disturbed by the sudden loss of Constantine and at how Elizabeth and Hilly treat their own maids with bigoted condescension, Skeeter conceives a writing project: a book about the lives of Jackson's maids. She describes the project to Elaine Stein (Mary Steenburgen), an editor in New York, and receives lukewarm encouragement; Elaine doubts that any maids will agree to participate. Skeeter approaches Aibeleen about the book, but Aibileen declines to be interviewed.Hilly's maid, Minny Jackson (Octavia Spencer), disobeys Hilly's order not to use the family's bathroom during a violent thunderstorm that makes a trip to the outhouse dangerous. Hilly fires her over the objections of her own mother, Mrs. Walters (Sissy Spacek). In retaliation, Minny makes a chocolate pie into which she has baked her own feces, and takes it to Hilly in a fake act of contrition. While Hilly greedily eats two slices, she asks why her mother can't have a slice, to which Minny explains that it's a \"special pie, just for Miss Hilly.\" A moment later Minny tells Hilly, \"Eat my shit!\" Hilly asks if Minny's lost her mind, and Minny replies, \"No, ma'am, but you is about to. 'Cause you just did.\" Hilly's mother laughs and laughs and Hilly retaliates by having her mother committed to a nursing home.Later that night, Minny's husband beats her while Aibileen listens on the phone.At church the next day, Aibileen hears a sermon about courage and changing her mind, resolves to help Skeeter with her book. She tearfully recounts to Skeeter and Minny the story of her son's death years before: At age twenty-four, Aibileen's son was run over by a truck at his workplace. The white foreman drove him to a colored hospital, dumped him on the ground, honked the horn, and left. By that point it was too late to save him, so Aibileen brought him home, where he died on the sofa right before her eyes. She expresses her pain, saying \"The anniversary of his death comes every year, and every year I can't breathe. But to you all, it's just another day of bridge.\" She becomes even more invested in the dangerous book project.Meanwhile Minny goes to work for Celia Foote, who's had no luck breaking into the Junior League social set and is therefore somewhat isolated. Celia pays Minny under the table because she doesn't want her husband to know that she has no domestic skills. Although she is generally suspicious of white people, Minny finds herself becoming more comfortable around Celia, who is bubbly and treats Minny with respect, but is deeply insecure. Minny improves Celia's dismal cooking skills by teaching her how to make fried chicken on her first day. They bond further when Celia suffers her fourth miscarriage. While Minny helps her into bed and soothes her, Celia is overwrought. She reveals that she married her husband Johnny (Mike Vogel) because she was pregnant, but quickly lost the baby and hasn't told him about the three failed pregnancies that followed. She worries that she will never be able to have children.Hilly's new maid, Yule Mae (Aunjanue Ellis), explains to her employer that her twin sons have graduated high school and that she and her husband have been saving for years to send them to college. However, they are short $75 on one tuition, and are on the verge of having to choose which son can go. Yule Mae respectfully asks Hilly for a loan, saying that she will gladly work for free until the loan is paid off. Hilly refuses, explaining that it's \"the Christian thing\" to do because God does not give charity to those who are well and able. While vacuuming Hilly's living room later, Yule Mae finds a ring, which she pockets and later tries to pawn, hoping to get the tuition money. Hilly finds out and has Yule Mae arrested at the bus stop in front of the other maids, all of whom are deeply shaken by the event.Aibileen recruits a reluctant Minny into the book project, but Elaine Stein (who's warming to the idea) insists the book will need at least a dozen voices -- including the story of Skeeter's own relationship with Constantine. After Yule Mae's arrest, nearly all the local maids volunteer to help with the book. Though she has changed the names of everyone involved, Skeeter remains concerned that people will recognize the maids and create more trouble for the Negro community in the wake of the recent murder of Medgar Evars. Minny insists that they include the story about Hilly and the chocolate pie -- which she refers to as her \"terrible awful\" -- as insurance against being identified; an embarrassed Hilly will not want anyone to know that she ingested her maid's feces and will do all she can to convince everyone that the book isn't about Jackson.Hilly has several times directed Skeeter, who writes the Junior League newsletter, to include an item about her proposed \"sanitation initiative,\" but Skeeter keeps putting her off. Now Hilly adds an item about a charity coat drive, the coats for which are to be dropped off at Hilly's house. Skeeter includes both items, but changes \"coats\" to something else.The next day Elizabeth gets a call and rushes herself, Mae Mobley, and Aibileen over to Hilly's, where Hilly is screaming, \"I told her to write 'coats'! Not 'commodes'!\" On Hilly's lawn are about 40 toilets. While Hilly continues her histrionics, Mae Mobley innocently sits on a toilet and Elizabeth slaps her till she sobs. Mae Mobley runs to Aibileen, who holds her and whispers, \"You is kind. You is smart. You is important.\"Skeeter eventually pries the story of Constantine's departure out of her mother: Charlotte fired Constantine because Constantine's daughter Rachel (LaChanze) refused to use the back door and embarrassed Charlotte while she was hosting an important DAR luncheon. Charlotte regretted it and tried to get Constantine to come back, going so far as to send her son, Skeeter's brother, to Constantine's new home in Chicago, but by the time he got there, Constantine had died.Skeeter's book The Help is published anonymously, and soon everyone in Jackson is reading it. True to Minny's prediction, Hilly is horrified to find the chocolate pie story therein and goes out of her way to assure her friends that The Help isn't about Jackson. Skeeter splits the advance she receives evenly among all the maids, promising that more is on the way. She's offered a job at the publishing house in New York, which she is disinclined to take, but Aibileen and Minny insist that she must.Stuart Whitworth (Chris Lowell), whom Skeeter has been dating, breaks up with Skeeter when he finds out it was she who wrote The Help. Hilly also figures out who wrote the book and storms over to Skeeter's house in a drunken fury. She threatens to tell Skeeter's mother, but Charlotte kicks Hilly off her property after insulting her and insinuating she knows about the pie. Charlotte tells Skeeter to take the job in New York, which Skeeter does, and Charlotte tells her she's proud of her.Celia works hard to prepare a lavish meal for Minny in gratitude for all she has done. Celia's husband, who has known all along that Minny is working for Celia, tells Minny she will have a job with them for as long as she wants it. Inspired, Minny leaves her abusive husband, taking their children with her.One of the final scenes shows Hilly taking in her mail. One item is a check for $200, a donation from Celia to the Junior League benefit. When she sees that the check is made out to \"Two-Slice Hilly,\" she throws a tantrum and tears it up.Hilly, falsely claiming that Aibileen has stolen some silverware, browbeats the weak-willed Elizabeth into firing Aibileen. When alone with Aibileen, Hilly cruelly tells her that while she cannot send Aibileen to jail for her involvement in the book, she can send her \"for being a thief.\" Aibileen snaps and finally stands up to Hilly, calling her a \"godless woman\" for her false accusations and for her conniving and backstabbing ways, at which Hilly bursts into tears of rage and leaves. Mae Mobley begs Aibileen not to leave her. They share a tearful goodbye, during which Aibileen repeats her affirming mantra: \"You is kind. You is smart. You is important.\" Elizabeth shows a rare glimpse of emotion, tearing up as she watches Mae Mobley bang on the window, crying for Aibileen to return. As she walks away, Aibileen promises herself that she will become a writer, as her son had encouraged her to do."}