{"mid": "TheHunger", "IMDB_id": "tt0085701", "title": "The Hunger", "plot": "The film opens in a New York night club. The gothic rock band Bauhaus is onstage performing the song \"Bela Lugosi's Dead\". In the crowd are John and Miriam Blaylock (David Bowie, Catherine Deneuve). Stylishly dressed and predatory, they stalk the crowd and connect with a young couple (John Stephen Hill, Ann Magnuson). The couple takes them back to their home, where John and Miriam seduce them before viciously slashing their throats. John and Miriam are vampires, although not in any traditional sense; lacking fangs, they use ancient Egyptian pendants to cut open the jugulars of their victims.The center of their strange existence is Miriam. She is an immortal being, able to pass along her supernatural qualities to selected human beings that she chooses to be her lovers. However, her progeny are not truly immortal as she is, and sooner or later, usually after 300 years or so, they find themselves suddenly and rapidly getting old. However, the progeny are unable to die, but continue to live forever withered, in a fully conscious, vegetative state. Miriam packs their decaying, aging bodies in caskets that she keeps in the attic of her residence. In the 18th century, Miriam offered this gift of immortality to John, who eagerly accepted, as had all her previous lovers through the ages.Suddenly, John develops trouble sleeping, and starts aging at a rapid rate. Miriam is aware of the significance of this happening, and she goes looking for a famous gerontologist, Dr. Sarah Roberts (Susan Sarandon), desperately seeking her help for a cure for John's fast deterioration. She makes contact with Dr. Roberts, and through her psychic powers, finds out that the doctor is just guessing, and that her research is inconclusive. Therefore, John, as all her lovers before him, is doomed to extinction. John also attempts to meet with Dr. Roberts at her clinic, but she dismisses his claims as delusional and leaves him to sit in the waiting room, hoping that he will grow bored and leave. John ages decades within a few short hours, and when Sarah sees him later, she begs John to stay so she can examine him. But John refuses to speak to her, his hunger for blood nearly overpowering him and forcing him to leave in search of a victim.Driven by his bloodlust and desperation to reverse the aging process, John makes a kill out of young Alice (Beth Ehlers), a music student that he and Miriam are tutoring. Her blood does nothing to help John, and he eventually falls down a flight of stairs at the townhouse, his legs no longer able to support his own weight. Miriam carries John's withering body up to the attic and puts him in a casket, next to several other caskets containing her earlier lovers.Later on, when Dr. Roberts shows up at Miriam's door looking for John, Miriam sees in the doctor a replacement for John in her life; it is love at first sight for Miriam, and she immediately proceeds to seduce Sarah. Sarah is a willing participant in Miriam's seduction, but she doesn't know that Miriam has now transformed her into a vampire, just as she did to John and her other lovers.Lieutenant Allegrezza (Dan Hedaya) shows up at Miriam's house looking for Alice, and is immediately suspicious of Miriam, although he has no real proof of any wrongdoing. Meanwhile, Sarah begins to manifest symptoms of vampirism. She is ravenously hungry, but eating normal food makes her vomit. She also starts seeing Miriam everywhere she looks. Finally she confronts Miriam about what happened between them on that day, and Miriam vaguely states that she has given Sarah eternal life, and that they belong to one another now. Sarah rejects what Miriam has told her, but she does understand that something terrible has happened to her. Sarah and her partners at the clinic, including Sarah's boyfriend, Tom Haver (Cliff De Young), cannot find a cure for the change that is occurring in Sarah's blood, and in desperation Sarah returns to Miriam. Miriam arranges for Sarah to make her first kill, bringing back a male prostitute, but Sarah is unwilling to take a human life.Finally, Tom arrives at the townhouse looking for Sarah following her disappearance, and is surprised to find that Sarah is there. Miriam knows that Sarah's hunger is now beyond reason, and when she takes Tom to Sarah, Sarah kills him for his blood. Miriam is now convinced that she has found her new lover, and she tells Sarah that they will now share an eternity together. Sarah, however, is wracked with guilt over taking Tom's life, and she attempts suicide by cutting her own throat with Miriam's ankh as they kiss. Sarah's blood pours into Miriam's throat and then Sarah collapses. Miriam is horrified at what Sarah has done, but she dutifully carries Sarah's limp body into the attic to place her among her other dessicated lovers. This time, however, she finds her crumbling lovers now out of their coffins, waiting for her. The sudden intake of Sarah's blood has caused a change in Miriam. Suddenly released from Miriam's spell, the lovers crumble into dust as Miriam herself begins to wither.The film's conclusion shows Lieutenant Allegrezza returning to question Miriam, only to find that the townhouse is now mysteriously empty and up for sale, all of the luxurious furnishings in the home gone and the money funneled to the sleep clinic where Sarah, presumably missing, used to work. In the final shot, we see Sarah herself living in a high rise luxury apartment surrounded by several lovers, while Miriam, imprisoned in a coffin just as she did to her own lovers, screams for her release."}