{"mid": "TheHarlemGlobetrotters", "IMDB_id": "tt0043621", "title": "The Harlem Globetrotters", "plot": "Abe Saperstein (Thomas Gomez), owner/manager of the world-famous \"Harlem Globetrotters\", an all-Negro professional basketball team, arrives with his team at a small town to play a game. The local college coach approaches Abe and tells him about local player, Billy Townsend (Billy Brown), who is just a sophomore but is an All-American and wants very much to play for the Globetrotters. The local coach asks Abe to turn Billy down if he comes to request a place on the Globetrotters. Billy does come to speak with Abe, and as requested, Abe tells him to stay in school, then to come see him after he graduates.Billy follows the team to their next game and approaches Saperstein again, telling him that he had dropped out of school and wanted to play for the Globetrotters. He convinces Abe that hes serious, and mature enough to know what hes about, so, Abe signs him to play.Billy struggles in practice against the veteran Globetrotter players, but he seems to be accepted well enough by them. Billy proves that hes talented enough, but in a game where the Globetrotters led by just one point, and after the coach directed the team to take the air out of the ball and just pass it around until the clock ran out, Billy went ahead and took a shot with about 15 seconds remaining. He made the shot, but the team and the coach were angry that he took the chance. Billy seemed surprised that they were upset about it, saying, its just a game. He found out it was much more than just another game to the team.Billy becomes a star on the team, but he still has a strong independent streak and often pushes the rules of the coach and the team. He sneaks out of the hotel before a big game and secretly gets married to his girlfriend, Ann Carpenter (Dorothy Dandridge). As Billy tries to hurry back into the hotel, to avoid people seeing him, Billy stumbles into a garbage can that is being carried by two men at the hotel. Already nursing a tender knee, the accident further aggravates the knee.Just before the game, he lies to the coach and tells him his knee is fine. As a result, Abe leaves him in the entire game, figuring his struggles during the game are simply a result of an off night. But, when Billy sets to take what would be the game-winning shot at the buzzer, his knee buckles and he misses the shot badly, and the Globetrotters lose.The game was one of three the Globetrotters played against the professional New York Celtics and it was a very tough loss for the team to suffer. When Abe finds out that Billy misled him, he fires him.Billy decides to go talk with the coach of the Los Angeles team and the coach agrees to sign him on if Billy promises to take it easy and not do anything to aggravate the knee until the next season. Billy then signs a four year contract for about $50,000.About the same time, Billy is approached by the head of the chemistry department at Baltimore State University (a school Billy once referred to as jerkwater). The professor offers Billy a job teaching introductory chemistry until it was time for him to start playing ball again. Billy, who was an honors student in chemistry, accepts the job, even if it was a jerkwater school in his opinion.The third game of the three-game series with the Celtics was coming up. Both teams had won one game each. Billy is scheduled to teach a class the night of the game, but when he learns half the university is going to be at the game, he decides he would like to go too, but he wants to go as a player. He goes to see Abe Saperstein and asks if he can suit up and sit on the bench. Abe says ok, without much discussion, and no argument. However, Billy doesnt simply sit on the bench, he starts.The game is back and forth, but Billy plays well and is in for the entire game. Again, it comes down to the last shot and its Billys shot again. This time the shot goes in, but his knee collapses again. Billy figures that doesn't matter, as everyones thrilled with the win and Billy has time to rest and heal up before the next season, which will be with the Globetrotters and not the L.A. team, as he automatically forfeited that contract by playing with the Globetrotters again."}