{"mid": "TheHeiress", "IMDB_id": "tt0041452", "title": "The Heiress", "plot": "Catherine Sloper (Olivia de Havilland) is a plain, painfully shy woman whose emotionally detached father, New York physician Austin Sloper (Ralph Richardson), makes no secret of his disappointment in her. He is terribly bitter about the loss of his charming and beautiful wife, whom he feels fate replaced with a simple and unalluring daughter. Catherine is devoted to her father, however, and too innocent to fully comprehend his mistreatment or the reasons for it. When she meets the charming Morris Townsend (Montgomery Clift), she immediately is taken by the attention he lavishes upon her, attention she so desperately seeks from her father. Catherine falls madly in love with Morris and they plan to marry.\nDr. Sloper believes Morris is an idler who is courting Catherine only to get her inheritance, and his interview with Morris' sister only reinforces his suspicion. He tells the young couple his opinion of Morris and takes Catherine to Europe for an extended time, but she cannot forget her betrothed. When they return to New York, Dr. Sloper threatens to disinherit his daughter if she marries Morris. Catherine does not care and plans to elope with him but not before telling him about her father's decision. On the night they are to elope, Catherine eagerly waits at home for Morris to come and take her away, but he never arrives.\nCatherine is heartbroken. A day or so later, she has a bitter argument with her father, who makes his disdain for her abundantly clear. Soon afterwards, he reveals he is dying. She tells her father she still loves Morris and challenges him to change his will if he is afraid they will waste his money after he dies. He does not alter the will and dies a short time later, leaving her his entire estate.\nA few years later, Morris returns from California, having made nothing of himself but still professing his love for Catherine. He claims that he left her behind because he could not bear to see her destitute. Catherine pretends to forgive him and tells him she still wants to elope as they originally planned. He promises to come back for her that night, and she tells him she will start packing her bags.\nCatherine coldly plots her revenge upon Morris. Her aunt asks her how she can be so cruel, and she responds, \"I have been taught by masters.\" When Morris returns, Catherine calmly orders the maid to bolt the door, leaving him locked outside, shouting her name. The film fades out with Catherine silently ascending the stairs while Morris' despairing cries echo unanswered in the darkness."}