{"mid": "TheHitchhiker", "IMDB_id": "tt0085031", "title": "The Hitchhiker", "plot": "While travelling through Utah, Jack Carter picks up a hitchhiker, but kicks him out after a few minutes due to the man hitting on him. Hours later, Jack stops in a secluded area, and begins digging a grave for the woman he had bound and gagged in the back of his pickup truck.\nFour women (Melinda, Patty, Kristina, and Denise) from Colorado Springs are driving through the area on their way to a nurse's conference in Las Vegas. Spotting Jack hitchhiking, the quartet pick him up, and soon after experience car trouble, forcing them to stop at a roadside motel. The manager tells the group that the nearest service station does not open until the morning, so they elect to stay. During the night, Jack shows interest in Melinda, and has rough sex with Kristina, who has a fiancé.\nIn the morning, the mechanic arrives, and is shot to death by Jack after the two travel to Jack's abandoned truck. Jack returns to the motel, where he murders the manager and takes the women captive after drugging them. Jack gives a misogynistic speech, and implies he is doing this due to having been \"betrayed\" by his girlfriend or wife. While sexually assaulting Denise and Melinda, Jack is knocked out by the latter, who tries to escape with her friends. The vehicles will either not work, or are missing their keys, so the women decide to kill Jack, who awakens while being attacked, and fatally shoots Kristina. The others are recaptured, and while Jack is binding Melinda (who he has developed a fondness for, and regards as \"special\") a married couple arrives, looking for a room.\nAfter giving the couple a room, Jack kills the husband when he goes to investigate noises coming from the room Melinda and the others are in. Jack places the man's wife, Susan, with the other captives, and shoots Patty in the head after Denise goes on an insult-laden rant against him. As Jack sleeps, Susan uses her cellphone to repeatedly dial 911, prompting a pair of police officers to stop by in the morning. Jack gets into a shootout with the officers, who he kills while Melinda, Denise, and Susan drive off in their patrol car. A chase ensues, during which Susan is shot in the head, and Jack is run over.\nWeeks later, Denise visits Melinda, and it is revealed that Jack had survived, and is being tried in Wyoming, where he murdered at least two women. That night, Jack, who had escaped from custody and hitchhiked his way to Colorado, breaks into Melinda's home, and ties her husband to a chair. Jack declares his love for Melinda, who responds by rejecting him, shooting him in the stomach, and then in the face."}