{"mid": "TheHarderTheyCome", "IMDB_id": "tt0070155", "title": "The Harder They Come", "plot": "Ivanhoe \"Ivan\" Martin is a poor Jamaican man in search of a job. He leaves his rural home, after his grandmother dies, to live with his impoverished mother in Kingston. He meets Jose, who takes him to see Django, a Spaghetti Western. Excited by urban life, he tries to get work but fails. He finally gets a job after taking a broken bicycle frame and rebuilding it into a working bicycle, and uses it to run errands for a record producer. When the frame's legal owner insists that it is still \"his\" bicycle, the two fight, and Ivan slashes him with a knife for which crime he is sentenced to a whipping.\nAfter this Ivan interests the record producer in a song he writes and performs, \"The Harder They Come\", but he only gets $20 for it. He dreams of stardom, but the stranglehold the producer has on the music industry condemns Ivan to work for a pittance. Eventually, Jose (played by Carl Bradshaw), one of the first people Ivan met after moving to Kingston, offers him an opportunity dealing marijuana, moving the drug from the country to the city on a motorbike. When Ivan complains about the pay and conditions, Jose informs on him to the police. On his next trip, when a policeman tries to flag Ivan to stop, he panics and shoots the officer.\nNext, Ivan meets a woman in a hotel. While he is in bed with her, the police surround the room and try to capture him. He shoots his way out, killing three officers.\nOn the run, he returns to shoot and wound the girl he slept with, believing she and Jose betrayed him. He then finds Jose and pursues him, shooting at him, but Jose escapes.\nIvan returns to the countryside, but the police catch up with him, leading to another shootout and escape. Ivan seeks support from his drug-dealer friends, who help him hide out. The policeman leading the search cracks down on the drug trade, telling the dealers he will not relax the pressure until they give Ivan up. Meanwhile, the record producer re-releases Ivan's song, which rapidly becomes a hit because of Ivan's notoriety. Enamoured of his new fame, Ivan has photographs of himself made holding two guns in gangster poses, and he sends them to the press. He also steals a flashy car and drives it around a golf course.\nOne dealer friend advises Ivan to escape to Cuba. Seeing the ship he hoped to escape on leaving, Ivan swims out towards the speeding vessel. However, he cannot grab onto the ladder dangling off the side, and he opens his eyes to find himself beached ashore.\nIvan sleeps in the shade of a tree then awakens, alerted to the presence of policemen with rifles. He exchanges shots with the police while imagining himself being watched by an excited, applauding audience, just like the one he had watched Django with. Out of bullets, he comes out and challenges the police to 'draw' as in a Western. The police shoot him many times, and he drops. The film ends abruptly, cutting to a shot of a woman's torso gyrating to the sound of Ivan's song over the credits."}