{"mid": "TheHungerGames", "IMDB_id": "tt1392170", "title": "The Hunger Games", "plot": "The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.Katniss Everdeen (Jennifer Lawrence) is a 16 year-old girl from District 12, a coal-mining region and the poorest of the districts. This year is the 74th Hunger Games and during the Reaping, Katniss' younger sister, Primrose (Willow Shields), is chosen as a tribute. Refusing to let her sister be taken, Katniss volunteers herself instead, becoming District 12's female tribute. The male tribute chosen is a baker's son named Peeta Mellark (Josh Hutcherson) who is later seen during a flashback giving bread to Katniss to prevent her family from starving.Despite the threat of the games, Katniss dreams of making a new life for herself and her family 'outside the fence' with her friend, Gale Hawthorne (Liam Hemsworth). She tells him that she never wants children and, despite her dreams, is realistic in knowing that if she and Gale tried to leave they would be caught. Before she leaves, Katniss comforts her mother (Paula Malcomson) and tells her to stay strong for Primrose.Katniss and Peeta are taken from their district by the gaudily dressed Effie Trinket (Elizabeth Banks) and travel to the Capitol. En route, they are fed rich food and treats but are disgusted by the amount of luxuries given to them and the occupants of the train while their families starve at home. They are introduced to their 'mentor' and a former winner of the Hunger Games, Haymitch Abernathy (Woody Harrelson) who appears to be a pessimistic alcoholic. Haymitch grabs a drink and food before leaving their train car. Katniss and Peeta later reunite with Haymitch in another car and he tells them that the key to survival is ensuring they are well liked by the public so that they may get sponsored. By having sponsors they will have more access to survival tools such as matches, knives, or even water and medicine.When they arrive in the gleaming city of the Capitol, the train is greeted by a cheering crowd. Peeta waves to the residents but Katniss refuses to show herself. Haymitch warns her that she better hold on to her knife and that Peeta actually knows what he is doing by feeding the crowd. Katniss meets her stylist, Cinna (Lenny Kravitz), who tells her that, as tributes, they need to make an impression on the audience so they're remembered, especially by the sponsors. Cinna proclaims that someone as brave as Katniss should have a great costume for the Gala Entry Parade in which each pair of tributes wears an outfit reflecting their district's trade. Katniss and Peeta wear black costumes with actual fire emanating from them to symbolize the coal-mining district they reside from. As Cinna hoped, they make a great impression on the audience. Peeta takes Katniss' hand and raises it into the air during the parade for more effect. After the parade the pair go to their penthouse.The tributes under-go basic weaponry and combat training including the use of knives, swords, and bows. In spite of this training their trainer stresses that survival skills should not be underestimated as exposure and infection can kill just as effectively as any sword. One tribute named Cato (Alexander Ludwig) is hot-headed and imposing, proving to be a possibly serious threat. Later, over a meal, Haymitch tells Peeta and Katniss about the Careers district from which Cato comes from. All of the possible tributes train until they're 18 before openly volunteering to participate in the Hunger Games. Haymitch warns them that they win almost every year due to that fact before asking about Katniss' bow and arrow skills. Katniss refocuses on Peeta, describing his impressive strength, but he rebuffs her compliments and confesses that his own mother (Raiko Bowman) thought Katniss to be the superior tribute.When Peeta is bullied by the other tributes during training, Katniss suggests he show off his strength by throwing a large weight across the room. Peeta manages to perform the feat successfully and gains a small amount of respect from the tributes. Later, in succession, each tribute is instructed to show off to the game makers and sponsors, including Seneca Crane (Wes Bentley). When it's Katniss' turn, she decides to show off her archery skills. However, she misses her first shot badly and loses what little attention she already had. Despite her perfect second shot, she doesn't regain their respect. Angered by the sponsors' attitude towards her, Katniss fires an arrow straight through an apple in a roasted pig's mouth, right in front of the stunned sponsors. Katniss sarcastically thanks them for their consideration and leaves. The tributes' scores are then displayed on a television screen, ranking from 0 to 12. Many tributes achieve high scores of 9 to 10, including the Careers Cato and his partner Clove (Isabelle Fuhrman). Peeta receives an 8 while Katniss scores an 11, the highest of all the tributes.The President of the Capitol, Snow (Donald Sutherland) addresses Seneca and tells him that the Hunger Games is about giving the districts hope but that too much hope can actually be dangerous. During another meal, Haymitch tells Katniss about Peeta's decision to go without his help because of the fact that there can only be one winner.On the extravagant Hunger Games TV chat show, each tribute is introduced individually and interviewed by the flamboyant host, Caesar Flickerman (Stanley Tucci). Katniss elicits laughs from the audience during the interview and impresses them by showing off her dress which displays real fire as she twirls. Ceasar gives her the nickname 'girl on fire'. During his interview, Peeta eats the audience up, garnering some laughs himself. It is then that he announces his crush on Katniss, something which angers her intensely. Backstage Katniss pins Peeta to the wall, demanding answers for his behavior. Haymitch separates the two and explains that he could sell the pair as star-crossed lovers which might gain them sponsorship support during the games.Just before the games, Haymitch warns Katniss to avoid the bloodbath at the beginning by heading to the high ground in search of water despite having to leave her bow and arrow behind. The tributes are all injected with a tracking device in their arms as they travel via helicopter to the outdoor arena. The tributes are then taken underground where they report to certain checkpoints before being loaded onto platforms that deliver them to the ground level of the arena. Before she is hoisted up, Katniss says farewell to Cinna who has seen her off. He tells her that, if he was allowed to bet, he would be on her winning. Then she, along with the other tributes, are raised into the arena and a countdown to the Hunger Games begins. As the horn sounds, the tributes rush towards the center cornucopia full of weapons and backpacks, brutally attacking and killing each other in the process. Katniss manages to grab a pack and barely escapes Clove, who embeds a knife in her backpack. Once at a safe distance, Katniss finds a rope, an empty canteen, and a coat inside the backpack. She takes Haymitch's advice and locates water in a nearby stream before she ties herself high up in a tree for the night and attempts to get some sleep. Loud bangs from a cannon indicate the deaths of tributes and we learn that thirteen were killed within the first 8 hours.During the games, Caesar keeps the public up to date with the happenings and announces that an alliance has formed. Katniss witnesses from her tree perch that Peeta has joined with a group of Careers during the night with the intent on leading them to her. While exploring the next day, Katniss gets too close to the outer regions of the arena. The game controllers decide to start a forest fire to lure her further in to the center. She barely manages to escape but does receive a nasty burn on her thigh, causing her to limp. She is then spotted by Cato and 4 other tributes, including Clove and Glimmer (Leven Rambin) who have banded together. We learn that, apparently, the Careers come, collectively, from Districts 1, 2, and 4 who are trained illegally before volunteering to fight; this group of 4 from two districts chases Katniss who eventually escapes by climbing a tree. Cato attempts to follow her up but is unsuccessful. Peeta suggests that the group wait for Katniss to eventually come down for food and water.The group settles for the night beneath the tree and Katniss ties herself to the tree to sleep. She is woken later that night by a parachute containing much needed medicine for her leg wound, sent by Haymitch. She applies the medicine to her burns and they disappear as if nothing happened. Her attention is then caught by a young 12 year old girl in an adjacent tree named Rue (Amandla Stenberg) from District 11. Rue, however, is friendly to Katniss and points out a large trackerjacker nest just above Katniss and dangling over the Career group below. We learn that trackerjackers are genetically engineering wasps whose stings are highly venomous and can cause powerful hallucinations. With enough stings, they can even kill. Katniss climbs up the tree towards the nest and begins sawing at the branch holding it up. The trackerjackers become irritated and start stinging her but, eventually, the branch snaps and the nest falls to the ground, exploding in a wave of wasps. The Careers group flees but Glimmer is stung too many times and succumbs to the venom.Katniss manages to climb down the tree and manages to grab a bow and arrows. As she begins to hallucinate, she sees Peeta approach her and seemingly yell at her to run. Regaining some sense, Katniss escapes but eventually collapses. After a night of hallucinations and nightmares, some involving her father (Phillip Troy Linger), Katniss awakens beneath a tree trunk with leave bandages covering her stings. Unclear as to who exactly helped her, Katniss stumbles around, thinking it must have been Peeta. Rue appears and tells her that she was out cold for 2 days and that she's been the one taking care of her. The two girls decide to team up and go on the offensive. They form a plan to destroy a mountain of food and supplies located in the starting meadow that the Career group is guarding. Rue is to start small fires to distract the remaining Careers while Katniss detonates the booby-trapped mines surounding the mound. They agree to use mockingjays, birds that mimic any tune, to signal to each other. The plan works. The Careers become distracted by the smoke of the fires while one tribute, a boy from District 3 (Ian Nelson), remains at the cornucopia, standing guard. Katniss then notices a female tribute unseen by the others. Foxface (Jacqueline Emerson) from District 5 sprints towards the pyramid of food and supplies, unnoticed by the guard. She picks her way through the mines, steals a backpack, and makes it back into the forest with great cunning.Katniss then shoots at a bag of apples on top of the pile which causes them to cascade down and detonate the mines. The pyramid explodes, sending food and supplies everywhere. Katniss watches, triumphant, as the Career group rushes back to the clearing. Infuriated, Cato demands to know how such a thing could have happened. The guard tribute from District 3 is equally confused but Cato's anger makes him murderous and he snaps the boy's neck. Katniss leaves, disturbed by Cato's ease to kill. She uses the bird call system to find Rue but receives no response until she hears a scared voice calling to her. Katniss finds Rue trapped under a net and releases her just before theyre attacked by Marvel (Jack Quaid), a tribute from District 1. Marvel throws a spear but Katniss dodges the attack and shoots an arrow into his chest, killing him. However, when she turns to Rue, she sees that Marvel's spear has gone through her chest. Distraught, Katniss tries to calm Rue and sings to her peacefully as Rue dies. Katniss then gathers flowers from the forest and spreads them over Rue before her body taken back to her district via hovercraft.Meanwhile, Rue's father is horrified and angered by his daughter's death and starts a riot. His district follows his rebellious example and they destroy the stage showing the games. As Katniss makes a peace gesture to the camera, the 'Peace Keepers' of District 11 arrive and shoot Rue's father dead. President snow is enraged by the rebellion in District 11 and wants to change the game's rules and circumstances to ensure that Katniss is killed. Haymitch pleads with Seneca to keep Katniss alive, issuing a ploy of teen romance as a main reason. Seneca then announces that the rules of the game have been changed; two winners instead of just one will be allotted so long as they belong to the same district. With this knowledge, and having just overheard the remaining Careers mention leaving Peeta for dead by the river, Katniss sets out in search of him. She finds a trail of blood near the river and follows it to where Peeta has camouflaged himself in the rocks. Katniss helps move him to a nearby cave where they are well hidden.Katniss attempts to heal Peeta's sword wound but realizes he has blood poisoning, something that can only be cured with a special medicine. Katniss despairs as there could be no way Haymitch could send some since it would be too expensive at this point. However, as if by magic, an announcement rings out that there will be a feast at the cornucopia for all the tributes but, instead of food, there will be something each tribute desperately needs. Peeta begs Katniss not to leave him and risk her life trying to save him. He asks her to stay and Katniss reluctantly agrees, though she knows there may very well be medicine at the cornucopia that could save his life. The two share a brief kiss, partly as a way to gain more sponsors. However, this hits a nerve with Gale watching back home who is clearly smitten with Katniss. Katniss waits until Peeta has fallen asleep before leaving for the cornucopia.When she arrives, she sees Foxface sprinting towards the supplies, surprising the other tributes with her speed and escaping without much incident. Katniss decides to mimic Foxface's moves and sprints out to grab the medicine but is thrown off guard when she is hit with a knife launched by Clove. The two wrestle and fight before Clove manages to get the upper hand and presses a knife to Katniss' throat. She teases her with bloodlust and mocks her for teaming up with the 'little monster from District 11'; Rue. Before Clove can slit Katniss' throat, she is lifted by Thresh (Dayo Okeniyi), the male tribute from District 11, and thrown against the cornucopia wall. He proceeds to beat her to death against the wall despite her cries for Cato. Thresh tells Katniss that she gets this one chance since she helped Rue but, after this, everything is fair game. Katniss escapes.She returns to the cave with the medicine and administers it to Peeta and herself, healing their wounds. In a more genuine romantic moment, the two fall asleep in each other's arms. The next day, they split up to find food. During her hunt, Katniss hears a cannon signaling another tribute death. Panicked, she runs back to where she last saw Peeta. She finds him near a berry bush, standing bewildered with a handful of berries near the corpse of Foxface, also with berries in her hand. In a mix of anger and relief, Katniss slaps Peeta, telling him that the berries are Nightlock and extremely poisonous. The pair wonder if Cato would ever fall for the same trap that Foxface did before they notice that the sun is going down at mid-day. Unsure of what's to happen, they freeze and ready themselves for an impending attack.In the distance, Thresh cries out followed by the sound of the cannon, signaling his death. They pause for a moment before a giant mutated dog leaps out at them, vicious and the size of a polar bear but with much more speed and agility. Katniss and Peeta sprint through the forest as two more of the dogs begin to pursue them. They are chased to the cornucopia where Peeta helps Katniss climb on top of it, barely making it up himself. They sit back in relief thinking the dogs will kill the last survivor, Cato, and they will be crowned the victors. Cato, however, is also on top of the cornucopia and attacks Katniss, attempting to throw her to the dogs. The three fight each other and Cato grabs Katniss by the throat, holding her near the edge of the structure before Peeta manages to fight him off her. Cato gets the upper hand and gets Peeta in a choke hold to either break his neck, as seen before, or throw him to the mutant dogs.Katniss unsheathes an arrow and points it at him, uncertain whether to shoot or not. Cato, dripping blood, laughs sadistically, telling her that he knows what the games are about now. The tributes aren't just entertainment; they're all weapons designed to make the spectacle of death as painful and unnecessary as possible. Peeta, who is still being choked, appears to try and tell Katniss something while Cato talks. Cato asks if she shoots him, then her 'lover boy' goes down with him. Katniss shoots his hand, forcing him to let go of Peeta. Peeta then pushes Cato off the edge to be mauled by the dogs. Katniss and Peeta watch a moment as Cato is savagely attacked before Katniss shoots an arrow into him, ending his misery. The last cannon goes off and Katniss and Peeta realize they've won the Hunger Games. They embrace and wait for a helicopter to come take them home.No helicopter comes. An announcement then states that the rules which allowed two winners has been revoked, meaning only one shall remain. Peeta begs Katniss to kill him so that she may win but she takes out her hand and holds out some Nightlock berries. She takes some for herself and gives the rest to Peeta, hinting that she'd rather the Capitol have no winners instead of one. Before they can commit suicide, a speaker pleads them to stop and announces that they have both won. They are brought back to the Capitol where Haymitch tells them how foolish they are to have defied the Capitol like that and instructs them to play up the star-crossed couple routine at their final interview. They oblige but Haymitch relents that it will never be enough for the Capitol.We see Seneca Crane being led into a finely polished room. The door is locked behind him while a goblet is set on a pedestal in front of him, containing Nightlock. Although we do not see it, we are led to believe that he is forced to commit suicide.Peeta and Katniss travel back in District 12 by train. Although they are met with a hero's welcome, Haymitch warns Katniss that she is now a political enemy after such a public defiance against the society's leaders. They are greeted by a crowd of cheering residents including Primrose, Katniss' mother, and Gale. Peeta takes Katniss' hand and holds it up in the air.President Snow watches the District 12 welcome from the Capitol. Walking away, he wonders what to do about the two victors and the feelings of rebellion they may have created in the Districts."}