{"mid": "TheHotelNewHampshire", "IMDB_id": "tt0087428", "title": "The Hotel New Hampshire", "plot": "This novel is the story of the Berrys, a quirky New Hampshire family composed of a married couple, Win and Mary, and their five children. The parents, both from the small town of Dairy, New Hampshire, fall in love while working at a summer resort hotel in Maine as teenagers. There they meet a Viennese Jew named Freud who works at the resort as a handyman and entertainer, performing with his pet bear, State o' Maine; Freud comes to symbolize the magic of that summer for them. By summer's end the teens are engaged, and Win buys Freud's bear and motorcycle and travels the country performing to raise money to go to Harvard, which he subsequently attends while Mary starts their family. He then returns to Dairy and teaches at the local second-rate boys' prep school he attended, the Dairy School. But he is unsatisfied and dreaming of something better.\nBrash, self-confident beauty Franny, is the object of her sibling John's adoration. John serves as the narrator, and is sweet, if naive. Frank is physically and socially awkward, reserved, and homosexual; he shares a friendship with his younger sister Lilly, a small, romantic girl who has \"stopped growing\". Egg, an immature little boy with a penchant for dressing up in costumes, is the baby of the family. John and Franny are companions, seeing themselves as the most normal of the children, aware that their family is rather strange. But, as John remarks, to themselves the family's oddness seems \"right as rain.\"\nWin conceives the idea of turning an abandoned girls' school into a hotel. He names it the Hotel New Hampshire and the family moves in. This becomes the first part of Irving's Dickensian-style tale. Key plot points include Franny's rape at the hands of quarterback Chipper Dove and several of his fellow football teammates. The actions and attitude of Chipper, with whom Franny is in love, are contrasted with those of her rescuer, Junior Jones, a black member of the team. The death of the family dog, Sorrow, provides dark comedy as he is repeatedly \"resurrected\" via taxidermy, literally scaring the family's grandfather to death at one point and foiling a sexual initiation of John's at another. John partakes in a continuing sexual/business relationship with the older hotel housekeeper, Ronda Ray, which ends when a letter arrives from Freud in Vienna, inviting the family to move to help him (and his new \"smart\" bear) run his hotel there.\nTraveling separately from the rest of the family, the mother and Egg are killed in an airplane crash. The others take up life in Vienna at what is renamed the (second) Hotel New Hampshire, one floor of which is occupied by prostitutes and another floor by a group of radical communists. The family discover that Freud is now blind and the \"smart bear\" is actually a young woman named Susie, who has endured events which leave her with little fondness for humans and feeling most secure inside a very realistic bear suit. After the death of his wife, Win Berry retreats further into his own hazy, vague fantasy world, while the family navigate relationships with the prostitutes and the radicals. John and Franny experience the pain and desire of being in love with each other. The two also feel jealousy when John becomes romantically involved with a communist who commits suicide, and Franny finds comfort, freedom and excitement in sexual relationships with Susie the bear and Ernst, the \"quarterback\" of the radicals. Lilly develops as a writer and authors the story of the family, under whose noses an elaborate plot is being hatched by the radicals to blow up the opera house, using Freud and the family as hostages, which Freud and Win barely manage to stop. The family becomes famous, and with Frank as Lilly's agent, her book is published for a large amount of money. The family (with Susie the bear) returns to the States, taking up residence in The Stanhope hotel in New York.\nIn the final part of the novel, Franny and John find a way to resolve their love, and Franny, with Susie's ingenious assistance, gets revenge on her rapist. Franny finds success as a movie actress and marries Junior Jones, now a well-known civil rights lawyer. Lilly is unable to cope with the pressure of her career and her own self-criticism and commits suicide. John and Frank purchase the shut-down resort in Maine where their parents met during the \"magical\" summer, and the property becomes another hotel of sorts, functioning as a rape crisis center run by Susie. Susie, whose emotional pain and insecurities have healed somewhat with time and effort, builds a happy relationship with John, and a pregnant Franny asks them to raise her and Junior's impending baby.\nThe novel is evocative of the New Hampshire of Irving's childhood."}