{"mid": "TheIceStorm", "IMDB_id": "tt0119349", "title": "The Ice Storm", "plot": "Set over Thanksgiving weekend, 1973, the film centers around two families: the Hoods (Ben and Elena and their children, 16-year-old Paul and 14-year-old Wendy) and their neighbors, the Carvers (Jim and Janey, and their children, Mikey and Sandy).\nBen, dissatisfied in his marriage and with the futility of his career, is having an affair with Janey. Elena is bored with her life and is looking to expand her thinking but is unsure of how to do so. Wendy enjoys sexual games with her school peers, as well as both Carver boys. Paul has fallen for a classmate, Libbets, at the boarding school he attends, though his roommate Francis is also interested in her.\nOn the Friday night after Thanksgiving, Ben and Elena have an argument when she learns of his affair with Janey, but they go ahead with their plans to attend a neighborhood party, which turns out to be a \"key party\", where married couples swap sexual partners by having wives select other husbands' keys from a bowl; Jim and Janey are also there. As the party progresses, Ben becomes drunk. When Janey chooses the keys of a handsome young man, Ben attempts to protest but trips and knocks his head on the coffee table, leading Jim to realize that his wife and Ben are having an affair. Ben, in his embarrassment, retreats to the bathroom where he remains for the rest of the evening. The remaining key party participants are paired off and leave together with only Jim and Elena remaining. She retrieves Jim's keys from the bowl and returns them to him. After debating the issue, Jim and Elena leave together, engaging in a quick, clumsy sexual encounter in the front seat of Jim's car. Jim, regretting the line he and Elena have just crossed, offers to drive her home.\nWendy decides to make her way to the Carvers' to see Mikey, but he has decided to go out into the ice storm, so she and Sandy climb into bed together and remove their clothes. They drink from a bottle of vodka and Wendy tries to seduce him; however, they both fall asleep.\nPaul is invited to Libbets' apartment in Manhattan, though upon arriving, is disappointed to learn that Francis was also invited. The three drink beer and listen to music; Francis and Libbets also take prescription pills found in Libbets' mother's medicine cabinet, causing them to eventually pass out. Paul decides to leave, just narrowly making the train about to leave for New Canaan.\nMeanwhile, Mikey, out walking in the storm, is enchanted by the beauty of the trees and fields covered in ice. He slides down an icy hill then sits on a guardrail to rest. A moment later a power line, broken by a fallen tree, connects with the guardrail and he is electrocuted.\nJim and Elena become stuck, due to a downed tree, and return to the Carvers' house as dawn is breaking. Elena walks in on her daughter in bed with Sandy and orders her to get dressed.\nJaney had also returned home earlier and curled up on her bed in the fetal position without bothering to take off her party clothes. Although it is not revealed what transpired between Janey and her 'key partner', she is visibly exhausted and sad.\nBen has sobered up by this time and begins driving home. He discovers Mikey's body on the side of the road and carries it back to the Carvers' house. The two families are drawn together by Mikey's death and Wendy hugs the shocked and numbed Sandy in an attempt to comfort him. Jim is devastated while Janey remains asleep and ignorant to the recent events. Ben, Elena and Wendy then drive to the train station to pick up Paul, who is returning from Libbets' apartment, his train delayed by the ice and the power failure caused by the downed wire. Once all four are together in the car, Ben breaks down, sobbing uncontrollably at the wheel as Elena starts comforting him."}