{"mid": "TheIntruders", "IMDB_id": "tt0071665", "title": "The Intruders", "plot": "20-year-old Rose Halshford (Miranda Cosgrove) moves to Chicago with her father Jerry (Donal Logue) after her schizophrenic mother Sophia has committed suicide some months earlier. Jerry, who is working as an architect, wants to help his daughter cope with their loss. But Rose, who has suspended her studies at Stanford University for one semester, does not feel comfortable in the hundred year old house, and is suspicious almost immediately.\nAfter speaking with Leila Markby, the girl living across the street, she confirms that her new house may be hiding a dark past. Leila's father Howard (Tom Sizemore) soon begins to show strange behaviour. After an uncomfortable night, Rose is surprised by the young craftsman Noah Henry (Austin Butler) coming into her house unexpectedly, whom Jerry has hired to do some renovation work. She befriends Noah, and at the same time tries to find out secrets surrounding the history of the house.\nWhile exploring the home, Rose finds a necklace, the head of a doll, and clues pointing to a \"Rachel\", a woman who lived in the house previously. Noah tells Rose that a few days before their moving in, he saw the windows in Rose's room locked with boards and a padlock on the door. Jerry is skeptical about his daughter's fears and thinks that she is delusional due to her mother's death.\nNevertheless, Rose continues her search and finds reports about the former inhabitants of the house. She finds that Cheri Garrison and her son Marcus accommodated the drug addict Rachel Winacott, who then disappeared. Howard was the prime suspect in this case, but he was acquitted because Rachel was said to have run away. He also explains this to Rose. Noah invites Rose to a pool party to distract her from her fears and sorrow. On the same evening Leila disappears.\nRose gets a copy of the construction plans of the house from the archive. When she goes to look at the plans, she faints, and is suspected of having abused pills. After her recovery she gets a message from Noah which lets her know about a hidden room. She finds such a room, and is attacked by Marcus Garrison. He forces her to put on Rachel's dress and tries to rape her, but Rose is able to get away, and in her escape she finds a tied up Leila. Jerry arrives home not long after, and tries to help his daughter, but is knocked down by Marcus. At the same time Rose stabs Marcus with a knife.\nAfter the horror has come to an end, Rose again moves to a new house with her father and continues her studies at Northwestern University, still haunted by her encounter with Marcus."}