{"mid": "TheInbetweeners2", "IMDB_id": "tt3097204", "title": "The Inbetweeners 2", "plot": "Will, Neil and Jay's girlfriends have all broken up with them since the events of the last film, and Simon is unhappy with his girlfriend Lucy, who has become obsessive and abusive. Simon and Will are depressed and ostracised at university; Neil is working in a bank; and Jay is taking a gap year in Australia. He emails Neil, claiming that he is now a top DJ at a popular night club, lives in a luxury mansion, and has daily sex with multiple partners. This convinces them to visit him in Australia for their Easter holidays. Once they arrive at the club they find that Jay in fact only works as a toilet attendant and lives in a tent in his Uncle's front garden, while Will meets Katie, an old friend from his private school days, who is backpacking, and she persuades him to join her.\nThe next day, the four travel to a youth hostel in Byron Bay, as Will wants to follow Katie there. He attempts to become friends with one of the backpackers, Ben, but is unsuccessful when the backpackers quickly deduce that he is a tourist, rather than a \"traveller\". Will struggles to fit in with the 'spiritual' activities of the travellers and discovers that Katie is seeing multiple people at once, launching him into one of his foul-mouthed tirades towards them, which leads Katie into having sex with Ben.\nThe boys and the backpackers visit a water park, where Jay intends to find his ex-girlfriend, Jane. The park staff tell Jay that Jane has found a new job in the vast Outback, which leaves Jay feeling very dejected. Neil pays for a swimming with dolphins session and this quickly turns sour when Neil's dolphin dies from being fed junk food that Neil smuggles in his wetsuit.\nJay gets Simon into trouble whilst walking to the Lazy River, because Jay deliberately blurted out that Simon was a paedophile in front of a passing family and he then deliberately nudged Simon into the water and he landed head-first into the lap of a child using a rubber ring, consequently leading to the child's father and another male beating him up. Neil gets into trouble by pooing down a water slide due to an attack of irritable bowel syndrome which proceeds to land into Will's face, Will consequently vomits everywhere, leading to everyone screaming and running away and the park being closed down; he berates Neil because Will was arrested.\nLucy tells Simon via Skype that Jane is working on a stud farm in the remote settlement of Birdsville, and the boys intend to drive there. Their car runs out of petrol in the middle of the desert. The group hold hands together as they realise that they will most likely die, but are rescued by Jane and her co-workers. She realises how far Jay came to win her over again, and although she is touched by the gesture, she does not take him back. Back at Jay's uncle's house, the boys find that their parents have travelled to find them after hearing of their near-death experience. The boys are shocked to find Mr Gilbert (their old head of sixth form and Will's nemesis) there too, and Will's mother announces that she and Gilbert are in a relationship, to the abject horror of Will and amusement of the other three friends. Over Skype, Lucy breaks-up with Simon because she is now in a relationship with his university 'best friend' Pete, which Simon responds to by cheering and abruptly hanging-up on her.\nThe four boys decide to travel to Vietnam in a montage during the film's credits. As they return to the United Kingdom, Neil begins a relationship with one of the travellers while Will's mother reveals that she and Gilbert are engaged. Will attempts to run back to the plane, but is wrestled to the ground by security."}