{"mid": "TheIncredibleMeltingMan", "IMDB_id": "tt0076191", "title": "The Incredible Melting Man", "plot": "A space rocket communicates with ground control at Houston (Dave Hull's voice). The astronaut, Steve West (Alex Rebar) reaches the rings of Saturn and sees the rising sun. A solar explosion reaches him immediately, and he passes out.Steve wakes up at hospital. Dr Leland Loring (Lisle Wilson) wonders aloud how he could survive, but the nurse (Bonnie Inch) can't give him an answer. He decides to call Dr. Ted Nelson (Burr DeBenning). He also stresses to her that Steve's condition must be kept secret. When both leave, Steve wakes up - his head has been completely bandaged, but he sees his monster hands. Taking away his bandages, he sees all the blisters. He becomes enrages. The nurse enters, sees him and runs away. There's nobody else in all the clinic, and monstruous Steve runs after her, who reaches the parking lot by going through a glass door.The two doctors check the dead body, and they find it died of radiation poisoning. They don't even know if it is a contagious condition. Ted phones General Michael Perry (Myron Healey), who insists in keeping the murder and everything secret.Steve has escaped into the woods, and he kills a fisherman (Samuel \"Sam\" W. Gelfman). Ted and Leland have a conversation in which Ted shows that he's feeling sympathetic towards Steve's plight. Perry phones Nelson at home, and he has to pretend that nothing is wrong in front of his wife Judy Nelson (Ann Sweeny). Outside, two boys (Stuart Edmond Rogers and Chris Witney) give a cigarette to their friend Carol (Julie Drazen), who finds it disgusting. She coughs, dislikes it and steps on it. They go playing, running around the forest. The girl gets lost and she finds the monster. She runs away in panic until she finds her mother (Leigh Mitchell), who tells her that Frankenstein (she refers to the Monster, not the doctor) doesn't exist.Nelson follows the radiation to the forest but can't find him. Sheriff Neil Blake (Michael Alldredge) is already investigating a murder. There is a photographer (Don Walters) who is pushed away. The body looks weird, and the locals get nervous. Nelson says that it must have been a bear, while Perry tries to hide his face. The photographer takes a picture of Nelson and Perry.West wanders aimlessly. Perry will have dinner with the Nelsons and reminds Nelson to keep quiet about their task. Nell Winters (Janus Blythe) and Matt Winters (Jonathan Demme) are going to visit their pregnant daughter, but silly Matt wants to find a shortcut through the forest. Nell and Matt walk, they kiss and stare at the full Moon. They get into their car because a wild dog scares them off. However, this is when they see Steve, who now looks like a monster-size bug, or moth.Steve West sleeps at a cemetery. He keeps on remembering his astronaut past, but he's becoming green goo. Judy stops sewing when the cat breaks a bottle of milk; then, her approaching husband scares her off. Nelson confides in her, and she's distraught about the death of her parents. The sheriff finds them. Nelson gives Judy a sleeping pill. The general stays with Judy while Nelson goes to speak with the sheriff, who gets angry with him because he's not collaborating with him; he even starts to suspect Ted.Another lady, called Helen (Dorothy Love) gets attacked at her home. Two security guards (Westbrook Claridge and Mickey Lolich) see West running around in the water plant they are watching. West throws a maintenance man (Keith Michl). Ted arrives and tries to reason with Steve, who pushes him over the balustrade to his death. Finally, Steve helps Ted. The two security guards appear. They shoot Ted, who was trying to talk to them, so Steve kills them both.Steve drips more and more. Now he looks like a human-size squid. He melts away and dies.The rising sun again. The dam has been saved. Steve is now a bloody mess. A janitor (DeForest Covan) is the first to arrive and sees the bloody scraps of meat. While a newscaster (Jennifer Mulaire) drools on and on broadcasting another mission being launched into space, the janitor puts the remains of Steve into the rubbish bin."}