{"mid": "TheIpcressFile", "IMDB_id": "tt0059319", "title": "The Ipcress File", "plot": "The novel is framed as the unnamed protagonist delivering his personal report on \"the IPCRESS affair\" directly to the Minister of Defence, thus making the novel itself the 'IPCRESS File' of the title. The events begin soon after his transfer from military intelligence to WOOC(P), a small civilian intelligence agency reporting directly to the British Cabinet, where he works under the command of a man named Dalby. An intelligence broker code-named \"Jay\" is suspected to be behind a series of kidnappings of highly placed and influential British VIPs with the intention of selling them to the Soviets, and the protagonist is assigned to meet with Jay in order to secure the release of \"Raven\", a high-ranking scientist and his latest target. After meeting Jay at a sleazy Soho strip club to negotiate Raven's release, the protagonist is abandoned; investigating his surroundings, he discovers Raven's unconscious body in a back room and attempts to rescue him, but is unsuccessful.\nWOOC(P) receives intelligence that Raven is to be transferred to the Soviets in Beirut, and a rescue mission is organised with Dalby and the protagonist participating. The protagonist is assigned as a lookout while Dalby kills Raven's captors and rescues him. The protagonist is forced to kill the occupants of a car which suddenly arrives on the scene in order to maintain the cover of the operation, believing them to be operatives working for Jay; they instead turn out to be members of ONI. The operation is otherwise a success and Raven is recovered, but the investigation into Jay continues. Dalby disappears, apparently going undercover, leaving the protagonist temporarily in charge of WOOC(P). At this point the protagonist's former superior from military intelligence, Colonel Ross, approaches the protagonist offering to sell him confidential information related to the affair. The protagonist rejects the offer in disgust, but begins to second-guess himself.\nCarswell, a statistician from another department assigned to the matter, begins noting a range of bizarre and seemingly irrelevant links between many of the kidnap victims. A break suddenly appears when Housemartin, one of Jay's high-ranking operatives, is arrested in Shoreditch for impersonating a police officer, but by the time the protagonist and Murray, another operative assigned to the case, arrive at the police station only to discover he has been murdered in his cell. Information from the arrest enables WOOC(P) and the police to storm one of Jay's safe-houses, but it has been abandoned. In order to help with the administration of the department, the protagonist is assigned an assistant, Jean, a beautiful young woman towards whom he begins to develop romantic feelings. Dalby re-emerges, and reveals intelligence suggesting that Jay's operations will interfere with an American neutron bomb test in the Pacific.\nDalby, Jean and the protagonist are sent to the test site as British observers, and while there the protagonist learns from an old friend, Barney, that the Americans suspect him of being a double-agent due to the deaths of the CIA operatives in Beirut. Jean reveals to the protagonist that Dalby has left been visiting an abandoned Japanese bunker on the island. Soon after, Barney is killed in apparently suspicious circumstances, and while following Dalby to the scene the protagonist is present when the bomb test site is sabotaged, setting back the bomb test and killing a military police officer. The protagonist is arrested by the Americans and interrogated, before apparently being transferred to Hungary on suspicion of being a Soviet agent. There, he is drugged and subject to days of psychological and physical torture, and nearly cracks before eventually managing to escape—only to discover that he is in fact in London. The protagonist takes refuge with Charlie Cavendish, the father of a friend killed towards the end of the Second World War, and attempts to reestablish contact with WOOC(P) without being arrested for treason. Charlie is killed by Jay's operatives, forcing the protagonist on the run; he approaches Dalby at his home, but discovers Dalby meeting with Murray, Jay and another of Jay's operatives—confirming the protagonist's suspicions that Dalby is in fact the traitor.\nThe protagonist is discovered by Murray, who reveals himself to be an undercover operative from military intelligence also investigating Dalby. The protagonist escapes, but is soon captured by Jay's operatives and taken to meet Jay—he has, however, allowed military intelligence to follow them, and Jay and Dalby are arrested by Colonel Ross. The protagonist reveals to Jean that Jay and Dalby were using a process called \"Induction of Psycho-neuroses by Conditioned REflex with Stress\" (IPCRESS) to brainwash the VIPs into loyalty to the Soviet Union, which they had also unsuccessfully attempted to subject the protagonist to. The seemingly irrelevant links that Carswell had discovered were in fact indicators of the personality traits that Jay had used to determine which VIPs would easily succumb to the process. Dalby was the one who had sabotaged the American bomb test, as part of Jay and Dalby's efforts to frame the protagonist. Colonel Ross reveals that his attempt to sell information to the protagonist had been a test of his loyalty, which the protagonist had passed by rejecting it. The novel ends with the protagonist concluding his report to the Minister, revealing that Jay has turned and began working for the British, while Dalby has been executed and his death covered up as a car accident."}