{"mid": "TheIcePirates", "IMDB_id": "tt0087451", "title": "The Ice Pirates", "plot": "The film takes place in a distant future where water is so scarce and rationed that it is considered an immensely valuable substance, both as a commodity and as a currency in ice cubes. The Templars of Mithra control the water and they destroyed worlds that had natural water leaving the galaxy virtually dry. Pirates dedicate their lives to raiding ships and looting the ice from the cargo holds to make a living.\nJason (Robert Urich) is the leader of a band of pirates that raided a Templar cruiser for its ice, and discovered a beautiful princess (Mary Crosby) in a stasis pod. He decided to kidnap her, waking her up, and alarming the Templars. Jason and his pirates fled, but were pursued by Templar ships. Jason let some of his crew, Maida (Anjelica Huston) and Zeno (Ron Perlman), escape while Roscoe (Michael D. Roberts) stayed to help Jason. They were captured.\nDuring their capture, they met Killjoy (John Matuszak) who has been pretending to be a monk to avoid being a slave. Jason and Roscoe are sentenced to become slaves, a process which includes castration. Roscoe and Jason are spared castration by the princess, who has taken an interest in them. Princess Karina purchased them as her slaves, to work as servants during her party. That evening, they were reunited with Killjoy (disguised as a robot). Jason, Karina, Roscoe, Killjoy and Nanny managed to leave the planet before the Supreme Commander (John Carradine) arrived to arrest her.\nPrincess Karina is spoiled, and she hired Jason so she can find her father, who went missing while searching for a planet with water. It is rumored he discovered one and the Templars would do anything to keep it a secret in order to maintain power. At some point, Jason keeps a secret that a nasty creature is hiding in their spaceship. Later, they are about to eat a turkey when something bursts out of it and runs away. Someone asks, \"What was that?\" Jason replies, \"space herpes\". On their next planet, Jason and Roscoe got reunited with their fellow pirates, Maida and Zeno. They proceed to locate the \"lost\" planet that contains massive amounts of water. The planet must be approached on a specific course or the ship will be suspended in time forever. The course apparently contains some sort of real or illusory time distortion (resulting in both the heroes and the villains reaching old age during the climactic battle).\nIn the end, the day is saved by the now-adult son of Karina and Jason, the result of a romantic tryst just before entering the time distortion field. As the heroes exit the field, everyones ages regress to what they originally were, leaving Jason and Karina with the knowledge that they will have a child together."}