{"mid": "TheInitiationOfSarah", "IMDB_id": "tt0077735", "title": "The Initiation of Sarah", "plot": "Twin sisters Sarah (Mika Boorem) and Lindsay (Summer Glau) are excited to attend Temple Hill University, where they will likely join Alpha Nu as their mother Trina Goodwin (Morgan Fairchild) was a previous member. Sarah finds herself immediately drawn to Finn, a student adviser that invites them both to Pi Epsilon Delta's rush week party. At the party the sisters are introduced to the Alpha Nu President, Corrine (Joanna Garcia), but Sarah ends up leaving the party in tears after accidentally spilling a drink on Corrine. Lindsay follows Sarah and accidentally breaks her ankle. They're brought into the Pi Epsilon Delta house, where Dr. Eugenia Hunter (Jennifer Tilly) introduces herself as a friend of their mother. The sisters are surprised to find that Lindsay's ankle has been healed. The following day Corrine ingratiates herself to Lindsay during a meeting at Alpha Nu, during which time Corrine takes the opportunity to take an eyelash off of Lindsay and pocket it.\nSarah is approached by Dr. Hunter, who tells Sarah that they both possess magical powers. This unnerves Sarah, especially after Dr. Hunter later tells her that the Pi Epsilon Deltas and the Alpha Nus are mortal enemies locked in a fight of good against evil, and that Sarah is the One- a person who could disrupt the balance. Sarah is further warned that as the One, the Alpha Nu wants to sacrifice her to the Eternal Flame with the Knife of Truth in exchange for immortality. Sarah tries to approach her sister with this, who angrily tells her that Sarah has always been the focus of attention as opposed to Lindsay herself and Lindsay ends up leaving in tears. After Corrine's vice-president Esme (Tessa Thompson) informs her of the fight, Corrine uses this to persuade Lindsay into joining the sorority in return for beauty and a chance to outshine her sister - an offer Lindsay eagerly accepts.\nThings grow more tense after Lindsay is forced to stay in the Pi Epsilon Delta following a fire and after making up with Finn, Sarah discovers that Trina Goodwin is not her true mother and that Trina actually killed their birth mother after a failed ritual. The Alpha Nus had believed her to be the One, which had been proven to be false after the Knife of Truth refused to cut her, as it will only cut the flesh of the One. Sarah also learns that the Alpha Nus are willing to kill her if they can't have her, which prompts her to try to rescue her sister from their clutches. She initially seems to be successful, as Lindsay appears to want to leave the group, but this is soon revealed to be a trap to capture Sarah and force her into sacrificing herself willingly. However everyone is shocked when a struggle reveals that the true One is actually Lindsay rather than Sarah, as the Knife of Truth ends up nicking her throat. They also find that the Knife can cut through anything if it has the blood of the One on it.\nCorrine immediately imprisons Lindsay in preparation for her initiation into the sorority and kills Trina Goodwin, as she is no longer of any use to Corrine. Sarah escapes with Finn and the two end up having sex in order to keep him from being sacrificed in a ceremony where the Alpha Nus will throw virgins into their Eternal Flame to keep it burning. Sarah and Lindsay are both initiated into their respective houses (Sarah into Pi Epsilon Delta, Lindsay into Alpha Nu) and Lindsay is horrified when she discovers that the Alpha Nus are intent on sacrificing her. Sarah manages to successfully rescue her sister, almost dying in the process, and after a struggle pushes Corrine into the Eternal Flame. After they return to the Pi Epsilon Delta house, Dr. Hunter uses Lindsay's inner power to heal her and the film ends with Esme walking off with a little bit of the Eternal Fire in a small cauldron."}