{"mid": "TheImitationGame", "IMDB_id": "tt2084970", "title": "The Imitation Game", "plot": "BASED ON A TRUE STORY.We hear Alan Turing saying, \"Are you paying attention? Good. If you're not listening carefully, you will miss things. Important things. I will not pause, I will not repeat myself, and you will not interrupt me. You think that because you're sitting where you are and I am sitting where I am, that you are in control of what is about to happen. You are mistaken. I am in control. Because I know things that you do not know. What I need from you now is a commitment. You will listen closely and you will not judge me until I am finished. If you cannot commit to this, then please leave the room. But if you choose to stay, remember that you chose to be here. What happens from this moment forward is not my responsibility. It's yours. Pay attention.\"It is 1951, in Manchester, England. Secret Intelligence Service (MI6) Headquarters intercepts a message that Alan Turing has been robbed at his place. Alan, now known as a professor at Cambridge, is visited by the police inquiring about his burglary. They find him in his home but he is dismissive towards them. They mention that he is an insufferable person and are suspicious that he is hiding something.In a flashback to September 1939 in London, War has been declared with 800,000 people being evacuated from their homes. On the train, a 27-year-old Alan Turing (Benedict Cumberbatch) admires a kid doing crossword puzzles. He arrives at Bletchley Park, guarded by Royal Naval officers. He waits in the office of Commander Denniston (Charles Dance). When the Commander arrives, Alan is cold and seems to lack humour. The Commander asks why Alan wants to work for the government; he replies he doesn't. He mentions that he's not very political and the Commander says it may be the shortest job interview ever. Alan mentions he doesn't speak German but tells the Commander that he's one of the best mathematicians in the world. He considers German codes to be like puzzles, which he enjoys solving. The Commander calls for Alan to be removed by his secretary so Alan mentions Enigma, revealing he knows about the top secret program he's being considered for. Alan explains that Enigma is the greatest encryption device in history and if the Allies can crack the code, it will end the war. The Commander says everyone thinks Enigma is unbreakable. Alan says to let him try and they'll know for sure.Alan is welcomed to Enigma alongside five others including Peter Hilton (Matthew Beard), John Cairncross (Matthew Beard), and Hugh Alexander (Matthew Goode). They have got their hands on an actual Enigma machine smuggled out of Berlin but they don't know the machine's settings to decode messages. Every night at midnight, the Germans refresh the settings; because they intercept their first message every morning at 6 A.M., the code breakers only have 18 hours a day to crack the code before it changes and they must start from scratch. Hugh, a chess champion, is able to calculate that this means there are 159 million million million possibilities every day. Alan is reluctant to work as a team; Stewart Menzies, the Chief of MI6, tells them that four men have died in the last few minutes because the code remains uncracked and orders them to begin.Alan tells us that all the messages are floating in the air for anyone to grab; the problem is that they are encrypted and there 159,000,000,000,000,000,000 possibilities. It will take 20 million years to try everything.The team wants to take a lunch break but when they invite Alan, he is cold and off-putting. They go on without him. Alan continues his work alone, on blueprints of a machine.In 1951, the detective from before finds out that Alan's records are classified. He doesn't know why a math professor would have classified records and becomes suspicious. He uses a typewriter to falsify a document, allowing him to secure Alan's service records.Back in 1939, Alan complains to Commander Denniston that Hugh Alexander has denied funding for the parts he needs to build a machine. The commander tells him the other code breakers do not get along with him and he should take up the complaint with someone else. Alan suggests firing them all and using the funds for his machine. He says he only needs 100,000 pounds only a machine can defeat another machine. Alan asks who the Commander's commanding officer is; he is told Winston Churchill. Alan gets a letter to the Prime Minister via Stewart Menzies. Churchill puts Alan in charge, overriding Hugh's authority. Alan immediately fires two of his teammates, calling them mediocre linguists and poor code breakers. He is asked if he was popular at school.Flashback to Charles as a schoolboy he was picked on for having a form of OCD, keeping the carrots and peas separate during lunch. His classmates pour food on him; bury him under the floorboards. He tells us, \"Do you know why people like violence? It is because it feels good. Humans find violence deeply satisfying. But remove the satisfaction and the act becomes hollow.\" When Alan is able to remain calm under the floorboards, the other kids leave him alone. He is rescued by a fellow student named Christopher (Jack Bannon). Christopher says they beat Alan up because he's different. Alan says he's an odd duck. Christopher tells him, \"Sometimes its the very people who no one imagines anything of who do the things no one can imagine.\"Now short on staff, they decide to find new members of the team by placing a difficult crossword puzzle into newspapers to be mailed in upon completion; anyone who can solve it is a good candidate. The war rages on, with many hiding out in bomb shelters. The handful that managed to solve the puzzle are gathered together to take a test. One young woman, Joan Clarke (Keira Knightley), shows up late because she claims that her bus had a flat tire. They think she is in the wrong room. She tells them that she has solved the crossword puzzle and everyone is skeptical. Alan tells her to take a seat. He has the room solve a very difficult puzzle in six minutes although it will take an expert like Alan eight minutes. Surprising them, Joan solves it in five.Joan and one other man are kept afterwards and told that they are not allowed to share what they are about to be told or they'll be executed for high treason. They are ordered to lie to everyone they know about what they are going to be doing. Joan asks what he is referring to. She is told she will be helping to break an unbreakable Nazi code and win the war.In school, a young Alan bonds with Christopher, who shares with him a book on code and ciphers. The awkward Alan compares cryptic messages with how people talk they say one thing, have hidden intentions beneath their words, and he doesn't know how to decipher them.It is now several months later in 1940, Bletchley Park. The supercomputer is being hooked up in a secret hut. Alan is concerned when Joan does not show up. He goes to her home and tries to convince her parents that she's very necessary at the radio factory that wants to employ her. Joan comes home and talks to Alan in private, although her parents are listening in Joan explains that it is indecorous for her to be working and living among men (according to her parents); Alan loudly suggests she work in the clerical department with women (although she won't really be doing this). Apparently, this is convincing enough because Joan packs up and leaves with Alan. She wonders why he is so fixated on helping her; he responds that \"Sometimes its the very people who no one imagines anything of who do the things no one can imagine.\"In 1951, Detective Nock shares with Superintendent Smith that Alan's classified military file is empty. His war records aren't classified; someone has burned and erased them. They suspect he is a Soviet spy.In 1940, Joan arrives at Bletchley Park under the guise of a clerical worker. In narration, Alan tells us that the British were literally starving to death; every week, Americans would send 100,000 tons of food to them and every week, the Germans would send it to the bottom of the ocean. Every night at midnight, a bell sounds, telling them their day's work has been wasted (since the code is reset at midnight). Frustrated, Hugh visits Alan, tinkering with his machine (referred to as Christopher throughout the film, named after Alan's childhood friend). A frustrated Hugh grabs a wrench to destroy the machine but the others hold him back. Hugh tells him that the machine is useless and there are legitimate ways to help in the war. One of the others, Peter, explains that his brother and cousins are actually fighting in the war while they have nothing to show for all of their work because of the machine. Alan is adamant the machine will work.Later, Alan is in the hut alone. He removes a stack of Enigma messages and stashes them in his socks. They manage to go undetected by the guards at checkpoint. He sneaks over to Joan's home and climbs through her window. He reveals the decrypted Enigma messages, delivered from Nazi high command they read one with the weather report, ending in \"Heil Hitler\". Joan and Alan talk about Christopher and the concept of a digital computer.The next day, Alan enters the hut to find military police rifling through his desk while the other code breakers watch. Commander Denniston explains that there is a spy in Bletchley Park and they suspect it's one of them. The Commander shows Alan a telegram that was intercepted on its way to Moscow, which is encrypted with a key phrase. They suspect Alan because he's arrogant, has no friends or romantic attachments, and he is a loner. Commander Denniston says he will no longer have to fire him he can hang him for treason if he's caught.Joan greets Alan, working on Christopher, and tries to cheer him up by taking him to a beer hut. Hugh, John, and Peter enter the hut and Joan is friendly towards them. She tells Alan in private that she's a woman in a man's job and doesn't have the luxury of being an ass. She says it doesn't matter how smart he is; Enigma is smarter and Alan needs all the help he can get. But his team will not help him if they don't like him. The next time he sees them, he brings apples since Joan has suggested he give them something. He then tries to tell a joke.In a flashback to his schooling, Christopher is caught passing a note to Alan. The teacher mocks them for the note being in gibberish (he doesn't know it is encrypted). Alan retrieves it from the garbage and breaks the code later \"See you in two long weeks, dearest friend.\" The school is going on holiday.In 1941, at Bletchley Park, Joan and Alan are bonding over codes. Hugh Alexander approaches, telling Alan that if they run the wires on Christopher diagonally, they'll eliminate rotor positions 500 times faster. Alan is able to utilize this idea. The machine is turned on; it is the very first digital computer. And it works. They wait to see if it can tell the the day's Enigma settings.We see footage of the war. In Denniston's office, he is told that the machine is not producing any results. He surprises Alan at the hut, who barricades the door, trying to keep him out. They force the door open and turn it off. Commander Denniston tells him his machine doesn't work because it hasn't broken Enigma. Denniston's associate from the home office is upset about spending a hundred thousand pounds with nothing to show for it. Alan tries to defend his machine but he has not decrypted a single German message; the Commander fires him. But he is stopped short by Hugh, John, and Peter who say that if he fires Alan, they will have to be fired, too, because they believe his machine can work. Hugh reminds the Commander that they're the best cryptographic minds in Britain and asks to be granted six more moths. Commander Denniston tells them one more month or they're all gone.At the beer hut, Hugh tells Alan that he cracked the encrypted message \"Ask and it shall be given you; seek and ye shall find. Matthew 7:7.\" He knows that Alan is not the spy because he would not have used a simple Bible quote for his code.In 1951, Detective Nock and Superintendent Smith are told by a sergeant that he has found out that Alan is a \"poofter\" (British slang for homosexual). He has been caught with a male hustler, who later robbed his house. That was the piece of information that he was hiding from the police, not that he's a spy. The detective is sure Alan is hiding something else so he asks for him to be arrested so he can interrogate him.In 1941, Joan comes home to find Alan there, using her flat to try to solve mathematical equations so Christopher can run through more settings per 18-hour block. She interrupts Alan to tell him that she has to return home; her parents are unhappy with her being 25 years old and unmarried. He suggests she get married. She suspects he is suggesting Hugh or Peter but of course, he means himself. He proposes with a piece of electrical wire, rolled into a ring.An engagement party is thrown at the beer hut. While Joan dances with Hugh, John Cairncross talks to a sullen Alan who admits he is a homosexual. John is sympathetic and tells Alan that he already suspected that for some time. John suggests that Alan keep it a secret because homosexuality is illegal and, on top of that, Denniston is looking for any excuse to put Alan away.At school, everyone returns from holiday. A young Alan encrypts the message I LOVE YOU and prepares to give it to Christopher but he never shows up.In 1951, Alan is interrogated by Detective Nock. The detective asks if machines can think. Alan notes that he must have read his published work since he was called in on charges of hiring a man to touch his penis, not on computers. Alan says \"machines can never think as humans do but just because something thinks differently from you, does it mean its not thinking?\" He tells the detective, \"We allow for humans to have such divergences from one another. You like strawberries. I hate ice-skating. You cry at sad films. I am allergic to pollen. What does is the point of different tastes different preferences if not to say that our brains works differently, that we think differently? And if we can say that about one another, then why cant we say the same things for brains made of copper and wire and steel?\" The detective asks him about the paper he wrote, The Imitation Game. Alan tells him is a test to determine whether something is a machine or a human being. The detective asks him what he did during the war and Alan tells him he worked at a radio factory. Detective Nock knows this isn't true.In 1942, Alan and his team wait for Christopher to crack the code but then the midnight buzzer sounds. The machine will never be able to process so many possibilities in an 18-hour time.At the beer hut, Joan's friend, Helen, is admiring Hugh. Hugh finally approaches her, with Alan by his side. To charm Helen, Hugh tells her that Alan believes men and women should not work together because it will lead to romance although Hugh personally believes that women are smart and should be considered equals. Helen says she agrees with Alan because she has a male co-worker that she has garnered a crush on; upon further inquiry, she reveals she intercepts messages from a German radio tower and she has been assigned one counterpart. She says she has grown fond of him but unfortunately, he has a girlfriend. Hugh steals Helen and they go off to the bar. Alan is lost in thought and then calls out to Helen. He asks her why she thinks he has a girlfriend. Helen says because every message begins with C-I-L-L-Y, which she assumes is the name of his love. Alan tells her the Germans are instructed to choose five letters at random to start each message but because he is in love, he uses the same five letters every time. Alan remarks that love just lost the Germans the whole bloody war.Everyone chases Alan as he rushes across Bletchley Park, past guards and security checkpoints. They get into their hut and Alan pours out previously decrypted messages. He points out that Christopher doesn't have to search through every possible settings; the computer can search for ones that produce words he knows will be in the message. They realize the entire 6 A.M. weather reports end in \"Heil Hitler\". They can have Christopher search for the words weather, heil, and Hitler to crack the code. They test it on a 6 A.M. message. Christopher comes to a stop. They take the letters it produces and run back to the Enigma machine, typing in the same letters. They are able to decode a message. They've cracked the code!The team works throughout the night. They have decoded messages and translated decrypts, now able to produce a map that represents all of their ships versus the Axis ships. John tells them, There are five people in the world who know the position of every ship in the Atlantic. They are all in this room. Joan realizes that they're going to attack a British passenger convoy as they are positioned 20 minutes away. Hugh tries to call Denniston to warn him but Alan stops him, ripping the phone out of the wall. Everyone argues. Alan tells them they have to let the U-Boats sink the convoy or else it will gives the Germans a heads up that they have cracked Enigma. They will stop radio communication and change the design of Enigma immediately. In order to keep their work secret and win the war, they have to allow the lives of hundreds of innocent people to be lost. Peter breaks down, realizing that his brother is on one of the convoys. He demands that they alert Denniston of just that one ship but Alan simply apologizes. Peter tells him they don't decide who lives or who dies; Alan says they do because no one else can.Alan and Joan ride the train into London. They meet with Stewart Menzies in a teashop. They reveal that they have broken Enigma but ask for Stewart's help in determining how much intelligence to act on, which attacks to stop. He can come up with believable sources of information so the Germans don't suspect Enigma has been cracked.Peter harbours animosity towards Alan for letting his brother be killed despite knowing it in advance. He knocks his books over and while retrieving them on the ground, Alan spots John Cairncross' Bible. He opens it and realizes that it earmarked to Matthew 7:7. John notices Alan making this discovery, now aware that John is the Soviet spy. In private, John tells Alan that the Soviets and Britain are on the same side; he then threatens Alan that if he tells his secret, he'll reveal that Alan is a homosexual and his work will be destroyed.Alan tries to call Menzies but knows his calls are being intercepted. He returns to Joan's flat and Stewart Menzies is there; Alan is told that Joan is in military prison after discovering that she was the Soviet spy -- they have found Enigma messages in her things. Alan tells him that he gave her the intercepts when they were trying to crack the code. Stewart says Denniston is looking for a spy in their hut and Alan tells them the spy is actually John Cairncross. Stewart admits to knowing this before Cairncross even got to Bletchley; this is exactly why he placed them there so they could leak whatever they wanted to Stalin since Churchill was too paranoid to share information with the Soviets. Cairncross is unaware that he is being used by them. Stewart says he needs Alan's help to know what to leak to John and feed to the Soviets. Alan says he's just a mathematician, not a spy, but demands that Joan is released. Stewart reveals he lied about her being in a military prison but threatens to use the Enigma messages against her if Alan doesn't cooperate.Alan encourages Joan to leave Bletchley, knowing she is in danger, but it is too risky to tell her this explicitly. To get her to go, he reveals that he's a homosexual. Joan responds with indifference. She tells him she had her suspicions about him for some time, but doesn't think they can't love each other in their own way. Joan tells Alan that despite the fact that he only loves her as a friend, that they'll be in a marriage built on companionship and intellectual stimulation rather then love since most married couples that love each other end up divorcing anyway. Alan then lies and tells her he doesn't love or care for her and was only using her to break Enigma. She slaps him and tells him she's not going anywhere, despite all the low expectations placed on her by men and her parents. She calls him a monster.We see more stock footage from World War II. In voice-over, Alan says that every day, they decoded messages and the war wasn't determined by the bombings and fighting but a team of six crossword enthusiasts in a tiny village in England. We see everyone celebrating on V-E Day of May 8, 1945. Menzies tells the group that before they can return to their lives at university, they have to burn all evidence that they cracked Enigma because it may be used again for future wars. They also have to pretend they have never met each other.In 1951, the interrogation of Alan by Detective Nock continues. Alan tells him he has told him his story and now the Detective has to play the Imitation Game and answer if he's a machine, a person. \"Am I a war hero?\" he asks. \"Am I a criminal?\" Detective Nock tells Alan he can't judge him. Alan tells him he's no help to him at all (because he doesn't know how to judge himself).In another flashback, Alan is called to the principals office and asked about his friendship with Christopher. He vehemently denies being friends with him, afraid they are aware that it is romantic. The teacher tells him he asked because he heard they were close and wanted to inform him that Christopher has died over the holiday break; he had bovine tuberculosis and never told Alan.Six months after his interrogation, the detective is congratulated after Alan has been sentenced for indecency (homosexuality). Joan goes to visit the older Alan at his home. She says that she would have testified on his behalf, to keep him out of jail. Alan is shaky and reveals to her that the judge gave him a choice: two years in prison or two years of weekly and experimental estrogen treatments. The hormonal therapy is designed to cure his homosexual predilections. He wouldn't be able to continue his work from prison and if he's taken away, they'll destroy Christopher, despite all the work he's done on him over the last ten years. He has a panic attack and she calms him down. He notices her wedding ring and she tells him about her husband. She asks him to do a crossword puzzle for old times' sake. But he is not able to do it, the hormonal treatment having ravaged his brain. He tells her she got what she wanted work, husband, a normal life. Joan tells him no one normal could have done what they did. That morning, she was on a train that went through a city that wouldn't have existed if it wasn't for Alan. She bought a ticket from a man who would most likely not be alive if it wasn't for Alan. She's read up on a whole field of scientific study that wouldn't exist if not for Alan. She is glad he wasn't born normal. She tells him, \"The world is an infinitely better place precisely because you weren't [normal]\". He asks if she really thinks that and she tells him, \"I think that sometimes it's the very people who no one imagines anything of who do the things that no one can imagine.\"In 1953, Alan is in his home, alone. He looks longingly at Christopher, at his supercomputer, at the love of his life. He turns off the lights.Cut to a flashback of the six cryptologists burning all the evidence that they cracked Enigma.In a series of final on-screen texts, it is said that Alan killed himself in 1954, after a year of government-mandated hormonal therapy.Between 1885 and 1967, approximately 49,000 homosexual men in the UK were convicted and imprisoned of gross indecency under British law.In 2013, Queen Elizabeth II granted a posthumous royal pardon, honouring Alan Turing for his achievements during the war.Historians estimate that breaking Enigma shortened the war by more than two years, saving over 14 million lives. It remained a government-held secret for more than 50 years. Turing's work inspired generations of research into what scientists called \"Turing machines\", now known as computers."}