{"mid": "TheIncredibleMrLimpet", "IMDB_id": "tt0058230", "title": "The Incredible Mr. Limpet", "plot": "The story begins September 1941 just before the attack on Pearl Harbor. Shy bookkeeper Henry Limpet loves fish with a passion. When his friend George Stickle enlists in the United States Navy, Limpet attempts to enlist as well, but is rejected. Feeling downcast, he wanders down to a pier near Coney Island and accidentally falls into the water. Inexplicably, he finds he has turned into a fish. Since he never resurfaces, his wife, Bessie, and George assume he has drowned.\nThe fish Limpet, complete with his signature pince-nez spectacles, discovers a new-found ability during some of his initial misadventures, a powerful underwater roar, his \"thrum\". He falls in love with a female fish he names Ladyfish, the concept of names being unknown to her, and makes friends with a misanthropic hermit crab named Crusty.\nStill determined to help the Navy, Limpet finds a convoy and requests to see George. With George's help, Limpet gets himself commissioned by the Navy, complete with advancing rank and a salary, which he sends to Bessie. He helps the Navy locate Nazi U-boats by signaling with his \"thrum\", and plays a large part in the Allied victory in the Battle of the Atlantic. In his final mission, he is nearly killed when the Nazis develop a \"thrum\" seeking torpedo, and is further handicapped by the loss of his spectacles. He manages to survive using Crusty as his \"navigator\", and sinks a number of U-boats by redirecting the torpedoes. After the battle, he swims to Coney Island to say goodbye to Bessie (who has now fallen in love with George) and gets a replacement set of glasses. He then swims off with Ladyfish.\nIn the film's coda, set in the modern times of 1964, George (now a high ranking naval officer) and the Admiral are presented with a report that Mr. Limpet is still alive and working with porpoises. The two men travel out to sea to contact Mr. Limpet and offer him a commission in the United States Navy. It is unknown what became of the conversation, for the movie ends with a question mark."}