{"mid": "TheInvisibleWar", "IMDB_id": "tt2120152", "title": "The Invisible War", "plot": "The Invisible War features interviews with veterans from multiple branches of the United States Armed Forces who recount the events surrounding their assaults. Their stories show many common themes, such as the lack of recourse to an impartial justice system, reprisals against survivors instead of against perpetrators, the absence of adequate emotional and physical care for survivors, the unhindered advancement of perpetrators' careers, and the forced expulsion of survivors from service.\nInterspersed with these first person testimonies are interviews with advocates, journalists, mental health professionals, active duty and retired generals, Department of Defense officials, and members of the military justice system. The film also includes footage, often shot by the veterans themselves, which documents their lives and continuing struggles in the aftermath of their assaults.\nIn the film's most prominent narrative, Coast Guard veteran Seaman Kori Cioca struggles to earn benefits from the Department of Veterans Affairs to pay for the many medical difficulties that have resulted from her rape. With the help of attorney Susan L. Burke, Cioca, along with other survivors featured in the film, brings Cioca v. Rumsfeld, a civil suit against the Department of Defense alleging a failure to adequately address sexual assault within the military.\nOther past incidents of sexual abuse recounted in the film include the 1991 Navy Tailhook scandal, the 1996 Army Aberdeen scandal, and the 2003 Air Force Academy scandal. The Invisible War uses these examples to argue that the military has consistently made empty promises to address its high rate of sexual assault. These stories culminate with an examination of the previously unreported culture of sexual harassment and sexual assault at the prestigious Marine Barracks Washington.\nThe survivors and advocates featured in the film call for changes to the way the military handles sexual assault, such as shifting prosecution away from unit commanders, who often are either friends with assailants or are assailants themselves."}