{"mid": "TheJewelOfTheNile", "IMDB_id": "tt0089370", "title": "The Jewel of the Nile", "plot": "While moored at a port in the South of France, Joan Wilder's (Kathleen Turner) and Jack Colton's (Michael Douglas) romance has grown stale. Joan, suffering writer's block, wants to return to New York, while Jack prefers aimlessly sailing the world on his boat, the Angelina. At a book signing engagement, Joan meets Omar (Spiros Focás), a charming Arab ruler who wants Joan to write his biography. Joan accepts and leaves with Omar over Jack's protests. Jack later runs into Ralph (Danny DeVito), the swindler from Jack and Joan's previous adventure in Colombia who demands Jack turn over the gem Jack and Joan found. Shortly after, an Arab, Tarak (Paul David Magid), informs Jack about Omar's true intentions and claims that Omar has the \"Jewel of the Nile\"; and just as Tarak finishes his explanations, the Angelina mysteriously explodes. Ralph and Jack team up to find Joan and the fabled jewel.\nJoan soon discovers that Omar is a brutal dictator rather than the enlightened ruler he claimed will unite the Arab world. In the palace jail, Joan encounters Al-Julhara (Avner Eisenberg), a holy man who is the \"Jewel of the Nile\" and whom Omar fears.  The pair escape and find Jack, and they flee into the desert in Omar's hi-jacked F-16 fighter aircraft. Ralph is captured by Tarak's rebel Sufi tribe who are sworn to protect the Jewel so he can fulfill his people's destiny.\nAfter encountering a Nubian mountain African tribe, Joan and Jack's romance is rekindled. Joan tells Jack that the jewel is Al-Julhara and not a gem stone. In Kadir, Omar intends to use a smoke-and-mirror-special effect to convince onlookers that he is the prophet who will unite the Arab world. Jack, Joan, and Al-Julhara arrive to expose Omar but are captured. Omar suspends Jack and Joan with ropes over a deep pit while Al-Julhara is in a stockade; Ralph, along with the Sufi tribe, arrives in time to rescue the three prisoners.\nAs Omar takes center stage to address the Arab people, Jack and Joan disrupt the ceremony while the Sufi battle Omar's guards. A fire breaks out, engulfing Omar's stage. Jack and Joan are separated, and Omar corners Joan atop the burning scaffolding. Jack knocks Omar over the side, killing him. Al-Julhara rises and safely walks through the flames, fulling the prophecy that he is the true spiritual leader.\nThe following day, Jack and Joan are married by Al-Julhara. Ralph laments having gained nothing for his efforts, but Tarak acknowledges that he is a true Sufi friend and presents him with a jeweled dagger as Jack and Joan happily sail away down the Nile."}