{"mid": "TheJudge", "IMDB_id": "tt1872194", "title": "The Judge", "plot": "Hank Palmer (Robert Downey Jr.) is one of the best defense attorneys in Chicago. He's in the bathroom at the courthouse when the prosecuting attorney Mike Kattan (David Krumholtz) questions his ethics and the fact that he defends so many guilty people. Hank tells him that innocent people can't afford him. Kattan asks how he sleeps at night. Hank tells him, he sleeps in a beautiful house with a smoking hot wife.In the courtroom, Hank gets a phone call from his brother telling him that their mother died. Hank requests that the trial be suspended until he can return. Kattan doesn't believe him, so Hank plays the voice-mail. The case is suspended.Outside Hanks house, Hank bonds with his daughter Lauren (Emma Tremblay). He goes inside and tells his wife (Sarah Lancaster) that he wants custody of Lauren once they're divorced. The happy life he painted for Kattan, isn't exactly the truth. His wife tells him that he is a horrible father because he doesn't know when Lauren gets up for school, who her teachers are, what her favorite color is. Hank leaves and heads to Carlinville, Indiana for his mother's funeral.Hank goes to the local courthouse and watches his father, Judge Joseph Palmer (Robert Duvall) deliberate over a case where a guy says he can't afford child support even though he just bought a new truck. Judge Palmer dispenses small town justice and orders the man give his truck keys over to the pregnant woman suing him so that she can sell it. The Judge also points out that she is responsible too by asking her, \"You do know how babies are made, right?\" At the end of the case, Judge Palmer struggles to remember Bailiff Gus's name. His memory is slipping.Hank pays his respects to his mom at the funeral home viewing. We meet his younger brother Dale (Jeremy Strong) who seems to be Autistic and hides behind a Super-8 camera filming everything. We also meet oldest brother Glen (Vincent D'Onofrio). He used to be the local star baseball player, but his career was sidelined by a car accident. Now he's an out of shape guy who owns a shop.At the Palmer house, Hank discovers that his dad stores all of his junk in his old room and no one made preparations for him to stay. The next morning all of the Palmers leave early to get breakfast at the local diner before going to the funeral. Hank shows up late and sarcastically thanks them for inviting him. The Judge gets up and leaves without really acknowledging Hank at all. Hank sees that his old high school girlfriend Samantha (Vera Famiga) works at the diner. They haven't seen each other in years.At the mom's funeral, the Judge is warm and friendly to everyone except Hank. They don't get along at all. They go to the cemetery and bury the mom.That night, the Palmer boys decide to go to a local bar and the Judge goes to the convenience store.At the bar, locals start to give Glen shit because they've all had poor experiences in the Judge's courtroom. Glen is about to fight them when Hank steps in and through fast talking shames the locals into leaving. This impresses young bartender Carla (Leighton Meester) who starts making out with Hank later that night.When the Palmer boys get home they see that their dad damaged the front of his car. The next morning the Judge yells at them for taking his car out. He doesn't remember causing the damage himself.The police show up and question the Judge about his whereabouts the night before. Someone hit and run Mark Blackwell and now he is dead. The Judge goes with the police for questioning, but Hank rushes in and stops things. The Judge insists that because he didn't do anything wrong, there was no harm in talking to the police. Both the Judge and Blackwell were seen at the convenience store last night. The Judge says he went a different way home than where Blackwell's body was found.The Palmers all go home and the Judge makes fun of Hank for not being able to hold his marriage together. This infuriates Hank so he leaves and gets on a plane to go back to Chicago. Before the plane takes off, Glen calls him to tell him that the Judge has been arrested. Forensics shows Blackwell's blood on the Judges car.Hank goes to the jail and bails out his dad. The Judge refuses to let Hank represent him and instead hires local inexperienced attorney C.P. Kennedy (Dax Shepard). Lawyering seems to be a side job to Kennedy running a shop. They find out the Dwight Dickham (Billy Bob Thornton) is going to be handling the prosecution. Dickham has a reputation, so Hank sticks around to help Kennedy pick a jury. He does it entirely by asking what kind of bumper sticker each candidate has on their car. If its something about having an honor roll student or anything like that, he passes. He does accept people if they have stickers that say things like Gun Control means using two hands and Missing: Wife and Dog, reward for Dog like from the trailer for the movie.Hank breaks out his old Metallica shirt and bike and starts riding around town. He rides no handed on his bike and wipes out. Samantha and her daughter Carla the bartender pick him up and give him a ride. Carla and Hank don't tell Samantha that they made out the other night, but their stories clash regarding whether or not they've met. She is honest, he's not.Hank and Samantha hang out and catch up a little. They break into the diner like they did as kids and then she tells him that she doesn't just work there, she owns it now. They didn't have to break in, she wanted to because it was just like old times. Plus it was worth a broken window to see Hank climb the building. They eat pie and she comes on to him, but he rejects her advances and explains that he is going back to Chicago as soon as he can. She is insulted that he'd think she wanted anything more than just a hook up and tells him to lock up when he leaves because she is going to go home and masturbate.A security tape shows that the Judge lied about his trip home. He said he went one direction, saw that the road was washed out and went back the other way. The security tape shows that his timeline doesn't match up.Hank asks Dale about the Judge's condition. Dale says that he is fine and keeps a routine where he goes and plays Chess with Doc Morris (Denis O'Hare) every week. Hank remembers his dad doesn't play Chess so he asks if Dale has any footage of that. He does. They look at the film and we find out that the Judge is getting some sort of medical treatment.Hank goes to meet with Doc Morris and finds out that his dad has Cancer and has been getting chemotherapy even though they caught it too late. Hank asks what the side effects are and finds out that they include memory loss.Hank tells the Judge that he knows about the chemo and wants to use that in court. Blackwell was a kid who the Judge went light on. After Blackwell did minimal time, he killed his girlfriend. Then the Judge threw the book at him. Blackwell had just gotten out of jail. So the prosecution has the Judge at the scene of the accident and motive to make it murder. The Judge's pride prevents him from wanting to use being sick as a defense. No one, aside from the doctor and the late wife, knows about the Cancer. He says that people don't remember any of the great stuff Ronald Reagan did, they only remember him as a senile old fool. He doesn't want that to be his legacy too. Hank points out that he is just a small town Judge and he'll have no legacy.Since Hank is going to be in Indiana for awhile, he has his daughter Lauren come visit. He warns her that his father is a mean man and she shouldn't take it personally. Much to Hank's surprise, the Judge is delightful to Lauren and tells her that she's the first girl they've had in the family in a very long time. That night, Hank and Lauren are hanging out and hear a noise from the Judge's room. Hank goes to investigate and sees that his dad is out of it, struggling to walk and has soiled himself. Hank takes him into the bathroom, undresses him and helps him in the shower to clean him off.The Judge wants to take the stand during his case, but Hank doesn't want him to. The Judge says that only guilty people refuse to defend themselves. They talk about the best lawyers they've ever seen. Hank tells the Judge about one he respected and the Judge tells Hank about one who had integrity, clearly something he feels his son lacks. Hank and the Judge have a huge fight.Hank was driving under the influence the night Glen got in the car accident and got injured. His dad threw the book at him. He was always hard on Hank, but points out that because of that, Hank turned out fine. Hank says he turned out fine on his own. The Judge reminds him that he is the one who paid for Hank to go to law school and become a lawyer. Hank graduated at the top of his class and never got a congratulations from his dad. In all fairness, Hank also never thanked his dad. This visit to Carlinville is the first time they've spoken since Hank left home at 18.Hank takes his daughter to the airport to go home and notices that she has a lot of the same mannerisms that Carla has. He goes home and checks dates for homecoming and realizes that Carla was born nine months after the last night he spent with Samantha. It looks like he may have been seriously making out with his daughter!The Judge takes the stand. Dickham jogs the Judge's memory and we find out that on the night Blackwell died, they were both at the convenience store. When Blackwell saw the Judge he told him that since the Judges wife was buried in the same cemetery as the girl Blackwell killed years ago, when he goes there, he can piss on both of their graves. Motive established. Hank questions him. We find out that the reason the Judge was initially easy on Blackwell was because when Blackwell was a child the Judge saw he was no different than Hank, a young boy who screwed up from time to time. Hank brings up the chemo, much to the surprise of everyone. This infuriates the Judge who tells Hank that after this they're done forever. The Judge admits to memory loss. He still can't remember Gus's name even though Gus has been his Bailiff for over 20 years. Dickham cross examines. The Judge absolutely does not remember killing Blackwell. Dickham says he has no further questions, but the Judge volunteers, that while he doesn't remember killing Blackwell, he's glad he is dead.The jury deliberates. They come back with a not guilty verdict to murder, but guilty to manslaughter. He's sentenced to four years in prison.Hank goes back to Chicago and runs into Kattan in the bathroom again. He's a changed man. He's on a losing streak with cases and decides to stick with it.Seven months later, the Judge is released from prison on parole. Hank picks him up. They go fishing. The Judge tells him that the reason he was hard on Hank for so many years is because while he saw Hank in Blackwell, he also saw Blackwell in Hank and worried that if he hadn't been tough on Hank, he wouldn't have turned out to be the man he is today. The Judge tells him that before when Hank asked him who the best lawyer he ever saw was, he was wrong. The best lawyer he ever saw was Hank. Hank finally gets his dad's approval. Then the Judge dies in the fishing boat.Hank asks Samantha if Carla is his daughter. She's not. She's Glen's daughter. Samantha was mad that Hank ditched her, so she hooked up with his brother since he seemed really sweet, unlike Hank at that time. Glen doesn't know. He's married now and has two sons, so she never wanted to bother him with that.After the Judge's funeral, Hank goes into the courtroom where his dad sat for so many years. He spins his dad's chair seemingly contemplating."}