{"mid": "TheJoyLuckClub", "IMDB_id": "tt0107282", "title": "The Joy Luck Club", "plot": "The Joy Luck Club was formed by four women in San Francisco: Lindo Jong (Tsai Chin), Ying-Ying St. Clair (France Nuyen), An-Mei Hsu (Lisa Lu), and Suyuan Woo (Kieu Chinh). The members have mainly played mahjong and told each other's stories over the years. They emigrated from their native country, China, remarried, and gave birth to children in America. Suyuan's daughter June (Ming-Na Wen) replaced her when Suyuan died four months before the time the film is set. The mothers have high hopes for their daughters' success, but the daughters struggle through \"anxieties, feelings of inadequacy, and failures.\" Throughout the film, the mothers and daughters bond by learning to understand each other and by overcoming their conflicts.\nThe film begins with June's prologue tale. In the prologue, a woman (presumably Suyuan) bought a swan in China from a market vendor who was selling it as \"a duck that stretched its neck [to become] a goose.\" She kept it as her pet and brought it to the United States. When the immigration officials took it away from her, she plucked out only a swan feather instead while she struggled to grab the swan away. For a long time, the woman had kept the feather, planning to someday give the feather to her daughter.\nThen the film transits to June's farewell surprise party in San Francisco for her upcoming reunion with her long-lost twin sisters in China. Among the guests are members of The Joy Luck Club, their daughters, other relatives, and friends. The following characters below narrate their journeys to the audience while they reflect upon their pasts.\n=== Lindo and Waverly Jong ===\nIn China, four-year-old Lindo (Ying Wu) is arranged, by her mother (Xi Meijuan) and the matchmaker (Hsu Ying Li), to be married to Mrs. Huang's son when she grows up. When Lindo turns fifteen (Irene Ng), her mother sends her to Mrs. Huang, so Lindo marries Huang's son, Tyan Hu (William Gong), a pre-pubescent boy who has no interest in her. During four years of childless and loveless marriage, she is frequently abused by her frustrated mother-in-law, who believes Lindo's childlessness is her own fault. Lindo eavesdrops on the servant girl telling her lover that she is pregnant and he willfully abandons her. Lindo realizes her chance to leave the marriage without dishonoring herself, her family and her in-laws. Later, Lindo purportedly ruins her clothes and then claims that she had a nightmare in which Tyan Hu's ancestors threatened to punish her, Tyan Hu and the matchmaker. Then Lindo claims that the ancestors impregnated the servant girl with Tyan Hu's child. Mrs. Huang does not believe Lindo until Mrs. Huang quickly discovers the servant's pregnancy through inspection. Finally, Lindo claims that the matchmaker intentionally and wrongly paired Lindo and Tyan Hu for more money. Furious, Mrs. Huang orders the matchmaker out of her family's life, allowing the servant girl to have her marriage. Lindo is able to escape the house and moves to Shanghai.\nYears later in America, Lindo has a new husband, a son, and a daughter named Waverly (Tamlyn Tomita). Aged between six and nine, Waverly (Mai Vu) has become a chess champion. Annoyed by Lindo using Waverly to \"show off\" at the streets, Waverly shouts at her mother and decides to quit chess. When she tries to play it again, Waverly loses one chess round, prompting her to retire from chess. Years later, she has a daughter Shoshana from her Chinese ex-husband and is going to marry a Caucasian fiancé, Rich (Christopher Rich), much to Lindo's chagrin. In order to make Lindo like Rich, Waverly brings him to a family dinner, but he fails to impress them especially by improperly using chopsticks and insulting Lindo's cooking by marinating the dish with a sauce, humiliating Waverly. While driving home, Waverly lets Rich know how humiliated she and her family are with him, prompting him to properly learn the Chinese table manners. A while later, at the hair salon, Lindo retells her moments with her own mother and declares that she likes Rich very much. She then gives marital blessings to Waverly and Rich, prompting her and Waverly to reconcile with each other. At June's farewell party, Rich almost successfully uses a chopstick (but accidentally drops a piece), impressing Lindo by trying to respect the Chinese table manners.\n=== Ying-Ying and Lena St. Clair ===\nIn China, Ying-Ying St. Clair was happily married to Lin-Xiao (Russell Wong) with a baby boy in China until Lin-Xiao abuses her and abandons her for an opera singer. Overcome by her depression, Ying-Ying drowns her baby son in the bathtub, which leaves her distraught afterwards because she feels that if she had killed Lin-Xiao earlier, she would not have lost \"the thing that mattered the most.\" Years after she immigrated to America, she has suffered from trauma and has been haunted by her past, worrying her new family, including her daughter Lena (Lauren Tom).\nAfter Ying-Ying finally resolved her years of trauma, Lena shows Ying-Ying around her new apartment with her husband Harold (Michael Paul Chan), who is also Lena's boss. Ying-Ying learns that Lena is uncomfortable with her financial arrangements with Harold. They split the costs of their life evenly with a list of things that they share, making their home life contentious. Seeing that Lena is unhappy with her marriage, Ying-Ying reasserts herself by knocking over a table in the bedroom and causing the vase to fall from the table and break. Hearing the sudden noise, Lena goes to her mother and admits her unhappiness. Ying-Ying replies that Lena should leave and not come back until Harold gives her what she wants. At June's farewell party, Lena is shown to have a new vibrant fiancé, who has given Lena what she wants and is accepting of Ying-Ying.\n=== An-Mei and Rose Hsu ===\nNine-year-old An-Mei Hsu (Yi Ding) has been raised with her relatives and grandmother. She is reunited with her long-lost mother (Vivian Wu), who was disowned by her family for her \"dalliance\" with a wealthy middle-aged man Wu-Tsing shortly after her husband's death, and who arrives to see her dying mother (Lucille Soong). In order to not lose her again, An-Mei moves out with her mother to Wu-Tsing's house against her relatives' wishes for her to remain with them. They claim that in allowing An-Mei live with her and Wu-Tsing, the mother will ruin her future. She finds that Wu-Tsing has another three wives, making An-Mei's mother the Fourth Wife. Later, she learns that the Second Wife (Elizabeth Sung) tricked An-Mei's mother into being raped and impregnated by Wu-Tsing. When the relatives did not believe An-Mei's mother and kicked her out, she reluctantly became Wu-Tsing's Fourth Wife as she had nowhere else to turn. After An-Mei's mother gave birth to a boy, the Second Wife took him away from her and claimed him as her own. After An-Mei discovers the past, her mother ultimately commits suicide by eating \"sticky rice balls\" laced with opium, choosing the day of her death carefully to threaten Wu-Tsing with the vengeance of her angry ghost. Afraid of this curse, Wu-Tsing vows to raise An-Mei and her half-brother with great care and promises to honor their mother as an honorable first wife. When Second Wife tries to pay respects to An-Mei's late mother, An-Mei subtly screams at the Second Wife, destroys the Second Wife's faux pearl necklace (the Second Wife initially tried to win An-Mei over with a similar necklace), and loudly yells out \"Mama!\"\nYears later in America, An-Mei's daughter Rose (Rosalind Chao) has been dating her boyfriend, Ted Jordan (Andrew McCarthy) since college. Ted is initially attracted to Rose's assertive, forthright nature. When he confronts his aristocratic mother (Diane Baker) for insulting Rose due to her race, Rose is impressed and agrees to marry him. Over the course of their marriage, however, Rose and Ted become distant from each other, mainly because Rose, desperate to prove herself to Ted's milieu, becomes submissive and demure at the cost of her own identity and interests. They have a daughter, Jennifer, but this does not resolve their marital problems. To make matters worse, Ted cheats on her with another woman and neither are actually happy in their marriage. A while later, An-Mei comes for a visit and relays the story of her own mother's fate to Rose. She encourages Rose to stand up for herself and Jennifer against Ted, or nothing will change. To avoid the same fate, Rose reclaims her strength and stands up to Ted by telling him to leave the house and not take their daughter away from her. This compels Ted to take her seriously and not continue taking her for granted. At June's farewell party, it is revealed the couple have reconciled.\n=== Suyuan and June Woo ===\nIn World War II, when the Japanese invaded China, Suyuan Woo escaped the invasion with her twin baby daughters. When Suyuan became ill during her quest for refuge, her cart breaks down, causing the babies to fall. Near death, Suyuan was unable to carry the babies herself and abandoned them along with all of her other possessions, including a photo of herself. Suyuan survived, but was haunted by guilt in the loss of her daughters and never knew what happened to them.\nAfter she remarried in America, Suyuan has high hopes for her new daughter June, but June constantly fails to meet her expectations out of a lack of interest. She performs badly during a piano recital at age nine (Melanie Chang), and when Suyuan pushes her to continue training to be a concert pianist, June refuses, saying that she wishes herself dead like Suyuan's other daughters, an action that offends Suyuan. When June grows into adulthood, at a dinner party a year before Suyuan's passing, Waverly, June's long-time rival whom she is freelancing for, turns down her business ideas, and Suyuan remarks that Waverly and June are not alike and that style is something one's born with and cannot be taught implying Waverly has style. June feels humiliated, believing her mother had betrayed her for being a failure in her eyes, and Linda shows sympathy for June. The following day, June berates Suyuan for her remarks and admits she could never live up to her high expectations. June laments that Suyuan has always been disappointed with June because June dropped out of college, is not married, and has an unsuccessful career. However, Suyuan gives her a jade necklace and assures June that she is the one who has the unteachable style and that while Waverly was the best in competitions, June always had the best heart which made her mother prouder than she would have been otherwise.\nLast Easter before the farewell party, June received the news from the Club that the long-lost twins were alive. When June could not understand the twins' letter written in Chinese, Lindo purportedly mistranslated the letter to make June believe that the twins knew about Suyuan's death and their long-lost half-sister June. Back to the present, when the farewell party ends, Lindo confesses that she wrote letters to the twins and then signed Suyuan's name. June begs Lindo to tell them the truth, but Lindo tells her that it is too late because the twin sisters are anticipating their mother, Suyuan, still believing that Suyuan is alive. A short while later, June's father (Chao-Li Chi) retells the war story of Suyuan and her long-lost twin daughters. Then he gives her the swan feather, which came from Suyuan's—the woman's—swan as explained earlier in the prologue, saying that the feather looks worthless but has \"good intentions.\" When she arrives in China to meet her sisters, June tells them the truth about Suyuan and embraces them. In finally accepting her Chinese heritage, June is able to make peace with her deceased mother."}