{"mid": "TheJetsonsMeetTheFlintstones", "IMDB_id": "tt0192175", "title": "The Jetsons Meet the Flintstones", "plot": "In the future, while Elroy is busy working on a time machine, George Jetson comes to Mr. Spacely's office for a serious discussion. Spacely's rival, Cogswell, has been stealing Spacely's business ideas, putting their jobs in jeopardy. Spacely orders George to go spy on Cogswell where George finds out that Cogswell's robot computer, S.A.R.A., has been seducing the Spacely robot computer, R.U.D.I., into leaking Mr. Spacely's secrets. George tries to report to Spacely, but R.U.D.I. sabotages his efforts.\nIn the Stone Age, Wilma and Betty are trying to convince Fred Flintstone to have their vacation in Honolurock. Fred ignores their advances that he plans to take the girls someplace better, meanwhile at work Fred tells Barney Rubble that a poker tournament is being held at the Water Buffalos lodge and wants to go, but Mr. Slate shows up and tells them that due to them going on vacation, they must work the late shift. They later disobey Slate's orders and go to the poker tournament, but they see that Slate is playing there too, so they disguise themselves. Fred plays against Slate, but he loses to Slate, then a spider exposes Barney. Furious, Slate has them both fired. While back in the future, Elroy completes his time machine. The Jetsons decide to use it to take a trip to the 25th century to relax. Right before Elroy gets the machine working, his dog Astro accidentally sets the switch to \"Past\".\nWith no job, the Flintstones and Rubbles are forced to settle for a camping holiday. As Fred and Barney set up the tent, the Jetsons arrive from the future. Fred and George eventually communicate and the families become friends. Fred is amazed by George's futuristic gadgets and decides to use them to help Mr. Slate in a competition at the upcoming company picnic. Fred introduces George to Slate, claiming George is a distant cousin. Slate is reluctant at first to trust George, but since rival businessman Turk Tarpit's cheating has set him back, Slate accepts their help in exchange for giving them their jobs back. George and Fred use future technology to help Slate win several games, but in the last event, Astro and Dino's actions causes Tarpit to become the winner. In the end, Slate refuses to trust Fred and Barney again.\nWhile Mr. Spacely continues to vent over his failing business, Henry Orbit and Rosie the Robot Maid assemble a 'time machine retriever' to bring the Jetsons back. But when they turn it on, the time machine returns with the Flintstones instead. Upon seeing they really are cavemen, Spacely introduces them to the press.\nStuck in the past, George asks Mr. Slate for a job. Slate initially rejects, but when Tarpit offers George work, Slate immediately makes George his partner, and George soon becomes famous. Using their newfound fame and riches, the Jetsons buy multiple local businesses and are soon overwhelmed. Mr. Spacely makes Fred the spokesman for his company, but R.U.D.I. leaks this information to S.A.R.A. When Spacely is introducing Fred to some important investors, Cogswell introduces Barney instead, leading to a rift in Fred and Barney's friendship. Meanwhile, Rosie requests R.U.D.I. to help her and Henry try to fix the time machine to find the Jetsons. S.A.R.A. appears and demands that R.U.D.I. get rid of Rosie, but R.U.D.I. agrees to do whatever he can to get the Jetsons back and leaves S.A.R.A. for good. They fix the time machine and Rosie is transported to the Stone Age where she finds her family.\nNow able to return home the Jetsons leave, taking Fred's car with them, after Judy says goodbye to a teen idol - Iggy. Mr. Spacely concocts a plan to use Fred's car as a model for futuristic replicas, Cogswell sends his robotic dog to steal this information, but the two families manage to stop him. Spacely's business of selling Stone Age style cars becomes successful. Fred and Barney repair their friendship, and George offers his partnership with Mr. Slate to give them their jobs back. Just as they are about to leave for home, Elroy tells them the time machine is broken and cannot be repaired. Fortunately, they're able to return to the Stone Age because Fred's car absorbed the time machine's \"quadrapotents\". The Flintstones then bid a fond farewell to the Jetsons and are sent back to the Stone Age."}