{"mid": "TheJourneyOfNattyGann", "IMDB_id": "tt0089385", "title": "The Journey of Natty Gann", "plot": "Set in 1935, the movie tells the story of a 15-year-old tomboy girl, Natty Gann (Meredith Salenger). Out of work because of Depression-era unemployment, Natty's widowed father Sol (Ray Wise) parlays his surefootedness into getting a job as a lumberjack. To take the job he must leave on almost no notice on a company bus from Chicago to the state of Washington. Unable to find Natty before the bus leaves, he leaves her a letter promising to send her the fare to join him as soon as he has earned it. Meanwhile he makes arrangements with Connie (Lainie Kazan), the shallow and insensitive innkeeper of their roominghouse, so Natty can stay on under Connie's temporary supervision.\nAfter overhearing Connie reporting her as an abandoned child, Natty runs away to find her father on her own, embarking on a cross-country journey riding the rails along with other penniless travelers and hoboes. Along the way she saves a wolfdog from a dog fighting ring. In return the dog, whom she calls Wolf, becomes her friend and protector in her attempt to return to her father. She has a brief, innocent romance with another young traveler, Harry (John Cusack), and encounters various obstacles that test her courage, perseverance, and ingenuity, such as being falsely accused of cattle rustling and remanded to a juvenile facility. Natty escapes the detention center and confronts the blacksmith who has been given control of the captured Wolf. The smith turns out to be kind and fair-minded, releases Wolf to Natty, and gives her food, a ride to a train station and enough money for a ticket. She is cheated of her ticket money by an unscrupulous ticket agent and narrowly escapes his attempt to turn her in, returning to \"riding the rails\" illicitly on freight trains, where she is unexpectedly reunited with Harry in a railside shantytown.\nWhen Natty's father calls Connie, she tells him Natty is gone. In a later phone call he is grieved to learn that Natty's wallet was found underneath a derailed freight train - unbeknownst to him, she lived through the crash. He is given a week's leave from the lumber company to search through the wreckage for her, to no avail. He returns to the lumber camp and requests the most dangerous jobs, known as \"widow's work\", now that he seems to have little to live for.\nArriving on the west coast, Natty's journey takes several more challenging turns. Harry finds work through the federal Works Progress Administration in San Francisco, but she declines his invitation to go with him, in order to find her father. The logging operation does not list Sol Gann among their workers, and Natty searches fruitlessly for him, showing other loggers his photo in a pendant he has given her which is her last trace of her parents. Wolf is entranced by wolf calls from the woods and she urges him to go; it is a painful parting. Her search is thwarted by the company clerk who catches her in one of the backwoods camps, and she is waiting to be sent back down the mountain for her own safety when the clerk unexpectedly shows up with the returned letter her father had sent enclosing her train ticket to rejoin him. The clerk has located him and Natty is on her way on foot to the high camp where he is working when the camp bus whirls past her going down carrying injured loggers including her father. Glimpsing him, she calls to him but sees no sign he has heard her. They are, however, reunited in a heartwarming embrace further down on the mountain road."}