{"mid": "TheKillingOfAChineseBookie", "IMDB_id": "tt0074749", "title": "The Killing of a Chinese Bookie", "plot": "The film, set in California, opens with Cosmo Vittelli (Ben Gazzara) making the final payment on a longstanding gambling debt to a sleazy loanshark (played by the film's producer Al Ruban). It turns out, that the person who Vitelli had just repaid his debt to is associated with the mob and sets up Vitelli by bringing larger fish gangsters to Vittelli's artistic club. Vitelli and Mort (Seymour Cassel) share talk and conversation about the club ownership business, Vitelli orders Mort and his party bottles of Dom Perignon. Mort then sets Vitelli up by offering an open invitation to gamble at the mobster's club, all expenses paid, other than the gambling gains or losses. To celebrate his long-anticipated freedom, cabaret owner Vittelli has an expensive night out with his three favorite dancers (\"Margo\", \"Rachael\" and \"Sherry\"). The evening culminates in a poker game in which Vittelli loses $23,000 (2016, $97,500 equivalent) returning him to the debtor's position he had just left. Using the debt as leverage, his mob creditors coerce him into agreeing to perform a \"hit\" on a rival. Vittelli is led to believe that his target is a small-time criminal of minor consequence, the Chinese bookie of the film's title; but in fact, he is the boss of the Chinese mafia, \"the heaviest cat on the West Coast.\" Vittelli manages to kill the man and several of his bodyguards, but is severely wounded before escaping.\nIn addition to the potentially fatal gunshot wound he sustains, Vittelli comes to realize that his assignment was a set-up: that his mob employers double-crossed him and had no expectation he would survive his debut as a hitman. Vitelli loses his \"black\" and \"beautiful\" girlfriend, Rachel (Azizi Johari) and the support of her loving mother due to the chaos and the gunshot wound he refuses to acknowledge. It also becomes evident that due to Vitelli's direct combat experience in Korea and his snap execution of the West Coast Chinese gangster leader and his bodyguards, that, in fact, his Italian gangster foes are \"amateurs\" in comparison to him. Vitelli fatally shoots Mort but Mort's mob companion is left in a warehouse firing off rounds into warehouse walls, hunting for Vitelli. Forced into a corner again, Vittelli manages to kill or elude his assailants, but the film ends with no indication of whether Vittelli will survive his ordeal, as the show at his club goes on. Vitelli (with a bullet in his side) informs his artists that Rachel has left the production team and has the \"flu\" or has moved on to \"bigger and better things\", never accounting for the lost love potential between Vitelli, Rachel and her mother who said she loved Vitelli but wanted him out of her house until he sought medical attention to remove the bullet."}