{"mid": "TheKingOfFighters", "IMDB_id": "tt1038685", "title": "The King of Fighters", "plot": "The titular King of Fighters tournament originated from SNK's previous fighting game franchises, Fatal Fury and Art of Fighting. The first game in the series, KOF '94, centers on a black market arms dealer named Rugal Bernstein, who hosts the well-known fighting tournament to lure worthy adversaries into his trap so that he can kill them and turn them into stone statues, adding them to his collection of defeated martial artists. In addition to previous established fighting game stars Terry Bogard and Ryo Sakazaki, the game introduces a new hero: a young Japanese martial artist named Kyo Kusanagi, who serves as the lead character in the early KOF games. In KOF '95, Rugal, having survived the previous tournament, host a new one with the intentions of seeking revenge against his adversaries. KOF '95 introduced Kyo's rival Iori Yagami to the series and was the first game to mention the presence of the Orochi clan, which would serve as the central plot element in the following two games in the series. The tournament in KOF '96 and KOF '97 are hosted by a woman named Chizuru Kagura, who seeks to recruit allies (particularly Kyo and Iori, who are descended from the Three Divine Vessels along with Kagura herself) to fight against the Orochi clan. The Orochi storyline concludes in KOF '97, while the following game in the series, KOF '98, is a \"Special Edition\" with no plot development.\nKOF '99 introduces a new story arc involving a mysterious corporation known as NESTS, which seeks to create an army of genetically altered fighters. The game would introduce a new lead character named K′: a fugitive from NESTS who was genetically enhanced with Kyo's DNA. The two following games in the series, KOF 2000 and KOF 2001, continue the NESTS storyline, with each game further unraveling the mystery of the organization. KOF 2002, like KOF '98 before it, is a \"Special Edition\" of the series with no particular plot.\nKOF 2003 begins a new storyline focusing on another new lead character named Ash Crimson, a young man who seeks to possess the powers of the Three Divine Vessels for his own unknown agenda. The tournaments from KOF 2003 and KOF XI were hosted by \"Those From the Past\", an organization of inhuman warriors who try to break the Orochi seal to take its powers so that they can give it to their shrouded master. While KOF XII does not have a story, KOF XIII follows another tournament hosted by Those From the Past with Ash eventually confronting their superior despite him being Ash's ancestor.\nKOF XIV gets another storyline, involving a new lead character named Shun'ei."}