{"mid": "TheKingAndI", "IMDB_id": "tt0049408", "title": "The King and I", "plot": "=== Act 1 ===\nIn 1862, a strong-willed, widowed schoolteacher, Anna Leonowens, arrives in Bangkok, Siam (later known as Thailand) at the request of the King of Siam to tutor his many children. Anna's young son, Louis, fears the severe countenance of the King's prime minister, the Kralahome, but Anna refuses to be intimidated (\"I Whistle a Happy Tune\"). The Kralahome has come to escort them to the palace, where they are expected to live – a violation of Anna's contract, which calls for them to live in a separate house. She considers returning to Singapore aboard the vessel that brought them, but goes with her son and the Kralahome.\nSeveral weeks pass, during which Anna and Louis are confined to their palace rooms. The King receives a gift from the king of Burma, a lovely slave girl named Tuptim, to be one of his many wives. She is escorted by Lun Tha, a scholar who has come to copy a design for a temple, and the two are secretly in love. Tuptim, left alone, declares that the King may own her, but not her heart (\"My Lord and Master\"). The King gives Anna her first audience. The schoolteacher is a part of his plan for the modernization of Siam; he is impressed when she already knows this. She raises the issue of her house with him, he dismisses her protests and orders her to talk with his wives. They are interested in her, and she tells them of her late husband, Tom (\"Hello, Young Lovers\"). The King presents her new pupils; Anna is to teach those of his children whose mothers are in favor with him – several dozen – and is to teach their mothers as well. The princes and princesses enter in procession (\"March of the Royal Siamese Children\"). Anna is charmed by the children, and formality breaks down after the ceremony as they crowd around her.\nAnna has not given up on the house, and teaches the children proverbs and songs extolling the virtues of home life, to the King's irritation. The King has enough worries without battling the schoolteacher, and wonders why the world has become so complicated (\"A Puzzlement\"). The children and wives are hard at work learning English (\"The Royal Bangkok Academy\"). The children are surprised by a map showing how small Siam is compared with the rest of the world (\"Getting to Know You\"). As the crown prince, Chulalongkorn, disputes the map, the King enters a chaotic schoolroom. He orders the pupils to believe the teacher but complains to Anna about her lessons about \"home\". Anna stands her ground and insists on the letter of her contract, threatening to leave Siam, much to the dismay of wives and children. The King orders her to obey as \"my servant\"; she repudiates the term and hurries away. The King dismisses school, then leaves, uncertain of his next action. Meanwhile, Lun Tha comes upon Tuptim, and they muse about having to hide their relationship (\"We Kiss in a Shadow\").\nIn her room, Anna replays the confrontation in her mind, her anger building (\"Shall I Tell You What I Think of You?\"). Lady Thiang, the King's head wife, tells Anna that the King is troubled by his portrayal in the West as a barbarian, as the British are being urged to take over Siam as a protectorate. Anna is shocked by the accusations – the King is a polygamist, but he is no barbarian – but she is reluctant to see him after their argument. Lady Thiang convinces her that the King is deserving of support (\"Something Wonderful\"). Anna goes to him and finds him anxious for reconciliation. The King tells her that the British are sending an envoy to Bangkok to evaluate the situation. Anna \"guesses\" – the only guise in which the King will accept advice – that the King will receive the envoy in European style, and that the wives will be dressed in Western fashion. Tuptim has been writing a play based on a book that Anna has lent her, Uncle Tom's Cabin, that can be presented to the guests. News is brought to the King that the British are arriving much earlier than thought, and so Anna and the wives are to stay up all night to prepare. The King assembles his family for a Buddhist prayer for the success of the venture and also promises before Buddha that Anna will receive her own house \"as provided in agreement, etc., etc.\"\n=== Act 2 ===\nThe wives are dressed in their new European-style gowns, which they find confining (\"Western People Funny\"). In the rush to prepare, the question of undergarments has been overlooked, and the wives have practically nothing on underneath their gowns. When the British envoy, Sir Edward Ramsay, arrives and gazes at them through a monocle, they are panicked by the \"evil eye\" and lift their skirts over their heads as they flee. Sir Edward is diplomatic about the incident. When the King is called away, it emerges that Sir Edward is an old flame of Anna's, and they dance in remembrance of old times, as Edward urges her to return to British society. The King returns and irritably reminds them that dancing is for after dinner.\nAs final preparations for the play are made, Tuptim steals a moment to meet with Lun Tha. He tells her he has an escape plan, and she should be ready to leave after the performance (\"I Have Dreamed\"). Anna encounters them, and they confide in her (\"Hello, Young Lovers\", reprise). The play (\"Small House of Uncle Thomas\", narrated ballet) is presented in a Siamese ballet-inspired dance. Tuptim is the narrator, and she tells her audience of the evil King Simon of Legree and his pursuit of the runaway slave Eliza. Eliza is saved by Buddha, who miraculously freezes a river and conceals her in snow. Buddha then causes the river to melt, drowning King Simon and his hunting party. The anti-slavery message is blunt.\nAfter the play, Sir Edward reveals that the British threat has receded, but the King is distracted by his displeasure at Tuptim's rebellious message. After Sir Edward leaves, Anna and the King express their delight at how well the evening went, and he presents her with a ring. Secret police report that Tuptim is missing. The King realizes that Anna knows something; she parries his inquiry by asking why he should care: Tuptim is just another woman to him. He is delighted; she is at last understanding the Siamese perspective. Anna tries to explain to him the Western customs of courtship and tells him what it is like for a young woman at a formal dance (\"Shall We Dance?\"). He demands that she teach him the dance. She does, and in that dance they experience and express a love for each other that they can never speak aloud. They are interrupted by the Kralahome. Tuptim has been captured, and a search is on for Lun Tha. The King resolves to punish Tuptim, though she denies she and Lun Tha were lovers. Anna tries to dissuade him, but he is determined that her influence shall not rule, and he takes the whip himself. He turns to lash Tuptim, but under Anna's gaze is unable to swing the whip, and hurries away. Lun Tha is found dead, and Tuptim is dragged off, swearing to kill herself; nothing more is heard about her. Anna asks the Kralahome to give her ring back to the King; both schoolteacher and minister state their wish that she had never come to Siam.\nSeveral months pass with no contact between Anna and the King. Anna is packed and ready to board a ship leaving Siam. Chulalongkorn arrives with a letter from the King, who has been unable to resolve the conflicts within himself and is dying. Anna hurries to the King's bedside and they reconcile. The King persuades her to take back the ring and to stay and assist the next king, Chulalongkorn. The dying man tells Anna to take dictation from the prince, and instructs the boy to give orders as if he were King. The prince orders the end of the custom of kowtowing that Anna hated. The King grudgingly accepts this decision. As Chulalongkorn continues, prescribing a less arduous bow to show respect for the king, his father dies. Anna kneels by the late King, holding his hand and kissing it, as the wives and children bow or curtsey, a gesture of respect to old king and new."}