{"mid": "TheKennelMurderCase", "IMDB_id": "tt0024210", "title": "The Kennel Murder Case", "plot": "Philo Vance's dog does not make it into the final of the Long Island Kennel Club's dog show. Fellow competitor Archer Coe (Robert Barrat) is disappointed, having hoped to savor a victory over Vance. Coe is found dead the next morning in his bedroom, locked from the inside. District Attorney Markham (Robert McWade) and Police Sergeant Heath (Eugene Pallette) assume it was suicide, because he was shot through the head and was found holding a pistol. Vance is not convinced. He soon finds evidence that Coe was murdered. Coroner Dr. Doremus (Etienne Girardot) determines the victim died of a stab wound.\nThere is no shortage of suspects; Coe was very much disliked. His niece Hilda Lake (Mary Astor) resented her uncle's tight control of her finances and jealousy of any men who showed interest in her. Her boyfriend, Sir Thomas MacDonald (Paul Cavanagh), suspected Coe of killing his dog to ensure winning the competition. Raymond Wrede (Ralph Morgan), the dead man's secretary, was in love with Miss Lake, but had been laughed at when he sought Coe's support. Coe's next-door neighbor and lover Doris Delafield (Helen Vinson) had been cheating on him with Eduardo Grassi (Jack La Rue). When Coe found out, he cancelled a contract to sell his collection of Chinese artworks to the Milan museum for which Grassi worked. Liang (James Lee), the cook, had worked long, hard, and illegally to help Coe amass his collection. He warned his employer against the proposed sale and was fired as a result. Even Coe's own brother Brisbane (Frank Conroy) despised Coe. Finally, Gamble (Arthur Hohl), the head servant, had concealed his criminal past.\nBrisbane Coe becomes Vance's prime suspect. His alibi of taking a train at the time of the murder is disproved. When he is found dead in a closet, Vance is both puzzled and enlightened. Among Brisbane's effects, Vance finds a book titled Unsolved Murders; a bookmarked page details a method of using string to lock a door through the keyhole without leaving a trace. Part of the mystery is solved.\nLater, an attempt is made on the life of Sir Thomas using the same dagger used to kill Coe. Finally, a Doberman Pinscher belonging to Miss Delafield is found seriously injured, apparently struck with a fireside poker. From these and other clues, Vance finally solves the crime.\nIt turns out that two men sought Coe's life that night. The successful murderer struggled with Coe and stabbed him, leaving him for dead. Coe awakened soon after. Too dazed to recall the fight or notice that he was mortally wounded, he went upstairs to his bedroom and opened his window before dying. Brisbane entered the chamber, saw his brother apparently asleep in his chair. He shot the corpse and arranged the scene to look like a suicide. Downstairs, he ran into the actual killer, who had seen that Archer Coe was still alive and came back to finish the job. In the darkness, he mistook Brisbane for Archer and killed the wrong man. Delafield's dog then wandered in, attracted by the commotion, and attacked the murderer.\nWhile sure of the killer's identity, Vance has no proof. He therefore arranges for Sir Thomas and Wrede to quarrel over Hilda Lake. When Wrede instinctively reaches for the poker to strike his rival, the Doberman recognizes its attacker and leaps on him. Wrede confesses he became enraged when Coe refused to assist his courtship of Miss Lake, precipitating the stabbing."}