{"mid": "TheKiteRunner", "IMDB_id": "tt0419887", "title": "The Kite Runner", "plot": "=== Setting: San Francisco, 2000 ===\nThe film opens with an Afghan-American writer Amir Qadiri (Khalid Abdalla) and his wife, Soraya (Atossa Leoni), who are watching children flying kites at a bayside park. When they arrive home, Amir finds waiting for him packages of his new novel, A Season for Ashes, which has just been published. Soraya refers to the book as Amir’s “baby,” hinting at the couple’s inability to have a child of their own. Amir then receives an unexpected call from an old friend of his father’s, Rahim Khan (Shaun Toub), who is living in Peshawar, Pakistan.\n=== Flashback: Kabul, 1978-1979 ===\nTen-year-old Amir (played as a child by Zekeria Ebrahimi) is the son of a wealthy man (Homayoun Ershadi), known locally by the honorific title “Agha Sahib”. (Amir refers to him as “Baba,” meaning “father.”) Baba, a philanthropist and iconoclast, is a Pashtun living in Kabul. Amir’s best friend Hassan (Ahmad Khan Mahmoodzada) is the son of the Agha Sahib’s Hazara servant, Ali (Nabi Tanha). Amir participates in the sport of kite fighting, popular among the boys of Kabul. Two kite flyers compete to cut each other’s kite strings, the defeated kite becoming the prize of the winner. Hassan serves as Amir’s spool-holder and “kite runner,” who retrieves the defeated kite. Hassan has the ability to determine where the loose kite will land without watching its course through the air. Hassan has deadly aim with his slingshot, and one day on Hassan’s birthday, Amir gives Hassan a slingshot made in America. Hassan pledges his loyalty to Amir, swearing that he would eat dirt if Amir so asked.\nAmir also is a writer, and he often reads to the illiterate Hassan. Hassan particularly likes to hear the story of Rostam and Sohrab from the Persian epic Shahnameh. Baba disapproves of his son’s bookishness, and complains to his friend and business associate Rahim Khan that the boy doesn’t stand up for himself, letting Hassan fight his battles for him. Amir overhears this conversation and Rahim Khan goes to Amir’s room to assure him that his father loves him. Amir says that he believes that his father resents him because Amir’s mother died in childbirth. Rahim Khan also encourages Amir to keep writing.\nAmir and Hassan are often bullied by an older Pashtun boy, Assef (Elham Ehsas) and Assef’s two friends, who harbor ethnic hatred against Hazaras. Cornered one day by the three boys, Hassan protects Amir by threatening Assef with his slingshot. The bullies flee, but Assef promises revenge.\nOne day Amir enters the city-wide kite-fighting contest, and his father—who was a champion in his own youth—watches proudly from a balcony, accompanied by Rahim Khan, as Amir breaks his father’s record of 14 “kills”. Hassan sprints off to “run” the last defeated kite and he is gone for some time. Eventually, Amir finds Hassan trapped in a dead-end by Assef and his two goons. Assef demands the kite as payment for letting Hassan go free, but Hassan refuses, asserting that the kite belongs to Amir. Amir watches the scene while concealed, too afraid to intervene. Assef then beats and rapes Hassan as his friends hold the boy down. Amir flees from the scene. When Hassan emerges, bleeding, Amir pretends not to know what has occurred. Over the next few weeks, Amir, wracked with guilt, avoids Hassan, who spends all his free time in bed. Ali and Baba try to find out whether something has happened, but Amir pleads ignorance.\nOne day, Amir walks to a tree underneath which Amir often read stories to Hassan, and finds Hassan teaching himself to read. Amir accuses Hassan of cowardice, and throws pomegranates at him, daring Hassan to strike him. Hassan picks up a pomegranate and smashes it into his own face. Later, Amir asks his father whether he would consider replacing his servants Ali and Hassan. Baba angrily rebukes Amir, declaring that Ali has worked for the family for 40 years and that Ali and Hassan will always stay with them.\nBaba throws a massive party for Amir’s birthday, but Amir is unable to enjoy it, watching Hassan serve the guests. Assef attends with his father, and Amir meekly accepts Assef’s gift and well-wishes. Rahim Khan, who presents Amir with a blank book for his stories, senses something is wrong and tells Amir that Amir can tell him anything. The next day, Amir plants his wristwatch, a birthday present from his father, under Hassan’s pillow, and tells the Agha Sahib that Hassan has stolen it. When confronted by Baba, Hassan falsely confesses to stealing it. The Agha Sahib forgives him, but Ali lets him know that he and Hassan can no longer work for him, and, much to Baba's distress, they pack their belongings and leave.\nIn June 1979, the Soviet Union militarily intervenes. Baba leaves his house in the care of Rahim Khan and flees to Pakistan with Amir. They travel by truck with other refugees and, along the way, they are stopped by a Soviet Army private, who demands sex with a young wife and mother who is among the refugees. Baba intervenes, daring the soldier to shoot him, but the situation is defused when the soldier’s superiors appear on the scene.\n=== Flash Forward: Fremont, California, 1988 ===\nBaba runs a service station and operates a stall at a weekly flea market. Amir earns a degree at a local community college and, Baba, though disappointed that Amir wants to be a writer rather than a physician, says that Amir can earn money by working with him.\nOne day at the flea market, Amir’s father introduces him to General Taheri (Abdul Khadir Farookh), another Pashtun and a former officer in the Afghan army. Amir is smitten by Taheri’s daughter, Soraya, but Taheri, who has little regard for artists, discourages his advances.\nSoon after, Baba is diagnosed with lung cancer, and he becomes gravely ill. Baba refuses to stay at the hospital and wishes to live his last days at home. After Amir brings him home, he asks his father to ask General Taheri for his daughter’s hand in marriage. Taheri agrees, but Amir’s father tells him that Soraya wants to speak with him. On a chaperoned stroll, Soraya reveals that when the Taheris were living in Virginia, she ran away with a Pashtun man and lived with him until her father came to retrieve her. Soon after, the Taheris moved to California to flee the gossip surrounding them. Amir is shocked, but still pledges his love, and they marry. Baba dies soon afterward.\n=== Flash Forward, 2000 ===\nRahim Khan persuades Amir to visit him in Pakistan. He tells him that the situation is bad, but Amir has an opportunity to “be good again”. Amir cancels his book tour and goes to Peshawar. Rahim Khan, who is dying, tells Amir that he worked with Hassan and his wife and son. Rahim Khan himself had to flee to Pakistan when his own health deteriorated and the Taliban took over power after the civil war. One day the Taliban appeared at the house and demanded that Hassan vacate the premises, declaring that no Hazara could be in legitimate possession of the house. Hassan refused to surrender the house and the Taliban executed him in the street, and also shot his wife. Hassan’s son, Sohrab, was taken to an orphanage. Rahim Khan urges Amir to return to Kabul to find Sohrab and give him a letter written by Hassan, who had taught himself to read and write. Amir resists until Rahim Khan reveals that Hassan was not really Ali’s biological son. Rahim Khan says that Amir’s father had had an affair with Ali’s wife and was the true biological father of Hassan as Ali was infertile.\nAmir agrees to go to Kabul, accompanied by a driver, Farid (Saïd Taghmaoui), who helps him don a disguise and a fake beard and negotiate the Taliban-controlled city. Amir and Farid go to the orphanage where Sohrab was taken and learn that Sohrab has been taken away to a Taliban official, who occasionally takes away young girls or boys. They are told that they can meet the Taliban official at a football match. Amir and Farid attend the match, where they witness the Taliban stoning adulterers at half-time. Amir manages to get an appointment to see the Taliban official.\nAfter he arrives at the official’s house, he is surprised to find that the assistant of the Taliban official he is looking for is actually Assef (played now by Abdul Salam Yusoufzai), who recognizes Amir immediately even with the false beard. Assef presents Sohrab as his dance boy. Assef agrees to let Sohrab go, but he begins to beat Amir as \"payment\". In the confusion, Sohrab is able to pull out his slingshot - the same slingshot that Amir had given to Hassan when they were boys - and shoots Assef in the eye. Sohrab and an injured Amir manage to escape through a window, and flee in Farid's car.\nWhen they get back to Peshawar, they find that Rahim Khan has died, but he has left a letter for Amir. The next morning, Sohrab has disappeared. Amir desperately searches for Sohrab in the city, ending up following a boy to a mosque. When he returns to Rahim's apartment, Amir finds Sohrab waiting for him in the stairway. Sohrab reveals that Assef would rape him before morning prayers, and that he didn't want his abuser to \"get him\" anymore.\nBack in San Francisco, Amir introduces Sohrab to Soraya, and they welcome him into their home. Amir’s father-in-law, General Taheri demands to know why they have taken in “that Hazara boy”. Amir reveals that Sohrab is his half-brother’s son, and stands up to his father-in-law to demand respect for the boy. The film ends with Amir teaching Sohrab how to fly kites and volunteering to act as Sohrab’s “runner”, and running off to fetch the kite, repeating the words Hassan had said to him when they were boys: \"For you, a thousand times over.\""}