{"mid": "TheLonelyLady", "IMDB_id": "tt0085863", "title": "The Lonely Lady", "plot": "Jerilee Randall (Pia Zadora) is an innocent schoolgirl living in the San Fernando Valley area of California with dreams of becoming a famous screenwriter. Shortly after winning a trophy for her creative writing, she meets Walt (Kerry Shale), the son of famous screenwriter Walter Thornton (Lloyd Bochner), at a party. She goes home with him, along with some other friends, and during a late evening pool party, one of Jerilee's friends (played by Ray Liotta in one of his first roles) beats her, slaps her and then sexually assaults her with a garden hose nozzle.\nWalter arrives after the assault has taken place and saves Jerilee from further attacks. A friendship, then a love affair, develops between them, and they soon marry, despite the disapproval of Jerilee's mother (Bibi Besch). The marriage begins to fall apart when Jerilee rewrites one of Walter's scripts and is told she had improved it greatly. (She had actually only added the word, \"Why?\") Despite this, the revised script works well for the actress delivering the line and she thanks Walter for it.\nDivorce is inevitable when Walter scorns Jerilee during an argument and accuses her of enjoying having been raped all those years ago. After the divorce, Jerilee has several love affairs while trying to get her own screenplay produced, using her sexual charms to pave the way to recognition, with revenge thrown in the end for good measure. One affair, with actor George Ballantine (Jared Martin), quickly ends with her pregnant; upon realizing he would not support her, she gets an abortion. While meeting club owner Vincent Dacosta (Joseph Cali), who has contacts to agents who can help produce a screenplay, Jerilee ends up working for him as a waitress for a short time. Eventually she has an affair with him as well, and when visiting the agent he had promised would possibly approve of, she realizes that she has been had and that he sent her there to have sex with him and another woman. After confronting Vincent about this, he gives Jerilee her screenplay back, laughing about it while on drugs with two other women. Jerilee finally has a nervous breakdown in a sequence wherein she sees the callous people of her past appear as faces on the keys of her typewriter.\nAfter spending a few days in a mental facility, Jerilee rewrites her screenplay. Upon meeting director Guy Jackson (Anthony Holland), he does help her get her screenplay produced successfully; however, once again she's expected to have sex, this time with Mrs. Jackson. At the live awards telecast, Jerilee ultimately wins a prestigious award for her screenplay of a film titled The Hold-Outs. On stage, she admits to her ex-husband Walter Thornton that she has never learned \"the meaning of self-respect\" and bluntly speaks out about the Hollywood system in which women have to \"fuck [their] way to the top\". Jerilee then refuses to accept the award, and walks out of the auditorium with her newfound dignity."}