{"mid": "TheLastCommand", "IMDB_id": "tt0019071", "title": "The Last Command", "plot": "The book is set a month after Dark Force Rising.\nNow emboldened by his recent capture of the Katana fleet and staffing them with clone personnel, Grand Admiral Thrawn launches his offensive against the New Republic with great success. Through certain deception techniques (such as faking a turbolaser barrage using cloaked ships to fire underneath planetary shields), several planets quickly capitulate to the Empire. He ups the ante when the Imperial fleet deploys 22 cloaked asteroids over Coruscant and fakes the presence of over 260 asteroids to immobilize the planet and the Republic leadership. By this time, Mon Mothma finally reconciles with Sen Garm Bel Iblis, whom she lets lead Coruscant's defenses.\nElsewhere, Han Solo, Chewbacca and Talon Karrde work to form an alliance of smugglers to assist with the New Republic defense. Although the smugglers consider staying in the sidelines, an Imperial raid on their meeting place (set up by turncoat smuggler Niles Ferrier without Thrawn's permission) finally unites them against the Empire.\nMara Jade, who was knocked out in the climax of the previous novel, joins Princess Leia and Han in stopping an Imperial commando force sent to Coruscant to kidnap Leia's newborn twins for Joruus C'baoth. The Jedi Master wants to turn Leia, Luke and the twins to the Dark Side. The raid's sole survivor points to Mara as their mole and she is arrested, but she comes clean to Leia about the Wayland cloning facility. As they slip out of Coruscant, Republic security shuts down an Imperial eavesdropping system located in the former Imperial Palace.\nMara, Luke, Han, Lando, Chewie, the droids, and Karrde travel to Wayland. They slip past Imperial forces in the area with help from the Noghri and two local alien races. Han, Lando, and Chewie rig the base to explode. Mara, Luke, Karrde and Leia face C'baoth, who produced his own Skywalker clone named Luuke (using Luke's hand that was lost at Bespin during the events of The Empire Strikes Back, intact with Anakin Skywalker's own lightsaber) to attack them. After a fierce battle, Mara kills C'baoth and fulfills the Emperor's orders - by killing Luuke.\nHaving learned of Thrawn's deception strategy, the Republic fleet organizes an assault on the Imperial shipyards at Bilbringi to capture a device that can find the cloaked asteroids over Coruscant. A feint operation at Tangrene will draw Imperial forces away from Bilbringi. However, Thrawn sees through the deception and marshals his forces at the shipyards. When the Republic fleet and the smugglers attack, the Imperial forces severely maul them. Things nearly go the Empire's way - until Capt. Gilad Pellaeon receives word of the attack on Wayland. When he reads that Noghri were among the attackers, Thrawn's own Noghri bodyguard Rukh stuns him and kills the admiral himself before disappearing. With all hopes of victory now dashed by Thrawn's death, Pellaeon orders all Imperial forces to retreat.\nBack in Coruscant, Luke gives Mara Jade his father's lightsaber and invites her to train as a Jedi."}