{"mid": "TheLordsOfDiscipline", "IMDB_id": "tt0085867", "title": "The Lords of Discipline", "plot": "Will McLean, an aspiring novelist, finds life as a \"knob\" or \"plebe\" (a first-year cadet in training) at the Carolina Military Institute in Charleston to be physically and emotionally brutal. Will is not interested in a military career, and had only agreed to attend the Institute as a promise to his father, who was an alumnus, and died of cancer several years before the story takes place.\nWill does not exactly excel in military training, but he is a decent student, an athlete, and his professors and peers recognize him for his integrity and his sense of fairness. Still, this is not an easy time to be a student in a military academy—especially in the South. On top of that, Will's Irish background and Roman Catholic faith have made him an outsider in Charleston society.\nWill finds solace in his three roommates, who become his close friends: Tradd St. Croix, an \"old Charlestonian\" (from a very rich and respected family); and Dante \"Pig\" Pignetti and Mark Santoro, two brawny, Northern boys of Italian descent. He also respects the tough-talking, cigar-chomping Colonel \"Bear\" Berrineau (based on Thomas Nugent \"The Boo\" Courvoisie, a former Commandant at The Citadel) who asks the senior cadet McLean to look out for the Institute's first black cadet, Tom Pearce. \"The Bear\" chose McLean for this duty because an essay McLean had written in a previous year marked him as the only liberal in the student body.\nBut McLean's journey to manhood has many twists and turns, as he meets a girl whose life he can never be a part of and hears rumors of The Ten, a mysterious Institute secret society that ensures certain cadets, deemed unacceptable to \"wear the ring\" (that is, to be a graduate of the Institute, denoted by wearing of a class ring), are run out by any means necessary. The Vietnam War is raging, the military is unpopular and desegregation is knocking on the doors of Southern schools. It quickly becomes apparent that a group of cadets is trying to run Pearce out of the Institute, acting on the orders of trustees who are seeing to it that the Institute remain \"as white as a flounder's belly\". Will steps in to intervene, and he discovers a truth so horrendous that this knowledge can bring down the Institute. It also makes Will and his roommates targets. Not only is their graduation now in jeopardy, but their lives are also in danger."}