{"mid": "TheLimitsOfControl", "IMDB_id": "tt1135092", "title": "The Limits of Control", "plot": "In an airport, Lone Man (Isaach de Bankolé) is being instructed on his mission by Creole (Alex Descas). The mission itself is left unstated and the instructions are cryptic, including such phrases as \"Everything is subjective,\" \"The universe has no center and no edges; reality is arbitrary,\" and \"Use your imagination and your skills.\" After the meeting in the airport he travels to Madrid and then on to Seville, meeting several people in cafés and on trains along the way.\nEach meeting has the same pattern: he orders two espressos at a cafe and waits, his contact arrives and in Spanish asks, \"You don't speak Spanish, right?\" in different ways, to which he responds, \"No.\" The contacts tell him about their individual interests such as molecules, art, or film, then the two of them exchange matchboxes. A code written on a small piece of paper is inside each matchbox, which Lone Man reads and then eats. These coded messages lead him to his next rendezvous.\nHe repeatedly encounters a woman (Paz de la Huerta) who is always either completely nude or wearing only a transparent raincoat. She invites him to have sex with her but he declines, stating that he never has sex while he is working. One phrase that Creole, the man in the airport tells him is repeated throughout the movie: \"He who thinks he is bigger than the rest must go to the cemetery. There he will see what life really is: a handful of dirt.\" This phrase is sung in a flamenco song in a club in Seville at one point in his journey.\nIn Almería, he is given a ride in a pickup truck - driven by a companion of the Mexican (Gael García Bernal) - on which the words La vida no vale nada ('life is worth nothing') are painted, a phrase Guitar (John Hurt) says to him in Seville, and he is taken to Tabernas desert. There lies a fortified and heavily guarded compound. After observing the compound from afar, he somehow penetrates its defenses and waits for his target inside the target's office. The target (Bill Murray) asks how he got in, and he answers, \"I used my imagination.\" After the murder with a guitar string, he rides back to Madrid, where he locks away the suit he has worn throughout the movie and changes into a sweatsuit bearing the national flag of Cameroon. Before exiting the train station onto a crowded sidewalk he throws away his last matchbox."}