{"mid": "TheLionKingIISimbasPride", "IMDB_id": "tt0120131", "title": "The Lion King II: Simba's Pride", "plot": "The film opens where the previous film ended, set a few years later, where Rafiki (Robert Guillaume) gathers the animals of the Pride Lands together for the presentation of Simba (Matthew Broderick) and Nalas (Moira Kelly) new daughter Kiara. Mufasa's spirit (James Earl Jones) watches over the ceremony. Later, Simba becomes very overprotective of an older Kiara (Michelle Horn), assigning Timon and Pumbaa (Nathan Lane and Ernie Sabella) to watch her. One day as Kiara was playing, she fell into a small pond as Timon and Pumbba got her back onto land. Kiara tells them only half of her is a princess. Pumbba asks, \"Well, who's the other half?\" While they wait for her to answer, they start having a snack. Then they started arguing about slimy and crunchy grubs. While they were arguing, Kiara sneaks into the \"Outlands\" where she meets a young cub named Kovu (Ryan O'Donohue). After escaping a river filled with nile crocodiles, the two become friendly, unaware they are being watched by Kovu's mother, Zira (Suzanne Pleshette).\nSimba arrives and confronts Zira, who reminds Simba that he exiled the Outsiders, and that if he wants to punish them, Kovu is Scar's hand-chosen successor. Unwilling to harm the cub, Simba orders them to leave. Later Simba scolds Kiara for endangering herself. In the Outlands, Zira's eldest son, Nuka (Andy Dick), complains to his younger sister Vitani (Lacey Chabert) about Kovu's status as \"the Chosen One\" the cub chosen by Scar to lead the pride after his death. (\"I should've been the \"Chosen One\". I'm the strongest, I'm the smartest, I'm the oldest, etc.\") At that moment, Zira returns and scolds both of her sons, but Kovu accidentally gives her the idea to use Kovu's new friendship with Kiara as a means of exacting her revenge on Simba for Scar's death.\nNow an adult, Kiara (Neve Campbell) heads out from home for her first solo hunt, however Simba again sends Timon and Pumbaa to follow and watch her progress after he promised to let Kiara hunt on her own. Furious to find out her father still insists on maintaining surveillance, Kiara goes further from home to hunt, though is still unsuccessful in her efforts. Meanwhile, Zira's plan to implant Kovu in Simba's pride has been set in motion; Nuka and Vitani (Jennifer Lien) set fire to the plains where Kiara is hunting, causing her to faint and giving Kovu (Jason Marsden) the chance to rescue her. Drawn by the smoke, Simba finds them together and reluctantly accepts Kovu's request to come to Pride Rock in return for saving Kiara's life, though he forces Kovu to sleep outside. That same night, Simba has a nightmare about his father's death, where Scar suddenly morphs into Kovu and Simba takes his father's place falling off the cliff.\nThe next morning, he goes outside to a watering hole where Kovu contemplates attacking him, but Kiara interrupts and they go off together so Kovu can help her learn how to hunt. Kiara kept on failing. During the lesson, Kovu was setting an example for Kiara, thinking Timon was just an ordinary meerkat. They run into Timon and Pumbaa struggling with some birds, so the two lions help them chase the birds off. Together, they have fun playing, something Kovu notes he has never experienced before. That night, Kovu tells Kiara that he is not Scar's real son, but \"was a part of him\". Simba watches from above, seeking guidance from the \"Great Kings\" and Nala advises him to give Kovu a chance, because he is not his father. Kovu decides to leave after he almost confesses his real intentions to Kiara, but Rafiki stops him and invites the young lions to experience \"Upendi\" love. After a musical journey through the jungle, the two fall in love.\nIn the morning, Simba invites Kovu for a walk and tells him the true story of Scar, which Kovu had never heard. However, their walk is interrupted by an ambush from Zira, her daughter and son and her pride. After a brief fight, Simba manages to escape by scaling a wall of logs in a dried-up gorge. Nuka chases after him in the hopes of impressing his mother, but he slips and is killed by falling logs. Zira blames Kovu for Nuka's death, swiping a paw across his face and scarring his eye. Kovu flees and returns to Pride Rock where he begs forgiveness. Convinced that Kovu was aware of the ambush, the wounded Simba exiles him and orders Kiara confined to their den. Kiara later escapes and, after a long search, reunites with Kovu.\nMeanwhile, as a thunderstorm struck the Pride Lands, Zira leads her pride in a war against the Pride Lands, and a fierce fight breaks out. As Zira and Simba face off, Kovu and Kiara leap between them and demand that the fighting cease. Kiara reminds her father that, by his own words, \"we are one\". (\"A wise King once told me, we are one. I didn't understand him before. Now I do.\" \"But they-\" \"Them? Us! Just look at them. They are us. What differences do you see?\") The Outsiders realize Kiara is correct, but Zira ignores her. Vitani agrees with Kiara. Unmoved by her insight, Zira wickedly tells her daughter that she will die too if she will not fight, which turns the other Outlanders against her. Now alone, Zira attempts to attack Simba, but Kiara pushes her away, and they both fall over a cliff. Kiara lands on a rock, but Zira slides towards a storm-swollen river. She refuses Kiara's offer of help, then slips and falls to her death. Simba allows the Outlanders, including Kovu, to return to the Pride Lands, and Kovu is allowed to stand with Kiara at the top of Pride Rock with Mufasa proudly proclaiming \"We are one\"."}