{"mid": "TheLegendOfBillieJean", "IMDB_id": "tt0089470", "title": "The Legend of Billie Jean", "plot": "Billie Jean Davy (Helen Slater), a Corpus Christi, Texas high school girl, rides with her younger brother, Binx (Christian Slater) on his Honda Elite to a local lake to go swimming. At a drive-in, Hubie Pyatt (Barry Tubb), a rowdy local teen, hits on Billie Jean, but Binx humiliates him. At the lake, Hubie takes his revenge, stealing Binx's scooter.\nBillie Jean goes to the police with her friends Putter (Yeardley Smith) and Ophelia (Martha Gehman). Detective Ringwald (Peter Coyote) is sympathetic, but urges them to wait the problem out. Binx attempts to retrieve his scooter and returns beaten, with his scooter severely damaged. Billie Jean, Binx, and Ophelia go to Mr. Pyatt's shop to get the money ($608.00) to repair the scooter. While initially appearing helpful and understanding, Mr. Pyatt then propositions Billie Jean with a 'Pay as you go, earn as you learn' plan by which he will have sex with her. He then attempts to rape her.\nMeanwhile, Binx has discovered a gun in the empty store and attempts to taunt Mr. Pyatt with it. Mr. Pyatt tells him the gun is unloaded, but Binx accidentally fires it, wounding Mr Pyatt in the shoulder. The group races away from the shop and become fugitives.\nBy the time Detective Ringwald realizes that he made a mistake in not listening to Billie Jean, the situation is spinning out of control. Throughout it all, Billie Jean wants only the $608 to fix her brother's scooter and an apology from Mr. Pyatt. With help from Lloyd Muldaur (Keith Gordon), the disgruntled teenage son of the district attorney, who voluntarily becomes her \"hostage\", Billie Jean makes a video of her demands, featuring herself with her long, blond hair chopped into a crew cut as a sign of her rebellion. As media coverage increases, Billie Jean becomes a teen icon – a symbol of youth empowerment and the evidence of the injustices adults are capable of, and young fans follow her every movement. Facing uncertain dangers, both physical and legal, Billie Jean is forced to turn her friends Putter and Ophelia in to the police for their safety. When Ringwald and the police arrive and he demands to know where Billie Jean is, Ophelia proudly and defiantly replies, \"Everywhere!\"\nMr. Pyatt issues a bounty for her apprehension, and Billie Jean realizes the best plan is to put an end to the extraordinary circumstances and to turn herself in. To avoid attracting too much attention, she and her brother Binx both arrive in disguise. But the disguise is blown, and the consequences descend into a violent riot, which results in Binx getting shot. As Binx is taken away in an ambulance, Billie Jean confronts Mr. Pyatt and gets him to admit his actions that led to him being shot in his store. The onlookers (including Hubie), seeing how Billie Jean was exploited and their indirect involvement in it, destroy all the Billie Jean merchandise and leave in disgust. At the end of the film Billie Jean and Binx find themselves far up in Vermont seeking some recuperation and a fresh start. Binx, after complaining about the cold, admires a red snowmobile."}