{"mid": "TheLastPictureShow", "IMDB_id": "tt0067328", "title": "The Last Picture Show", "plot": "In 1951, Sonny Crawford and Duane Jackson are high-school seniors and friends in Anarene, a small, declining north Texas town. Duane is dating Jacy Farrow, the prettiest girl in town. Sonny decides to break up with girlfriend Charlene Duggs.\nAt Christmas time, Sonny begins an affair with Ruth Popper, the depressed, middle-aged wife of his high-school coach, Coach Popper. At the Christmas dance, Jacy is invited by Lester Marlow to a naked indoor pool party, at the home of Bobby Sheen, a wealthy young man who seems a better prospect than Duane. Bobby tells Jacy he isn't interested in virgins and to come back after she's had sex.\nThe group of boys take their young intellectually disabled friend, Billy, to a prostitute to lose his virginity but she hits Billy in the face when he ejaculates prematurely. When Duane and Sonny take Billy back home, Sam \"the Lion\" tells them that since they cannot even take care of a friend, he is barring them from his pool hall, movie theater, and cafe. Sonny later sneaks into the cafe and accepts the offer of a free hamburger from the waitress, Genevieve, when Sam walks in and discovers him. Once Sam sees Sonny's genuine affection for Billy he accepts his apology.\nDuring the weekend of New Year's Eve, Duane and Sonny go on a weekend road trip to Mexico. Before they drive off, Sam comes to encourage them about their trip and gives them some extra money. When they return from the trip, hungover and tired, they learn that during their absence Sam died of a stroke on New Year's Eve. In his will, Sam left the movie theater to the woman who ran the concession stand, the café to Genevieve, $1,000 to Joe Bob Blanton, and the pool hall to Sonny.\nJacy invites Duane to a motel for sex but he is unable to perform. She loses her virginity to him on their second attempt and then breaks up with him by phone. When Bobby marries another girl, Jacy is disappointed. Out of boredom, she has sex with Abilene, her mother's lover, though he is cold to her afterward. Jacy then sets her sights on Sonny, who drops Ruth without announcement. Duane quarrels with Sonny over Jacy, \"his\" girl, and hits him over the head with a bottle. Duane then decides to join the army to fight in Korea.\nJacy suggests to Sonny that they elope. On their way to their honeymoon, they are stopped by an Oklahoma state trooper; Jacy left a note telling her parents all about their plan. The couple are brought back to Anarene. On the trip back, Jacy's mother Lois admits to Sonny she was Sam the Lion's paramour and tells him he was much better off with Ruth Popper than with Jacy.\nDuane returns to town, before shipping out for Korea. He and Sonny are among the meager group attending the final screening at the movie house, which is closing down. The next morning, after Sonny sees Duane off on the bus, Billy is run over and killed by a hit-and-run driver as he sweeps the street. An upset Sonny seeks comfort from Ruth. Her first reaction is to vent her hurt and anger but then she takes his outstretched hand."}