{"mid": "TheLastBroadcast", "IMDB_id": "tt0122143", "title": "The Last Broadcast", "plot": "The film deals with a documentary film-maker named David Leigh, and his investigation of the Fact or Fiction murders, where a pair of public-access television cable TV hosts were murdered in mysterious circumstances. Leigh sets out to find the truth behind these killings while making his documentary.\nFact or Fiction is a show dealing with unsolved mysteries and the paranormal. Its two hosts are Steven \"Johnny\" Avkast and Locus Wheeler. Initially a success, we find out through Leigh's investigations that the show is failing and is threatened with imminent cancellation. It is at this point that Avkast comes up with the idea of a live Internet Relay Chat section of the show.\nIt is during one such chat that a caller gives Avkast the idea of searching for the Jersey Devil in the Pine Barrens (the film only mentions the Jersey Devil, however, and gives absolutely no background details of the legend). Leaping on this idea, Avkast and Wheeler recruit Rein Clackin, a sound-man who allegedly can record the paranormal, and Jim Suerd, a psychic; Leigh later claims that Suerd is emotionally disturbed. The plan is for the four of them to enter the Pine Barrens, where Suerd will lead them to the location of the Jersey Devil. During the hunt, they will broadcast a live show simultaneously via television, Internet, and amateur radio.\nThey enter the Barrens, but only Suerd emerges alive; the others are horribly murdered. Avkast's body is never found, though it is made clear during Suerd's murder trial that he could not have survived considering the amount of blood lost at the crime scene. Leigh then summarizes the trial. Suerd, the only survivor, is also the only suspect. To aid the prosecution case they employ a video engineer (nicknamed \"The Killer Cutter\") to compile a portrait of the group's trip using the surviving film footage found at the crime scene. Suerd is found guilty and imprisoned, though there is doubt over his guilt as his clothes were not drenched in blood and there is evidence he was engaged in an IRC room at the times of the murders.\nBefore anything can be proven, Suerd dies in prison of unknown causes, and the case is considered closed by the authorities. However, Leigh has a box sent to him containing a damaged videotape reel, which Leigh assumes is tape from the Fact or Fiction team thought not to exist. A data retrieval expert named Shelly Monarch is called in to reconstruct the images on the tape. She finds that not only have Wheeler and Clacklin's deaths been caught on tape, but that Suerd could not have committed the murders. What is also caught is a blurred image of the real killer. As Leigh videotapes her, Monarch uses an image editor to re-construct the image of the killer's face. She completes the reconstructing of the image before Leigh's next visit, but she is shocked to discover that the killer is Leigh himself.\nThe camera then 'shifts' to a third person perspective, whereas all previous footage had been shot by Leigh. From this perspective we observe Leigh attack Monarch and suffocating her to death with a piece of plastic sheeting. He loads Monarch's corpse into his car and drives it out to the woods, where he dumps it in a clearing and then begins awkwardly videotaping himself narrating the next segment of his documentary."}