{"mid": "TheLivingWake", "IMDB_id": "tt0489212", "title": "The Living Wake", "plot": "The film follows the journey of K. Roth Binew, a self-proclaimed genius. After discovering that he has contracted a rare and unnamed terminal disease, he enlists his eccentric rickshaw-riding best and only friend Mills Joaquin (Jesse Eisenberg) to accompany him on his last day to live. Throughout the film, he attempts to find the meaning of life in \"a brief, but powerful monologue\" that his eccentric father had promised to tell him, but abandoned K. Roth before he could.\nK. Roth's final day begins with a confrontation with his neighbor and rival, Reginald, whom he invites to his living wake. With his friend Mills, he attempts to make his funeral arrangements, visits a \"liquorsmith\", and makes a goat sacrifice in order to appease Greek gods. Believing that love is the meaning of life, K. Roth has a picnic with his former nanny, Marla, whom he describes as his true love. This fails, and after a brief romp with a prostitute (Colombe Jacobsen), whom he also invites to his wake, K. Roth and Mills journey to the public library, where he tries to donate his entire works. When his books are deemed to be unfit for reading, K. Roth visits a psychic in another attempt to find the meaning of life.\nWith his wake and death looming, K. Roth falls into a depression. He is revived when he chances upon a church, the members of which encourage him to reconnect with his family. His brother, Karl, and mother (Jill Larson) are reluctant to reconcile with him, and do not believe that he is dying. Karl states that K is neither a writer or an inventor except in his own ego and is a delusional man, he calls the family doctor. After having a last drink at a bar, K. Roth and Mills prepare for the wake.\nThe wake begins, with the entire film's cast in attendance. The wake is made up of dancing by K. Roth, a song performed by Mills called \"If I Was Real\", and a one-woman play performed by K. Roth called \"Remembrance of Dawn\". K. Roth's wake is interrupted by the arrival of his mother, Karl, and the family doctor, Dr. Schoenberg. They plead with him to stop the wake, describing it as another of his \"episodes\". K. Roth refuses, and the wake continues with K. Roth tying up loose ends, including revenge on his neighbor, Reginald, and the giving away of his possessions. Mills recites a poem about K. Roth.\nThe wake is again interrupted by the arrival of the ghost of Lampert Binew (Jim Gaffigan), K. Roth's father. Though only K. Roth can see him, K. Roth proceeds to confront him in front of the audience about his abandonment. Lampert explains to him that he never abandoned him, and had simply died without leaving any trace. He tells K. Roth that there is no \"equation for life\", and therefore no monologue, and that the meaning of life was merely to live to your full potential. With his time drawing near, K. Roth has a moment of self-awareness, stating that his life was meaningless, and that he was a \"stupid, drunk, scared, dying man\". With encouragement from his father, K. Roth concludes his wake with a song and dance. With the last words of the song, K. Roth's disease takes effect, and he collapses into an upright coffin. He is proclaimed dead. The members of the wake pay their final respects. A mourning Mills takes K. Roth's body to a pond, where he sets it ablaze as the film draws to a close."}