{"mid": "TheLegendOfJohnnyLingo", "IMDB_id": "tt0367960", "title": "The Legend of Johnny Lingo", "plot": "Orphan boy named Tama bounced around between families and getting into trouble. He became friends with a girl named mahana who is considered ugly by the villagers. Even though she is ugly and ill treated by her father and the people around her, she remained kind and good. One day, the boy planned to explore and promised to mahana that he will come back. Everyday from the day of the departure of Tama, Mahana will wait at the shore looking for her friend's arrival. The boy drift ashore and was found by johnny lingo. He was given work by johnny lingo and found ways to make his work easier. He invented some simple machines that will help him finish his work faster yet efficient. Ten years has passed and the adopter of the Tama, johnny lingo, is about to die. The adopter of the boy gave his name, johnny lingo to him. As a new johnny lingo, Tama decided to comeback to the island where he left a girl named mahana. When he arrived, he was well received and asked that every maiden would be shown that night so that he can choose his bride among them. When the night came, all arrived except for mahana whom he made his promise. He went to see her in their house but was rejected by mahana. The new johnny lingo asked the hand of mahana from her father, the latter Agreed if he will give him three chickens as dowry of mahana. The new johnny lingo, however offered ten cows for the hand of mahana. The father of mahana agreed but mahana is furious and slapped the new johnny lingo. Mahana noticed the arm of the man and recognized in his arm the bracelet that she gave to a boy who promised to comeback for her. The new johnny lingo apologized and mahana accepted it. She is curious though of why ten cows. Tama told her that its is the payment for every year he failed to fulfill his promise. Mahana went with Tama back to the place where he lives as johny lingo. Then they lived happily as a married couple."}