{"mid": "TheLovedOnes", "IMDB_id": "tt1316536", "title": "The Loved Ones", "plot": "Brent (Xavier Samuel) is driving with his father in the passenger seat, when a bloodied man appears in the middle of the road. Swerving to avoid hitting the man, Brent's vehicle collides with a tree.\nSix months later, Brent is planning to attend a high school dance with girlfriend Holly (Victoria Thaine), having politely refused an offer by Lola Stone (Robin McLeavy). Brent and Holly meet up, go to Holly's car and they have sex, seen by the now hurt Lola. Holly drives the pair on account of the car crash, and it's revealed that Brent's father died in the accident. Wracked with guilt, Brent has turned to recreational cannabis use and self-mutilation with a razor blade he keeps on a necklace. Once home, Brent leaves the house, goes to a nearby cliff, climbs it halfway and contemplates suicide, but then comes to his senses and climbs to the top.\nWhile listening to music, Brent is attacked from behind. Bound to a chair, he wakes up at Lola's house sitting at a table with Lola, her father (John Brumpton), and a lobotomized-woman they call Bright Eyes (Anne Scott-Pendlebury). Lola's father has turned his house into a dance for his daughter. Lola takes a syringe, fills it with bleach and injects it into Brent's voice box to render him unable to scream or talk. When she makes a threatening comment about Holly, Brent kicks Lola and manages to escape outside. Lola's father chases Brent up a tree, where he and Lola hurl rocks at Brent, knocking him down. The two bring Brent back inside, and nail his feet to the floor with knives. Lola reveals via a scrapbook that she has been abducting many boys throughout her life, one victim in particular is Timmy Valentine, who Brent recognizes to be the bloody man that he swerved in his vehicle six months ago to avoid hitting and led to his Father's death. Timmy turns out to be the brother of Mia Valentine, the goth girl Brent's best friend Jamie asked to the prom. Lola then \"draws\" on Brent by using a fork to carve a heart with \"L S\" in the middle on his chest onto which she liberally throws salt.\nAfter being crowned Queen of her dance, Lola admits to Brent that she is looking for her prince, which is not Brent as he is \"just another frog\". However, Lola confides in her father that he is her prince. Afterward, Daddy lifts the carpet to reveal a secret trap door with the previous abductees still inside. Lola drills a hole through Brent's skull as they intend to lobotomize him like their other captives. But when Lola complains that the hole is too small for her to pour boiling water into, Brent slashes her father with his razor-blade pendant necklace. Brent then attacks Daddy, stabbing him repeatedly in the neck with one of the knives that Brent pulled out of his feet. Lola jumps on Brent and tries to hit him, but Brent knocks her out. Brent then pushes Lola's dad into the pit where he watches in horror as the nearly starved captives eat Daddy. Lola gets up and throws Brent in, throwing nearby objects at him in anger. Brent finds a flashlight and hammer that Lola had thrown down which he uses to kill the abductees as they advance on him. Lola then goes and smothers Bright Eyes with a pillow, revealing that the woman is her mother.\nOn a hunch, Holly calls a policeman (Mia's father) in the neighborhood. When he gets to Lola's house, he sees through a window the bloody floor and chair and breaks in. In an attempt to attract the policeman's attention, Brent makes noise by throwing objects at the doors, alerting the policeman of his presence. But when he opens the doors, Lola appears behind the policeman and Brent cannot say anything to warn him. Lola drives a meat cleaver into his face and the policeman falls down, dropping his gun. Brent attempts to shoot Lola, but she quickly moves out of the way where she finds Brent's necklace on the floor. She then informs Brent that she is going to go to his house and kill his mother, Carla for murdering her father, and Holly for breaking her heart. Brent notices a large pile of bones in the pit. That gives him the idea to pile up the dead bodies, and he manages to climb out.\nLola begins walking on the road with a knife and her scrapbook when she sees a car advance. It is shown to be Holly, so Lola hides and throws her book at the windshield, distracting Holly to a halt. She then attempts to kill Holly, but Holly evades Lola and a chase ensues. Brent is seen driving the police car fast, attempting to catch up with Lola. He sees Holly and nearly hits her but swerves and hits Lola instead. Holly clambers into the police car, and is shocked to see Brent. The two embrace tearfully as Lola, severely injured but still not dead, crawls to kill the pair. They hear the noise of Lola's knife as she drags herself and Brent reverses the car, striking Lola in the head and crushing her skull.\nBrent and Holly arrive back home. Carla looks outside the window to see her son in a brutal state and embraces him after all the horror he has been through. The last scene shown is that of Brent's face as he is being held by Carla, looking on."}