{"mid": "TheLifeAndAdventuresOfSantaClaus", "IMDB_id": "tt0089488", "title": "The Life & Adventures of Santa Claus", "plot": "=== Infancy, youth, and motivation ===\nSanta Claus, as a baby, is found in the Forest of Burzee by Ak, the Master Woodsman of the World (a supreme immortal), and placed in the care of the lioness Shiegra; but thereupon adopted by the Wood Nymph, Necile.\nUpon reaching young adulthood, Claus is introduced by Ak to human society, wherein he sees war, brutality, poverty, child neglect, and child abuse. Because he cannot reside in Burzee as an adult, he settles in the nearby Laughing Valley of Hohaho, where the immortals regularly assist him, and Necile gives him a little cat named Blinky.\n=== Inventing toys ===\nIn the Laughing Valley, Claus becomes known for kindness toward children. On one occasion, his neighbors' son Weekum visits him; and Claus having made an image of Blinky to pass the time, presents him with the finished carving, calling it a \"toy\". Soon, the immortals begin assisting him in the production of other carvings: the Ryls coloring the toys with their infinite paint pots (the first toy was not colored). When he makes a clay figure reminiscent of Necile, he proclaims it a \"dolly\" to evade naming Necile to the children (\"doll\" results when children shorten the name). Claus presents the first one to Bessie Blithesome, a local noblewoman, after consulting with Necile and the Queen of the Fairies about whether he should give toys to wealthy children.\nLater dolls resemble Bessie herself; and later still, counterfeit infant girls.\n=== Reasons for certain traditions ===\nThe Awgwas, evil beings who can turn invisible, steal the toys that Claus is giving to the children, because the toys are preventing the children from misbehaving. This leads to Claus making his journeys by night and descending through chimneys when he is unable to enter the locked doors. The Awgwas nonetheless prevent so many of Claus's deliveries that Ak declares war upon them. With the aid of Asiatic Dragons, Three-Eyed Giants of Tatary, Goozzle-Goblins, and Black Demons from Patalonia, the Awgwas believe their might superior to that of the immortals; but they and their allies are destroyed. Claus is not present for any of the battle. When it is concluded, Ak tells him simply, \"The Awgwas have perished\".\n=== Reindeer, gift exchanges, and Christmas ===\nAs his journeys continue, Claus is aided by two deer named Glossie and Flossie, who pull his sleigh full of toys. With their aid, he reaches the dominions of the Gnome King, who wants toys for his children, but trades a string of sleigh bells for each toy given by Claus. In restriction of the deer's service to a single day annually, their supervisor Wil Knook decides upon Christmas Eve, two weeks away from the hearing, believing this will mean a year without taking the reindeer from their homes; but the Fairies retrieve the toys the Awgwas stole and bring them to Claus, allowing Claus's first Christmas to proceed in spite of Wil.\n=== Santa Claus ===\nAs Claus continues giving gifts, he earns the title \"Santa\" (\"Saint\" in most Romance languages).\n=== Christmas trees and stockings ===\nClaus sees stockings placed by the fire to dry are a good place for his surprises; but when he finds a family (sometimes taken to be Native Americans, or caricatures of the same) living in a tent with no fireplaces, he places the gifts on the branches of the trees just outside the tent.\n=== Immortality ===\nWhen Claus is in his 60s, the Immortals realize he is near the end of his life, and a council, headed by Ak (Master Woodsman of the World), Bo (Master Mariner of the World), and Kern (Master Husbandman of the World) gathers together the Gnome King, the Queen of the Water Spirits, the King of the Wind Demons, the King of the Ryls, the King of the Knooks, the King of the Sound Imps, the King of the Sleep Fays, the Fairy Queen, Queen Zurline of the Wood Nymphs, and the King of the Light Elves with the Princes Flash and Twilight, to decide the fate of Santa Claus. After much debate, he is granted immortality just as the Spirit of Death comes for him.\n=== Deputies ===\nAt the end of the book, the immortal Santa Claus takes on four special deputies: Wisk the Fairy, Peter the Knook, Kilter the Pixie, and Nuter the Ryl. Baum's short follow-up, \"A Kidnapped Santa Claus\", further develops his relationship with his deputies, who must work in his place when Claus is captured by five Daemons. Later, children's parents and various toy-making companies take part in gift-giving, and Santa Claus withdraws to his valley."}