{"mid": "TheLongHotSummer", "IMDB_id": "tt0089500", "title": "The Long Hot Summer", "plot": "Ben Quick is on trial, suspected of barn-burning, but when no solid evidence is found, the judge expels him from town. Ben hitches a ride to Frenchman's Bend, Mississippi, with two young women in a convertible, Clara Varner and her sister-in-law Eula (Lee Remick). Clara's father, Will Varner, is the domineering owner of most of the town.\nBen goes to the Varner plantation. Will is away, but his only son, Jody, agrees to let Ben become a sharecropper on a vacant farm. When Will returns from a stay in the hospital, he is furious at Jody for hiring a notorious \"barn burner,\" but soon begins to see in Ben a younger version of himself and comes to admire his ruthlessness and ambition, qualities that Jody lacks. Will is also disappointed with the man that his 23-year-old daughter, Clara, has been seeing for five or six years: Alan Stewart (Richard Anderson), a genteel Southern \"blue blood\" and a mama's boy.\nWill therefore schemes to push his daughter and Ben together, to try to bring fresh, virile blood into the family. However, she is openly hostile to the crude, if magnetic, upstart. Will is determined to have his bloodline go on, so he offers to make Ben wealthy if he marries Clara. Meanwhile, Minnie Littlejohn (Angela Lansbury), Will's long-time mistress, is dissatisfied with their arrangement and wants to marry him.\nJody becomes increasingly frustrated, seeing his position in the family being undermined. After Ben sells some wild horses for Will, he is rewarded with the position of clerk in the general store, alongside Jody. Will even invites him to live in the family mansion.\nThis is the final straw for Jody. He pulls a gun on Ben and threatens to kill him. Ben talks his way out by telling Jody about buried Civil War-era treasure he has supposedly found on a property that Will gave him, a down payment to seal their bargain over Clara. Jody starts digging and finds a bag of coins. He is elated, thinking he might finally free himself of his father's domination; he buys the land from Ben. Late that night, Will finds his son, still digging. After examining one of the coins, Will notices that it was minted in 1910. Jody is shattered.\nBen aggressively pursues Clara. She finally asks Alan what his intentions are, and does not like what she hears. A defeated Jody finds his father alone in their barn. Jody bolts the entrance and sets the barn on fire, but he cannot go through with it and releases Will. The incident leads to a reconciliation between father and son. Men from town assume Ben is the culprit and start toward him, but Will claims he accidentally started the fire by dropping his cigar.\nThe smell of fire brings back bad memories for Ben, who confesses to Clara that his father was a real barn-burner. He tells her how, at age ten, he warned a farmer that his father was about to set another fire. Ben's father got away, never seen again. Ben tells her he is leaving town, but Clara makes it clear she has fallen in love with him. An elated Will confides to Minnie that life is so good, he may have to live forever."}