{"mid": "TheLittleMermaidIIReturnToTheSea", "IMDB_id": "tt0240684", "title": "The Little Mermaid II: Return to the Sea", "plot": "A year has passed since the events of the first film. In that time, Ariel has given birth to a daughter, named Melody. Ariel and Eric set sail for deeper ocean waters, to have Melody meet her extended family, as well as the residents of Atlantica. King Triton greets his granddaughter with a large smile, and a special locket.Suddenly, the festivities are put on hold as Ursula's sister Morgana arrives, with a shark named Undertow. Morgana claims she's here to exact revenge for the death of her sister, threatening to feed Melody to Undertow. Eric and Ariel manage to rescue Melody, while Triton uses his powers to turn Undertow into a small fish. Morgana and her servant escape, but not before vowing to get Melody.Upon returning to land, Ariel decides that they must keep Melody away from the ocean, to keep her safe from Morgana. Triton sadly agrees, and leaves Sebastian to watch over Melody. As Triton swims away, he drops the locket he had given Melody into a small sea trench near Eric's castle.12 years pass, and in that time, a large wall has been built around the castle. Melody in that time has grown into a young girl with black hair like her Father, and her Mother's spunky attitude. Unknown to her parents, Melody has been swimming under the wall, and out in the ocean in secret. While diving down into a small crevice, Melody uncovers the locket with her name on it, that had been meant for her 12 years ago.Meanwhile, Morgana and Undertow have retreated to an Antarctic region, where they have been in hiding from Triton for some time. Morgana attempts to reverse Undertow's shrunken state, but her magic cannot overcome Triton's. Using her magic to scan the ocean, Morgana sees Melody discover the locket, and figures the young girl can help her get revenge on Triton.Melody has since returned to the castle to prepare for her 12th birthday. However, the party does not go as planned, and through a mishap with Sebastian, Melody feels that she's ruined her own birthday party. Ariel goes to console her, but then finds the locket. Up until now, Ariel and Eric have kept secret from Melody about her heritage, and Ariel continues to deny this as Melody feels that her Mother is keeping secrets from her.Later that evening, Melody takes the locket and a row boat, and heads out for open water, figuring that the answer lies out in the ocean. Some ways away, she encounters Undertow, who explains that Morgana can help her. Melody follows Undertow to Morgana's lair, where the sea witch convinces Melody of her true heritage, and offers to turn the girl into a mermaid. Melody eagerly accepts, and excitedly tries out her new fins!Meanwhile, Ariel and Eric have informed Triton of Melody's disappearance. Triton has sent out his own search parties, but Eric recommends that Ariel should also search for Melody in the ocean, while he continues the search above-water. Triton then gives Ariel back her fins, and she returns to the ocean.However, Morgana tells Melody that the magic she used isn't enough to keep her a mermaid permanently. When Melody asks what she can do to stay a mermaid even longer, Morgana claims that a magic trident in Atlantica holds the key to her wish.Morgana provides Melody with a map, but it ends up being broken along the way. She then encounters a penguin named Tip and a walrus named Dash. The two see themselves as adventurers/explorers, and at Melody's request, help guide her to Atlantica.Meanwhile, Ariel has returned to Atlantica as well to speak with her father. She also encounters Flounder, now older and with his own children. Flounder agrees to help his friend, with everyone not realizing that Melody has come to the city.After talking with some other mer-children, Melody manages to take Triton's trident, but accidentally leaves behind the locket she had previously. Triton and the others find his trident stolen, but Ariel notices two sting-rays like the kind she saw when Morgana first appeared all those years ago, and follows them.Meanwhile, Melody has neared Morgana's residence along with Tip and Dash, but the two are scared off by Undertow who quickly leads Melody to Morgana. However, before Melody can hand over the trident, Ariel appears. The two are both shocked to see the other turned into a mermaid, but Morgana plays 'devil's advocate' by convincing Melody that Ariel did a terrible thing by never telling her of her true heritage. This causes Melody to give Morgana the trident. Getting what she wanted, Morgana throws Melody in an underwater ice cave along with Flounder, sealing it off.Morgana then goes to the surface, where Scuttle has led Eric, Triton and the others to Morgana's lair. However, her wielding of the trident makes her unable to be dealt with properly. She also uses the trident's power to restore Undertow to his original size. Undertow then pursues Tip and Dash, before they send him crashing into the ice cavern, freeing Melody, just as she regains her legs.Coming to the surface, she manages to confront Morgana and get the trident back, returning it to her 'Grandfather.' Triton then freezes Morgana in a block of ice, and she sinks to the bottom of the nearby ocean.Triton is finally able to see his Granddaughter for the first time in many years, and offers her a choice to either be human or a mermaid. However, Melody proposes a compromise.Using the trident, she destroys the sea wall around her parent's castle, so that both sides of her family can co-exist in harmony."}