{"mid": "TheLastDragon", "IMDB_id": "tt0089461", "title": "The Last Dragon", "plot": "Set in New York City, the movie follows a martial artist named Leroy Green (a/k/a Bruce Leroy), who has dreams of becoming a great martial artist like his idol Bruce Lee. His master (Thomas Ikeda) explains that he has reached the final level of martial arts accomplishment known as \"The Last Dragon\". Martial artists who reach this final level are said to be able to concentrate such mystical energy into their hands that they begin to glow. Only a true martial arts master would be able to exhibit \"The Glow\" over his entire body. Leroy doesn't fully understand and, in possession of a medal supposedly belonging to Bruce Lee, Leroy embarks upon a journey to find Master Sum Dum Goy, whom his master claims can help Leroy unlock the power of \"The Glow\".\nAnother martial artist, Sho'nuff (Julius J. Carry III) (a/k/a \"The Shogun of Harlem\") sees Leroy as the only obstacle to being acknowledged as the true master of martial arts. Leroy refuses to fight him and a furious Sho'nuff vows that he will defeat Leroy. Sho'nuff and his gang later break in and assault one of the students at Leroy's martial arts school, Johnny Yu (Glen Eaton), demanding that Leroy bow before Sho'nuff. Finally, Sho'nuff and his gang attempt to send a message to Leroy by destroying the Green family pizza restaurant.\nMeanwhile, video arcade mogul Eddie Arkadian (Chris Murney) sends his men to kidnap 7th Heaven video host Laura Charles (Vanity) in the hopes of getting his girlfriend Angela Viracco's (Faith Prince) new music video featured on her show. The kidnap attempt is thwarted by Leroy who easily fends off the thugs. He loses his medal during the struggle, which Laura recovers. Later, Leroy witnesses Laura being kidnapped by Arkadian's brutish henchman Rock (Mike Starr). A clue left behind reveals that the kidnappers work for Eddie Arkadian Productions.\nLaura refuses to promote Angela Viracco's video on her program, but as Arkadian's men prepare to coerce her by force, Leroy suddenly bursts into the room and rescues Laura once again. Back at her apartment, Laura gratefully returns Leroy's medal. Consumed with vengeance, Arkadian hires Sho'nuff to defeat Leroy and takes control of the 7th Heaven studio, capturing Laura and Leroy's younger brother, Richie, who has snuck in hoping to woo Laura.\nPosing as a pizza delivery man, Leroy manages to infiltrate the assumed lair of Master Sum Dum Goy within a fortune cookie factory, but is shocked to discover that the \"Master\" is only a computer churning out cookie fortunes. Leroy consults his former master for answers, but his master suggests that Leroy has known the answers all along.\nNot wanting anyone to get hurt in the process of achieving her stardom, Angela leaves Arkadian and asks Johnny to warn Leroy about his plan. As Leroy returns to 7th Heaven, he is ambushed by an army of violent thugs hired by Arkadian. Leroy's students, led by Johnny, charge into the studio to even the odds. Using Laura as bait, Eddie lures Leroy to a dilapidated building where he finally faces off against Sho'nuff. Sho'nuff reveals his ability to use \"The Glow\", his hands pulsating with a red aura, and beats Leroy viciously before attempting to force him to acknowledge Sho'nuff as \"The Master\". As recent events flash before Leroy's eyes, he realizes that his former Master was correct and that everything he needed to achieve the \"Final Level\" was within him all along. His entire body bathed in the sublime golden light of \"The Glow\", Leroy uses his newfound power to defeat Sho'nuff.\nArkadian appears and fires a single bullet which Leroy catches between his teeth before detaining Arkadian for the police. Laura and Leroy are reunited at the studio where the two kiss."}