{"mid": "TheLordsOfSalem", "IMDB_id": "tt1731697", "title": "The Lords of Salem", "plot": "In the year 1696, a man, Reverend Jonathan Hawthorne (Andrew Prine), writes with his quill pen about the witches of Salem and ridding it of Satan and his army. We cut to a ritual of the witches committing themselves to the devil. They strip their clothes off for the ritual and are dirty and surrounding a fire as they scream and chant.MondayPresent Day. A young woman, Heidi Hawthorne (Sheri Moon Zombie), wakes up in her room naked after a night of drinking by her alarm clock. She takes her dog into the kitchen to feed him. She walks outside to get the paper and says 'hi' to her new neighbor, about to introduce herself but is ignored by her the door is then slammed shut. We see Apartment 5. She goes downstairs to walk her dog and the landlord Lacy (Judy Geeson) says there is no tenant in apartment 5 and no one has lived there since Heidi has lived in the building. Lacy say she'll check it out. She walks outside and suddenly we see a colorful spiral which reveals that Heidi is is a DJ in Boston and its the commercial. The station is hard/screaming rock.As Heidi and the other two DJ's, Whitey (Jeff Daniel Phillips) and Herman (Ken Foree) leave, she receives a package from a group listed as The Lords of Salem. It's a wooden box with a vinyl record inside. She goes home with Whitey. He puts on the record, and it sounds horrible. As it plays, she starts to get weird. The record starts to play the same chanting done by the witches earlier. She has a vision of this and of one of the witches giving birth. Once he turns it off shes fine and tells him he can crash on the couch if he doesn't want to drive all the way home. She gets ready for bed and walks by her bathroom there is a ghost witch woman standing there.TuesdayHeidi goes to a group meeting before going to work (she is a recovering drug addict) at WIQZ radio. At the station, they are interviewing a man named Francis Matthias (Bruce Davison) who wrote a book about the Salem Witch Trials. They play the record she got in the mail, thinking its from a band called The Lords of Salem, over the airwaves and everywhere people are listing to it. Various women start dropping things and entering trances. The name of the song is The Lords of Salem. The guy, Francis, goes home and talks to his wife Alice (María Conchita Alonso), a local artist painter. The name of the song is bothering him.Heidi goes home and meets Lacy's sisters, Sonny (Dee Wallace) and Megan (Patricia Quinn) who have come to visit. Once she finally gets upstairs and turns the light on to feed her dog you can see a dead ghost witch hanging in the corner. She goes back downstairs to drink with the ladies. Megan, reads her palm, but it makes Heidi uncomfortable and she goes upstairs. We see a ghost walk by the hallway. Heidi is in bed watching an old movie. Her dog, Troy, gets outside and starts clawing and barking at the vacant room. Heidi gets him back inside but then the door starts to open by itself. Heidi's curiosity gets the better of her, and she walks towards the door.Inside the room, there is a neon red cross glowing. Heidi is drawn to it and puts her hands up to it, similar to how the witches were acting in the ritual. A demon appears behind her. Suddenly, we see Hell. She leaves the room and enters the hallway, only to see one of the old, naked, witches named Margaret Morgan (Meg Foster) telling her she is a daughter of Salem. She says for her to \"Lead us again\" and Heidi puts her arms out. We see an image of the scene from long ago and Heidi wakes up from her nightmare, however something in her room starts to shake.WednesdayHeidi walks to and enters a church. The priest tells her that God is always open and ready to listen. She seems upset. He tells her that he can tell she's a very sad girl. He starts to comfort her and when she tries to leave he kind of grabs her. He gives her a speech about angels sending people to Hell. He says she is a filthy whore and Christ cant save her, only he can. He starts screaming and goes crazy, when suddenly Heidi snaps awake. It was only a vision. The priest tells her he thinks she fell asleep and she runs out. While sitting outside with her dog, a ghost figure walking a dog starts towards her saying \"We've been waiting for you.\" He vanishes, but then reappears.Meanwhile, Francis is at his own library reading a book about the witch trials. We cut to a vision of the ceremony from earlier in the movie. They took a woman and locked in a chamber by the fire where she burned,and the witches around her screamed. The woman had a mask on her face. Francis, back in reality, calls to his wife and asks her to do something for her play the last few notes printed in a book about the Lords of Salem. He wants to see if it is the same as the music Heidi got. Alice plays it on the piano, and he plays the tape of it. It's the same.Heidi goes to work, and the DJ's are announcing that The Lords are coming to Salem. They have sent them another package filled with concert tickets (though this concert never eventuates on-screen). They play the record. As it plays, Heidi starts to have visions and hear voices, freaking out and leaving the room to cry in the bathroom. At home, she sits alone, and we see rats in the hallway.ThursdayFrancis walks to the author of the book he was looking at. He tells him about the group The Lords of Salem that sent the record to Heidi. He wants to know if there's anything else about The Lords of Salem that he knows. The man that was writing his diary, Hawthorne, in the beginning of the movie thought the group of six were making music for the witches and his group eventually killed them. In the final sections of his diary, he talks about Margaret Morgan, one of the women, and how she put a curse on the women of Salem and put a curse on the man who wrote the diary's descendants (Heidi is one of them).Heidi is staying at her Whiteys house. She tells him she just had to get out of her apartment. She thinks that record is fucking with her. She suddenly starts to cough up blood. He calls 911. As he calls 911 she sees visions of ghost men surround him and knock him to the ground. They are wearing doctors outfits and are holding her down, cutting her open, pulling out her intestines and some type of alien baby figure. She snaps out of it.Heidi seems to be back at home, pops some pills, and goes to her bathroom freaking out. The picture on her wall starts bleeding (the figures in the painting resemble the ghost figures) and whispering Heidi over and over again. She leaves and goes to buy drugs.FridayHeidi is at home, listening to a tape on speaking French, while taking the drugs. There's a knock at her door. Its Lacy and her sisters.Meanwhile, Francis looks up Heidi's family tree online and finds out she's related to the reverend from the 1600s. He calls Heidi but shes asleep. The women are there taking care of her and tell him not to call back, he has the wrong number. They locked the dog in the bathroom and take Heidi, now drugged, into the hallway. They walk towards Room 5, talking to their master. They open the door, and as Heidi enters its a huge ballroom type place. She walks up the stairs, now with creepy face paint on. The Lord is at the top of the stairs and starts making a screaming noise. Heidi leaves the room and goes back into the hallway. She's back in bed.SaturdayWhitey calls Heidi to make sure she's OK. Hes trying to ask her out, but she tells him shes fine. He offers to pick her up to take her to the gig, but she tells him shes fine to get there herself. He tells her hes there whenever she needs him.Francis walks to Heidi's place to see if she's all right. He tells Lacy hes there to see Heidi. She lets him in, saying that they can wait in her apartment until Heidi comes home (she's lying, as Heidi is upstairs sitting in her bathroom). The ladies talk to him, and he reveals hes there to give Heidi information. Lacy starts to yell at him, accusing him of wanting to \"fuck her brain\". He gets up to leave, and one of the sisters knocks him out with a frying pan. Heidi overhears them killing him with it as she crawls on her floor upstairs.Whitey shows up to get Heidi. The women try not to let him pass, but he gets upstairs. He knocks on her door but she is passed out on Heroin on her couch but after knocking repeatedly Heidi finally answers it, very doped up, falling into his arms crying. When Lacy appears Whitey get suspicious and worried that Heidi is so frightened, he asks her what is going on but Lacy tells Heidi to tell Whitey to wait outside. She does what she says begging Whitey to wait outside then she shuts the door to get ready and Lacy takes Whitey with her.Whitey takes Heidi to the concert hall, where Herman is wondering what on Earth is going on. When they arrive Heidi is higher than before and pale with bruises on her face. Herman is seriously worried but Whitey says they can deal with this tomorrow. Heidi then walks away from them and looks at them with tears in her eyes and sadly says \"bye\" and suddenly closes the door on them... locking them out of the Palladium to protect them.Mozart's Requiem plays as the dark Salem Palladium is lit up with a bright light when the curtain lifts up. We see Lacy, Sonny and Megan on the stage wearing 17th century rags. They kneel on the stage and chant to the audience members, saying \"Satan come to us, we are ready.\" The ghost of Margaret Morgan and The Lords of Salem witches appear behind them on stage saying \"Welcome, Whores of Satan. I can taste the foul stench of your ancestors rotting in the folds of filth between your legs, Heidi The One We have been waiting for you Heidi. We have always been waiting.\" the witches play The Lords theme with their hand made instruments sending Heidi and the other female descendants into a trance. Heidi stands on the balcony and removes her glasses and clothes as all the audience members strip their clothes off and the music plays.Heidi sits on the special spot they have made for her. Heidi suddenly appears in a different reality. The witches chant a little, and she starts to put her hands on her head, going crazy. All the audience members, now naked women with masks on, walk towards her. The ghost men, in priest outfits, sit on thrones, all of them stroking dildos as Heidi sits between two of them facing three others. They chant about riding a goat warning her that means excepting The Devil and other strange things. Heidi does strange things, and we see MANY strange visions. Heidi's wild side takes over and she chooses to ride the goat unaware of the serious consequences. There is a cross that says Jesus Saves on top of fire. We are now in what appears to be Hell. The witches surround Heidi talking about their Lord Satan. They keep touching her and just like in her vision she gives birth to a creature.Back on stage, the three women have their heads bowed in prayer when a bright light begins to shine on them so they open their eyes and look up ecstatic happy and staring up at Heidi whose tattoos have gone and her eyes rolled back making them completely white now in a crown and white robe, surrounded by a white light, standing on top of all the now dead naked women. Heidi, having given birth to the Antichrist, is now the Satanic Virgin Mary for the coven.The next day on the radio there is news report on the 32 deaths of the Salem Lifer Society found in the Palladium, and it appears to have been a mass suicide. There is no news on the missing Heidi."}