{"mid": "TheLastBoyScout", "IMDB_id": "tt0102266", "title": "The Last Boy Scout", "plot": "During halftime at a televised football game, L.A. Stallions running back Billy Cole receives a phone call from a mysterious man named Milo, warning him to win the game or he's \"history\". Cole ingests PCP and, in a drug-induced rage, brings a gun onto the field, shooting three opposing players to reach to the end zone. Cole then shoots himself in the head. Meanwhile, private investigator Joseph Hallenbeck discovers that his wife Sarah is having an affair with his best friend, Mike Matthews. Mike gives Joe an assignment to act as bodyguard for a stripper named Cory. Afterwards, Mike is killed by a car bomb outside Joe's house.\nJoe is approached by Cory's boyfriend, former Stallions quarterback Jimmy Dix, who was banned from the league on gambling charges and alleged drug abuse. After an argument where Joe and Jimmy scuffle, an annoyed Jimmy takes Cory from the stage while she is performing. Joe plans to wait outside, where he is knocked out by a team of hitmen. Jimmy and Cory leave the bar in separate cars while Joe is left to dispatch one of the hitmen. When Cory is struck from behind and stops to confront the other driver, she is killed by the hitmen. Jimmy is fired upon and pinned down, but is saved by Joe.\nAt Cory's house, Jimmy and Joe find a taped phone conversation between Senator Calvin Baynard, who is leading a congressional investigation into gambling in sports, and Stallions owner Shelly Marcone. When the tape is ruined in Joe's faulty car stereo, Jimmy realizes that Cory tried using the tape against Marcone to put Jimmy back on the team, prompting Marcone to send the hitmen. Joe saves Jimmy from a second car bomb, and manages to trick two hitmen into blowing themselves up. However, the explosion destroys the remaining evidence.\nJoe reveals to Jimmy that when he was in the Secret Service, he witnessed Baynard torturing a woman in a hotel room and assaulted him to make him stop. Baynard retaliated by having Joe fired from the Secret Service for refusing to cover up the incident. At Joe's house, Jimmy meets Joe's abrasive daughter Darian. When Joe catches Jimmy attempting to use illegal painkillers in the bathroom, Joe kicks him out. As Jimmy leaves, Darian asks him to sign a football trading card, stating that Joe was a fan of Jimmy's and never watched another game after he was banned from the league. He leaves her with the signed card, \"To the daughter of the last Boy Scout.\"\nUpon learning of Mike's affair with Sarah, the police assume Joe killed him and move to arrest him. But Milo, Marcone's top henchman, captures Joe first and shoots an officer using Joe's gun. Marcone explains to Joe that he has been buying Senate votes to legalize sports gambling, but that Baynard tried to blackmail Marcone for $6 million. Being aware of Joe's history with Baynard, Marcone explains it would be cheaper to kill the senator and frame Joe for the murder. Joe is forced to hand a briefcase full of money to Baynard's bodyguards, who switched it with a wired briefcase. Joe is rescued by Jimmy and Darian, and acquires both briefcases after running the bodyguards and Milo off the road. However, Milo survives and kidnaps Darian after Joe leaves her to wait for the police.\nHeading to the stadium to save Darian, they are caught and brought to Marcone's office. Jimmy creates a diversion, allowing them to fight their way free. Knowing Milo will attempt to shoot Baynard, Joe goes after Milo while sending Jimmy to warn the senator. Grabbing the game ball, Jimmy throws it at Baynard, knocking him down just as Milo starts shooting. Joe knocks Milo to the edge of the stadium light platform, where police shoot him several times. The suitcase of money is recovered and the fleeing Marcone, having escaped with the rigged briefcase, is killed when he opens it at his house. The next day, Joe and Sarah reconcile, and Joe and Jimmy decide to become partners."}