{"mid": "TheLittleMermaidArielsBeginning", "IMDB_id": "tt0969647", "title": "The Little Mermaid: Ariel's Beginning", "plot": "King Triton and his wife, Queen Athena, rule over the underwater kingdom of Atlantica, filled with music and laughter. They have seven young daughters: Aquata, Andrina, Arista, Attina, Adella, Alana, and the youngest of whom is Ariel. One day, the merpeople relax in a lagoon above water, and Triton gives Athena a music box. However, a pirate ship approaches. Everyone escapes except Athena, who is crushed to death by the ship when she tries to rescue the music box. Devastated by the death of his wife, Triton throws the music box away, and music is banned from Atlantica.\nTen years later, Ariel and her sisters live under a strict routine maintained by their governess, Marina Del Rey and her assistant, Benjamin. Marina dislikes being the girls' governess and longs to be Triton's attaché, a job currently filled by Sebastian the crab. Ariel hates their current lifestyle, which brings her into arguments with her father. Ariel encounters Flounder, whom she later follows to an underground music club. She is overjoyed by the presence of music, and is shocked when she sees Sebastian performing there. When her presence is revealed, the entire band stops playing and hides, believing Ariel will tell her father about them. Ariel sings a song explaining her love of music and the remembrance of her mother, and she joins the club with an oath.\nAriel returns to the palace, and her sisters confront her over her disappearance. She explains where she was, and the following night the girls go to the club to have fun. Marina finds them, she later reports their activities to Triton, who destroys the club with his trident. Sebastian, Flounder, and the band are sent to prison, while Marina gets the job she wants. Triton punishes his daughters inside the palace, resulting in Ariel asking him why music is forbidden, but he refuses to answer and angrily shouts, \"I will not have music in my kingdom!\" Distraught, Ariel argues that her mother wouldn't have wanted music forbidden. She swims to the bedroom, with her sisters following. That night, she leaves Atlantica, and frees her friends. Sebastian leads them to a deserted place far from the palace where Ariel finds Athena's music box, as Sebastian hoped. Ariel and Sebastian decide to return to Atlantica to bring the music box to Triton, hoping that it will change his mind, as he has not remembered how to be happy after Athena died.\nOn the way back, they are confronted by Marina and her electric eels. Marina wants to stop them so she will retain her position of power, and a struggle ensues. Marina barrels towards Sebastian, but Ariel pushes her away, getting hit in the process. Triton arrives in time to witness this, and blames himself. He sings the lyrics of \"Athena's Song,\" and Ariel recovers. Triton restores music to Atlantica, and appoints Sebastian as Atlantica's first official court composer, much to everyone's delight. Everyone rejoices except Marina and Benjamin, who are sent to jail."}