{"mid": "TheLegendOfHellHouse", "IMDB_id": "tt0070294", "title": "The Legend of Hell House", "plot": "Physicist Lionel Barrett is enlisted by an eccentric millionaire, Mr. Deutsch, to make an investigation into \"survival after death\" in \"the one place where it has yet to be refuted\". This is the Belasco House, the \"Mount Everest of haunted houses\", originally owned by the notorious \"Roaring Giant\" Emeric Belasco, a six-foot-five perverted millionaire and supposed murderer, who disappeared soon after a massacre at his home. The house is believed to be haunted by numerous spirits, the victims of Belasco's twisted and sadistic desires.\nAccompanying Barrett are his wife, Ann, as well as two mediums: a mental medium and Spiritualist minister, Florence Tanner, and a physical medium, Ben Fischer, who is the only survivor of an investigation 20 years previously. The rationalist Barrett is rudely sceptical of Tanner's belief in \"surviving personalities\", spirits which haunt the physical world, and he asserts that there is nothing but unfocused electromagnetic energy in the house. Barrett brings a machine he has developed, which he believes will rid the house of this energy.\nThough not a physical medium, Tanner begins to manifest physical phenomena inside the house. When, after a quarrel with Tanner, Barrett is attacked by invisible forces, he suspects that Tanner may be using the house's energy against him. Meanwhile, Fischer remains aloof, with his mind closed to the house's influence, and is only there to collect the generous paycheck.\nAnn Barrett is subjected to erotic visions late at night, which seem linked to her lackluster sex life. She goes downstairs and, in an apparent trance, disrobes and demands sex from Fischer. He strikes her, snapping her out of the trance, and she returns to herself, horrified and ashamed. A second incident occurs a day or so later; this time, she is awake but uninhibited due to alcohol. Her husband arrives a moment later to witness her advances to Fischer. He is resentful, and spurns Fischer's psychic ability, claiming that \"Mr. Deutsch is wasting one-third of his money!\" Stricken by the accusation, Fischer drops his psychic shields but is immediately attacked.\nTanner is convinced that one of the \"surviving personalities\" is Belasco's tormented son, Daniel, and she is determined to prove it at all costs. She finds a human skeleton chained behind a wall. Believing it to be Daniel, Tanner and Fischer bury the body outside the house and Tanner performs a funeral. Nevertheless, Daniel's \"personality\" continues to haunt Tanner; she is scratched violently by a possessed cat. Barrett suspects that Tanner is mutilating herself. In an attempt to put Daniel to rest, Tanner gives herself to the entity sexually, but the entity brutalizes her.\nBarrett's machine is assembled. Tanner attempts to destroy it, thinking that it will harm the spirits in the house, but Barrett prevents her from doing damage. She enters the chapel, \"the unholy heart\" of the house, in an attempt to warn the spirits, but she is crushed by a falling crucifix. As she dies, she leaves a symbol written in her own blood. Barrett activates his machine, which seems to be effective. Fischer wanders the house afterwards, attempting to sense psychic energy; he declares the place \"completely clear!\" in astonishment. Violent psychic activity soon resumes and Barrett is killed.\nFischer decides to confront the house, and Ann accompanies him despite her misgivings. Deciphering Tanner's dying clue, Fischer deduces that Belasco is the sole entity haunting the house, masquerading as many. He taunts Belasco, declaring him a \"son of a whore\", and that he was no \"roaring giant\", but likely a \"funny little dried-up bastard\" who fooled everyone about his alleged height. Even as objects begin to hurl themselves at Fischer, he continues to defy the entity, until all becomes still. A stained glass partition in the chapel shatters, revealing a hidden door.\nFischer and Ann discover a lead-lined room, containing Belasco's preserved body seated in a chair. Pulling out a pocketknife, Fischer rips open Belasco's trouser leg, discovering his final secret: a pair of prosthetic legs. Fischer realises Belasco had had his own stunted legs amputated, and used the prosthetics in a grotesque attempt to appear imposing. Belasco had the specially built room lined with lead, presaging the discovery of the electromagnetic nature of life after death.\nWith the room now open, Fischer activates Barrett's machine a second time, and he and Ann leave the house, hoping that Barrett and Tanner will guide Belasco to the afterlife without fear."}