{"mid": "TheLostBoys", "IMDB_id": "tt0093437", "title": "The Lost Boys", "plot": "Brothers Michael (Jason Patric) and Sam (Corey Haim) travel with their recently divorced mother, Lucy (Dianne Wiest) to the small beach town of Santa Carla, California to live with her eccentric father (Barnard Hughes). Michael and Sam begin hanging-out at the boardwalk, which is plastered with flyers of missing people, while Lucy gets a job at a video store run by a local bachelor, Max (Edward Herrmann). Michael becomes fascinated by Star (Jami Gertz), a young woman he spots on the boardwalk, though she seems to be in a relationship with the mysterious David (Kiefer Sutherland), the leader of a biker gang. In the local comic book store, Sam meets brothers Edgar (Corey Feldman) and Alan Frog (Jamison Newlander), a pair of self-proclaimed vampire hunters, who give him horror comics to teach him about the threat they claim has infiltrated the town.\nMichael finally talks to Star and is approached by David, who goads him into following them by motorcycle along the beach until they reach a dangerous cliff, which Michael almost goes over. At the gang's hangout, a sunken luxury hotel beneath the cliff, David initiates Michael into the group. Star warns Michael not to drink from an offered bottle, telling him it's blood, but Michael ignores her advice. Later on, David and the others, including Michael, head to a railroad bridge where they hang off the edge over a foggy gorge; one by one they fall, Michael falling after them.\nMichael wakes up the next day unaware of how he got there. His eyes are sensitive to sunlight and he develops a sudden thirst for blood, which leads him to impulsively attack Sam. Sam's dog, Nanook, retaliates, and Sam realizes that Michael is turning into a vampire by his brother's semi-transparent reflection. Sam is initially terrified of his brother but Michael convinces him that he is not yet a vampire and that he desperately needs his help. Michael begins to develop supernatural powers and asks Star for help, but has sex with her shortly afterwards. Sam deduces that, since Michael has not killed anyone, he is a half-vampire and his condition can be reversed upon the death of the head vampire. Sam and the Frog brothers test whether Max is the head vampire during a date with Lucy, but Max passes every test and the boys decide to focus on David.\nTo provoke him into killing, David takes Michael to stalk a group of beach goers, and instigates a feeding frenzy. Horrified, Michael escapes and returns home to Sam. Star arrives, and reveals herself as a half-vampire who is looking to be cured. It emerges that David had intended for Michael to be Star's first kill, sealing her fate as a vampire. The next day, a weakening Michael leads Sam and the Frog brothers to the gang's lair. They impale one of the vampires, Marko (Alex Winter), with a stake, awakening David and the two others, but the boys escape, rescuing Star and Laddie, a half-vampire child and Star's companion.\nThat evening while Lucy is on a date with Max and the grandfather is out of the house, the teens arm themselves with holy-water-filled water guns, a longbow, and stakes, barricading themselves in the house. When night falls, David's gang attack the house. The Frog brothers and Nanook manage to kill one of the vampires by pushing him into a bathtub filled with garlic and holy water, dissolving him to the bone. Sam is attacked by Dwayne, another vampire, and shoots an arrow through his heart and into the stereo behind him, electrocuting him and causing parts of his body to explode. Michael is then attacked by David, forcing him to use his vampire powers. He manages to overpower David and impales him on a set of antlers. However, Michael, Star and Laddie do not transform back to normal as they had hoped. Lucy then returns home with Max, who is revealed to be the head vampire. He informs the boys that to invite a vampire into one's house renders one powerless, explaining why their earlier assumption had been incorrect. Max's objective had been to get Lucy to be a mother for his lost boys. As Max pulls Lucy to him, preparing to transform her, he is killed when Grandpa crashes his jeep through the wall of the house and impales Max on a wooden fence post, causing him to explode. Michael, Star and Laddie then return to normal.\nAmongst this carnage and debris, Grandpa casually retrieves a drink from the refrigerator, and declares: \"One thing about living in Santa Carla I never could stand: all the damn vampires.\""}