{"mid": "TheLongGoodbye", "IMDB_id": "tt0070334", "title": "The Long Goodbye", "plot": "Late one night, with nothing better to do than feed his fussy cat, private investigator Philip Marlowe is visited by his close friend Terry Lennox, who asks for a lift from Los Angeles to the California–Mexico border at Tijuana. Marlowe obliges. On returning home, Marlowe is met by two police detectives, who accuse Lennox of having murdered his rich wife, Sylvia. Marlowe refuses to give them any information, so they arrest him. After three days in jail, the police release him, because Lennox committed suicide in Mexico. It is an open-and-shut case to the police and the press, but the official facts do not sit right with Marlowe.\nMarlowe is hired by Eileen Wade, the platinum-blonde trophy wife of Roger Wade, an alcoholic novelist with writer's block, whose macho, Hemingway-like persona is proving self-destructive. She asks that Marlowe find her husband, who, despite regular alcoholic binges and days-long disappearances from their Malibu home, now seems to be missing. In the course of investigating Mrs. Wade's missing husband, Marlowe visits the subculture of private detoxification clinics for rich alcoholics and drug addicts. He locates and recovers Roger Wade and learns that the Wades knew the Lennoxes socially. He suspects that there is more to Terry's suicide and the murder of Sylvia. Marlowe incurs the wrath of gangster Marty Augustine, who wants money returned that Lennox owed him. Augustine maims his mistress just to demonstrate what could happen to Marlowe, saying, \"That's someone I love. You, I don't even like.\"\nAfter a side-trip to Mexico, where officials corroborate the details of Lennox's death, Marlowe returns to the Wades' house, where a party is broken up after an argument over Roger's unpaid bill from the detoxification clinic. Later that night, Eileen and Marlowe are interrupted when she sees a drunken Roger wandering into the sea; before they can stop him, he drowns. Eileen confesses that Roger had been having an affair with Sylvia and might have killed her. Marlowe tells this to the police, who remain satisfied that Roger's time at the clinic provides an alibi.\nMarlowe visits Augustine, whose missing money has been returned. Marlowe then sees Eileen driving away. He returns to Mexico, where he bribes local officials into revealing the truth. They confess to having set up Terry's apparent suicide and admit he is alive and well in a Mexican villa. Marlowe finds Terry, who admits to killing Sylvia, reveals that he is having an affair with Eileen and gloats that Marlowe fell for his manipulations because Marlowe is \"a born loser.\" Marlowe responds with \"Yeah, I even lost my cat,\" shoots and kills Terry, then walks away, passing Eileen, who is on her way to meeting Terry. Marlowe pulls out his harmonica and strolls jauntily down the road, playing it."}