{"mid": "TheLongKissGoodnight", "IMDB_id": "tt0116908", "title": "The Long Kiss Goodnight", "plot": "Samantha Caine (Geena Davis) is a schoolteacher in the small town of Honesdale, Pennsylvania, with her boyfriend Hal (Tom Amandes) and her daughter Caitlin (Yvonne Zima). Eight years earlier, she was found washed ashore on a New Jersey beach, pregnant with Caitlin and totally amnesiac. Having never remembered her real name or any part of her life from before that day, \"Samantha\" has hired a number of private investigators to try to discover her past, the latest being Mitch Henessey (Samuel L. Jackson). During the Christmas holidays, Samantha is involved in a car accident and suffers a brief concussion, and when she recovers, she finds that she possesses skills with a knife that she cannot explain. Some time later, they are attacked by \"One-Eyed Jack\" (Joseph McKenna), a convict who escaped from jail after seeing Samantha's face on television, but she demonstrates the prowess to subdue and kill Jack bare-handed. Worried that she may scare Caitlin, Samantha leaves with Mitch, who has been able to find a suitcase purportedly belonging to her, to seek out answers.\nThe suitcase contains a note directing the two to Dr. Nathan Waldman (Brian Cox), who they arrange to meet at a train station, unaware that unknown agents are tracing the doctor's calls. En route, Samantha discovers the bottom of the suitcase contains a disassembled sniper rifle which she can expertly reassemble, along with other weapons. At the station, Samantha and Mitch go to meet Dr. Waldman and are attacked by a number of agents, but the two manage to escape with Nathan's help. The doctor reveals that he knows Samantha is really an expert CIA assassin, Charlene Elizabeth \"Charly\" Baltimore, who had disappeared eight years prior. Unsure if they can trust him, (due to the surprise attack they'd just escaped, and him being the only person they'd contacted), Samantha and Mitch leave Waldman behind and seek another contact named on a note within the suitcase, Luke (David Morse), believing him to be Samantha's fiancé. Waldman catches up, trying to warn them of something, and they realize too late that Luke was actually Samantha's last assassination target, \"Daedalus\"; Luke kills Dr. Waldman and captures and tortures Samantha (has her strapped to a large water-wheel to enquire why she's resurfaced after all these years), whilst repeatedly held underwater she's finally jolted into remembering her past life. Samantha escapes, kills Luke, and escapes with Mitch. First however, she has a quick snazzy blond 'makeover' to her old self, which Mitch hardly recognises.\nSamantha/Charly struggles with the duality of her life, realizing that the \"Samantha Caine\" personality was her 'school-teacher cover' to get near to Daedalus eight years earlier, and considered abandoning it. Mitch helps her to recognize the importance of her daughter to her. Continuing to search for answers, Charly and Mitch learn about Daedalus' involvement in \"Project Honeymoon\", which she disrupted on her mission eight years earlier and resulted in One-Eyed Jack's incarceration; \"Project Honeymoon\" was a false flag chemical bomb detonation in downtown Niagara Falls, New York, planned out by the CIA, used to place blame on Islamic terrorists and to secure more funding and power for the department. Charly realizes that a new group is plotting to restage the attack, led by her former boss at the CIA, Leland Perkins (Patrick Malahide) and a psychological-operations specialist named Timothy (Craig Bierko), who Charly had had a romantic relationship with in the past. She and Mitch head to Niagara Falls, and learn that Timothy has kidnapped Caitlin, as well as the motivation behind 'Project Honeymoon' - simulating an Islamic terrorist attack so as to increase CIA off-shore operations funding, recently cut off by Congress. Charly implores Timothy not to hurt Caitlin, after realizing that Timothy is actually Caitlin's biological father.\nCharly and Mitch attack the staging area, forcing Timothy to launch the attack early; meanwhile Caitlin escapes and accidentally locks herself in a cage on the truck carrying the chemical bomb. Mitch is gravely injured in the attack, but gives Charly cover to give chase to the truck. She overpowers the truck's driver, diverting it out onto an empty bridge before it overturns. Charly and Timothy fight, but she overpowers him and knocks Timothy out on top of the truck. Badly injured, Charly frees Caitlin and tells her to clear the bridge, but Timothy's agents prevent her from leaving. Mitch suddenly arrives in a car, races across the bridge, and picks up Charly and Caitlin in time before the truck bomb explodes, killing Timothy and the remains of his force, as well as destroying the bridge. They just manage to escape the blast by the skin of their car's bumper, as they dodge flaming cars raining down on them.\nIn the epilogue, Charly has returned to her assumed identity of Samantha Caine, moving with Caitlin and Hal to a remote farmhouse with a bunch of goats, and declines an offer from the president to rejoin the CIA. For his part, Mitch enjoys the publicity attracted by his role in the crisis, and is last seen being interviewed by Larry King on television, where they discuss Perkins, who was indicted for treason."}