{"mid": "TheLongVoyageHome", "IMDB_id": "tt0032728", "title": "The Long Voyage Home", "plot": "The film tells the story of the crew aboard a British tramp steamer named the SS Glencairn on the long voyage home from the West Indies to Baltimore and then to England. The crew is a motley, fun-loving, hard-drinking lot. Among them is their consensus leader, a middle-aged Irishman named Driscoll (\"Drisk\") (Thomas Mitchell), a young Swedish ex-farmer Ole Olsen (John Wayne), a spiteful steward nicknamed Cocky (Barry Fitzgerald), a brooding Lord Jim-like Englishman Smitty (Ian Hunter), and a burly, thoroughly dependable bruiser Davis (Joseph Sawyer), among others. The film opens on a sultry night in a port in the West Indies where the crew have been confined to their ship by order of the captain, yet they yearn as ever for an opportunity to drink and have fun with the ladies. Drisk has arranged to import a boat-load of local ladies, who along with baskets of fruit, have agreed to smuggle bottles of rum on board where, with the acquiescence of the captain, the crew carouse until a minor drunken brawl breaks out and the ladies are ordered off the ship and denied any of their promised compensation. The next day the ship sails to pick up its cargo for its return trip to England. When the crew discovers that the cargo is high explosives, they at first rebel and grumble among themselves that they won't crew the ship if it is carrying such a cargo. But they are easily cowed into submission by the captain and the ship sails, crossing the Atlantic and passing through what they all know is a war zone and potential disaster.\nAfter the ship leaves Baltimore with its load of dynamite, the rough seas they encounter become nerve-racking to the crew. When the anchor breaks loose, Yank (Ward Bond) is injured in the effort to secure it. With no doctor on board, nothing can be done for his injury, and he dies.\nThey're also concerned that Smitty might be a German spy because he's so aloof and secretive. After they assault Smitty and restrain and gag him, they force him to give up the key to a small metal box they have found in his bunk which they at first think is a bomb. Opening the box against Smitty's vigorous protests, they discover a packet of letters. When Drisk reads a few, it becomes clear that they are letters from Smitty's wife revealing the fact that Smitty has been an alcoholic, disgraced and perhaps dishonorably discharged from his service with the British navy, and that he is now too ashamed to show himself before his family even though his wife urges him to come home. In the war zone as they near port, a German plane attacks the ship, killing Smitty in a burst of machine gun fire. Reaching England without further incident, the rest of the crew members decide not to sign on for another voyage on the Glencairn and go ashore, determined to help Ole return to his family in Sweden, whom he has not seen in ten years.\nIn spite of their determination to help the simple, gullible Ole get on his ship for Stockholm, the crew is incapable of passing up the opportunity for a good time drinking and dancing in a seedy bar to which they have been lured by an agent for ships in port looking for crew members. He has his eye on Ole because he is the biggest and strongest of the lot. He drugs Ole's drink, and calls his confederates in to shanghai Ole aboard another ship, the Amindra. Driscoll and the rest of the crew, even though drunk and almost too late, rescue Ole from the Amindra, but Driscoll is clubbed and left on board as the crew makes its escape with Ole. The next morning, the crew straggles back somewhat dejectedly and resignedly to the Glencairn to sign on for another voyage. A newspaper headline reveals that the Amindra has been sunk in the Channel by German torpedoes, killing all on board."}