{"mid": "TheManWhoCameToDinner", "IMDB_id": "tt0033874", "title": "The Man Who Came to Dinner", "plot": "The play is set in the small town of Mesalia, Ohio in the weeks leading to Christmas in the late 1930s. The exposition reveals that the famously outlandish New York City radio wit Sheridan Whiteside ('Sherry' to his friends) is invited to dine at the house of the well-to-do factory owner Ernest W. Stanley and his family. But before Whiteside can enter the house, he slips on a patch of ice outside the Stanleys' front door and injures his hip. Confined to the Stanleys' home, Whiteside is looked after by several professionals: Dr. Bradley, the absent-minded town physician, Miss Preen, his frantic nurse, and Maggie Cutler, his faithful secretary.\nConfined to the house for a month, Sherry drives his hosts mad by viciously insulting them, monopolizing their house and staff, running up large phone bills, and receiving many bizarre guests, including paroled convicts. However, Sherry manages to befriend the Stanleys' children, June and Richard, as well as Mr. Stanley's eccentric older sister Harriet.\nHe also befriends local newspaper man and aspiring playwright Bert Jefferson, but soon learns that Maggie is in love with Bert, and plans to leave her job to marry him. Unable to bear losing his secretary, Sherry invites his friend, the glamorous and loose-living actress Lorraine Sheldon, to Mesalia to look at Bert's new play, hoping she can break up the marriage plans. Dr. Bradley tells Sherry he was mistaken in his diagnosis, and Sherry is actually well enough to leave. Sherry buys the doctor's silence by pretending to want to work on a book with him, and for the rest of the play keeps brushing him off.\nAs Christmas Day nears, Sherry encourages June Stanley to elope with a young union organizer whom her father disapproves of, and Richard to run away and pursue his dream of becoming a photographer. Lorraine arrives, and Maggie instantly suspects Sherry's involvement. They receive a visit from their friend, noted British actor and playwright Beverly Carlton. Maggie learns Beverly can do a great impression of Lord Bottomley, an English lord whom Lorraine is hoping to marry. She gets Beverly to call Lorraine and pretend to be Lord Bottomley proposing, to get Lorraine to leave. However, Sherry soon sees through the ruse. When Lorraine realizes Maggie's involvement she starts to seduce Bert as revenge.\nThe next day, Christmas, Bert is enthralled with Lorraine, and Maggie, hurt by Sherry's betrayal, tells him she is quitting. Feeling guilty, Sherry tries to think of a way to get Lorraine out of Mesalia. He gets help from an unexpected visit by his friend, movie comedian Banjo. Mr. Stanley, however, furious at Sherry's interference with his family, has now ordered Sherry's eviction from the house and gives him fifteen minutes to leave. All looks hopeless until an Egyptian mummy case is delivered to Sherry (a Christmas gift from the Khedive of Egypt). Sherry and Banjo manage to trick Lorraine into the mummy case and shut her inside. Sherry then sees a photo of Harriet Stanley when she was younger, and recognizes her as a famous murderer. Using this information, he blackmails Mr. Stanley into helping them get the case onto Banjo's plane.\nSherry now stands, telling Maggie she is free to marry Bert, and prepares to return to New York by train. Unfortunately, as he is leaving the house, he slips on another patch of ice, injuring himself again. He is carried back inside the house screaming as the curtain falls."}