{"mid": "TheMummyTombOfTheDragonEmperor", "IMDB_id": "tt1270479", "title": "The Mummy: Tomb of the Dragon Emperor", "plot": "The Mummy-Tomb of the Dragon Emperor\nThis is a walkthrough I wrote myself for the latest videogame version of the latest addition to the popular Mummy franchise. I have done as good a job that I can explaining the steps. I have also created abbreviations for phrases used. Currently, I only have a walkthrough for Act I. I will post the rest later. Below is a list:Ps2 - Play Station 2---\nLAS - Left Analog Stick---\nRAS - Right Analog Stick---\nDB - Directional Buttons---\nT - The Triangle button on a Ps2---\nS - The Square button on a Ps2---\nX - The X Button on a Ps2---\nO - The Circle Button on a Ps2---\nR1 - The Upper Right button on a Ps2---\nR2 - The Lower Right button on a Ps2\nL1 - The Upper Left button on a Ps2 L2 The Lower Left button on a Ps2---\nLO - To use the L1 button to lock-on to a target---\nRP - The points on a level where you re-spawn if you die---\nR - Right---\nL - Left---\nU - Up---\nD - Down---\nC - Clockwise---\nCC - Counter-Clockwise---\nA - The hidden artifacts throughout the game. The first one in the level will be called A1, the second A2, etc.You play as either Rick or Alex OConnell, with a few exception times. Below is a description of who you play as:Richard Rick OConnell The hero of the Mummy movies. He carries 2 Colt Peacemakers, 2 Shotguns, a Thompson Sub-Machine Gun, and hand-grenades.Alexander Alex OConnell Son of renowned adventurers Rick and Evy OConnell. He carries 2 Walter P38 Pistols, a shotgun, a Russian PPS Personal Assault Weapon, and hand-grenades.Abominable Snow Monster Yeti This enormous snow creature helps our heroes when they are in despair. He carries no weapons, but has enormous strength in his punches.Controls:\nX Jump\nS Punch. After grabbing an enemy, you may use this button to punch your grabbed enemy.\nT Kick. After grabbing an enemy, you may use this button to knee your grabbed enemy in the stomach.\nO Grab\nLAS Move.\nRAS Move Camera(sometimes)\nDB Choose Weapon. U for Grenades, R for machine gun, D for pistols, L for shotgun.\nR1 Fire\nR2 Reload\nL1 LO\nO+LAS Throw grabbed enemy in the direction the LAS is pushed.There are some combo moves also available also. The button combinations can be viewed by selecting Controls from the Pause Menu.During each level you must find 4 hidden artifacts.WALKTHROUGH\nAct 1- Emperors Mausoleum\nGoals:\nHidden Artifacts 4\nGun Kills 15\nMelee Kills 15\nGrab/Throw Kills 15\nCompleting these goals get you bonuses like better weapons, better ammo boxes, etc. Finding all 24 artifacts unlocks all cheats.After an introduction video, you start out in the archaeological pit where the door to the dragon emperors tomb is located.A1 When you first start out, you can see the professor. Walk *away* from the professor to the end of the pit. In the corner will be A1.After retrieving A1, proceed on to the professor.You must now fight some enemies during Melee Training. This part is easy, just follow instructions. When all enemies are dead, proceed to the white (I call it a sparkle because it is easy to remember) by the door. Doors are easy to work if you havent turned hand gestures off. But I will give you the sequence anyway. Dont do it too fast; RAS-R, LAS-L, RAS-R, LAS-L, RAS-R, LAS-L. Rotate RAS C, then pull both RAS & LAS down, then down again.From now on keep an eye out for Ammo. Walk up to the first platform and press X to jump up and grab on. Press X again to climb up on top. Jump from platform to platform until you get across. Walk over to the sparkle and press X. Rotate RAS CC.A2 Before you climb the wall in the next stage, walk along the ground to a crate. Smash the crate. Inside will be A2.Jump up to a ledge where a brick falls down when you pass it. Jump up again. Then again. Climb along the ledge right using the LAS until you stop. Drop down to a lower ledge by pressing T. Climb right until you stop. Jump up. Climb right until you stop. Drop down. Walk through the door by the ammo box to get to the next RP.RP - Melee Training - Now you will have to fight some more enemies, but this time you have guns. TIP: When a soldier is on the wooden platform, toss a grenade at him to blow up him *and* the platform. Grappling Training Now follow the instructions to learn how to grab and throw your enemies. TIP: After grabbing an enemy, point the LAS toward the nearest edge and press O. This will throw the enemy off the edge. When you are done, walk over to the iron door. Take your pistols and lock-on to the chain. POW! Walk through the door to the next RP.RP - Jump up and grab the ledge. TIP: Before you do so, climb down the ladder and grab the ammo. There is two packages.\nAfter grabbing the ledge, crawl right until you cannot go any further. You will now have to jump this gap. To do so, hold down the LAS in the direction you want to jump and press X. Crawl around the corner until you stop. Drop down. Jump right across this gap. Crawl right until you stop. Jump up. Now you must get to the ledge behind you. To do so, hold down on the LAS and press X. Now crawl right until you stop. Wait for the blade to pass by beneath you, then drop down. When the arrows have finished hitting the ledge beneath you, drop down again. Wait for the blade beneath you to pass by, then drop down again before the arrows hit you. Crawl right until you stop. Jump to the ledge behind you after the blade passes by. Jump up twice, Wait for the blade behind you to pass by and the arrows to finish flying, then jump to that ledge. Jump up quickly, then up again. Crawl right until you stop. Wait for the tiny blades to your right to finish flying. Jump to the ledge to your right. Drop down. Walk to the sparkle and press X. Rotate RAS C, then proceed to the next RP.Jump to the gap nearby. Drop down. Wait for the arrows to stop flying beneath you, then drop down again. Wait for the blade to pass by beneath you, then drop down again quickly. With for the tiny blades to the right of you to stop flying , and the blade on your right to pass, then jump across the gap on your right. Wait for the blade above you to pass, then jump up. Crawl right, then jump up again. Crawl right.A3 As you crawl right, you will see it above you. When you are directly beneath it, press X to climb up and get it.Walk out of the area where A2 is and let yourself drop to the ground. Walk to the right toward the tile pattern on the floor.RP You must now fight some more enemies. Watch out for the ones on the upper ledge; they will be throwing knives at you! Blast them to prevent them from killing you. When all enemies are dead, walk over to the sparkle and press X. Rotate the RAS C, then enter to proceed to the next RP.RP Straight ahead of the camera is a ledge; jump and grab it. Wait for the blade to your right to pass by, and wait for the tiny blades to stop flying, then crawl right until you stop. Wait for the blade beneath you to pass by, then drop down. Drop down again. Walk over to the scaffolding, and jump up and grab on, then climb up. Press X. Pull the RAS down three times, with a small pause in between each time. A timer will start. To the right of the scaffolding is a ledge. Proceed to it and jump up and grab on. Jump up again. Beware of flying arrows! Jump across the gap to you right. Crawl right until you stop drop down. Proceed through the doorway to the next RP.RP Around the emperors chariots are four levers. Get to all and pull them Pull the RAS down to do so. The whole floor will rise to the next level, and then enemies will attack you. After killing enemies, go pull the lever.(only one this time).A4 On this level, before you pull the lever next to the professor, the fourth artifact will be found. In a crate in a corner.RP Get to the wall opposite the man by the lever. Grab the ledge, then crawl left until you stop. Jump left across the gap, then continue left until you stop. Jump up, then move left until you stop. Drop down, then move left until you stop. Drop down, then move left until you stop. Jump up, then move left until you stop. Jump up, then move left.RP A timer will start. Travel back to the elevator the same way you came, only this time keep an eye out for blades and arrows and other hazards! Walk over to the remaining lever and pull.RP - Enemies will attack you. Finish them!Act II Shanghai Museum\nNow you play as Rick OConnell. Follow the hallway until you come to a door. Press X. Pull the LAS & RAS down to open it.A1 Now is a good time to retrieve A1. It is in the hallway you just came from. It is super easy to sea if you walk back down the hallway, traveling in the opposite direction from the way you came from.RP - Defeat the enemies. Walk over to the chain and lock on. POW! Hop up on the crate that falls down, and grab the ledge. Jump up again. Crawl right until you stop. Jump right across the gap, then crawl right until you stop. Jump up, then crawl right until you stop. Climb up out the window. Defeat the enemies as quickly as possible. TIP: Be sure to shoot the guy shooting you from the ledge. If not, they will continue to bombard you with bullets and grenades. After enemies are dead, walk over to the sparkle. Shoot the two chains. Press X, then pull both the LAS & RAS up. Jump off the ledge inside. Defeat the enemies. Walk over to the sparkle by the sparkle by the control panel and press X.A2 Pull the RAS to the right once, and only once! Walk over to the crossbow and jump up on the platform at the base of the crossbow. Jump up to grab on to the back end of the crossbow. Crawl right , and then hop up on the ledge where you can plainly see the artifact.Walk over to the control and press X again. Pull the RAS right once. Walk back over to the base of the crossbow where the sparkle is and press X. Pull both the LAS & RAS down, up, down, up, down, up, down. POW! Walk back over to the control panel and press X again. Pull the RAS right. Walk back over to the crossbow and jump up and grab on. Crawl right until you stop. Jump across the gap to your right. Do so again. Crawl right until you stop. Climb up through the window to the hallway. Proceed up the hallway to the next RP.RP Walk up the stairs to the door and press X. Pull the LAS & RAS down. Kill enemies. Jump up and grab onto the scaffolding supporting the dinosaur. Jump up again. Climb up onto the platform. Grab onto the hanging dinosaurs leg. The dinosaur will fly out the window with you holding on. Kill the enemies outside. Walk over to the crank and press X. Rotate the RAS C. Hop up on the box in front of you. Grab onto the ledge above the box. Climb up on top. To the right will be a drainpipe. Grab on to it. Crawl right until you stop. Jump to the drainpipe behind you. Climb right until you stop. Drop down onto the platform. Jump from the platform over the fence to the next RP.RP This part is tough, *if* you do not do things in the right order. First, do not grab the ammo right away! Pull out your weapon (I recommend the machine gun), then walk around the corner. Quickly lock on to the guy at the top of the hill, and shoot him. Then hide behind the corner again and wait for the big group of barrels to roll by. You may now grab the ammo, and walk up the hill, dodging the individual barrels as they roll down. This is easy. At the top of the hill is the next RP.RP Kill the enemies, then blast the lock attached to the ladder. Climb up the ladder. Walk to the left along the scaffolding, then shoot the enemies in the windows (I suggest the shotgun). Jump across to the scaffolding in front of you, then blast the lock. A plank will fall down. Walk across the plank. Walk across it, then climb up the ladder and blast these enemies. Shoot the lock. A plank will fall down. Walk to the sparkle. Press X, then push the LAS & RAS up. Kill enemies. Open the next window using the same process as before.RP Jump off ledge, then walk down alley until you reach the enemies.A3 While killing enemies, in a corner behind some barrels/boxes is A3.After enemies are dead, blast the lock on the gate. Proceed. A turret gunner will start shooting you, kill him quickly with your machine gun. Kill the rest of the enemies, then blast the lock on the gate.A4 *Before* walking up the stairs, turn left. In the far left corner is A4.Proceed up the stairs to the turret.RP Mow down the enemies with the turret.RP Fight enemies, be wary of grenade thrower! Blast the lock on gate, then proceed down the stairs. Walk to the sparkle and press X. Pull RAS down. Walk back up the stairs, and walk to the *other* sparkle. Press X, then pull RAS down. Climb up ladder, then climb up next ladder. Walk along balcony until you come to the edge. Jump off and grab the rope.RP Kill enemies, then proceed to gate."}