{"mid": "TheMolePeople", "IMDB_id": "tt0049516", "title": "The Mole People", "plot": "The film opens with a brief lecture by Frank Baxter. He is a Professor of English at the University of Southern California. He explains that there are just a few areas left on Earth that are unknown and briefly describes a few theories that postulate there may be places deep under the surface of the Earth where man can survive.In Asia an archeological dig has discovered something. Dr. Roger Bentley (John Agar) and Prof. Etienne Lafarge (Nestor Paiva) expose a stone tablet. They take it back to their tent to clean and examine it. We are introduced to Dr. Jud Bellamin (Hugh Beaumont) and Dr. Paul Stuart (Phil Chambers) who ask Bentley to translate the find: it may be related to the story of Gilgamesh and Ishtar. An earthquake rattles the area and the tablet is broken. This puts their work a month behind schedule. A small boy discovers something the earthquake brought down a mountain and brings it to Bentley. He cleans it and it is revealed to be an ancient oil lamp. The inscription is translated as a pre-biblical Noah's Ark story. The party of scientists set off for the mountain where the artifact originated before it was dislodged by the earthquake.They set up base camp and plan their final assault on the mountain the next day. A storm hits the base camp that evening. As they set off the next morning an avalanche brings down an arm from a statue. They continue climbing and discover the ruins of an ancient Sumarian civilization on a small plateau. They estimate the ruins are 5,000 years old. While Dr. Stuart walks around the ruins he falls down through an opening. The rest of the party goes down on ropes to save him. Bentley leads the way, followed by Lafarge, who is much older than the rest. Bellamin is third down the opening followed by Nazar (Rodd Redwing). After dropping down about 200 feet Bentley finds Stuart, but he died in the fall. Nazar notices a loose piton and hammers it secure, but that triggers a rockfall and he is killed and the three archeologists are trapped.They start searching for a way out, but Lafarge is experiencing breathing problems. He is also claustrophobic, They wander through the cave and discover a light source, which reveals a large underground city. They notice a very large tablet that informs them they have discovered the temple of Ishtar. They bed down for the night, but a lizard creature (a mole person?) digs up to the surface to spy on the three. A short time later, the party is attacked, sacks are placed over their heads, and they are pulled underground. They awake in a cave and Lafarge has claw marks on his chest. Two very pale white representative of the human underground civilization suddenly appear and direct they follow them. The scientists are escorted back to the city and presented to the High Priest, Ilinu (Alan Napier) who is performing a ritual. Ilinu immediately suspects the strangers and tells the king that they are evil. The king questions the three archeologists. At the conclusion of the questioning the high priest sentences them to death.The three escape into a cave, with guards in hot pursuit. Bentley shines his flashlight in the face of the First Officer (Robin Hughes) who cringes and retreats. It seems the light hurts their eyes. The three return to the city and shine their flashlight on the King and High Priest and they also retreat. The inhabitants of the city are albino, adapted to a world without sunlight. A lizard creature pulls the body of one of the guards underground. Seeing this, Lafarge panics and runs back into one of the caves. Bentley and Bellamin follow and discover a slave labor camp where the lizard creatures are forced to cultivate the food source--mushrooms. The guards whip their charges, which particularly incenses Bentley. Laforge is attacked and killed by a lizard creature, but is driven off by the flashlight before he can eat Laforge.Bentley and Bellamin return to the city and are met by the high priest along the way who tells them that they are welcome back to the city since they \"possess the divine fire of Ishtar\". The King is convinced they are holy messengers and are invited to a feast. One of the servers, Adad (Cynthia Patrick) drops her bowl of mushrooms, and is ordered whipped by the king. Bentley stops the punishment and is told not to interfere by the High Priest. Bentley helps her to her feet and notices she is not albino, but normally pigmented. The King presents Adad as a gift to Bentley. The High Priest explains that she is not human (like them) but a \"marked one\". The King and Priest further explain that when the population gets too large the excess are sacrificed in the fire of Ishtar.Bentley and Adad talk about their respective worlds as the High Priest spies on them. The next day Bentley and Bellamin tour the city. Meanwhile the High Priest meets with his fellow priests and plots to get the flashlight. This will show the king that the strangers are not divine, but mere mortals.Bentley and Bellamin intercede when three lizard creatures are being beaten, but their flashlight batteries begin to fail. They free the lizard creatures. Food production has been reduced because the lizard creatures are rebelling against their mistreatment. The High Priest schedules another sacrifice. After a ritual dance three women are escorted into a brightly lit chamber, enter, and are locked in. When they open the chamber later, the charred remains are carried out on stretchers. The High Priest is shown the dead body of Laforge. The High Priest was told by Bentley that Laforge was called back to Ishtar, reinforcing the story of his divinity. The High Priest shows the body to the king and explains that he is mortal and asks the King for permission to kill Bentley and Bellamin. The King agrees. Bentley and Bellamin are drugged and arrested. Elinu takes possession of the flashlight. Adad escapes and is captured by the lizard creatures. Bentley and Bellamin are taken to the lighted sacrifice chamber and locked in. The lizard creatures attack the city in force and kill the inhabitants, including the King and High Priest.The lizard creatures break open the sacrifice chamber, but the light repels them. Adad isn't afraid of the light and joins Bentley and Bellamin on their ascent back to their world. They reach the top and get into warmer clothes. Another earthquake strikes the area, and Adad is killed when a stone pillar crushes her. The underground city is buried."}