{"mid": "TheMagicRoundabout", "IMDB_id": "tt0339334", "title": "The Magic Roundabout", "plot": "The film begins as the wizard Zebedee, a red jack-in-the-box-like creature, is having a nightmare about being chased by a rampaging blue jack-in-the-box creature.\nThe film then starts with Dougal sneaking around the carousel. He goes so far as to place a tack in the road to pop a sweet cart's tyre, thinking to be rewarded for watching the cart. After convincing the driver, Mr. Grimsdale to leave, Dougal accidentally starts the cart up again and causes it to crash into the titular magic roundabout at the centre of the village. A blue jack-in-the-box creature named Zeebad (the same one from Zebedee's nightmare) emerges from the top and flies away, followed shortly after by a Foot Guard figurine that is thrown off the roundabout. The roundabout freezes over, trapping repairman Mr. Rusty, Dougal's young owner Florence, and two other children named Basil and Coral within an icy cell.\nThe villagers, who are all animals, are horrified by this development, and call upon Zebedee for help. He explains that the roundabout acted as a mystical prison for the evil ice wizard Zeebad. With it broken, Zeebad is free to work his magic on the world again (it is implied he started the first ice age). The only way to stop Zeebad's freedom from freezing the world again is by collecting three magic diamonds (one of which is supposed to be hidden on the roundabout, while the other two are hidden at separate locations far beyond the village); placing all three diamonds in their respective slots on the roundabout will re-imprison Zeebad and undo his magic, but if Zeebad retrieves them first then their power will allow him to freeze the Sun itself. Zebedee sends Dougal the well-meaning cheeky chappy but slacker dog, Brian the cynical snail, Ermintrude the opera-singing cow and Dylan the hippie rabbit, to accomplish this mission along with a magic train who can be summoned by a magic remote. Meanwhile, when Zeebad crash lands after escaping the roundabout, he animates the Foot Guard figurine, Sam the Soldier, to be his henchman and enlists him to find the enchanted diamonds first. Meanwhile, Zebedee's fellowship makes camp in the icy mountains near Zeebad's old lair. Dougal wanders off during the night and is captured by Zeebad. Ermintrude breaks him out of his prison; after a short chase, Zebedee shows up to battle his evil counterpart. Zeebad eventually gains the upper hand, freezing Zebedee and collapsing the cliff on which he stands, presumably killing him.\nMourning for their friend, Dougal and his friends embark to recover the diamonds. This task takes them to a lava-bordered volcano and an ancient temple filled with booby-traps and evil skeleton guards (at which point Dylan reveals an exceptional knowledge of several types of martial arts), but Zeebad captures both the diamonds from these respective locations; leaving the gang's only hope of stopping Zeebad freezing the world in ice to be getting back to the roundabout and to the final diamond before Zeebad does. The gang are forced along the way to leave Train behind when his wheel is broken, leaving them to return to the village on their own through the snowy barren wasteland the world is now freezing into. Zeebad, after having abandoned Sam the Soldier to die wounded in the snow, beats the gang to the now-frozen village, but is unable to find the third diamond anywhere. Sam then arrives on a moose, having realised he's been following the wrong commander in Zeebad and that his true duty is to protect the roundabout against Zeebad, and tries to make a stand and charge against Zeebad but is easily defeated. Having learned Sam was in fact on the roundabout, Zeebad discovers that the third diamond is and always was hidden inside Sam, and removes it from him (ending Sam's life as a result).\nJust as Dougal and the gang finally make it back to the village, Zeebad, with all three diamonds now in his possession, uses the diamonds to complete his powers' freezing effect on the world by freezing the Sun. However, Ermintrude, Brian, Dylan, and finally Dougal refuse to give up, and intervene to stop Zeebad; getting past Zeebad's attacks to the diamonds, and getting each of them one-by-one into their places on the roundabout until only the third diamond is left. Though Zeebad beats the gang to the diamond and seemingly secures his victory, the timely arrival of a healed Train knocks the diamond out of Zeebad's reach and gives Dougal the chance to place it in the roundabout's final slot. With all three diamonds placed on the roundabout, Zeebad is reimprisoned, and the world is thawed and turned back to normal; restoring Zebedee to his friends, and freeing the people.\nOf those trapped in the roundabout, Florence is comatose, but is revived by an anxious Dougal. The moose (whose colour had been changed from brown to blue by Zeebad and helped Dougal's friends find Dougal in the earlier scenes of the film), is restored to his true colour by Zebedee. As everyone goes for a ride on the roundabout, they discover it still doesn't work, because Sam is still lifeless. At this point, Sam is restored and then reverted to his inanimate form, and placed back on the roundabout which functions once again. Dougal, who vowed to give up sugar when it seemed all was lost, forgets his former pledge completely, but now realises the true value of his friends and the good qualities of selflessness, courage, and humility.\nTwo mid-credits scenes follow: one reveals Zeebad back in his prison, which, to his chagrin, is a molten lava cave. In another, Zebedee delivers his famous catchphrase to the audience, \"Time for bed\", before disappearing."}