{"mid": "TheMoreTheMerrier", "IMDB_id": "tt0036172", "title": "The More the Merrier", "plot": "Retired millionaire Benjamin Dingle (Charles Coburn) arrives in Washington, D.C. as an adviser on the housing shortage and finds that his hotel suite will not be available for two days. He sees an ad for a roommate and talks the reluctant young woman, Connie Milligan (Jean Arthur), into letting him sublet half of her apartment. Then Dingle runs into Sergeant Joe Carter (Joel McCrea), who has no place to stay while he waits to be shipped overseas. Dingle generously rents him half of his half.\nWhen Connie finds out about the new arrangement, she orders them both to leave, but she is forced to relent because she has already spent the men's rent. Joe and Connie are attracted to each other, though she is engaged to bureaucrat Charles J. Pendergast (Richard Gaines). Connie's mother married for love, not security, and Connie is determined not to repeat her mistake. Dingle happens to meet Pendergast at a business luncheon and does not like what he sees. He decides that Joe would be a better match for his landlady.\nOne day, Dingle goes too far, reading aloud to Joe from Connie's private diary, including her thoughts about Joe. When she finds out, she demands they both leave the next day. Dingle takes full blame for the incident. Connie allows Joe to remain in the apartment as he has only a few days before being shipped out to Africa. Joe asks Connie to go out with him. She is reluctant to do so, but decides to go if Pendergast does not call for her by 8. At 8, she and Joe are ready to leave, but her noisy teenage neighbor seeks her advice and delays her until Pendergast arrives. Joe spies on the two of them from the window. When the neighbor asks what he is doing, Joe flippantly tells him he is a Japanese spy.\nDingle calls Joe to meet him for dinner. Dingle bumps into the couple and pretends he is meeting Connie for the first time, forcing Joe to do the same. Dingle engages Pendergast in talk about his work, eventually maneuvering him up to his room so that Connie and Joe can be alone together.\nJoe takes Connie home. The two talk about their romantic pasts and even kiss. From their separate rooms, Joe confesses that he loves her. She tells him she feels the same way, but refuses to marry him, as they will soon be forced apart. Their talk is interrupted by the arrival of the FBI, who have been called to investigate Joe for spying, thanks to the neighbor. Joe and Connie are taken to headquarters. They identify Dingle as a fellow occupant who can testify that they are only roommates. Dingle arrives, bringing Pendergast as a character witness. It comes out during questioning that Joe and Connie live at the same address. When they ask Mr. Dingle to tell Pendergast that their living arrangement is purely innocent, he denies knowing them.\nOutside the station, Dingle admits he lied to protect his reputation. Taking a taxi home, they discuss what to do to avoid a scandal. Connie grows angry when Pendergast thinks only of himself. When another passenger in the shared cab turns out to be a reporter, Pendergast runs after him to try to stop him from writing about their situation. Dingle assures Connie that if she marries Joe, the crisis will be averted, and they can get a quick annulment afterwards. The couple follow his advice and wed. Returning home, Connie allows Joe to spend his final night in her apartment. As Dingle had foreseen, Connie's attraction to Joe overcomes her prudence. Outside, Dingle puts up a card, showing that the apartment belongs to Mr. and Mrs. Sgt. Carter."}