{"mid": "TheMagicRiddle", "IMDB_id": "tt0102371", "title": "The Magic Riddle", "plot": "Cindy, short for Cinderella, lives with her widowed stepmother and two stepsisters, Bertha and Ertha. Cindy is forced to do all of the housework and is effectively a servant. The widow hates Cindy because when her late Grandfather died, he hid his will which the widow knows passes all the family inheritance to Cindy. The widow purposely keeps Cindy busy so that she won't find the will, giving the widow time to find it first. The widow is also planning to marry her favorite daughter, Bertha, to a handsome young man named Phillipe, though he is smitten with Cindy.\nOne night, Cindy falls asleep before finishing her chores, but an old lady sneaks into the house to finish the chores for her. Ertha, Cindy's kinder stepsister, encounters the old lady, who reveals that she is Cindy's Grandmother, and was kicked out of the house by the widow after Grandfather died. The same thing happens the following night, but the widow wakes up and chases Grandmother away. Ertha, who witnessed everything, tells Cindy about it.\nThe widow is afraid that Grandmother will help Cindy find the will. Following the advice of her magic mirror, the widow puts on a salesman disguise and visits Grandmother in the woods, tricking her into entering The Castle of a Hundred Doors, from which there is no escape. Cindy, dressed in a red riding hood, arrives at Grandmother's cottage too late and is chased away by a \"wolf\", which is actually the widow in disguise.\nCindy sits by a lake, telling her hopes to an ugly duckling, unaware that Phillippe is listening. Phillippe reveals himself and gives her a ring as a token, but their meeting is interrupted by the widow, who orders Cindy to work. While in the barn, Cindy discovers the widow's wolf costume and realizes what happened. Bertha, who is jealous of Cindy, chases the pigs away from the farm and blames Cindy for it. Ertha advises Cindy to escape to Grandmother's cottage, which she does. There Cindy discovers seven wooden dwarfs and one wooden puppet Pinocchio. They come alive when she kisses them, and they tell her that widow took Grandmother away.\nThe widow wants Cindy back at the house working for her. She discovers Cindy's music box and decides to lure her back by holding a masked ball. Cindy wants to go, as it is a chance to see Phillippe. The dwarfs make her a costume, but warn her that since her mask is made of snow it will melt at midnight. At the ball, Cindy's disguise works and she gets to dance with Phillippe. Meanwhile, Ertha and Pinocchio dance together. When the clock strikes twelve, Cindy's disguise melts and she runs away to escape the widow, her friends following close behind.\nWhen the widow mocks Ertha for falling for Pinocchio, Ertha retaliates by telling Phillippe that Cindy can be found at Grandmother's house. He heads out to find her, but finds the Castle of a Hundred Doors instead. The dwarfs also find the Castle, but they too get lost inside and unable to escape.\nThe widow goes to the cottage wearing another disguise devised by her magic mirror, this time pretending to be Pinocchio's mother. The widow hypnotises Cindy with a magic apple to fall asleep, and in the commotion the widow accidentally falls into a well. Pinocchio, now alone, searches for help and stumbles upon the Castle. When he enters, one of his shoes is caught on a nail and starts to unravel. Eventually Grandmother is found, and everyone groups up and follows the trail out.\nWhen they arrive back at the cottage, Cindy is woken up by a kiss from Phillippe. Grandmother explains to Cindy about the will, and that the answer is in his Magic Riddle, a poem which ends with: \"Only Pinocchio knows\". It turns out that the will is inside Pinocchio's nose. Grandmother reads the will, confirming that all of Grandfather's possessions go to Cindy. Cindy and Phillippe's wedding is held at what used to be the widow's house. After the celebrations, the dwarfs and Pinocchio turn back into wood, their task completed. But when Ertha kisses Pinocchio, he comes back to life to be with her."}