{"mid": "TheMadnessOfKingGeorge", "IMDB_id": "tt0110428", "title": "The Madness of King George", "plot": "The film depicts the ordeal of King George III whose bout of madness in 1788 touched off the Regency Crisis, triggering a power struggle between factions of parliament under the conservative William Pitt the Younger and the reform-minded Charles James Fox.\nAt first, the King's habits appear mildly eccentric, and are purposely ignored for reasons of state. The King is seen as being highly concerned with the wellbeing and productivity of England, and continually exhibits an encyclopedic knowledge of the families of even the most obscure royal appointments. In fact, the King is growing more unsettled, largely over the loss of America. George, his oldest son, aggravates the situation, knowing that he would be named regent in the event the King was found incapacitated. George chafes under his father's repeated criticism, but also hopes for regency to allow him greater freedom to marry his Catholic mistress. George also knows that he has the moral support of Charles Fox, who is eager to put across an agenda unlikely to pass under the current administration, including abolition of the slave trade and friendlier relations with America. Knowing that the King’s behavior is exacerbated in public, the Prince arranges for a concert playing the music of Handel. The King reacts as expected, interrupting the musicians, acting inappropriately towards Lady Pembroke, attendant to the Queen, and finally assaulting his son.\nThe King's madness is treated using the relatively primitive medical practices of the time, which include blistering and purges, led on particularly by the Prince of Wales' personal physician, Dr. Warren. Eventually, Lady Pembroke recommends Dr Willis, an ex-minister who attempts to cure the insane through new procedures, and who begins his restoration of the King's mental state by enforcing a strict regime of strapping the King into a waistcoat and restraining him whenever he shows signs of his insanity or otherwise resists recovery.\nMeanwhile, the opposition led by Charles James Fox, confronts Prime Minister William Pitt the Younger's increasingly unpopular government with a bill that would give the Prince powers of regency. Meanwhile, Baron Thurlow, the Chancellor, discovers that the Prince was secretly and illegally married to his Catholic mistress. Thurlow pays the minister to keep his mouth shut, and himself tears out a record of the marriage from church rolls.\nThe King soon shows signs of recovery, becoming less eccentric and arrives in Parliament in time to thwart passage of the Regency bill. Restored, the King asserts control over his family, forcing the Prince to “put away” his mistress. With the crisis averted, those who had been closest to the king are summarily dismissed from service, including Dr Willis. During conversations with Pitt, the King appears more at ease and in control of himself. He is less antagonized by America, but also shows signs that his insanity remains."}