{"mid": "TheMadMagician", "IMDB_id": "tt0047200", "title": "The Mad Magician", "plot": "Don Gallico (Vincent Price) is a magician, master of disguise, and inventor of stage-magic effects in the late 1800s aspiring to become a star magician under the stage name Gallico the Great. Disguised as The Great Rinaldi, a headlining rival magician, Mr. Gallico performs a number of magic tricks successfully, building up to the reveal of his latest invention, the buzz-saw, an illusion that \"severs\" the head of the magician's assistant Karen Lee (Mary Murphy). Before Mr. Gallico can perform the buzz-saw illusion, the curtains come down to stop the performance. Businessman Ross Ormond (Donald Randolph) and his lawyer serve Mr. Gallico a cease and desist order against the performance of the buzz-saw trick much to the anger of Mr. Gallico. Ms. Lee's boyfriend, police detective Lt. Alan Bruce (Patrick O'Neal), is asked by her to intervene in the dispute between Mr. Gallico and Mr. Ormond. Mr. Gallico informs the detective that he signed a contract to Mr. Ormond's Illusions, Inc., a magician's trick provider, to invent new tricks, the issue is that Mr. Ormond owns all work created by Mr. Ormond, not just the ones produced for Illusions, Inc., Mr. Gallico's understanding.\nThe next day at Mr. Gallico's work area within the Illusions, Inc. warehouse, detective Mr. Bruce reviews Mr. Gallico's contract and explains that the contract is as Mr. Ormond states, anything the Mr. Gallico should invent is the property of Illusions, Inc. As the detective is leaving, Mr. Ormond and the real The Great Rinaldi (John Emery) arrive, before departing he asks Mr. Gallico to tell his girlfriend where and when to meet for dinner. Mr. Ormond and The Great Rinaldi are shown the buzz-saw illusion's inner workings and ruminate on the performance of the trick by The Great Rinaldi and not by Mr. Gallico, angering the trick's inventor. The Great Rinaldi departs leaving Mr. Ormond and Mr. Gallico to discuss their business arrangement; Mr. Ormond dismisses Mr. Gallico's anger by explaining that Mr. Gallico was presented the opportunity to invent under the contract and that Mr. Ormond's wooing of Mr. Gallico's wife Claire (Eva Gabor) was due to her rich needs and Mr. Ormond's ability to provision them, something that Mr. Gallico was never able to do. Incensed, Mr. Gallico attacks Mr. Ormond and forces the businessman into the buzz-saw on functional mode (non-illusion) and decapitates him.\nHis crime is almost revealed when Mr. Ormond's severed head is mistakenly taken for a trip with Gallico's assistant Ms. Lee and Mr. Bruce.\nGallico then impersonates Ormond to rent an apartment from Alice Prentiss (Lenita Lane), an author of mystery novels. Gallico disposes of Ormond's body, but is again forced to murder when his ex-wife Claire discovers the impersonation. Prentiss comes forth as a witness to the crime, but identifies Ormond as Claire's murderer. The Great Rinaldi again schemes to steal a trick of Gallico's, an illusion involving a crematorium, and ultimately winds up burned to death in the process. Gallico begins impersonating Rinaldi to take over that magician's show.\nMeanwhile, Alan Bruce matches the fingerprints of Ormond with those of Rinaldi—since both sets of prints are actually Gallico's, and the novelist Prentiss realizes her boarder, and the murderer, was Gallico and not Ormond. The two, along with the assistant Karen, band together for an ultimate confrontation with Gallico."}