{"mid": "TheManWithOneRedShoe", "IMDB_id": "tt0089543", "title": "The Man with One Red Shoe", "plot": "An agent of the United States Central Intelligence Agency (CIA) is arrested in Morocco on drug-smuggling charges. The person behind the smuggling operation is CIA deputy director Burton Cooper, who hopes the resulting scandal will lead to the resignation of CIA Director Ross, and Cooper's promotion to Director. Although Ross is aware of Cooper's complicity, but when questioned by a special Senate committee about the arrest, Ross tells the committee that he has not reviewed all of the facts of the case. The committee orders a full inquiry, and gives Ross 48 hours to present with the proper answers.\nRoss devises a plan for Cooper's downfall. Ross knows his house has been bugged for sound by Cooper, so he purposely leaks a rumor that a man will be arriving at the airport who will clear him of the scandal, and orders his assistant to pick him up. Cooper, desperate to find out who the mystery man is, sends his own agents to follow Ross's lackey, Brown. Brown goes to the airport with instructions to pick someone at random from the crowd, leading Cooper and his team on a wild goose chase.\nBrown spots a man wearing mismatched shoes descending an escalator and picks him as their random target. The man is violinist/concertmaster Richard Drew, whose percussionist friend Morris played a trick on him by hiding one of each pair of his shoes. This has forced Richard to wear one business shoe and one red sneaker on his flight home. Cooper takes the bait and starts tracking Richard, who proves to be carrying on his own intrigues.\nRichard is completely oblivious to the intelligence operations centered on him, consumed by his own personal problems. He has been having an affair with Morris' flutist wife Paula, who plays in the same symphony orchestra with Richard and Morris. The affair was brought on by Morris' immaturity and his obsession with playing practical jokes on people, Richard being one of them. After eluding them at the airport, Richard is bumped into by Maddy, one of Cooper's operatives, who steals his wallet.\nAfter damaging his tooth with a bag of gag peanuts given to him by Morris, Richard heads home to prepare for a visit to the dentist. While talking on the phone with Morris, Cooper, who has tapped his phone, learns that they are to meet with the Senators. Cooper thinks it is an inquiry with the Senate, but it turns out to be the name of the orchestral softball team for which Richard and Morris play.\nWhile Richard heads to the dentist, Cooper sends his agents out to continue their surveillance, first by having Maddy lead a team to search his apartment for any information and bug it for sound, and then by having other agents intercept him at his dentist's office, believing his tooth has microfilm inside.\nThey learn Richard has traveled the world, including several Communist countries. Cooper thinks this is the perfect cover for a spy, and starts digging deeper. Soon, they suspect his sheet music is actually a code, and steal time on Defense Department computers to decipher it. Hoping to learn more, he sends in Maddy to seduce Richard and find out what he knows. While Richard is playing a violin composition he wrote for her, Maddy actually falls for him. Meanwhile, Morris catches glimpses of the operations of Cooper's agents, leading him to believe he may be going mad.\nRoss, meanwhile, simply sits back and watches the antics unfold. Brown is concerned that Richard, the innocent man that he selected at random, may end up being killed as a result of Ross's plan to draw out Cooper, but Ross is only concerned about his career, and dismisses Brown's guilty conscience. When one attempt after another fails to yield any usable information, Cooper orders Richard killed, and eventually attempts to kill Richard himself. Richard remains completely oblivious to the plot until Maddy decides to thwart Cooper, and testifies in front of the Senate about the plot. Cooper is arrested, while Ross is demoted and replaced by Brown as Director of the CIA. Morris is committed to a mental institution, and Paula severs her romantic interest in Richard, believing that Morris needs her. Maddy agrees to testify against Cooper in exchange for her freedom, after which she is reunited with Richard."}