{"mid": "TheManWhoKnewTooMuch", "IMDB_id": "tt0049470", "title": "The Man Who Knew Too Much", "plot": "Bob and Jill Lawrence (Leslie Banks and Edna Best) are a British couple on a trip to Switzerland, travelling with their daughter Betty (Nova Pilbeam). Jill is participating in a clay pigeon shooting contest. She is the best shot but she loses first place to a male sharpshooter because, at the crucial moment, she was distracted by the noise of a chiming watch which belongs to Abbott (Peter Lorre).\nBob and Jill have befriended Frenchman Louis Bernard (Pierre Fresnay) who is staying in their hotel. One evening, Louis is fatally shot as Jill dances with him. Before he expires, Louis tells Bob where to find a note to be delivered to the British consul. Bob reads the note, which contains vital indications about a planned international crime.\nThe criminals kidnap the couple's daughter Betty and threaten that she will be killed if her parents tell anyone what they know. Unable to seek help from the police, the couple return to England. They follow a series of leads and discover that the group, led by Abbott, intends to assassinate the head of state of an unidentified European country during a concert at the Royal Albert Hall. The group has hired the winner of the Swiss clay-pigeon contest as gunman for the assassination, who has excellent sharpshooting skills. Jill attends the concert and distracts the gunman's aim with a scream at the crucial moment.\nThe criminals return to their lair, which is the temple of a sun-worshipping cult in a working-class area of Wapping in London, near the docks. Bob had entered the temple as he was searching for Betty, and is being held prisoner in the adjoining house. Betty is also imprisoned there in another room. The police surround the buildings and a major gunfight ensues; the police are issued with rifles. The criminals hold out until their ammunition runs low and nearly all of them have been killed.\nBetty climbs up to the roof, fleeing from the gunman who follows her. A police marksman dares not try to shoot him, as he is standing so close to Betty. Jill grabs the rifle and her sharpshooting skills finally triumph—she shoots the gunman and he falls off the roof without harming Betty.\nThe police storm the building. Abbott, the criminal mastermind, is still alive and hiding behind a door, but he is betrayed by the chiming of his watch, and is shot and killed by the police.\nA terrified Betty is reunited with her parents."}