{"mid": "TheMirrorHasTwoFaces", "IMDB_id": "tt0117057", "title": "The Mirror Has Two Faces", "plot": "Rose Morgan (Streisand), a shy, plain, middle-aged English literature professor at Columbia University, shares a home with her vain, overbearing mother Hannah (Bacall). When her attractive sister Claire (Rogers) starts making preparations for her third wedding to Alex (Brosnan), who used to date Rose, she begins to feel her loveless life is empty.\nGregory Larkin (Bridges), a Columbia Mathematics teacher, feels sex complicates matters between men and women, since he seems to lose all his rational perspective as soon as he is aroused. After his last girlfriend dumps him after a last one night stand before she gets married, he decides to look for a relationship based on the intellectual rather than the physical, based on a suggestion by a sex-phone service, and places an ad in a newspaper.\nClaire reads the ad and answers on behalf of Rose. Gregory is intrigued when Claire tells him that Rose teaches English literature at Columbia, so he creeps in to Rose's lecture about chaste love in literature, missing entirely the point she was making. After a series of mishaps, they begin dating and he is impressed by her wit and knowledge and seems to be fascinated by her quirks and mannerisms, which usually drive people crazy. She is also fascinated by the dashing math professor and even helps him improve his teaching techniques. He proposes marriage, on condition that it will be largely platonic, with occasional sex only if she needs it. The prospect of spending the rest of her life as a lonely spinster living with her mother seems far worse than a marriage on those conditions, so Rose accepts.\nRose's attraction to Gregory grows, and one night she attempts to seduce him, much to his annoyance. He had hoped that by then she had given up on the idea of sex, though he admits he initially raised its possibility. He abruptly breaks off their attempt at physical intimacy when he finds himself becoming truly aroused and fears that it will change the safe comfortable feelings he has towards Rose.\nWhen Gregory departs on a lengthy lecture tour, Rose embarks on a crash course in self-improvement: she diets, exercises, changes her hairstyle, learns to use makeup, and outfits herself in an updated wardrobe. When her husband returns, he finds a very different woman waiting for him and is too startled to express his feelings. She admits that she made a mistake in accepting their passionless marriage, and leaves him. All the while, Rose realizes that everyone, including herself, is now behaving differently towards her altered self, though not always to her liking. Gregory and Rose realize their mutual love has been hindered, not by Rose's appearance, but by Gregory's unusual theories on marriage and sex, and finally recognize their deep affection."}