{"mid": "TheManFromSnowyRiver", "IMDB_id": "tt0084296", "title": "The Man from Snowy River", "plot": "When Jim Craig and his father Henry are discussing their finances, a herd of wild horses called the Brumby mob passes by, and Henry wants to shoot the black stallion leader, but Jim convinces his father to capture and sell them. The next morning the mob reappears and Henry is accidentally killed. Before Jim can inherit the station, a group of mountain men tell him that he must first earn the right – and to do so he must go to the lowlands and work.\nJim meets an old friend called Spur, a one-legged miner. Jim then gets a job on a station owned by Harrison, Spur's brother, on a recommendation by Harrison's friend. Meanwhile, Clancy appears at Spur's mine and the two discuss their pasts and futures. Clancy goes to Harrison's station to lead a cattle muster. At dinner, Harrison tells Clancy that \"he has no brother\" when referring to Spur.\nHarrison organizes a round-up of his cattle, but Jim is not allowed to go. While the others are gone, Harrison's daughter Jessica asks Jim to help her break in a prize colt. The mob appears again, and Jim unsuccessfully gives chase to the valuable horse. When Harrison returns, he sends Jim to bring back 20 strays. Later, Harrison learns of Jim's actions and tells Jessica that Jim will be fired and that she will be sent to a women's college. Impulsively, she rides off into the mountains where she is caught in a storm.\nSpur, meanwhile, finally strikes a large gold deposit. Jim finds Jessica's horse and rescues her. She tells him that he's going to be fired, but he still leaves to return the cattle. Jessica is surprised at meeting Spur, her uncle, whom she had never been told about. She is also confused when Spur mistakes her for her dead mother and refuses to tell her anything about his past.\nAfter returning, Jessica learns that Spur and Harrison both fell in love with her mother, Matilda. Matilda declared that the first to make his fortune would be her husband. Spur went looking for gold, while Harrison bet his life savings on a horse race. Harrison became rich overnight when the horse he bet on won. Having made his fortune, Harrison wed Matilda, but she died while delivering Jessica. Harrison is grateful to Jim for returning his daughter, but he becomes angry when Jim says he loves her. As Jim leaves, a prized colt is let loose by a farmhand in the hope that Jim will be blamed.\nLater, while camping out, Spur tells Jim that he will inherit his father's share of the mine. Clancy joins them and informs them of the colt, but Jim refuses to retrieve the animal. Meanwhile, Harrison offers a reward of ₤100, attracting riders and fortune-hunters from every station in the area. Clancy does eventually show, accompanied by Jim, whom Harrison finally allows to join the hunt.\nSeveral riders have accidents in pursuit and even Clancy is unable to contain the Brumby mob. The riders give up when the mob descends a seemingly impassable grade. However, Jim goes forward and returns the horses to Harrison's farm. Harrison offers him the reward but he refuses. Having cleared his name, Jim would like to return some day for the horses and, looking at Jessica, \"anything else that's mine.\" He rides back up to the mountain country, knowing that he has earned his right to live there."}