{"mid": "TheMightyDucks", "IMDB_id": "tt0104868", "title": "The Mighty Ducks", "plot": "Gordon Bombay (Emilio Estevez) is a successful Minneapolis defense attorney of the Ducksworth, Saver & Gross firm, who never loses a case but whose truculent courtroom antics have earned him no respect among his peers. After successfully defending a client resulting in his 30th win, Bombay is called into his boss's office to be congratulated, but also chastised for embarrassing the judge. Regardless, he celebrates by going out drinking and is subsequently arrested for drunken driving. Bombay is sentenced to community service by coaching the local \"District 5\" PeeWee hockey team. Bombay has a history with the sport, although his memories are far from pleasant: Years ago, Bombay was the star player on the Hawks. When struggling to cope with the loss of his father, Bombay missed a penalty shot during a championship game, costing his team the title for the first time and disappointing his hyper-competitive coach, Jack Reilly (Lane Smith).\nWhen Bombay meets the team, he realizes the children have no practice facility, equipment or ability to go with it. The team's first game with Bombay at the helm is against the Hawks, the team from the snooty suburb of Edina. Reilly is still head coach and remains bitter about Gordon's shortcoming in the game years earlier (even lamenting that they should take the runner-up banner down from that season despite having a wall full of first place banners from other years). District 5 gets outclassed and pummeled during the game due to Reilly demanding the Hawks run up the score; after the game, Bombay berates the team for not listening to him and the players challenge his authority. For the next game, Bombay tries to teach his team how to dive and get penalties. Meanwhile, Bombay discovers his old mentor and family friend Hans (Joss Ackland) who owns a nearby sporting goods store, was in attendance. While visiting him, Bombay recalls that he quit playing hockey after losing his father four months before the championship game, and due to Reilly solely blaming Gordon for the loss. Hans encourages him to rekindle his childhood passion.\nBombay approaches his boss, the firm's co-founder Gerald Ducksworth (Josef Sommer) to sponsor the team, something Ducksworth reluctantly agrees to do, after being offered his own jersey. The result is a complete makeover for the team, both in look (as they can now buy professional equipment) and in skill (as Bombay has more time to teach the kids hockey fundamentals). Now playing as the Ducks (named for Bombay's boss), they fight to a tie in the next game and recruit three new players: Figure skating siblings Tommy (Danny Tamberelli) and Tammy Duncan (Jane Plank) and slap shot specialist and enforcer Fulton Reed (Elden Henson). The potential of Ducks player Charlie Conway (Joshua Jackson) catches Bombay's eye; he takes him under his wing and teaches him some of the hockey tactics he used when he played with the Hawks.\nBombay learns that, due to redistricting, the star player for the Hawks, Adam Banks (Vincent Larusso), should actually be playing for the Ducks. He then threatens Reilly into transferring Banks to the Ducks. After hearing an out-of-context quote about them, the Ducks players lose faith in Bombay and revert to their old habits.\nDucksworth makes a deal with Reilly about the Hawks keeping Banks; however, Bombay refuses it, since it would be against fair play, which Ducksworth berated him about when he started his community service. Left with either the choice of letting his team down or get fired from his job, Bombay takes the latter.\nBombay manages to win back the trust of his players after they win a crucial match and Adam Banks, who decided he'd rather play for the Ducks than not play hockey at all, proves to be a valuable asset. Because of his well-to-do background, Adam is given the nickname \"Cake Eater\" by his teammates. The name is, at first, seen as derisive, but then becomes a term of endearment. The Ducks manage to make it to the championship against the Hawks. Despite the Hawks' heavy attacks taking Banks out of the game, the Ducks manage to tie the game late and Charlie is tripped by a Hawks player as time expires. In exactly the same situation Bombay was at the beginning of the film, Charlie prepares for a penalty shot to win the championship. In stark contrast to former coach Reilly's attitude (Reilly told Bombay that if he missed, he was letting everyone down), Bombay tells Charlie that he will believe in him no matter what happens. Inspired, Charlie jukes out the goalie with a \"triple-deke\" (taught to him by Bombay) to defeat the Hawks for the state Pee Wee Championship.\nThe Ducks and family race out onto the ice in jubilation, where Bombay thanks Hans for his belief in him and Hans tells Bombay he is proud of him. Later, Bombay boards a bus headed to a minor-league tryout, secured for him by the NHL's Basil McRae of the Minnesota North Stars. Although he seems daunted at the prospect of going up against younger players, he receives the same words of encouragement and advice from the Ducks he had given them, promising he will return next season to defend their title."}