{"mid": "TheMostDangerousGame", "IMDB_id": "tt0023238", "title": "The Most Dangerous Game", "plot": "Sanger Rainsford and his friend, Whitney, are traveling to Rio de Janeiro to hunt the region's big cat: the jaguar. After a discussion about how they are \"the hunters\" instead of \"the hunted\", Whitney goes to bed and Rainsford remains on deck. While Whitney returns to his quarters Rainsford hears gunshots and climbs onto the yacht's rail to get a better view of the nearby Ship-Trap Island, and falls overboard. After he realizes he cannot swim back to the boat, he swims to Ship-Trap, which is notorious for shipwrecks. He finds a palatial chateau inhabited by two Cossacks: the owner, General Zaroff, and his gigantic deaf-mute servant, Ivan.\nZaroff, another big-game hunter, knows of Rainsford from his published account of hunting snow leopards in Tibet. After inviting him to dinner, General Zaroff tells Rainsford he is bored of hunting because it no longer challenges him; he has moved to Ship-Trap in order to capture shipwrecked sailors, whether due to storms or by luring vessels onto the rocks. He sends the sailors into the jungle supplied with food, a knife, and hunting clothes to be his quarry, although he also runs a \"school\" of sorts to prepare sailors for this hunt should they be out of shape or disoriented from being washed ashore. After a three-hour head start, he sets out to hunt and kill them. Any captives who can elude Zaroff, Ivan, and a pack of hunting dogs for three days are set free. Zaroff reveals that no one has lasted that long, although a couple of sailors had come close. Zaroff also says that he offers sailors a \"choice\"; should they decline to be hunted they will be handed over to Ivan, who had once been official knouter for The Great White Czar. Rainsford is against this and denounces it as barbarism. Zaroff reacts in a cosmopolitan manner that \"life is for the strong\". Realizing he has no way out, Rainsford reluctantly agrees to be hunted.\nDuring the three-hour head start, Rainsford begins to lay an intricate trail in the forest and then climbs a tree. Zaroff finds him easily, but decides to play with him like a cat would a mouse, standing underneath the tree Rainsford is hiding in, smoking a cigarette, and then abruptly departing. After the failed attempt of eluding Zaroff, Rainsford builds a Malay man-catcher, a weighted log attached to a trigger. This contraption injures Zaroff's shoulder, causing him to return home for the night, but not before he shouts out that Rainsford laid a good trap that few hunters can make. The next day Rainsford creates a Burmese tiger pit, which kills one of Zaroff's hounds. He sacrifices his knife to make a Ugandan knife trap, however Ivan is killed when he stumbles into this trap and the knife plunges into his heart. To escape Zaroff and his approaching hounds, Rainsford dives off a cliff into the sea; Zaroff, disappointed at Rainsford's suicide, returns home. While enjoying a celebratory dinner, Zaroff is preoccupied with two issues: Ivan would be hard to replace and that Rainsford had evaded his hunt.\nZaroff locks himself in his bedroom and turns on the lights only to find Rainsford waiting for him; he had swum around the island in order to sneak into the chateau without the dogs finding him and killing him. Zaroff congratulates him on winning the \"game\", but Rainsford decides to fight him, saying he is still a beast-at-bay and that the original hunt is not over. Accepting the challenge, Zaroff says that the loser will be fed to the dogs, while the winner will sleep in his bed. Though the ensuing fight is not described, the story ends with Rainsford observing that \"he had never slept in a better bed\" - implying that he defeated and killed Zaroff."}