{"mid": "TheMagnificentAmbersons", "IMDB_id": "tt0035015", "title": "The Magnificent Ambersons", "plot": "The Ambersons are by far the wealthiest family in the small midwestern city of Indianapolis at the beginning of the 20th century. Eugene Morgan is a young man who is courting Isabel Amberson, but she rejects him after he publicly embarasses her. Isabel instead marries Wilbur Minafer, a passionless man she does not love. They have a child, George, whom she spoils and who becomes the terror of the town. The townspeople long to see George get his comeuppance.\nGeorge Minafer returns home from college during the holidays and attends a large party at the Amberson mansion hosted by his grandfather, Major Amberson. Among the guests are Eugene Morgan, now a widower who has just returned to town after a 20 year absence, and his daughter, Lucy. George instantly takes to the beautiful and charming Lucy but intensely dislikes Eugene, whom he sees as a social climber. He also ridicules Eugene's investment in the new \"horseless carriage\" technology (automobiles).\nThe next day, George, Fanny, Isabel, and Isabel's brother, Jack, take a sleigh ride. They pass Eugene and Lucy, whose primitive automobile has gotten stuck in the snow. George derides Eugene and his \"horseless carriage\". The Amberson sleigh then overturns, and Eugene (his vehicle now mobile again) gives everyone a ride back to the Minafer mansion. George is humiliated during the incident and angered by Eugene's attentions toward Isabel as well as his mother's obvious affection for Eugene.\nGeorge returns to college. Wilbur Minafer loses a substantial amount of money on bad investments, and soon afterward dies. George is largely unmoved by his father's death. The night after the funeral, George cruelly teases Fanny, who is besotted with Eugene.\nTime passes, and Eugene becomes very wealthy in automobile manufacturing. Eugene also begins to court Isabel. One summer, he asks Isabel to tell George about their love, but she refuses, unwilling to risk her son's disapproval. Meanwhile, George proposes to Lucy. She rejects him, claiming he has no ambition in life other than to be wealthy and keep things as they are. George blames Eugene for turning Lucy against him. Lucy leaves town soon after, and the Ambersons invite the lonely Eugene to dinner. During the meal, George nastily criticizes automobiles in front of Eugene. The other family members are taken aback by his rudeness, but Eugene says that George may turn out to be right. That evening, George learns from his aunt Fanny that Eugene has been courting Isabel. George's uncle Jack confirms Fanny's revelation. Enraged, George rudely confronts a neighbor for spreading \"gossip\" about his mother. The next day, George refuses to let Eugene see his mother. Jack tells Isabel about George's terrible behavior, but she declines to do anything which might upset her son. Eugene writes to Isabel, asking her to choose between her son and his love. Isabel chooses George.\nLucy returns home in time to discover that George is taking his mother to Europe on an extended trip. George talks to Lucy in an attempt to discover if she loves him. She feigns indifference to his absence, and they part. Lucy is heartbroken, however, and faints.\nMonths pass. Jack Amberson returns from Europe and tells Eugene that Isabel is seriously ill. George, however, will not allow her to come home because he fears she will renew her relationship with Eugene. When Isabel starts to die, George finally relents and he and his mother return to Indianapolis. Eugene tries to see her, but George refuses to let him into the house. Eugene leaves when Fanny tells him that Isabel is on her deathbed. Isabel dies while holding George's hand, begging to see Eugene one last time.\nShortly after Isabel's death, Major Amberson learns he has only a short time to live. George is too self-centered and preoccupied with his own problems, and ignores his grandfather's revelation. Major Amberson dies, and the family learns his estate is worthless and there are numerous large debts. Jack leaves town to take a job in another city. George tells Fanny that he intends to live on her income, but she reveals that she lost everything after making bad investments. With the utilities having been turned off and the Amberson home and all their belongings soon to be sold, George and Fanny discover they have only a few hundred dollars to live on for the rest of the year.\nEugene asks Lucy if she will reconcile with George. Lucy instead tells her father a story about a Native American chieftain who was \"pushed out on a canoe into the sea\" when he became too obnoxious and overbearing, which Eugene understands to be an analogy for George.\nPenniless, George gives up his job as a clerk at Roger Bronson's law firm, and finds entry-level but high-paying employment in a dynamite factory. This gives him enough money to live on and take care of Fanny. George wanders the newly-industrialized city, dazed by the modern society that has grown up around him. In his last night in the Amberson family home, George prays desperately by his dead mother's bed. The narrator says that no one is around to see George Minafer receive his comeuppance.\nThe next day, George is struck by an automobile and seriously injured. In the film's final scenes, Lucy is seen in the hospital at George's bedside, having reconciled with him. Eugene and Fanny walk arm in arm down the hospital corridor, as Eugene says that taking financial care of George and Fanny is what Isabel would have wanted."}