{"mid": "TheMagicSword", "IMDB_id": "tt0056211", "title": "The Magic Sword", "plot": "George (Gary Lockwood) is the foster son of Sybil (Estelle Winwood), an elderly sorceress. She brought him up after his \"royal parents died of the plague\" in his infancy. He has fallen in love at first sight with Princess Helene (Anne Helm).\nShe is kidnapped by the wizard Lodac (Basil Rathbone), who brazenly informs her father that he intends to feed her to his pet dragon in seven days, revenge for the death of his sister at the same age as Helene is now: 18. George wants to go on a quest to liberate his lady love, but Sybil believes he is too young (he is 20). She tries to distract the youth by showing him a magic sword, a steed, an invulnerable suit of armour, and six magically frozen knights he will command when he turns 21. The impatient George, however, tricks Sybil and locks her in a cellar, then leaves with the magical implements and revived company of knights.\nSir George and his party appear before the king and insist on journeying to Lodac's castle to rescue Helene, against the opposition of Sir Branton (Liam Sullivan), a knight who had previously volunteered for the perilous quest. The king promises the rescuer his daughter's hand in marriage and half his kingdom.\nSeven curses bar the path to Lodac's castle. First, they encounter an ogre, who slays Sir Ulrich of Germany and Sir Pedro of Spain. When George tries to save Sir Anthony of Italy from a swamp, Branton treacherously comes up from behind and kicks him in as well. Anthony is killed, but George survives with the help of his magic sword.\nLater, Branton meets secretly with Lodac. It turns out that Branton has Lodac's ring, which the magician lost and wants back desperately. The kidnapping was solely intended to make Branton look good in exchange for the return of the ring. When Sir Dennis of France happens by, Lodac prepares a trap. Mignonette, a beautiful Frenchwoman, distracts her compatriot, then suddenly turns into an ugly hag (Maila Nurmi, best known to TV viewers of the 1950s as Vampira) who attacks him. Fortunately, George saves him with his magic shield.\nLodac finally becomes aware that George is being aided by magic. He contacts Sybil and mocks her abilities. Stung, she tries to cast a spell to help George, but ends up inadvertently stripping away all his magical powers.\nSir Dennis and Sir James of Scotland perish when they reconnoiter ahead. Branton then leads George and Sir Patrick of Ireland into a trap, revealing his partnership with Lodac before sealing them in a cave with deadly green apparitions. Patrick enables George to escape at the cost of his own life.\nGeorge sneaks into Lodac's castle and rescues Helene, only to be captured. The magician gives Helene (actually the hag in disguise) to Branton, but once he has the ring, he uses magic to put Branton's head on a plaque on the wall. George is tied up, but escapes with the help of shrunken prisoners. Sybil arrives and finally remembers the spell that restores George's powers, enabling him to slay the two-headed dragon and save Helene. Sybil steals the ring while Lodac is distracted. When the magician threatens the young couple with the seventh curse - himself - Sybil transforms herself into a large panther and kills him. The movie ends as Helene and George get married. When the six knights are returned alive, George's happiness is complete."}