{"mid": "TheMuppetChristmasCarol", "IMDB_id": "tt0104940", "title": "The Muppet Christmas Carol", "plot": "On Christmas Eve, in 19th Century London, Charles Dickens (played by Gonzo the Great) and his friend Rizzo act as narrators throughout the film. Ebenezer Scrooge, a surly money-lender, does not share the merriment of Christmas. Scrooge rejects his nephew Fred's invitation to Christmas dinner, dismisses two gentlemen's collecting money for charity, and tosses a wreath at a carol singing Bean Bunny. His loyal employee Bob Cratchit and the other bookkeepers request to have Christmas Day off since there will be no business for Scrooge on the day, to which he reluctantly agrees. Scrooge leaves for home while the bookkeepers celebrate Christmas. In his house, Scrooge encounters the ghosts of his late business partners Jacob and Robert Marley, who warn him to repent his wicked ways or he will be condemned in the afterlife like they were, informing him that three spirits will visit him during the night.\nAt one o'clock, Scrooge is visited by the childlike Ghost of Christmas Past who takes him back in time to his childhood and early adult life, Dickens and Rizzo hitching a ride too. They visit his lonely school days, and then his time as an employee under Fozziwig, who owned a rubber chicken factory. Fozziwig and his mother throw a Christmas party, Scrooge attends and meets a young woman named Belle, whom he falls in love with. However, the Ghost shows Scrooge how Belle left him when he chose money over her. A tearful Scrooge dismisses the Ghost as he returns to the present.\nAt two o'clock, Scrooge meets the gigantic, merry Ghost of Christmas Present who shows him the joys and wonder of Christmas Day. Scrooge and the Ghost visit Bob's house, learning his family is surprisingly content with their small dinner, Scrooge taking pity on Bob's ill son Tiny Tim. The Ghost of Christmas Present abruptly ages, commenting that Tiny Tim will likely not survive until next Christmas. Scrooge and the Ghost go to a cemetery, where the latter fades away, informing Scrooge that the Ghost of Christmas Yet to Come will arrive shortly. A fog fills the cemetery, revealing the third Ghost, who appears as a tall, silent cloaked figure. While Dickens and Rizzo abandon the audience to avoid being frightened, the Ghost takes Scrooge into the future.\nScrooge and the Ghost witness a group of businessmen discussing the death of an unnamed colleague where they would only attend the funeral if lunch is provided. In a den, Scrooge recognizes his charwoman, his laundress, and the local undertaker trading several stolen possessions of the deceased to a fence named Old Joe. The Ghost transports Scrooge to Bob's house, discovering Tiny Tim has died. Scrooge is escorted back to the cemetery, where the Ghost points out his own grave, revealing Scrooge was the man who died. Realizing this, Scrooge decides to change his ways.\nAwakening in his bedroom on Christmas Day, Scrooge decides to surprise Bob's family with a turkey dinner, and ventures out with Bean, Dickens, Rizzo, and the charity workers to spread happiness and joy around London. Scrooge goes to the Cratchit house, at first putting on a stern demeanor, but reveals he intends on raising Bob's salary and pay off his mortgage. Dickens narrates how Scrooge became a secondary father to Tiny Tim, who escaped death. Scrooge, the Cratchits, and the neighborhood celebrate Christmas."}