{"mid": "TheManWhoWouldBeKing", "IMDB_id": "tt0073341", "title": "The Man Who Would Be King", "plot": "In 1885, while working as a correspondent at the offices of the Northern Star newspaper in India, Rudyard Kipling (Christopher Plummer) is approached by a ragged, seemingly crazed derelict, who reveals himself to be his old acquaintance Peachey Carnehan (Michael Caine). Peachy tells Kipling the story of how he and his comrade-in-arms Daniel \"Danny\" Dravot (Sean Connery) traveled to remote Kafiristan (in modern-day Afghanistan, the province is now known as Nuristan), became \"gods\", and ultimately lost everything.\nThree years earlier, Dravot and Carnehan had met Kipling under less than auspicious circumstances; Carnehan, a former Colour sergeant of the Queen's Own Royal Loyal Light Infantry, pickpocketed Kiplings's pocketwatch but was forced to return it as he was a fellow Freemason. Carnehan claims to be an expert in \"whiskey, women, waistcoats and bills of fare.\" Both Dravot and Carnehan are in the process of blackmailing a local Rajah by posing as newspaper correspondents of \"The Northern Star\" newspaper-which outrages the real correspondent (Kipling). In order to save their lives, Kipling has the local district commissioner detain both Dravot and Carnehan - who obliquely blackmail the commissioner himself.\nDespite being accomplished gun smugglers, swindlers, fencers of stolen goods, conmen, and blackmailers, both of them are bitter that after fighting to make India part of the British Empire, they will have little to return home to except dead-end jobs. Both Dravot and Carnehan turn up at Kipling's office and explain their biggest gamble yet: feeling that India is too small for men such as themselves, they intend to travel to Kafiristan, a small and remote country in order to help a local king overcome his enemies, overthrow him, and become \"gods\"/rulers themselves before stealing various riches and returning to England in triumph. After signing a contract pledging mutual loyalty and forswearing drink and women until they achieved their grandiose aims, Peachy and Danny (taking along twenty Martini Henry rifles) set off on an epic overland journey north beyond the Khyber Pass. Kipling, after attempting to dissuade the men, gives Dravot his masonic emblem as a token of brotherhood. Over the next few weeks, Dravot and Carnehan travel through Afghanistan, fighting off bandits, blizzards, and avalanches as they make their way into the unknown land of Kafiristan (literally \"Land of the Infidels\").\nThey chance upon a Gurkha soldier who goes by the name Billy Fish (Saeed Jaffrey), the sole survivor of a missing mapping expedition sent several years earlier which had been lost in an avalanche. Billy speaks English as well as the local tongue. Acting as translator and interpreter of customs and manners, he smooths the path of Dravot and Carnehan as they begin their rise, offering their services as military advisors, trainers, and war leaders to the chief of the much-raided village of Er-Heb. Dravot and Carnehan muster a force to attack the villagers' most-hated enemy, the Bashkai. During the battle, Dravot is struck by an arrow, but is unharmed, leading the natives to believe that he is a god. In fact, the arrow was stopped by a bandolier hidden beneath his clothing. As victory follows victory, the defeated are recruited to join the swelling army.\nFinally, nobody is left to stand in their way, and they are summoned to the holy city of Sikandergul, where the chief high priest, Kafu Selim, sets up a re-enactment of the arrow incident, to determine whether Dravot is a man or a god by seeing whether or not he bleeds. When Dravot flinches, the monks grab him and open his shirt to stab him, only to be stopped by Dravot's Masonic jewel. By coincidence, the symbol on the jewel matches one known only to the highest holy man, the symbol of \"Sikander\" (a linguistic corruption of Alexander the Great), who had conquered the country thousands of years before and promised to return. The holy men are convinced Dravot is the immortal son of Sikander. They hail him as king and lead the two men down to storerooms heaped with treasure (gold, silver, diamonds, emeralds, rubies, among various jewels) that belonged to Sikander, which now belongs to Dravot.\nAs months pass, Carnehan is anxious to leave with the treasure before winter arrives and closes the mountain passes (and before the natives learn the truth about them). Dravot is against it, however, and develops delusions of grandeur. First, Dravot 'suggests' that Carnehan bow to him like the others, ostensibly to \"keep up appearances\" in front of the natives and continue the deception. He adjudicates disputes among local people and villages, and issues proclamations overseeing their administration. He begins making plans to turn the land into a modern country, to the extent that he envisages eventually meeting Queen Victoria \"as an equal.\" Resigned that Dravot's mind is made up, Carnehan decides to take as much loot as he can carry on a small mule train and leave alone.\nMeanwhile, Dravot decides to take a wife after seeing the beautiful Roxanne (Shakira Caine), despite Carnehan's strong warnings. Roxanne, having a superstitious fear that she will burst into flames if she consorts with a god, tries frantically to escape, biting Dravot during the wedding ceremony. The bite draws blood, and when everyone sees it, they realize that Dravot is not a god but a man after all.\nThe angry natives pursue Dravot and Carnehan. When it becomes clear that the battle is lost, Dravot and Carnehan offer Billy a horse to escape, but Billy refuses and wishes them luck before courageously charging into the mob with a kukri single handedly. Billy is killed amidst the mob and Dravot and Carnehan are soon captured. Dravot apologizes to Carnehan for spoiling their plans, and Carnehan forgives him. Now resigned to his fate, Dravot is forced to walk to the middle of a rope bridge over a deep gorge as the ropes are cut. Carnehan is crucified between two pine trees, but he is cut down the next day when he survives the ordeal. Eventually, he makes his way back to India, but his mind has become unhinged by his sufferings. As Carnehan finishes his story, he presents Kipling with Dravot's severed head, still wearing its crown, thereby confirming the tale."}