{"mid": "TheMoneyPit", "IMDB_id": "tt0091541", "title": "The Money Pit", "plot": "Attorney Walter Fielding and his classical musician girlfriend, Anna Crowley, learn of Walter Sr.'s wedding to a woman named Florinda shortly after fleeing the country for embezzling millions of dollars from their musician clients. The next morning, they are told they need to vacate the apartment they are subletting from Anna's ex-husband, Max Beissart, a self-absorbed conductor who has returned early from Europe.\nThrough an unscrupulous realtor friend, Walter learns about a million dollar distress sale mansion on the market for a mere $200,000. He and Anna meet the owner, Estelle, who claims she must sell it quickly because her husband, Carlos, has been arrested. Her sob story and insistence at keeping the place in candlelight in order to save money \"for the goddamn, bloodsucking lawyers\", distracts Walter and enchants Anna, who finds it romantic. They decide to buy it, but Anna insists on putting up half of the money needed for the repairs. She turns to Max for her half by selling him back what she got in their divorce. Walter gets his half from his wealthiest client.\nFrom the moment Walter and Anna take possession of the house, it quickly begins to fall apart. Amongst other problems, the entire front door frame rips out of the wall, the main staircase collapses, the plumbing is full of gunk, the electrical system catches fire, the bathtub crashes through the floor, the chimney collapses, and a raccoon is living in the dumbwaiter.\nContractors Art and Brad Shirk are called in (the only construction company who is willing to take on the work), who summarily tear the house to pieces using Walter's $5,000 down payment, leaving him and Anna embroiled in bureaucracy to secure the necessary building permits to complete the work. His continuing frustration at the escalating costs of restoring the house leads him to brand it a \"money pit\", whilst the Shirks continue to assure him that the work will take \"two weeks\".\nThe repair work continues for a grueling four months and Walter and Anna realize they need more money to complete the renovations. She attempts to secure additional funds from Max by selling him some artwork she received in their divorce. Although he does not care for it, he agrees to its purchase. He wines and dines her, and the next morning, when she wakes up in his bed, he allows her to believe that she has cheated on Walter; in reality, Max slept on the couch. Walter later asks her point-blank if she slept with Max, but she hastily denies it. His suspicions push her to admit that she did so, but the damage is done.\nDue to Walter and Anna's stubbornness, their relationship becomes more and more hostile and in a rare moment of agreement, they vow to sell the house once it is restored and split the proceeds. This nearly happens, but he misses her and says he loves her even if she did sleep with Max. She happily tells him that she didn't and they reconcile. In the end, they are married in front of the newly repaired house."}