{"mid": "TheMonsterSquad", "IMDB_id": "tt0093560", "title": "The Monster Squad", "plot": "The Monster Squad is a club of pre-teenagers who idolize classic monster-movies and their non-human stars. They hold meetings at a tree-clubhouse in Baton Rouge, Louisiana. Club leader Sean (Andre Gower), whose five-year-old sister Phoebe (Ashley Bank) desperately wants to join the club, is given the diary of legendary monster hunter Dr. Abraham Van Helsing (Jack Gwillim), but his excitement abates when he finds it is written in German. Sean, his best friend Patrick (Robby Kiger), and the rest of the Monster Squad visit an elderly man, known as the \"Scary German Guy\" (Leonardo Cimino), actually a kind gentleman and a former concentration camp prisoner, to translate the diary.\nThe diary describes, in great detail, an amulet that is composed of concentrated good. One day out of every century, as the forces of good and evil reach a balance, the otherwise indestructible amulet becomes vulnerable to destruction. With the next day of balance happening within a few days, at the stroke of midnight, the kids realize they must gain possession of the amulet and use it — with an incantation from Van Helsing's diary — to open a hole in the universe and cast the monsters into Limbo. As shown in the film's prelude, Van Helsing had unsuccessfully attempted this one hundred years ago in order to defeat his old adversary Count Dracula (Duncan Regehr); his apprentices then emigrated to the United States to hide the amulet, where it was out of Dracula's immediate reach.\nNevertheless, Dracula seeks to obtain the amulet so that he can take control of the world and plunge it into darkness. To this end, he assembles several of his most dangerous and monstrous allies: The Mummy (Michael MacKay), The Gill-man (Tom Woodruff Jr.), The Wolf Man (Carl Thibault), and in addition, three school girls (Mary Albee, Joan-Carrol Baron, and Julie Merrill) whom the Count transforms into his vampiric consorts. Dracula then steals a crate from a B-25 Mitchell in flight, containing Frankenstein's monster (Tom Noonan), thus completing his army. However, Frankenstein's monster is reluctant to aid Dracula, and wanders into the forest where he encounters Phoebe. Rather than being afraid, she shows him the kindness he has always sought, and they become friends. After Phoebe proves to the Monster Squad that Frankenstein's monster is not evil, he chooses to help the boys instead of Dracula. The Wolfman, when reverting to human form, is an recalcitrant follower of Dracula, and has been making calls to the police about the forthcoming carnage, which are dismissed as crank calls.\nThe amulet turns out to be buried in a stone room beneath a house that Dracula and the other monsters now occupy and where Van Helsing's diary was found. The secret room is littered with wards which prevent the monsters from taking it. The Monster Squad finds and removes the amulet and narrowly escape Dracula's grasp. The German informs them that the incantation must be read by a female virgin. As midnight approaches, the Squad makes their way to a local cathedral to make their last stand. Meanwhile, Dracula destroys their clubhouse with dynamite, drawing the attention of Sean's father, Police Detective Del, who has been charged with investigating the strange occurrences in town of late (as caused by Dracula's cohorts), but remains quite skeptical about their supernatural causes until he sees Dracula in person.\nUnfortunately, the doors to the cathedral are locked, so the incantation must be read on the stoop, leaving the Squad vulnerable. They enlist Patrick's beautiful elder sister Lisa (Lisa Fuller) to help them, as she's the only virgin they know. Unfortunately, with time running out, the incantation fails since Lisa is actually not a virgin anymore. As the monsters close in, the kids deduce that five-year-old Phoebe must complete the task of opening the portal, and the German Guy attempts to help her read the incantation as the rest of the Squad fends off the monsters.\nIn the ensuing battle, Dracula's consorts, the Mummy, the Gill-man, and the Wolfman are defeated. Dracula arrives and is about to kill Phoebe when Frankenstein's monster intervenes, impaling him on a wrought-iron fence. Phoebe finishes the incantation, opening the portal which begins to consume the bodies of the monsters. Dracula, still alive, attempts to drag Sean in with him. Sean impales Dracula with a wooden stake; then Van Helsing appears, having briefly escaped from Limbo, and pulls Dracula to his doom. Frankenstein's monster willingly goes into the portal, but Phoebe holds onto him. Frankenstein's monster shakes her off as she belongs on Earth, but accepts a gift of a stuffed animal as thanks. The portal then closes, ensuring the world's safety.\nIn the aftermath, the United States Army arrives on the scene, having received a letter from Squad member Eugene (Michael Faustino) earlier on asking for their help against the monsters. When the confused General fails to make sense of the situation, Sean steps forward and presents the man with his business card, identifying himself and his friends as \"The Monster Squad\"."}