{"mid": "TheNamesake", "IMDB_id": "tt0433416", "title": "The Namesake", "plot": "The novel describes the struggles and hardships of a Bengali couple who immigrate to the United States to form a life outside of everything they are accustomed to.\nThe story begins as Ashoke and Ashima leave Calcutta, India and settle in Central Square, in Cambridge, Massachusetts. Through a series of events, Gogol becomes the main character's official birth name, an event that will shape many aspects of his life in years to come. Throughout the story, Gogol fights an internal battle to find himself. He struggles trying to balance between American versus Indian culture and appreciating friendship more than family. Continuously in the novel, the author, Lahiri, uses different appeals of argument to show the reader that family should always be valued and help the reader connect with the story. Pathos in particular forces the reader to connect emotionally with the story, specifically of how Gogol's name came about and Ashoke's tragic accident.\n=== Summary ===\nAshima Ganguli is a young bride about to deliver her first child in a hospital in Massachusetts. It is 1968, and her husband, Ashoke, is an engineering student at the Massachusetts Institute of Technology (MIT). New to America, Ashima struggles through language and cultural barriers as well as her own fears as she delivers her first child alone. Had the delivery taken place in Calcutta, she would have had her baby at home, surrounded by family. The delivery is successful, and the new parents are prepared to take their son home when they learn they cannot leave the hospital before giving their son a legal name.\nThe traditional naming process in their families is to have an elder who will give the new baby a name, and the parents waited for the letter from Ashima's grandmother. The letter never arrives, and soon after, the grandmother dies. Bengali culture calls for a child to have two names, a pet name to be called by family, and a good name to be used in public. Ashoke suggests the name of Gogol, in honor of the famous Russian author Nikolai Gogol, to be the baby's pet name, and they use this name on the birth certificate. As a young man, Ashoke survived a train derailment with many fatalities. He had been reading a short story collection by Gogol just before the accident, and lying in the rubble of the accident he clutched a single page of the story \"The Overcoat\" in his hand. With many broken bones and no strength to move or call out, dropping the crumpled page is the only thing Ashoke can do to get the attention of medics looking for survivors. Though the pet name has deep significance for the baby's parents, it is never intended to be used by anyone other than family.\nEntering kindergarten, the Gangulis inform their son that he will be known as Nikhil at school. The five-year-old objects, and school administrators intervene on his behalf, sending him home with a note pinned to his shirt stating that he would be called Gogol at school, as was his preference. By the time he turns 14, he starts to hate the name. His father tries once to explain the significance of it, but he senses that Gogol is not old enough to understand. As Gogol progresses through high school, he resents his name more and more for its oddness and the strange genius for whom he was named. When he informs his parents that he wishes to change his name, his father objects to the idea but reluctantly agrees. Shortly before leaving for college, Gogol legally changes his name to Nikhil Gogol Ganguli.\nThis change in name and Gogol's going to Yale, rather than following his father’s footsteps to MIT, sets up the barriers between Gogol and his family. The distance, both geographically and emotionally, between Gogol and his parents continues to increase. He wants to be American, not Bengali. He goes home less frequently, dates American girls, and becomes angry when anyone calls him Gogol. During his college years, he smokes cigarettes and marijuana, goes to many parties, and loses his virginity to a girl he cannot remember.\nAs he is going home for the summer, Gogol's train is suddenly stopped and temporarily loses electricity. A man had jumped in front of the train and committed suicide, and the wait for the authorities causes a long delay. Ashoke, who is waiting at the train station for Gogol, becomes very concerned when he calls the train company and hears of this incident. When they pull into the Ganguli's driveway, Ashoke turns off the car and finally explains the true significance of Gogol's name. Gogol is deeply troubled by this news, asking his father why he didn't tell him this earlier. He starts to regret changing his name and his identity.\nAfter graduating from Columbia, Gogol obtains a very small apartment in New York City, where he lands a job in an established architectural office. He is rather stiff personality-wise, perpetually angry or else always on the lookout for someone to make a stereotypical comment about his background.\nAt a party, Gogol meets a very attractive and outgoing girl named Maxine, with whom he begins a relationship. Maxine's parents are financially well off and live in a four-story house in New York City, with one floor occupied entirely by Maxine. Gogol moves in with her, and becomes an accepted member of her family. When Maxine's parents visit her grandparents in the mountains of New Hampshire for the summer, they invite Maxine and Gogol to join them for a couple of weeks.\nGogol introduces Maxine to his parents. Ashima dismisses Maxine as something that Gogol will eventually get over. Shortly after this meeting, Ashoke dies of a heart attack while teaching in Ohio. Gogol travels to Ohio to gather his father's belongings and his father's ashes, and in attempting to sort out his emotions, Gogol gradually withdraws from Maxine, eventually breaking up with her. He begins to spend more time with his mother and sister, Sonia.\nLater, Ashima suggests that Gogol contact Moushumi, the daughter of one of her friends, whom Gogol knew when they were children, and whose intended groom, Graham, broke up with her shortly before their wedding. Gogol is reluctant to meet with Moushumi because she is Bengali, but does so anyway, to please his mother.\nMoushumi and Gogol are attracted to one another and eventually are married. However, by the end of their first year of marriage, Moushumi becomes restless. She feels tied down by marriage and begins to regret it. He also feels like a poor substitute for Graham. Eventually, Moushumi has an affair with Dimitri, an old acquaintance, the revelation of which leads to the end of their marriage. With Sonia preparing to marry her fiance, an American named Ben, Gogol is once again alone. He is nonetheless comforted by the fact that Ashoke, prior to his death, finally told his son why he had chosen that name for him. Gogol comes to accept his name and picks up a collection of the Russian author's stories that his father had given him as a birthday present many years ago."}