{"mid": "TheNakedSpur", "IMDB_id": "tt0044953", "title": "The Naked Spur", "plot": "In March 1868, Howard Kemp (James Stewart) is tracking Ben Vandergroat (Robert Ryan), who is wanted for the murder of the marshal in Abilene, Kansas.\nOn the western slope of the Rocky Mountains in Southwestern Colorado, Kemp meets a grizzled old prospector, Jesse Tate (Millard Mitchell), and offers him $20 to help. Tate assumes that Kemp is a sheriff, and Kemp does nothing to disillusion him.\nThey trap someone on top of a rocky hill who Kemp is convinced must be his wanted man. Rockslides force a retreat. Looking for a way around the hill, Kemp and Tate encounter a Union soldier, Lieutenant Roy Anderson (Ralph Meeker). He has been discharged from the 6th Cavalry at Fort Ellis in Bozeman and is heading east. Tate questions why Anderson isn't on the Bozeman Trail. Anderson's story is that there are some \"bad tempered Indians\" whose chief's daughter fell in with a handsome young army lieutenant. Kemp has a chance to see Anderson's discharge order in which he is described as \"morally unstable\" and given a dishonorable discharge.\nTate tells Anderson that Kemp is a sheriff. With the aid of Anderson, who scales a sheer cliff face, Vandergroat is caught, along with his companion, Lina Patch (Janet Leigh), the daughter of Vandergroat's friend, Frank Patch, who was shot dead trying to rob a bank in Abilene.\nVandergroat sets Tate and Anderson straight on two facts: that Kemp is no lawman, and that a reward is offered to bring him in — $5,000 — dead or alive. Tate and Anderson want their shares to aid Kemp in getting Vandergroat back to Kansas. Lina is convinced that her father's friend is innocent.\nOn the trail to Abilene, Vandergroat attempts to turn his captors against each other, using greed as his weapon. He also encourages Lina to use her beauty to divide Kemp and Anderson. When scouting a way through a mountain pass, Kemp and Tate spot a dozen Blackfeet, a normally friendly tribe, far from their normal hunting grounds. They tell the others, and Anderson confesses that the Indians are after him. Kemp tells Anderson to hightail it out of there to avoid being captured by the Blackfeet. Anderson thinks Kemp just wants a bigger share of the reward money. He rides ahead, and from his position hidden behind a fallen tree trunk, with his rifle he elects to pick off a chief of the Blackfeet, at the moment Kemp's group have confronted the Indians and are about to engage them in talk.\nDuring the ensuing battle, Kemp saves Lina from the Blackfeet and she, in turn, helps him when he is shot in the leg. Later, Kemp passes out on the trail and awakes from a delirious nightmare. He thinks Lina is Mary, his ex-fiancée. Vandergroat tells the others that Mary sold Kemp's ranch, which he left in her safekeeping, while he was serving in the army during the Civil War, and then went off with another man. Vandergroat further reveals that Kemp is determined to buy his ranch back, and that it can't happen if he splits the reward money with Anderson and Tate.\nLina's feelings of loyalty to her father's friend, combined with an attraction to Kemp, confuses her. She has never seen Vandergroat hurt anyone unless it was in a fair fight but after he loosens Kemp's saddle cinch and tries to push him off a high mountain pass, Lina's sympathies for Kemp grow.\nTaking refuge from a storm in a cave, Vandergroat manipulates Lina into distracting Kemp. She tells the rancher of her dream to go to California, where no one knows her and she can make a fresh start. He tells her of his wish to repurchase his ranch. They kiss, and this gives Ben a chance to escape. Kemp catches Vandergroat, and Anderson suggests that, because the reward is for a \"dead or alive\" criminal, they should just kill the troublemaker. Tate stops Anderson but, caught up in the anger of the moment and hurt by what he sees as Lina's treachery, Kemp challenges Vandergroat to a shoot out. The wanted man declines to take part.\nNext day, the group comes to a high-running river. They argue about whether to cross or go down stream. Anderson grabs a rope and throws it around Vandergroat's neck and says he'll drag him across the river. A fight ensues between Kemp and Anderson, as Vandergroat watches with malicious enjoyment. Kemp finally manages to kick Anderson unconscious. While Kemp and Anderson recover from the fight and Lina searches for firewood, Vandergroat convinces Tate to sneak off with him to find a gold mine, the whereabouts of which Vandergroat has been tempting the old man with. When they depart during the night, he convinces Tate to take Lina along.\nVandergroat and Lina ride double; Tate follows, holding a rifle on them. Ben suddenly yells, \"Snake!\" and in the confusion grabs Tate's rifle from him and kills him. He fires two more shots in order to lure Kemp and Anderson to a spot where he intends to kill them. Lina finally sees Vandergroat for what he is.\nKemp and Anderson discover Tate's body where Vandergroat has positioned it for an ambush from the high cliff. Preparing to shoot Kemp, Vandergroat is caught off guard when Lina grabs the rifle barrel, saving Kemp's life. While Anderson exchanges gunfire with Vandergroat, Kemp removes one of his spurs to aid in climbing up the back of the cliff to outflank Vandergroat. He uses the spur as a combination climbing ax and makeshift piton.\nVandergroat, hearing Kemp, gets the drop on the rancher. However, before he can pull the trigger, Kemp throws his spur into the killer's left cheek. As Ben reels from the pain of the spur, he is shot by Anderson and his body falls into the nearby river, becoming entangled in the roots of a tree. Anderson lassos a branch on the other side of the river and crosses using the rope. He then wraps it around Ben's body but is crushed by a large tree stump barrelling down the river.\nKemp grabs the rope and drags Vandergroat's body across the river and, in a rage, vows that he will take him back to reclaim his land. Lina pleads with him not to take blood money for bringing Vandergroat in. She says she will go with him, no matter what, marry him, and live with him on the ranch. Kemp realizes what he is doing and his love for Lina makes him stop. He begins digging a grave to bury Vandergroat and they decide to make for California, leaving their pasts behind."}