{"mid": "TheNormalHeart", "IMDB_id": "tt1684226", "title": "The Normal Heart", "plot": "It's 1981 and Ned Weeks (Mark Ruffalo), an openly gay writer, attends the birthday party of his friend Craig Donner (Jonathan Groff) at a beach house in Fire Island. The atmosphere is hedonistic with lots of drinking, dancing and hot hard bodies everywhere. While playing in the surf Craig starts coughing and collapses, but says he's just a little light-headed. Later, when blowing out his candles, Craig appears breathless and keeps coughing.On the bus back to New York, Ned reads an article about a rare form of cancer that's affecting the gay community. He visits Dr Emma Brookner (Julia Roberts), who is trying to identify the cause of the disease that's killing her patients. She asks Ned to try and persuade gay men to stop having sex, as she's convinced that's how it's spread. When Ned is preparing to leave, Craig is carried into the office by his boyfriend, Bruce Niles (Taylor Kitch), and their friend Micky Marcus (Joe Mantello). He is convulsing violently and foaming at the mouth. Craig subsequently dies.Ned organises a meeting of the gay community at his home to hear Dr Brookner talk about the disease. She is met with derision from all sides. Nobody takes her seriously and she leaves in frustration. Ned approaches Felix Turner (Matt Bomer), a gay reporter at the New York Times, to enlist his help, but he's unsuccessful. He and a group of friends try fundraising, but no one is interested. Ned asks his lawyer brother, Ben Weeks (Alfred Molina), to provide free legal advice to his friends, to which he reluctantly agrees.Ned visits Dr Brookner at a local hospital and is shocked by the conditions and lack of care her patients are receiving. The staff are scared and won't go near the patients without full protective gear. The patients' food is left outside their door until Dr Brookner can take it to them herself.Ned invites Felix to his apartment for dinner and they end up in bed together.It's 1982 and Ned, Bruce, Mickey, and several other friends including Tommy Boatwright (Jim Parsons) establish a community organisation called Gay Men's Health Crisis (GMHC). They select Bruce as their President.As time goes on more friends get sick and die. There are more faces with lesions.Ned asks Felix to move in with him and Felix accepts.Ned keeps writing articles about the AIDS epidemic and during a TV interview he accuses the government of a conspiracy to kill gay men. This doesn't go down well with the other members of GMHC. In another TV interview he accuses the mayor of being gay and is pulled off the air.Ned asks Ben to join the Board of Directors, but he refuses, as he doesn't agree with Ned's lifestyle. They have a blazing argument that culminates in Ned saying he won't speak to Ben again until he accepts him for who he is.Ned invites a NBC film crew to the new GMHC headquarters, which shocks and angers Bruce, who is still in the closet at work. He and Ned exchange blows and Bruce throws the video camera out of the window when the cameraman continues to film him.Ned and Felix go to their beach house for the weekend and, after a discussion about whether they would stay if the other got sick, Felix shows Ned a lesion on the sole of his foot.Ned has dinner with Dr Brookner and she tells him how she contracted polio as a child and was bedridden for much of her childhood. She uses a motorised wheelchair and tells Ned she doesn't practice walking enough, so Ned insists she try. He puts on some music and she stands up out of her wheelchair, gets up on her crutches and they \"dance\" for a brief moment to Johnny Mathis.The GMHC arrange a meeting with the mayor, who doesn't show up and his substitute, Hiram Keebler (Denis O'Hare), is 90 minutes late. The meeting does not go well, with Ned losing his temper and throwing papers at Hiram.It's 1983 and Tommy receives a call that his friend Nick has died. At the funeral he talks about his Rolodex and how he saves the cards of the friends who have died bound in a rubber band in a drawer. He says he had 5 cards the year before and now he has 50.Felix continues to get sicker. His body is covered in lesions and he looks emaciated. Ned cares for him to the best of his ability.Micky has a meltdown at GMHC headquarters. His job is under threat and he is frustrated by the lack of answers from the medical community, the lack of support from the government, and he fears for the future.Tommy takes a weeping Micky home and Bruce and Ned go to a bar, where Bruce tells Ned that his boyfriend Albert (Finn Wittrock) is dead. He tells Ned that Albert wanted to see his mother in Phoenix before he died. The pilot refused to fly and Bruce refused to leave the plane, so they had to find another pilot who agreed to fly the plane. Albert became confused and disorientated during the flight and died at the hospital shortly after landing in Phoenix. The doctors refused to examine Albert's body and the undertaker wouldn't take the body without a death certificate so, eventually, an orderly put Albert's body in a garbage bag and put him in the alley for a payment of $50. Bruce and Albert's distraught mother put Albert in the back of her car and they found someone to cremate him for $3,000.Felix is now in the hospital and Ned is attempting to remain positive, despite the reality of the situation.Dr Brookner gives a presentation to a group of government officials who refuse her application for funding. She loses her temper and berates them for their inaction while more people continue to die.Ned receives an invitation to the Whitehouse where he meets with John Bruno (Corey Stoll), Advisor to the President. Bruno is only interested in whether heterosexuals can contract AIDS. When Ned says he doesn't have that information Bruno ends the meeting.Ned goes home to Felix where the two argue, culminating in Ned throwing groceries at Felix, then breaking down in tears and burying his head in his lap.Back at GMHC headquarters, Bruce reads Ned a letter from the Board, who are tired of Ned's aggressive approach and have voted him out as a Director. Ned goes to pack up his belongings and gives a very moving speech asking them not to shut him out, but the group turn away from him and leave the room.Felix goes to see Ben to write a will leaving everything to Ned. He collapses on the street outside Ben's office and Ned rushes to be by his side in the hospital. Dr Brookner performs a faux marriage ceremony at Felix's bedside. He dies soon after.The phone rings in Tommy's office and he adds Felix's Rolodex card to the bundle in his drawer.Ned attends the 1984 Gay Week at Yale where gay couples, both male and female, dance together in a candlelit room. Ned weeps silently as he watches them.As the film ends we're told that President Ronald Reagan mentioned AIDS publicly for the first time on 17 September 1985, vowing to make AIDS research a \"top priority\". However, Reagan's proposed federal budget for 1986 actually called for an 11% reduction in AIDS spending. By the end of 1986 there were 24,559 reported deaths.Since the epidemic began in 1981 over 36 million people worldwide have died from AIDS and more than 6,000 people are newly infected every day with HIV."}