{"mid": "TheNegotiator", "IMDB_id": "tt0120768", "title": "The Negotiator", "plot": "Lieutenant Danny Roman, a top Chicago Police Department hostage negotiator, is approached by his partner, Nate Roenick that according to an informant (whom he refuses to name), members of their own unit are defrauding large amounts of money from the department's disability fund, for which Roman is a board member. When Roman goes for another meeting, he finds Roenick murdered seconds before other police arrive, pinning Roman as the prime suspect.\nMatters become worse for Roman when Internal Affairs investigator Terence Niebaum, whom Roenick's informant suspected of involvement in the embezzlement, is assigned to investigate the murder. After the gun that killed Roenick is linked to a case Roman had worked on, Niebaum and other investigators search Roman's house and discover papers for an offshore bank account with a deposit equal to one of the amounts of money embezzled. Roman is forced to surrender his gun and badge and his colleagues are doubtful of his protests of innocence. With embezzlement and homicide charges pending, Roman storms into Niebaum's office and demands answers about who set him up. When Niebaum refuses to answer, Roman takes Niebaum, his administrative assistant Maggie, police commander Grant Frost, and weak willed con man Rudy Timmons as hostages.\nWith the building evacuated and placed under siege by his own CPD unit and the FBI, Roman issues his conditions: locating Roenick's informant and summoning police Lt. Chris Sabian, the city's other top negotiator. Roman believes he can trust Sabian because he talks for as long as possible, sees tactical action as a last resort, and being from another precinct eliminates him as a suspect in the disability fund scheme. Sabian clashes with the CPD but is given temporary command of the unit after they hastily attempt a breach that goes awry, resulting in two additional officers becoming Roman's hostages.\nRoman trades Frost to Sabian in exchange for restoring the building's electricity. With help from Rudy and Maggie, Roman accesses Niebaum's computer and pieces together the scheme: corrupt officers submitted false disability claims that were processed by an unknown insider on the disability fund's board. He also discovers recordings of wiretaps, including a conversation that suggests Roenick was meeting his informant before he was killed. Sabian, using the information Roman provided, claims to have located Roenick's informant in a bid to get Roman to release the hostages. Roman realizes Sabian is bluffing when Niebaum's files reveal Roenick himself was the IAD informant.\nWhen Roman threatens to expose Niebaum in an open window, leaving him vulnerable to sniper fire, Niebaum admits that Roenick gave him wiretaps implicating three of Roman's squad mates in the embezzlement scheme. When Niebaum confronted the guilty officers, he received a bribe from them to cover up their crimes while Roenick refused to take it, which led to his death. Niebaum says he does not know who the inside ringleader is, but that he has the taps corroborating the three officers' guilt. The same corrupt officers have secretly entered the room via the air vents under the pretext of being part of a team to take Roman out in case he started killing hostages; upon hearing Niebaum's confession, they open fire and kill Niebaum before he can reveal where he has hidden the wiretaps. Roman single-handedly fights them and the rest of his squad off using the flashbangs he seized from the two officers in the previous failed breach.\nBelieving that Sabian and the police cannot resolve the situation, the FBI assume jurisdiction over the operation, cease negotiations, relieve Sabian of his command, and order a full breach. Sabian begins to believe in Roman's innocence and gives him a chance to prove his case: while the FBI and SWAT raid the building and rescue the hostages, Roman escapes disguised in a SWAT uniform. Roman and Sabian proceed to Niebaum's house, but are unable to find the wiretaps. The police arrive and the corrupt officers enter the house, but they back off as Frost enters and tries to talk Roman down. Sabian observes Frost discreetly taking one of the guns and realizes that Frost is the ringleader of the conspiracy and Roenick's killer.\nIn front of Frost, Sabian seemingly shoots Roman dead and offers to destroy the \"evidence\" they have uncovered in return for a cut of Frost's take. Frost agrees and effectively makes a full admission to his and the other three officers' crimes. When Frost exits the house, he discovers Roman had feigned death and used a police radio microphone to broadcast his confession to the police surrounding the area. Frost attempts to commit suicide but is disarmed and arrested with the other corrupt officers. As Roman is loaded into an ambulance, Sabian gives him back his badge and departs."}