{"mid": "TheNeverendingStoryIITheNextChapter", "IMDB_id": "tt0100240", "title": "The Neverending Story II: The Next Chapter", "plot": "Bastian Bux is having troubles at home: his father Barney's busy workload is keeping him from consoling Bastian's fear of heights. As such, he then heads to an old bookstore where he again meets Mr. Koreander, who proceeds to help find a book on courage. While waiting, Bastian rediscovers the Neverending Story's book, and is shocked to see its words disappear off its pages. Deciding to take the book instead, Bastian returns home and finds himself able to claim AURYN right off the book's cover while hearing the Childlike Empress summon him to Fantasia.\nAware of his arrival, an evil sorceress named Xayide orders a creation from one of her servants to stop him. The servant creates a memory machine that will strip Bastian of a memory each time he uses AURYN, until he is unable to remember where he came from, or why he is in Fantasia. Xayide then sends a bird-like creature named Nimbly to persuade Bastian into making him wish. As the two arrive in a populated area of Fantasia called Silver City, the sorceress sends large monsters referred to as giants to attack. Despite Nimbly's attempts to make him wish them away, Bastian is able to escape from them without doing so. After falling into a secret passage, Bastian is contacted by the Childlike Empress, who tells him of a new threatening force to Fantasia, which is keeping her prisoner in her own castle as well as causing the stories of the ordinary world to disappear, and that he must identify and defeat it.\nWhile trying to gather Silver City's inhabitants to help him out, Bastian is reunited with Atreyu, who has heard about what has happened. As the two try to figure out how to get there, Nimbly manages to persuade Bastian into making a wish, which he uses to create a vicious, fire breathing dragon. However, it goes out of control and flies off with Atreyu trying to pursue it with his horse, Artax. With help from Falkor, Bastian is able to chase the dragon to Xayide's castle, where it is destroyed by its defenses. After a brief reunion with Rock Biter, Bastian and Atreyu, who has caught up, make their way into the castle's entrance with the latter's \"army\": several wind up toys. Although Bastian gets through, Atreyu is captured. Once getting further into the castle by wishing for climbing steps, Bastian manages to free Atreyu from a giant and the two battle it with the use of a spray can, an item the former had wished for. After the giant falls over and cracks into pieces revealing a hollow shell, Bastian identifies the threat as \"The Emptiness\", the form of humanity's dying imagination. The two make their way to Xayide in her throne room who admits defeat, stating she had wanted to bring order to dreams and stories, which she consider as forms of chaos. The sorceress is then forced to bring them to the Childlike Empress' castle to free her after Atreyu threatens to kill her.\nHaving noticed his son's disappearance and the Neverending Story's book, Barney takes the latter to Mr. Koreander's bookstore to ask him of Bastian's whereabouts. The owner simply tells him that he'll find the answers inside the book, much to Barney's confusion. Returning later with a police officer, he is shocked to see the bookstore abandoned as a result of the Emptiness. Looking inside the book, Barney is surprised to see his son's exploits in Fantasia being written by the book itself and that he is mentioned within.\nDuring the travel to the Childlike Empress' castle, Xayide tries to trick Bastian into believing that his friends will turn against him and manages to get him to wish for a series of ridiculous wishes. It also becomes obvious to Atreyu that they are being led aimlessly. Becoming worried, Atreyu and Falkor believe that the only way help Bastian is to remove AURYN from him as they have learned of the memory machine and its effects on him. Bastian overhears them, and through a confrontation with Atreyu believes that he has turned against him. The two then fight, with Atreyu being knocked over a cliff and falling to his death. Returning to Xayide, Bastian discovers the memory machine for himself and learns that he only has two memories - consisting of his mother and father - left. In an attempt to use Artax to follow Falkor, who has taken the fallen Atreyu away, he is nearly killed by an attack from Xayide. Now on foot, Bastian is encountered by Nimbly once more, who has had a change of heart after seeing one of his memories, and guides him to his friends' location before flying off.\nArriving back in Silver City, now in a heavily ruined state, Bastian finds Falkor with Atreyu's lifeless body, and uses his penultimate memory of his mother to wish the latter back to life. Shortly afterwards, Xayide arrives with her giants and tries to force Bastian to use his last wish to return home. Rather than do so, Bastian uses his wish for the sorceress \"to have a heart\". Overcome with compassion, Xayide explodes in a blast of light, destroying her giants and restoring Fantasia. Having been freed, the Childlike Empress thanks Bastian for his help and shows him the way home: a cliff overlooking a waterfall to help Bastian overcome his fear of heights. Encouraged by Barney and Atreyu, Bastian jumps off and returns home safely. As he reunites with his father, AURYN reappears on the front cover of the Neverending Story's book."}