{"mid": "TheNunsStory", "IMDB_id": "tt0053131", "title": "The Nun's Story", "plot": "Gabrielle \"Gaby\" Van Der Mal (Audrey Hepburn), whose father Hubert (Dean Jagger) is a famous surgeon in Belgium, enters a convent of nursing sisters in the late 1920s in the hopes of eventually becoming a missionary nursing sister in the Belgian Congo. After being given the name of Sister Luke and undergoing a postulancy and novitiate which foreshadow her future difficulties with the vow of obedience, she takes her first vows and is sent to a school of tropical medicine.\nAfter passing high in her class but not without some spiritual conflict, after struggling with a request by Mother Superior to purposely fail her exam as a proof of her humility, she discovers to her disappointment that she has been assigned to go not to the Congo but instead to a mental hospital, where she assists with the most difficult and violent cases though resenting her tropical medicine knowledge going to waste there. One of these patients, a particularly violent schizophrenic (Colleen Dewhurst) who believes herself to be the Archangel Gabriel, tricks her into opening the cell door in violation of the rules and warnings given, and Sister Luke barely escapes from her to face the shame of her disobedience once again.\nNevertheless, she is eventually permitted to take her final vows and sent to her wished for post of the Congo. Once there she's disappointed to learn that she will not be nursing the natives, but instead will be the operating nurse for the segregated whites/European patient hospital. She develops a strained but professional relationship with the brilliant but atheistic surgeon there, Dr. Fortunati (Peter Finch). Eventually, the strains of her work and spiritual struggle cause her to succumb to tuberculosis. Fortunati, not wanting to lose the ideal nurse that Sister Luke is and sympathetic with her desire to stay in the Congo, engineers an amazing cure for the TB, a condition which otherwise always requires being sent to medical care (in Sister Luke's case back to convalesce in Europe).\nSome time after Sister Luke's return to health and work, Fortunati is forced to nevertheless send her back to Belgium as the only nurse qualified to accompany a VIP who has become mentally unstable. She spends an outwardly quiet but inwardly restless period of time at the motherhouse in Brussels before the superior general finally gives her a new assignment. Because it is clear that there is going to be a war, she cannot go back to the Congo, but instead becomes a surgical nurse at a local hospital.\nThere Sister Luke's long struggle with obedience becomes impossible for her to sustain, as she is forced into repeated compromises to deal with the reality of the Nazi occupation, including the fact that they have killed her father. She asks for and with difficulty is granted a dispensation from her vows, and is last seen changing into lay garb and quietly leaving the convent by a back door."}