{"mid": "TheNightFlier", "IMDB_id": "tt0119784", "title": "The Night Flier", "plot": "Richard Dees [Miguel Ferrer], ace reporter for the tabloid newspaper Inside View is\noffered a new assignment. Some sicko who calls himself Dwight Renfield, as\nin Dwight Frye who played the role of Renfield in the 1931 movie version\nof Dracula, is flying from desolate airport to desolate airport in his\nblack Cessna Skymaster 337, tail number N101BL, killing whomever is there\nand then drinking their blood--and no one has caught him yet. However,\nDees thinks the story is a waste of his time and suggests that editor\nMerton Morrison [Dan Monahan] give the assignment to cub reporter Katherine Blair [Julie Entwistle], whom\nDees has unaffectionately nicknamed \"Jimmy,\" after Jimmy Olson of Superman\nfame. The next morning, after Katherine has been able to tap into a network\nof local law enforcement agencies on her computer and find three cases\nthat all meet the batty flier's M.O., Morrison again asks Dees to take the\nassignment. This time, Dees agrees. Needless to say, Katherine isn't\npleased. Dees has his own airplane and decides to run the killer's back\ntrail.First stop is the Cumberland County Airport in Falmouth, Maine, where\nClaire Bowie was killed. Dees gets the details from\nEzra Hannon [John Bennes] on how, as\nhe was turning over the night shift to Claire, the night-flying Skymaster\nlanded. Out of the airplane walked a man wearing a long black cloak. The\nnext morning, Hannon found Claire washing down the Skymaster. The morning\nafter that, Claire was found with his throat ripped open. The only strange\nthing that Hannon can recall was under the luggage bay--a big pile of dirt\nfilled with worms and maggots. That night, Dees pays a visit to Claire's\ngrave in order to get a photograph. Later, after drinking 3/4ths of a\nbottle of booze and bedding down for the night at the Cumberland Motel,\nDees dreams that someone wearing a long black cloak is after him. When\nDees looks out the patio door, however, he sees written on the glass in\nwhat looks like blood, \"STAY AWAY.\" Dees chalks it up to a cemetery\ncaretaker who gave him a hard time while he was trying to photograph\nClaire Bowie's grave.Second stop is New York, the Alderton Funeral Home, where Buck\nKendall is laid out ready for the funeral director to sew up the deep\ngashes in his face and the two big holes on opposite sides of his neck. In\na call that evening to Morrison, Dees learns that Morrison is getting\nantsy. He wants to run the story about the Night Flier, but Dees is not\nready to give it yet, so Morrison has a brainstorm. He puts Katherine back\non the story.Third stop for Dees is Duffrey, Maine, where Ray and Ellen Sarch were\nthe Night Flier's third and fourth victims. Unfortunately, the Duffrey\nairport is closed, so Dees has to land at Washington National, rent a car,\nand drive into town. On the way, he comes upon a car crash. Several people\nhave been killed and are laying all bloodied on the pavement and in their\ncars. While photographing a young boy, Dees sees the boy's face suddenly\nchange into that of an older man with a chain hanging out of his mouth.\nDees is taken aback, but the policeman telling him not to get in the way\ninterrupts his vision. Dees stops at a gas station in Duffrey. The owner tells him how he\nfilled Ray and Ellen's tank the day before the murders. Ray was looking\ntired and pale, but Ellen was looking \"fine.\" The owner suggests that Dees\ntalk to Selida McCammon, Ellen's hairdresser. Selida tells Dees that she\nthought it odd for Ellen, after 20 years of appointments as regular as\nclockword, to suddenly come in two weeks early. Plus, Ellen seemed all\ndreamy to Selida, looking \"like a schoolgirl with a crush,\" and asking for\na new look that made her appear sensuous and younger. Ellen also told\nSelida about the pilot who had flown in the night before and how they\nwelcomed him by inviting him in for dinner and to watch a little TV.\nAfter getting the story from the local deputy, Dees pays a visit to\nthe Sarches' trailer. He sees Ray's office where bloody handprints still\nremain on the window. He sees the corner of the room where Ray's head was\nfound, ripped from his shoulders. He sees on the wall the FAA warning for\na black Skymaster 337 #N101BL registered to Dwight Renfield. He sees the\nbedroom where Ellen Sarch's body was found lying on the bed, two big holes\non opposites sides of her neck, her body bloodless, and a peaceful smile\non her face. When he leaves the trailer, Dees is chased by a large dark\ndog who disappears when Dees manages to outrun it to his car.That evening, after checking in at the Falling Star Motel, Dees goes\nout for a drink or two or three. As he looks at the photos he has taken,\nthe bartender sets down an unordered Bloody Mary, supposedly ordered for\nDees by a guy at the end of the bar, but there is no one there now. Dees\nlifts the drink to see the words \"STOP NOW\" printed on the napkin\nunderneath it. When Dees returns to his hotel, who should he see there but Katherine\nBlair. They trade insults, boast about their leads, and both admit that\nthey're actually dry. Dees invites \"Jimmy\" to help him phone airports in\nsearch of the Night Flier's next touchdown. They make a list of all the\nairports in the area and divide it in half. Dees calls his half on his\ncellphone while Katherine calls her half on the phone in the motel room.\nNo luck. Only one airport to go--Wilmington--which is unlikely, as it's a\nlarge airport. Dees makes the call anyway. When he asks the air controller\nif he's seen a black Cessna Skymaster 337, tail 101BL, the controller\ncurtly says \"No\" and hangs up on him. Obviously, the real answer is \"Yes.\"Fourth stop is Wilmington Airport, but first Dees has to get rid of\n\"Jimmy.\" He locks her in his closet, tells her, \"Sorry, Jimmy. You lose,\"\nand then takes off alone. It is a dark and stormy night as Dees approaches\nWilmington. He asks the controller again if he's seen a Skymaster 337,\ntail 101BL but gets no reply. Suddenly, his radio is filled with screams.\nThen comes a deep, gravelly voice calling his name. It is Dwight Renfield\nhimself. He tells Dees to turn around, but Dees refuses. When he lands at\nWilmington, Dees sees it--the black Skymaster. There is no one inside, so\nDees peeks in. What he finds is mind-numbing. The cockpit is dripping with\nblood, and the cargo hold is filled with dirt, worms, maggots, and several\ncopies of Inside View.Suddenly the screaming starts again, and Dees runs to the terminal.\nWhat he finds inside is even more appalling. Blood everywhere, and bodies\nof men, women, and children on the floor and in the chairs. Even the FAA\nwarning for the black Skymaster 337 #N101BL registered to Dwight Renfield\nis dripping with blood. One body catches his eye, and Dees goes over to\nphotograph it. It is a man with a chain hanging out of his mouth. Dees\npulls out the chain to find a crucifix dangling from it.Dees has had it. He can no longer hide behind his camera and races to\nthe men's room where he upchucks his dinner. Suddenly, someone else enters\nthe men's room, but Dees cannot see anyone in the mirror, only the trickle\nof blood in the urinal where someone is relieving himself. It is Dwight Renfield [Michael H. Moss],\nand for the first time, Dees realizes that he has encountered a real\nvampire. Dwight makes Dees destroy his film, warns Dees for the final time\nnot to follow him anymore, and leaves. After shivering for a few seconds,\nDees follows anyway...shouting at Dwight to show his face. Show it he\ndoes, to reveal two huge, opposing fangs, one on the top and one on the\nbottom. Dwight then slits his own wrist and makes Dees drink the blood.And now Dees enters his own personal hell. The floor of the terminal\nturns misty and from it start rising all the people whom Dees has\nexploited to write his stories in Inside View. As they advance toward\nhim, Dees freaks. Grabbing the axe from the emergency firebox, he starts\nhacking at them. Suddenly the police arrive, followed by Katherine Blair.\nThe police order Dees to freeze, but he rushes towards Katherine anyway,\nso they shoot him. They warn Katherine to stay back, so she stands by the\nterminal window where she sees Dwight Renfield getting into his black\nSkymaster and taking off.Katherine knows that she can never print what she believes or believe\nwhat she prints, so the next cover of Inside View features Richard Dees\nlying in a pool of his own blood. The headline reads: NIGHT FLIER\nDEFANGED. Inside View Scribe Moonlighted as Dastardly Deadly Count. In\nthe lower right-hand corner is a photo of Katherine \"Jimmy\" Blair, the\ntabloid's new ace reporter.Sorry, Dees. You lose. [Original Synopsis by bj_kuehl.]"}