{"mid": "TheOutlawJoseyWales", "IMDB_id": "tt0075029", "title": "The Outlaw Josey Wales", "plot": "Josey Wales, a Missouri farmer, is driven to revenge by the murder of his wife and young son by a band of pro-Union Jayhawker militants. The murderers were from Senator James H. Lane's Kansas Brigade, which included Captain Terrill.\nAfter grieving and burying his wife and son, Wales joins a group of pro-Confederate Missouri Bushwhackers led by William T. Anderson and fights in the Civil War. At the conclusion of the war, Captain Fletcher persuades the guerrillas to surrender, saying they have been granted amnesty. Wales refuses to surrender. As a result, he and one young man are the only survivors when Captain Terrill's Redlegs massacre the surrendering men. Wales intervenes and guns down several Redlegs with a Gatling gun.\nSenator Lane forces Fletcher to work with Terrill in tracking down Wales and puts a $5,000 bounty on Wales, who is now on the run from Union militia and bounty hunters. Along the way, despite wishing to be left alone, he accumulates a diverse group of companions. They include an old Cherokee named Lone Watie, a young Navajo woman, and an elderly woman from Kansas and her granddaughter Laura Lee, whom Wales rescues from Comancheros. At Santo Rio, two men, Travis and Chato, join their group.\nWales and his companions find the abandoned ranch owned by Laura's father and inhabit it after Wales parleys and makes peace with the neighboring Comanche tribe leader, Ten Bears. Meanwhile, a bounty hunter who identified Wales at Santo Rio, guides Captain Terrill and his men to the town. The following morning, the ranch is attacked by the Redlegs. Wales' companions take shelter in the fortified ranch house and open fire, gunning down all of Terrill's men. A wounded Wales, despite being out of ammunition, pursues the fleeing Terrill. When he corners him, Wales dry fires his four pistols through all the empty chambers while reliving the events surrounding his family's death, and remembering Terrill's involvement, before stabbing and killing Terrill with his own cavalry sword.\nAt the bar in Santa Rio, Wales finds Fletcher with two Texas Rangers. The locals at the bar, who refer to Wales as \"Mr. Wilson,\" tell the Rangers that Wales was killed in a shoot-out in Monterrey, Mexico. The Rangers accept this story and move on. Fletcher refuses to believe the story, but pretends to not recognize Wales and says that he will go to Mexico to look for Wales himself, and try to convince him that the war is over, because he owes him that. Wales says that they all died a little in the war, before riding off."}