{"mid": "TheOtherSideOfHeaven", "IMDB_id": "tt0250371", "title": "The Other Side of Heaven", "plot": "During the 1950s, John Groberg, who grew up in Idaho Falls, is called on a mission to Tonga. There he will spend three years as Elder Groberg teaching about The Church of Jesus Christ of Latter-day Saints. His first adventures are just in getting there, including a short time in a Fijian jail.\nWhen Elder Groberg does get to Tonga, he is sent to a group of remote islands. There he is partnered with a Tongan, Feki, who speaks English. But Elder Groberg finds that what he has learned of the Tongan language is severely deficient, so he studies intensely to become proficient. He also learns the culture.\nThe island's minister tells the people not to listen to the missionaries. Later, he even sends three men to beat up the missionaries. But one of them, Tomasi, had been baptized a Mormon, so Elder Groberg and Feki were spared. This man later begins coming to the meetings and is chosen by Elder Groberg to be one of his counselors to the local congregations.\nA local young woman, at the behest of her family, attempts to seduce Elder Groberg. She wants \"a half white baby.\" She eventually relents because he is saving himself for Jean, the young woman he left back home, who communicates to him through letters.\nWhile travelling at sea, Elder Groberg and his two counselors are caught in a large storm. He is washed overboard and is in fear of his life. He is later rescued and returned to Fiji.\nA hurricane hits the island. Many of the trees are stripped bare, homes are destroyed and many people are killed. The remaining leaders have people gather up what food and fresh water is available so that rationing can begin. But the supply boat takes much longer than anticipated. The inhabitants of the island begin dying of starvation and dehydration. Elder Groberg is himself close to death when the island's minister gives him the last of his food, because he is old and Elder Groberg is young. When the supply boat does arrive, the minister is found to have died. The minister is given an honorable funeral."}