{"mid": "TheOppositeOfSex", "IMDB_id": "tt0120777", "title": "The Opposite of Sex", "plot": "Sixteen-year-old Dedee Truitt (Christina Ricci) runs away from home. She is pregnant by her ex-boyfriend, Randy Cates (William Lee Scott). Not revealing her pregnancy, Dedee eventually moves in with her much older half-brother Bill (Martin Donovan), a gay teacher in a conservative, suburban community in Saint Joseph County, Indiana.\nAlthough he is living with Matt (Ivan Sergei), Bill still mourns the loss of his previous partner, Tom, who died of AIDS some time ago. Bill maintains a friendship with Tom's younger sister, Lucia (Lisa Kudrow), who idolized her brother.\nDedee seduces Matt, then tricks him into believing he has impregnated her. They elope, leaving Bill and Lucia to track them down.\nBill and Lucia find Dedee and Matt, only to discover Dedee has stolen Tom's ashes and is holding them for ransom. Randy also finds Dedee; they inform Matt that they are taking the ashes and moving away. They escape but soon get into an argument that leads to Dedee accidentally shooting Randy. She and Matt escape to Canada.\nBill eventually tracks down Matt and Dedee. Dedee goes into labor and Bill accompanies her into the delivery room. After giving birth to her son, Dedee returns Tom's ashes to Bill, apologizing for her actions in the past year.\nLucia and Bill have a falling out after Lucia implies that Tom died as a result of having gay sex. Despondent, Lucia has a one-night stand with Sheriff Carl Tippett (Lyle Lovett) who had previously made unsuccessful romantic overtures to her. Lucia soon discovers that she is pregnant.\nDedee ends up serving time in prison, leaving her son in Bill's care while she's incarcerated. After a few months, she moves back in with Bill, while Matt goes traveling, and Lucia gives birth to her own child. Eventually, Dedee decides that her son would be better off with Bill, who is now dating Dedee's parole officer, and runs away.\nDedee sarcastically concludes that sex is precisely the opposite of what people should want, leading as it does to kids, disease or, worst of all, relationships. At the end of the film, the vignettes of the various caring relationships among the characters show the opposite of superficial sexual gratification."}