{"mid": "ThePhiladelphiaStory", "IMDB_id": "tt0032904", "title": "The Philadelphia Story", "plot": "Tracy Lord (Katharine Hepburn) is the elder daughter of a wealthy Philadelphia Main Line socialite family. She was married to C.K. Dexter Haven (Cary Grant), a yacht designer and member of her social set, but divorced him two years ago, because he did not measure up to the exacting standards she sets for all her friends and family: he drank too much for her taste, and as she became critical of him, he drank more. Now she is about to marry nouveau riche \"man of the people\" George Kittredge (John Howard).\nSpy magazine publisher Sidney Kidd (Henry Daniell) is eager to cover the wedding, and assigns reporter Macaulay \"Mike\" Connor (James Stewart) and photographer Liz Imbrie (Ruth Hussey). He can get them into the affair with the assistance of Dexter Haven, who has been working for Spy in South America. Dexter will introduce them as friends of Tracy's brother Junius (a U.S. diplomat in Argentina). Tracy is not fooled, but Dexter threatens her with an innuendo-laden article about her father Seth's (John Halliday) affair with a dancer. Tracy deeply resents her father's infidelity, which has caused her parents to live separately. To protect her family's reputation, she agrees to let Mike and Liz stay.\nDexter is welcomed back with open arms by Tracy's mother Margaret (Mary Nash) and teenage sister Dinah (Virginia Weidler), much to her annoyance. In addition, she gradually discovers that Mike has admirable qualities, and she even takes the trouble to find his book of short stories in the public library. As the wedding nears, she finds herself torn between George, Dexter, and Mike.\nThe night before the wedding, Tracy gets drunk for only the second time in her life and takes an innocent midnight swim with Mike. When George sees Mike carrying an intoxicated Tracy into the house afterward, he thinks the worst. The next day, he tells her that he was shocked and feels entitled to an explanation before going ahead with the wedding. She takes exception to his lack of faith in her and breaks off the engagement. Then she realizes that all the guests have arrived and are waiting for the ceremony to begin. Mike volunteers to marry her (much to Liz's distress), but she graciously declines. She also realizes, for the first time, that she isn't perfect and shouldn't constantly condemn others for their weaknesses. At this point, Dexter offers to marry her again, and she accepts."}