{"mid": "ThePhiladelphiaExperiment", "IMDB_id": "tt0087910", "title": "The Philadelphia Experiment", "plot": "In 1943 United States Navy sailors David Herdeg (Michael Paré) and Jim Parker (Bobby Di Cicco) are assigned to the destroyer escort USS Eldridge during a project to make it invisible to radar. The ship is in Philadelphia harbor, filled with equipment from a team led by James Longstreet (Eric Christmas). During the experiment the equipment begins malfunctioning. Observers simply see the ship disappear but sailors on board experience a bizarre and disorienting phase shift. David and Jim try to shut down the generator to stop the experiment but receive severe electric shocks when they touch the equipment. The two men jump overboard to escape.\nInstead of landing in Philadelphia harbor during the daytime, David and Jim land during the night in a small desert town, which then disappears as well, leaving them in the dark open desert. They are startled by the appearance of bright light in the sky - it's a military helicopter with a spotlight looking for intruders. They escape into the desert and eventually find their way to a diner the next day.\nAn energy discharge from Jim destroys an arcade game in the diner, and the upset diner owner grabs a revolver, demanding Jim pay for the damages. David grabs the gun and the men run and carjack a car in the parking lot. Since he is unfamiliar with the automatic transmission, David takes the driver - a woman named Allison (Nancy Allen) - as a hostage and driver. They are shocked when she tells them that they are in the year 1984.\nThe police eventually catch them and Jim, who is suffering increasingly severe seizures, is hospitalized. David explains that he and Jim accidentally traveled through time, but no one believes the story. Jim eventually disappears from his hospital bed in a corona of energy. David and Allison then evade military police, who have arrived to take David into custody.\nJim was from nearby California, so David decides to try to find his family. He and Allison find the family listed in a phone book and drive to see them. Jim's former girlfriend Pamela (Louise Latham), who is now a senior citizen, immediately recognizes David from 1943. She says that the USS Eldridge had reappeared minutes after disappearing and that a lot of the sailors on board had been horribly burned. Jim had also returned and had been hospitalized for telling the truth about temporarily visiting 1984. David asks about himself and finds that he never came back, but that Pamela and Jim have been married for many years. David sees Jim in the distance riding a horse, but Jim, who had slowly come to terms with the bizarre events of 1943, refuses to come inside to speak with David. David and Allison see military police approaching, but manage to elude them. From one of their cars, David salvages documents mentioning Dr. Longstreet. Recognizing that Longstreet had been involved with the Philadelphia experiment in 1943, they decide to find him. As they spend time together, David and Allison fall in love.\nIn 1984, Dr. Longstreet has attempted to use the same technologies that were used in the original Philadelphia experiment to create a shield to protect from an ICBM attack. When the equipment was tested, a nearby town disappeared into \"hyperspace\", just like the USS Eldridge had. The scientists are unable to shut down the experiment, despite cutting the power. Worse, the experiment has left a vortex in 1984, which starts sucking matter into it. The vortex causes extremely severe weather, including tornadoes and monstrous bolts of lightning. Longstreet predicts that the vortex will continue to expand until the entire world is consumed. The scientists send a probe into the vortex and discover the Eldridge inside; the two experiments have linked together across time. They theorize that the generators on the Eldridge are providing the energy to keep the vortex open.\nDavid captures an assistant at Longstreet's home, which includes a small model of the town he saw when he first arrived. He forces the man to take them onto the base but is captured when they get off the elevator in the control center. Longstreet tells the military police to let David in and shows him the situation. He tells David that, according to surviving sailors from the Eldridge, the ship returned to Philadelphia in 1943 after David shut down the generator. Longstreet says that David must go through the vortex to the Eldridge and shut off the generator, or the vortex will destroy the Earth.\nAllison urges David not to do it, but he volunteers to go and save his ship and is outfitted with an electrically insulated suit to enable him to shut down the generator. He is catapulted into the vortex and lands on the deck of the Eldridge, where he finds the crew panicked and injured. He hurries to the generator room and smashes arrays of vacuum tubes using a firefighting axe. The generator shuts down and David looks for Jim. Assured that Jim is fine, David jumps over the side of the ship and disappears. Back in 1943, Longstreet and others watch the Eldridge reappear in Philadelphia, and long range observers note some crewmen are badly burned and others fused alive into the ship's hull.\nLikewise in 1984, the missing town reappears. Allison steals a jeep to drive to it. She finds David, they kiss passionately, and he proclaims \"I got it all figured out. The Navy owes me 40 years back pay.\""}