{"mid": "ThePelicanBrief", "IMDB_id": "tt0107798", "title": "The Pelican Brief", "plot": "The story begins with the double assassinations of two ideologically divergent Supreme Court Justices. Both murders are committed by Khamel, one of the most wanted terrorists in the world. Justice Rosenberg, a liberal, is killed at his home while the conservative Justice Jensen is killed inside a gay movie theater in Washington. The circumstances surrounding their deaths, as well as the deaths themselves, shock and confuse a politically divided nation.\nDarby Shaw, a Tulane University Law School student, conducts research on Rosenberg and Jensen's records, as well as cases pending before the Supreme Court. She suspects that the real motive might be simple greed, not politics and writes a legal brief speculating the circumstances. She shows the brief to Thomas Callahan, her law professor and lover, who in turn shows it to an FBI lawyer, Gavin Verheek. Soon afterwards Callahan is killed by a car bomb, while Darby, who witnesses his death, is contacted on the scene by some suspicious people. Afraid that she will become the next target, Darby goes on the run. She contacts Verheek and after a series of phone calls they agree to meet personally, but Khamel murders Verheek and impersonates him when they meet. He is just about to kill Darby when he is shot by an unknown perpetrator and Darby manages to escape again.\nMeanwhile, Gray Grantham, a reporter for the Washington Post is contacted by an anonymous lawyer who calls himself \"Garcia.\" He claims that he might have seen something in his office that is related to the assassination of the two justices, but he is unsure if he should tell it, as he is afraid of some of his co-workers who probably suspect he knows something. He eventually backs off without revealing any details.\nDarby also decides to contact Grantham and shows him her findings. She thinks that the assassinations were committed on behalf of Victor Mattiece, an oil tycoon with a pre-existing business relationship with the President of the United States, who seeks to drill on Louisiana marshland which is a major habitat of an endangered species of pelican. A court case on appeal, filed on Mattiece's behalf to gain access to the land, is expected to make its way to the Supreme Court. The two slain justices had a history of environmentalism — their only common view — and thus Darby surmises that Mattiece hoped to turn the case in his favor by eliminating them, thus leaving the president in a position to appoint new justices more likely to rule in his favor. Grantham believes her story and sets out to help her prove that the Pelican Brief is correct.\nMeanwhile, the president and his Chief of Staff, Fletcher Coal, try to cover up the White House's connection to Mattiece, afraid that it might endanger the president's re-election the next year. The president orders FBI chief F. Denton Voyles to temporarily stop working on the Pelican Brief and asks the more trusted CIA head Bob Gminski to conduct the investigation instead. They also send an agent to Mattiece to find out whether the statements in the brief are true, but Mattiece, who became practically insane in the past years, has the agent killed.\nDarby and Grantham eventually manage to track down Curtis Morgan, aka \"Garcia,\" an employee of the White and Blazevich law firm which worked for Mattiece, only to find out that he died some days before, seemingly in a street accident. They manage to contact his widow who tells them that her husband hired a new bank safe a few days before his death. In the safe, they find Morgan's written and videotaped testimony, which reveals that some time before the justices' assassination, he accidentally had a look at an internal correspondence in the office and reached the conclusion that some of his co-workers were involved in the murders. Although there is no direct proof that he has seen it, he was afraid that he himself might be killed and decided to record his testimony.\nWith the evidence, Grantham and Darby approach the Post's chief editor. Voyles also appears in the editorial office and reveals that he has a tape recording of the conversation with the president ordering to stop working on the Pelican Brief, which he would make public if necessary, and that the CIA agents were investigating Mattiece and one of them killed Khamel to save Darby's life. He also arranges a plane for Darby to flee the country.\nThe story prominently appears in the Post's next day edition, despite the objections from White and Blazevich and the president himself. One of the involved lawyers commits suicide. The president will not run for re-election next year. Mattiece disappears. Darby settles on an island in the Caribbean and is joined by Grantham, who agrees to stay for at least a month."}