{"mid": "ThePebbleAndThePenguin", "IMDB_id": "tt0114108", "title": "The Pebble and the Penguin", "plot": "Hubie, a shy, gullible, but kindhearted penguin, is in love with the female penguin Marina, but he lacks self-confidence leading him to be bullied by the much more impressive, but the vain and cruel Drake, who also wants Marina, but clearly for lust. One night, Hubie and Marina manage to confirm how they feel for each other, but Hubie cannot quite find a perfect pebble to propose to Marina with. He wishes on a star to make his dream come true and he receives an emerald from the sky. Ecstatic, Hubie rushes to find Marina but is thwarted by Drake, who demands Hubie to give him the pebble. When Hubie refuses, Drake throws him into the water. Hubie narrowly escapes from a leopard seal and climbs onto a piece of ice where he is swept away from Antarctica.\nHubie is picked up by humans and caged on their ship called \"Misery\", transports penguins to a zoo and meets a tough, grumpy, streetwise and somewhat arrogant but good-hearted rockhopper penguin named Rocko (James Belushi). After seeing in a vision Marina having a dilemma, Hubie decides to escape with Rocko and flees, before laying low on a beach. Rocko reluctantly tells Hubie about his desire to fly and live in tropical climate. He convinces him to help him return to Antarctica by making up a lie about a flying penguin named Waldo. They have a short fight after Rocko tries to fly off \"an authentic, ancient aviarial airstrip\" and another after Rocko saved Hubie from a killer whale. Back in Antarctica, Drake begins to threaten Marina for her hand in mating. If Marina refuses, she will be forced to leave, as it goes against tradition. Hubie and Rocko attempt to depart, but Rocko discovers Hubie lied to him and attempts to attack Hubie, but soon starts laughing, praising Hubie's determination to get back to Marina. Back in Antarctica, Marina becomes worried about Hubie. Hubie and Rocko run into the hungry and persistent leopard seal but are able to escape it. With that they become true friends (though it takes prodding from Hubie for Rocko to admit it). Their joy is short-lived as three killer whales attack them causing Hubie's pebble to get lost in the scuffle and Rocko to go missing, leaving Hubie to think he perished.\nDisheartened, Hubie continues on alone to face Drake and defeats him in a fight. Rocko, who survives the killer whale attack, finds Hubie and Marina at Drake's tower. As Hubie makes a proposal to Marina and gains her acceptance, Drake returns to finish the three off. Hubie, Rocko, and Marina dodge the giant boulder which lethally crushes Drake in his collapsing tower. During the escape, Rocko's dream for flight comes true as he flies himself, Hubie, and Marina to safety. Rocko hands Hubie his pebble. He presents it to Marina, who loves it, but loves Hubie more. Rocko remains in Antarctica with Hubie and Marina, and sometime later, he teaches their children how to fly."}