{"mid": "ThePostman", "IMDB_id": "tt0119925", "title": "The Postman", "plot": "Despite the post-apocalyptic scenario and several action sequences, the book is largely about civilization and symbols. Each of the three sections deals with a different symbol.\nThe first is the Postman himself, Gordon Krantz, who takes the uniform solely for warmth after he loses everything but his sleeping clothes. He wanders without establishing himself anywhere and performs scenes from William Shakespeare plays for supplies. Originally a student at the University of Minnesota, he has traveled west to Oregon in the aftermath of the worldwide chaos that resulted from several EMPs, the destruction of major cities, and the release of bioweapons. Taking shelter in a long-abandoned postal van, he finds a sack of mail and takes it to a nearby community to barter for food and shelter. His initial assertions to be a real postman build not because of a deliberate fraud (at least initially) but because people are desperate to believe in him and the Restored United States.\nLater, in the second section, he encounters a community, Corvallis, Oregon, which is led by Cyclops, who is apparently a sentient artificial intelligence created at Oregon State University which miraculously survived the cataclysm. In reality, however, the machine ceased functioning during a battle, and a group of scientists maintain the pretense of its working to try to keep hope, order, and knowledge alive.\nEventually, in the third section, as the Postman joins forces with Cyclops's scientists in a war against an influx of \"hypersurvivalist militia\", the Postman begins to find that the hypersurvivalists are being pressed from Oregon's Rogue River area to the south as well. The hypersurvivalists are more commonly referred to as Holnists, after their founder, Nathan Holn (many times through the book, curses are uttered that damn Holn for his actions). Nathan Holn was an author who championed a virulently violent, misogynistic, and hypersurvivalist society. Holn himself is said to have been executed sometime before the events in the novel, but in the time following what should have been a brief period of civil disorder, Holn's followers prevented the United States from recovering from the war and the plagues that followed.\nAs the story comes to a climax, the Postman allies with a tough tribal group made up of descendents of ranchers, loggers and Native Americans from Southwestern Oregon's Umpqua Valley region who are led by a Native American who is a special forces veteran. The Umpqua people have developed a warrior culture very similar to Native Americans of the Old West and are bitter enemies of the Holnists; they have defeated the Holnists at every turn but until the Postman's arrival, they were not inclined to help the \"weak\" townsfolk of the Willamette Valley against the Holnists. At the end of the novel the Postman discovers the Holnists have another organized enemy to the South. The Holnists' southern enemy is a bit of a mystery, and the Postman is able to identify this Holnist enemy only by the symbol they rally behind: the Bear Flag. The final scenes of the novel give the impression that the groups (symbols) may come together in an effort to revive civilization.\nAnother message of the plot deals with the backstory of the post-apocalyptic world: specifically, that it was not the electronics-destroying EMPs, the destruction of major cities, or the release of various bio-engineered plagues that actually destroyed society, but rather it was the Holnists themselves, who preyed on humanitarian workers and other symbols of civilization."}