{"mid": "ThePhantomPlanet", "IMDB_id": "tt0055294", "title": "The Phantom Planet", "plot": "In 1980 the United States Air Force's Space Exploration Wing has bases on the Moon and is on the eve of a mission to Mars. When another of their two-member crew Pegasus spacecraft mysteriously disappears, rumors begin circulating of \"space monsters\" and \"phantom planets\". Mars mission pilot Captain Frank Chapman and his navigator Lt. Ray Makonnen are ordered to investigate.\nDuring the search, their spaceship suffers damage from a meteor shower, requiring that both men go outside to make repairs. A bullet-sized particle, however, pierces the air hose on Chapman's space suit, rendering him unconscious. Makonnen is able to repair the hose, but as he opens the airlock hatch, he is fatally struck by a similar particle. Makonnen's last act before being propelled away into deep space is to push Chapman inside and close the airlock hatch. Chapman comes to and finds Makonnen gone and himself unable to communicate with the lunar base. He records a log entry about the preceding events, noting that he must now make a forced landing on an asteroid, that it is somehow pulling in his Pegasus spaceship.\nExiting his ship but still feeling the effects of his accident, Chapman collapses and sees tiny humanoids about six inches tall approaching. Once his helmet visor is opened, he is able to breathe but shrinks to their size due to the asteroid's atmosphere. He is dragged underground and placed on trial for attacking one of the small aliens.\nSesom, the aged and wise ruler of Rheton (the native name for the rocky and seemingly lifeless planetoid that Chapman has landed on), explains that though his craft was brought safely down by their gravitational tractor beam, they had not been able to do same with the preceding crafts which were destroyed with their crew when they crashed into their surface. He then tells the angry Chapman that although as a result of his sentence he will now have all the rights of a citizen of Rheton, he can never leave and his ship has been sent back into space whilst he slept so that the secret of Rheton's existence and more importantly of the gravity-controlling technology that allows them to fly their wandering world through space will be preserved.\nAt the trial, Chapman meets two beautiful women, Sesom's smugly spoiled blond daughter Liara and the mute and gentle black-haired Zetha, with the former more than willing to answer his many questions about Rheton, and Sesom informs Chapman that he may later choose one of the women to marry once he has become accustomed to life on Rheton.\nLiara, after following and engaging constantly with Chapman, declares her love for him, but Chapman, still eager to return to his own people, rejects her. Herron, a young man who is himself in love with Liara, attempts to win her for himself by telling Sesom that Chapman is unfairly attempting to win the favors of both the women.\nStating that he believes this to be a crime against the people of Rheton, Herron requests a duel to the death with Chapman. Chapman agrees, and the two engage in a form of combat where opponents must push each other onto gravity plates that cause immediate disintegration if touched. Just as Chapman is about to push Herron onto a plate, he lets Herron go, stating that he cannot kill someone for no good reason.\nAs time goes on, Chapman and Zetha become more acquainted and eventually fall in love. Herron comes to Chapman late one night and tells him that he can help him escape.\nAny plans for the future, however, are put on hold when Chapman discovers the real reason for Rheton's erratic course through the cosmos is when the planetoid is once again attacked by the Solarites, a monstrous alien race of \"fire people\" from an unidentified \"sun satellite\" who want to destroy Rheton with their flaming fighter craft and steal its secret of gravity control.\nWith Chapman's help, Sesom and Herron are able to destroy the Solarite fleet with their gravity beam, but a giant seven inch tall Solarite prisoner from a previous raid escapes when the gravity curtain containing him fails during the battle, and stalking the cave corridors, it captures Zetha who had been traumatized into silence by a childhood encounter with its strange and savage species. After Sesom is attacked by the bizarre bug-eyed monster, Chapman and Herron attempt to rescue Zetha, and Chapman defeats the Solarite by pushing it onto a gravity plate.\nWhile kidnapped, Zetha is scared out of her muteness when she sees Chapman about to be attacked by the Solarite and can now speak again, allowing her to confess her love for him. The two kiss, but they are interrupted as it is revealed that a search party from Earth had located Chapman. In order to preserve the secret of his adopted people, Chapman re-dons his spacesuit and, after once more being exposed to normal air, returns to normal size and reluctantly heads back to Earth with the search party, leaving Rheton and Zetha behind."}