{"mid": "ThePhantomOfTheOpera", "IMDB_id": "tt0086101", "title": "The Phantom of the Opera", "plot": "=== Prologue ===\nOn the stage of the fictional Opéra Populaire in 1905, an auction of old theatrical props is underway. Lot 665, purchased by the elderly Raoul, Vicomte de Chagny, is a papier-mâché music box in the shape of a barrel organ attached to the figure of a monkey in Persian robes playing the cymbals. He eyes it sadly, noting that its details appear \"exactly as she said\". Lot 666 is a shattered chandelier that, the auctioneer explains, has a connection to \"the strange affair of the Phantom of the Opera, a mystery never fully explained\". As the chandelier is uncovered, its lamps flicker to life and it magically rises over the audience to its original position in the rafters. As it ascends, the years roll back and the Opéra returns to its 1880s grandeur. (\"Overture\")\n=== Act I ===\nIt is now 1881. As Carlotta, the Opéra's resident soprano prima donna, rehearses for the evening's performance, a backdrop collapses without warning. \"The Phantom! He's here!\" whisper anxious cast members. The Opera's new owners, Firmin and André, try to downplay the incident, but Carlotta refuses to continue and storms offstage. Madame Giry, the Opéra's ballet mistress, tells Firmin and André that Christine Daaé, a Swedish chorus girl and orphaned daughter of a prominent violinist, has been \"well taught\" and could sing Carlotta's role. With cancellation of the performance their only alternative, the owners reluctantly audition Christine, and to their surprise she is equal to the challenge. (\"Think of Me\")\nBackstage after her triumphant début, Christine confesses to her best friend Meg (Madame Giry's daughter) that she knows her mysterious teacher only as an invisible \"Angel of Music\" (\"Angel of Music\"). The Opera's new patron, Raoul, the Vicomte de Chagny, finds Christine, his old childhood playmate, in her dressing room. (\"Little Lotte\") Christine reminisces with Raoul about the \"Angel of Music\" stories that her late father used to tell them and confides that the Angel has visited her and taught her to sing. Raoul laughs at her \"fantasies\" and invites her to dinner. He exits and a jealous Phantom appears in Christine's mirror in the guise of The Angel of Music. (\"The Mirror/Angel of Music (Reprise)\") Christine begs him to reveal himself and The Phantom obliges, pulling her through the mirror and into his underground realm. (\"The Phantom of the Opera\") They cross a subterranean lake to his secret lair beneath the opéra house. The Phantom explains that he has chosen Christine to sing his music and enchants her with his own sublime voice. (\"The Music of the Night\") Christine sees a mannequin resembling herself in a wedding dress, and when the mannequin suddenly moves, she faints. The Phantom picks her up and places her gently on a bed.\nAs the Phantom composes music at his organ, Christine awakens to the sound of the monkey music box. (\"I Remember\") She slips behind the Phantom, lifts his mask, and beholds his real face. The Phantom rails at her curiosity, then ruefully expresses his longing to look normal—and to be loved by her (\"Stranger Than You Dreamt It\").\nMeanwhile, Joseph Buquet, the Opéra's chief stagehand—who, like Madame Giry, inexplicably knows much about the Phantom—regales everyone with tales of the \"Opéra Ghost\" and his terrible Punjab lasso. (\"Magical Lasso\") Madame Giry warns Buquet to exercise restraint. In the managers' office, Madame Giry delivers a note from the Phantom: He demands that Christine replace Carlotta in the new opera, Il Muto, or there will be a terrible disaster \"beyond imagination\". (\"Notes\") Firmin and André assure an enraged Carlotta that she will remain the star; (\"Prima Donna\") but during her performance, (\"Poor Fool, He Makes Me Laugh\") the Phantom reduces her voice to a frog-like croak, forcing her to withdraw. A ballet interlude ensues to keep the audience entertained as Christine prepares to replace Carlotta. Suddenly the corpse of Buquet, hanging from the Punjab lasso, drops from the rafters. Firmin and André plead for calm as the Phantom's diabolical laughter is heard.\nIn the ensuing mêlée, Christine escapes with Raoul to the roof, where she tells him about her subterranean rendezvous with the Phantom. Raoul is sceptical, (\"Why Have You Brought Me Here?/Raoul, I've Been There\") but swears to love and to protect her always, and Christine reciprocates his love. (\"All I Ask of You\") The Phantom, who has overheard their entire conversation, is heartbroken. He angrily vows revenge against Raoul (\"All I Ask of You (Reprise)\") and, in a fit of rage, sends the Opéra's mighty chandelier crashing to the stage as the curtain falls.\n=== Act II ===\nSix months later, in the midst of the gala masquerade ball, the Phantom, costumed as the Red Death, makes his first appearance since the chandelier disaster. (\"Masquerade/Why So Silent?\") He announces to the stunned guests that he has written an opera entitled Don Juan Triumphant. He demands that it be produced immediately, with Christine (who is now engaged to Raoul) in the lead role, and warns of dire consequences if it is not. He seizes Christine's engagement ring and vanishes in a flash of fire and smoke. Raoul demands that Madame Giry tell him about the Phantom. She reluctantly replies that he is a brilliant musician and magician born with a terrifyingly deformed face, who escaped from captivity in a travelling freak show and disappeared.\nDuring rehearsals, Raoul hatches a plan to use Don Juan Triumphant as a trap to capture the Phantom, knowing the Phantom will be sure to attend its première. (\"Notes/Twisted Every Way\") Christine, torn between her love for Raoul and her gratitude for the Phantom's teaching, visits her father's grave, longing for his guidance. (\"Wishing You Were Somehow Here Again\") The Phantom appears, again under the guise of the Angel of Music. (\"Wandering Child\") Christine nearly falls under his spell, but Raoul arrives to rescue her. The Phantom taunts Raoul, launching fiery missiles at him, (\"Bravo Monsieur\") until Christine begs Raoul to leave with her. Furious, the Phantom sets fire to the cemetery.\nDon Juan Triumphant opens with Christine and Ubaldo Piangi, the Opéra's principal tenor, singing the lead roles. (\"Don Juan\") During their duet, Christine realises that she is singing not with Piangi, but with the Phantom himself. (\"The Point of No Return\") When he expresses his love for her and gives her his ring, Christine rips off his mask, exposing his deformed face to the shocked audience. As Piangi is found strangled to death backstage, the Phantom seizes Christine and flees the theatre. An angry mob led by Meg searches the theatre for the Phantom, while Madame Giry directs Raoul to the Phantom's subterranean lair, and warns him to beware his Punjab lasso.\nWhen Raoul arrives at the lair, Christine is wearing the mannequin's wedding dress. (\"Down Once More/Track Down This Murderer\") The Phantom ambushes Raoul and binds him with his lasso. He tells Christine that he will free Raoul if she agrees to stay with him forever; if she refuses, Raoul will die. (\"Final Lair\") Christine responds that it is the Phantom's soul that people fear, not his face, and kisses him. The Phantom, at last, understands that he cannot compel Christine to love him, and releases them both. Christine returns the Phantom's ring, bids him farewell, and exits with Raoul. The Phantom, weeping, huddles on his throne and covers himself with his cape. The mob storms the lair and Meg pulls away the cape—but the Phantom has vanished; only his mask remains."}