{"mid": "ThePeopleUnderTheStairs", "IMDB_id": "tt0105121", "title": "The People Under the Stairs", "plot": "Poindexter \"Fool\" Williams is a resident of a Los Angeles ghetto. He and his family are being evicted from their apartment by their landlords, the Robesons. The Robesons, who are believed to be a married couple, call themselves Mommy and Daddy. They have a daughter named Alice.\nLeroy, his associate Spencer, and Fool break into the Robeson's household by using Spencer to pose as a municipal worker. The Robesons leave the home shortly but Spencer doesn't return. Fool and Leroy break into the house to look for Spencer, and they find his dead body and a large group of strange, pale children in a locked pen in a dungeon-like basement.\nThe Robesons return and Fool flees while Leroy is shot to death by Daddy. Fool runs into another section of the house, where he meets Alice. She tells him that the people under the stairs were children who broke the \"see/hear/speak no evil\" rules of the Robeson household. The children have degenerated into cannibalism to survive and Alice has avoided this fate by obeying the rules without question. A boy named Roach whose tongue was removed also evades the Robesons by hiding in the walls.\nFool is discovered by Daddy and is thrown to the cannibalistic children to die. However, Roach helps Fool escape, but is critically wounded. As he dies, he gives Fool a small bag of gold coins and a written plea to save Alice. Fool reunites with Alice and the two escape into the passageways between the walls. Daddy releases his dog Prince into the walls to kill them. Fool tricks Daddy into stabbing Prince and he and Alice reach the attic where they find an open window above a pond. Unfortunately, Alice is too afraid to jump and Fool is forced to go without her. He promises to return for Alice.\nFool finds out the gold he has is enough to pay his rent and for his mother's surgery. He also finds out that Mommy and Daddy are a brother and sister coming from a long line of crazy inbred family members. They started out as a family that ran a funeral home selling cheap coffins for expensive prices, then they got into real estate. After they made a lot of money, the family got greedy, and the greedier they got the crazier they got. Fool vows to help right the wrong. He reports the Robesons to child welfare and as the police are investigating the house, Fool sneaks back in and reveals to Alice that she is not their daughter; she was stolen from her birth parents, as were all the other children in the basement.\nMommy finds out that Alice knows the truth and believes that Fool has turned her against them, so she attempts to kill Alice. However, the cannibal children charge at Mommy. Daddy finds Fool at the vault, where Fool sets off explosives, which demolishes the house and causes the money to blow up through the crematorium chimney and into the crowd of people outside. Daddy is killed in the explosion and Alice and Fool reunite in the basement. Meanwhile, the people outside claim the money distributed by the blast, and the freed children venture into the night."}