{"mid": "ThePetrifiedForest", "IMDB_id": "tt0028096", "title": "The Petrified Forest", "plot": "In the midst of the Great Depression, Alan Squier (Howard), once a respected British writer, now a disillusioned, penniless drifter, wanders into a roadside diner in the remote town of Black Mesa, Arizona, at the edge of the Petrified Forest. The diner is run by Jason Maple (Porter Hall), his daughter Gabrielle (Davis), and Gramp, Jason's father (Charley Grapewin), who regales anyone who will listen with stories of his adventures in the Old West with such characters as Billy the Kid.\nGabrielle's mother, a French war bride who fell in love with Jason when he was a young, handsome American serviceman, left her \"dull defeated man\" after the war and moved back to France when Gabrielle was a baby. She now sends poetry to Gabrielle, who dreams of moving to Bourges, where her parents first met, to become an artist. Alan tells his story—how he wrote one novel, then lived in France for eight years with his publisher's wife, trying to write another—and Gabrielle is instantly smitten with him.\nGabrielle shows Alan her paintings—the first time she has shown them to anyone—and reads him a favorite François Villon poem. Boze Hertzlinger (Dick Foran), a beefy diner employee who has wooed Gabrielle in vain, grows jealous of Alan, who decides to leave forthwith. He mooches a ride from wealthy tourists Mr. and Mrs. Chisholm (Paul Harvey and Genevieve Tobin); but after only a few minutes on the road they encounter Duke Mantee (Bogart), a notorious gangster fleeing a massive police pursuit, whose car has broken down. Duke and his gang seize the Chisholms' car and drive to the diner, where Duke has arranged to rendezvous with his girlfriend, Doris, on their way to Mexico. Alan, the Chisholms, and their chauffeur (John Alexander) soon make their way back to the diner as well.\nAlan, indifferent to the hostage situation, engages Duke in lively conversation and toasts him as \"the last great apostle of rugged individualism.\" Boze snatches a rifle and gets the drop on Duke, but during a momentary distraction Duke draws his pistol and shoots Boze in the hand, regaining control. Duke learns that Doris has been captured, and has revealed their rendezvous location to the police. As police and federal agents converge on the diner, Duke prepares to flee, announcing that he will take Mr. and Mrs. Chisholm with him.\nInspired by Boze's act of courage, Alan has an inspiration: While Gabrielle is in the back room bandaging Boze's hand, he produces a life insurance policy from his bag and amends it, making Gabrielle the beneficiary. Then he asks Duke to kill him (\"It couldn't make any difference to you, Duke ... they can hang you only once ...\"), so that Gabrielle can use the insurance money to realize her dream of moving to France. Duke obliges, then leaves with his human shields. Alan dies in Gabrielle's arms, secure in the knowledge that she, unlike the rest, will escape her dead-end existence to pursue her dreams."}