{"mid": "ThePalmBeachStory", "IMDB_id": "tt0035169", "title": "The Palm Beach Story", "plot": "This story begins with the wedding of Gerry (Claudette Colbert) and Tom Jeffers (Joel McCrea), and the wedding follows with the caption, \"And they lived happily ever after... or did they?\" Time then flashes forward about four years to the Jeffers apartment where the Wienie King (Robert Dudley) is touring the Jeffers apartment as a likely rental because the Jeffers aren't able to make their bills. While the Wienie King and his wife tour the apartment, an embarrassed Gerry hides in closets and the bathroom, ducking away from touring eyes. The Wienie King happens upon Gerry hiding in the bathtub behind a shower curtain and takes an immediate liking to her so much that he decides not to take her apartment and gives Gerry $700 to pay her bills.Meantime, Tom is meeting with a hopeful investor to discuss his idea of building an airport that stretches over the city. The investor doesn't seem very keen on Tom's idea. When Tom gets home and finds out that Gerry has taken money from a stranger, he's upset. Gerry calms him down, but then suggests that they get a divorce because she feels as a single woman she can get him the money he needs to build his airport.Gerry takes Tom out to dinner with the last 14 dollars they have after she finished paying the bills that day, and they both get pretty drunk. When they get home, Gerry is still discussing divorce, but discussions stop as Tom helps Gerry remove her dress.The next morning, Gerry packs her suitcase and writes Tom a good-bye letter. She tries to pin the letter to the blanket but accidentally pokes Tom waking him up. Tom chases Gerry to the streets, but a penniless Gerry manages to get away in a taxi and thanks to the kindness of strangers, in this case the members of the Ale and Quail Club, she manages to get a ticket and a private car on a train to Palm Beach. The Ale and Quail Club get a bit drunk and decide to shoot up their train car, so Gerry sneaks away for some peace. She climbs into a berth which happens to be the berth above the berth of millionaire John D.Hackensacker III (Rudy Vallee) who comes to Gerry's rescue with loads of clothes, jewelry, etc., after Gerry loses her belongings due to the fact that the Ale and Quail Club train car has been disconnected from the train and abandoned. Gerry and John decide to abandon the train themselves and take John's yacht to Palm Beach.As this is happening Tom meets the Wienie King who has decided to take a different apartment in the building. The Wienie King gives Tom money to catch a plane to Palm Beach to stop Gerry from getting a divorce. When Tom meets the train, he finds out that Gerry has dumped the train for a yacht. Tom then waits for Gerry at the dock. Tom then meets John and John's sister the Princess Centimillia (Mary Astor) who takes an immediately liking to Tom. Gerry introduces Tom to everyone as her brother, and a slightly disagreeable Tom goes along with this plan solely to get time to convince Gerry to come to her senses.Gerry talks John into investing in Tom's airport. The Princess wants to marry Tom and John wants to marry Gerry. In the end, Gerry and Tom realize that they love each other and can't divorce. They both confess to the Princess and John. John decides to invest in Tom's airport anyway even though he loves Gerry. John then says, \"If only you had a sister.\" Gerry says, \"I do. A twin sister.\" As they express surprise over this revelation, Tom further reveals that he also has a twin brother. The movie then ends with Gerry and Tom standing side by side at the wedding of their twin siblings to the respective Hackensacker siblings where the movie ends as it begins, \"And they lived happily ever after... or did they?\""}