{"mid": "ThePurgeElectionYear", "IMDB_id": "tt4094724", "title": "The Purge: Election Year", "plot": "In 2022, a masked purger taunts a young woman (Christy Coco) and her entire family. He then tells them they are going to play one final Purge game, called \"Mommy's Choice.\" When she refuses, the man moves slowly towards the family as they struggle.\nIn 2040, two days before the Purge, riots break out all over Washington, D.C., claiming that the totalitarian New Founding Fathers are using the Purge to help their economic agenda. The events make a great effect on the upcoming Presidential election. Charlie Roan (Elizabeth Mitchell), a Senator, is gaining ground over the NFFA's candidate, Minister Edwidge Owens (Kyle Secor). It is revealed that she is the young woman from the beginning, and that she alone was spared by the masked purger. The NFFA, headed by Caleb Warrens (Raymond J. Barry), view Roan as a threat to their rule and plan to use the upcoming Purge to eliminate her from play. Meanwhile, Roan and Owens attend a debate and, while Owens states how America's crime rates are lowering, Roan gets a standing ovation after she declares the Purge only serves to eliminate the poor and benefit the rich and powerful, after which she then breaks security protocol, by stepping into the audience. At a convenience store, owner and proprietor Joe Dixon (Mykelti Williamson), his assistant Marcos (Joseph Julian Soria), and their friend EMT Laney Rucker (Betty Gabriel), watch the coverage on television.\nOn March 20, the day before the Purge, the NFFA revokes the Purge rule that protects government officials with a 10 ranking, appearing to attempt to regain public favor, but the move is actually a front for an attempt to kill Roan. That same day, Joe and Laney confront a teenage shoplifter named Kimmy (Brittany Mirabile) and her friend (Juani Feliz), who relent because Laney used to be queen badass of the neighborhood. Later, an enraged Joe discovers that his Purge insurance premium has been raised beyond his affordability, prompting him to stake out and guard his store. Roan decides to wait out the Purge from her unsecured home in order to secure the popular vote of the common people. Her head of security, former police sergeant Leo Barnes (Frank Grillo), initially disagrees with the idea, but accepts her reasons. He then revamps security and has Roan's house re-secured with new barricades and surrounded by secret service agents and SWAT snipers standing watch outside, with his partners Chief Couper (Ethan Phillips) and Eric Busmalis (Adam Cantor) as well as three more secret service agents partly supervising the event from indoors. Meanwhile, a group of South African tourists at Dulles Airport are interviewed by a news anchor wherein their response is to join the Purge. News of airports across America flooding with more tourists traveling to the United States to witness or join the Purge make the press dub them as \"Murder Tourists.\"\nAfter Purge Night commences, Joe and Marcos repel an attack by the teenage shoplifters, injuring Kimmy. Laney and her partner Dawn (Liza Colón-Zayas) patrol the city in a heavily modified ambulance, rendering medical care to the wounded. Roan and Barnes are betrayed by Couper and Busmalis, who signal a Neo-Nazi paramilitary force led by Earl Danzinger (Terry Serpico) and secretly let them into the household, having killed all the secret service agents and SWAT snipers. As the troops assassinate the three remaining secret service agents, Barnes manages to get Roan to safety, but is wounded in the process. He detonates a bomb in the house, killing Couper, Busmalis, and a few troops. Navigating through the hostile streets of Washington D.C. to seek safer shelter, Roan and Barnes are ambushed and taken captive by a group of Russian Murder Tourists. While the group taunts them, Marcos spots the commotion, prompting him and Joe to leave the store's roof and rescue the duo. They shoot the group dead, and take Barnes and Roan to Joe's store. Roan converses with the two while Marcos tries to tend to Barnes' wound. As Barnes and Joe get into a light argument, Marcos then witnesses the teenage shoplifters returning in two groups, causing Joe to call Laney and Dawn for backup, who cannot respond immediately as they are treating a teenage boy named Rondo (Jared Kemp). As Barnes, Roan, Joe, and Marcos prepare to defend themselves, Laney and Dawn arrive and run over Kimmy and her friend with their ambulance. Laney then guns down the other shoplifters before finishing off a heavily wounded Kimmy with a point-blank headshot. The group then leave the store for a safer hideout.\nWith all seven safe in the ambulance, the group is ambushed by a helicopter piloted by Danzinger, who ends up killing Rondo. The surviving six then seek refuge underneath a highway overpass wherein Barnes deduces they were found because the bullet in his chest is a tracker. After he extracts the bullet, the group is confronted by members of the Crips, but when Joe gives the gang's trademark whistle call \"(revealing that he was once their member),\" the Crips calm down. Their leader asks the group to tend to his heavily injured \"boy,\" to which the group agrees. In return for the group's actions, the Crips plant the bullet in another area to trick the paramilitary forces after telling the former to leave. When two of Danzinger's ground team members find the bullet, the Crips emerge from hiding and eliminate them.\nBarnes, Roan, Joe, Laney, Dawn, and Marcos are led to a hideout beneath a hospital protected by anti-Purge rebels led by Dwayne Bishop (Edwin Hodge) where volunteer doctors and nurses administer to wounded Purge victims while other professionals supply food, water, and medicines. Joe, Marcos, and Laney decide to go back to the store, but are forced to turn back after spotting several NFFA death squad trucks heading to the hideout, prompting Laney to report to Dawn. Meanwhile, Roan discovers the rebels are planning to assassinate Owens and tries to dissuade them, as she wants to win the election fairly. They are forced to flee as Dawn alerts the entire hideout of death squad forces arriving. Barnes and Roan survive the hostile alleyways, and they meet up again with the ambulance. However, before the group can escape the city, the ambulance is rammed by Danzinger, and Roan is captured.\nThe senator is delivered alongside a drug addict named Lawrence by Danzinger to an NFFA-captured Catholic cathedral where Owens presides over a midnight Purge mass, while Barnes and the others give chase. The group meets up with Bishop and his team wherein they formulate a plan to rescue Roan by infiltrating the cathedral through a tunnel system. Meanwhile, at the cathedral, Owens has his friend Harmon James (Christopher James Baker), another NFFA loyalist, stab Lawrence as a cleansing ritual for his longtime vice. As he invites the high-ranking members of the NFFA to the altar to sacrifice Roan with Warrens to lead them in the purging, the group and Bishop's team both reach the cathedral wherein Barnes and his team stealthily eliminate the NFFA Secret Service Agents and take position in the choir loft.\nAs Warrens begins to slit Roan's throat, Marcos assassinates him from the choir loft, instigating a chaos that signals Bishop's team to invade the cathedral. As the entire congregation begins to disperse and flee in panic, the group fires into the fleeing crowd, killing a vast number of them and leaving only a few, including Owens and James, to escape. A second horde of NFFA secret service agents attempts to eliminate the group but are gunned down by Bishop's team. After the rebels untie Roan, the group heads to the cathedral's crypt to find Owens. Bishop captures Owens and contemplates killing him, to the protests of Roan and Barnes, while Owens goads him on to kill him. Bishop refrains, realizing that killing Owens would be taking part in the Purge and would make him no better. As Barnes knocks Owens unconscious with Joe watching, the group also discovers a large number of bound and gagged Purge mass sacrifice victims that Owens had stashed in the crypt.\nBishop and his men decide to secure transport to leave the cathedral while Barnes, Roan, Joe, Laney, and Marcos attempt to untie the captives. However, they are soon ambushed by Danzinger and his mercenaries, leaving the rebel team killed and Bishop wounded. Barnes rushes out to help him, leaving Roan in the care of Laney and company. Bishop manages to dispatch the remaining mercenaries, but is fatally gunned down by Danzinger. Seeing this, Barnes engages Danzinger in a vicious melee combat wherein the former gains the upper hand, killing the latter. As Roan frees some of the last of Owens' imprisoned victims, James emerges from hiding and fires at the group, killing one of the newly freed victims. After incapacitating Laney and wounding Marcos, he targets Roan, but Joe steps in and engages in a furious crossfire with James, finally killing him with a headshot. Before succumbing to his injuries, Joe urges Roan to win the election and tells Marcos and Laney to take care of his store.\nOn May 26, two months after the Purge, Roan defeats Owens in the presidency by a landslide while Barnes is promoted to head of Secret Service while continuing his service as her chief of security. Marcos and Laney renovate the store and continue to run it in Joe's honor while they watch the news of Roan's victory, and another report indicating that outlawing the Purge has become Roan's top priority. Further reports state that many NFFA supporters have reacted to the election results with violent protests in the streets as Marcos looks at an American flag hanging outside the store."}