{"mid": "TheProducers", "IMDB_id": "tt0395251", "title": "The Producers", "plot": "=== Act I ===\nIn New York in 1959, theatre producer Max Bialystock opens \"Funny Boy\", a musical version of Hamlet (\"Opening Night\"). It is terrible, and the show closes after one performance. Max, who was once called the King of Broadway, tells a crowd of down-and-outs of his past achievements and vows to return to form (\"King of Broadway\").\nThe next day, Leo Bloom, a mousy accountant, comes to Max's office to audit his books. When one of Max's little old lady \"investors\" arrives, Max tells Leo to wait in the bathroom until she leaves. She plays a sex game with Max, who eventually persuades her to give him a check to be invested in his next play, to be called \"Cash\". Leo reveals his lifelong dream: he's always wanted to be a Broadway producer. After a panic attack when Max touches his blue blanket, Leo tells Max that he has found an accounting error in his books: Max raised $100,000 for \"Funny Boy\", but the play only cost $98,000. Max begs Leo to cook the books to hide the discrepancy. Leo reluctantly agrees. After some calculations, he realizes that \"under the right circumstances, a producer could actually make more money with a flop than he can with a hit. ... You could've raised a million dollars, put on your $100,000 flop, and kept the rest!\" Max proposes a scheme:\nHowever, Leo refuses to help Max with his scheme (\"We Can Do It\"). When he arrives at work six minutes late, Leo's horrid boss, Mr. Marks, reminds him that he is a nobody. While he and his miserable co-workers slave over accounts, Leo daydreams of becoming a Broadway producer (\"I Wanna Be a Producer\"). He realizes that his job is terrible, quits, and returns to Max (\"We Can Do It\" (reprise)). The next day, they look for the worst play ever written. Max finds a sure-fire flop that would offend people of all races, creeds and religions: Springtime for Hitler: A Gay Romp with Adolf and Eva at Berchtesgaden, written by Franz Liebkind, which Max describes as \"a love letter to Hitler\". They go to the playwright's home in Greenwich Village to get the rights to the play. Ex-Nazi Franz is on the roof of his tenement with his pigeons reminiscing about the grand old days (\"In Old Bavaria\"). The producers get him to sign their contract by joining him in singing Adolf Hitler's favourite tune (\"Der Guten Tag Hop Clop\") and reciting the Siegfried Oath, under penalty of death, promising never to dishonor \"the spirit and the memory of Adolf Elizabeth Hitler\".\nNext, they go to the townhouse of flamboyant homosexual Roger De Bris, the worst director in New York. At first, Roger and his \"common law-assistant\" Carmen Ghia decline the offer to direct because of the serious subject matter (\"Keep It Gay\"). After much persuading and invoking the possibility of a Tony award, Roger agrees and tells them the second act must be rewritten so the Germans win World War II. Max and Leo return to the office to meet a Swedish bombshell who wants to audition for their next play: Ulla Inga Hansen Benson Yansen Tallen Hallen Svaden Swanson. She auditions for them (\"When You've Got It, Flaunt It\"). The producers are impressed, mostly by her beauty, and hire her to be their \"secretary-slash-receptionist\". Max leaves to raise two million dollars for \"Springtime for Hitler\" by calling on all the little old ladies in New York (\"Along Came Bialy\"), which he does (\"Act I Finale\").\n=== Act II ===\nLeo and Ulla are left alone in Max's office (redecorated by Ulla), and they start to fall in love (\"That Face\"). Max walks in and sees the perfect form of Ulla's covered behind (\"That Face\" (reprise)).\nAt the auditions for the title role, Hitler, one terrible actor after another is rejected by Roger in summary fashion. Finally, Franz performs his own jazzy rendition of \"Haben Sie Gehört Das Deutsche Band?\", at the end of which Max stands up and shouts, \"That's our Hitler!\". Opening night arrives (\"It's Bad Luck to Say 'Good Luck' on Opening Night\"), and Franz falls down the stairs and breaks his leg. Roger is the only one who knows the part of Hitler, and he rushes to the dressing room to get ready. The curtain rises, and Max and Leo watch the theatrical disaster unfold (\"Springtime for Hitler\"). Unfortunately, Roger's performance is so camp and outrageous, the audience mistakes it for satire, and the show becomes the talk of the town. Back at the office, Max and Leo are near-suicidal (\"Where Did We Go Right?\"). Roger and Carmen come to congratulate them, only to find them fighting. Franz bursts in, waving a pistol, outraged by Roger's portrayal of his beloved Führer. Cowardly Max suggests that he shoot the actors, not the producers. The police hear the commotion and arrest Franz, who breaks his other leg trying to escape. They also arrest Max and take the accounting books. Leo hides; Ulla finds him and persuades him to take the two million dollars and run off to Rio with her.\nIn jail awaiting trial, Max receives a postcard from Leo and, feeling betrayed, recounts the whole show including the intermission (\"Betrayed\"). At his trial, Max is found \"incredibly guilty\"; but the now-married Leo and Ulla arrive to tell the judge that Max is a good man who has never hurt anyone despite his swindling (\"'Till Him\"). The judge is touched by this and decides not to separate the partners, sending both (plus Franz) to Sing Sing prison for five years. In prison, they write a new musical entitled Prisoners of Love, which goes to Broadway (\"Prisoners of Love\") (starring Roger and Ulla), and they are pardoned by the Governor. Leo and Max become the kings of Broadway and walk off into the sunset (\"Leo & Max\"). Everyone comes back for one last song, telling the audience that they have to leave (\"Goodbye\").\n=== Differences between the 1968 film and stage musical ===\nAlthough the musical includes many scenes and jokes taken from the film, there are many differences. The film was set in the present day of its year of release, 1968. The musical is set in 1959; consequently the character Lorenzo St. Dubois (LSD), a hippie who played Hitler, was omitted from the 2001 musical. In the original film, Max and Leo seek to procure $1,000,000; in the musical it has become $2,000,000. Ulla has a much larger role in the musical and is more than just the vapid actress of the movie. Franz Liebkind is portrayed more sympathetically and comes to a happier ending than his 1968 counterpart. Overall, the musical is more upbeat than the original film, which was a darker comedy."}