{"mid": "TheProfessionals", "IMDB_id": "tt0060862", "title": "The Professionals", "plot": "During the Mexican Revolution, Rancher J.W. Grant hires four men, who are all experts in their respective fields, to rescue his kidnapped wife, Maria from Jesus Raza, a former revolutionary leader-turned-bandit.\nHenry \"Rico\" Fardan is a weapons specialist, Bill Dolworth is an explosives expert, the horse wrangler is Hans Ehrengard, and Jake Sharp is a traditional Apache scout, skilled with a bow and arrow. Fardan and Dolworth, having both fought under the command of Pancho Villa, have a high regard for Raza as a soldier. But as cynical professionals, they have no qualms about killing him now.\nAfter crossing the Mexican border, the team tracks the bandits to their hideout. They witness soldiers on a government train being massacred by Raza's small army. The professionals follow the captured train to the end of the line and retake it from the bandits. Some move on to the bandit camp and observe Raza and his followers—including a female soldier, Chiquita. At nightfall, Fardan infiltrates Raza's private quarters but he is stopped from killing him by Maria, the kidnapped wife. Dolworth concludes, \"we've been had.\"\nFardan escapes with Grant's wife. Back at the train, they find that it has been retaken by the bandits. After a shootout, they retreat into the mountains, pursued by Raza and his men. The professionals evade capture by using explosives to bring down the walls of a gully, thus blocking the bandits' path and delaying their pursuit. It is then revealed that they had not rescued Grant's kidnapped wife but Raza's willing mistress. Grant \"bought\" Maria for an arranged marriage only for her to escape and return to her \"true love\" in Mexico.\nAs Raza and his bandits pursue the retreating professionals, Dolworth fights a rearguard action to allow the other professionals to escape with Maria. In the battle, Raza is wounded. As he and Chiquita attempt to escape, she is shot by Dolworth. Weakened, Raza is captured by Dolworth.\nThe professionals, with Maria and Raza, reach the U.S. border to be met by Grant and his own men. Grant tells Fardan that their contract has been satisfactorily concluded, even before Maria is safely handed over to him. As Maria tends the wounded Raza, Grant says to one of his men, \"Kill him.\" Before the man can fire, the gun is shot out of his hand by Dolworth. The professionals step in to protect Maria and Raza. They collect the wounded Raza, put him on a carriage and, with Maria at the reins, send both back to Mexico.\nGrant calls Fardan a bastard, to which Fardan retorts: \"Yes, sir, in my case an accident of birth. But you, sir, you are a self-made man.\" The professionals follow the departing carriage to Mexico."}