{"mid": "ThePlayersClub", "IMDB_id": "tt0119905", "title": "The Players Club", "plot": "Diana Armstrong (LisaRaye) arrives at the scene of the raunchy, dysfunctional Players Club. She narrates that she used to work at the club and had begun when she moved out of her parents home after an argument with her father, as she was pregnant with her son. Diana ends up working at a shoe store, when she meets Ronnie (Chrystale Wilson) and Tricks (Adele Givens), who work for Dolla Bill (Bernie Mac) at The Players Club. They convince Diana she would make better money stripping, by saying, \"Use what you got to get what you want.\"\nDolla Bill gives Diana a job, giving her the name Diamond. Everything is fine until four years into the game her younger lost-minded cousin Ebony Armstrong (Monica Calhoun) comes to live with her. After listening to Dolla's rendition of \"The Strippin' Game\", she starts working at the club.\nEbony is soon out of control, excessively drinking, staying out all night and influenced more and more by Ronnie and Tricks, who encourage Ebony to do more out-of-club parties for groups of men. Diana tries to warn Ebony to stay away from \"those two\" and quit doing house parties, but Ebony declines being told what to do, choosing to ignore Diana's advice. After the heated confrontation, Diana has a flashback of a time when she was at a private party with Ronnie and Tricks, the men at the private party offers to pay Ronnie to perform cunnilingus on Diamond who has passed out on the bed drunk, Ronnie accepts the offer and proceeds to assault Diamond, the flashback encourages Diana to protect Ebony.\nMeanwhile, Dolla Bill gets confronted by a man who works for St. Louis, a drug lord to whom Dolla Bill owes $60,000. He warns Dolla Bill if he doesn't make a payment of $10,000 to St. Louis, he will hunt him down. That same night, St. Louis comes to his club to collect. Little Man, who is the doorman of the club, tells St. Louis that Dolla Bill is not at the club and they leave. The next day as Dolla Bill tries to leave the club, he gets confronted by St. Louis' men, Brooklyn (Charlie Murphy) and KC (Terrence Howard). They beat him unconscious and throw him into the back of his car. Luckily for him, they are stopped by Freeman (John Amos) and Peters (Faizon Love), two crooked cops. Dolla Bill is found in the trunk and is arrested on warrants.\nThe following night when rapper Luther \"Luke\" Campbell comes to the strip club, two of Louis's watchmen, Reggie (Ice Cube) and Clyde (Alex Thomas) are discussing about him. When Dolla Bill, who was bailed out of jail and returned to his club, is notified that Luke is at his club he alerts the strippers via a money alarm and believes he will gain a fortune profit. Clyde tries to meet Luke but his bodyguard (Michael Clarke Duncan) informs Clyde that Luke is trying to relax and not meet with fans. Clyde insults the bodyguard causing him to hit Clyde in the back of his head as he leaves, leaving him unconscious. In retaliation, Reggie beats down the bodyguard and belligerently fights against Luke and his friends, only for him to be defeated and thrown into a glass window. The dazed Reggie opens fire wildly before being knocked out by the bouncer XL (Tiny Lister).\nFurther tension develops between Ebony and Diana when Diana returns home one night after fleeing her obsessive customer Myrin, who admitted to stalking her and then tried to force entry to her apartment, to find Ebony in bed with her boyfriend Lance. Diana chases Lance out with her gun, shooting at him several times. Diana threatens and taunts Ebony. When Diana feigns leaving, Ebony is hit when she opens the door and is thrown out the apartment.\nDiana then begins dating Blue (Jamie Foxx), a DJ at the Player's Club. Meanwhile, Ebony is offered a gig to dance at Ronnie's brother Junior's (Samuel Monroe Jr.) bachelor party, under the pretense from Ronnie that other girls from the club will be dancing there as well (In actuality, Ronnie lied to use her as a way out of stripping for her brother's friends at the party so Ebony can strip for them instead). When Ebony realizes that she will be the only woman in a hotel room full of horny men, she desperately tries calling Diana to come and pick her up, but to no avail.\nReggie and Clyde, both feeling insulted by Diana and Ebony from a previous encounter, lie to Junior that Ebony will have sex with him, claiming that they \"ran a train\" on her. Excited, Junior bursts in on Ebony while she is changing. Ebony resists, prompting Junior to brutally beat and rape her, leaving his friends to listen to it in full disgust and disbelief. Soon, Reggie, Clyde and the other guests leave, wanting no further involvement with Junior. When Ronnie discovers Ebony unconscious, she and Junior flee the hotel room as she scolds him. Later, Diana has a change of heart and she and Blue decide to check up on Ebony at the hotel, only to discover her bloodied and unconscious body on the bed.\nFurious, Diana grabs her gun and goes to the Players Club, where Ronnie and Tricks are hiding out. After scaring the other strippers away by firing a warning shot, Diana gives the gun to Blue to cover her while she gets into a brutal fistfight with Ronnie, leaving Ronnie badly beaten. She quits in front of Dolla Bill, punches Tricks and leaves along with Blue.\nRonnie and Tricks are arrested by the police on charges of the rape of Ebony, and Junior had been arrested moments before. Later that night, Diana's timing proves to be perfect when St. Louis, comes to collect. He personally shoots up the club (though he does give warning to the customers beforehand, allowing them to leave). As he desperately tries to escape, Dolla is captured by Reggie, Clyde, and St. Louis' associate, whom Dolla Bill met earlier. Later, St. Louis has Brooklyn destroy the club with a LAW rocket.\nEbony, still sporting the bruises from her rape, now has a job working at the shoe store. Having been berated by two strippers who work at a new club, called Club Sugar Daddy's, with the same slogan that influenced her to strip, she firmly stands her ground. In the end, Diamond narrates that Ebony moved back to Tallahassee, FL to be with her mother. Blue is a top DJ at a radio station, and that he and Diamond are moving further in their relationship. Ronnie and Tricks got jobs at Club Sugar Daddy's after their release from jail. Junior is serving time in prison for raping Ebony, and that he never got married. Reggie and Clyde were last seen at the Freaknik in Atlanta. St. Louis is still \"running the South\" along with his hired guns, Brooklyn and KC. Peters and Freeman are still harassing people all day. Little Man is managing an different strip club in Chicago. Dolla Bill was never heard from again (Notwithstanding, it can be safely assumed that he was murdered by St. Louis' men for his debts as he was last seen being stuffed into the trunk of their car). Diana is now a successful reporter, putting the past behind for good and move onto a perfect normal life with her son and now boyfriend, Blue."}