{"mid": "ThePrideOfTheYankees", "IMDB_id": "tt0035211", "title": "The Pride of the Yankees", "plot": "Lou Gehrig (Cooper) is a young Columbia University student whose old-fashioned mother (Elsa Janssen) wants him to study hard and become an engineer. But the young man has a gift for baseball. A sportswriter (Brennan) befriends Gehrig and persuades a scout to come see him play. Before long Gehrig signs with the team he has always revered, the New York Yankees. With the help of his father (Ludwig Stössel), he endeavors to keep his career change a secret from his mother.\nGehrig works his way up through the minor leagues and joins the Yankees. His hero, Babe Ruth, is at first condescending and dismissive of the rookie, but his strong, consistent play wins over Ruth and the rest of the team. Gehrig is soon joining teammates in playing pranks on Ruth on the team train.\nDuring a game at Comiskey Park, Gehrig trips over a stack of bats and is teased by a spectator, Eleanor (Wright), who laughingly calls him \"tanglefoot\". Later, they are properly introduced, leading to a relationship, and then an engagement. Gehrig's mother, who still hasn't accepted the fact that her son will not be an engineer, does not take this news well; but Gehrig finally stands up to her and marries Eleanor.\nThe Yankees become the most dominant team in baseball, and Gehrig becomes a fan favorite. His father and fully converted mother attend games and cheer for him. In a re-creation of a famous (and possibly apocryphal) story, Gehrig visits a crippled boy named Billy (Gene Collins) in a hospital. He promises to hit two home runs in a single World Series game in the boy's honor—then fulfills his promise.\nGehrig is now the \"Iron Horse\", a national hero at the peak of his career with multitudes of fans, many loyal friends, and an adoring wife. Then he begins to notice, with growing alarm, that his strength is slowly ebbing away. Though he continues to play, and extends his consecutive-game streak to a seemingly insurmountable record, his physical condition continues its inexorable decline. One day, in Detroit, he tells Yankees manager Joe McCarthy (Harry Harvey) that he has become a detriment to the team and benches himself. After an examination, a doctor gives him the awful news: Gehrig has a rare, incurable disease, and only a short time to live.\nA year later, at Lou Gehrig Day at Yankee Stadium, an older Billy (David Holt) finds Gehrig and shows him that he has made a full recovery, inspired by his hero's example and the two-homer fulfilled promise. Then, as Eleanor weeps softly in the stands, Gehrig addresses the fans: \"People all say that I've had a bad break. But today ... today, I consider myself the luckiest man on the face of the Earth.\""}