{"mid": "ThePuppetMasters", "IMDB_id": "tt0111003", "title": "The Puppet Masters", "plot": "In the summer of 2007 Earth is under clandestine attack. Slug-like creatures, arriving in flying saucers, are attaching themselves to people's backs, taking control of their victims' nervous systems, and manipulating those people as puppets. The Old Man, the head of clandestine national security agency called the Section, goes to Des Moines, Iowa, with Sam and Mary, two of his best agents, to investigate a flying saucer report, but much more seriously the ominous disappearance of the six agents sent previously. They discover that the slugs are steadily taking over Des Moines, but they cannot convince the President to declare an emergency.\nSam takes two other agents and returns to Des Moines to get more evidence of the invasion. They fail and are obliged to leave the city quickly, but in the confusion of their fleeing the city's television center a slug sneaks onto one of the agents. Back in Washington the team discovers the slug and captures it, but later it escapes and attaches itself to Sam, using Sam's skills and knowledge to make a clean escape.\nThoroughly puppetized, Sam begins to infiltrate more slugs into the city, using the Constitution Club as a recruiting center. The Old Man captures him, takes him to Section's new headquarters, and interrogates the slug through Sam. Under drug-induced hypnosis Sam reveals that the slugs come from Titan, the sixth moon of Saturn. After recuperating from his ordeal, Sam finds that the President and Congress are ready to accept the idea that the United States has been infiltrated and they mandate a law that requires people to go naked to demonstrate that they are not carrying slugs.\nAs the army prepares a counter-attack in the most heavily infested areas, Sam goes alone to Kansas City to get an estimate of the number of slugs involved. There he learns that he can kill a slug by crushing it with his hand. He also discovers that the slugs reproduce through fission. Escaping from the city, he returns to Washington too late to stop the counter-attack, which fails.\nAfter a short leave, during which they get married and kill a slug that seems to have been targeting Sam for repossession, Sam and Mary return to work. Together with the Old Man, they go to Pass Christian, Mississippi to inspect a flying saucer that had made a bad landing. Inside the alien ship Mary is overwhelmed by repressed memories from the time she was a child on Venus and had been possessed by a slug. The slug had died from Nine-day Fever but Mary, luckily, had survived the disease.\nAdopting biological warfare, the authorities culture Nine-day Fever and its cure in bulk sufficient to cover the country, and then infected slugs are allowed to escape into the heavily infested areas. Several days later thousands of medics are landed in those areas to give the cure to those people whose slugs have died. Sam and the Old Man join the effort in Jefferson City, Missouri, but the Old Man is possessed by the last healthy slug in the city and he knocks Sam out.\nSam regains consciousness in an air-car that the Old Man is flying to the Yucatán, where the slug intends to restart its effort to conquer Humanity. With the car on autopilot, the Old Man slumps over the steering wheel and the slug begins to fission so that it can possess both the Old Man and Sam. In desperation, Sam kicks the controls, causing the air-car to accelerate so sharply that the Old Man is slammed back against the seat forcefully enough to crush the slug. The air-car's emergency system mitigates the resulting crash and Sam and the Old Man wait to be rescued.\nSome years later Sam and Mary board a spaceship headed for Saturn on a mission to exterminate the slugs."}