{"mid": "ThePrinceAndTheShowgirl", "IMDB_id": "tt0050861", "title": "The Prince and the Showgirl", "plot": "The film is set in London in June 1911. George V will be crowned king on 22 June and in the preceding days many important dignitaries arrive. Among those arriving are the 16-year-old King Nicholas VIII of Carpathia, with his Prince Regent father, Charles (Laurence Olivier), a secondary Prince of Hungary and widower of the Queen of Carpathia.\nThe British government realises that keeping Balkan country Carpathia in the Triple Entente is critical during the rising tensions in Europe. They find it necessary to pamper the royals during their stay in London, and thus civil servant Northbrook (Richard Wattis), is detached to their service. Northbrook decides to take the Prince Regent out to the musical performance The Coconut Girl. During the intermission the Prince Regent is taken backstage to meet the cast. He is particularly uninterested in engaging with the male actors and extremely interested in the physical charms of Elsie Marina (Marilyn Monroe), one of the performers, and sends a formal written invitation for her to meet him at the Carpathian embassy for supper.\nElsie arrives at the embassy and is soon joined by the Prince Regent, a stiff and pompous man. She expects a large party but quickly realises the Prince's true intentions – to seduce her over a private supper. She is persuaded not to leave early by Northbrook, who promises to provide an excuse for her to escape after supper. The Prince Regent turns his back on her during the supper, taking phone calls and addressing matters of state. He then makes a clumsy pass at her, to which she is accustomed and immediately rebuffs. She pointedly explains how inept he is and that she had hoped the Prince was going to sway her with romance, passion and \"gypsy violins\". The Prince changes his style and tactics, complete with a violinist. The two eventually kiss and Elsie admits she may be falling in love, rebuffing Northbrook's promised feint to help her leave the embassy. Elsie then passes out from the many drinks she consumed before, during and after her semi-solitary supper. The Prince places her in an adjoining bedroom to stay the night.\nThe following day, Elsie overhears a conversation concerning the young Nicolas' plotting with the German embassy to overthrow his father. Promising not to tell, Elsie then meets the Dowager Queen (Sybil Thorndike), the Prince's mother-in-law, who decides Elsie should join them for the coronation in place of her sick lady-in-waiting. The ceremony passes and Elsie refuses to tell the Prince Regent details of the treasonous plot. Nicholas then invites her to the Coronation Ball, where she persuades Nicholas to draw up a contract in which he confesses his and the Germans' intent, but only if the Prince agrees to a general election. The Prince is impressed and realises that he has fallen in love with Elsie. The morning after the Coronation Ball, Elsie irons out the differences between father and son. Her honesty and sincerity have inspired the Prince to finally show sincere love to his son.\nThe next day, the Carpathians must leave to return home. The Prince Regent had planned to have Elsie join them. In eighteen months' time, his regency will be over and he will be a free citizen. She reminds him that that is also the length of her music-hall contract. They both realise that much can happen in eighteen months and say goodbye. The ending is ambiguous, left up to the viewer to decide if they will meet again."}