{"mid": "ThePublicEnemy", "IMDB_id": "tt0022286", "title": "The Public Enemy", "plot": "As youngsters in 1900's Chicago, Tom Powers (James Cagney) and his lifelong friend Matt Doyle (Edward Woods) engage in petty theft, selling their loot to \"Putty Nose\" (Murray Kinnell). Putty Nose persuades them to join his gang on a fur warehouse robbery, assuring them he will take care of them if anything goes wrong. When Tom is startled by a stuffed bear, he shoots it, alerting the police, who kill gang member Larry Dalton. Chased by a cop, Tom and Matt have to gun him down. However, when they go to Putty Nose for help, they find he has left town.\nTom's straightlaced older brother Mike (Donald Cook) tries, but fails, to talk Tom into giving up crime. Tom keeps his activities secret from his doting mother (Beryl Mercer). When America enters World War I in 1917, Mike enlists in the Marines.\nIn 1920, with Prohibition about to go into effect, Paddy Ryan (Robert Emmett O'Connor) recruits Tom and Matt as beer \"salesmen\" (enforcers) in his bootlegging business. He allies himself with noted gangster Samuel \"Nails\" Nathan (Leslie Fenton). As the bootlegging business becomes ever more lucrative, Tom and Matt flaunt their wealth.\nMike finds out that his brother's money comes not from politics, as Tom claims, but from bootlegging, and declares that Tom's success is based on nothing more than \"beer and blood\" (the title of the book upon which the film is based). Tom retorts in disgust: \"Your hands ain't so clean. You killed and liked it. You didn't get them medals for holding hands with them Germans.\"\nTom and Matt acquire girlfriends, Kitty (an uncredited Mae Clarke) and Mamie (Joan Blondell) respectively. Tom eventually tires of Kitty; in a famous scene, when she complains once too often, he angrily pushes half a grapefruit into her face. He then drops her for Gwen Allen (Jean Harlow), a woman with a self-confessed weakness for bad men. At a restaurant on the night of Matt's wedding reception to Mamie, Tom and Matt recognize Putty Nose and follow him home. Begging for his life, Putty plays a song on the piano that he had entertained Tom and Matt with when they were kids. Tom shoots him in the back.\nTom gives his mother a large wad of money, but Mike rejects the gift. Tom tears up the banknotes and throws them in his brother's face. \"Nails\" Nathan dies in a horse riding accident, prompting Tom to find the horse and shoot it. A rival gang headed by \"Schemer\" Burns takes advantage of the disarray resulting from Nathan's death, precipitating a gang war.\nLater, Matt is gunned down in public, with Tom narrowly escaping the same fate. Furious, Tom takes it upon himself to single-handedly settle scores with Burns and some of his men. Tom is seriously wounded in the shootout, and ends up in the hospital. When his mother, brother, and Matt's sister Molly come to see him, he reconciles with Mike and agrees to reform. However, Paddy warns Mike that Tom has been kidnapped by the Burns mob from the hospital. Later, his dead body is returned to the Powers home."}