{"mid": "TheQuatermassXperiment", "IMDB_id": "tt0049646", "title": "The Quatermass Xperiment", "plot": "The British Rocket Group, headed by the taciturn Professor Bernard Quatermass, launches its first manned rocket into space. Shortly thereafter, all contact is lost with the rocket and its three crew: Carroon, Reichenheim, and Green. The large rocket later returns to earth, crashing into an English country field. Quatermass and his assistant Marsh arrive at the scene, along with the local emergency services, Carroon's wife Judith, Rocket Group physician Dr. Briscoe, and Blake, a Ministry official who chides him repeatedly for launching the rocket on impulse and without official permission. Finally opening the rocket's access hatch, the space-suited Carroon stumbles outside; inside, there is no sign of the other two crew members. Carroon is in shock, only able to say the words \"Help me\". Inside the rocket, Quatermass and Marsh can find no sign of the other two crewmen, only their completely-fastened spacesuits.\nCarroon is taken to Briscoe's office for care, on the grounds that conventional hospitals and doctors would have no idea how to evaluate or treat the world's first returned astronaut suffering from some sort of adverse event while in space. But even with Briscoe's care, Carroon remains mute, generally immobile, but alert with his eyes which now have a feral and cunning aspect. Briscoe also discovers a strangely disfigured place on his shoulder, and notices changes in his face which suggest some sort of mutation of the underlying bone structure. Meanwhile, Scotland Yard Inspector Lomax has undertaken investigation of the other two men's disappearance and, having surreptitiously fingerprinted Carroon as a suspect, alerts Quatermass that the prints resemble those of nothing human.\nAt Judith's insistence that Briscoe is not helping her husband, Quatermass agrees to have Carroon transferred to a regular hospital, under guard. Meanwhile, Marsh has developed film from a camera that was aboard the rocket, and Quatermass, Lomax and Briscoe have a viewing. The crew is seen for a time pleasantly at their duties; then suddenly, something seems to jar the ship. After that, there is a nightmarish wavering in the air inside the rocket, and the men react as if something frightening, yet not manifestly visible, is there in the cabin with them. One by one they fall, Carroon the last to go.\nQuatermass and Briscoe determine from the evidence at hand that something living in outer space has entered the ship, dissolved Reichenheim and Green in their sealed spacesuits, and evidently entered Carroon's body, which is now in the process of being changed by this unknown entity. Not knowing any of this, Carroon's wife, Judith, hires a private investigator, Christie, to break her husband out of the secured hospital. The escape is successful, but not before Carroon smashes a potted cactus in his hospital room, fuses it into his flesh, then kills the private investigator and absorbs all the forces of life in his body, leaving just a shrivelled husk. It does not take long for Judith to discover what is happening to her husband; Carroon flees and disappears into the London night, leaving her screaming outside the hospital, alive, unharmed, but entirely mad from fright.\nInspector Lomax then initiates a manhunt for the missing Carroon. After hiding out on a river barge, Carroon encounters a little girl, leaving her also unharmed through sheer force of willpower. Then, Carroon proceeds to a nearby pharmacy and kills the chemist, using his now-swollen, crusty, cactus-thorn-riddled hand and arm as a cudgel and leaving a twisted empty husk of the man to be found by police. Quatermass theorizes that Carroon has used select chemicals taken from the shelves to \"speed up a change going on inside of him\". That night finds Carroon at a zoo, barely visible amongst some shadowed bushes with far less of his human form remaining. In the morning, twisted corpses of zoo animals are found, their life forces having all been absorbed, and a trail of slime leading back out into the community. Among the bushes, Quatermass and Briscoe also find a small but living remnant of what was once Victor Carroon, and take it back to their laboratory. From his examination of this remnant, Quatermass concludes that some kind of alien life has completely taken over and will eventually release reproduction spores, endangering the entire planet\nThe remnant eventually dies of starvation, locked in a glass cage. On a tip to police from Rosie Wrigley, a vagrant tippler, Lomax and his men track the main mutation to Westminster Abbey, where it has crawled high up on a metal work scaffolding inside. It now is a gigantic shapeless mass of combined animal and plant tissue with eyes, distended nodules, and tentacle-like fronds filled with spores. Quatermass arrives, arranges for electric cables being used by a BBC company, filming in the Abbey, to be attached to the scaffolding. By having all the power in London diverted through the cables and into the scaffolding, Quatermass succeeds in cremating the Carroon-creature by electrocution, just as it has entered the final phase before release of its spores.\nThe threat eliminated, Quatermass quickly walks out of the Abbey, preoccupied by his thoughts. He ignores all who ask questions. Marsh, his assistant, approaches and asks \"What are we going to do?\" Never breaking stride, Quatermass offhandedly replies, \"We're going to start again.\" He leaves Marsh behind, walking into the London night, and a second manned rocket roars into space."}