{"mid": "TheRoadToWellville", "IMDB_id": "tt0111001", "title": "The Road to Wellville", "plot": "The book's plot details three narratives which take place between November 1907 and late May 1908 in John Harvey Kellogg's Battle Creek, Michigan sanitarium. The first thread concerns Will and Eleanor Lightbody. Eleanor, a fan of Dr. Kellogg, drags Will to Kellogg's sanitarium. Will has recently suffered stomach pains and is still recovering from bouts of alcohol and drug addiction—the latter at the hands of his wife. Eleanor suffered a brutal miscarriage, which has left her physically weak. Hoping to improve his marriage, Will goes along but is constantly filled with doubts about Kellogg's health methods. While he takes part in the therapy, he gags at health food, does not enjoy the laughing therapy, and watches as his friend Homer Praetz is electrocuted during a sinusoidal bath. Meanwhile, his wife Eleanor finds too much enjoyment at the sanitarium, especially at the hands of Dr. Spitzvogel, a doctor who practices Die Handhabung Therapeutik—or in common parlance, erotic massage.\nCharlie Ossining, a peripatetic merchant attempts to market a new type of cereal, Per-Fo, with a partner Bender, whose slick and untrustworthy behavior disarms him. They join forces with George Kellogg, adopted son of John Harvey Kellogg, who has had a falling out with his father and seeks revenge. George agrees to use his name on Per-Fo in the hopes the cereal will be bought out by the Kellogg's Company.\nJohn Harvey Kellogg, a doctor fond of health food and what would now be called alternative medicine, inserts himself into the life of each character, whether as health guru to Eleanor, competitor to Charlie and Bender, or torturer of Will. His attempts at untested health cures, such as radium treatments, are comically tragic. As the sanitarium unravels, and son George becomes increasingly angry, father and \"master of all\" John must assert his control and keep his institution afloat."}