{"mid": "TheRover", "IMDB_id": "tt2345737", "title": "The Rover", "plot": "10 years after a global economic collapse that caused worldwide turmoil, the Australian outback is a lawless wasteland, crime and poverty are common and small military units patrol the outback attempting to maintain what little law and order is left. After a robbery gone wrong, Archie (David Field), Caleb (Tawanda Manyimo) and Henry (Scoot McNairy) flee, leaving behind Henry's injured brother Rey (Robert Pattinson). While driving away, Archie mocks Rey and Henry attacks him, causing Caleb to crash the truck in which they were riding. When they cannot manoeuvre the truck out of debris, they abandon it, and Archie steals the car belonging to mysterious loner Eric (Guy Pearce). Eric manages to free the truck and follows them. After a brief chase, Archie stops and Eric confronts them. When Eric tries to attack Archie, Henry knocks him unconscious with a shotgun.\nEric wakes up and drives the truck into town, where he wanders into several establishments, asking if they have seen the men. He goes to an opium den, where he finds a dwarf and two Chinese acrobats from a traveling circus in the backroom. Eric follows the dwarf to his trailer, where he offers Eric a gun for US$300. Eric doesn't have $300, so he abruptly shoots the dwarf in the head and leaves with a gun. After another confrontation with the opium den's owner, he walks back to his truck and finds Rey, who asks why he is in Henry's car. Eric asks Rey where Henry is, but Rey faints.\nAfter seeking help from a shopkeeper, Eric takes Rey to a doctor (Susan Prior), who performs surgery on him. The doctor cares for abandoned dogs, which seems to interest Eric. The next day, Eric sees two vehicles approaching in the distance, senses threat, and takes the doctor's rifle. The occupants of the vehicles turn out to be the traveling circus members seeking revenge for Eric's murder of the dwarf. They kill the doctor's companion without warning when he comes out to investigate. Eric opens fire and kills the acrobats. Eric then leaves with Rey.\nEric and Rey stay at a motel in an almost-abandoned town. While Eric is away from the room, Rey loads a revolver, then sees an Army vehicle driving down the street. He takes cover behind a bed and hears someone attempting to enter the room from outside. He shoots through the door and is shocked to find he has killed the daughter of the motel's owner. He is then shot at by a soldier (Nash Edgerton). Eric comes to the rescue, killing the soldier and driving Rey and himself away.\nWhile camping near an abandoned mine, Eric is arrested by a soldier (Anthony Hayes). At a small Army base nearby, he learns he is being transported to Sydney. Eric tells the soldier that after finding his wife with another man, he killed them both; he is angry that the authorities seemed not to notice or care. The soldier ignores him. Rey breaks into the area, kills the two soldiers outside, then the soldier who was processing Eric. Eric and Rey escape.\nEric and Rey arrive at the town where Henry and the gang are hiding. They find Eric's car outside a house and break in. Eric holds Archie and Caleb at gunpoint, while Rey goes to confront Henry. After an argument, they shoot at each other; Rey misses, but Henry shoots Rey in the throat. Eric kills Archie and Caleb, before walking into Henry's room and finding Rey's corpse. He shoots Henry in the chest and burns the bodies. Later, Eric pulls to the side of the road in his car. It is revealed that he was obsessed with finding the car because his dog's corpse was in the trunk. The film ends with Eric preparing to bury the dog in the desert."}