{"mid": "TheReturnOfTheMusketeers", "IMDB_id": "tt0098194", "title": "The Return of the Musketeers", "plot": "Twenty years after the events of The Four Musketeers, Cardinal Mazarin has imprisoned the Duke of Beaufort. Mazarin hires d'Artagnan to bring together Athos, Porthos, and Aramis, to work for him. Porthos accepts, but Athos and Aramis decline. By this time, Athos has a son named Raoul.\nMilady de Winter's daughter, Justine, questions the headsman that the musketeers hired to kill her mother. After finding out from the headsman that \"Comte de la Fere\" hired him, she kills the headsman. Raoul happens upon the aftermath of this event and chases after Justine, who is disguised as a priest. After a swordfight, when he discovers who she really is and her plan, Raoul leaves and tells d'Artagnan, Porthos, and Athos that Justine wants to kill them.\nComte de Rochefort helps Beaufort escape from his prison, and he is subsequently arrested by Mazarin. Mazarin sends d'Artagnan and Porthos after Beaufort, but Beaufort escapes them due to interference from Athos and Aramis, who are working for Beaufort. This starts a fight amongst the Musketeers, in which d'Artagnan slices Aramis' hand. Aramis breaks his sword and rides away. d'Artagnan and Porthos are fired by Mazarin for not catching Beaufort.\nRochefort goes into hiding until he finds Justine, and tells her the names of d'Artagnan, Porthos, and Aramis, revealing to her that the Comte de la Fere is Athos.\nKing Charles I of England is to be executed, so Queen Anne of Austria sends d'Artagnan, Athos, Porthos, and Raoul to rescue him. They attempt a rescue by knocking out the headsman, but Justine takes his place and executes Charles.\nThe musketeers have several encounters with Justine: in one, Raoul's true allegiance is revealed to her; in another, Justine and Rochefort attempt to kill the Musketeers by blowing up their ship (the Musketeers escape and Rochefort is killed by his own bomb).\nJustine attempts to kill King Louis XIV, but is stopped by the Musketeers, and their battle concludes with Justine jumping out of the window into the water. Aramis rejoins the musketeers, and they force Mazarin to sign several forms in favour of them, including making Porthos a baron, Aramis a bishop, and Raoul being commissioned into the Guards. The film ends with the Musketeers riding together again."}