{"mid": "TheReplacementKillers", "IMDB_id": "tt0120008", "title": "The Replacement Killers", "plot": "During an orchestrated drug bust at a marine loading dock, Detective Stan Zedkov (Michael Rooker) kills Triad lieutenant Peter Wei (Yau-Gene Chan). Looking to exact revenge for his son's death, crime boss Terence Wei (Kenneth Tsang) sends for professional assassin John Lee (Chow Yun-fat). Paying off an old debt, Lee has already killed two targets for Wei, and the crime boss tells him that this third and final job will settle the obligation. However, Lee's conscience prevents him from completing his final assignment: to murder Zedkov's seven-year-old son Stevie (Andrew J. Marton) before the detective's eyes. Realizing that his actions will result in retaliation against his mother and sister, Lee prepares to return to China, enlisting the help of old friend Alan Chan, a monk in a local Buddhist temple, to make arrangements to have his family moved to a secure location. Infuriated by Lee's disobedience, Wei orders his head lieutenant, Michael Kogan (Jürgen Prochnow), to lead the hunt for Lee, and has his people in China begin the search for Lee's family.\nNo longer able to use the Triad network to get out of the country, Lee searches for alternative means outside Wei's sphere of influence, and looks to skilled forger Meg Coburn (Mira Sorvino) for a new passport. Before she can finish the job, Wei's men storm her office, destroying the computerized tools of her trade in the ensuing shootout. Lee escapes; Coburn is picked up by the police, unsuccessfully interrogated by Zedkov, and released as bait so the detective can see who comes after her. Meanwhile, Wei hires skilled out-of-town replacement killers to take over the hunt for Lee and the Zedkov contract.\nLee finds Coburn when she returns to her destroyed office. Having been made aware that the Triads are involved, Coburn wants out, but Lee forces her to finish her original task of creating a forged passport. Traveling with Coburn, with the two replacement killers, Ryker (Til Schweiger) and Collins (Danny Trejo), in pursuit, Lee gets pictures from a photo booth and phones Alan, who offers the use of his passport. When Lee arrives at the temple, he discovers that Alan has been tortured to the point of death. Alan tells Lee that his family was moved to Canton—but he told his torturers they were in Shanghai. Lee has little more than 24 hours before his family is found. The monk gives Lee his passport before dying in his arms.\nHoled up in a hotel, Coburn finishes altering Allan's passport for Lee. The two exchange stories, and Coburn becomes sympathetic to Lee. Feeling compelled to stop the killing of Zedkov's son before leaving the country, Lee forces one of Wei's men to reveal the plan, which is to kill Stevie while he and his father are at a cartoon festival in a movie theater. Lee and Coburn, who insists on helping, arrive barely in time to prevent Ryker and Collins from killing the boy, and Ryker is killed in the subsequent gunfight. Concerned that Lee and Coburn will make their way back to Wei's base of operations, the crime boss makes plans to flee the country and hunt down Lee's mother and sister himself. However, when two guards open the main gate for Wei and his entourage to leave in a limo, Lee is just outside and launches a two-handed handgun assault. Coburn surfaces moments later, driving a truck through the melee, incapacitating Wei's Kogan, and later killing him. When Collins fires from a high perch on Lee and Coburn, Lee soon outflanks him, killing him from behind. Finally, Lee corners Wei on a fire escape platform. Though both men have emptied their guns, Lee is first to reload. Wei promises Lee that the boy and Lee's family will still die, but Lee replies, \"Not in your lifetime,\" and kills him. Though Zedkov arrives before Lee and Coburn can get away, he lets them go, taking only their guns. Coburn reluctantly bids goodbye to Lee at the airport, presenting him with one last gift, passports for his mother and sister."}