{"mid": "TheRealGhostBusters", "IMDB_id": "tt0090506", "title": "The Real Ghost Busters", "plot": "The series follows the continuing adventures of the four Ghostbusters, their secretary Janine, their accountant Louis, and their mascot Slimer, as they chase and capture rogue spirits around New York and various other areas of the world.\n=== Slimer! ===\nAt the start of the fourth season in 1988, the show was retitled to Slimer! and the Real Ghostbusters. It aired in a one-hour time slot, which the show began doing under its original name earlier that same year in January. In addition to the regular thirty-minute Real Ghostbusters episode, a half-hour Slimer sub-series was added that included 2–3 short animated segments focusing on the character Slimer. Animation for the Slimer! cartoons was handled by Wang Film Productions. At the end of its seven-season run, 147 episodes had aired, including the syndicated episodes and 13 episodes of Slimer, with multiple episodes airing out of production order.\nSlimer is shown to haunt the Sedgewick Hotel as its recurring pest. The segments added several characters as friends of Slimer and other supporting characters like a singing ice cream truck driver named Chilly Cooper, an Italian pizza chef named Luigi, a restaurant owner named Rafael who is Luigi's boss, a bellhop named Bud, hotel manager Morris Grout, socialite Mrs. Van Huego and her dog Fred, odd-job worker Rudy.\nSlimer had an antagonist named Professor Norman Dweeb, an archetypical mad scientist usually accompanied by a sidekick pink poodle named Elizabeth. Dweeb wants to capture Slimer to experiment on him and to gain personal glory. Dweeb also made three appearances in the main series, one a clip show from the last two seasons. Other enemies of Slimer include an alley cat named Manx, a dog named Bruiser, a tough woman named Mrs. Stone, and the ghost gangsters Goolem and Zugg as well as their boss Scareface. One of the ghosts from the Slimer cartoons, the Sleaze, also reappeared in The Real Ghostbusters to be captured a second time."}