{"mid": "TheRainmaker", "IMDB_id": "tt0119978", "title": "The Rainmaker", "plot": "Rudy Baylor (Matt Damon) was brought up in a slum. His father, who was a severe alcoholic, abused him and his mother. After studying at Austin Peay State University, Rudy, who has an interest in social justice and civil rights, decides to attend law school. When he graduates from the University of Memphis State Law School, he, unlike most of his fellow grads, has no high-paying employment lined up. He is forced to apply for part-time positions while he serves drinks at a Memphis bar.\nDesperate for a job, he reluctantly goes to an interview with J. Lyman \"Bruiser\" Stone (Mickey Rourke), a ruthless and corrupt but successful personal injury lawyer, who makes him an associate. To earn his fee, Rudy is turned into an ambulance chaser, required to hunt for potential clients at a local hospital.\nSoon he meets Deck Shifflet (Danny DeVito), a less-than-ethical former insurance assessor turned paralegal, who has gone to law school but failed the bar exam six times. Deck is resourceful in gathering information, and practically an expert on insurance lawsuits.\nRudy manages to get just one case, concerning insurance bad faith. It may be worth several million dollars in damages, which appeals to him because he is about to declare himself bankrupt. He rents an apartment above the garage in the home of elderly Miss Birdsong (Teresa Wright), a client whose will he has been drafting.\nBruiser is suspected of racketeering, and his offices are raided by the police and FBI. Not knowing what else to do, Rudy and Deck set up, without so much as a secretary for help, a two-man practice. They file a bad faith suit on behalf of a middle-aged couple, Dot and Buddy Black, whose 22-year-old son Donny Ray (Johnny Whitworth) is going to die from leukemia. Donny Ray would most likely have been saved by a bone marrow transplant had his medical claim not been denied by Great Benefit, the family's insurance carrier.\nAlthough Rudy passes the Tennessee bar exam, he has never argued a case before a judge and jury. He finds himself up against a group of experienced and devious lawyers from a large firm that is headed by Leo F. Drummond (Jon Voight), a showman attorney who uses unscrupulous tactics to win his cases.\nThe original judge assigned to the case, Harvey Hale (Dean Stockwell), is set to dismiss it because he sees it as one of many so-called \"lottery\" cases that slow the judicial process. But after Hale suffers a fatal heart attack, a far more sympathetic judge, Tyrone Kipler (Danny Glover), takes over the case. Kipler, a former civil rights attorney, immediately denies the insurance company's petition for dismissal.\nWhile preparing his case, Rudy gets to know a young woman whom he met at the hospital, Kelly Riker (Claire Danes), a battered wife whose husband, Cliff (Andrew Shue), has beaten her so savagely with a baseball bat that she must be hospitalized. After a particularly violent attack, Rudy persuades Kelly, to whom he is attracted, to file for divorce.\nGoing to Kelly's home to pack her belongings, Rudy and Kelly are violently confronted by a bat-wielding Cliff. After Cliff injures Rudy then pulls a gun on him, Rudy grabs the bat and incapacitates him. Kelly insists Rudy leave, then finishes Cliff with the baseball bat. To prevent Rudy from being implicated, Kelly tells the police she was alone and killed her husband in self-defense. Rudy promises to defend Kelly if the case goes to trial, but the district attorney declines to prosecute, knowing Kelly would never be convicted.\nDonny Ray dies, but not before giving a video deposition. The case goes to trial, where Drummond capitalizes on Rudy's inexperience. He gets vital testimony by Rudy's key witness, former Great Benefit employee Jackie Lemanczyk (Virginia Madsen), stricken from the record, and attempts to discredit Donny Ray's mother (Mary Kay Place). Due to Rudy's single-minded determination and skillful cross-examination of Great Benefit's unctuous president Wilfred Keeley (Roy Scheider), the jury finds for the plaintiff with a monetary award far exceeding all expectations.\nIt is a great triumph for Rudy and Deck, at least until Keeley attempts to flee the country after looting the company and Great Benefit declares itself bankrupt, making it unable to pay the Blacks or any other claimant. Despite no payout for the grieving parents, nor fees for Rudy or Deck, Dot Black is relieved that Great Benefit is out of business and unable to hurt other families like hers. Drummond, who also will not be getting paid for his services, calls up and commiserates with Rudy telling him that everybody lost.\nConvinced his success will create unrealistic expectations for future clients, Rudy abandons his practice to instead teach law with a focus on ethical behavior. He leaves town with Kelly, wanting to retain a low profile and protect Kelly from any possible retribution by Cliff's vengeful relatives. He leaves the legal profession after just one successful case."}