{"mid": "TheRazorsEdge", "IMDB_id": "tt0087980", "title": "The Razor's Edge", "plot": "Maugham begins by characterizing his story as not really a novel but a thinly veiled true account. He includes himself as a minor character, a writer who drifts in and out of the lives of the major players. Larry Darrell's lifestyle is contrasted throughout the book with that of his fiance's uncle, Elliott Templeton, an American expatriate living in Paris and a shallow and unrepentant yet generous snob. For example, while Templeton's Roman Catholicism embraces the hierarchical trappings of the Church, Larry's proclivities tend towards the 13th-century Flemish mystic and saint John of Ruysbroeck.\nWounded and traumatized by the death of a comrade in the War, Larry returns to Chicago, Illinois, and his fiancée, Isabel Bradley, only to announce that he does not plan to seek paid employment and instead will \"loaf\" on his small inheritance. He wants to delay their marriage and refuses to take up a job as a stockbroker offered to him by Henry Maturin, the father of his friend Gray. Meanwhile, Larry's childhood friend, Sophie, settles into a happy marriage, only later tragically losing her husband and baby in a car accident.\nLarry moves to Paris and immerses himself in study and bohemian life. After two years of this \"loafing,\" Isabel visits and Larry asks her to join his life of wandering and searching, living in Paris and travelling with little money. She cannot accept his vision of life and breaks their engagement to go back to Chicago. There she marries the millionaire Gray, who provides her a rich family life. Meanwhile, Larry begins a sojourn through Europe, taking a job at a coal mine in Lens, France, where he befriends a former Polish army officer named Kosti. Kosti's influence encourages Larry to look toward things spiritual for his answers rather than in books. Larry and Kosti leave the coal mine and travel together for a time before parting ways. Larry then meets a Benedictine monk named Father Ensheim in Bonn, Germany while Father Ensheim is on leave from his monastery doing academic research. After spending several months with the Benedictines and being unable to reconcile their conception of God with his own, Larry takes a job on an ocean liner and finds himself in Bombay.\nLarry has significant spiritual adventures in India and comes back to Paris. What he actually found in India and what he finally concluded are held back from the reader for a considerable time until, in a scene late in the book, Maugham discusses India and spirituality with Larry in a café long into the evening. He starts off the chapter by saying \"I feel it right to warn the reader that he can very well skip this chapter without losing the thread of the story as I have to tell, since for most part it is nothing more than the account of a conversation that I had with Larry. However, I should add that except for this conversation, I would perhaps not have thought it worthwhile to write this book ... .\" Maugham then initiates the reader to 'Advaita philosophy' and reveals how, through deep meditation and contact with Bhagawan Ramana Maharshi, cleverly disguised as Sri Ganesha in the novel, Larry goes on to realise God -- thus becoming a saint—in the process having gained liberation from the cycle of human suffering, birth and death that the rest of the earthly mortals are subject to.\nThe 1929 stock market crash has ruined Gray, and he and Isabel are invited to live in her uncle Elliott Templeton's grand Parisian house. Gray is often incapacitated with agonising migraines due to a general nervous collapse. Larry is able to help him using an Indian form of hypnotic suggestion. Sophie has also drifted to the French capital, where her friends find her reduced to alcohol, opium, and promiscuity – empty and dangerous liaisons that seem to help her to bury her pain. Larry first sets out to save her and then decides to marry her, a plan that displeases Isabel, who is still in love with him.\nIsabel tempts Sophie back into alcoholism with a bottle of Żubrówka, and she disappears from Paris. Maugham deduces this after seeing Sophie in Toulon, where she has returned to smoking opium and promiscuity. He is drawn back into the tale when police interrogate him after Sophie has been found murdered with an inscribed book from him in her room, along with volumes by Baudelaire and Rimbaud.\nMeanwhile, in Antibes, Elliott Templeton is on his deathbed. Despite the fact that he has throughout his life compulsively sought out aristocratic society, none of his titled friends come to see him, which makes him alternately morose and irate. But his outlook on death is somewhat positive: \"I have always moved in the best society in Europe, and I have no doubt that I shall move in the best society in heaven.\"\nIsabel inherits his fortune, but genuinely grieves for her uncle. Maugham confronts her about Sophie, having figured out Isabel’s role in Sophie’s downfall. Isabel’s only punishment will be that she will never get Larry, who has decided to return to America and live as a common working man. He is uninterested in the rich and glamorous world that Isabel will move in. Maugham ends his narrative by suggesting that all the characters got what they wanted in the end: \"Elliott social eminence; Isabel an assured position; . . . Sophie death; and Larry happiness.\""}