{"mid": "TheRoadToHongKong", "IMDB_id": "tt0056417", "title": "The Road to Hong Kong", "plot": "The story is told in flashback as Diane (Joan Collins) explains to American Intelligence how transmissions from passengers picked up from a missile to the moon are by Americans rather than Russians.\nHarry Turner (Crosby) and Chester Babcock (Hope) are defrauding people in Calcutta by selling a \"Do-it-yourself interplanetary flight kit\" that ends up injuring Chester, giving him amnesia. An Indian doctor (Peter Sellers) says the only way for Chester's amnesia to be cured is through help from monks in a lamasery in Tibet.\nAt the airport, Chester mistakenly picks up a suitcase with a marking designed to be a point of contact between agents of a SPECTRE-type spy organization called \"The Third Echelon.\" Diane (Colllins), a Third Echelon secret agent, is supposed to give plans of a Russian rocket fuel stolen by the Third Echelon to the man with the suitcase, who will be taking them to headquarters in Hong Kong. She mistakenly thinks Chester is the contact.\nIn Tibet, the two make their way to the lamasary in Lost Horizon fashion. Not only do the lamas cure Chester, but they have a Tibetan tea leaf that gives super memory powers to those who consume it. Chester and Harry observe as great works of Western literature in the manner of Fahrenheit 451 are committed to memory, one giggling lama (David Niven) memorizes Lady Chatterley's Lover. The scheming Harry decides to steal a bottle to give Chester the power of photographic memory for lucrative nefarious purposes.\nReturning to Calcutta, followed by Diane, Harry has Chester test the results of the memory herb by memorizing the rocket formula that Diane placed in Chester's coat. Not knowing what it is, Harry destroys it after Chester has successfully memorized it. Diane arrives too late, but after seeing Chester recite the formula, she offers them $25,000 to meet her in Hong Kong. On the way to Hong Kong, an agent of the High Lama replaces the stolen Tibetan herbs with a similar bottle containing ordinary tea leaves.\nThe Third Echelon is seeking the fuel for its own spacecraft with an underwater launching pad in Hong Kong. The goal is to be the first on the moon, where a base is to be established to launch nuclear weapons against Earth and to bring survivors under the agency's control.\nWith a Russian launch to the moon carrying two apes imminent, the Third Echelon, which was going to emulate the Soviet achievement, decides to gain respect at the United Nations by launching two human astronauts, Chester and Harry, instead of apes. The two are used as guinea pigs (and fed with bananas) to test the capabilities of the spacecraft and the effects of spaceflight upon humans. The mission is successful, with moonlight bringing back Chester's photographic memory.\nDiane decides to leave the Third Echelon when she discovers that once her colleagues have extracted the final formula from Chester, they plan to dissect Chester and Harry to see the effects of space travel on their bodies. Diane helps the boys escape. They are pursued through Hong Kong, eventually leading Diane to the authorities. Chester and Harry happen to meet Dorothy Lamour at a nightclub where they are recaptured by the Third Echelon.\nChester, Harry and Diane all end up in a rocket bound for another planet. They think they're alone after landing, but they're not—Chester calls out, \"The Italians!\" as they are joined by Frank Sinatra and Dean Martin."}