{"mid": "TheresAlwaysVanilla", "IMDB_id": "tt0166843", "title": "There's Always Vanilla", "plot": "There's Always Vanilla follows the life of Chris Bradley (Raymond Laine) a former U.S. Army soldier who has become a drifter and makes money by various means, from pimping to guitar playing. Chris returns to his home city of Pittsburgh and visits his father who owns and operates a baby food factory. After an evening out with his father of drinking at a local bar, and visiting an old girlfriend named Terri Terrific (Johanna Lawrence), Mr. Bradley wants Chris to abandon his bohemian lifestyle and do what was agreed upon when he separated from the military; return to the family business, but Chris refuses.\nAt a local train station, Chris meets Lynn (Judith Ridley; billed as Judith Streiner) a beautiful young woman who works as a model and actress in local TV commercials. Chris charms his way into Lynn's life and moves in with her. At first their relationship is a pleasant escape from daily life, but when Lynn starts to resent supporting the freeloading Chris, she motivates him into getting a steady job. Lynn learns that she's pregnant and, knowing how irresponsible he is, decides to get an abortion without telling Chris.\nChris lands a job at a small advertising firm but when he's given an account to advertise enlistments for the U.S. Army, he quits out of his resentment of his military past. Meanwhile, Lynn cannot bring herself to have an abortion, she abandons Chris, and moves in with a high school boyfriend who agrees to marry her and raise the baby as his own.\nHis romance with Lynn ruined and his lifestyle destroyed, Chris swallows his pride and moves back in with his father, still unable to decide what to do with his life, but believing he ultimately must accept the old values like his father has. Chris has more encouragement after a talk at dinner at a Howard Johnson's with his father where he tells Chris that life is like an ice cream parlor, and that of all of life's most exotic flavors to choose from, there's always vanilla to fall back on.\nThe film's final scene shows a very pregnant Lynn living in a suburban house with her new husband. A large packaged box arrives at their house addressed to Lynn with Chris' home address on it. Upon opening the box on the front lawn of their house as instructed on the box, helium-filled balloons float out of it and float away into the bright blue sky. On the bottom of the box is a note from Chris addressed to Lynn telling her to always remember the care-free time they had together."}