{"mid": "TheReader", "IMDB_id": "tt0976051", "title": "The Reader", "plot": "=== Characters ===\nMichael Berg, a German who is first portrayed as a 15-year-old boy and is revisited at later parts of his life: when he is a researcher in legal history, divorced with one daughter, Julia. Like many of his generation, he struggles to come to terms with his country's recent history.\nHanna Schmitz, a former guard at Auschwitz. She is 36, illiterate and working as a tram conductor in Neustadt when she first meets 15-year-old Michael. She takes a dominant position in their relationship.\nSophie, a friend of Michael's when he is in school, and whom he probably has a crush on. She is almost the first person whom he tells about Hanna. When he begins his friendship with her, is when he begins to \"betray\" Hanna by denying her relationship with him and by cutting short his time with Hanna to be with Sophie and his other friends.\nMichael's father, a philosophy professor who specializes in Kant and Hegel. During the Nazi era he lost his job for giving a lecture on Spinoza and had to support himself and his family by writing hiking guidebooks. He is very formal and requires his children to make appointments to see him. He is emotionally stiff and does not easily express his emotions to Michael or his three siblings, which exacerbates the difficulties Hanna creates for Michael. By the time Michael is narrating the story, his father is dead.\nMichael's mother, seen briefly. Michael has fond memories of her pampering him as a child, which his relationship with Hanna reawakens. A psychoanalyst he sees, tells him he should consider his mother's effect on him more, since she barely figures in his retelling of his life.\nThe daughter of a Jewish woman who wrote the book about the death march from Auschwitz. She lives in New York City when Michael visits her near the end of the story, still suffering from the loss of her own family.\n=== Part 1 ===\nThe story is told in three parts by the main character, Michael Berg. Each part takes place in a different time period in the past. Part I begins in a West German city in 1958. After 15-year-old Michael becomes ill on his way home, 36-year-old tram conductor Hanna Schmitz notices him, cleans him up, and sees him safely home. He spends the next three months absent from school battling hepatitis. He visits Hanna to thank her for her help and realizes he is attracted to her. Embarrassed after she catches him watching her getting dressed, he runs away, but he returns days later. After she asks him to retrieve coal from her cellar, he is covered in coal dust; she watches him bathe and seduces him. He returns eagerly to her apartment on a regular basis, and they begin a heated affair. They develop a ritual of bathing and having sex, before which she frequently has him read aloud to her, especially classical literature, such as The Odyssey and Chekhov's The Lady with the Dog. Both remain somewhat distant from each other emotionally, despite their physical closeness. Hanna is at times physically and verbally abusive to Michael. Months into the relationship, she suddenly leaves without a trace. The distance between them had been growing as Michael had been spending more time with his school friends; he feels guilty and believes it was something he did that caused her departure. The memory of her taints all his other relationships with women.\n=== Part 2 ===\nSix years later, while attending law school, Michael is part of a group of students observing a war crimes trial. A group of middle-aged women who had served as SS guards at a satellite of Auschwitz in occupied Poland are being tried for allowing 300 Jewish women under their ostensible \"protection\" to die in a fire locked in a church that had been bombed during the evacuation of the camp. The incident was chronicled in a book written by one of the few survivors, who emigrated to the United States after the war; she is the main prosecution witness at the trial.\nMichael is stunned to see that Hanna is one of the defendants, sending him on a roller coaster of complex emotions. He feels guilty for having loved a remorseless criminal and at the same time is mystified at Hanna's willingness to accept full responsibility for supervising the other guards despite evidence proving otherwise. She is accused of writing the account of the fire.\nAt first she denies this, then in panic admits it in order not to have to provide a sample of her handwriting. Michael, horrified, realizes then that Hanna has a secret that she refuses to reveal at any cost—that she is illiterate. This explains many of Hanna's actions: her refusal of the promotion that would have removed her from the responsibility of supervising these women and also the panic she carried her entire life over being discovered.\nDuring the trial, it transpires that she took in the weak, sickly women and had them read to her before they were sent to the gas chambers. Michael decides she wanted to make their last days bearable, or did she send them to their death so they would not reveal her secret?\nShe is convicted and sentenced to life in prison while the other women receive only minor sentences. After much deliberation, he chooses not to reveal her secret, which could have saved her from her life sentence, as their relationship was a forbidden one because he was a minor at the time.\n=== Part 3 ===\nYears have passed, Michael is divorced and has a daughter from his brief marriage. He is trying to come to terms with his feelings for Hanna, and begins taping readings of books and sending them to her without any correspondence while she is in prison. Hanna begins to teach herself to read, and then write in a childlike way, by borrowing the books from the prison library and following the tapes along in the text. She writes to Michael, but he cannot bring himself to reply. After 18 years, Hanna is about to be released, so he agrees (after hesitation) to find her a place to stay and employment, visiting her in prison. On the day of her release in 1983, she commits suicide and Michael is heartbroken. Michael learns from the warden that she had been reading books by many prominent Holocaust survivors, such as Elie Wiesel, Primo Levi, Tadeusz Borowski, and histories of the camps. The warden, in her anger towards Michael for communicating with Hanna only by audio tapes, expresses Hanna's disappointment. Hanna left him an assignment: give all her money to the survivor of the church fire.\nWhile in the U.S., Michael travels to New York to visit the Jewish woman who was a witness at the trial, and who wrote the book about the winter death march from Auschwitz. She can see his terrible conflict of emotions and he finally tells of his youthful relationship with Hanna. The unspoken damage she left to the people around her hangs in the air. He reveals his short, cold marriage, and his distant relationship with his daughter. The woman understands, but nonetheless refuses to take the savings Hanna had asked Michael to convey to her, saying, \"Using it for something to do with the Holocaust would really seem like an absolution to me, and that is something I neither wish nor care to grant.\" She asks that he donate it as he sees fit; he chooses a Jewish charity for combating illiteracy, in Hanna's name. Having had a caddy stolen from her when she was a child in the camp, the woman does take the old tea caddy in which Hanna had kept her money and mementos. Returning to Germany, and with a letter of thanks for the donation made in Hanna's name, Michael visits Hanna's grave for the first and only time."}