{"mid": "TheRiverWild", "IMDB_id": "tt0110997", "title": "The River Wild", "plot": "A Boston couple, Gail (Meryl Streep) and Tom (David Strathairn), are having marital problems, due to his inability to spend time with his family because of his work as an architect. She, a water rafting expert, decides to take their son, Roarke (Joseph Mazzello), on a holiday rafting trip down the Salmon River in Idaho, along with their dog, Maggie. Their daughter, Willa (Stephanie Sawyer), accompanies them to Gail's parents' house in Idaho. At the last minute, just when they are about to leave for the almost week-long trip, Tom joins them. As they are setting off, they meet a couple of other rafters, Wade (Kevin Bacon) and Terry (John C. Reilly), who appear to be friendly. Thus they leave for the trip, leaving Willa behind to be taken care of by her grandparents.\nAfter a day's rafting, they make camp for the night, but Tom continues to work on his renderings rather than entering fully into the experience, which agitates Roarke. They are joined by Wade and Terry, who help to celebrate Roarke's birthday that night. Gail becomes friendly with Wade. However, after a while he begins acting suspiciously, and she decides it would be best to part ways. During the morning's rafting, he reveals to Roarke that they have a gun with them. As they raft down the river, Gail and Tom discuss a strategy that will allow them to leave the two men behind, and at lunch they attempt to leave on their raft and get away before Wade and Terry realize what is going on.\nTheir attempt fails, and Wade pulls the gun on them and assaults Tom. Maggie runs off during the melee, avoiding a shot by Wade. Gail then realizes that an armed robbery she had heard about was actually carried out by Wade and Terry, and their rafting trip is actually a way for them to get away. Having found out that they are criminals, the family is forced to raft at gunpoint down the rest of the river before they all set up camp for the night.\nDuring the night, Tom attempts to steal the gun from the sleeping Terry but is heard and has to run into the bushes and to the river. Wade gives chase and believes he has shot Tom when he hears a loud splash into the water.\nA park ranger named Johnny (Benjamin Bratt), who knows Gail, is whitewater canoeing down the river. He bumps into them. Wade holds the gun to Gail's back, and they pretend everything is okay. Later, Johnny reappears. Wade shoots him and throws him into the rapids.\nWade and Terry plan to escape by rafting a set of rapids named the Gauntlet, where rafting is no longer allowed because in recent years one person was killed and another was left paralyzed. Aware that Gail is one of only three people to have ever survived the deadly waters, they force Gail to raft down through those rapids despite her repeated declarations that she can no longer navigate such big water, especially not with novices and her son.\nUnbeknownst to anyone Tom has been racing to try to get ahead of the raft, in a desperate attempt to save his family. After a harrowing ride in which Terry is nearly drowned, the group manage to make it through the Gauntlet. Tom reappears, and manages to flip the raft. As he struggles with Terry, Gail is able to get the gun.\nWade tells Gail there is no need to kill him, and that if she does, it will haunt her because she will never have a way to know if she truly had to. Gail, knowing Wade believes the gun has only one round, points the gun into the air to fire it, but it only clicks on an empty chamber, after which Wade orders Terry to kill Tom and Roarke and goes after Gail. Gail opens the revolver, sees the remaining cartridge, chambers the last round, and kills Wade. The film ends with the family and Terry, who has been arrested, being helicoptered out."}