{"mid": "TheSpecialist", "IMDB_id": "tt0111255", "title": "The Specialist", "plot": "In 1984, Captain Ray Quick and Colonel Ned Trent, explosives experts working for the CIA, are on a mission to blow up a car transporting a South American drug dealer. But when the car appears, a little girl is inside with the dealer. Ray insists they abort the mission, but Ned intends to see it through and allows the explosion to happen, resulting in the deaths of both the drug dealer and the child. Furious by the girl's wrongful death, Ray savagely beats Ned and flees, effectively resigning from the CIA.\nYears later, in Miami, Ray works as a freelance hit man. Desperate people contact him via an Internet bulletin board and he takes the cases that interest him. Ray specializes in \"shaping\" his explosions, building and planting bombs that blow up only the intended target while leaving innocent bystanders unharmed.\nHe answers ads placed by a woman named May Munro and speaks to her often to decide if he should take the job or not. During the talks he becomes intrigued by her story, coupled with the fact that he sees how attractive she is while following her. She is the only child of parents who were killed by Tomas Leon and his men. Against his better judgment, and pushed by her insistence that she will infiltrate the gang with or without him, Ray is persuaded to accept the job. Even though he has agreed, May ingratiates herself into Tomas' world as Adrian Hastings.\nNed now works for Joe Leon, Tomas' father and director of their mafia organization. Once the hits on their lower level guys begin, they contact the chief of police to place Ned in their bomb squad. May tolerates Tomas and plays along as his girlfriend so she can watch the hits one by one. It is revealed after the second target is killed that May has actually been forced into a partnership with Ned, whose goal was to coax Ray out of hiding. After the job in South America went wrong, Ned was dismissed from the CIA and is intent on revenge.\nWhen the trap for Tomas is set, May is in the room; the resulting explosion appears to kill them both. When Ned goes to Joe to pay his respects, he is left alive only so he can find Ray and bring him to Joe before Tomas is buried. Both Ray and Ned believe that May is dead, yet Ray discovers that bulletin board messages are still being posted. He responds to one, quickly realizing that it is a trap set by Ned and the bomb squad, and baits Ned into an explosive tirade.\nWhen he goes to the funeral of Adrian Hastings, Ray finds that May is alive. She went to the funeral to see if Ray would attend. They go to the Fontainebleau Hotel where they have sex, after which she leaves. Meanwhile, Ned has gone to the church and learns that the person in the casket is not May. She runs into Ned in the hotel lobby and makes an excuse as to why she did not tell him that she was alive. A henchman is ordered to take her to the car and on the way she asks to use the restroom. Once there, she uses a cell phone to warn Ray. He rigs the hotel room to explode, and when Ned's henchmen enter the room it detonates, breaking the entire room off into the ocean.\nIn a final showdown, Ray and May are cornered in Ray's own booby-trapped warehouse. Ned pursues them, but is done in by his own hubris when he steps on a bomb. After the entire warehouse goes up due to the chain of bombs exploding, it appears that all inside have been killed.\nThe next day Joe reads about the incident at the warehouse. He then opens the mail brought to him and finds a necklace. It contains a picture of May's parents, which then explodes. After hearing the blast and knowing all responsible for her parents' death are dead, Ray asks how she feels, to which she responds, \"Better.\""}