{"mid": "TheSpanishPrisoner", "IMDB_id": "tt0120176", "title": "The Spanish Prisoner", "plot": "Corporate engineer Joe Ross (Campbell Scott) has invented a very lucrative, very secret industrial process. While on a corporate retreat at the resort island of St. Estèphe, he meets a wealthy stranger, Jimmy Dell (Steve Martin), and attracts the interest of one of the company's new secretaries, Susan Ricci (Rebecca Pidgeon).\nJimmy wants to introduce Joe socially to his sister, an Olympic-class tennis player, in New York and asks him to deliver a package to her. Susan, who sits near Joe on the airplane back to New York, converses with him about how \"you never know who anybody is,\" talks about unwitting drug mules, and repeats, \"Who in this world is what they seem to be? Who?\" Realizing that he doesn't really know Jimmy, and afraid the package might contain something illegal, Joe opens it on the plane, finding only a book on tennis (the 1939 edition of \"Budge on Tennis\"); in the process he accidentally rips the cover. Once home, Joe buys another copy of the book, to give to Jimmy's sister, and keeps the torn one at his office.\nJimmy suggests that Joe's company and his boss, Mr. Klein (Ben Gazzara), might not give Joe fair compensation for his work. The flirtatious Susan also keeps making suggestions that one never knows whom to trust.\nJimmy invites Joe to dinner with Jimmy's sister, and they meet at Dell's place. While at his computer and chatting about business, Jimmy asks if Joe has a Swiss bank account, and finding the answer is no, opens one for him with a token balance (15 Swiss Francs), pretending that it is all an easy lark. Taking him to dinner at a club requiring membership, Jimmy has Joe sign a certificate to join. Over dinner, he advises Joe to consult legal counsel about his position in the company regarding the Process; and Jimmy offers his own lawyer, telling Joe to bring the only copy of the Process to their meeting.\nJoe learns that the sister does not actually exist and that Jimmy is really a con artist, who is attempting to steal his valuable work. Joe contacts Pat McCune (Felicity Huffman), a woman he met on the island whom Susan told him was an FBI agent, and whose business card Susan kept. He is enlisted in a sting operation. When Jimmy Dell never shows up for the planned meeting, to his horror, Joe learns that McCune is actually part of Jimmy's con game. His Process is stolen and he has been thoroughly swindled.\nJoe attempts to explain what happened to his employer and the police, but his story sounds far-fetched. The con has made it appear that he has sold his Process to the Japanese. The Swiss bank account that Jimmy opened for him makes it look as though he is hiding assets, and the certificate he signed to join the club turns out to be a request for political asylum in Venezuela, which has no extradition treaty with the United States.\nThe police show Joe that Jimmy's apartment is a mere façade and that the club's members-only room was nothing but a restaurant that was closed while they were there. Joe is also framed for the murder of his co-developer of the process, George Lang (Ricky Jay).\nOn the run from the law, Joe reconnects with Susan, who says she believes his story and continues to express a romantic interest in him. Joe remembers that the hotel where the island retreat took place maintains a video surveillance, which could prove that Jimmy Dell was there. Susan takes him to the airport in order for him to fly to the island. On the way to the airport, Susan convinces him to first drive to Boston (to elude a manhunt).\nAt the airport in Boston, Susan gives him a camera bag, which actually contains a gun, and an airplane ticket supposedly to the island retreat, but actually to Venezuela. Before passing through security, Joe realizes that Jimmy left his fingerprints on the original (ripped) tennis book he was to deliver to Jimmy's alleged sister. He leaves the airport with Susan, still not realizing that she is working against him. They board a ferry to return home.\nJimmy comes to kill Joe on the ferry, seemingly alone except for Susan and a couple of Japanese tourists. The final (improvised) step of this con is going to be Joe's death, made to appear as a suicide. Jimmy suddenly is hit with a tranquilizer dart shot by one of the \"tourists\". They are, in fact, US Marshals who have been monitoring Jimmy's con since the beginning. They reveal that Joe's boss, Mr. Klein, was behind the entire con because he wanted to keep all the profits for himself. Jimmy and Susan are taken off to jail."}