{"mid": "TheStoningOfSorayaM", "IMDB_id": "tt1277737", "title": "The Stoning of Soraya M.", "plot": "Stranded in the remote Iranian village of Kuhpayeh by car trouble, a journalist is approached by Zahra, a woman with a harrowing tale to tell about her niece, Soraya, and the bloody circumstances of Soraya's death, by stoning, the previous day. The two sit down as Zahra recounts the story to Freidoune, who records the conversation with his tape recorder. The journalist must escape with his life to tell the story to the rest of the world.\nAli is Soraya's abusive husband who tries to get the village's mullah to convince Soraya to grant him a divorce so that he can marry a 14-year-old girl. Ali is able to convince the mullah by making threats to tell the rest of the village about his past as a convict.\nAli's marriage to the teenager is conditional on Ali's ability to save the girl's father, a doctor who has been sentenced to death for an unspecified crime. The mullah proposes that Soraya becomes his temporary wife, referred to in Iran as 'Sigeh', in exchange for protection and monetary support for Soraya and her two daughters. Zahra barges in and encourages Soraya to refuse the offer. Soraya has two sons whom Ali wants, and who have both turned against her. Some days following the incident, a woman dies. The mullah, the village's mayor, and Ali ask Zahra to persuade Soraya to care for the widower. Zahra suggests that Soraya may do the job if she is paid.\nSoraya starts working for the widower, and Ali plans to use the unusual circumstance to spread lies that Soraya is being unfaithful to him so that she will be stoned and he can remarry. Ali also knows if Soraya were dead, he would not have to pay child support. Ali and the mullah start a rumor about Soraya's infidelity so they can charge her with adultery. One day while Zahra is walking in town, she realizes that a rumor has spread that her niece is being unfaithful to her husband.\nAli and the mullah need one more \"witness\" to Soraya's \"infidelity\" to be able to formally charge her. They visit the widower at home and, using threats, manipulate the widower into agreeing to back up their story. Soon after, Ali drags Soraya through the streets, beating her and publicly declaring that she has been unfaithful. Zahra intervenes and takes her niece, Ali, and the Mayor of the village to her house to talk privately. They bring the widower to the home and, after he lies and says that they had engaged in adultery, a trial is pursued. Only men, including Soraya's father, are allowed while Soraya is confined with some women in Zahra's house. She is quickly convicted. Zahra tries to flee with her and after realizing she cannot, goes to plead with the mayor for Soraya's life, even offering to switch places with Soraya. The conviction is upheld though, and as they are preparing for the stoning, the Mayor prays to Allah for a sign if they are not doing the right thing.\nBefore the actual stoning can begin, a traveling carnival van comes through and tries to perform their act. They are shooed away, where they wait by the sidelines as the stoning begins. Soraya's father disowns her as he is given the first stone to throw but he misses her repeatedly. A woman in the crowd pleads to the mayor that the stones missing are a sign Soraya is innocent, but none of the men listen. Ali takes up stones and throws them himself. Her two sons are also forced to throw stones. The widower is given two stones to throw but instead walks away in tears. The crowd finally joins in and Soraya is stoned to death.\nZahra is heard narrating the story to the journalist about her niece. Soon, the widower walks in and informs the journalist that his car is fixed. A short while later, the mullah and the widower are informed by Ali that his marriage to the teenage girl is off, implying that he could not spare her father from execution. Angry about the fact that he had been coerced by Ali and the mullah into lying, the widower admits that he lied. As the journalist attempts to leave with his belongings and collect his vehicle since it has been repaired by the widower, the mullah orders a Revolutionary Guard to stop him at gunpoint. They spill out the belongings of his bag, seize his tape recorder, and destroy all of the tapes. But as the journalist prepares to drive away, Zahra appears out of an alley with the true tape in her hand. Men attempt to run after the car before the journalist is able to drive away. Zahra screams that the God that she loves is great and now the whole world will know of the injustice that has happened."}