{"mid": "TheStupids", "IMDB_id": "tt0117768", "title": "The Stupids", "plot": "Joan and Stanley Stupid are convinced they are victims of a conspiracy that steals their garbage every week and in an attempt to uncover this, Stanley follows the garbage truck to the city dump where he stumbles across Lieutenant Neidermeyer who is selling contraband weaponry to a group of terrorists. Neidermeyer believes Stanley to be a secret agent who has uncovered their operation and orders him assassinated, and after several attempts on his life result in him unintentionally killing his would be assassins, Stanley narrowly escapes a carbomb and is presumed dead by Neidermeyer.\nMeanwhile, the children, Buster and Petunia Stupid, believe their parents have been kidnapped by a Chinese restaurant and go in search of them. They reunite with their mother Joan, who explains her theory that the police have turned against them and are responsible for their missing father.\nOnce all the family are reunited back home, Joan tells the children about their father's last job for the postal service where he discovered all the letters being marked \"return to sender\", but was fired before he could find out who \"Mr. Sender\" was. Stanley tells the family about the conspiracy theory he has invented that combines all the ideas the family's overactive imaginations have created, including the \"Evil Mr. Sender\" plotting to steal all the mail and garbage from America and employing the police to kidnap anybody who discovers his scheme. When they find local museum curator Charles Sender in the phone book they set off in pursuit, ultimately tracking him to a television studio where Stanley appears on a talk-show and is spotted by Niedermeyer who has him kidnapped and brought to his army base.\nWhile being held hostage at the army base Stanley overhears the address of the warehouse being used for the illegal arms deals. Following a fluke escape the entire Stupid family head to the warehouse where they expect to find Sender and the stolen mail. The family confront Neidermeyer and his terrorist associates in a slapstick battle, resulting in some large explosions that cause the police to investigate the warehouse. Stanley offers what he perceives to be heroic advice about how Sender can repent his evil ways but Sender takes them as road directions and both men are pleased with the outcome of the conversation.\nThe family arrives home and resolving some subplots including a delivery driver finally getting the order Joan placed to them and saving them from Neidermeyer one last time in the process, as well as some extraterrestrial pilots attempting to kill Stanley who, in his usual manner, unwittingly dispatches them."}