{"mid": "TheSerpentAndTheRainbow", "IMDB_id": "tt0096071", "title": "The Serpent and the Rainbow", "plot": "In 1978, a Haitian man named Christophe (Conrad Roberts) mysteriously dies in a French missionary clinic, while outside a voodoo parade marches past his window with a burning coffin. The next morning, Christophe is buried in a traditional Catholic funeral, at which his sister cries over his body and prays for his soul. Onlooking is a mysterious black man dressed in a suit who was also outside Christophe's hospital window on the night he died. As the coffin is lowered into the ground, Christophe's eyes open and tears roll down his cheeks.\nSeven years later, Dennis Alan (an ethnobotanist and anthropologist from Harvard University) narrowly escapes the Amazon Jungle and returns to Boston after acquiring rare herbs and medicines from a local shaman. During his ordeal, Alan drinks a hallucinogenic potion and experiences a horrifying image of the same black man from Christophe's funeral, surrounded by corpses in a bottomless pit. Alan also sees his totem jaguar spirit which leads him out of the jungle to safety.\nBack in Boston, Alan is approached by a large pharmaceutical corporation looking to investigate a drug used in the Voodoo religion of Haiti to create zombies. The company wants Alan to acquire the drug for mass production and use it as a type of \"super anesthetic\". The corporation provides Alan with significant funds and sends him to Haiti where the country is in the middle of a revolution. Alan's exploration in Haiti to find the drug, assisted by the doctor Marielle (Cathy Tyson), locates Christophe who is alive again after having been buried for dead seven years before. Shortly thereafter, Alan is taken into custody by the Haitian authorities, with the commander of the Tonton Macoute (Captain Dargent Peytraud (Zakes Mokae) - the same black man from both Christophe's funeral and Alan's vision in the Amazon) warning Alan to leave Haiti. Alan is at first not harmed by Peytraud, due to Alan's status as a U.S. citizen.\nAlan refuses to leave, and continues to investigate. He encounters a local witch doctor, Mozart (Brent Jennings), who is reported to have knowledge of the zombie drug and the procedure necessary for its creation. Alan pays Mozart for a sample of the drug, but Mozart sells him a fake substitute of rat poison instead. After embarrassing Mozart in public, the Voodoo witch doctor agrees to show Alan exactly how to produce the zombie drug for a fee of $1000 to which Alan agrees. Before gaining this knowledge, however, Alan is arrested a second time by the Tonton Macoutes and tortured. After having his scrotum nailed into a chair, Alan is dumped on a street with the message clear that he had best leave Haiti before he is killed. Alan, however, still refuses to do so and meets with Mozart to create the zombie drug.\nA few hours before picking up the final product, Alan has a terrifying dream. This was planted in his head by Peytraud, revealed to be an evil bokor who turns enemies into zombies and steals their souls. When Alan wakes up, he is lying next to Christophe's sister who has been beheaded. The Tonton Macoutes enter, take photos, and frame Alan for murder. Brought to Peytraud, Peytraud tells Alan to leave the country and never return, lest he be convicted of the framed murder, executed, and then his soul stolen by Peytraud. He puts Alan on an airplane at gunpoint, but Mozart sneaks onboard at the last minute and gives Alan the zombie drug for free. Mozart simply asks Alan to tell people about him, so that Mozart can achieve international fame. Alan agrees and returns to Boston with his mission apparently completed.\nAt a celebration dinner, the wife of Alan's employer is possessed by Peytraud, who warns Alan of his own imminent death. Thereafter Alan returns to Haiti, where his only ally, a houngan named Lucien Celine, is killed by Peytraud through dark magic causing a scorpion to materialize inside Celine's throat; Mozart is beheaded at the same time as a sacrifice for Peytraud's evil power. Alan is then sprayed with the zombie powder which \"kills\" him; afterwards, Peytraud steals Alan's body from an American medical clinic before Alan's death can be reported to the American Embassy. Peytraud takes Alan to a graveyard where, helpless in his coffin, Alan sees that Peytraud has captured Marielle and will kill her as a sacrifice to Baron Samedi. Peytraud further shows Alan the soul of Lucien Celine in a canari. Alan is then buried alive with a tarantula to \"keep him company\". Waking up screaming in his coffin a few hours later, Alan is rescued by Christophe who was also turned into a zombie by Peytraud many years earlier and now lives in a cemetery thinking that he is still dead.\nHaving escaped Peytraud's trap, Alan returns to the Tonton Macoute headquarters looking for Marielle. There, Alan and his jaguar spirit defeat Peytraud and send the evil bokor's soul to Hell. As the Haitian people celebrate the downfall of Jean-Claude Duvalier, Marielle proclaims \"The nightmare is over\"."}