{"mid": "TheSwanPrincess", "IMDB_id": "tt0111333", "title": "The Swan Princess", "plot": "King William (Dakin Matthews), widowed father of newborn Princess Odette, and Queen Uberta (Sandy Duncan), widowed mother of young Prince Derek, decide to betroth their children in the hopes of uniting their kingdoms. Rothbart (Jack Palance) is an evil sorcerer who wishes to take William's kingdom for himself, by mastering a type of dark magic known as The Forbidden Arts. But before he can make his move, he is attacked by William's men. Although banished from the kingdom, Rothbart vows to get his revenge.\nWilliam and Uberta have Odette and Derek meet every summer, hoping they'll fall in love. As children, this fails miserably, but when the years pass and the two reach adulthood, they do fall in love. Derek (Howard McGillin) declares that the wedding preparations begins, but when he expresses his wish to marry Odette (Michelle Nicastro) only for her beauty, she rejects him. Odette and William leave, but they are ambushed by Rothbart, who transforms into a \"Great Animal\", kidnaps Odette, and fatally injures William. Upon being tipped off by the arrival of King William's captain, Derek arrives on the scene, where William tells him with his dying breath that they were attacked by a \"Great Animal\", and that Odette is \"gone\". Believing that Odette is dead, Uberta encourages her son to find another princess. But Derek is determined to find Odette, believing that she can still be alive. He and his best friend Bromley (Joel McKinnon Miller) practice hunting every day in preparation for facing the Great Animal.\nElsewhere, Rothbart is keeping Odette at his castle lair at Swan Lake. He has cast a powerful spell that turns Odette into a swan during the day, and she is able to temporarily turn human at night if she is on the lake under moonlight. Every night Rothbart asks Odette to marry him so he can rule William's kingdom, but she refuses. During her captivity, she befriends a turtle named Speed (Steven Wright), a French frog named Jean-Bob (John Cleese), who dreams of being human, and an Irish puffin (Steve Vinovich).\nPuffin and Odette, in her swan form, fly together to find Derek. By chance they stumble upon Derek in the woods, for he is searching for the Great Animal. Derek mistakes Odette for the Great Animal, (Derek having deduced that the creature is a shapeshifter), and tries to kill her. The ensuing chase leads Derek to Swan Lake, where he witnesses Odette's change from swan to human when the moon rises. The two share a loving reunion, and Odette tells Derek that the spell can only be broken by a vow of everlasting love. Derek invites Odette to his mother's ball the following night, hoping to declare to the world of his love for her. Derek leaves just as Rothbart arrives. The enchanter has heard the whole conversation and imprisons Odette as a swan in the castle dungeon, along with Bromley, whom he had found in the woods. Furthermore, because there is a new moon on the night of the ball, Odette remains a swan that night.\nFearing that Derek's vow would ruin his plans, Rothbart sends Bridget, his hag sidekick, to the ball disguised as Odette. Odette's friends manage to free her from the dungeon and she flies to Uberta's castle, but she is unable to warn Derek in time. Derek makes the vow of everlasting love to the wrong girl. Rothbart enters and shows Derek the fake Odette's true form, Bridget. Upon realizing his mistake, Derek races after Odette back to Swan Lake, where Odette transforms back into a princess. Odette dies in Derek's arms, but not before telling him that she loves him. A furious Derek confronts Rothbart, ordering him to revive Odette. Rothbart transforms into the Great Animal. A battle ensues with Rothbart overpowering Derek. Odette's animal friends return Derek's bow to him, and Bromley, who has escaped the dungeon, provides Derek with a single arrow. Derek catches and fires the arrow into the Great Animal's heart, destroying him.\nDerek confesses to Odette that he loves her for her kindness and courage, and Odette returns to life; the spell on her is broken. The two are married and they moved into Rothbart's former castle, and they lived happily ever after."}