{"mid": "TheSwimmer", "IMDB_id": "tt0063663", "title": "The Swimmer", "plot": "On a sunny day in an affluent suburb in Connecticut, a fit and tanned middle-aged man in a bathing suit, Ned Merrill (Burt Lancaster), drops by a pool party being held by old friends, the Westerhazys. They offer him a cocktail while nursing their own hangovers from the night before. As they share stories, Ned realizes that there is a series of backyard swimming pools that could form a \"river\" back to his house, making it possible for him to \"swim his way home\". Ned dives into the pool, emerging at the other end and beginning his journey. Ned's behavior perplexes his friends, who apparently know worrisome things about his recent past which he seems to have forgotten.\nAs Ned travels, he encounters other neighbors. He meets 20-year-old Julie (Janet Landgard), who used to babysit his daughter, and reveals his plan to her; she joins him. Together, they have several experiences, including crashing another pool party and sipping champagne. While chatting in a grove of trees, Julie reveals that she had a schoolgirl crush on Ned, who then begins talking about how he will protect her, making plans for the two of them. Discomfited by his intimate approaches, Julie runs away.\nNed meets a wealthy older couple, unbothered by his eccentric behavior but also unimpressed by his posturing. He then encounters Kevin, a lonely young boy, who he tries to teach how to swim. They use an abandoned, empty pool, which Ned urges the boy to imagine is filled with water. The boy warms to this method, and soon is \"swimming\" the length of the empty pool. As Ned takes his leave, he glances back and sees the boy bouncing on the diving board over the deep end of the empty pool.\nNed fails to make more than a superficial connection with the people he meets, being obsessed with his journey, and becoming increasingly out of touch with reality. The neighborhood is full of judgmental, well-heeled people intent on one-upmanship, and Ned continues to be confused by hints that his life might not be as untroubled as he believes it to be.\nNed carries on with his plan. He walks into another party where the hostess, who seems to have had a past encounter with him, playfully calls him a \"party crasher\". He encounters there a bubbly girl, Joan (Joan Rivers), who does not know him. Ned asks her to join him, and Joan is intrigued until she is warned off by a friend. Ned jumps into the pool, making a big splash that grabs the attention of the guests. When he emerges from the water, he notices a cart that used to be his, being used to serve hot dogs. Ned gets into a spat with the homeowner, who indignantly claims to have bought it at a white elephant sale.\nNed then shows up at the backyard pool of Shirley Abbott (Janice Rule), a stage actress with whom he had an affair several years earlier. His warm memories of their time together contrast sharply with her own experience of having been \"the other woman\". Unable to reconcile his feelings with the pain he has caused, Ned wades into the deep end of the pool.\nNed continues on, showing up at a crowded public swimming pool. He is confronted by hostile local shopkeepers who ask him \"How do you like our water?\" (indicating surprise at his appearance at such a plebeian location), and ask him when he will settle his unpaid bills. When some of them let loose vicious comments about his wife's snobbish tastes and his out-of-control daughter's recent troubles with the law, it is too much for Ned and he flees.\nNed's journey home no longer includes any pools, and he trudges barefoot alongside a busy highway as the skies darken and a chilling rain begins to fall. Amid a downpour at sunset, a shivering, limping Ned staggers home, and finds his house locked and deserted. Peering in through a dirty window, he sees that it has been emptied of furniture, and appears to have been abandoned for some time."}