{"mid": "TheSevenUps", "IMDB_id": "tt0070672", "title": "The Seven-Ups", "plot": "New York City circa 1973. A business type enters an antique store as a heavily bearded type is shown upstairs by one of the store's owners. A burly deliveryman with a glass water cooler bottle enters and trips over the businessman, smashing up several antiques. A loud argument ensues and uniformed police must intervene - until a painter breaks into the office upstairs and returns with a box wrapped in grocery paper - and containing large wads of counterfeit money.Thus has The Seven-Ups - a special unit led by Buddy Manucci and including Officers Ansel (the phony painter), Borelli, and Mingo (the phony deliverman) - broken up another area of criminal activity. But their unorthodox methods upset Lt. Jerry Hanes, who has confronted the team's commanding officer Inspector Gilson before about their methods only for Gilson to fully stand up for his men. The controversy upsets Manucci, though he is reassured by his CO's endorsement.Presently the team is gathering information on a crooked bail bondsman, Festa, as his name has turned up on a wiretap. Buddy consults one of his Mob informants, funeral parlor owner Vito Lucia, who presently does not have any new information to give.Later mobster Max Kalish is arrested at his plush mansion by two FBI agents - but they are not FBI agents as they corner Kalish, punch him out, then demand a hefty ransom from Kalish's lawyer. The lawyer and a mob errand boy drive to a car wash where the phony G-men lock the car's doors and steal the ransom; they later dump Kalish in a vacant lot and drive off, and at a museum Moon, the longish-haired younger of the two kidnappers, meets his connection where money changes hands for the successful kidnapping.While walking through his old neighborhood Buddy is summoned by a barber, who tells him of disturbing activity within the area's mafia gang. Buddy and Ansel then become more concerned when they are tailing Festa and he is grabbed by two men (the same gunmen who grabbed Kalish) who portray themselves as members of the District Atorney's office. Buddy and the team then stake out Vito's funeral parlor, where Kalish and other criminals are meeting to decide what to do next; the kidnappers of Festa want another ransom, to be exchanged at the same car wash, and the mobsters' anxiety shows when a bodyguard starts to whip out a revolver on Vito when he appears. Ansel has infiltrated the ranks of mobsters' limo drivers wearing a wire - but while Buddy and the others are momentarily distracted one of the bodyguards notices the wire. Ansel is taken inside, beaten, and his cover blown.Kalish, thinking the kidnappers are cops, ties up and gags Ansel and stuff him into the trunk of his fellow criminal Carmine Cotello, who will drive to the car wash with a tail of gunmen to deal with the kidnappers. When Mingo sees Ansel is not among the limo drivers, Buddy and Borelli jump in their car and follow Cotello to the car wash. Once there, with the mobsters on one side thinking they will catch the kidnappers there, Cotello instead is jumped just outside the other side of the car wash and driven into a next door parking garage. Buddy and Borelli try to get into the place, but only after hearing gunfire - the result when the kidnappers Moon and his driver Bo think it's a setup and gun down Cotello, then blast open the trunk of his car, and are shocked to find a now-dead policeman inside - do they succeed in entering the garage. They arrest the garage worker, Toredano before discovering Ansel's body.The gunmen then make a break for it and Buddy jumps into his car and a violent high-speed pursuit ensues through the streets of New York City before spilling onto a country highway. Buddy finally catches up to the gunmen but his rammed into the underside of a stricken eighteen-wheeler.Escaping major injury, Buddy and Borelli go to the hospital where Cotello is being treated for critical injuries and the body of Ansel has been posted. Buddy is then interrogated by Gilson and Hanes and it is here he learns of the kidnapping of mafia types - and that the Chief Of Detectives believes it to be The Seven-Ups' work.Vito, meanwhile, is shaken badly by the disasterous turnabout in the Cotello incident, and he confronts Moon telling him to release Festa and lay low. Moon, though, wants none of it, vowing to kill Manucci if he comes calling. Buddy, meanwhile, sneaks into the hospital where he interrogates the weak Cotello about the kidnappers - and only when Buddy removes his oxygen tube does Cotello reveal the entire incident started with Kalish. Buddy and Mingo then storm Kalish's house and grab him and his wife at gunpoint; the frightened Kalish insists he knows nothing about who killed Ansel, that he only knows about the kidnappings of Festa, himself, and other mobsters.It is then that Buddy suddenly realizes what's going on, as all the mobsters who've been kidnapped are mobsters his team has been tailing - and the only way to find the kidnappers is to release the garage guy Toredano, who goes home only for Moon and Bo to arrive to try and kill him and an ambush by the Seven-Ups erupts in gunfire."}