{"mid": "TheSumOfAllFears", "IMDB_id": "tt0164184", "title": "The Sum of All Fears", "plot": "During the 1973 Yom Kippur War, Egyptian and Syrian forces are on the verge of defeating Israel. As a last-ditch precautionary measure, a nuclear-armed A-4 Skyhawk is launched to ensure that Israeli ground forces are not completely overrun. The fighter jet is engaged by a Syrian surface-to-air missile battery and shot down. Among the widely scattered wreckage littering the barren desert below is an intact nuke, burrowed deep into the crater left by the crashing debris.Fast-forward 29 years to 2002. US President J. Robert Fowler (James Cromwell) and his national security team are at Mt. Weather, Virginia participating in a nuclear war drill. After the drill, the President dispatches CIA Director William Cabot (Morgan Freeman) on an inspection tour of Russian nuclear sites according to the terms of the START arms treaty.At CIA headquarters in Langley, Virginia, young analyst Jack Ryan (Ben Affleck) is part of a group watching current video of Russian President Zorkin and sarcastically commenting on his recent weight gain. Simultaneously, a shadowy Neo-Nazi group is meeting in Vienna. Their leader, Richard Dressler (Alan Bates) laments the impotence of modern Europe in the face of global dominance by the United States and Russia. On the Golan Heights, an Arab scrap metal dealer is excavating the Israeli plane crash site from 1973. He strikes a hard object a few feet below the ground and realizes it is some type of bomb. Thinking it valuable, he and his helper carefully finish uncovering the weapon and use a hoist to lift it onto their truck.The next morning, Jack Ryan is lazing in bed with girlfriend Dr. Cathy Muller (Bridget Moynihan) when he receives an emergency phone call summoning him to Langley. President Zorkin has dropped dead of an apparent heart attack and has been quickly succeeded by Alexander Nemerov (Ciaran Hinds). As Ryan hurriedly dresses, his girlfriend wonders aloud what would constitute an emergency for a \"historian.\" Arriving at CIA headquarters, Ryan is collared by Director Cabot and hustled into a meeting. As part of his analyst job, Ryan had previously prepared an intelligence estimate on Nemerov. Cabot unexpectedly orders Ryan to accompany him on the trip to Russia.In the desert, an international arms dealer named Olson (Colm Feore) meets with the Arab scrap metal merchant and quickly recognizes the type of bomb he sees before him. He tells the Arab that the bomb is worthless, but offers to give him $400 for it since the man lost a son in the war. Once in possession of the weapon, Olson contacts Dressler and offers to sell him the bomb for $50 million.After a brief meeting in Moscow with Nemerov, Ryan and Talbot inspect a Russian nuclear site. Ryan shrewdly notices that three top nuclear scientists are absent from the facility. When questioned by Ryan, the Russian host gives a pat and unsatisfactory explanation. Cabot comments that if someone wanted to build a clandestine nuke, the missing scientists are the exact three they would need.Returning to Washington, Ryan is invited by Cabot to attend a black-tie gala at a posh hotel where President Fowler is speaking. Ryan and Cathy are thoroughly enjoying the evening until the President's speech is interrupted by aides who quickly whisk him away from the podium. A good percentage of the attendees also stand and exit. Ryan and Cabot hurry back to the White House situation room where they learn that Russian forces have shelled the breakaway province of Chechnya with chemical weapons, inflicting massive casualties. Those in the room debate the proper US response, eventually favoring some form of diplomatic recognition for the Chechens. Ryan speaks up and suggests that President Nemerov had nothing to do with the attack, that a separate hardline faction may have acted without his approval. Ryan's hypothesis falls flat with the others in attendance. After the meeting, Ryan finds a TV in another room and watches Nemerov give a conventional hardline speech justifying Russia's actions. After the speech, however, Nemerov boards an elevator in the Kremlin and angrily queries a senior advisor about the source of the chemical attack. He learns that hardline generals in the military acted on their own, just as Ryan had suggested. Nemerov issues orders to make the generals quietly disappear.In Vienna, Dressler's group meets to discuss their plan for the future of Europe. Dressler is seeking to provoke a nuclear confrontation between the United States and Russia. With the centers of capitalism and communism destroyed, fascism can arise once more in Europe. When one of the men expresses his doubts about the strategy, he is strangled to death.In the meantime, a CIA operative named John Clark (Liev Schreiber) has been dispatched to Russia to investigate the disappearance of the three nuclear scientists. He manages to pinpoint an abandoned Soviet military base in the Ukraine where the men might be working. Cabot sends Ryan to assist him and they manage to penetrate the compound, which shows no signs of current activity. Once inside, they discover that the entire nuclear team has been murdered. There is also clear evidence of nuclear weapons activity, but it looks as if the finished product has already been crated and shipped. Ryan asks a colleague at Langley to track down recent shipping activity from the area, and he reports that a large crate was indeed picked up and sent from Kiev to its final destination by air and sea. That destination was the port of Baltimore.At a dockside warehouse, one of Dressler's true believers uses a forklift to load the refrigerator-sized crate onto a pickup truck. The deadly cargo is delivered beneath Baltimore's NFL football stadium, where it is uncrated and revealed to be a cigarette vending machine with a small nuclear weapon concealed inside. President Fowler is scheduled to attend a game at the stadium later in the day.Ryan calls Cabot to warn him about the threat, not realizing that he is attending the football game with the President. Boarding a helicopter for Baltimore, Ryan keeps trying to get through and finally reaches Cabot. Cabot suddenly realizes with horror that the stadium is the likely target. The President is immediately hustled out and his motorcade speeds away from the stadium, but they are unable to outrun the shock wave from the exploding nuke. The Presidential motorcade is blasted off the highway as Ryan's helicopter is also knocked to the ground. Military rescue personnel retrieve the slightly-injured President from his limousine and put him aboard Air Force One. A stunned Ryan is able to escape from the wreckage of the helicopter. In the distance, he sees a mushroom cloud forming over Baltimore. He can only hope that Cathy is safe.As the President tries to sort things out aboard Air Force One and Nemerov tries to maintain a safe distance from the tragedy, a corrupt Russian Air Force general in the pay of Dressler tells a squadron of his Backfire bomber pilots that the US has attacked Moscow. He orders an attack on a US aircraft carrier in the North Sea. The Backfires launch a salvo of cruise missiles at the ship, turning it into a sea of flame. President Fowler orders a retaliatory strike by F-16s against the Russian airbase from which the Backfires were launched. The US and Russia teeter on the edge of nuclear war, just as Dressler had hoped. Each escalation by one side is matched by the other.Convinced that Nemerov didn't order the attack, Ryan urgently requests a soil sample from the blast site. An analysis conclusively proves that the plutonium came from a US nuclear processing facility, not Russia. Ryan manages to locate the mortally injured William Cabot, who suggests that he enlist the help of John Clark in tracing the bomb's origin. Cabot then expires and Ryan, before leaving, takes a plastic bag holding Cabot's effects. Clark, in the Middle East, learns that the plutonium was provided to Israel in 1968. He tracks down the Arab scrap metal dealer, who is dying of radiation sickness. The man tells him that he sold the bomb to Olson, the arms dealer. A CIA hacker is able to penetrate Olson's computer and link him to Dressler.Racing against time as missile silos are opened and strategic bombers are launched, Ryan gets a policeman to drive him to the Pentagon. Using Bill Cabot's pass card, Ryan makes it into the National Military Command Center. He convinces an Air Force General to send a message directly to Nemerov, explaining Dressler's plot and begging him to stand down. Only thirty seconds before missile launch, Nemerov backs away from Armageddon.A few weeks later, as Presidents Fowler and Nemerov are signing a new arms reduction treaty, a series of actions around the world avenge the unforgivable plot that nearly led to WW III. In Damascus, John Clark enters Olson's apartment and slits the arms dealer's throat. In a snowy Russian forest, KGB assassins run the rogue Air Force general to ground and shoot him. And in Vienna, as a panicked Dressler tries to escape his fate, a bomb destroys his car in a fiery blast."}