{"mid": "TheStuff", "IMDB_id": "tt0090094", "title": "The Stuff", "plot": "Two miners (Peter Hock & Harry Bellaver) find a yogurt- and ice-cream-like substance that appears from inside the Earth's core in a kind of eruption. They taste it to see whether it's edible, and they like it a lot. They love the way that it tastes so much that they decide to mass-produce it and start selling it. From now on, it's known as the Stuff, the latest taste sensation.Jason's mother (Colette Blonigan) buys the product--suddenly it's everywhere, on commercials, billboards, at the supermarket.... The Stuff is usually kept in the fridge, but Jason (Scott Bloom) doesn't like this new product at all, especially because he saw it move all by itself inside his refrigerator. However, his mother doesn't listen to him. Soon, there is only Stuff in the household fridge, so that Jason feels more and more hungry and isolated. Jason's family was not a really good family before-at least toward Jason--but now they only talk, eat, and think Stuff.Finally Jason is contacted by ex-FBI agent David \"Mo\" Rutherford (Michael Moriarty). They recognize each other as people who have not tasted Stuff. They go to the main factory to try to stop them producing the deadly dessert. People become slaves of the Stuff, preferring that substance instead of food.Mo and Jason, and Nicole (Andrea Marcovicci), the designer of the strange substance's advertising campaign, start being attacked by people who have become addicted to the Stuff.Finally, they reach the factory. Mo and Nicole are given a tour around the factory, and the foreman tells them that they have a room paid for at the nearest motel. Meanwhile, Jason has trespassed, and he becomes trapped inside one of the distribution lorries.The most famous scene happens now when at a cheap motel, Stuff starts appearing from their mattress. First, it tries to suffocate David, but Nicole burns it. They run away, but a man obedient to the Stuff is the one who gets killed. Stuff overfloods the whole motel. Meanwhile, the lorry in which Jason is in starts moving, followed by David and Nicole. Jason tumbles all around inside. The lorry reaches its destination.Nicole and David see a stream of Stuff flooding from the core of the Earth, and being put inside the lorries without any filtering. David attaches some mini recording cameras to his ankles and then uses the yellow overalls of the Stuff workers. The Stuff creates weird milky structures.Stuff is being poured in the lorry where Jason is trapped in. David hears Jason talking to the Stuff, so he can free him. Meanwhile, Nicole is attacked by one of the workers while she is travelling to the meeting point with David, who saves her. Then, David comes back to take Jason from the lorry.A police officer stops the lorry which David is driving because the back door was open. David mentions that its' a pity that so much Stuff is getting wasted. Jason and Nicole pretend to eat it until the police officer also goes to eat some and David can knock him down.They reach a castle and some army guys will help them to take on the factory lead by Colonel Malcolm Grommett Spears (Paul Sorvino). They kill many factory workers but the Stuff overflows once again. Nicole and Jason run in the last second. The Stuff wrecks the factory. They want to broadcast from Atlanta so that everybody knows what the Stuff can do.\n'Chocolate Chip' Charlie W. Hobbs (Garrett Morris) is a radio broadcaster who will help them because he has seen what people turn to after the Stuff has finished with them. However, he is one of them. He takes Nicole aside and opens his mouth and Stuff starts pouring out.Somehow, people believed what the Colonel said and they start turning against Stuff. They burn it and vandalise places which sale it.The owners of the Stuff want to comercialize it calling it The Taste, with enough Stuff on it to turn everybody's' mind addicted to it. David calls Jason, and he enters the room. Jason takes glasses and glasses of Stuff and they force them to eat it.The police arrive while the two owners eat and eat. They are already hooked on it and cant stop. David and Jason leave.Meanwhile, some criminals are buying loads and loads of their drug of choice, Stuff."}