{"mid": "TheSunshineBoys", "IMDB_id": "tt0073766", "title": "The Sunshine Boys", "plot": "The play's protagonists are Al Lewis and Willie Clark. Lewis and Clark were once a successful vaudevillian comedy duo known as the Sunshine Boys. During the later years of their 43-year run, animosity between the partners grew to the point where they ceased to speak with each other. Eleven years prior to the events of the play, Al retired from show business, leaving Willie struggling to keep his career afloat.\nWillie, now an old man struggling with memory loss, reluctantly accepts an offer from his nephew Ben, a talent agent, to reunite with Al for a CBS special on the history of comedy. Willie and Al meet in Willie's apartment to rehearse their classic doctor and tax collector sketch. The reunion gets off to a bad start, with the two getting into heated arguments over various aspects of the performance. However, thanks to the urging of Al's daughter, the two decide to go through with the performance.\nWillie and Al's dress rehearsal at CBS' studio ends badly. Willie is enraged when Al repeats his old habits of poking his chest and accidentally spitting on his face. Al walks off the stage in regret, while Willie has a heart attack as a result of his agitated state.\nTwo weeks later, Willie is under the care of a nurse as he recovers from his heart attack. Upon Ben's recommendation, he decides to move into an actors' home in New Jersey. Al, concerned about Willie's well-being, comes over to visit. When the two talk, it is revealed that Al will be moving into the same home as Willie.\nNeil Simon was inspired by two venerable vaudeville teams. The longevity of \"Lewis and Clark\" was inspired by Smith and Dale who, unlike their theatrical counterparts, were inseparable lifelong friends. The undercurrent of backstage hostility between \"Lewis and Clark\" was inspired by the team of Gallagher and Shean, who were successful professionally but argumentative personally. Other sources say this is based on Weber and Fields."}