{"mid": "TheSapphires", "IMDB_id": "tt1673697", "title": "The Sapphires", "plot": "In 1968 Australia, Gail and Cynthia head into town for a talent contest but their young sister, Julie, is forbidden from going because she has a child and is too young, until she bribes a fellow neighbour to take her into town. An alcoholic, Irish talent scout, Dave Lovelace, is scolded by his boss for being late despite him sleeping in his car that is near work. After the girls lose the talent contest, even with Julie coming in, Dave gives Gail her guitar back and as Dave is about to leave, Julie hands him a piece of paper, showing that the troops need singers for Vietnam. Soon, Dave goes to make a call and he says they have been granted a spot to audition in Melbourne. Back at their place, Gail, Cynthia and Julie's mother tells him he can take them but without Julie, until Julie's father tells him not to worry about her. Advised by their grandmother, they meet up with their cousin Kay, who had been living in Melbourne for 10 years after the government took her because she had qualified as a white person. She rejects the offer of joining them, but later changes her mind and meets up at their uncle's place. After days of practising their moves, they are almost ready until Julie gives Cynthia a letter from her fiance that he is going to call it off. Despite that, they manage to audition very well and Kay comes up with the group's name, The Sapphires, after looking at Cynthia's engagement ring.\nThe Sapphires are a success with the crowds, but infighting among the women threatens to tear the group apart: Gail acts as the group's aggressive matriarch. Kay struggles with her multi-ethnic identity because 10 years earlier, she was taken away by government officials because her light skin made her a good candidate for assimilation into white culture. Julie proves to be the group's best voice with a shot at a singing career. Dave and Gail begin a romance, but his reckless behavior and a personal secret push Gail's patience to the limit.\nWhen The Sapphires do another gig, Cynthia drinks with some of the men and is not allowed to go on again. Later, Dave and Gail talk a little before Dave hands her a letter, telling her to open it later and are about to kiss when they are caught in the crossfire of war; Dave disappears in the chaos and gets shot. The girls manage to escape in choppers. At a home, Gail reads Dave's letter and realizes he wanted to propose to her, but it was her choice. The women band together and finish their tour. Dave survives and Gail is reunited with him in a Vietnam hospital. The Sapphires return to Australia and Gail and Dave announce to the family that they plan to marry. The Sapphires give a joyous performance for their friends and family in the yard of their home."}