{"mid": "TheSubstitute", "IMDB_id": "tt0117774", "title": "The Substitute", "plot": "Jonathan Shale (Berenger) is a mercenary and a Vietnam veteran who returns home to Miami after a botched covert operation in Cuba in which three men from his platoon were killed. He surprises his girlfriend, Jane Hetzko (Diane Venora) at her apartment and is warmly welcomed. On the outside, Jane is a schoolteacher at inner-city Columbus High School, an institution with a considerable gang problem. She is particularly disliked by Juan Lacas (Anthony), leader of the KOD (\"Kings of Destruction\") gang. While jogging one morning, Jane is attacked and has her leg broken. Jane and Shale believe this to be related to the KOD, which prompts the latter to go undercover as an Ivy League-educated, government-affiliated substitute teacher for his girlfriend's class.\nShale arrives at Columbus High School and is, at first, taken back by the lowly conditions. He is unable to control his class of poorly-educated students on the first day, but decides to use his street-smarts and military tactics to gain the upper hand. Soon enough, he is able to take command of the students by displaying his combat self-defence techniques when students attack him. He is warned not to use such methods by Principal Claude Rolle (Hudson), but gains the respect of his students when he bonds with them over the similarities between his early gang and Vietnam War experiences and their involvement in petty crime and street gangs. During this time, he befriends fellow schoolteacher Darrell Sherman (Plummer) and also crosses paths with Lacas, one of his students.\nSuspicious of odd conditions within the high school, Shale sets up surveillance cameras throughout the building. He discovers that Lacas orchestrated the attack on Jane. He also discovers that Lacas is secretly working with Rolle to distribute cocaine around Miami for a major narcotics ring. Shale and his team raid a drug deal, using the stolen money to buy music and sports equipment in the form of a \"school donation.\" While Sherman initially denies Shale's discovery, Sherman and a female student inadvertently witness the drugs being loaded into one of the school buses later that day. Sherman tells the student to warn Shale and Hetzko, and sacrifices himself by creating a distraction.\nRolle, who at this point is aware of Shale's interference orders a \"car accident\" for Shale, and sends Lacas after Hetzko. With the help of another student, Lacas is killed and Shale saves Hetzko, learning the full story from the female witness. Shale and his team garrison the school grounds to enter combat against the remaining K.O.D. members, a rival mercenary company led by Janus, and Rolle himself. Ultimately, Shale and Joey Six end up as the sole survivors of the battle, walking away from the school grounds discussing future operations as substitute teachers."}