{"mid": "TheSevenYearItch", "IMDB_id": "tt0048605", "title": "The Seven Year Itch", "plot": "Richard Sherman (Tom Ewell) is a nerdy, faithful, middle-aged publishing executive with an overactive imagination and a mid-life crisis, whose wife, Helen (Evelyn Keyes), and son, Ricky (Butch Bernard), are spending the summer in Maine. When he returns home with the kayak paddle Ricky accidentally left behind, he meets a woman (Marilyn Monroe), who is a commercial actress and former model who rents the apartment upstairs while in town to make television spots for a brand of toothpaste. That evening, he works on reading the manuscript of a book in which psychiatrist Dr. Brubaker (Oskar Homolka) claims that almost all men are driven to have extra-marital affairs in the seventh year of marriage. Sherman has an imaginary conversation with Helen, trying to convince her, in three fantasy sequences, that he is irresistible to women, including his secretary, a nurse, and Helen's bridesmaid, but she laughs it off. A tomato plant then crashes into his lounge chair; the woman upstairs apologizes for accidentally knocking it off the balcony, and Richard invites her down for a drink.\nHe waits for her to get dressed, including in underwear she says she keeps cool in her icebox. When she arrives, a vision in pink, they have a drink and he lies about being married. When she sees his wedding ring, he backtracks but she is unconcerned, having no designs on him, only on his air-conditioning. He has a fantasy that she is a femme fatale overcome by his playing of Rachmaninoff's Second Piano Concerto. In reality, she prefers Chopsticks, which they play together. Richard, overcome by his fantasies, awkwardly grabs at her, causing them to fall off the piano bench. He apologizes for his indiscretion but she says it happens to her all the time. Guilt-ridden, however, he asks her to leave.\nOver the next few days, they spend more time together and Richard imagines that they are growing closer, although she is immune to his imagined charms. Helen continually calls her husband, asking him to send the paddle so Ricky can use the kayak, but Richard is repeatedly distracted. His waning resolve to resist temptation fuels his fear that he is succumbing to the \"Seven Year Itch\". He seeks help from Dr. Brubaker, but to no avail. His imagination then runs even wilder: the young woman tells a plumber (Victor Moore) how Richard is \"just like The Creature from the Black Lagoon\"; the plumber repeats her story to neighbor McKenzie, whom Helen had asked to drop by to pick up Ricky's paddle. Richard imagines his wife with McKenzie on a hayride which actually takes place but into which he injects his paranoia, guilt and jealousy. After seeing The Creature from the Black Lagoon, the young woman stands over the subway grate to experience the breeze – Monroe in the iconic scene in the pleated white halter dress, blowing her skirt in the wind.\nEventually coming to his senses, and fearing his wife's retribution, which he imagines in a fantasy scene, Richard, paddle in hand, tells the young woman she can stay in his apartment; then he runs off to catch the next train to Maine to be with Helen and Ricky."}