{"mid": "TheSundowners", "IMDB_id": "tt0043013", "title": "The Sundowners", "plot": "Irish-Australian Paddy Carmody (Robert Mitchum) is a sheep drover and shearer, roving the sparsely-populated back country with his wife Ida (Deborah Kerr) and son Sean (Michael Anderson, Jr.). They are sundowners, constantly moving, pitching their tent whenever the sun goes down. Ida and Sean want to settle down, but Paddy has wanderlust and never wants to stay in one place for long. While passing through the bush the family meet refined Englishman Rupert Venneker (Peter Ustinov) and hire him to help drive a large herd of sheep to the town of Cawndilla. Along the way, they survive a dangerous brush fire.\nMrs. Firth (Glynis Johns), who runs the pub in Cawndilla, takes a liking to Rupert. He takes to spending nights with her, but, like Paddy, he has no desire to be tied down.\nIda convinces Paddy to take a job at a station shearing sheep; she serves as the cook, Rupert as a wool roller, and Sean as a tar boy. Ida enjoys the company of another woman, their employer's lonely wife, Jean Halstead (Dina Merrill). When fellow shearer Bluey Brown's (John Meillon) pregnant wife Liz (Lola Brooks) shows up unannounced, she sees the young woman through her first birth.\nIda is saving the money the family earns for a farm that they stayed at for a night on the sheep drive. Even though Paddy has agreed to participate in a shearing contest against someone from a rival group, he decides to leave six weeks into the shearing season. Ida persuades him to stay. He loses the contest to an old veteran.\nPaddy wins a lot of money and a race horse playing two-up. Owning such an animal has been his longstanding dream. They name him Sundowner and enter him, with Sean as his jockey, at local races on their travels after the shearing is done. Sean and Sundowner win their first race.\nIda finally convinces a still reluctant Paddy to buy the farm she and Sean have their hearts set on. However, he loses everything Ida has saved for the down payment in a single night of playing two-up. By way of apology, he tells her that he has found a buyer for Sundowner if he wins the next race. The money would recoup their down payment. Though Sundowner does win, he is disqualified for interference and the deal falls through. Nevertheless, Paddy's deep remorse heals the breach with Ida, and they resolve to save enough money to buy a farm one day."}