{"mid": "TheSevenPerCentSolution", "IMDB_id": "tt0075194", "title": "The Seven-Per-Cent Solution", "plot": "An introduction states that two canonical Holmes adventures were fabrications. These are \"The Final Problem\", in which Holmes apparently died along with Prof. James Moriarty, and \"The Empty House\", wherein Holmes reappeared after a three-year absence and revealed that he had not been killed after all. The Seven-Per-Cent Solution's Watson explains that they were published to conceal the truth concerning Holmes' \"Great Hiatus\".\nThe novel begins in 1891, when Holmes first informs Watson of his belief that Professor James Moriarty is a \"Napoleon of Crime\". The novel presents this view as nothing more than the fevered imagining of Holmes' cocaine-sodden mind and further asserts that Moriarty was the childhood mathematics tutor of Sherlock and his brother Mycroft. Watson meets Moriarty, who denies that he is a criminal and reluctantly threatens to pursue legal action unless the latter's accusations cease. Moriarty also refers to a \"great tragedy\" in Holmes' childhood, but refuses to explain further when pressed by Watson.\nThe heart of the novel consists of an account of Holmes' recovery from his addiction. Knowing that Sherlock would never willingly see a doctor about his addiction and mental problems, Watson and Holmes' brother Mycroft induce Holmes to travel to Vienna, where Watson introduces him to Dr. Freud. Using a treatment consisting largely of hypnosis, Freud helps Holmes shake off his addiction and his delusions about Moriarty, but neither he nor Watson can revive Holmes' dejected spirit.\nWhat finally does the job is a whiff of mystery: one of the doctor's patients is kidnapped and Holmes' curiosity is sufficiently aroused. The case takes the three men on a breakneck train ride across Austria in pursuit of a foe who is about to launch a war involving all of Europe. Holmes remarks during the denouement that they have succeeded only in postponing such a conflict, not preventing it; Holmes would later become involved in a \"European War\" in 1914.\nOne final hypnosis session reveals a key traumatic event in Holmes' childhood: his father murdered his mother for adultery and committed suicide afterwards. It was Moriarty who informed Holmes and his brother of their deaths, and his tutor then became a dark and malignant figure in his subconscious. Freud and Watson conclude that Holmes, consciously unable to face the emotional ramifications of this event, has pushed them deep into his unconscious while finding outlets in fighting evil, pursuing justice, and many of his famous eccentricities, including his cocaine habit. However, they decide not to discuss these subjects with Holmes, believing that he would not accept them, and that it would needlessly complicate his recovery.\nWatson returns to London, but Holmes decides to travel alone for a while, advising Watson to claim that he had been killed, and thus the famed \"Great Hiatus\" is more or less preserved. It is during these travels that the events of Meyer's sequel The Canary Trainer occur."}