{"mid": "TheSpiritOfChristmas", "IMDB_id": "tt0144618", "title": "The Spirit of Christmas", "plot": "While on a school field trip to a candy factory, Butters spots actor Tom Cruise working there, packing fudge into boxes. Stan, who previously told Cruise that his acting is not as good as others' in \"Trapped in the Closet\", accidentally insults him again by calling him a \"fudge packer\", as Cruise claims to be fly fishing. Cruise then recruits 200 other celebrities who have been ridiculed by the town of South Park to bring a class action lawsuit against the town. Stan returns to the factory with his father Randy to try to apologize and convince Cruise to drop the suit, but also finds it difficult not to call him a fudge packer as well since he was literally packing fudge while they spoke. An angry Cruise agrees to do so, but only if they can help Cruise meet Muhammad. This causes an uproar because depictions of Muhammad are forbidden, and the townsfolk fear that forcing Muhammad to appear in public will drive Muslim radicals to bomb the town. Stan and Kyle go to the Super Best Friends, a squad of superhero-like religious figures (Jesus Christ, Gautama Buddha, Moses, Krishna, Laozi, Joseph Smith) of which Muhammad is a member, to request he return with them to South Park. Meanwhile, it is revealed that Cruise and the other celebrities only want Muhammad for his \"goo\", as Rob Reiner, previously shown to be filled with \"goo\" in \"Butt Out\", has invented a machine to transfer Muhammad's \"goo\" to the celebrities, which they believe will make them immune to ridicule, just like Muhammad.\nBy this time, Cartman arrives with \"Mitch Connor\", a face painted on his hand as one-half of a ventriloquist act. Previously, Connor had successfully impersonated actress Jennifer Lopez in \"Fat Butt and Pancake Head\", and now Cartman and Connor return to the Lopez imitation in order to get involved in the lawsuit along with the other celebrities. Connor soon secretly convinces Cartman that they should steal Muhammad's goo for themselves to sell on the black market for more than the lawsuit could offer. Meanwhile, Kyle and Stan convince the Super Best Friends to let Muhammad come to town, but only if he stays in the back of a U-Haul truck and is not seen. When the townspeople realize they must bring Muhammad to Cruise's limo, they allegedly put him inside a bear mascot outfit. South Park is about to give Muhammad to the celebrities when the exchange is interrupted by a bomb planted by the Ginger Kids, a group of fair-skinned, red-haired children who are tired of being made fun of for their physical appearance. The Gingers want Muhammad for themselves, hoping to use his goo for their own means. They threaten to blow up the town if Muhammad is not turned over to them.\nThe people of South Park decide to turn Muhammad over to the Gingers, fearing the violence that will befall their town if they do not. The celebrities are angered by this change in events, but refuse to resort to violence for fear of ruining their careers. Instead, the celebrities decide to awaken the rebuilt Mecha-Streisand, a giant mechanical monster form of Barbra Streisand, who previously terrorized the town of South Park before being destroyed. The celebrities hope to use Mecha-Streisand to force South Park to accept their demands. Meanwhile, due to the chain of events, Cartman decides Connor's scheme has become too complicated and tries to quit, but Connor convinces him to stay involved by revealing that the townspeople of South Park have lied to Cartman about his true father. Although they previously claimed his hermaphroditic mother was also his father, Connor insists this is a lie. Cartman confronts his school teacher Mr. Garrison and Garrison's old hand puppet Mr. Hat, who admits to Cartman there was indeed a cover-up. Mecha-Streisand roars threateningly and continues her reign of destruction as the episode ends."}