{"mid": "TheScarletCoat", "IMDB_id": "tt0048588", "title": "The Scarlet Coat", "plot": "In 1780, General Benedict Arnold commands the Continental Army defences at West Point, New York. Major John Bolton (Cornel Wilde), a dragoon officer assigned to counter-intelligence, intercepts and kills a British spy leaving the Storm King Tavern, and captures a letter found on his body. He reports to Gen. Robert Howe (John McIntire), that the coded message was from the British spy calling himself \"Gustavus\" to \"James Osborn\", in care of Dr. Jonathan Odell of New York, stating that Arnold has taken command at West Point. The secret knowledge indicates that the spy is a \"highly placed person\". Bolton returns to the tavern, where one of his contacts, stableboy Ben Potter (Bobby Driscoll), tells him that the Tory wife of a redcoat, Mrs. Sally Cameron (Anne Francis), is travelling under a flag of truce possibly carrying information to the enemy. She catches them searching her room, where Bolton takes her safe conduct pass after verbally sparring with her. Mrs. Cameron tries to seduce Bolton to obtain its return, but he rebuffs her. A messenger arrives with a package for \"Mr. Moody,\" but when no one by that name can be found, another traveler, Col. Winfield, offers to deliver the package. Bolton recognizes that Winfield is an imposter, and in a struggle over the package, kills him. Other American officers arrest Bolton for murder and deliver him to Howe.\nA pass through the lines found hidden in Winfield's boot reveals that the impostor was actually Moody, a spy, who had another coded letter from \"Gustavus\" to \"Osborn\" in his possession. The package, a ream of blank paper, concealed a message from \"Osborn\" written in invisible ink requesting an urgent meeting to finalize an unknown arrangement. Howe proposes that Bolton feign desertion to the British. Bolton agrees, aware that he could be hanged if the British discover his mission. With Moody's pass, Bolton passes through the British lines, but the British lieutenant on duty recognizes that he is not the same man who previously used the pass and follows him. In New York, Bolton calls upon Dr. Odell (George Sanders), trying to deliver the letter. The lieutenant bursts in to arrest Bolton, but when he addresses him as \"Mr. Moody\", Odell takes Bolton and the letter to British Army Major John André (Michael Wilding) for deciphering, using a pair of spectacles to isolate key words. Bolton claims that he was Moody's source of information. He offers to continue working for the British. Odell bluntly tells Bolton that he thinks his story is too neat and believes him to be a Rebel spy. But André takes an immediate liking to Bolton. He invites him to a dinner party that evening, where Bolton suffers an anxious moment when Sally Cameron (unmarried and André's mistress) is present. Bolton's explanation corroborates information about the murder that André had checked, and Sally provides the perfect eyewitness.\nBolton is sent with two Tory agents to sabotage the chain barrier across the Hudson River before a British attack on the American position at Verplanck, so that British warships can pass. André gives one a letter to deliver afterwards at the Storm King Tavern. Bolton drowns one agent, but when he tries to arrest the other, is confronted by an armed Ben Potter, who still thinks that Bolton is a murderer and deserter. The agent disarms Ben and nearly kills Bolton. Ben finds his gun and shoots the agent. At a secret meeting with Howe, Bolton uses spectacles to decipher the letter, which points to Gustavus as someone at West Point with authority. Bolton volunteers to return to New York to identify the mysterious \"James Osborn.\" Odell more than ever believes Bolton is a spy, but Bolton convinces André that the British agents completed their mission.\nTo trap him, Odell writes a false dispatch from \"Mr. Osborn\" for Bolton to steal. At another dinner, Bolton notices that Sally Cameron only pretends to toast the King. She has also fallen in love with him and warns Bolton about Odell's trap. The British attack on Verplanck is crushed and results in Bolton's arrest as a Rebel spy. He is saved from hanging by André, who intervenes for him after Sally confesses her feelings for Bolton and begs him to vouch on Bolton's behalf. He does so, despite her refusal of his marriage proposal. Putting duty before personal considerations, André asks Bolton to accompany him to a meeting between \"Gustavus\" and \"Osborn\" aboard the sloop Vulture. André assures Bolton that \"Gustavus\" and \"Osborn\" have conjured a quick end to the war. The wily \"Gustavus\" changes the meeting at the last moment to the house of a Tory sympathizer and orders André to come alone. Bolton persuades André to go in uniform, and not in civilian clothing, lest he be captured as a spy. Soon after, Odell detects Bolton warning American shore batteries of the British presence, but Bolton escapes by swimming ashore to the American garrison. The American commander, Col. Jameson (James Westerfield), is skeptical of Bolton's loyalties and stubbornly holds him until Howe can vouch for him. \"Gustavus\" escapes. \"Osborn\" is captured and Bolton realizes that Benedict Arnold is \"Gustavus.\" To his horror, Bolton learns that \"Osborn\" is André, and worse, that he changed into civilian clothes trying to escape.\nAt André's court-martial, Bolton testifies that André entered the lines in uniform and changed into civilian clothing only at Arnold's treacherous orders. The court reluctantly sentences André to be executed as a spy. André pledges his continuing friendship with Bolton and asks him to protect Sally from any retribution. Bolton brokers a last-minute deal to exchange André for Arnold, but André considers the suggestion a taint on his honour and declines."}