{"mid": "TheSurvivalist", "IMDB_id": "tt0094080", "title": "The Survivalist", "plot": "The film takes place when oil production has ceased, which has resulted in a total economic collapse, the fall of society, and a severe drop in the population.\nThe Survivalist is first seen burying a man's body. He is then shown to be living efficiently in the wild. He harvests crop for food (as animal meat is scarce), forages berries, washes clothes in a nearby stream, grows seeds with semen, lays traps against intruders around his small farm's perimeter, and lives alone out of a small cabin he has built.\nOne morning, The Survivalist hears noise outside his cabin, and rushes out to find two women. An old woman named Katherine and a younger woman named Milja which Katherine claims to be her daughter, ask him if he could spare any of his crop, and attempt to trade for it too, to both of which he declines while holding them at gunpoint. Katherine suggests they stay the night, implying that he uses Milja for sex in return for food & shelter. The Survivalist agrees, but only for one night.\nThe following morning, The Survivalist tells the women to take their belongings and leave. After Milja caresses and shaves his face, he agrees to let them stay indefinitely if they help him with the farming. Over a few days, Katherine and Milja secretly conspire to kill The Survivalist in order to reduce supplies being used. The following morning, after Katherine briefly contemplates murdering him, The Survivalist is alerted a footprint in the mud, just as Milja is taken hostage while washing in a nearby stream. The Survivalist is shot in the stomach, but in turn, kills the assailant. Milja and Katherine treat The Survivalist's wound, prying the bullet out and cauterising the wound. After the wound becomes infected, he gathers maggots to eat the infected tissue. As he recovers, temperature drops, and they huddle together in bed to stay warm.\nOne night, raiders arrive and The Survivalist, Milja and Katherine gather and discuss their options. Six raiders are counted, and the survivors only have a shotgun with 2 shells, a pistol with one bullet, and two knives. They have no choice but to keep quiet while the raiders steal most of the crop and attempt, but fail, to break into the cabin. In the following days, while they work to save the farm, Milja discovers she is pregnant. Katherine again floats the idea of killing The Survivalist due to lack of food, and advises her to attempt an abortion. Milja attempts abortion with a copper rod, but fails.\nThe following morning, Katherine tells The Survivalist that she and Milja are leaving. Milja tells her she wants to stay, and that she has also poisoned Katherine. Overcome with despair from this, Katherine tells The Survivalist to cut her wrists and bury her after she dies. Following this, The Survivalist finds that one of his bear traps has caught a rabbit, meaning all three could have had enough food to survive. He returns to the cabin, and tells Milja about his brother, Augustus - the man he buried at the film's opening - He tells her they used to steal from camps, and when caught and chased, The Survivalist cut Augustus's Achilles tendon and left him to the pursuers in order to escape. He modestly assures her that she did the right thing in poisoning Katherine.\nEventually, the raiders return to the farm while The Survivalist and Milja are out foraging when they notice the raiders' presence. They sneak into the back room of the cabin for the storage of crop seeds, but Milja alerts them while leaving. The raiders give chase, and The Survivalist tells Milja to run. Drawing the raiders with a harmonica, he kills one and the rest follow the sound of the shot. One stumbles onto Milja's location, but she lures him into a bear trap and makes her escape. The Survivalist is eventually shot with a crossbow bolt - As his dying body is looted next to a large spit and fire made from the cabin's wood, it is strongly implied he is cannibalised by the raiders.\nMilja wanders the wild herself over the next few days, and eventually makes it to a survivors' compound, complete with guards, doctors and a large farm. As she waits to be let in, a female guard notices Milja is three months pregnant, and asks if she knows what she will call the baby. As the film ends, Milja answers, \"If it's a boy.\""}