{"mid": "TheSnakePit", "IMDB_id": "tt0040806", "title": "The Snake Pit", "plot": "Virginia Cunningham (Olivia de Havilland) is an apparently schizophrenic inmate at a mental institution called the Juniper Hill State Hospital (which treats only female patients). She hears voices and seems so out of touch with reality that she doesn’t recognize her husband Robert (Mark Stevens).\nDr. Kik (Leo Genn; as Mark Van Kensdelaerik, MD/\"Dr. Kik\") works with her, and flashbacks show how Virginia and Robert met a few years earlier in Chicago. He worked for a publisher who rejected her writing, and they bumped into each other again in the cafeteria. Occasionally she continued to drop by the cafeteria so they get to know each other.\nDespite their blossoming romance, Virginia abruptly leaves town without explanation. Robert moves to New York and bumps into her again at the Philharmonic. After she provides a loose excuse for her absence and departure, they pick up where they left off, though she remains evasive and avoids his desire for marriage. Eventually, Virginia brings up the possibility of marriage. They marry on May 7, but Virginia acts erratically again. She can’t sleep and loses touch with reality, as she feels it is November and snaps when Robert corrects her. The rest of the film follows her therapy. Dr. Kik puts her through electro-shock treatment and other forms of treatment including hypnotherapy. Dr. Kik wants to get to the \"causes of her unconscious rejection.\" The film includes many flashbacks, including her earlier failed engagement to Gordon (Leif Erickson) as well as childhood issues. The film shows her progress and what happens to her along the way.\nThe mental hospital is organized on a spectrum of \"levels.\" The better a patient gets, the lower level she is able to achieve. Virginia moves to the lowest level (One), where she encounters Nurse Davis (Helen Craig), the only truly abusive nurse in the hospital. Davis is jealous of Dr. Kik's interest in Virginia, which she sees as excessive. Nurse Davis goads Virginia into an outburst which results in Virginia being straitjacketed and expelled from Level One into the \"snake pit,\" where patients considered beyond help are simply placed together in a large padded cell and abandoned. Dr. Kik, learning of this, has Virginia returned to Level One, but away from Nurse Davis's care.\nDespite this setback, Dr. Kik's care continues to improve Virginia's mental state. Over time, Virginia gains insight and self-understanding, and is able to leave the hospital.\nThe film also depicts the bureaucratic regimentation of the institution, the staff — some unkind and aloof, some kind and empathetic; and relationships between patients, from which Virginia learns as much as she does in therapy."}