{"mid": "TheStrangeLoveOfMarthaIvers", "IMDB_id": "tt0038988", "title": "The Strange Love of Martha Ivers", "plot": "On a rainy night in 1928 in a Pennsylvania factory town called Iverstown, thirteen-year-old Martha Ivers (Janis Wilson) tries to run away from the guardianship of her wealthy, domineering aunt with her friend, the street-smart, poor Sam Masterson (Darryl Hickman), but is caught and brought home. Sam comes for her, but Martha's aunt hears her calling to him. While Sam slips out unnoticed, Mrs. Ivers starts beating Martha's cat with her cane. Martha wrestles it away from her and strikes her brutally, causing her to fall down the stairs and die. The event is witnessed by Walter O'Neil (Mickey Kuhn), the son of Martha's tutor (Roman Bohnen). Martha lies about the incident to Walter's father, and Walter backs her up.\nMr. O'Neil suspects what happened, but presents Martha's version of events to the police, that an intruder is responsible; with his leverage he makes Martha marry his son. When the police identify a former employee of the aunt as the murderer, the two O'Neils and Martha help convict him; he is hanged.\nSeventeen or eighteen years later, the elder O'Neil is dead. Walter (now played by Kirk Douglas) is the district attorney, while Martha (Barbara Stanwyck) has used her inheritance from her aunt to build a large business empire. Their marriage is one-sided; he loves her, but she does not love him.\nSam (Van Heflin), now a drifter and gambler, stops in the small town by chance to have his car repaired after an accident. While waiting, he goes to look at his old home, now a boarding house. There he meets Antonia \"Toni\" Marachek (Lizabeth Scott), who has just been released from jail. She is later picked up for violating her probation by not returning to her hometown. Sam goes to see Walter to see if he can use his influence to get her released.\nWalter is convinced Sam has blackmail in mind. When Martha reacts with joy at seeing Sam, Walter also becomes jealous. Walter forces Toni to set Sam up. Sam is beaten up and driven out of town, but he is too tough to be intimidated. When all else fails, Walter makes a halfhearted attempt to kill Sam himself, but is easily disarmed. Martha then inadvertently blurts out the couple's fears of blackmail, only to learn that Sam did not witness the death. Martha breaks down and laments that he left without her all those years ago, taking with him her only chance for love and freedom.\nSam is torn between his old love and his new. Although he eventually forgives Toni for betraying him, he and Martha spend an idyllic day together, rekindling his feelings for her.\nWalter arranges to meet Sam to finally settle matters. Before Sam arrives, Walter gets drunk and Martha finds out about the meeting. When Walter falls down the stairs, Martha urges Sam to kill her unconscious husband. Sam instead brings Walter around. Martha pulls out a gun and threatens to shoot Sam in \"self defense\" as an intruder. Sam tells her it would work ... if she can get Walter to corroborate her story. He then turns his back on her and leaves.\nWalter embraces and kisses his wife; then he points the gun at her midriff. Oddly relieved, she puts her hand over his hand on the trigger and presses. As she is dying, she defiantly states her name is not Martha Ivers, but Martha Smith. Outside, Sam hears the shot. He runs back toward the mansion, but sees Walter, holding Martha's body, shoot himself. Sam and Toni drive away together."}