{"mid": "TheStoneTape", "IMDB_id": "tt0069316", "title": "The Stone Tape", "plot": "Peter Brock (Michael Bryant) is the selfish and petulant head of a research team for Ryan Electrics. His team is developing a new recording medium that will give the company an edge over its Japanese competitors. They move into a new facility at Taskerlands, an old Victorian mansion that has been renovated for their use. On arrival, they learn from estates manager Roy Collinson (Iain Cuthbertson) that the refurbishment of one of the rooms in Taskerlands remains uncompleted, the builders having refused to work in it because it is supposedly haunted. The room, with its stone walls, is a remnant of the original building, with foundations dating back to the Saxon era. The rest of the mansion was added on over the centuries.\nCurious, the researchers explore the room and hear the sounds of a woman running followed by a gut-wrenching scream. Jill Greeley (Jane Asher), an emotionally sensitive computer programmer, has a vision of a woman running up the steps in the room and falling, apparently to her death.\nInquiring with the local villagers, they learn that a young maid died in that room during Victorian times and that an unsuccessful exorcism had previously been performed on the property.\nBrock hypothesises that it is not a ghost, but that somehow the stone in the room has preserved an image of the girl's death—this \"stone tape\" may be the new recording medium they have been seeking. Their scientific devices fail to detect any evidence of the phenomena the team experience, and different team members experience different phenomena: most are able to hear sounds, Jill can also see images, but another member of the team experiences no sensory input. Jill hypothesises that the \"tape\" does not produce actual sound or light, but instead interfaces with the human nervous system during playback to create the sensory impression of sound and vision, and some individuals are more sensitive to this than others. She surmises that the recordings are imprinted in moments of extreme emotion, like a kind of telepathy.\nExcited by the possibilities presented by a recording medium which uses a person's own senses as the means of recording and playback, Brock and his team move into the room. They bombard it with their technology, hoping to find the secret of the \"stone tape\" and have it play on demand. When results are not forthcoming and under mounting pressure to succeed, a last desperate attempt wipes the recording and some team members break under the strain. Brock's failures are compounded when he is informed by his superiors that they have lost confidence in his work, and that the Taskerlands facility is to be shared with a rival research team working on a new washing machine.\nEmbittered, Brock no longer wants anything to do with the stone tape. He disregards Jill's insistence that there is still more to learn about the room and her mounting concerns that it is dangerous to stop their research. After studying the failed exorcism, Jill presents the theory that the stone tape can be recorded over again and again, like magnetic recording tape; the maid's death was simply the most recent and clearest recording. Independently continuing her research, Jill realizes that the maid's death was masking a much older recording, left many thousands of years ago. Brock cruelly dismisses her findings, and forces Jill to take a two-month leave to prevent her from continuing her research.\nReturning to the room one last time, Jill's senses are besieged by a powerful, malevolent presence from the much-degraded older recording. Like the maid before her, she dies while frantically trying to escape it.\nDuring an inquest, Brock tries to save face by denouncing Jill as having been mentally unstable. Afterwards he orders that all of Jill's research be destroyed without reviewing it. The \"haunted\" room has been declared of historical importance by a preservation society, prohibiting development, destruction, or commercial use. He makes a final visit to the room and discovers to his horror that the stone tape has made a new, crystal-clear recording—that of Jill screaming his name as she dies."}