{"mid": "TheShrine", "IMDB_id": "tt1341710", "title": "The Shrine", "plot": "The film starts with a man tied to a table. Another man then kills him with a sledgehammer to the face.\nA journalist, Carmen, is having problems with her relationship with her boyfriend, Marcus who is a photographer. Carmen never seems to stop thinking about work and tends to ignore him.\nCarmen asks Dale, her boss, to allow her to investigate the disappearances of several tourists in the fictional Polish village of Alvania, including the man killed at the beginning of the film, who was named Eric. She also mentions that the luggage of all the missing tourists ends up being found all around rural parts of central Europe. Dale isn't interested in another missing persons case, saying that people go missing all the time, and he does not give her permission to go. Instead, he would rather have her investigate why a farmer's bees go missing.\nCarmen and her intern Sara visit Eric's mother, Laura. Laura tells them that she has tried to get the help of both the Polish and the American Police. However, they are unwilling or too busy to help her. Carmen asks Laura if Eric's luggage has been returned to her. Laura says that it has and Carmen borrows Eric's journal.\nLater in her home while reading Eric's journal, she has a dream of Eric with bloody eyes who tells her \"Leave me alone\". Carmen, wanting to mend her relationship with Marcus as well as her job, urges him to come with her and Sara to Alvania. Upon reaching Alvania, they find the village people to be secretive, unfriendly and unwelcoming, just as described in the last entry in Eric's journal. Although English is taught in the villages' school, not all the villagers know how (or are willing) to speak it.\nThey see a man named Henryk butchering a pig, then find a girl named Lidia picking flowers and approach her. They show her a picture of Eric and ask if she has seen him. The girl reacts at the sight of Eric in the picture but is hesitant to answer. Before she even can, Henryk calls to her and sends her off. Carmen, Sara and Marcus explore the village. They notice that the villagers treat their religious leaders like royalty. They then spot a strange dense area of fog which seems to be concentrated only in one portion of the forest, also mentioned in Eric's notes. When they attempt to investigate the fog they are threatened by Henryk and the villagers and told to leave.\nLeaving the village initially, Carmen tells Marcus that they should go back and investigate the fog. Marcus initially disagrees and insists that they leave. Carmen manages to convince Marcus to return by admitting that her editor knows nothing about the trip and that her career will be over if she returns with no story. They leave their car and walk into the forest, where they eventually find the area with the fog. Carmen, Sara and Marcus find it strange that the fog seems to never move and is quite dense, therefore preventing Marcus from taking pictures of anything inside it.\nSara enters the fog and disappears into it. Carmen and Marcus wait for Sara to return but after a while, they lose their patience. Marcus insists that they leave but they can't leave Sara behind. Carmen enters the fog to find her. Moments after Carmen enters the fog, Sara somehow gets out and is found by Marcus. Sara appears scared and unfocused. Carmen seems to have gotten lost in the fog and comes across a statue of a demon holding a heart. Carmen takes a picture of it, and moves to the side of the statue in order to take another picture. Looking up from the camera she sees that the statue has turned its head to face Carmen. The statue's eyes bleed and the 'heart' in its hand starts to beat. This frightens Carmen. As she backs away from the statue, she finds herself out of the fog and is found by Marcus and Sara. Sara and Carmen talk about seeing the statue, both a bit disoriented, also having heard strange whispering voices.\nAs they make their way back to their car, they come across Lidia, who claims to know the whereabouts of Eric and takes them to a hidden sacrificial shrine, where they discover the bodies of people (including Eric) that the village people have executed. Each body has a metal mask deeply embedded in its face, making it look as though the villagers are cultists and are practicing some kind of ritual black magic on the tourists who come to Alvania. Marcus, Sara and Carmen notice that Lidia is gone and find the door of the shrine barred.\nLuckily, Marcus is able to open it, but they are suddenly surrounded by the villagers and flee, hiding in a nearby barn. They are found and struggle to escape, but one of the villagers knocks Carmen out. Henryk shoots Sara's leg with a crossbow. The villagers knock her out with chloroform but not before she sees the face of one of the villagers turn into a demon. Marcus runs into the forest and is chased by Henryk, who catches up with him. Marcus fights Henryk but the latter gains the upper hand and knocks him out with chloroform.\nAs they wake up, they see Henryk talking to Lidia. Lidia walks off and the villagers bring them back to the entrance of the sacrificial shrine where the head of the village's church, Arkadiusz, decides to sacrifice both Sara and Carmen. The two are taken inside the shrine while Marcus is led away by two villagers and is forced at gunpoint to dig a grave. After one of them leaves, Marcus uses the shovel to disarm the remaining villager with the gun and knock him unconscious. He takes the gun and runs off to rescue Sara and Carmen.\nAt the shrine, cultists strip Carmen and Sara and dress them in ceremonial gowns. The cultists place Sara on the same ceremonial table where Eric was killed while Carmen is placed in a prison cell. The cultists secure Sara's arms, legs and head. They then deeply lacerate her arms and sever her Achilles' tendons. While this is being done to her, she sees the faces of the cultists and Arkadiusz turn into demons. The same mask earlier found on the corpses is placed over Sara's head. It has two spikes inside of it which are meant to pierce Sara's eyes. Arkadiusz takes a sledgehammer and uses it to embed the mask into Sara's face, killing her.\nOne of the cultists looks at Carmen and she sees that the cultist's face has become that of a demon. They bring her out to be sacrificed but Marcus rescues her. He locks the cultists in the shrine and he and Carmen make their escape.\nThey enter a villager's house to steal the keys to a truck. Marcus sees a woman, Emilia, and her son, Dariusz, in the kitchen. The woman calls for her husband, Aleks, but is unable to do anything since Marcus still has the gun. Marcus asks them for the keys to the truck but they can't understand English. When they see Carmen, Emilia expresses fear and panic. Marcus takes the family to their living room and ties up the couple.\nWhile Marcus tries to get them to give him the keys, Carmen starts to experience voices. She sees the objects in the room shake. She sees Dariusz turn into a demon. She sees Emilia and Aleks turn demonic, untie themselves and crawl on the floor. Marcus turns to Carmen and he too has become a demon. But in truth all of them are still human, Emilia and Aleks are still tied up and none of them are even looking at her.\nCarmen hides in another room where she continues to see and hear things. Dariusz, who understands and speaks English, leads Marcus back to the kitchen and gives him the truck keys. Not wanting to risk Dariusz going out and calling for help, Marcus also ties him up. The boy begs for Marcus to let them go and warns him that Carmen is evil since she has seen the statue. Carmen is then possessed by a demon while she is alone in the room and lets out a very loud shriek. The cultists, who have gotten free and are looking for her, hear the shriek and are alerted to Carmen's location.\nMarcus hears Carmen calling out to him. As he enters the room she went inside, through a door from the kitchen, another door leading back to the living room closes. Marcus hears Aleks and Emilia scream in fear and pain, followed by footsteps going to the kitchen. He then hears Dariusz screaming. As he looks out from the door, he sees the boy being dragged away. The door then closes and Dariusz's screaming stops. The door leading to the living room slowly opens. He goes to the living room and finds the entire family brutally killed. The possessed Carmen then jumps on him and pins him on the floor. Just as she is about to kill him, she is confronted by the cultists. She kills several of them, but Arkadiusz fights back with prayers and holy water. He calls for the mask but the cultist holding the mask is stunned with fear, giving the possessed Carmen the opportunity to impale Arkadiusz. She turns her attention back to Marcus.\nBefore Arkadiusz dies, he passes on his duties to Henryk. Henryk chants prayers while splashing Carmen with holy water, and stabs her. The prayers weaken her, allowing Henryk to slowly set her on the floor. Two more cultists help. They impale Carmen's hands and pin her to the floor. Henryk calls for the mask and this time, the cultist holding the mask complies. They position the mask over Carmen's face while Henryk readies the sledgehammer. However Carmen still struggles and the mask can't be properly placed over her eyes.\nMarcus now realizes what is going on and understands why it was necessary to kill Sara and Carmen. They had seen the statue, which is why the villagers had to kill them, but he himself hasn't. The cultists weren't sacrificing anyone; they were trying to prevent demonic possession from taking place. Knowing this, Marcus assists Henryk and the others by holding Carmen's head still. With the mask now in place, Henryk readies the sledgehammer to embed the mask. Carmen returns to normal and asks Marcus for help but he knows it is just a trick. Henryk sends the sledgehammer down and embeds the mask on Carmen, killing her.\nMarcus then looks at Henryk and the remaining men, wondering what will happen to him since he knows too much. One of the villagers asks Henryk what they will do with Marcus. In the end, Marcus is set free by the villagers. Henryk offers to have one of the village's men take him to where he needs to go. Marcus looks over to the forest where the fog is seen. Not knowing what is really inside the fog, he asks Henryk about it. He is told that the fog and the statue are a curse left long ago on the village that cannot be undone. The devilish statue is shown once more and the screen goes black."}