{"mid": "TheShootist", "IMDB_id": "tt0075213", "title": "The Shootist", "plot": "After a prologue—a clip montage of scenes from Wayne's earlier Western films—summarizing the career of J.B. Books, \"the most celebrated shootist extant\", an aging and obviously pain-ridden Books arrives in Carson City, Nevada, on January 22, 1901. He laments that the Old West is dying—as is he. A trusted friend, \"Doc\" Hostetler (Stewart), confirms a Colorado doctor's prognosis of an imminent and painful death from cancer.\nBooks rents a room at a boarding house owned by the widow Bond Rogers (Bacall) and her teenage son Gillom (Howard). Marshal Thibido (Morgan), alarmed at the presence of a notorious gunfighter in his town, asks him to leave. Books explains that he is dying, and intends to die in Carson City. Thibido relents, but says, \"Don't take too long to die.\"\nWord spreads that Books is in town; profiteers, young guns, and old friends and enemies are drawn to him. A newspaperman named Dobkins (Rick Lenz) proposes a spectacular series of articles, exaggerating and glorifying Books' tumultuous career. Books kicks him out, only to be visited by an old flame, Serepta (North), who proposes marriage. He is touched, until he learns that she wants to co-write, with Dobkins, a widow's sensational \"memoir\". \"Woman,\" says Books, \"I still have some pride.\"\nHostetler prescribes laudanum to ease Books' worsening pain, and reluctantly answers his questions about what will come next: The pain will continue to build, eventually becoming unbearable. Hostetler remarks that if he had Books' courage, the death he has just described is not the one he would choose. The undertaker, Hezekiah Beckum (Carradine) pitches a grand funeral, which Books rejects as another profiteering scheme; but he does order a headstone. Two strangers seeking notoriety try to ambush him as he sleeps, but Books kills them. Gillom is impressed; his mother, who is losing boarders, is angry.\nDuring a buggy ride, Books tells Bond he has never killed a man who didn't deserve it; Bond says a higher power will decide that. She worries that Gillom, lacking a father's guidance, is acquiring a taste for violence and drink. Books negotiates the sale of his horse to the blacksmith, Moses (Crothers), who remarks that Gillom already tried to sell it to him, to compensate for their lost boarders. Books confronts Gillom; after they resolve their differences, Gillom asks for a shooting lesson. To Gillom's surprise, he is nearly as accurate as Books, and wonders aloud how Books won all those gunfights. Books points out that the trees don't shoot back. \"It isn't always being fast or even accurate that counts,\" he adds. \"It's being willing.\"\nBooks asks Gillom to deliver a message to three men: Mike Sweeney (Boone), who has vowed to avenge his brother, killed long ago by Books; Jack Pulford (O'Brian), a professional gambler and pistol marksman; and Jay Cobb (Bill McKinney), Gillom's ill-mannered employer. Gillom informs each of them, separately, that Books will be at the Metropole Saloon on January 29, his 58th birthday. Books insists that Gillom accept his horse, which he has bought back from Moses, as a gift.\nOn January 29, the headstone arrives, bearing Books' name, birth date, and \"Died 1901\", with the day left blank. After bidding farewell to Bond, who has grown to like him, he boards a trolley for the Metropole Saloon. The room is deserted except for the four men and the bartender (Charles G. Martin). Books orders a drink and raises a toast to his birthday and his three \"guests\".\nCobb is the first to draw his gun, but Books easily dispatches him. He then shoots Sweeney through a table he is hiding behind, but is wounded in the process. Pulford now fires, hitting Books again as he takes cover behind the bar. Pulford works his way closer, but Books sees his reflection in a glass and when he peers over the bar, shoots him dead.\nGillom enters and sees the bartender sneaking up behind Books with a shotgun. He shouts a warning, but the bartender blasts Books in the back with both barrels. As he reloads, Gillom picks up Books' gun and shoots the bartender, then drops the gun in disgust. Books smiles, nods approvingly, and dies. After covering Books reverently with his jacket, Gillom walks home with his mother."}