{"mid": "TheScarletAndTheBlack", "IMDB_id": "tt0086251", "title": "The Scarlet and the Black", "plot": "In 1943, the Nazi military occupies Rome. Pope Pius XII (John Gielgud) is approached by General Max Helm and SS Head of Police for Rome Lieutenant Colonel Herbert Kappler (Christopher Plummer). The Colonel expresses concern that escaped Allied prisoners may attempt to seek refuge in the Vatican, and requests permission to paint a white line across St. Peter's Square in order to mark the extent of Vatican sovereignty. The Pope grants his permission, but when the SS officers leave, he sees out of the window that the white line had already begun to be painted.\nKappler's main antagonist is Monsignor O'Flaherty (Gregory Peck), an Irish-born Vatican priest who runs an underground organization which provides safe haven and escape to escaped POWs, Jews, and refugees in Rome. O'Flaherty is assisted in this enterprise by others, including locals, clergy and the diplomatic corps. The Nazis attempt to destroy the group, but Kappler is frustrated by O'Flaherty's successes, due to his cleverness, disguises, and stressing the limits of the Vatican's neutrality.\nMet with continuous failure, Kappler begins to develop a personal vendetta against O'Flaherty. Despite O'Flaherty's efforts, Kappler manages to recapture many escaped POWs, deport many Jews to death camps, and exploit and oppress the general population; a number of O'Flaherty's friends are also arrested or killed. O'Flaherty is himself the target of an assassination attempt instigated by Kappler, which however fails due to the monsignor's boxing skills. The rescue organization continues operating, and succeeds in saving many lives.\nAs the war progresses, the Allies succeed in landing in Italy and begin to overcome German resistance, eventually breaking through and heading towards Rome itself. Colonel Kappler worries for his family's safety from vengeful partisans, and, in a one-to-one meeting with O'Flaherty, asks him to save his family, appealing to the same values that motivated O'Flaherty to save so many others. The Monsignor, however, refuses, refusing to believe that, after all the Colonel has done and all the atrocities he is responsible for, he would expect mercy and forgiveness automatically, simply because he asks for it, and departs in disgust.\nAs the Allies enter Rome in June, 1944, Monsignor O'Flaherty joins in the celebration of the liberation, and somberly toasts those who did not live to see it. Kappler is captured in 1945 and interrogated by the Allies. In the course of his interrogation, he is informed that his wife and children were smuggled out of Italy and escaped unharmed into Switzerland. Upon being asked who helped them, Kappler realizes who it must have been, but responds simply that he does not know.\nThe film epilogue states that O'Flaherty was decorated by several Allied governments after the war. Kappler was sentenced to life imprisonment, but was frequently visited in prison by O'Flaherty, his only regular visitor. Eventually, the former SS officer converted to the Roman Catholic faith, and was baptized by the Monsignor in 1959."}