{"mid": "TheSeventhVictim", "IMDB_id": "tt0036341", "title": "The Seventh Victim", "plot": "The film opens with the quote from John Donne: \"I run to death, and death meets me as fast / and all my pleasures are like yesterday.\"\nMary Gibson (Kim Hunter), a young woman at Highcliffe Academy, a Catholic boarding school, learns that her older sister and only relative, Jacqueline Gibson (Jean Brooks), has gone missing and has not paid Mary's tuition in months. The school officials tell Mary she can remain enrolled only if she works for the school. Mary decides to leave school to find her sister, who owns La Sagesse, a cosmetics company in New York City.\nUpon arriving in New York, Mary finds that Jacqueline sold her cosmetics business eight months earlier. Jacqueline's close friend and former employee, Frances Fallon (Isabel Jewell), claims to have seen Jacqueline the week before, and suggests that Mary visit Dante's, an Italian restaurant in Greenwich Village. Mary locates the restaurant, and discovers that Jacqueline has rented a room above the store, without having moved in. Mary convinces the owners to let her see the room, which she finds empty aside from a wooden chair and above it a noose hanging from the ceiling. This makes Mary more anxious and determined to find her sister.\nMary's investigation leads her to Jacqueline's secret husband, Gregory Ward (Hugh Beaumont); a failed poet, Jason Hoag (Erford Gage); and a mysterious psychiatrist, Dr. Louis Judd (Tom Conway). Jacqueline had been Judd's patient, seeking treatment for depression stemming from her membership in a Satanic cult called the Palladists. She was lured into joining the cult by her former co-workers. Mary enlists a private detective, Irving August (Lou Lubin), but he is stabbed to death while investigating at the La Sagesse headquarters. Judd eventually helps Mary locate Jacqueline, who has gone into hiding. Gregory Ward falls in love with Mary. Jacqueline is later kidnapped by the cult members and condemned to death for revealing the cult. She would be the seventh person so condemned since the founding of the cult (hence the film's title).\nThe cult members, squeamish about committing acts of violence, decide that Jacqueline, who is suicidal, should kill herself. When she refuses, they let her leave, but send an assassin to follow her. The assassin chases her through the darkened streets with a switchblade, but she eludes him and returns to her apartment above Dante's. She briefly encounters her neighbor, Mimi (Elizabeth Russell), a young woman with a terminal illness. Mimi confesses to Jacqueline that she's afraid to die, and plans to have one last night out on the town. Jacqueline enters her own apartment and hangs herself. The thud of the chair falling over is heard, but the sick woman does not recognize the sound as she leaves for the evening."}