{"mid": "TheSecretOfNimh2TimmyToTheRescue", "IMDB_id": "tt0171725", "title": "The Secret of NIMH 2: Timmy to the Rescue", "plot": "The film begins with a prophecy, telling how one of Jonathan and Mrs. Brisby's sons would save Thorn Valley from \"the secret of NIMH\". Timothy is chosen to go but his older brother Martin believes he should have been the one chosen. Martin decides to prove his quality, and goes off to find his own adventure.\nOne day Timmy comes across a female field mouse named Jenny McBride, whose parents were two of the lost eight mice who tried to escape NIMH but were thought to have died. The Thorn Valley council decides it would be too dangerous to save the eight mice, so Jenny and Timmy go alone. They take a hot air balloon, but it is attacked by a hawk and crashes in the forest.\nSeeking help, they visit the Great Owl but instead find Jeremy the crow, posing as the Great Owl. There they learn that a caterpillar named Cecil has teamed up with Jeremy to trick the forest animals into paying them money. Jeremy and Cecil take the two mice to NIMH where they find two of the rats from Thorn Valley, Justin and Brutus. They also learn that Dr. Joseph Valentine, the head scientist, has made Martin insane. After being made insane, Martin took over the lab and brainwashed Dr. Valentine with a device similar to the one Valentine used on him and made him think he was a dog. Martin plans to use an army of lab rats riding a flock of ravens to take over Thorn Valley. He even turns two cats, Muriel and Floyd, crazy, who then proceed to catch the others.\nHe asks Timmy to join him, but he refuses and is locked in a cage as Martin drags Jenny away to make her his queen. Timmy escapes with the help of Cecil and they go to free Jenny. Together, they knock out Martin, and Timmy tricks Martin's army of ravens and rats to fly in the wrong direction. Timmy and Jenny then leave to find the others, only to find once everyone is free that NIMH is on fire. The survivors flee. Timmy goes back to save Martin. Before he leaves, Jenny tells him she loves him and he tells her the same. After being attacked by the crazy Muriel and Floyd once again, Timmy sends them down an elevator shaft and finally finds Martin.\nTimmy and Martin are able to escape through the lab's skylight, with some help from Jeremy. Jeremy takes the survivors to safety. The mice return to Thorn Valley, Martin returns to normal and Timmy arrives to a hero's welcome by the citizens of Thorn Valley, including Justin, Brutus, Mr. Ages, and Auntie Shrew, along with Mrs. Brisby and Martin's and Timmy's sisters, Teresa and Cynthia."}