{"mid": "TheToweringInferno", "IMDB_id": "tt0072308", "title": "The Towering Inferno", "plot": "Architect Doug Roberts returns to San Francisco for the dedication of the Glass Tower, which he designed for James Duncan. At 138 stories (1,800 ft/550 m), it is the world's tallest building. An electrical short starts an undetected fire on the 81st floor. While Roberts accuses the building's electrical engineer, Roger Simmons of cutting corners, Simmons insists the building is up to standards.\nDuring the dedication ceremony, public relations chief Dan Bigelow turns on the tower's exterior lights to impress the guests. The lighting overloads the electrical system and Roberts orders it shut off. Smoke is seen on the 81st floor and the San Francisco Fire Department is summoned. Roberts and engineer Will Giddings go to the 81st floor but fail to prevent a security guard opening a door, leading to a fire flash which results in Giddings being hospitalized.\nRoberts reports the fire to Duncan, who refuses to order an evacuation. Ill-equipped firefighters arrive to tackle the blaze, which spreads out of control. SFFD Chief Michael O'Halloran forces Duncan to evacuate the guests in the Promenade Room on the 135th floor, directing them to express elevators. A guest, Lisolette Mueller, who is being wooed by con man Harlee Claiborne, rushes to the 87th floor to check on a young family. Simmons admits to Duncan that he cut corners, at a time when Duncan overbudgeted construction and ordered subcontractors back under budget.\nDuncan, aided by Senator Parker and Mayor Ramsey, directs the elevator evacuation from the Promenade Room until the fire renders the express elevators unsafe. Not heeding Duncan's directions, a group is killed when their elevator stops on the fire's floor. The fire traps Bigelow and his secretary/mistress Lorrie in his 65th floor office, killing them. Senator Parker recommends using the stairs to escape, but the one stairwell is full of smoke while the other is blocked by a wheelbarrow full of hardened cement that has spilled rendering it useless.\nSecurity Chief Harry Jernigan and Roberts rescue Mueller and the family from 87. Jernigan gets the mother out safely but Roberts, Mueller, and the two children are halted by a collapsed stairwell. They climb down the stairs but fire forces them up to the Promenade Room. With fire suppression efforts ineffective, the building loses electrical power and O'Halloran's men are forced to rappel down an elevator shaft.\nA rooftop rescue results in disaster as guests rush the helicopter, causing it to crash, setting the roof ablaze and rendering further rooftop rescues impossible. Naval rescue teams attach a breeches buoy to the adjacent Peerless Building and rescue a number of guests, including Patty Simmons, Duncan's daughter. Roberts rigs a gravity brake on the external scenic elevator allowing twelve people, including Mueller, the children, and a fireman one trip down, with the remaining eight being ladies chosen by lottery, including Roberts' girlfriend Susan. An explosion leaves the elevator hanging by a single cable, where Mueller falls to her death. A Navy helicopter saves the rest by latching itself to the elevator.\nSimmons tells Duncan that he will use the breeches buoy next, but Duncan punches him, saying the men will draw numbers but he and his son-in-law will be the last to leave. The fire reaches the Promenade Room and Simmons forces his way onto the buoy, leading to a struggle. Parker is pushed to his death by Simmons. An explosion severs the lines to the breeches buoy, causing Simmons and others to fall to their deaths.\nAn SFFD deputy chief summons O'Halloran with a plan to explode the water tanks atop the building to extinguish the fire. Knowing it could kill him, O'Halloran meets with Roberts and they set C-4 on the water tanks. They return to the Promenade Room, where the remaining guests tie themselves down. O'Halloran, Roberts, Duncan, Claiborne and most of the party-goers survive as water rushes through the building, extinguishing the flames.\nClaiborne learns that Mueller did not survive and is heartbroken. Jernigan gives him Mueller's pet cat. Duncan consoles Patty over her husband's death. Duncan promises that such a tragic debacle will never happen again. Roberts says to Susan that he does not know what will become of the building, and perhaps it should be left in its fire-damaged state. Informing Roberts that the casualty toll numbered less than 200, O'Halloran says they were lucky. Roberts agrees to consult with fire officials in the future when such buildings are designed. O'Halloran drives away, exhausted."}