{"mid": "TheTaleOfDespereaux", "IMDB_id": "tt0420238", "title": "The Tale of Despereaux", "plot": "A noble mouse named Despereaux saves a princess.\n=== Book I: A Mouse Is Born ===\nBook one tells a story about a small, sickly mouse born in a castle whose name is Despereaux. He was born very small with large ears and his eyes open. Despereaux, unlike other mice, spends lots of time reading. He particularly enjoys a book about how a knight saves a princess and they live happily ever after. One day while reading he hears music. He follows the sound and is led to Princess Pea and King Philip. He sits at the king's feet to hear the music and falls in love with the princess and speaks to her, but the king led the mouse away because mice were related to rats, which are outlawed. Furlough, his brother, sees this and tells his father, Lester Tilling. Lester calls the mouse council; Furlough goes to collect Despereaux. The mouse council orders Despereaux to be sent to the dungeon because talking to a human is forbidden. In the dungeon he meets Gregory, the jailer, who saves him because Despereaux tells Gregory a story.\n=== Book II: Chiaroscuro ===\nBook II talks about a rat named Roscuro who, unlike the other rats, loved the light and was less vicious and cunning than the other rats. Finally, he decided enough was enough and went into the light. He climbs onto a chandelier, which is above a banquet. However, he falls into the queen's soup, and the queen, whose habit was to state the obvious, said, \"There's a rat in my stew,\" before dying. The princess, now hostile to Roscuro, orders him to leave. Roscuro, angry, desires revenge against the princess. The king, upset, bans the use of spoons, soup, and bowls.\n=== Book III: GOR! The Tale of Miggery Sow ===\nMany years before Despereaux and Roscuro were born, a six-year-old girl named Miggery \"Mig\" Sow witnesses the death of her ill mother. Afterwards, Mig is sold to work by her father for some cigarettes, a hen, and a red tablecloth to a man Mig calls \"Uncle\". Uncle often clouts Mig's ears, leaving her partially deaf. Mig decides, upon seeing the princess pass by on a horse, that she wants to be a princess. Mig is then sent to work in the castle by the King's soldiers, who tell \"Uncle\" that no human being is allowed to own another. In the castle she gains weight and becomes lazy. Mig's main job is to go down to the dungeons to deliver Gregory the jailer his meal and, while there, she meets Roscuro and confesses to him that her greatest wish is to become a princess. Roscuro convinces Mig that if she helps him kidnap Princess Pea, he'll make her a servant girl so Miggery Sow can become a princess.\n=== Book IV: Recalled to the Light ===\nDespereaux escapes the dungeons on a tray of Gregory's that Mig brings back to the kitchen, where he hears her conversation with Roscuro. However, Despereaux is soon discovered by Mig and Cook. Cook, as a mouse-hating woman, orders Mig to kill Despereaux. She explains to Mig that her philosophy with mice is \"kill 'em, even if they're already dead.\" When Despereaux is attempting to flee, Mig chops off his tail with a knife so that she can tell Cook that she missed the \"meecy\" and at least spare the \"meecy\"'s life. Despereaux spends the night in pain, sleeping on a sack of flour. He dreams of the castle's knights in shining armor, darkness, and light. However, when the knight removes the helmet, it doesn't reveal anyone. Despereaux begins to doubt \"'happily ever after\" and everything else that he has read and starts to weep. Meanwhile, Roscuro leads Mig to Princess Pea's room with a knife, and to kidnap Princess Pea and lead her to the dungeon.\nThe next morning, the castle is in a panic over the missing princess. Guards are sent to search the dungeon, only to find Gregory dead from starvation, being lost in the dark because Roscuro has chewed the rope which secures him to where he started. Despereaux is seen by the mouse council, who mistake him for a ghost because he is covered in flour from his night on the flour sack. Despereaux forgives his father, upon the latter's request, for sentencing him to the dungeon. Despereaux goes on to seek the King. Despereaux tells the King that he knows that Pea is in the dungeon, but the King refuses to believe him because Despereaux is related distantly to the rats.\nDespereaux then goes to Hovis, a mouse who is, in secret, Despereaux's friend. Hovis gives him an entire spool of red thread and a sewing needle, as a sword, for his quest to the dungeons. Mig, meanwhile, learns that Roscuro tricked her into helping him kidnap Pea, and that she will never be a princess. Roscuro plans for Pea to remain locked in the dungeons, so that he can marvel over her brightly colored dress, but Despereaux arrives to save Pea and Mig chops Roscuro's tail off with the knife when he refuses to show them the way back. However, many rats arrive on the scene because they followed the smell of Despereaux, and the soup he recently ate. Despereaux threatens to kill Roscuro with the sewing needle. Roscuro begins crying. Pea offers that if Roscuro lets her go, she will treat him with some soup. Roscuro agrees. Botticelli and the other rats are so disgusted by the happiness of all that is happening that they all return into the darkness.\nDespereaux and Pea become close friends. Roscuro is allowed access into the upstairs of the castle, and reunites Mig's father, who has become a prisoner in the dungeons, with his daughter. Mig's father promises that he loves Mig and will never leave her. But before this, however, Roscuro, Mig, the King, Pea, and Despereaux all get together for soup, as Despereaux's friend Hovis, his parents, and his brother watch in amazement behind the scenes."}