{"mid": "TheThirtyNineSteps", "IMDB_id": "tt0078389", "title": "The Thirty-Nine Steps", "plot": "In 1914, German spies are everywhere in London. After a spate of assassinations of important British politicians, a retired British intelligence officer, Colonel Scudder, realises his life and his mysterious black notebook are in danger. He turns to Richard Hannay, a mining engineer who is visiting Britain for a short time before returning to South Africa, who happens to be staying in a flat in the same building. Scudder tells Hannay of a plot by Prussian 'sleeper' agents, who are planning to pre-empt a war against the Triple Entente powers by assassinating a foreign minister of state visiting the UK.\nHannay reluctantly gives Scudder shelter in his flat, despite his initial distrust of him. In the morning, Hannay leaves to purchase a train ticket to his family hometown, the village of Strathallan in Scotland, while Scudder remains at work on his notes in the flat. When the Prussian agents attempt to enter the flat, Scudder flees down the fire escape but he is spotted. Posting a package containing his secret notebook in a pillar box, Scudder flees to the St Pancras railway station, where he knows Hannay will be, to give him a second black book.\nAt the railway station, just seconds before he can reach Hannay, Scudder is murdered by the agents. Hannay is mistaken by witnesses at the railway station as being the assailant. Hannay is arrested but is soon captured by the Prussians when transferred to jail. He then is allowed to escape from the Prussians in the hope that he can lead them to the secret notebook. Hannay manages to get Scudder's second notebook back at St Pancras, but this turns out to be a dummy, with only a three-word riddle in it that only Hannay could possibly understand to find his real book, which sends Hannay to Scotland. Hannay flees to Scotland on a train, but he is forced to make a daredevil escape on a bridge when police board.\nHannay attempts to solve the mystery whilst on the run from the police, led by Chief Supt Lomas (Eric Porter), and the Prussian agents, led by Edmund Appleton, a Prussian sympathiser highly placed in the British government.\nWith the aid of Alex Mackenzie and her fiance, David Hamilton, whom Hannay meets on the Scottish moors, claiming to be taking part in a wager, Scudder's book is found, the coded information partly deciphered and the true plans of the Prussian agents are revealed. The agents intend to murder the visiting Greek Prime Minister, leading to unrest in the Balkans and thus causing a world war, by planting a bomb in parliament. The \"Thirty Nine Steps\" refers to the number of stairs in the clock tower of Big Ben (from \"Lauderdale Door to the clock itself\") and Hannay realises that the bomb is to be set off by the clock at 11.45am.\nWhen he reaches the top of the clock tower, the agents have already planted the bomb and have locked the clock room. To give the Police more time, Hannay breaks the glass of the clock-face, climbs out onto the face of the clock and physically stops the clock hands just as the big hand moves just below the nine. By hanging from the big hand, Hannay manages to jam the clock at 11.44am long enough for the Police to break into the clock room where they kill the remaining spies and deactivate the bomb. The clock mechanism stops working and the clock's big hand falls into a vertical position, but Hannay hangs on and one of the officers saves him with a looped rope. Sir Edmund Appleton is convicted of treason and Hannay is declared a hero for helping Britain gain valuable time to prepare for the Great War."}