{"mid": "TheThreeLivesOfThomasina", "IMDB_id": "tt0057579", "title": "The Three Lives of Thomasina", "plot": "The story takes place in fictional Inveranoch, Scotland in the year 1912. It centres on Andrew MacDhui (Patrick McGoohan) a coldly scientific, atheist veterinarian, his seven-year-old daughter Mary (Karen Dotrice), and her cat Thomasina (voiced by Elspeth March), who narrates the film. (Thomasina was originally called \"Thomas\" by her adoptive family. She explains that they amended her name \"when they, well, got to know me better.\")\nMr. MacDhui is a widower. His wife's death destroyed his belief in God, as well as his empathy for others. He has little sympathy for pets, preferring \"useful\" animals such as hard-working farm beasts and the blind man Tammas' guide dog, Bruce.\nOne night Thomasina is chased by dogs in the marketplace. She falls from some boxes and sustains an injury. Mary and her friends find Thomasina the following day. Meanwhile, Mr. MacDhui is operating on Bruce (who had been struck by a car). The doctor is interrupted during the surgery by his daughter, begging him to help her cat. Observing that Thomasina's muscles are stiff, he diagnoses her with tetanus. He orders his assistant Willie Bannock (Wilfrid Brambell) to euthanize Thomasina.\nMary is shattered by Thomasina's death, and loses faith in her father, who had promised to save her cat. She withdraws emotionally from Mr. MacDhui and declares her father dead, refusing to speak to or look at him. Meanwhile, Thomasina's soul goes to a feline afterlife where cats who have used all of their nine lives are transformed into Siamese and live with the Egyptian cat goddess Bastet for eternity. But Thomasina has lived only once, and is returned to her body alive but in a coma.\nMary and her playmates Hughie Stirling (Vincent Winter), and Jamie and Geordie McNab (Denis Gilmore and Matthew Garber) and other friends give Thomasina a funeral. They take her out to the glen beyond the town, but are unintentionally frightened away by \"Mad Lori\" MacGregor (Susan Hampshire), a beautiful kindhearted young woman who lives in the glen and was attracted by the children's singing and bagpipe playing. The children believe she is a witch, in part because of her apparent power to calm and cure animals. Lori brings Thomasina back to her makeshift animal hospital, but although the cat recovers she has no memory of her first life with Mary. Thus begins her second life.\nLori lacks the surgical skill needed to help a wounded badger that she finds in a trap, and asks God for assistance. Soon after, Mr. MacDhui comes to give her a piece of his mind: the children have told the townspeople to boycott his practice and to bring their sick pets to her instead. Discovering the injured animal, he treats the badger's wound as Lori watches in amazement. Lori (and later, Mr. MacDhui) realize that they each have half of what is needed to treat sick animals. He has the science and surgery, and she has the power of love.\nDuring the time, Mary becomes increasingly distraught and distant from her playmates and her father. Not even a new pet brought by Mr. MacDhui will cheer her up.\nMeanwhile, Thomasina's memory is slowly returning. She realizes she misses something very important, but she doesn't know what. She remembers the way back home, but doesn't recognize Mary, who chases her into a rainstorm. Thomasina returns to the safety of Lori's cabin in the woods, but Mary contracts pneumonia after Mr. MacDhui finds her lying on the street in the rain.\nMr. MacDhui and Lori start to bond emotionally when their attempt to shut down a travelling circus results in a fight with its gypsy proprietors who had been physically abusing their performing animals. The circus spectators, including Mary's playmates, join in the fight and a fire breaks out. The police ultimately arrest the proprietors for animal cruelty.\nMr. MacDhui prays for the first time in four years that God will somehow cure his daughter. Off in the glen, a lightning bolt (which may be a miracle from God) strikes a tree next to Thomasina and her memory is suddenly restored. Lori comes to the house, as Thomasina does, who is the only one able to save Mary as she has lost the will to live. However the cat sees Mr. MacDhui (who had her killed) and refuses to enter through the window despite Mr. MacDhui's pleading.\nAt this point, Thomasina realizes that she could get revenge on Mr. MacDhui by not entering, but Lori's love has changed her, and she no longer desires revenge. Mr. MacDhui places Thomasina in Mary's arms, thereby restoring Thomasina to Mary, Mary's life, and Mary's love for her father. Lori's love has changed Mr. MacDhui, and they are soon married, making the perfect veterinary team. Thomasina now begins her third life with all of them together."}