{"mid": "TheThreeCaballeros", "IMDB_id": "tt0038166", "title": "The Three Caballeros", "plot": "The film consists of seven segments, each connected by a common theme. In the film, it is Donald Duck's birthday (namely Friday the 13th), and he receives three presents from friends in Latin America. The first present is a film projector, which shows him a documentary about birds. During the documentary, he learns about the Aracuan Bird, who received his name because of his eccentric song. The Aracuan also makes several appearances throughout the film.\nThe next present is a book given to Donald by José. This book tells of Bahia (spelled \"Baía\" in the film), which is one of Brazil's 26 states. José shrinks them both down so that they can enter the book. Donald and José meet up with several of the locals, who dance a lively samba, and Donald ends up pining for one girl, but fails. After the journey, Donald and José leave the book.\nUpon returning, Donald realizes that he is too small to open his third present. José shows Donald how to use \"black magic\" to return himself to the proper size. After opening the present, he meets Panchito, a native of Mexico. The trio take the name \"The Three Caballeros\" and have a short celebration. Panchito then presents Donald's next present, a piñata. Panchito tells Donald of the tradition behind the piñata. José and Panchito then blindfold Donald, and have him attempt to break open the piñata, which eventually reveals many surprises. Donald ends the celebration by being fired away by firecrackers in the shape of a ferocious toy bull (with which the firecrackers are lit by José with his cigar).\nThroughout the film, the Aracuan Bird appears at random moments. He usually taunts everyone with his madcap antics, sometimes stealing José's cigar and trying to make José jealous. His most famous gag is when he re-routes a train that Donald and José are riding on by drawing new tracks, causing the train to disassemble. He returns three or four years later in Melody Time (1948).\nThe film consists of seven segments:\n=== The Cold-Blooded Penguin ===\nThis segment is narrated by Sterling Holloway, reproducing images of the penguins of Punta Tombo in Argentina along the coast of Patagonia. In the segment, a penguin named Pablo is so fed up with the freezing conditions of the South Pole that he decides to leave his home for warmer climates landing on the Galápagos Islands.\n=== The Flying Gauchito ===\nThis segment involves the adventures of a little boy from Uruguay in the English version (with adult narration provided by Frank Graham), and from Argentina in the Spanish version, and his winged donkey, who goes by the name of Burrito (which is Spanish for \"little donkey\").\n=== Baía ===\nThis segment involves a pop-up book trip through the Brazilian state of Bahía, as Donald and José meet up with some of the locals who dance a samba and Donald pining for one of the women, portrayed by singer Aurora Miranda.\n=== Las Posadas ===\nThis is the story of a group of Mexican children who celebrated Christmas by re-enacting the journey of Mary, the mother of Jesus and Saint Joseph searching for room at the inn. \"Posada\" meant \"inn\", or \"shelter\", and their parents told them \"no posada\" at each house until they came to one where they were offered shelter in a stable. This leads to festivities including the breaking of the piñata, which in turn leads to Donald Duck trying to break his own piñata as well.\n=== Mexico: Pátzcuaro, Veracruz and Acapulco ===\nPanchito gives Donald and José a tour of Mexico on a flying sarape, or magic carpet. Several Mexican dances and songs are learned here. A key point to what happens later is that Donald is pining for some more ladies again, tries to hound down every single one he sees, and gain return affections, but once more he fails every time and ends up kissing José while blindfolded.\n=== You Belong To My Heart ===\nThe skies of Mexico City result in Donald falling in love with singer Dora Luz. The lyrics in the song itself play parts in the scenarios as to what is happening as well.\n=== Donald's Surreal Reverie ===\nSeveral imagined kisses lead to Donald going into the \"Love is a drug\" scene. Donald constantly envisions sugar rush colors, flowers, and Panchito and José popping in at the worst moments, making chaos. The scene changes after Donald manages to dance with Carmen Molina from the state of Oaxaca, from the Isthmus of Tehuantepec. The two dance and sing the song \"La Zandunga\". Carmen begins by singing the song, with Donald \"quacking\" out the rest of the chorus with her. The \"drunkenness\" slows down for a second after Donald multiplied himself while dancing, but speeds up again when Carmen reappears dressed in a Charro's outfit and uses a horsewhip as a conductor's baton to make cacti appear in many different forms while dancing to \"Jesusita en Chihuahua\", a trademark song of the Mexican Revolution. This scene is notable for providing the masterful combination of live-action and cartoon animation, as well as animation among the cacti.\nThe scene is interrupted when Panchito and José suddenly spice things up for the finale of the movie, and Donald ends up battling the same toy bull with wheels on its legs the day before from earlier. The catch is that it is again loaded with firecrackers and other explosives following with a fireworks finale with the words \"The End\" exploding from the fireworks first in Mexican Spanish (Fin) in the colors of the Mexican Flag, then in Brazilian Portuguese (Fim) in the colors of the flag of Brazil and finally in English in the colors of the flag of the United States."}