{"mid": "TheThing", "IMDB_id": "tt0905372", "title": "The Thing", "plot": "Antartica, 1982. Three Norwegian scientists are in a snow cat are following a signal. They stop suddenly, and after a few moments, a crack in the snow/ice causes the snow cat to fall into a fissure in the ice and gets wedged. The lights from the snow cat are pointed down into the fissure and reveal a spaceship.Sander, a Norwegian scientist, visits an American Paleontologist, named Kate, and tells her that they have discovered a structure and an organism and convinces her to come to Antartica.Kate and her colleague, Adam, fly in a helicopter to the Norwegian camp in Antarctica piloted by Americans Carter and Jameson. They get to camp and meet the other Norwegians including Edvard who is in charge of the camp and Lars, a mechanic who is the only one that doesn't speak any English and has an Alaskan Malamute.Upon arrival, Kate and Adam and the Norwegians get into a snow cat and go to the site where we see a full view of the top of the ship in the ice. Some distance from the ship, they show Kate the strange-looking organism encased in ice. Back at camp they discuss the removal of the organism.The organism is removed and is in a wooden room back at the camp still encased in the ice block. Sander tells the team that he wants to take a tissue sample first, which Kate objects to as they need to do sterilization and take other precautionary measures. He tells her not to question him again in front of the others. They drill a hole into the ice and remove a frozen flesh sample from the organism and place it in a petri dish.Later, in the camp's rec room, the entire team is partying and realize the discovery they have made: aliens. Meanwhile, the ice block is beginning to melt. While everyone is partying, a shot cuts to the Alaskan malamute in its cage and it's barking and trying to get out. Jameson comes out of the bathroom and goes into the room with the ice block. Lars scares him by yelling 'boo' from behind and then Lars leaves. All of a sudden, the unseen Thing breaks out of the ice and jumps through the ceiling. Jameson runs back to the rec room and tells the others the Thing is alive and escaped. They all go to the room and see the ice block with the hole that the Thing left from escaping. Sander instructs the teams to divide into twos and threes and to search for the Thing. One pair goes to the dog's kennel and finds a big hole in the wall with a lot of blood and some fur.Two Norwegians, Henrik and Olav, see the Thing under one of the buildings. Seen for the first time, the Thing resembles a large beetle in that it is slimy, has multi crab-like legs, a large mouth with giant teeth, and tentacles. One of the tentacles shoots out and goes through Henrik's chest, splattering blood on Olav's face. The Thing then pulls Henrik back under the building and starts to eat him. Olav screams and they all come running. They start to shoot at the Thing with their rifles with little effect, other than causing the Thing to jump inside the building it was under and to climb up it. The team douses it with kerosine and sets it afire. The Thing, with Henrik still hanging halfway out of its mouth, falls to the ground dead.The team goes back inside, and all are in a daze. Olav is being treated and looks very ill. Juliette, the only other female on the Norwegian team, is consoled by one of the men. Carter tells the team that he will take Olav back to civilization in the morning as he needs medical help. Sander then tells the team that although Henrik has died, they are still scientists, and this may be their only chance to study the Thing. He has the burned remains of the Thing brought back inside. They autopsy the Thing, and inside they see the upper half of Henrik's body, and Kate comments that his skin looks almost new. Kate then pulls out a metal piece and asks what it is. Henrik's colleagues tell her that Henrik had a titanium bar placed in his arm to stabilize a fracture. Kate asks, \"then why was it outside of his body?\" Later Kate and Adam look at the cells from the Thing under a microscope. Not only are the cells still alive but they are overtaking Henrik's cells and then replicating them.The next morning, as Carter and Jameson prepare the helicopter, Kate is in the bathroom. She sees something bloody on the floor and picks them up with a napkin. It is four bloody, silver fillings. She then looks in the shower and sees a lot of blood, but no body. Olav and another Norwegian, Griggs, get into the helicopter with Carter and Jameson and the four take off. Kate runs outside to stop them. Carter sees her flagging them down and decides to land. Olav asks if anything is wrong, as he looks terrible. Griggs assures him everything is OK and then Griggs' face splits in half. Griggs has been replicated, and he attacks Olav. Kate and Sander watch as the helicopter goes out of control and crashes behind the mountain apparently killing all four of them. Sander asks her why she tried to stop them.Back inside, the team is all together, and Kate explains she found silver fillings in the bathroom. She tells them about the cells replicating and that her theory is that the Thing is able to replicate any organism perfectly. However, it cannot replicate inorganic matter such as metal teeth fillings and the metal piece inside Henrik. So, it spits those out. No one wants to believe her, and they decide to have a few of the team take the snow cat to go get help at a nearby Russian camp. Juliette stays behind with Kate and tells her that she saw Colins, another team member, with a rag coming from the bathroom. Kate tells her that they need to stop the team from leaving, and Juliette says she knows where the keys are to the snow cats.They go into a room and as Kate searches in a drawer for the keys she hears a slimy noise from behind. It is Juliette splitting in half. The Juliette-Thing tries to attack her, but Kate runs out of the room, down the hall, and passes another Norwegian and tells him to run. He doesn't, and the Juliette-Thing stabs him with a tentacle. Kate shuts the door to the hallway, and Adam and Lars arrive. Lars has a flame thrower pack. They open the door and Lars blasts Juliette-Thing and the other Norwegian with fire.The team gathers around, and Kate tells them the Thing is like a virus. Apparenly, anyone who gets blood or part of the Thing's cells onto them becomes taken over. She asks Adam what they should do about viruses. Adam says \"Quarantine\" and that they isolate it and then destroy it. They decide to do a blood test to determine who is the Thing. Adam and Sander work in the lab while Lars and Kate dismantle all the snow cats. Lars shows Kate a stash of grenades. As they head back, they see part of the camp on fire and it is the lab. They then see two people approaching from the distance. It is Jameson and Carter. Everyone thinks they must be Thing replicas because they couldn't have just walked away from the helicopter crash. They lock them both up.The team starts to accuse one another, and Kate says she knows another test. She gets a flashlight and tells Lars to open his mouth. We see that he has fillings in his teeth. She explains to the team that the Thing replicas would not have fillings. Everyone is eliminated as a suspect except for Sander, Edvard, Colins, and Adam who do not have any fillings in their theeth. These four are held at gunpoint while Kate tells Lars to go get Jameson and Carter. Lars and another Norwegian, Jonas, go to the building holding Jameson and Carter, but they aren't there. They have escaped through a hole in the floor. Lars goes to search after them and runs into a building and gets grabbed inside. Jonas runs back to the others to tell them that Carter and Jameson have killed Lars.Carter and Jameson (who is armed with a flame thrower) come into the building, and they have a stand off with Peder. The rest of the team hide behind Peder. Edvard yells at Peder to kill Carter and Jameson. Just before Peder blasts them with his flame thrower, Jameson shoots Peder in the head with a gun but also hits the flame thrower tank and gas pours out. The gas reaches the flame on the end of the flame thrower and explodes. Edvard is thrown down severly wounded by the blast. This gives Carter and Jameson the upper hand as they have all the weapons. They get everyone to go into the rec room, and two of the Norwegians carry Edvard.Once in the room, Edvard's arms suddenly detach from his body and transform into miniature Things, one of which attacks Jonas and attaches to his face. The main Edvard-Thing then grows a tentacle which stabs and severely wounds Adam, then fatally wounds Jameson. Kate and Carter try to get the flamethrower working, but are unable to do so due to trapped air in the main fuel line. The Edvard-Thing sprouts a new set of arms and legs and crawls over to Adam, and then starts to meld with him, causing their faces to attach. Kate tries to blast the Edvard/Adam Thing with the flame thrower, but it escapes outside and falls down in the snow. She returns to the rec room and finds Jonas being assimilated by the Arm-Thing, and kills them both with the flamethrower. Carter sits with Jameson until Jameson dies. Carter moves aside, so Kate can blast the dead Jameson with the flame thrower. Among all this chaos, Collins flees into the compound.Kate and Carter hunt for the Thing. Meanwhile, Sander is hiding behind a desk, but the Thing (which has now fully absorbed Adam into itself) finds him and attacks him. Carter and Kate split up, and the Thing follows Carter into the kitchen. Just before it attacks Carter, Kate blasts it with the flame thrower, seemingly killing it. They see the Sander Thing escape in a snow cat. Carter tells Kate to let him go, that he'll freeze, and he has nowhere to go. Kate says that he does have somewhere to go: the ship on the coast.Kate and Carter get into the other snow cat and head towards the ship. As they get out, Kate focuses on the earring in Carter's left ear. Carter also tells her that they didn't kill Lars. They walk towards an open hatch in the ship, but the ship activates and Kate falls through a hole into the ship. Carter enters through the hatch. Kate gets to a point in the ship that looks like the energy source (it looks like a bunch of pixels). Behind her is the Sander Thing and he chases her into a tunnel. Kate grabs a grenade as the Thing pulls her out of the tunnel. She throws the grenade into the Thing's mouth, which blows up, and destroys it and the ship's energy source.Back at the snow cat, Carter gets in and tells Kate to put the flame thrower in the back. She stays outside the Cat and tells Carter \"You know how I knew you were human back at the camp? Your earring\". Carter has no earring now. He reaches up and tugs at his right ear. Kate says \"It was the other ear\" and she douses him with the flame thrower. She gets into the other cat (that the Sander Thing had used) and rides away.In between the end credits, we cut back to a helicopter landing at the camp. A dead, frozen Colins sits at the radio. He has slit his own throat. The Norwegian helicopter pilot yells out if anyone is around, and a gun shoots at him. It's Lars, the only one left behind and not infected. Then the Alaskan Malamute jumps out, and Lars tries to shoot the dog. The dog runs off. Lars yells at the helicopter pilot that it's no dog and to get into the helicopter.Lars and the other Norwegian pilot chase and shoot at the dog from the helicopter, and it's the same opening scene from the 1982 movie The Thing."}