{"mid": "TheTwoMouseketeers", "IMDB_id": "tt0044157", "title": "The Two Mouseketeers", "plot": "Jerry and Nibbles are two mouseketeers who decide to help themselves to a lavish royal banquet. Tom has been ordered to guard the spread from the King's Mouseketeers with his life, under threat of execution by beheading from the guillotine. Jerry and Nibbles enter the castle hall through a stained-glass window. Jerry releases the rear-end cover on a suit of armor, making a small drawbridge to the windowsill; they sneak into the armor, emerge from the helmet's faceguard, and then parachute onto the table. They unwittingly catch Tom's attention by showering him with champagne.\nAfter hiding from Tom by wearing white paper decorations from the standing rib roast to look like two ribs, Jerry runs off, but the little mouseketeer Nibbles begins making a ham sandwich while singing \"Alouette\" to himself. Tom emerges behind him and pokes him with his sword, and Nibbles yells in protest. The little angry mouse says \"He, attention-la! Vous pourez faire mal a quelqu'un, Monsieur Pussycat!...Pussycat?! Au secours! Au secours! Le pussycat! Le pussycat!\" (Hey! Watch it! You could hurt someone like that, Mister Pussycat. Pussy Cat!? Help! Help! The pussycat! The pussycat!). But before he can get away, Tom captures him by putting his rapier through Nibbles' cape. Jerry manages to stab Tom in the rear-end to rescue Nibbles, and throws a custard in Tom's face for good measure. This launches a swashbuckling fencing display against Tom, ending in Tom catching Jerry. Nibbles tips a long-handled axe toward Tom and it shaves the tabard and all the fur off Tom's back from head to hind end, (and revealing ruffled white underwear), while Nibbles hides in some fruit.\nNibbles runs away, but is sent flying by Tom into a full wine glass – but Jerry saves him by hurling a tomato at Tom, followed by multiple vegetables. After impaling each of the vegetables on his rapier, Tom then heats and eats them like a shish kebab. Nibbles climbs out of the glass, now drunk. He pokes Tom in the rear-end, making him yowl and jump up, as Nibbles waves his sword, saying, \"Touché, pussycat!\" But as he runs away, Tom catches him. Jerry makes the save by hitting Tom on the head with a mace so hard that Tom falls through the table, which leads into Tom and Jerry resuming their sword fighting. While this goes on, Nibbles brings along a cannon and stuffs it with everything on the banquet table. He lights the cannon and it violently explodes.\nAs the smoke disappears, Jerry and Nibbles are seen walking triumphantly down the street with stolen banquet food. Suddenly, they see in the distance a guillotine, and with a drumroll the blade comes down, strongly suggesting that Tom was executed (although off-screen in order to comply with the Hays Code). Both mice gulp, and then Nibbles sighs \"Pauvre, pauvre pussycat!\" (\"Poor, poor pussycat!\"). Then he shrugs, saying \"C'est la guerre!\" (\"Such is war!\"). With that, the two Mouseketeers continue their victory march off into the night."}