{"mid": "TheTwoJakes", "IMDB_id": "tt0100828", "title": "The Two Jakes", "plot": "In Los Angeles in 1948, Julius \"Jake\" Berman (Keitel) hires private investigator J. J. \"Jake\" Gittes (Nicholson) to catch his wife, Kitty, in the act of committing adultery. During the sting, Berman kills his rival, who also happens to be his business partner in a real estate development company. Gittes, not having known this, suddenly finds himself under scrutiny for his role in the possible crime, all of which centers around a wire recording that captured the illicit love meeting, the confrontation, and the killing of Mark Bodine. It calls into question if Berman knew and killed his partner to wrest control of the partnership, making it murder, or was an act of jealousy, which may qualify as \"temporary insanity\" and be permitted as a defense to a charge of murder.\nGittes must convince LAPD captain Escobar (Lopez) that he should not be charged as an accomplice. Oddly, Berman seems unconcerned with the possibility that he may be accused of murder. Gittes has the recording, which Berman's attorney Cotton Weinberger (Wallach) and mobster friend Mickey Nice (Blades) both want, locked in a safe in his office in L.A., which is being rocked by earthquakes. Berman's housing development in the Valley also is experiencing seismic activities. Gittes is nearly killed in a gas explosion, waking to find Berman and wife Kitty (Tilly) standing over him.\nGittes has a confrontation, and later a sexual encounter, with Lilian Bodine (Stowe), the dead man's angry widow. He is presented with proof that Earl Rawley (Farnsworth), a wealthy and ruthless oil man, may be drilling under the Bodine and Berman development, though Rawley has denied it. This leads to a need to determine who owns the mineral rights to the land. Gittes discovers that the rights are owned by one Katherine Mulwray, daughter of Evelyn Mulwray, his love interest from twelve years prior. He also discovers that the deed transfers were executed in such a way as to attempt to hide Katherine Mulwray's prior ownership and continued claim of the mineral rights.\nGittes operatives have seen Berman in the company of a blond woman along with Mickey Nice and a huge bodyguard. With a bit of sleuthing Gittes determines that the woman is an oncologist and is treating Berman for cancer somewhere below the waist. Gittes confronts Berman with this knowledge and gets a full confession. Along the way, Gittes discovers that Berman is not going to survive and the entire set-up was to ensure that Kitty was protected once he died.\nIn order to get Kitty Berman to talk to him, Gittes must prove that Jake Berman set out to kill his partner. Once accomplished, Kitty agrees to meet Gittes and tell him what she knows about her husband. In the process of discussing Jake's possible motivations, mineral rights, and the possible whereabouts of Katherine Mulwray it is revealed that Kitty Berman and Katherine Mulwray are one and the same person. Kitty had never suspected that her husband is dying.\nIn order to prove premeditation, passion, and perhaps even connections to a woman long missing, seemingly everyone wants the recording, which Gittes refuses to give up until the day of the inquest. Somehow, Gittes edits the recording, leaving Katherine Mulwray's name chopped out of the dialog, shooting, and aftermath of Bodine's murder. This makes the inquest a short, satisfying meeting where the judge has no reason to suspect murder. Jake Berman is now free of criminal charges. Confronted with the knowledge Gittes has of his terminal illness, Berman, knowing the model house he is in is filled with natural gas, convinces Gittes and Nice to leave him alone in the house so he can \"have a smoke.\" He doesn't want an autopsy to interfere with Kitty's inheritance. As they drive off, the house explodes.\nThe story ends with Kitty and Gittes in his office. They speak of regrets, and Kitty kisses Gittes, who rejects her advances, saying \"That's your problem, kid. You don't know who you're kidding.\" She leaves, telling him to \"Think of me time to time\". Jake tells her, \"It never goes away.\""}