{"mid": "TheTwelveChairs", "IMDB_id": "tt0066495", "title": "The Twelve Chairs", "plot": "In the Soviet Union in 1927, a former Marshal of Nobility, Ippolit Matveyevich \"Kisa\" Vorobyaninov, works as the registrar of marriages and deaths in a sleepy provincial town. His mother-in-law reveals on her deathbed that her family jewelry was hidden from the Bolsheviks in one of the twelve chairs from the family’s dining room set. Those chairs, along with all other personal property, were taken away by the Communists after the Russian Revolution. Vorobyaninov wants to find the treasure. The “smooth operator” and con-man Ostap Bender forces Kisa to become his partner, they set out to find the chairs. Bender's street smarts and charm are invaluable to the reticent Kisa, and Bender comes to dominate the enterprise.\nThe \"conсessioners\" find the chairs, which are to be sold at auction in Moscow. They fail to buy them; they learn afterwards that the chairs have been split up for resale individually. Roaming over all of Russia in their quest to recover the chairs, they have a series of comic adventures, including living in a students' dormitory with plywood walls, posing as bill painters on a riverboat to earn passage, bamboozling a village chess club with promises of an international tournament, and traveling on foot through the mountains of Georgia. Father Fyodor (who had known of treasure from the confession of Vorobyaninov's mother-in-law), their obsessed rival in the hunt for the treasure, follows a bad lead, runs out of money and loses his sanity. Ostap remains unflappable, and his mastery of human nature eliminates all obstacles, but Vorobyaninov steadily deteriorates.\nThey slowly acquire each of the chairs, but no treasure is found. Kisa and Ostap finally discover the location of the last chair. Vorobyaninov murders Ostap to keep all the loot for himself, but discovers that the jewels have already been found and used to build the new public recreation center in which the chair was found, a symbol of the new society. Vorobyaninov also loses his sanity.\nThe novel, though short, resonates with all the important events of the time. Numerous side characters, places and institutions are caught in a sharp light, sometimes of satire, sometimes of gentle irony: the operations of a Moscow newspaper, the 3% government bonds, New Economic Policy decadence and so on. The two main characters, among other things, are social types: the déclassé Bender is an individualist foreign to both the old, discredited hierarchy of birthright, epitomized by Vorobyaninov, and the new Communist order. A sort of Reynard the Fox specific to the time and setting, Bender claims to know “four hundred comparatively honest ways of relieving the people of their money,” and he has no future in the Soviet Union."}