{"mid": "TheUltimateGift", "IMDB_id": "tt0482629", "title": "The Ultimate Gift", "plot": "When his rich grandfather, Howard \"Red\" Stevens (James Garner), dies, Jason (Drew Fuller) does not expect to inherit anything from his multi-billion-dollar estate. He strongly resents his grandfather because his father had died while working for him. There is an inheritance, in fact, but it comes with a condition: Jason must complete 12 separate assignments within a year in order to get it. Each assignment is centered around a \"gift\". Gifts of work, money, friends and learning are among the dozen that Jason must perform before he is eligible for the mysterious \"Ultimate Gift\" his grandfather's will has for him. Red's attorney and friend, Mr. Hamilton (Bill Cobbs), and his secretary, Miss Hastings (Lee Meriwether), attempt to guide Jason along the path his grandfather wishes him to travel.\nOn his return after completing the first task, everything he values is suddenly taken away from him – luxury apartment, his restored muscle car, and all his money – and he is left homeless. His trendy girlfriend, Caitlin (Mircea Monroe), ditches him when his credit card is rejected at a fancy restaurant. After his mother (Donna Cherry) tells him she cannot help him, as part of the agreement, he miserably wanders the city alone. While sleeping in a park, he encounters a woman, Alexia (Ali Hillis), and her outspoken daughter, Emily (Abigail Breslin). Jason befriends the two, and then asks them to go to the attorney's office and confirm themselves as his \"true friends\" in order to pass his assignment, but afterwards Jason walks away and ignores Emily's request to see him again. However, Jason accidentally discovers that Emily is suffering from leukemia, and sees a chance to develop a strong bond with someone.\nFrom that point, he tries his best to help Emily have a great life while it lasts, and Emily encourages a romance between Jason and her mother. Another of his tasks requires him to travel to Ecuador and study in a library his father and grandfather built to help the people there. This brings him to address his resentment over the death of his father there, and he makes a trip into the mountains with a local guide to see where it happened. Jason learns from his guide that the story he had always believed about his father's death was a lie, fabricated by his grandfather out of guilt and shame for trying to push Jason's father into the oil business. Jason and the guide are captured there and taken hostage by militants for several weeks, until Jason manages to ensure their escape. He returns to America and discovers that Emily's condition has deteriorated, so he arranges for Gus the ranch-hand to host a belated Christmas celebration at his home for them.\nUpon completing his twelve tasks, Jason is given a sum of $100-million to do with whatever he pleases, and all of his property is returned to him. His former girlfriend, knowing that he has regained his wealth, makes an attempt to win him back but he declines her offer. With his inheritance, Jason chooses to build a hospital, called Emily's Home, for patients with terminal illnesses, but before the building begins, Emily dies. After the groundbreaking for Emily's Home, Jason is recalled to the law firm for one more meeting and told he has exceeded the expectations of his dead grandfather, and he is given the final gift of over $2-billion, rewarding Jason not only for his completing the tasks, but for using the $100-million to help others. That night, Jason is seen sitting on a bench in the park, when Alexia joins him. He thanks her for the help that she and her daughter gave him. Then they kiss, as a butterfly, representing Emily, flies around them."}