{"mid": "TheVirginSuicides", "IMDB_id": "tt0159097", "title": "The Virgin Suicides", "plot": "In the suburbs of Grosse Pointe, Michigan during the mid-1970s, a group of neighborhood boys — now grown men — reflect upon their memories of the five Lisbon sisters, ages 13 to 17. Unattainable due to their Catholic and overprotective parents, math teacher Ronald and his homemaker wife, the girls — Therese, Mary, Bonnie, Lux, and Cecilia — are the enigma that fill the boys' conversations and dreams.\nDuring the summer, the youngest sister, Cecilia, slits her wrist in a bath. After her parents allow her sisters to throw a chaperoned basement party intended to make her feel better, she excuses herself and jumps out of her second story bedroom window, dying when she is impaled on an iron fence below. In the wake of her act, the Lisbon parents watch over their four remaining daughters even more closely. This further isolates the family from the community and heightens the air of mystery surrounding the girls; to the neighborhood boys in particular.\nAt the beginning of the new school year in the fall, Lux forms a secret and short-lived romance with Trip Fontaine, the school heartthrob. Trip comes over one night to the Lisbon residence in hopes of getting closer to Lux and watches television with the family. Trip persuades Mr. Lisbon to allow him to take Lux to the upcoming Homecoming Dance by promising to provide dates for the other sisters. After winning king and queen, Trip persuades Lux to ditch the group and have sex on the football field. Afterwards, Lux falls asleep, and Trip abandons her. At dawn, Lux wakes up alone and has to take a taxi home.\nHaving broken curfew, Lux and her sisters are punished by a paranoid Mrs. Lisbon by being taken out of school. Unable to leave the house, the sisters contact the boys across the street by using light signals and sharing songs over the phone.\nDuring this time, Lux rebels against her repression and becomes promiscuous, having anonymous sexual encounters on the roof of her house late at night; the neighborhood boys spy from across the street. After weeks of confinement, the sisters leave a note for the boys. When the boys arrive that night, they find Lux alone in the living room, smoking a cigarette. She invites them inside to wait for her sisters, while she goes to start the car.\nCurious, the boys wander into the basement after hearing a noise and discover Bonnie's body hanging from the ceiling rafters. Horrified, they rush back upstairs only to stumble across the body of Mary in the kitchen. The boys realize that the girls had all killed themselves in an apparent suicide pact: Bonnie hanged herself; Mary died by putting her head in the gas oven; Therese overdosed on sleeping pills; and Lux died of carbon monoxide poisoning when she left the car engine running in the garage.\nDevastated by the suicides, Mr. and Mrs. Lisbon leave the neighborhood. Mr. Lisbon has a friend clean out the house and sell off the family belongings in a yard sale. Whatever didn't sell was put in the trash, including the family photos, which the neighborhood boys collect as mementos. The house is sold to a young couple from the Boston area. The adults in the community go about their lives as if nothing happened. The men acknowledge that they had loved the girls, and that they will never know why the sisters took their lives."}