{"mid": "TheVampireBat", "IMDB_id": "tt0024727", "title": "The Vampire Bat", "plot": "When the villagers of Kleinschloss start dying of blood loss, the town fathers suspect a resurgence of vampirism, but police inspector Karl Breettschneider remains skeptical. Scientist Dr. Otto von Niemann, who cares for the victims, visits a patient who was attacked by a bat, Martha Mueller. Martha is visited by a mentally challenged man named Herman, who claims he likes bats because they are \"soft like cat\" and \"nice\". On the doctor's journey home, he meets Kringen, one of the townsfolk, who claims to have been attacked by the vampire in the form of a bat, but withheld his story from the town to not spread fear. Dr. von Niemann encourages Kringen to tell the townsfolk of his story. Kringen becomes suspicious that Herman Glieb may be the vampire due to his obsession with bats. Herman lives with bats and collects them off the street.\nDr. von Niemann returns to his home, which also houses Breettschneider's love Ruth Bertin, Ruth's hypochondriac aunt Gussie Schnappmann, and servants Emil Borst and Gorgiana. Fear of the vampire and suspicion of Glieb quickly spread around the town, and people start fearing him. Ms Mueller is killed that night. The analyses of Dr. von Niemann and another doctor, Dr. Haupt, conclude that the death is the same as all of the previous deaths – blood loss, with two punctures in the neck caused by needle-sharp teeth. Gleib enters the examination, and upon seeing the dead body, runs away screaming.\nNext morning, Glieb enters Dr. von Niemann's garden, where Dr. von Niemann, Breettschneider, and Bertin are discussing vampires inside the house. The town fathers enter the house and announce that Kringen is dead and Gleib is missing. An angry mob hunts down Gleib and chases him through the countryside and into a cave, where he falls to his death.\nThat night, Dr. von Niemann is seen telepathically controlling Emil Borst, as he picks up sleeping Gorgiana and takes her down to Dr. von Niemann's laboratory, where a strange organism is seen. They then drain her blood from her neck.\nSchnappmann then discovers Gorgiana's body in her bed. Dr. von Niemann and Breettschneider investigate and find Ms Mueller's crucifix, which Glieb handled the night Dr. von Niemann visited her. Breettschneider is becoming more convinced of the presence of vampires in the village as no other plausible explanations for the deaths can be found. As Glieb was seen in the garden that morning, the two conclude he is guilty.\nUpon hearing of Glieb's death, however, Breettschneider's conviction is erased. Dr. von Niemann tells Breettschneider to go home and take sleeping pills, but gives him poison instead, intent on draining his blood. Bertin discovers Dr. von Niemann telepathically controlling Borst, who is at Breettschneider's house. It is revealed that Dr. von Niemann has created life, and is using the blood to fuel his organism. He ties Bertin up in his lab. Borst supposedly enters with Breettschneider's body on a trolley. Dr. von Niemann walks over to Borst, who is revealed to be Breettschneider (who did not take the pills) in costume, with the real Borst on the trolley. Breettschneider pulls a gun on Dr. von Niemann, and walks over to untie Bertin. Dr. von Niemann then wrestles Breettschneider, who drops the gun. As the two fight, Borst picks up the gun and shoots Dr. von Niemann."}