{"mid": "TheVoid", "IMDB_id": "tt2929232", "title": "The Void", "plot": "Drug fiend James flees from a farmhouse and escapes into the woods. A screaming woman tries to follow, but she is shot and set on fire by Vincent and his son Simon. Deputy Daniel Carter finds James crawling in the road and takes him to a hospital where his estranged wife Alison Fraser, works as a nurse. At the hospital is Dr. Richard Powell, nurse Beverly, intern Kim, pregnant girl Maggie, her grandfather Ben, and patient Cliff. Daniel discovers an entranced Beverly murdering Cliff with her skin removed from her face. Beverly moves toward Daniel who shoots her dead. Daniel collapses due to a seizure and experiences a strange vision.\nWhile everyone struggles to figure out what happened with Beverly, state trooper Mitchell enters the hospital to collect James after discovering a bloody scene at the farmhouse. Daniel goes outside to call in Beverly’s death from his patrol car, but is confronted by robed cultists who wound him. He manages to return to the hospital as cultists surround the building. Daniel and Mitchell rush into James’ room when they hear him screaming. They find Beverly’s corpse has transformed into a tentacled creature as Daniel and Mitchell rescue James and lock Beverly in the room. In the lobby, Vincent and Simon enter and hold the group at gunpoint, demanding to get to James. James takes Maggie hostage to protect himself and stabs Powell, who falls to the floor. The creature emerges from Beverly's room and devours Mitchell. Vincent and Simon kill the creature and regroup with the others in the lobby. Vincent and Simon accompany Daniel to retrieve a shotgun from a patrol car, while Alison ventures into the basement to collect medical supplies for delivering Maggie’s baby. Powell rises from the ground and captures Alison. On discovering that Alison is missing, Daniel and Vincent search for her and find photographs and files indicating Powell was the cult’s leader. Powell phones Daniel, taunting him and mentions the vision he experienced while unconscious.\nKim and Ben stay with Maggie while Daniel, Vincent, and Simon interrogate James. James explains that Powell has the power to transform people. The three men force James to come with them downstairs. Alison regains consciousness on an operating table where Powell explains he has found a way to defy death after the loss of his daughter Sarah. Having cut off his face, Powell shows Alison that something now grows inside her. Daniel, Vincent, Simon, and James find a hidden area in the basement and end up surrounded by deformed corpses brought back to life. One of the creatures kills James as the other three men get separated.\nAs Maggie enters labor, Kim hesitates to perform a C-section. As Ben pleads with Kim, Maggie stands and slits his throat, revealing she is carrying Dr. Powell’s child. Kim hides as cultists enter the building and Maggie leaves. Daniel finds Alison in the operating room pregnant. Looking again at Alison, he sees a creature, with tentacles extending from her body. Powell’s voice speaks to Daniel who finally attacks his wife's mutated remains with an axe. Daniel is transported to a morgue room with a glowing triangle on the wall. Powell’s voice tells Daniel that he found the ability to conquer life and death. Powell promises that Daniel can have his child back if he is willing to die first.\nMaggie appears and stabs Daniel. Powell appears without any skin in front of the triangle as Maggie kneels before him. Powell recites an incantation before the triangle as a now frightened Maggie's torso explodes, as she births the reborn Sarah. Vincent and Simon arrive and battle the beast. The creature envelops Vincent, but he covers it in isopropyl alcohol, allowing Simon to kill them both with a flare. As Powell begins transforming, he tells Daniel he can be with Alison if he gives himself to the abyss. Daniel refuses and tackles him, leading both men to tumble into the void. Meanwhile, the creature pursues Simon who escapes, and is teleported back to the hospital to reunite safely with Kim. Daniel and Alison are shown in the netherworld beneath a black pyramid as they hold hands."}