{"mid": "TheVampireLovers", "IMDB_id": "tt0066518", "title": "The Vampire Lovers", "plot": "It is 1794 in the Austrian Duchy of Styria. Following the death of his sister, Baron Joachim von Hartog [Douglas Wilmer] vows to destroy the vampire Karnstein family. He succeeds in staking every Karnstein except for one, Mircalla Karnstein (1522-1546).Now, it is several years later. General Speilsdorf [Peter Cushing] is throwing a birthday party for his niece Laura [Pippa Steele]. All the young people have been invited including Laura's friend Emma Morton [Madeline Smith], Laura's boyfriend Carl Ebhardt [Jon Finch], a Countess [Dawn Adams] who has just moved into a nearby castle, and the Countessa's daughter Marcilla [Ingrid Pitt]. Suddenly, the Countess is called away due to the death of a friend, but Marcilla stays on as a guest of the Spielsdorfs. Marcilla and Laura become good friends, so good that Laura stops seeing even her boyfriend. Soon, Laura begins having nightmares of a large cat strangling her. Laura grows paler and weaker, and the doctor diagnoses anemia. It is not until Laura dies and the doctor listens for her heartbeat that two puncture wounds are found on her breast. And Marcilla has disappeared.One day, while out riding, Emma and her father come upon a disabled coach bearing a Countess and her niece Carmilla [Ingrid Pitt in a dual role], on their way to tend to the Countessa's dying brother. Emma and her father invite Carmilla to remain as a guest. Carmilla and Emma quickly become fast friends. Soon, Emma begins growing paler and weaker and having nightmares about a big cat with enormous eyes. When the doctor is summoned, he places garlic flowers around the room and a cross on Emma's neck. When Carmilla attempts to visit Emma, she is thwarted by the cross and the garlic. Emma's father is summoned home from Vienna. On the way, he meets up with General Spielsdorf, Baron Hartog, and Laura's ex-boyfriend Carl. Hartog tells them about his encounter with the Karnstein family. He leads them to Karnstein castle where he points out a painting of Mircalla Karnstein. \"Marcilla!\" says General Spielsdorf. \"Carmilla!\" says Morton.Meanwhile, Carmilla has convinced the staff to remove the garlic and cross from Emma's bedroom. She attempts to escape with Emma but is stopped by Carl holding the crosslike-hilt of his sword and chanting \"Aparte Satana!\" Back at Karnstein castle, Spielsdorf, Hartog and Morton see the vampiress return to her grave. They stake her and cut off her head. \"Let us pray that Styria is rid of this evil forever,\" says Morton. [Original Synopsis by bj_kuehl.]"}