{"mid": "TheViolentYears", "IMDB_id": "tt0049922", "title": "The Violent Years", "plot": "The story starts off with 4 girls dressed as boys robbing a gas station. They nearly kill the attendant by bashing him in the head with a gun. Later we find out these are really 4 bad high school girls going on robbery sprees in surrounding towns. The gang is lead by Paula (Jean Moorhead), who takes her 3 accomplices on their crime sprees mainly for kicks.Along with robbing gas stations, the girls end up robbing a young couple in Lover's Lane. They tie up the\nwoman, and take her boyfriend into the woods where they gang rape him (off screen).Paula's father is also a member of the local newspaper, and has been working overtime covering the crime sprees that have been taking the town by storm. Knowing that he has no reason to suspect her, Paula goes to her father under the guise of finding out more about the robberies. Her father explains that local service stations will have an officer in disguise on duty to deter future robberies.With this information, Paula tells her friends that they will be stopping the gas station robberies for now, and go to see a woman named Sheila (Lee Constant). Sheila has been purchasing the items that Paula and her associates have been acquiring, though she and Paula come to heads pretty quickly over how much the ill-gotten loot is worth.When Paula explains that the money really means nothing to her (having plenty at home), Sheila explains that she has some associates who would pay good money if she and her friends would wreck some schools.On the night of Paula's birthday, just like the ones before, her parents are both out. Paula is having a pajama party, though unlike the 'no boys allowed' rule that she told her mother about, her friends have invited along some uncouth boys in their early 20's, and some alcohol is also present.One of her father's co-workers stops by with her father's gift: a new watch. Paula claims she knows this without opening the box, because her parents have been getting her the same birthday gifts every year for quite some time. Along with a new watch, Paula's Mom always trades in her new car from last year for a new one this year.After the co-worker gets in a scuffle with one of the young men at the party, he leaves but cautions Paula to watch out for the company she keeps. Naturally, Paula just dismisses this. Once the co-worker leaves, Paula tells teh guys to leave.Arriving at the local high school, the 4 girls set about to wreck one of the rooms. However, the noise from their vandalism catches the attention of a night watchmen, who radios the police.The girls get into a firefight, in which two of them are killed, and Paula and another girl escape to Sheila's.Paula demands payment for what they did, but Sheila refuses, claiming she'll call the Police. Paula then kills Sheila, and the remaining two girls in the group check Sheila's for new clothing. After leaving the house, the two are spotted by a Police car, and take off. Paula's driving causes her to crash into a store window, killing the last of her classmates.After she has recovered, Paula is put on trial, and sentenced to life in prison. It is also revealed that due to her acts with the young man in Lover's Lane, that she is now pregnant. It is after this that her parents blame themselves for their negligent acts that led to their daughter's crime spree and pregnancy.Eventually, Paula gives birth to a baby girl, but dies from the birth process. Her parents lobby to raise the child, but the judge denies their request, stating that the baby will instead be placed in foster care for a more worthy family to raise the baby girl."}