{"mid": "TheWiz", "IMDB_id": "tt0078504", "title": "The Wiz", "plot": "=== Prologue ===\nDorothy Gale lives with her Aunt Em, Uncle Henry, and dog, Toto, on their farm in Kansas. Though her work on the farm keeps her busy, she often gets distracted in her boredom with farm life, choosing instead to play with Toto and dream of someday seeing far off lands. Aunt Em, however, hasn't much patience for her niece's daydreaming, believing that their way of life doesn't leave room for dawdling. After an argument, Aunt Em apologizes to Dorothy for an unintentionally hurtful remark. She then explains that she only scolds because she wants Dorothy to be the best she can be, and fears that she won't be ready for the responsibilities life will soon put upon her. Underneath it all, she still loves her niece dearly, and hopes they will always be as close as when Dorothy was a child (\"The Feeling We Once Had\").\n=== Act I ===\nWhen an approaching storm turns out to be a tornado, Dorothy takes shelter in the farmhouse as Aunt Em and Uncle Henry hide in the storm cellar. As the tornado hits the farm, the house, with Dorothy inside, is lifted right up into the air and carried for miles within the cyclone (\"The Tornado\"). It finally comes to rest with a bump in the middle of an emerald green field covered with flowers. There, Dorothy is met by the Munchkins, who are all dressed in blue, and Addaperle, the Good Witch of the North, who tells her that she is in the land of Oz. Furthermore, her house has fallen on Evamean, the Wicked Witch of the East, and killed her, freeing the Munchkins from her evil powers. Dorothy, distressed and confused, wants only to return to Aunt Em, Uncle Henry, and Toto in Kansas. With her magic unable to take Dorothy beyond the country boundaries, Addaperle decides her best bet is to follow the Yellow Brick Road to Emerald City in the centre of Oz, and see the great and powerful Wizard of Oz, or \"The Wiz\" for short (\"He's the Wizard\"). She gives the child the Witch of the East's silver slippers, and tells her not to take them off before she reaches home, for they hold a mysterious, but very powerful charm that will keep her safe.\nDorothy sets off down the Yellow Brick Road, full of doubt and fear at what lies ahead (\"Soon As I Get Home\"). Stopping to rest by a cornfield, she is startled when a Scarecrow hanging on a pole strikes up a conversation with her (\"I Was Born on the Day Before Yesterday\"). He tells her of his longing for brains so that he can be like other people, and she invites him to accompany her to see if the Wiz can help him. (\"Ease On Down the Road #1\").\nThe Yellow Brick Road leads them into a great forest where they discover a man made of tin, rusted solid. They oil his joints (\"Slide Some Oil To Me\") and he tells them how, to prevent him from marrying a servant girl, the Wicked Witch of the East put a spell on his axe so that it began to cut off parts of his body. Each time it happened, a tinsmith replaced the missing part with one made of tin until he was entirely made of it. The one thing the tinsmith forgot was a heart, and the Tin Man has longed for one ever since. Dorothy and the Scarecrow invite him on their journey to see the Wizard with the hope that he may give him one (\"Ease On Down the Road #2\").\nThe three continue following the Yellow Brick Road deeper into the forest, where they are attacked by a large lion (\"I'm a Mean Ole Lion\"). However, he is quickly revealed to be a coward hiding behind bravado as Dorothy stands up for her friends. When he learns where they are going, he apologizes and asks if he may accompany them to ask the Wizard for some courage. They agree and the trio becomes a quartet (\"Ease On Down the Road #3\"), but face a new danger when they are attacked by half-tiger, half-bear creatures called Kalidahs (\"Kalidah Battle\"). After a great fight and harrowing escape, they stop by the road to rest. The Lion is embarrassed by his cowardice in the battle, but is comforted by Dorothy's kind words (\"Be a Lion\").\nSeeing a green glow in the distance, they continue their journey to the Emerald City, and wander into a field of poppies who blow opium dust on them. Not being made of flesh, the Scarecrow and Tin Man are unaffected, but Dorothy and the Lion begin to become disoriented and drowsy. Dorothy recalls that the Munchkins warned her of the dangerous poppies, and runs from the field as fast as she can with the Scarecrow and Tin Man behind her. The Lion is overcome by the dust and begins to hallucinate (\"Lion's Dream\"). He is dragged from the field and returned to his friends by the Field Mice who police the area.\nMarching up to the gates of the beautiful Emerald City, they are met by the Gatekeeper who insists they must all be fitted with a pair of green tinted glasses that are locked on to prevent their eyes from being blinded by the dazzling sights. They enter the city and look about in awe at the richly dressed people that inhabit this magnificent place (\"Emerald City Ballet\"). The haughty and condescending people laugh and ridicule this odd party for wanting to see the Wiz until they see that Dorothy is wearing the Witch of the East's silver slippers. The quartet is promptly shown right into his palace.\nOnce in the throne room, they are assaulted by a great show of lights, smoke, and pyrotechnics as the Wiz appears in several forms before them (\"So You Wanted To See the Wizard\"). They each plead their case to him, the Tin Man doing so in song (\"What Would I Do If I Could Feel?\"). The Wiz agrees on one condition: they must kill Evillene, the Wicked Witch of the West. With their goals seeming further out of reach than ever before, Dorothy and her companions sink to the floor in tears.\n=== Act II ===\nEvillene rules over the yellow land of the west, enslaving its people, the Winkies. She is evil, power hungry, and ruthlessly determined to get her hands on the silver slippers, so that she may increase her power and rule over all of Oz (\"Winkie Chant/Don't Nobody Bring Me No Bad News\"). Receiving word of Dorothy and her odd friends approaching, she sends her Winged Monkeys to kill them (\"Funky Monkeys\"). Catching up to the group in the forest surrounding the castle, the monkeys dash the Tin Man against rocks until he falls apart, and rip the straw out of the Scarecrow, leaving both of them helpless. Seeing Dorothy's silver slippers, however, they dare not harm her. Instead, they carry her to Evillene's castle along with the Lion. While searching for a way to get the slippers from Dorothy, the witch forces her and the Lion to do menial chores around the castle. She takes delight in torturing the Lion before Dorothy, threatening to have him skinned unless she hands over the silver slippers. Angered by this, Dorothy picks up a bucket of water and throws it over Evillene, who melts until only her magic golden cap remains. Her spell on the Winkies is lifted, and they show their thanks by restoring the Scarecrow and Tin Man to top condition, and reuniting the four friends (\"Everybody Rejoice\").\nReturning to the Emerald City, they see the Wiz (now a booming voice that seems to come from the very air). He reneges on his promise, and the Lion knocks over a screen in anger. Behind it stands a bewildered man who claims to be the real Wizard. He shows them the elaborate mechanical effects used to create his illusions, and tells them that he is really a balloonist from Omaha named Herman Smith who traveled to Oz by accident when his hot air balloon drifted off course. The people of Oz had never seen such a sight and proclaimed him Wizard. Not wanting to disappoint them, he assumed the role and had a great city built. He then had everyone in it wear green glasses, and in time, the people came to believe it was green.\nFurious, the quartet confronts the Wizard on his deceptions (\"Who Do You Think You Are?\"), but he points out that the Scarecrow, Tin Man, and Lion already have the things they seek as shown in their behavior on the journeys they have made (\"Believe In Yourself\"). They remain unconvinced, so he creates physical symbols of their desires and they are satisfied. He proposes that Dorothy can return to Kansas the way he came, and offers to pilot her in his hot air balloon. He addresses the citizens of the Emerald City in person for the first time in many years, telling them of his imminent journey, and leaving the clever Scarecrow in charge (\"Y'all Got It!\"). Just as his speech reaches its climax, the balloon comes free from its moorings and rises quickly into the air, taking Dorothy's hopes of getting home with it.\nJust as the group despairs of finding help, Addaperle reappears in a flash of light, suggesting that Dorothy ask Glinda, the Good Witch of the South, for assistance. She transports them to Glinda's palace in the red land of the south, where they are warmly welcomed and invited to rest after their many trials (\"A Rested Body Is a Rested Mind\"). Glinda is a beautiful and gracious sorceress, surrounded by a court of pretty girls. She tells Dorothy that the silver slippers have always had the power to take them home, but like her friends, she needed to believe in their magic and in herself before it was possible (\"If You Believe\"). Dorothy bids a tearful goodbye to her companions, and as their faces fade into the darkness, she thinks about what she has gained, lost, and learned throughout her journey through Oz (\"Home\"). Clicking the heels of the silver slippers together three times, she finds herself transported back to Kansas in an instant. As an overjoyed Aunt Em and Toto appear, and Dorothy runs to hug them both, she knows that she is back home at last (\"Finale\")."}