{"mid": "TheWorldOfHenryOrient", "IMDB_id": "tt0058756", "title": "The World of Henry Orient", "plot": "In early 1960s New York City, concert pianist Henry Orient (Peter Sellers) pursues an affair with a married woman, Stella Dunnworthy (Paula Prentiss), while two adolescent private-school girls, Valerie \"Val\" Boyd (Tippy Walker) and Marian \"Gil\" Gilbert (Merrie Spaeth), stalk him and write their fantasies about him in a diary. Orient's paranoia leads him to believe that the two girls, who seem to pop up everywhere he goes, are spies sent by his would-be mistress's husband.\nIn reality, fourteen-year-old Val, the bright and imaginative daughter of wealthy international trade expert Frank Boyd (Tom Bosley) and his unfaithful, snobbish wife Isabel (Angela Lansbury), has developed a teenage crush on Henry after seeing him in concert, and involved her best friend Marian. Although Marian's parents are divorced, Marian lives a relatively happy and stable life in a townhouse in the city with her mother and her mother's also-divorced female friend, while Val, whose parents are still married (albeit unhappily), sees a psychiatrist daily and lives with paid caretakers while her parents travel the world.\nVal's parents return for Christmas, and Val becomes concerned that her mother Isabel is having an extramarital affair with a young pianist. Val's interference leads her mother to find and read Val's diary. Isabel chastises Val and seeks out Henry, ostensibly to tell him to stay away from her underage daughter. The cheating Isabel and the womanizing Henry are quickly attracted to each other and begin an affair, which Val and Marian accidentally discover while stalking Henry outside his apartment. Val's devastation and Isabel's attempts to cover up her own behavior cause Frank to figure out what happened. Frank and Isabel separate, while the paranoid Henry flees the country. However, positive changes for Val result as Frank, who unlike Isabel genuinely cares about his daughter, resolves to stop traveling so much and establish a real home where he and Val can spend more time together. In the end, Val and Marian have matured and moved on from fantasy play to makeup, fashion and boys their own age."}