{"mid": "TheWeddingSinger", "IMDB_id": "tt0120888", "title": "The Wedding Singer", "plot": "In 1985, Robbie Hart (Adam Sandler) is an engaging and entertaining wedding singer from Ridgefield, New Jersey. He is engaged to his long-time girlfriend, Linda (Angela Featherstone), who was attracted to him at a time when he dreamed of becoming a rock star. He meets and befriends a waitress, Julia Sullivan (Drew Barrymore), at the reception hall where he regularly performs. She is also engaged to businessman Glenn Gulia (Matthew Glave) and he promises to sing at their wedding.\nOn their wedding day, Robbie's sister, Kate, tells him that Linda has changed her mind about the wedding, leaving him emotionally devastated and humiliated. Later that day, Linda visits Robbie and she reveals that she stopped loving him when she found out that he lost his ambitions of being a rock star and instead became a wedding singer. She tells him that after talking to her friends, she realizes she can't continue lying to herself and ends their relationship. He tries to move on with his life, but despair hinders his performances. Julia tries to cheer him up and later asks him to help her plan her own wedding. He eventually agrees and their friendship blossoms. Meanwhile, as Robbie spends more time with Julia, he begins to realize just how shallow Linda is. During a double date between Julia and Glenn, and Julia's cousin, Holly (Christine Taylor), Robbie learns that Glenn frequently cheats on Julia and does not plan to stop after they get married.\nJulia and Robbie are increasingly confused by their deepening feelings for each other. He tells her he has plans to retire from singing and pursue a more conventional career, thinking that will impress her. She becomes angry with him for assuming that she is marrying Glenn for his money (although she is under pressure from her worried parents to do just that so she will not tread water as they have). Dismayed, he goes to a bar where his friend, Sammy (Allen Covert), says that guys who refuse to settle down get forgotten, using the example of once-popular TV shows featuring single swinging guys that got cancelled due to the same old schtick, which inspires him to proceed to the Sullivan house to tell Julia how he feels. When he arrives, he sees her through her bedroom window. She is wearing her wedding dress, to which he mistakenly concludes that she is looking forward to marrying Glenn. In actuality, she is expressing doubts about him, particularly her new name of Julia Gulia and imagines herself as Robbie's bride would be nice, hence her imagined glee.\nHeartbroken, Robbie leaves to get drunk and finds Glenn in the midst of his pre-bachelor party. After a heated exchange, he punches Robbie and proceeds to mock him. An intoxicated Robbie goes home and finds Linda waiting for him and wanting to reconcile. He passes out, but the following morning, she answers the door and introduces herself as his fiancée to a crestfallen Julia. She runs to Glenn, wanting to be married immediately. He happily offers to take her to Las Vegas. Before getting on the plane and during the flight, she begins to show regret for planning to marry him.\nRobbie awakens and after shaking off his hangover from the previous night, tells Linda that it's over and kicks her out. Then he attends the 50th wedding anniversary party of his friend, Rosie (to whom he has been giving singing lessons). Inspired by this and with her encouragement, he decides to pursue Julia. Just then, Holly arrives and asks him if he is still with Linda. He reveals he ended it with her and learns of Julia's plans to marry Glenn. He, Sammy, and Holly rush to the airport, where he books a flight to Las Vegas. He gets a first class ticket because all coach seats are sold out. After telling his story to an empathetic audience in first class, which includes Billy Idol (playing himself, sporting his 1980s trademark spiked hairdo and biker attire), he learns that Glenn and Julia are on the same flight as he looks through the curtain separating first class and coach. Over the loudspeaker and with the help of Billy and the flight crew, he sings a song he has written called \"Grow Old With You,\" which he has dedicated to Julia. When he enters the coach section, Glenn tries to attack him, only for his path to be blocked by a male flight attendant and Billy both pushing refreshment carts. When Glenn threatens Billy, a burly fan of his (Al Burke) also wearing biker attire forces Glenn down the aisle and a female flight attendant he tried seducing earlier pushes him into the lavatory. Robbie and Julia admit their love for each other and after Billy briefly interrupts them to offer Robbie support in fulfilling his dream of being a songwriter, they share a kiss. The film ends as the scene fades to a similar kiss, this time at their wedding. David Veltri (Steve Buscemi), a groom's best man from an earlier wedding, becomes the new wedding singer."}