{"mid": "TheWatcherInTheWoods", "IMDB_id": "tt0081738", "title": "The Watcher in the Woods", "plot": "Americans Helen and Paul Curtis and their daughters Jan and Ellie, move into a manor in rural England. Mrs. Aylwood, the owner of the residence who now lives in the guest house next door, notices that Jan bears a striking resemblance to her daughter, Karen, who disappeared inside an abandoned chapel in the woods thirty years earlier.\nJan senses something unusual about the property almost immediately, and begins to see strange blue lights in the woods, triangles, and glowing objects. Eventually, Ellie goes to buy a puppy she inexplicably names \"Nerak\" (an anagram for Karen). After seeing the reflection of the name \"Nerak\" (Karen spelled backwards), Jan is told about the mystery of Mrs. Aylwood's missing daughter by Mike Fleming, the teenage son of a local woman, Mary.\nOne afternoon, Nerak runs into woods, and Ellie chases after him. Jan, realizing her sister has disappeared from the yard, goes into the woods to find her, eventually locating her at a pond. In the water, she sees a blue circle of light, and is blinded by a flash, causing her to fall in; she nearly drowns, but Mrs. Aylwood saves her. Mrs. Aylwood brings Jan and Ellie to her home, and recounts the night her daughter disappeared.\nLater, Mike discovers that his mother, Mary, was with Karen when she disappeared, but she evades his questions. Meanwhile, Jan attempts to get information from John Keller, a reclusive aristocrat who was also there that night, but he refuses to speak to her. On her way home, Jan cuts through the woods, where she encounters a local hermit, Tom Colley, who tells Jan he was also present at Karen's disappearance. He claims that during a seance-like ceremony on the night of a lunar eclipse, Karen vanished when lightning struck the church bell tower.\nJan decides to recreate the ceremony during the upcoming solar eclipse, hoping it will bring Karen back. She gathers Mary, Tom, and John at the abandoned chapel, and they attempt to repeat the ceremony. Meanwhile, Ellie, while watching the eclipse from the front yard, suddenly goes into a trance-like state, apparently possessed, and enters the woods. At the chapel, the ceremony is interrupted by a powerful wind that shatters the windows, and Ellie appears. In a voice that is not her own, she explains that an accidental switch took place thirty years ago, in which Karen traded places with an alien presence from an alternate dimension; thus, the Watcher has been haunting the woods since, while Karen has remained suspended in time.\nThe Watcher then leaves Ellie's body, manifesting as a pillar of light, fueled by the \"circle of friendship\". It engulfs Jan and lifts her into the air, but Mike intercedes and pulls her away before the Watcher disappears. Simultaneously, the eclipse ends, and Karen, still the same age as when she disappeared, reappears – still blindfolded. She removes the blindfold just as Mrs. Aylwood enters the chapel."}