{"mid": "TheWomen", "IMDB_id": "tt0032143", "title": "The Women", "plot": "Based on the 1936 play by Clare Boothe Luce, The Women follows the lives of a handful of wealthy Manhattan women, focusing in particular on Mary Haines (Norma Shearer), the cheerful, contented wife of Stephen and mother of Little Mary. After a bit of gossip flies around the salon these wealthy women visit, Mary's friend and cousin Sylvia Fowler (Rosalind Russell) learns from a manicurist, Olga (Dennie Moore), that Mary's husband has been having an affair with a predatory perfume counter girl named Crystal Allen (Joan Crawford). A notorious gossip, Sylvia delights in sharing the news with Mary's other friends, and sets up Mary with an appointment with Olga so that she hears the same rumor about Stephen's infidelity. While Mary's mother, Mrs. Morehead (Lucile Watson), urges her to ignore the gossip concerning the affair and continue on as if nothing has happened, Mary begins to have her own suspicions about her husband's increasingly frequent claims that he needs to work late, and decides to travel to Bermuda with her mother to think about the situation and hope that the affair and the rumors surrounding it will fade. Upon her return from Bermuda a few weeks later, feeling well-rested and more sure of herself, Mary heads out to a fashion show at a high-end clothing store and learns that Crystal is in attendance, trying on clothes from the show in a dressing room across the hall. Sylvia joins Mary and baits her into storming into Crystal's dressing room and confronting her about the affair. Crystal is completely unapologetic about her ongoing affair with Stephen and is satisfied with her \"meal ticket,\" but does reveal that Stephen's strong feelings of sentiment prevents him from seeking a divorce from Mary in order to marry her. Heartbroken and humiliated by the revelation of the affair, Mary leaves quickly. The meeting will not fade from gossip circles, however, and the situation is only exacerbated by Sylvia, who manages to turn the whole affair into a tabloid scandal by recounting, with physical embellishment, the entire confrontation story to a notorious gossip columnist, Dolly Dupuyester (Hedda Hopper). To save her own pride, Mary chooses to divorce her husband despite his efforts to convince her to stay. Mary explains the divorce to her daughter Little Mary (Virginia Weidler), and the household prepares for Mary's departure.Leaving on a train to Reno where she will spend the necessary weeks until their divorce is legal, Mary meets several women with the same destination and purpose: the dramatic, extravagant Countess De Lave (Mary Boland); Miriam Aarons (Paulette Goddard), the tough cookie chorus girl; and, to her surprise, her good friend Peggy Day (Joan Fontaine), a sweet, shy girl. Upon reaching Reno, Mary and her new friends settle in at a ranch to await their final divorces, and are given plenty of advice by Lucy (Marjorie Main), the plain-spoken and gruffly warm-hearted woman who runs the ranch. Time passes at the ranch, and the women discuss their marriages and impending divorces; the Countess tells tales of her multiple husbands and seems to have found another in Reno, a young cowboy named Buck Winston, whom she will marry shortly; Miriam reveals she has been having an affair with Sylvia Fowler's husband and is in Reno to get a divorce from her current husband so that she can marry him; and the women convince Peggy, who has discovered that she is pregnant, to surrender her pride, call her husband, resolve their misunderstanding and end the divorce proceedings, which she successfully does. During this time, Sylvia Fowler arrives at the ranch, since her husband has requested a divorce. When Sylvia discovers that Miriam is set to become the new Mrs. Fowler, a catfight ensues. Mary succeeds in breaking the fight up, ending with Miriam convincing her that she, too, should forget her pride, and her newly awarded divorce, and call her husband and try to patch things up. Just then, the phone rings. The call is from Stephen who informs Mary that he and Crystal have just been married.Eighteen months pass, and the story picks up in Stephen Haines' apartment, where Crystal, the new Mrs. Haines, is taking a bubble bath and talking on the phone to a new lover. Little Mary enters the bathroom and overhears the conversation, before being shooed away by Crystal, who has no time or patience for her. Through Crystal's interaction with Little Mary and the phone conversation, it becomes clear that Stephen has grown weary of Crystal, but seems to be sticking with her since he has no other options. Sylvia Fowler, who is now friends with Crystal, visits during this time, too, and figures out with whom Crystal has been speaking and having an affair. It is Buck Winston, now wed to Countess De Lave, and now a successful singing radio star. Still an unrelenting gossip, Sylvia tucks this information away for use later. Meanwhile, Mary hosts a dinner for all of her Reno friends, to celebrate the two-year anniversary of her divorce and their time together in Reno. When the dinner concludes, the other women head on to Casino Roof, a nightclub, for the second phase of Mary's party. But Mary suddenly begs off and decides to stay home. Upon leaving, one of the ladies mentions to Mary she would have run into Stephen, Crystal and Sylvia who will be dining together at Casino Roof. While getting ready for bed, she chats with Little Mary, who inadvertently reveals how unhappy Stephen is, as well as mentioning that Crystal is being \"lovey-dovey\" with someone else. This news changes Mary's mind, who decides to get out of bed, dress up and rejoin the party at Casino Roof, intent on fighting to get her ex-husband back.At the nightclub, Mary is seen lurking in the grand powder room. Sylvia and Crystal soon enter together, and Mary makes a casual statement that Sylvia will overhear so she will return to the powder room alone and Mary can fish information out of her. Mary makes sure that gossip columnist, Dolly Dupuyster learns the whole story of Crystal's affair and will make it known by everyone at the nightclub. Mary manages to pit Sylvia and Crystal against each other. Crystal, however, doesn't care about Stephen's lack of affection since she'll now have Buck Winston to support her. The humiliated Countess reveals that she has been funding Buck's radio career and that without her he will be penniless and out of a job. This leaves Crystal resigned to the fact that she'll be heading back to the perfume counter to support herself, while Mary, completely triumphant, heads out the door to win back Stephen, who is waiting for her."}