{"mid": "TheWarGame", "IMDB_id": "tt0059894", "title": "The War Game", "plot": "Filmed in black-and-white with a running time of just under 50 minutes, The War Game depicts the prelude to, and the immediate weeks of the aftermath of, a Soviet nuclear attack against Britain. The narrator says that Britain's current nuclear deterrent policy threatens a would-be aggressor with devastation from Vulcan and Victor nuclear bombers of the British V-bomber force. A Chinese invasion of South Vietnam starts the war; tensions escalate when the United States authorises tactical nuclear warfare against the Chinese. Although Soviet and East German forces threaten to invade West Berlin if the US does not withdraw, the US does not acquiesce to communist demands and the invasion takes place; two US Army divisions attempt to fight their way into Berlin to counter this, but the Russian and East German forces overwhelm them in conventional battle. In order to turn the tide, President Johnson authorises the NATO commanders to use their tactical nuclear weapons, and they soon do so. An escalating nuclear war results, during which larger Russian strategic IRBMs are launched at Britain. The film remarks that many Soviet missiles were, at the time, believed to be liquid-fueled and stored above ground, making them vulnerable to attack and bombings. It hypothesises that in any nuclear crisis, the USSR would be obliged to fire all of them as early as possible in order to avoid their destruction by counterattack, hence the rapid progression from tactical to strategic nuclear exchange.\nIn the chaos just before the attack, towns and cities are evacuated and residents forced to move to the country. On September 7 at 9:15 a doctor visits a family with an ill patient. As he finishes checking up on her and steps outside the air-raid sirens start to wail in the distance, followed by a klaxon horn from a police car. The doctor rushes back in with two civil defence workers and starts bringing tables together to create a makeshift shelter. Suddenly, the town of Rochester is struck by an off-target 1 megaton Soviet thermo-nuclear warhead aimed at RAF Manston, a target which, along with the Maidstone barracks, is mentioned in scenes showing the immediate effects of the attack. The missile's explosion causes instant flash blindness of those nearby, followed by a firestorm caused by the blast wave. The air in the centre of the firestorm is replaced by methane and carbon dioxide and monoxide and the temperature rises to about 500 degrees. The firemen soon pass out from the heat in the chaos. By then the V-bombers carrying green bamboo gravity bombs and blue steel cruise missiles reach the border of the Soviet Union and presumably breach anti-aircraft defences by using a special instrument in their cockpits to jam defending radar signals. They head to their counter value targets, civilian cities. Later, society collapses due to overwhelming radiation sickness and the depletion of food and medical supplies. There is widespread psychological damage and consequently a rising occurrence of suicide. The country's infrastructure is destroyed; the British Army burns corpses, while police shoot looters during food riots. The provisional government becomes increasingly disliked due to its rationing of resources and use of lethal force, and anti-authority uprisings begin. Civil disturbance and obstruction of government officers become capital offences; two men are shown being executed by firing squad for such acts. Several traumatised and bewildered orphan children are briefly featured, questioning whether they have any future and desire to be \"nothing.\" The film ends bleakly on the first Christmas Day after the nuclear war, held in a ruined church with a vicar who futilely attempts to provide hope to his traumatised congregation. The closing credits include an instrumental version of Silent Night."}