{"mid": "TheWarZone", "IMDB_id": "tt0141974", "title": "The War Zone", "plot": "15-year-old Tom (Freddie Cunliffe) is upset after his family move from London to a rural house in Devon, where he misses his friends. He lives with Dad (Ray Winstone), 18-year-old sister Jessie (Lara Belmont), and Mum (Tilda Swinton), who is in the late stages of pregnancy. Tom and Jessie are close to each other and everyone helps Mum during her pregnancy.\nOne night, Mum goes into labour and is driven to the hospital by Dad, accompanied by Tom and Jessie. The car crashes, but nobody is injured and a baby girl is born to much joy around the family. While coming home from shopping with Mum, Tom tells her he doesn't know anybody, but she assures him that he will make friends. When they arrive home, Tom enters the house through the backdoor and something catches his attention.\nTom confronts Jessie and asks about what he saw: Dad and Jessie, naked in a bathtub together. Jessie acts as if nothing happened, but he is definite about what he witnessed. The family go out to a bar and Jessie introduces Tom to her boyfriend Nick (Colin Farrell). The three go out to a beach and engage in awkward conversation. After returning home Tom tells Jessie he suspects her and dad's behaviour has been ongoing. Jessie neither confirms or denies this causing Tom to lash out in anger.\nLater on, Dad tells Mum and Tom he is going for a run. Full of suspicion and armed with a video camera, Tom follows Dad and Jessie into an old war bunker on their ocean-side property to film them. Filming through a hole in the wall he witnesses Dad raping Jessie. Tom walks off and, devastated, throws the camera into the sea.\nTom accuses Jessie of being sick because of her actions with their father. Jessie lets him burn her breast with a lighter in order to make him feel better. Later she takes Tom on a trip to London to see her friend Carol (Aisling O'Sullivan) who attempts to seduce him at Jessie's behest, but stops when she walks in on them.\nOne night, Tom is woken up by Mum, who tells him there is a problem with the baby and they must go to the hospital. At the hospital, Dad and Jessie go home, leaving Tom with Mum and the baby. Tom decides to tell Mum what he saw but becomes scared. Mum takes Tom to see the baby, who is bleeding. He tells Mum never to let Dad near the baby. Before she can respond, he leaves.\nWhen Tom returns home, Dad tells him that Mum called from the hospital and told him what Tom had said to her. While Dad confronts him, Jessie begins crying. Dad asks Tom why he would lie to the family, but Tom says he is telling the truth. Dad demands to know why he said such horrible things about him. Jessie sobs at the table, while Dad shouts at and hits Tom for trying to break up the family. Dad then leaves.\nTom and Jessie lie next to each other and Jessie thanks him for standing up to Dad. Tom and Jessie enter Dad's room after he returns. He continues to deny his behaviour and claims Tom is making things up because he misses London and is unhappy, and threatens to send him into care.\nWhile in mid-speech Tom stabs him in the stomach with a kitchen knife. Dad screams in pain on the floor, Tom and Jessie watch him dying then Tom runs from the house to go to the bunker. Jessie follows him there to comfort him silently. Tom asks what they will do now to no response then walks over and closes the door to the bunker."}