{"mid": "TheWindblownHare", "IMDB_id": "tt0042045", "title": "The Windblown Hare", "plot": "The Three Little Pigs, reading their own story in a book of fairy tales, decide to circumvent the story by selling both the straw house and the wooden house before the Wolf can blow them down.\nBugs is easily conned into buying the straw house cheap. Along comes the Wolf, reading the book, too. As per the plot, he blows down the straw house just as homeowner Bugs starts to greet him with his catchphrase \"Eh, what's up, Doc?\".\nBugs then buys the wooden house from the second pig, and the three then hole up in the brick house – knowing from the book that the Wolf can't blow it down. Along comes the Wolf again, book in hand, and blows down the wooden house over Bugs' objections. That prompts the Bunny to deliver payback to the Wolf.\nTo get revenge on the Wolf, Bugs dresses up as Little Red Riding Hood and skips down the roadway. He meets the Wolf sitting under a tree, reading the end of the story. The Wolf asks the \"girl\" where she is going and Bugs flips the Wolf's book a few pages. The Wolf then speed-reads \"Little Red Riding Hood\" until he realizes he's behind schedule for that story.\nThe Wolf races over to Grandma's house but rather than eat her, he kicks her out of the house with barely time to get her nightclothes on. The Rabbit in Red arrives shortly thereafter. When Bugs Bunny says what big eyes, ears, teeth, and feet the wolf has when he's in grandma's clothing, he pokes both the wolf's eyes, pulls his ears up and down, and pull out his teeth and back in his mouth. The Wolf retaliates by pulling on Bugs' ears, but Bugs counters that by stepping on the Wolf's foot. After both of them strip each other's disguises they argue, with Bugs exclaiming, \"Why, Granny! You're just a wolf in cheap clothing!\"\nBugs then refuses to give the Wolf the \"present\" he brought him. After the Wolf begs Bugs to give him his present, Bugs relents and puts the present (a cake) right into the Wolf's face, telling the Wolf \"you asked for it!\". Pursued down the basement steps of Grandma's house, Bugs turns off the light switch downstairs, making the Wolf to go back to the upstairs switch to restore the light rather than risk Bugs' counterattack. After this procedure is repeated, Bugs tricks the Wolf by saying \"click\" instead of actually turning off the light, prompting the Wolf to automatically turn the upstairs light off and continue down the stairs, allowing Bugs to hit him.\nBugs tries to escape on a bicycle, but it turns out to be a tandem with the Wolf in the second seat. He steers into a clothesline, yanking the Wolf out of the seat. When Bugs chides the Wolf for blowing his houses down, the Wolf explains those are the Pigs' houses and that he's doing what the story says and Bugs then sees what's going on.\nArriving at the brick house, Bugs sees the pigs playing cards and gloating about cheating him into buying their houses. Realizing he was swindled by them intentionally, Bugs directs the Wolf to the pigs' last house to blow it down. The Wolf says he can't because the story says so. However, Bugs tells him to blow the house down regardless and reveals he wants revenge against the pigs for ripping him off. The pigs laugh as the wolf blows, and then the house suddenly blows up. The Wolf says, \"I did it!\" The pigs look at him in surprise and say, \"He did it!\". The scene cuts to Bugs, who pats a TNT detonator, says \"Eh, we did it!\", and laughs smugly."}