{"mid": "TheWomanInGreen", "IMDB_id": "tt0038259", "title": "The Woman in Green", "plot": "When several women are murdered and their forefingers severed, Holmes and Watson are called into action, but Holmes is baffled by the crimes at the start. Widower Sir George Fenwick (Paul Cavanagh), after a romantic night alone with his girlfriend Lydia Marlowe (Hillary Brooke), is hypnotized into believing that he is responsible for the crimes. He is certain that he is guilty after he awakes from a stupor and finds a woman's forefinger in his pocket. His daughter comes to Holmes and Watson without realizing that Moriarty's henchman is following her. She tells Holmes and Watson that she found her father burying a forefinger under a pile of soil. She has dug up the forefinger and shows it to them.\nFenwick is then found dead, obviously murdered by someone to keep him from talking. Holmes theorizes that Moriarty, who was supposed to have been hanged in Montevideo, is alive and responsible for the crimes. Watson is then called to help a woman who fell over while feeding her pet bird. He leaves, and minutes later, Moriarty appears and explains that he faked the phone call so he could talk to Holmes. When Moriarty leaves, Watson arrives. Holmes explains what Moriarty did, notices that a window shade that was shut in the empty house across the street is now open, and tells Watson to investigate.\nInside the empty house Watson, looking through the window, believes that he sees a sniper shoot Holmes in his apartment. Holmes then appears at the house and explains that he put a bust of Julius Caesar there because of the bust's resemblance to his own face (Holmes realized that as soon as he sat there, Moriarty would have him killed). Inspector Gregson takes the sniper, a hypnotized ex-soldier, away, but the sniper is later killed on Holmes's doorstep.\nHolmes now realizes that Moriarty's plan involves:\n1) killing women and cutting off their forefingers,\n2) making rich, single men believe they have committed the crime,\n3) using this fake information to blackmail them, and\n4) counting on the victims being too terrified to expose the scheme.\nHe befriends Lydia, whom he had seen with Sir George at a restaurant, suspecting that she is in cahoots with Moriarty. She takes him to her house, where he is apparently hypnotized. Moriarty enters and has one of his men cut Holmes with a knife to verify that he is hypnotized. He then tells Holmes to write a suicide note (which he does), walk out of Lydia's apartment onto the ledge, and jump to his death.\nWatson and the police then appear and grab the criminals. Holmes then reveals he was never really hypnotized, but secretly ingested a drug to make him appear as if he had been hypnotized and also insensitive to pain. Moriarty then escapes from the hold of a policeman and jumps from the top of Lydia's house to another building. However, he hangs onto a pipe which becomes loose from the building, causing him to fall to his death."}