{"mid": "TheWraith", "IMDB_id": "tt0092240", "title": "The Wraith", "plot": "Bright lights descend from the night sky, revealing a sleek, all black Dodge M4S Turbo Interceptor, driven by a helmeted, black-clad figure, who will be come to known as \"The Wraith.\"\nIn the town of Brooks, Arizona, Packard Walsh (Nick Cassavetes) is the insane evil leader of a gang of car thieves that coerces people with sporty cars into racing for pink slips. He controls everyone through intimidation, including Keri Johnson (Sherilyn Fenn), whom he views as his property. Keri's boyfriend James \"Jamie\" Hankins (Christopher Bradley) has been mysteriously murdered, leaving no trace; Keri, who was with him, was hospitalized with no memory of the traumatic event.\nJacob \"Jake\" Kesey (Charlie Sheen) arrives in Brooks riding a Honda XL350R Enduro dirt bike. He befriends both Keri and Jamie's brother William \"Billy\" Hankins (Matthew Barry), who both work at Big Kay's, the local burger drive-in; they later meet up at a sun-and-swim gathering on a local river, where Jake is seen to have knife scars on his neck and back.\nPackard's control of the illegal races is suddenly over when the Turbo Interceptor appears out of nowhere. The mysterious driver of this supercar is covered head-to-toe in black body armor and a black race helmet. The armor is adorned with metal braces resembling those worn by victims recovering from severe physical trauma. The driver challenges Packard's gang to race, explosively killing Oggie Fisher (Griffin O'Neal) and later Minty (Chris Nash) in high-speed, fiery crashes which leave their bodies untouched except for burned-out eye sockets. Sheriff Loomis (Randy Quaid) and his lawmen are always in hot pursuit, but the Turbo vanishes in a cloud of glowing light.\nTwo more gang members, Skank (David Sherrill) and Gutterboy (Jamie Bozian), who are always too high on drugs to believe in the supernatural, are later obliterated when the Wraith races his supercar through the gang's isolated warehouse garage, causing a huge explosion. With Packard's gang destroyed, Rughead (Clint Howard), the gang's tech-geek, who alone among them had not participated in Jamie's murder, realizes too why the gang had been targeted and talks it over with Sheriff Loomis.\nAfter Packard witnesses Keri kissing Jake, he kidnaps her from the burger joint and beats and kicks Billy when he tries to intervene. When Packard tells her they are going to California, Keri stands up to him and says she will never love him--and divulges her realization that Packard had had Jamie murdered. Just as he gets out of the car and draws his flick knife, the Turbo arrives, and Packard takes up the challenge, only to be killed too. Sheriff Loomis calls off the hunt for the mysterious driver, observing, \"[You] can't stop something that can't be stopped.”\nAs Keri arrives home that night, the Turbo pulls up, and the armored driver emerges, transforming into Jake. Keri realizes that Jake is actually a returned version of her dead boyfriend Jamie, who admits, \"This is as close as I could come to who I once was.\" He then asks her to wait for him because he has one last thing to do.\nJake startles Billy by driving the Turbo to Big Kay's and handing him the keys. He then tells Billy that his work is finished and when Billy asks, \"Who are you, bro?” Jake wryly replies, \"You said it, Billy.” As Jake rides off on his dirt bike, Billy calls after him “Jake,” and then, realizing at last, “Jamie!”\nJake picks up Keri, who is now being watched from a distance by Sheriff Loomis, and together they ride off along the desert highway under a huge moon, leaving the past behind."}