{"mid": "TheWarOfTheRoses", "IMDB_id": "tt0098621", "title": "The War of the Roses", "plot": "Lawyer Gavin d'Amato is in his office discussing a divorce case with a client. Noticing the man's determination to divorce his wife, Gavin decides to tell him the story of one of his clients, a personal friend of his.\nOliver Rose, a student at Harvard Law School, meets Barbara at an auction, where they bid on the same antique. Oliver chats Barbara up and they become friends. When Barbara misses her ferry home, the two end up spending the night together. Eventually the two marry and have two children. Over the years, the Roses grow richer, and Barbara finds an old mansion whose owner has recently died, and purchases it. However, cracks seem to be forming in the family, such as the children being overweight due to Barbara spoiling them with treats. As Oliver becomes a successful partner in his law firm, Barbara, who was a doting and loving wife early in the marriage, appears to grow restless in her life with Oliver, and begins to dislike him immensely.\nOliver, for his part, cannot understand what he has done to earn Barbara's contempt, despite his controlling, self-centered, and generally dismissive behavior toward her. When Oliver believes he is suffering a heart attack, the day after an argument, Barbara does not show any remorse or concern for his well-being, and ultimately admits that she no longer loves him and wants a divorce. Oliver accepts, but tension arises between the two when it becomes clear that Barbara wants the house and everything in it, even using Oliver's final love note to her (which he had written in the hospital) as leverage against him in their legal battle. Barbara initially throws Oliver out of the house, but he moves back in after discovering a loophole that allows him to stay for the time being. As a result, Barbara immediately begins plotting to remove Oliver herself, even trying to seduce Oliver's lawyer Gavin into siding with her instead.\nIn an effort to compromise, Oliver offers his wife a considerable sum of cash in exchange for the house, but Barbara still refuses to settle. Realizing that his client is in a no-win situation, Gavin advises Oliver to leave Barbara and start a new life for himself. In return, Oliver fires Gavin and takes matters into his own hands.\nAt this point, Oliver and Barbara begin spiting and humiliating each other in every way possible, even in front of friends and potential business clients. Both begin destroying the house furnishings; the stove, furniture, Staffordshire ornaments, and plateware. In addition, Oliver accidentally runs over Barbara's cat in the driveway. When Barbara finds out, she retaliates by trapping Oliver inside his private sauna, where he nearly succumbs to heatstroke and dehydration.\nWhile the kids are away at college, Oliver eventually calms down and attempts to make peace with Barbara over an elegant dinner, but reaches his breaking point when Barbara serves him a paté which she implies was made from his dog. Oliver attacks Barbara, who flees into the attic. Oliver boards up the house to prevent Barbara from escaping, while Barbara loosens the chandelier to drop on Oliver to kill him. When their housekeeper Susan pays them an unexpected visit during the night, she senses something is terribly wrong and discreetly contacts Gavin for help. By the time Gavin arrives, Oliver and Barbara's quarrel has culminated in the two hanging dangerously from the insecure chandelier. During this time, Oliver admits to Barbara that despite their hardships, he always loved her, but Barbara does not respond. Before Gavin can come inside with a ladder, the chandelier's support cable snaps and sends them crashing violently to the floor. In his final breaths, Oliver reaches out to touch Barbara's shoulder, but Barbara uses her last ounce of strength to knock his hand away, firmly asserting her feelings for him even in death.\nFinishing his story, Gavin presents his client with two options: either proceed with the divorce and face a horrific bloodbath in court, or go home to his wife to settle their differences properly. The client chooses the latter, and Gavin, satisfied, packs up his office to go home to his own family."}