{"mid": "TheWanderers", "IMDB_id": "tt0080117", "title": "The Wanderers", "plot": "Joey and Turkey are members of the Wanderers, an all-Italian street gang. In the Bronx, Joey tries to dissuade Turkey from joining a rival gang, the Fordham Baldies. Before Turkey can ask, Terror's girlfriend Peewee overhears Joey insulting the Baldies, calling them a \"bunch of pricks with ears\". Joey and Turkey flee and the Baldies chase them. Richie—the leader of the Wanderers—and Buddy come to help but they also flee from the Baldies. After being cornered, the Wanderers are helped by a tough stranger named Perry, who has recently moved to the Bronx from New Jersey. After much persuasion, Perry joins the Wanderers.\nIn school, the Wanderers get into a racial dispute with another gang, the Del Bombers who are all African-American. Both gangs agree to settle their dispute, seemingly a street fight, but the Wanderers struggle to find a gang willing to back them. With no other options, Richie asks his girlfriend's father, local mafia boss Chubby Galasso, who agrees to help solve the gangs' dispute.\nDuring a game of \"elbow-tit\", Richie gropes a woman called Nina. He feels ashamed of himself, apologizes for his actions and persuades Nina to accept Joey's telephone number. The Wanderers then decide to follow Nina in Perry's car.\nAfter Perry becomes lost, the Wanderers are attacked by a gang from Long Island called the Ducky Boys. They escape after Perry's arm is broken.\nWhile drunk, the Baldies are tricked into joining the Marines. Before reporting for training, they decide to crash Despie's party, where Turkey—who has recently joined the Baldies—is told to draw the Wanderers outside. After drawing them out, Turkey realizes the Baldies have abandoned him. He tries to chase them but fails. Upset, Turkey visits a nearby Catholic church. After being spotted by a member of the Ducky Boys attending mass, Turkey is chased down the street. After climbing a fire escape ladder in an attempt to escape, falls to his death.\nIn school, while the Wanderers are mourning Turkey's death, the rest of the gang oust Richie for sleeping with Joey's date Nina. After the assassination of President John F. Kennedy, Richie rekindles his relationship with Despie. When Chubby discovers his daughter is pregnant, he forces Richie into marrying her.\nIn the climax, we discover the Wanderers and the Del Bombers are settling their dispute not with a street fight but with a football game organized by Chubby. Richie uses the opportunity to make amends with Joey. A member of the Ducky Boys interrupts the game, as the Wanderers momentarily turn their heads, hundreds of Ducky Boys invade the field. Many of the Wanderers and the Del Bombers flee, but some stand their ground. The remaining players join forces with spectator gangs in the stands, including one called the Wongs and even Emilio. After a long and bloody battle, the Ducky Boys flee.\nAfter being physically abused by his father Emilio, Joey decides to spend the night at Perry's apartment. Perry tells Joey he is planning to leave the Bronx and move back to New Jersey. Joey asks Perry if he can go with him; after an initially skeptical response, Perry agrees. Emilio, drunk, enters Perry's apartment and fights with him; Joey knocks Emilio unconscious with a glass bottle. Joey and Perry quickly leave the apartment and head to Richie's engagement party. They say an emotional goodbye to Richie; when they leave, Richie realizes things will not be the same. At Richie's party, members of the Wanderers, the Del Bombers and the Wongs embrace one another while singing \"The Wanderer\". The movie ends with Joey and Perry traveling to California."}