{"mid": "TheWard", "IMDB_id": "tt1369706", "title": "The Ward", "plot": "At the North Bend Psychiatric Hospital in 1966, a young patient named Tammy is attacked and killed by an unseen force during the night.The next day, Kristen (Amber Heard), a beautiful but troubled young woman, finds herself bruised and cut, whilst setting fire to an abandoned farmhouse. The local police find her and take her to the psychiatric hospital.She is taken to the ward where she meets the other patients that reside there, Iris (Lyndsy Fonseca), Sarah (Danielle Panabaker), Emily (Mamie Gummer), and Zoey (Laura Leigh). She is given Tammy's old room and is given medication so that she can rest for the night. While Kristen sleeps, her blanket is mysteriously pulled under the bed. Waking up to retrieve her blanket, Kristen finds a broken charm bracelet.The next morning, she meets Dr Stringer (Jared Harris). In his office, Dr Stringer tells Kristen that she had the address of the farmhouse written on her hand and asks about the fire and what she remembers. Kristen is unable recall anything and insists that she is not crazy. Later that night, she attempts to escape only to be caught by one of the orderlies and returned to her cell. Waking up in the middle of the night, Kristen catches a glimpse of a horribly disfigured figure who was staring at her through her door window.While in the courtyard with Iris and Emily, Kristen sees two people looking at her from Dr Stringer's office. The girls give no clue as to who they are, only to tell Kristen that they have been there before many times. Whilst taking a shower, Kristen is suddenly attacked by the disfigured figure. However, upon telling the nurse this, she is drugged and put through intense electroshock therapy.Dr Stringer runs a therapy session with all of the girls, where Tammy's existence is briefly mentioned but quickly dismissed. Iris attends her last therapy session with Dr Stringer where he uses hypnotherapy to unlock Iris' hidden memories. After the session, Iris is kidnapped and killed by the disfigured figure.Kristen, concerned about Iris, confronts the girls and staff about her disappearance but everybody keeps quiet. Kristen finds Iris' sketchbook and looks through all of the drawings to find a picture of a girl named Alice and another picture of the ghostly figure that had attacked her previously, with the name Alice Hudson at the top of its page. Retrieving the broken bracelet, Kristen pieces together the letters, which spells out the name \"ALICE\".Kristen confronts Dr Stringer and tries to convince him that the ghost of Alice Hudson is haunting the girls. Dr Stringer denies the existence of a ghost and cryptically tells her that she needs to find the answers out for herself. Kristen confronts the girls about Alice where Emily confesses that Alice was once a patient at the hospital but that she got out. That night, Kristen and Emily attempt to escape the ward. Their escape is discovered and the alarm is raised. Kristen makes it to the front entrance of the hospital but Alice's ghost appears in front of her, causing her to fall over in fright. Kristen blacks out and awakens back in her room the next morning. It is revealed that Emily was caught by the orderlies during the escape.On her way to her final appointment with Dr Stringer, Sarah is attacked and killed by Alice's ghost. Kristen finds out from Zoey and Emily that all of the girls killed Alice Hudson because she did bad things to them all and her ghost is now after them for revenge. Emily breaks down and, with the help of Alice's ghost, commits suicide. Kristen plans a last ditch attempt to escape by holding Zoey hostage. Her attempt is thwarted by an orderly and Dr Stringer. Kristen is drugged and placed in a straitjacket inside her room. However, she manages to escape and takes Zoey with her. They are both pursued by the orderlies and the ghost throughout the hospital. Zoey is captured by the ghost in a service lift.After pursuing Kristen through Dr Stringer's office, Kristen manages to kill the ghost. Returning the the office to look for Zoey, Kristen finds a file on Alice Hudson, which details her treatments and all of the girls names, including Kristen's.Dr Stringer enters and reveals the truth to Kristen: Her real name is Alice Hudson. Throughout the film, various flashbacks are shown of a young girl in chains, about to be abused by an unknown man. It is revealed that the girl in the flashback is Alice herself, who was kidnapped from her home 8 years previously. Alice was left chained up for months in the basement of the same farmhouse \"Kristen\" had burned down. It is then revealed that Alice is suffering from multiple personality disorder, creating Zoey, Sarah, Iris and Emily. Over time Alice's own personality became so overwhelmed by that of the others that she became lost. Through experimental techniques, Dr Stringer explains that her treatments were working until \"Kristen\" appeared. \"Kristen\" is yet another invention of Alice's mind to protect itself from reliving the trauma at the farmhouse. Dr Stringer had used hypnotherapy in an attempt to reawaken Alice's memories. After this revelation, Alice's ghost reappears and throws herself and \"Kristen\" out of the window, reawakening Alice.It is revealed that the people who were looking at \"Kristen\" earlier were in fact Alice's parents and have come to take her home under supervision. After gathering her belongings, Alice takes one last look around her room. Upon opening her wall cabinet, \"Kristen\" suddenly comes out and attacks her."}