{"mid": "TheWomanInTheWindow", "IMDB_id": "tt0037469", "title": "The Woman in the Window", "plot": "After criminology professor Richard Wanley sends his wife and two children off on vacation, he goes to his club to meet friends. Next door, Wanley sees a striking oil portrait of Alice Reed (Joan Bennett) in a storefront window. He and his friends talk about the beautiful painting and its subject. Wanley stays at the club and reads Song of Songs. When he leaves, Wanley stops at the portrait and meets Reed, who is standing near the painting watching people watch it. Reed convinces Wanley to join her for drinks.\nLater, they go to Reed's home, but an unexpected visit from her rich lover Claude Mazard (Arthur Loft) leads to a fight in which Wanley kills Mazard. Wanley and Reed conspire to cover up the murder, and Wanley disposes Mazard's body in the country. However, Wanley leaves many clues, and there are a number of witnesses. One of Wanley's friends from the club, district attorney Frank Lalor (Raymond Massey) has knowledge of the investigation, and Wanley is invited back to the crime scene, as Lalor's friend, but not as a suspect. There are several comic dialogues in which Wanley appears to know more about the murder than he should. As the police gather more evidence, Reed is blackmailed by Heidt (Dan Duryea), a crooked ex-cop who was Mazard's bodyguard. Reed attempts to poison Heidt with a prescription overdose when he returns the next day, but Heidt is suspicious and takes the money without drinking the drugs. Reed tells Wanley, who overdoses on the remaining prescription medicine.\nHeidt is killed in a shootout immediately after leaving Reed's home, and police believe Heidt is Mazard's murderer. Reed, seeing that the police have killed Heidt, races to her home to call Wanley, who is slumped over in his chair, and apparently he dies. In an impossible match on action, Wanley awakens in his chair at his club, and he realizes the entire adventure was a dream in which employees from the club were main characters in the dream. As he steps out on the street in front of the painting, a woman asks Wanley for a light. He adamantly refuses and runs down the street."}