{"mid": "TheWrongTrousers", "IMDB_id": "tt0108598", "title": "The Wrong Trousers", "plot": "The film begins at 62 West Wallaby Street on Gromit's birthday at breakfast. After being tipped out of bed and dressed using several mechanical contraptions, Wallace is greeted with a large pile of overdue bills. Wallace remembers Gromit's birthday and presents Gromit with a pair of “ex NASA” robotic \"Techno Trousers\", acquired by Wallace to alleviate the burden of taking Gromit for walks. While Gromit is out on a \"walk\", Wallace realises they are in financial difficulty and decides to let the spare bedroom out.\nHe is answered by an inscrutable looking penguin named Feathers McGraw. The penguin comes to stay at the house, pushing Gromit out of his comfortable bedroom, into the spare bedroom and keeping him awake at night with loud organ music, much to Gromit's aggravation. On the other hand, Wallace takes a liking to him. Feathers also takes an interest in the Techno Trousers after seeing Gromit use their suction feet to walk on the ceiling while decorating the spare bedroom. Distressed that Feathers has barged in on his relationship with his master, Gromit packs up his belongings and leaves home. After watching Gromit leave, Feathers secretly modifies the Techno Trousers for his own use. He removes the controls on the trousers and adapts them into a remote control.\nThe next morning, Gromit hunts for suitable lodgings. He notices a wanted poster offering a reward for the capture of a \"chicken\" – actually a criminal penguin who disguises himself by wearing a rubber glove on his head. Meanwhile, Wallace's normal morning routine is interrupted when his expected trousers are replaced with the modified Techno Trousers.\nTrapped inside the \"wrong trousers\", Wallace is marched out of the house and sent running around town on an extended test run, unaware that Feathers is controlling them. Gromit witnesses this spectacle and later spies on Feathers as he measures up the exterior of the city museum. He returns home and uncovers Feathers' plans to steal a large diamond from the museum.\nHowever, Feathers returns and Gromit is forced to hide. He watches as Feathers arrives dressed in the \"chicken disguise\". In a deep sleep after the day's misadventures, Wallace is unwittingly brought into the robbery by Feathers. Feathers marches him out of the house to the museum and uses the trousers' suction feet to climb up the building. The penguin controls the trousers from a window sill, while Wallace enters the building through a roof air vent and walks across the ceiling to the room with the diamond, narrowly avoiding the laser burglar alarm system.\nThe helmet Wallace is wearing contains a remote controlled claw that Feathers uses to hook the diamond. He narrowly succeeds, but accidentally dislodges a ceiling tile and sets the trousers off balance and thus causes the claw to swing into the laser and triggers the burglar alarm and wakes Wallace up.\nFeathers marches Wallace out of the museum and back to the house. The penguin reveals himself to be Wallace's lodger, and traps him in a wardrobe. Gromit confronts Feathers, but the penguin draws a gun and forces Gromit into the wardrobe, locking them both inside. Using his electronics expertise, Gromit tampers with the trousers' circuits to make them march and break open the wardrobe.\nThere follows a chase aboard Wallace and Gromit's train set, as Gromit tries to stop Feathers from escaping with the stolen diamond. Wallace's attempts to assist are mostly unsuccessful, though he manages to remove Feathers' gun and free himself from the trousers. Feathers' train collides with the trousers, and he is captured in a bottle, taken to the police station, and imprisoned in a zoo.\nWallace and Gromit celebrate paying off their debts with the substantial reward money. Meanwhile, the Techno Trousers, unceremoniously consigned to the dustbin, walk off by themselves into the sunset."}