{"mid": "TheWizardOfOz", "IMDB_id": "tt0032138", "title": "The Wizard of Oz", "plot": "The film begins in Kansas, which is depicted in a sepia tone. Dorothy Gale lives with her dog Toto on the farm of her Aunt Em and Uncle Henry. Dorothy's dog gets in trouble with a mean neighbor, Miss Almira Gulch, when Toto bites her. However, Dorothy's family and the farmhands are all too busy to pay her any attention. Miss Gulch arrives with permission from the sheriff to have Toto put down. She takes him away, but he escapes and returns to Dorothy, who then decides to run away from home, fearing that Miss Gulch will return.\nThey meet Professor Marvel, a phony but kindly fortune teller, who realizes Dorothy has run away and uses his crystal ball to dupe her into believing that Aunt Em is ill so that she must return home. She races home just as a powerful tornado strikes. Unable to get into her family's storm cellar, she seeks safety in her bedroom. A wind-blown window sash hits her in the head, knocking her out. Dorothy then awakens to find the house has apparently been picked up and sent spinning up into the air by the twister. She looks outside the window and sees an elderly lady (not Aunt Em as some thought) in a chair, several farm animals, two men rowing a boat, and Miss Gulch (still pedaling her bicycle), who transforms into a cackling Wicked Witch of the East flying on a broomstick.\nThe farmhouse crashes in Munchkinland in the Land of Oz, and just as Dorothy opens the door of her house the film changes to Technicolor. Glinda the Good Witch of the North and the Munchkins welcome her as their heroine, singing \"Ding-Dong! The Witch Is Dead\" - the house has landed on and killed the Wicked Witch of the East, leaving only her feet poking out from under the house. In the middle of the celebration, the Wicked Witch of the West arrives in a ball of smoke and fire to claim her sister's ruby slippers, but Glinda transports the shoes onto Dorothy's feet before the witch can get them. The Wicked Witch of the West swears revenge on Dorothy for her sister's death. Glinda tells Dorothy to follow the yellow brick road to the Emerald City, where the Wizard of Oz might be able to help her get back home.\nOn her way, Dorothy meets and befriends the Scarecrow, who wants a brain, and is invited by Dorothy to join her on her journey. Eventually Dorothy and Scarecrow come to an apple tree orchard where Dorothy picks an apple off a tree and the trees come to life and scold her for it. But Scarecrow taunts and provokes the trees, causing them to become angry and throw apples at him. As Dorothy picks up the thrown apples, she and Scarecrow find and befriend the Tin Woodman, who desires a heart. After they invite the Tin Man to come along, the Witch appears and makes threats to the three of them. Then deep in the woods, they meet the Cowardly Lion, who is in need of courage and he too is invited to come along as well. After the Witch attempts to stop them several times, they finally reach the Emerald City. Inside, after being initially rejected, they are permitted to see the Wizard (who appears as a large disembodied head surrounded by fire). He agrees to grant their wishes when they bring him the Witch of the West's broomstick (which implies they must kill her to get it).\nOn their journey to the Witch's castle, the group passes through the Haunted Forest, while the Witch views their progress through a crystal ball. She sends her winged monkeys to attack the group; they capture Dorothy and Toto. At the castle, the Witch receives a magical shock when she tries to get the slippers off Dorothy, then remembers that Dorothy must be dead first. Toto escapes and leads her friends to the castle. After ambushing three Winkie guards, they march inside wearing the stolen guards' uniforms and free her, but the Witch discovers them and traps them. However, the Scarecrow uses the Tin Man's axe to cut a rope nearby and send a gigantic chandelier, swinging overhead, down onto the Witch's soldiers, knocking them to the floor and the quartet attempt to escape. The Witch and her guards chase them through the castle, across battlements and finally surround them. When the Witch sets fire to the Scarecrow, Dorothy puts out the flames with a bucket of water which splashes on the Witch and it causes her to melt away. The guards rejoice that she is dead and give Dorothy the charred broomstick in gratitude.\nBack at the Emerald City, the Wizard delays granting their requests. Then Toto pulls back a curtain and exposes the \"Wizard\" as a normal middle-aged man who has been projecting the fearsome image; he denies Dorothy's accusation that he is a bad man, but admits to being a humbug. He then gives the Scarecrow a diploma, the Lion a medal, and the Tin Man a ticking heart-shaped watch, making them realize that they had what they wanted all along, they just did not know it yet. He then prepares to launch his hot air balloon to take Dorothy home, but Toto chases a cat, Dorothy follows, and the balloon leaves without them. Suddenly, Glinda returns and tells her that she can still return home by using the Ruby Slippers. Dorothy then shares a tearful farewell with her friends. Following Glinda's instructions, Dorothy taps her heels together three times and repeats, \"There's no place like home\". Dorothy wakes up in bed at her home in Kansas, surrounded by her family, the farmhands, Professor Marvel and Toto. Though her family and friends dismiss her adventure as a dream, Dorothy insists that it was all real, and that there is no place like home."}