{"mid": "TheyMadeMeAFugitive", "IMDB_id": "tt0039895", "title": "They Made Me a Fugitive", "plot": "Clem Morgan, demobilised from the Royal Air Force and unemployed after the war, is drawn into the world of crime. His psychopathic crime boss Narcy (short for Narcissus) deals in the black market, transporting goods in coffins to his headquarters in a funeral parlour. Clem finds the activity harmless enough, until one day he finds drugs in the latest coffin. Clem objects and tells his girlfriend, Ellie, that he will quit after one last job that night, the looting of a warehouse. Narcy betrays him, triggering the burglar alarm while he is inside. Clem manages to get back in the car with Narcy and another member of the gang, Soapy, before they drive off. When Narcy orders Soapy to run down a policeman, Clem grabs the wheel in an unsuccessful attempt to save the man's life and the car crashes into a lamppost. Narcy knocks him unconscious and has him moved to the driver's seat before fleeing with Soapy. Inspector Rockliffe arrives on the scene with other police officers to find the police officer dead and Clem injured in the car.\nClem is convicted of manslaughter and sentenced to fifteen years in prison in Dartmooor. Sally Connor, Narcy's girlfriend, visits him in prison, telling him that Narcy is now with Ellie (who has not visited Morgan in prison) and that she knows he was framed as she was told so by Cora, Soapy's girlfriend. Sally offers to try and persuade Soapy to give evidence but Clem tells her to go away.\nBack in London, Sally tells Cora that she has seen Clem and wants to go and speak to Soapy to get him to tell the police what really happened, but Narcy has found out that Sally has gone to see Clem in prison and brutally beats her up.\nClem escapes from prison and the police start a manhunt for him. He seeks shelter in a remote farmhouse, where Mrs. Fenshaw lets him bath, shave and change his clothes, and also cooks him some food. Mr. Fenshaw comes into the room, but turns out to be a hopeless drunk who is hardly aware of his surroundings. Mrs.Fenshaw then tries to get Clem to shoot her husband, stating that as he is already a murderer it won't make any difference to him. Clem refuses and leaves, but he has handled the gun, leaving his fingerprints on it, and Mrs. Fenshaw uses it to shoot her husband dead.\nClem is now wanted for the murder of Mr. Fenshaw as well, but maks his way back to London and goes to stay with Sally; he then manages to escape both the police and Narcy, but Sally is kidnapped by Narcy and his gang and taken to their hideout, where Cora is already being held. Cora is forced to tell Narcy where Soapy is hiding out (in a room in a rundown hotel nearby) and Narcy sends Jim to go and kill Soapy, which he does.\nClem, whilst trying to find Cora and Soapy, is caught by Rockliffe, who tells him that he is not convinced by Mrs. Fenshaw's story, the first indication that the police might believe in Clem's innocence. In order to use him as bait, Rockliffe lets Clem go, and he goes to the Valhalla funeral parlour to meet with Narcy's gang. After knocking other members of the gang out, Clem and Narcy end up fighting on the roof of the parlour, before Narcy falls to the ground. Rockliffe, Sally and Clem gather round, begging Narcy, who is dying, to tell the truth about who killed the policeman but Narcy sticks to his story and repeats that it was Clem, before dying. Rockliffe leads Clem away, whilst Sally promises to wait for him. The ending is rather ambiguous, as Clem presumably has to return to prison, and he is also facing a possible murder charge; all that Rockliffe can do is promise to look at any new evidence that comes up."}