{"mid": "TheYakuza", "IMDB_id": "tt0073918", "title": "The Yakuza", "plot": "Retired detective Harry Kilmer (Robert Mitchum) is called upon by an old friend, George Tanner (Brian Keith). Tanner has been doing business with a yakuza gangster, Tono (Eiji Okada), who has kidnapped Tanner's daughter to apply pressure in a business deal involving the sale of guns. Tanner hopes that Kilmer can rescue the girl using his Japanese connections.\nKilmer and Tanner had been Marine MPs in Tokyo during the post-war occupation. Kilmer became aware of a woman, Eiko (Keiko Kishi), who was involved in the black market so that she could procure penicillin for her sick daughter. Kilmer intervened on behalf of Eiko during a skirmish, saving her life. After they'd been living together, with Kilmer repeatedly asking Eiko to marry him, her brother Ken (Ken Takakura) returned from an island where he'd been stranded as an Imperial Japanese soldier. Both outraged that she was living with his former enemy and deeply indebted to Kilmer for saving the lives of his (apparently) only remaining family, Ken disappeared into the yakuza criminal underground and refused to see or speak to his sister. Eiko, cautious to do nothing to offend Ken further, broke off contact with Kilmer. Before returning to the US, Kilmer bought Eiko a bar (with money borrowed from George Tanner) which she operates to this day, named Kilmer House in his honor. Kilmer has never stopped loving her.\nKen's debt to Kilmer, giri, is a lifelong obligation that traditionally can never be repaid. Tanner believes that Ken would therefore do anything for Kilmer, including rescuing Tanner's daughter. Traveling to Tokyo with Tanner's bodyguard Dusty (Richard Jordan), they stay at the home of another old military buddy named Oliver Wheat (Herb Edelman). Kilmer visits Eiko at the bar's closing time, seeking to find Ken. Eiko's feelings for Kilmer are clearly as strong as ever. He also becomes reacquainted with Eiko's daughter, Hanako, who is delighted to see Kilmer again. Eiko tells Kilmer that her brother can be found at his kendo school in Kyoto.\nKilmer travels by train to visit Ken at his kendo school. Ken is no longer a yakuza member, but will still help Kilmer. They find and free the girl. In so doing, Ken \"takes up the sword\" once again, attacking one of Tono's men to save Kilmer. This is an inexcusable intrusion by Ken in yakuza affairs. Contracts on both Ken's and Kilmer's lives are issued. Despite Tanner's protests, Kilmer insists on staying until the danger to Ken can be resolved. Eiko suggests he see Ken's brother, a high-level legal counselor to the yakuza chiefs. Goro (James Shigeta) is unable to intercede due to his impartial role in yakuza society, but suggests Ken can remove the death threat by killing Tono with a sword. The only alternative is for Kilmer to kill Tono himself, by any means (as an outsider, he is not bound to use a sword). Because Kilmer is known to Goro as an unusual gaijin who understands and accepts Japanese values, he proposes that Kilmer now has an obligation to Ken.\nAfter an attempt on Kilmer's life at a bathhouse, he learns that his old friend Tanner has taken out the contract on him. Tanner secretly is broke and owes Tono a huge debt. Dusty discloses that Tanner and Tono are business partners. During a violent attack on Ken and Kilmer in Oliver Wheat's house, Dusty is stabbed to death with a sword and Eiko's daughter, Hanako, is shot and killed.\nSeeking advice again from Ken's brother, Goro advises them that they have no choice but to assassinate Tanner and Tono. This will embarrass the partners in the eyes of the yakuza. Goro discloses that he has a \"wayward son\" who has joined Tono's clan and asks that Ken protect him should he be caught in the battle. In private, Goro then discloses the shocking family secret to Kilmer that Eiko is not Ken's sister but his wife, and Hanako their only child. Kilmer comprehends the true meaning of Eiko and Ken's rift, and Ken's anguish at the death of Hanako, all brought about by his repeated intercessions in their lives.\nKilmer storms into Tanner's apartment and kills him, then joins Ken for a near-suicidal attack on Tono's residence. During a prolonged battle, after Ken kills Tono in the traditional way with a katana, Goro's son attacks them and Ken kills him in self-defense. Bearing the news to his brother, Ken moves to commit Seppuku, but his brother pleads with his brother not to bring more anguish to their family. Instead, Ken performs yubitsume (the ceremonial yakuza apology by cutting off one's little finger). After Ken excuses himself, Goro compliments Kilmer on his adherence to Japanese traditions, and dedication to his family.\nBefore leaving Japan, Kilmer visits with Ken at home and asks to speak to him formally. While Ken prepares tea, Kilmer quietly commits yubitsume, and when Ken enters the room, waits for him to be seated. Sliding the folded handkerchief that contains his finger to Ken, he says \"please accept this token of my apology\" for \"bringing great pain into your life, both in the past and in the present.\" Ken accepts, and Kilmer asks that \"if you can forgive me, then you can forgive Eiko,\" adding, \"you are greatly loved and respected by all your family.\" Ken professes that \"no man has a greater friend than Kilmer-san,\" and Kilmer, overcome by emotion, says the same of Ken. Their obligations now apparently resolved, Ken takes Kilmer to the airport, and both men bow formally to each other before parting."}