{"mid": "TheyDiedWithTheirBootsOn", "IMDB_id": "tt0034277", "title": "They Died with Their Boots On", "plot": "George Armstrong Custer (Flynn) enters West Point and quickly establishes himself as a troublemaker by showing up in an outlandish uniform he had designed himself, which makes him appear to be a visiting foreign general. After the misunderstanding, he signs up as a cadet and begins to stack up demerits for pranks and a general disregard for rules while at the Point. When the Civil War breaks out, Custer is at the bottom of his class.\nCuster's relationship with Libbie Bacon (from Monroe, Michigan) begins at the Point; walking a punishment tour, he is not allowed to speak, but he is approached by Libbie who asks him for directions. As soon as his punishment ends, he runs after her, explaining his rude silence, and asking if he may come by her front porch that evening. After speaking with Libbie, Custer and other members of his class are graduated early and ordered to report to Washington, D.C. for assignment. As a result, Custer misses his evening appointment.\nOnce in the capital, Custer makes the acquaintance of Gen. Winfield Scott (Sydney Greenstreet) while dining, who then aids him in getting placed with the 2nd U.S. Cavalry. He becomes a war hero after disregarding a superior's orders during a crucial battle, successfully defending a bridge for the Union infantry. He is awarded a medal while recovering in a hospital after being shot in the shoulder; he then gets leave to return to his home in Monroe, Michigan. He meets Libbie at her home but her father, who has been the butt of Custer's joke earlier that day, orders him to leave. Custer returns to his regiment.\nDue to a miscommunication from the Department of War, he is promoted to the rank of Brigadier General and takes command of the Michigan Brigade at the Battle of Gettysburg. He wins the day, and many victories follow him thereafter on his path to the Confederate surrender at Appomattox, which ends the Civil War.\nUpon returning home to Monroe as a war hero, Custer marries Libbie in a big ceremony, which includes a regimental honor guard, but he soon grows bored with civilian life and begins drinking too much. Libbie visits Custer's old friend Gen. Scott and begs him to assign Custer to a regiment again. He agrees, and Custer is given a Lt. Colonel's commission in the Dakota Territory.\nWhen Custer and Libbie arrive at Fort Lincoln, Custer finds the soldiers a drunken, rowdy and undisciplined lot in need of firm leadership. His old West Point enemy, Ned Sharp (Arthur Kennedy), who has a government license to run the fort's trading post and saloon, is providing Winchester repeating rifles to the local Native Americans. Furious, Custer stops the rifle sales and permanently closes the saloon. He then instills proper military discipline in his men and introduces a regimental song, \"Garryowen\", both of which quickly brings fame to the U.S. 7th Cavalry under Custer's command. The 7th has many engagements with Lakota tribal chief Crazy Horse (Anthony Quinn), who eventually offers peace, wanting a treaty that will protect the sacred Black Hills; Custer and Washington sign the treaty, but soon it is bankrupting Sharp's trading posts. Sharp spreads a rumor that large gold deposits have been discovered in the Black Hills. American settlers stream into the area in violation of the treaty, but Custer and his troops permit no infractions. To embarrass Custer, Sharp passes out free bottles of liquor to Custer's men hours before they drunkenly pass in revue, in complete disarray, before Commissioner Taipe, a politician in league with Sharp. Custer punches both Sharp and the commissioner in anger, and he is quickly relieved of his command.\nCuster hears from Libbie about Sharp's attempts to start a gold rush in the Black Hills, a plan that would bring him much business and large profits. Outraged, Custer takes the information to the U.S. Congress, but they only ridicule him. When news arrives that the presence of gold miners has led to open conflict between the Indians and U.S. troops, Custer appeals in person to President Ulysses S. Grant, one soldier to another, who restores him to command.\nCuster comes to realize that his men are marching into a valley where thousands of Indians are waiting. Knowing they will have no chance, he has a final, emotion-filled goodbye with Libbie and leads his men into battle. Arrows and bullets fly and horses trample into the valley, where all of Custer's forces are killed. Earlier, Sharp has been forced by Custer to ride with the 7th \"to Hell or glory. It depends on one's point of view\", Custer tells him, \"At least you can take glory with you\". Sharp admits with his dying breath that Custer may have been right about \"glory\". Custer is killed by a rifle shot fired by Crazy Horse.\nA few corrupt politicians have goaded the western tribes into war for personal profit, threatening the survival of all white settlers in the Dakota Territories. Custer and his men have given their lives at the Battle of the Little Bighorn to delay the Indians' advance and prevent this slaughter. A letter left behind by Custer, now considered his dying declaration, names the culprits and absolves the Indians of all responsibility; Custer has won his final campaign."}