{"mid": "TheyShootHorsesDontThey", "IMDB_id": "tt0065088", "title": "They Shoot Horses, Don't They?", "plot": "A young boy by the name of Robert sees his hillbilly father shoot a horse with a broken leg to put it out of its misery.Years later, it's the Great Depression, the 1930's. Robert dreamed of being a great filmmaker but is now almost broke. He decides to enter a Los Angeles dance marathon, a craze that many people are falling into in California with the promise of winning cash. It is there that he meets his first dance partner, a beautiful but caustic and bitter woman named Gloria, apparently recovering from a suicide attempt. For her, after years of bad luck with men and no money herself, the dance competition offers her false happiness. Together, she and Robert form a friendship.As the competition goes on, it becomes evident that the show host, Rocky, doesn't have much money himself and, despite showing genuine remorse about it, he frequently exploits and psychologically abuses the dancers and makes a spectacle out of them for the viewers of the show, who pay him a great deal of money every day just to get into the arena. Alice, an aspiring actress, goes into hysterics when her beloved dress is stolen, and a man's leg becomes paralyzed. When he falls unconscious, he is given castor oil and doused in ice water, and then forced to dance again. A pregnant woman dances and has to race with her husband around a track, often becoming exhausted and collapsing.Gloria becomes frustrated and snaps at Robert, jealous of the attention he gives to Alice, who bears a resemblance to Marilyn Monroe. When Robert discovers that Rocky is the one who stole and ripped up Alice's dress, he questions him, but Rocky tells him that it's just show business, and that the spectators want to see the dancers as miserable as they themselves feel because of the Depression.During a repeated, timed race around a track, Gloria's new dance partner, an elderly sailor, has a heart attack and dies, which Rocky cheerfully covers up from the audience. Upon seeing his death, Alice has a mental breakdown, losing her mind and hiding in the shower. Rocky, having seen similar breakdowns time and time again in his business, hugs her and then walks her to the nurses on duty, where she will presumably have to be sent away to psychiatric care.When Robert and Gloria partner up again, Rocky suggests that they marry each other as a publicity stunt for the show, trying to bribe Gloria with tons of free wedding gifts. He then lets it slip that even if Gloria and Robert do win the dance competition, they'll have to pay hidden expenses and will be left with next to nothing in cash, and he cautions her to get out while she can with her dignity still intact. She and Robert leave and, both nearly penniless and dejected, they walk down to the ocean at night, a place Robert has always adored but that now does nothing for him. Gloria repeatedly breaks down and cries, and reveals that it was never really the money or material items she was after, it was the promise of happiness, something she has been longing for but has now lost forever. At the end of her rope, she tries to shoot herself in the head but can't find the courage to pull the trigger, so she pleads for Robert to do it for her. Robert shoots her and is taken in by the police (meanwhile his misery at the death of his only friend is viewed by a circle of rubberneckers from the streets, despite the police trying to block off the death site). When a cop asks Robert why he did it, Robert says, \"she asked me to - they shoot horses, don't they?\" before he is locked up in jail.The film ends with a view of Rocky shouting out to the crowd at the dance competition, and the crowd is cheering and laughing, while the competing dancers look miserable and depressed."}