{"mid": "ThingsToCome", "IMDB_id": "tt0028358", "title": "Things to Come", "plot": "In the British city of \"Everytown\", businessman John Cabal (Raymond Massey) cannot enjoy Christmas Day, 1940, with the news everywhere of possible war. His guest, Harding (Maurice Braddell), shares his worries, while his other friend, the over-optimistic Pippa Passworthy (Edward Chapman), believes it will not come to pass, but if it does, it will accelerate technological progress. An aerial bombing raid on the city that night results in general mobilisation and then global war.\nCabal, now piloting a biplane, shoots down a one-man enemy bomber. He lands and pulls his badly injured enemy (John Clements) from the wreckage. As they dwell on the madness of war, they have to put on their gas masks, as poison gas drifts in their direction. When a little girl runs towards them, the wounded man insists she take his mask, saying he is done for anyway. Cabal takes the girl to his aeroplane, pausing to leave the doomed man a revolver. The man dwells on the irony that he may have gassed the child's family and yet he has saved her. A gun shot is then heard.\nThe war continues into the 1960s, long enough for the people of the world to have forgotten why they are fighting. Humanity enters a new Dark Age. The world is in ruins and there is little technology left, apart from the firearms used to wage war. In 1966 a biological weapon called the \"wandering sickness\" is used by the unnamed enemy in a final desperate bid for victory. Dr. Harding and his daughter struggle to find a cure, but with little equipment it is hopeless. The plague kills half of humanity and extinguishes the last vestiges of central government.\nBy 1970 a local warlord called Rudolf, but known as the \"Boss\" or \"Chief\" (Ralph Richardson) has risen to power in southern England and eradicated the sickness by killing the infected. He dreams of conquering the \"hill people\" to obtain coal and shale to render into oil so his biplanes can fly again.\nOn May Day 1970, a sleek, futuristic aeroplane lands outside of what remains of Everytown. The sole pilot, John Cabal, emerges and proclaims that the last surviving band of \"engineers and mechanics\" have formed a civilisation of airmen called \"Wings Over the World\". They are based in Basra, Iraq and have renounced war and outlawed independent nations. The Boss takes the pilot prisoner and forces him to work for Gordon, a mechanic struggling to keep the Boss's remaining aeroplanes flying. Together, they manage to repair one of them. When Gordon takes it up for a test flight, he leaves to alert Cabal's friends.\nGigantic flying wing aircraft arrive over Everytown and saturate its ruins and population with sleeping gas globes. The Boss orders his biplanes to attack, but they prove to be ineffective. The people awaken shortly thereafter to find themselves under the control of the airmen of Wings Over the World and the Boss dead from a fatal reaction to the sleeping gas. Cabal observes, \"Dead, and his old world dead with him ... and with a new world beginning\".\nA montage follows, showing decades of technological progress, beginning with Cabal explaining plans for global consolidation by Wings Over the World. By 2036, mankind lives in modern underground cities, including the new Everytown.\nAll is not well, however. The sculptor Theotocopulos (Cedric Hardwicke) incites the populace to demand a \"rest\" from all the rush of progress, symbolised by the coming first manned flight around the Moon. The modern-day Luddites are opposed by Oswald Cabal, the head of the governing council and grandson of John Cabal. Oswald Cabal's daughter Catherine (Pearl Argyle) and Maurice Passworthy (Kenneth Villiers) insist on manning the capsule. When a mob later forms and rushes to destroy the space gun, used to propel the projectile toward the Moon, Cabal launches it ahead of schedule.\nLater, after the projectile is just a tiny light in the immense night sky, Oswald Cabal delivers a stirring philosophical monologue about what is to come for mankind to his troubled and questioning friend, Raymond Passworthy (Chapman), the father of Maurice. He speaks passionately to progress and humanity's unending quest for knowledge and advancement as it journeys out into immensity of space to conquer the stars and beyond. He concludes with the rhetorical questions, \"All the universe or nothingness? Which shall it be, Passworthy? Which shall it be? ...\""}