{"mid": "ThingsToDoInDenverWhenYoureDead", "IMDB_id": "tt0114660", "title": "Things to Do in Denver When You're Dead", "plot": "Jimmy \"The Saint\" Tosnia is an ex-gangster living in Denver. Jimmy left the criminal world, to \"go straight\" with his \"Afterlife Advice\" business, where dying people videotape messages for their loved ones. His business isn't doing well and his former boss, a local crime lord known as \"The Man With The Plan,\" has bought up his debt in order to command a favor involving the crime lord's son, Bernard, who has been arrested for child molestation. The Man With The Plan, who was left a quadriplegic after an attempt on his life, wants Jimmy to persuade Bernard's ex-girlfriend Meg to come back to him; The Man With the Plan believes this will cure Bernard of his pedophilia.\nA reluctant Jimmy recruits his friends Easy Wind, Pieces, Big Bear Franchise and the rage-prone Critical Bill. The plan is to have Pieces and Critical Bill pose as police officers, intercept Meg's current boyfriend, Bruce, and intimidate him until he agrees to break up with Meg. Things go wrong when Bruce grows suspicious of the two men's identities and mocks them, whereupon Critical Bill stabs Bruce in the throat. The commotion wakes up Meg, sleeping in the back of Bruce's van. Meg's appearance startles Pieces, who accidentally shoots her dead.\nThe Man With The Plan is furious at the outcome of their botched mission. He informs Jimmy that he will allow him to live, as long as he leaves Denver, but his crew have been sentenced to \"buckwheats,\" to be assassinated in a gruesome and painful manner.\nJimmy's friends come to terms with their impending deaths as they are stalked by a hit man, Mr. Shhh, who never fails. Pieces accepts his fate, Mr. Shhh providing a quick death. Easy Wind goes into hiding with a gang lord called Baby Sinister, but is given up after Mr. Shhh infiltrates and kills most of Sinister's entourage. Because Franchise has a family to raise, Jimmy pleads with The Man With The Plan to spare his life. The Man With The Plan agrees to do so, then betrays Jimmy, having Franchise killed while attempting to flee with his family. The betrayal makes Jimmy vengeful; in turn, Jimmy is also sentenced to buckwheats.\nMr. Shhh finally locates Critical Bill holed up in his apartment, but is ambushed by Bill and the two end up killing each other. In the wake of Mr. Shhh's death, the contract on Jimmy falls to a trio of Mexican brothers. In his final hours, Jimmy says goodbye to a young woman he had fallen in love with, Dagney.\nKnowing that he will most likely be killed, Jimmy murders Bernard for all the misery he indirectly brought upon the group. He also impregnates Lucinda, a prostitute, in order to fulfill her wish of becoming a mother. As he narrates an Afterlife Advice video, Jimmy gives advice to his unborn child. The trio of killers catch up to Jimmy and he takes his death with grace. Jimmy and his friends are then seen together having drinks in the afterlife."}