{"mid": "Thirst", "IMDB_id": "tt0080016", "title": "Thirst", "plot": "Kate Davis [Chantal Contouri] is waking up. As she becomes more lucid and realizes that\nshe's been sleeping in a coffin, she begins to scream. She runs to the\nlittle hole in the wall that is her only contact with the outside world.A few weeks ago, Kate was living a wonderful life. She is beautiful,\nwealthy, lives in a fancy house, has handsome architect Derek Whitehall [Rod Mullinar] for a boyfriend, and she's planning a four week holiday in the\nStates. She doesn't know it, but her life is about to be turned upside\ndown. It begins the next morning when Kate goes to the front gate to pick\nup her milk and newspaper. Her cat accidentally knocks over the milk\ncarton and blood, not milk, spills out. The next thing Kate knows, she's\nbeen drugged and taken to the Q.A.S.T.A. Research Facility where she is\npoked, prodded, and questioned by a team of researchers. Turns out that\nKate is a descendent of Elizabeth Bathory and that she has been kidnapped\nby The Brotherhood, a worldwide cartel of modernday vampires who think of\nthemselves as a superior race that has gained youth, power, and\nimmortality through the drinking of human blood. They procure their blood\nby raising \"blood cows,\" humans raised under controlled conditions so as\nto keep their blood free from contaminants and allergens. The blood from\nthe human bloodcows is harvested by attaching them to a milking machine which sucks\nthe blood from their veins. The blood is then processed, poured into milk\ncartons, and distributed to the other vampires. Q.A.S.T.A. is but one of\nseveral such farms that supply human blood to over 70,000 vampires around\nthe world.The aim of the Brotherhood is to awaken Kate to her legacy and\nrekindle in her the thirst for human blood. Mrs Barker [Shirley Cameron], one of the lead\npsychologists, wants to start Kate's \"conditioning\" immediately. Dr Gauss [Henry Silva]\nthinks that Kate is too strong-willed and that the conditioning might\ndrive her insane, but he goes along with Barker's plan anyway. Mr Hodge [Max Phipps],\nalso of some hoidy-toidy vampire lineage that is never identified, can't\nwait to mate with Kate and unite their blood lines. Only Dr Eric Fraser [David Hemmings]\nseems concerned with Kate's welfare and wants to use reason and persuasion\nto get her to willingly join them as their Baroness. Kate will have\nnothing to do with it, no matter how many times they try to force her to\ndrink blood. When Barker and Gauss place Kate in the room with only a tiny\nhole through which to view the outside world, as it was done to her\nancestor, Dr Fraser makes them release her. Kate attempts to run away, but\nshe is hunted down and brought back to the farm. It looks like there is no\nescape.Tonight is the opening ceremony for The Farm's Festival. Visiting\nvampires from around the world will be attending. Kate is invited to\nparticipate but refuses. That night, just after midnight, she is awakened\nby the chanting of \"Hyma Perpetui\" (Human Blood Always), the motto of The\nFarm. Kate peeks in the chapel door and witnesses an elderly vampire\ndrinking the blood from the neck of a young bloodcow. Kate's screams\ndisrupt the service. Barker is not pleased, but Fraser reminds her that\nKate needs time. Against Fraser's advice, however, Barker decides to\nproceed with the conditioning. First, Kate is drugged. When she wakes up,\nshe finds herself on a picnic with Derek. After making love to Derek, Kate\nbites into a chicken leg and gets a mouth full of blood. Derek suddenly\nturns into Hodges, who thanks her for honoring him. Feeling soiled, Kate\njumps into a nearby river. When she emerges, a rainstorm is hitting. She\nseeks shelter and finds herself at the gate of her own house where she is\nmet by her maid, Lori Dantry [Rosie Sturgess]. Lori assures Kate that she only left the\nhouse an hour ago and escorts her to the shower. Kate strips and enters\nthe shower stall, but the shower spews out blood. \"The thirst is in all of\nus,\" Lori consoles. Kate screams, \"NOT IN ME!\"Suddenly, Kate is 5-years old. She is being sent off to boarding\nschool where she learns that her mother has died. Mrs Barker's voice tells\nKate to \"Cut your ties with the past,\" but Kate goes in search of her\nmother, Barker, Lori, anyone. Instead, she finds herself in a room that\nseems to be collapsing around her. Only when she picks up a mug of blood\ndoes the destruction stop, but she pours the blood onto the floor.\nSuddenly something starts hacking through the door with an axe. Terrified,\nKate finds another mug of blood, but this time she drinks it and the\nhacking stops. For the next fourteen days of her programming, she\nwillfully drinks the blood whenever it is given to her. Everyone is\npleased with Kate's progress except for Dr Fraser. \"Let us hope that,\ndespite all this, we're still able to earn her respect,\" is his only\ncomment.It is several days later. Dressed in regal splendor, Kate is\npreparing to engage in ceremonial blood-drinking. Urged on by whispers of,\n\"It's your destiny,\" Kate allows the silver fangs to be placed in her\nmouth, a cut to be made in the bloodcow's neck, and she willingly bends\nforward and begins drinking the spurting blood. Again, everyone is\nimpressed, but Mrs Barker wants to make sure that Kate's indoctrination\nwill hold up in the outside world, so they send her home. The\nindoctrination appears to be holding, as Kate willingly drinks from the\nneck of her secretary but, when it comes to drinking from Derek, she\nbalks. Mrs Barker decides that Kate needs more conditioning, but Dr Fraser\nrefuses to allow it. Before the committee can meet to discuss what to do\nabout Kate, Fraser decides to help Kate escape. He first releases Derek\nfrom the cell where he is being held. As they attempt to escape from The\nFarm, they are seen by Mrs Barker. Derek runs, but Fraser stays to\nstruggle with Barker. Barker falls into a blood processing vat. While the\nworkers try to figure out what is blocking the number three tube from the\nvat, Fraser goes back to get Kate and they prepare to take off in a\nhelicopter. Unfortunately, Gauss sees them and grabs the runner of the\nhelicopter as it takes off. Gauss eventually falls off, lands on a string\nof high voltage wires, and is fried to a crisp.Fraser leads Kate to a hut in the woods where he says that Derek is\nwaiting for her. What she finds, however, is Derek being exsanguinated.\nKate orders Fraser to release Derek. As Kate and Derek embrace, Fraser\nputs in a pair of fangs. Kate begs Fraser for a second chance. \"I AM one\nof you,\" she says over and over as Fraser drinks her blood. In the\ndistance, Hodges' voice can be heard thanking Fraser for heading up the\nconditioning program that will now make it possible for the two greatest\nvampire families to be united forever. [Original Synopsis by bj_kuehl.]"}