{"mid": "ThisGunForHire", "IMDB_id": "tt0035432", "title": "This Gun for Hire", "plot": "In wartime San Francisco, chemist and blackmailer Albert Baker (Frank Ferguson) is killed by hit man Philip Raven (Alan Ladd), who recovers a stolen chemical formula. Raven is double-crossed by his employer, Willard Gates (Laird Cregar), who pays him with marked bills and reports them to the Los Angeles Police Department as stolen from his company, Nitro Chemical Corporation of Los Angeles. Raven learns of the set up and decides to get revenge. LAPD detective lieutenant Michael Crane (Robert Preston), who is vacationing in San Francisco to visit his girlfriend, nightclub singer Ellen Graham (Veronica Lake), is immediately assigned the case. He goes after Raven, but the assassin eludes him.\nMeanwhile, Gates hires Ellen to work in his LA nightclub. She is taken to a clandestine meeting with Senator Burnett (Roger Imhof), where she learns that Gates and Nitro Chemical are under investigation as suspected traitors, and is recruited to spy on Gates. She and Gates board a train for Los Angeles, followed by Raven. By chance, Raven and Ellen sit next to each other. The next morning, Gates is alarmed when he sees them asleep with Raven's head on her shoulder. He wires ahead to alert the police, but Raven forces Ellen at gunpoint to help him elude them again. He is about to kill her but is interrupted by workmen, allowing Ellen to flee. She tries to contact Crane, but he has left San Francisco to return to LA.\nThat evening the suspicious Gates invites Ellen to his Hollywood mansion, where his chauffeur Tommy (Marc Lawrence) knocks her unconscious to set up a fake suicide. Crane goes to the mansion looking for Ellen but Gates has already left. While Crane questions Tommy, Raven arrives and hides outside, where he sees Tommy discard Ellen's purse, to keep Crane from spotting it. Raven realizes that Ellen is in danger. After Crane leaves, Raven knocks Tommy down a flight of stairs when the chauffeur denies Ellen is still there. Raven searches the house and rescues her. Tommy recovers and warns Gates at his club, where Crane has caught up with him. Raven and Ellen are confronted as they enter the club, so Raven takes her hostage as he flees. She surreptitiously drops monogrammed playing cards as a trail of \"breadcrumbs\". The police corner them in a railroad yard but wait for daylight to move in.\nRaven reveals to Ellen that he was orphaned at a young age and raised by an abusive aunt. One day, he snapped while she was beating him and killed her, for which he was imprisoned in reform school; there, he was abused by the other children. She tells him that the formula he recovered was for a poison gas that Nitro is selling to the Japanese and begs him to extract a signed confession instead of killing Gates. Ellen helps Raven escape the dragnet, hoping she has appealed to his patriotism. However he breaks his promise to her and kills a policeman to get away.\nRaven arrives as Nitro Chemical conducts a gas attack drill and its employees wear gas masks, obscuring their faces. Gates orders Tommy to guard his door. Tommy spots Raven and gives chase, but Raven knocks him out. Raven disguises himself in Tommy's uniform and gas mask to surprise Gates, forcing him to take him to company president Alvin Brewster (Tully Marshall), the mastermind of the treasonous Nitro sale. Raven barricades himself with them when the police and Ellen arrive, and coerces both into signing a confession. Brewster dies of a heart attack while trying to kill Raven, who then kills Gates. Crane is lowered on a scaffold and exchanges gunfire with Raven, wounding him. Raven passes up the opportunity to kill Crane when he sees Ellen helping the detective. Other police fatally shoot Raven, but he lives long enough to assure Ellen that he got the confession and receive her assurance that she did not turn him in."}