{"mid": "ThisIsEngland", "IMDB_id": "tt0480025", "title": "This Is England", "plot": "In 1983, 12-year-old Shaun gets into a fight at school with a boy named Harvey after he makes an offensive joke about his father, who died in the Falklands War. On his way home, Shaun comes across a gang of young skinheads led by Woody, who feels sympathy for Shaun and invites him to join the group. They accept Shaun as a member, and he finds a big brother in Woody, while developing a romance with Michelle, also known as Smell, an older girl who dresses in a new wave style.\nCombo, an older skinhead, returns to the group after a prison sentence, accompanied by a knife-wielding moustachioed man called Banjo. A charismatic but unstable individual with sociopathic tendencies, Combo expresses English nationalist and racist views, and attempts to enforce his leadership over the other skinheads. This leads the group to split, with young Shaun, the belligerent Pukey, and Gadget, who feels bullied by Woody for his weight, choosing Combo over Woody's apolitical gang.\nShaun finds a mentor figure in Combo, who in turn is impressed by and identifies with Shaun. Shaun goes with Combo's group to a National Front meeting. After Pukey expresses doubt over their racist and nationalistic politics, Combo throws him out of his group and sends him back to Woody. The gang then engages in bigoted antagonism of, among others, shopkeeper Mr Sandhu, an Indian shopkeeper who had previously banned Shaun from his shop.\nCombo becomes depressed after Lol, Woody's girlfriend, rejects him when he admits that he has loved her since they had sex years before. To console himself, Combo buys cannabis from Milky, the only black skinhead in Woody's gang. During a party, Combo and Milky bond while intoxicated, but Combo becomes increasingly bitter and envious when Milky shares details of his many relatives, comfortable family life and happy upbringing, everything that Combo lacked. Enraged, Combo enters a frenzied state and brutally beats Milky unconscious, while Banjo holds down Shaun, and Meggy watches them on in horror. A pissed-off Combo throws Shaun out of his flat after defending Milky, then slams the door hard. When Banjo attempts to hit Milky as well, Combo violently beats him and evicts him and Meggy from the apartment. Horrified at the realisation of what he has done, a remorseful Combo weeps over Milky's body. Shaun and Combo later take Milky to a nearby hospital.\nThe film cuts forward to Shaun, who's looking at a picture of his dad who died in the Falklands in his bedroom contemplating the incident and brooding about what has happened, with his mother Cynthia assuring Shaun that Milky will be all right. Shaun is then shown walking near the beach and throwing his St George's Flag, a gift from Combo, into the sea."}