{"mid": "ThisMustBeThePlace", "IMDB_id": "tt2075357", "title": "This Must Be the Place", "plot": "Cheyenne is a wealthy former rock star, now bored and jaded in his 20-year retirement in Dublin. He retired after two of his teenaged fans committed suicide. He travels to New York to reconcile with his estranged father during his final hours, only to arrive too late. The reason he gives for not communicating with his father for 30 years was that his father rejected him when he put on goth make-up at the age of 15. He reads his father's diary and learns about his father's persecution in Auschwitz at the hands of former SS officer Alois Lange. He visits a professional Nazi hunter named Mordecai Midler who tells him that Lange is small fry.\nCheyenne begins a journey across the United States to track down Lange. Cheyenne finds the wife of Lange, Lange's granddaughter and a businessman. He buys a large gun. At the gun shop, a bystander delivers a soliloquy about a certain type of pistol that allows people to \"kill with impunity,\" and given that ability, \"if we’re licensed to be monsters we end up having just one desire – to truly be monsters.\"\nWhen Cheyenne eventually tracks Lange down with the aid of Mordecai, Lange, now blind, says that he received hate mail from Cheyenne's father for decades. Lange recounts the incident that led to Cheyenne's father's obsession with Lange, in which Cheyenne's father peed his pants from fear; Lange describes this as a \"minor incident\" in comparison to the true horrors of Auschwitz, but mentions that he came to admire the man's single-minded determination to dedicate his life to making his own miserable. Cheyenne takes a photo of Lange and whispers that it was an injustice for his father to die before Lange did. Cheyenne forces the old blind man to walk out into the salt flats naked, like a Holocaust victim; skin and bones and numb with fear. Cheyenne and Mordecai drive away soon afterwards, leaving him still standing in the flats.\nCheyenne travels home via airplane (something he had previously had a strong phobia of), cuts his rockstar hair and stops wearing his goth make-up, jewelry and outfits."}