{"mid": "ThreeOclockHigh", "IMDB_id": "tt0094138", "title": "Three O'Clock High", "plot": "Meek high school student Jerry Mitchell (Casey Siemaszko) and his kid sister Brei (Stacey Glick) have the house to themselves as their parents are on vacation. Jerry's day begins badly when he wakes late, and gets worse when he nearly wrecks his car while driving his sister and his school friend Franny (Anne Ryan) to Weaver High School, where the students this morning are gossiping about the new student Buddy Revell (Richard Tyson), a violent delinquent who has transferred in today from a continuation high school.\nJerry's first hour is at the school newspaper where his best friend, Vincent Costello (Jonathan Wise), is the editor. The teacher has the idea of doing an article about Buddy to welcome the \"new kid\" and she assigns Jerry to do the interview. In a men's room, Jerry sees Buddy and clumsily attempts to introduce himself and brings up the idea of the article. Through a series of poorly chosen statements, Jerry realizes he is only making Buddy angry and ultimately decides to cut his losses and tells Buddy to \"...just forget this whole thing happened\", giving Buddy a friendly tap on the arm. Buddy, who does not like being touched by others, responds by tossing Jerry against a wall and stating that the two must fight in the parking lot after school at 3 o'clock.\nWith little more than six hours until the encounter, Jerry tries different strategies to avoid the fight. Trying to reason with Buddy in the hallway doesn't work. Vincent suggests that he plant a switchblade in Buddy's locker to get him kicked out of school (which backfires). Brei advises him to simply skip school, but when Jerry tries to drive away, he finds the switchblade stuck in the steering wheel, and the car ignition wires cut. Trying to run, Jerry is caught by an overzealous school security guard, Duke (Mitch Pileggi), who finds the switchblade and takes Jerry to the office of Mr. Dolinski (Charles Macaulay), the Dean of Discipline. Seeing an otherwise perfectly clean school record, the now suspicious Mr. Dolinski informs Jerry that he will be keeping his eye on him from now on and lets him go.\nJerry makes several other attempts to avoid the fight: he steals money from the school's student store, which he manages, and pays an upperclassman to take care of Buddy; he tries to get thrown into detention by making a pass at his English teacher; he lets Buddy cheat by copying his answers during his final period math quiz. All of these efforts fail.\nUltimately after trying to befriend Buddy, he offers him the cash he took earlier to call off the fight. Buddy accepts the money, but scornfully calls Jerry \"the biggest pussy I ever met in my life.\" Jerry, seized with self-loathing and anger, decides to confront Buddy and demand his money back. When Buddy refuses, Jerry insists that he is no coward and declares that the fight is on.\nThe fight begins in a parking lot, with hundreds of eager students observing. Principal O'Rourke, Mr. Dolinksi, Duke, Franny and even the guilt-plagued Vincent attempt to intervene, but Buddy easily disposes of them. Jerry, though obviously out-matched, still manages to stand his ground and ultimately uses Buddy's brass knuckles to knock out the bully and win the fight.\nThe next day, many students show their appreciation to Jerry for giving them such a great fight (one student had set up a betting pool and did quite well), and begin buying individual sheets of paper from the school store for $1 each (at the suggestion of a remorseful Vincent) to help Jerry make up the lost student store cash. Buddy shows up silencing the bustling crowd and begrudgingly shows respect by returning the $350. Weaver High is now filled with gossip as Jerry replaces Buddy as the hot talk of the school, with the rumors having a wide and humorous range of alignment with the truth."}