{"mid": "ThreeLittlePigs", "IMDB_id": "tt0024660", "title": "Three Little Pigs", "plot": "Practical Pig, Fiddler Pig and Fifer Pig are three brothers who build their own houses with bricks, sticks and straw respectively. All three of them play a different kind of musical instrument – Fifer Pig \"toots his flute, doesn't give a hoot and plays around all day,\" Fiddler Pig \"with a hey diddle diddle, plays on his fiddle and dances all kinds of jigs\" and Practical Pig is initially seen as working without rest. Fifer and Fiddler build their straw and stick houses with much ease and have fun all day. Practical, on the other hand, \"has no chance to sing and dance for work and play don't mix,\" focusing on building his strong brick house, but his two brothers poke fun at him. An angry Practical warns them \"You can play and laugh and fiddle. Don't think you can make me sore. I'll be safe and you'll be sorry when the Wolf comes through your door!\" Fifer and Fiddler ignore him and continue to play, singing the now famous song \"Who's Afraid of the Big Bad Wolf?\".\nAs they are singing, the Big Bad Wolf really comes by, at which point Fifer and Fiddler reveal they are in fact very afraid of the wolf. Fifer and Fiddler each retreat to their respective houses; the Wolf first blows Fifer's house down (except for the roof) with little resistance. Fifer manages to escape and hides at Fiddler's house. The wolf pretends to give up and go home, but returns disguised as an innocent sheep. The pigs see through the disguise (\"Not by the hair of our chinny-chin-chin! You can't fool us with that old sheep skin!\"), whereupon the Wolf blows Fiddler's house down (except for the door). The two pigs manage to escape and hide at Practical's house, who willingly gives his brothers refuge; in Practical's house, it is revealed that his musical instrument is the piano. The Wolf arrives disguised as a Jewish peddler/Fuller Brush man to trick the pigs into letting him in, but fails. The Wolf then tries to blow down the strong brick house (losing his clothing in the process), but is unable, all while a confident Practical plays melodramatic piano music. Finally, he attempts to enter the house through the chimney, but smart Practical Pig takes off the lid of a boiling pot filled with water (to which he adds turpentine) under the chimney, and the Wolf falls right into it. Shrieking in pain, the Wolf runs away frantically, while the pigs sing \"Who's Afraid of the Big Bad Wolf?\" again. Practical then plays a trick by knocking on his piano, causing his brothers to think the Wolf has returned and hide under Practical's bed."}