{"mid": "Threads", "IMDB_id": "tt0090163", "title": "Threads", "plot": "It is March, 1984. In Sheffield, England, young Ruth Beckett & Jimmy Kemp are out in the country above Sheffield when a U.S. F-4 Phantom flies past overhead from the nearby R.A.F. Finningley base. Sheffield, the 4th-largest city in Britain, is close to a prominent R.A.F. Base and also has a major component of steel, energy & chemical production. Jimmy flicks through the car's radio stations, missing a brief news story about a Soviet invasion of Iran in his attempt to find the broadcast of the latest football game. Ruth chastises him for his lack of taste, but after he gets out of the car & comes back with a flower the two start to kiss.Later that week, the BBC runs a story about a Soviet convoy moving through northern Iran. The convoys had apparently been spotted by U.S. satellites, traversing 3 of the mountain passes leading from the USSR. The story goes on to say the Soviet foreign minister had defiantly defended the invasion, and it soon becomes obvious that the Soviets are hoping to convert Iran to yet another Soviet satellite state. During this time frame Ruth also reveals to Jimmy she is pregnant, and wants to keep the baby. When Jimmy informs his parents his father reacts somewhat harshly; his mother tries to point out all the options available to them. Jimmy informs his parents that he & Ruth plan to get married and have the child. Jimmy works for a carpentry firm; it is not clear what Ruth works as. Michael, Jimmy's annoying younger brother, humiliates him in front of his sister Alison by mentioning the upcoming pregnancy, which provokes an angry reaction from both Jimmy and his mother.Soon after, the U.S. states it will send troops to Iran if the USSR doesn't cease its invasion. The Soviets apparently ignore the warning, and soon after U.S. paratroops go in near the Soviet base at Moshad in northern Iran. Hoping the USSR will back off, the British prime minister issues a statement of support for the U.S. action. Unfortunately the USSR ignores the international condemnation, and as Ruth & Jimmy's parents meet to discuss the upcoming wedding/pregnancy, a story is broadcast by the BBC advising that a U.S. submarine has disappeared while on reconnaissance duty. Days later, young Alison Kemp is doing homework when a story appears on the BBC - debris from a missing U.S. submarine has been found, apparently sunk by the Soviets. The U.S. President angrily denounces the Soviets' unprovoked attack against the submarine, as well as its invasion of Iran. He goes on to warn the Soviets that their leadership risks escalating things to the point of nuclear war.As the crisis escalates, Jimmy & Ruth pay little attention to it, focusing instead on finding an apartment and getting it ready to move in. Visiting his dad after work one day, Jimmy notices an F-4 flying past overhead from Finningley, and his father remarks, 'There's something going on, I'm telling you'. While at a bar that night, Jimmy and a young lady meet up and are happened upon by an Army convoy while making out in Jimmy's car.May, 1984: The United States issues an ultimatum to the USSR calling for joint withdrawal of all U.S. & Soviet forces from Iran. The Soviets arrogantly ignore it, and as U.K. residents pray for peace, the U.S. launches a conventional weapons strike against the Soviets' Moshad base, using high-level B-52 bombers. The USSR defends the base with a nuclear-tipped air-defence missile, annihilating the bombers. The U.S. retaliates with a single, low-yield tactical nuclear weapon on the Soviet base, and the exchange stops - for now.Anti-Soviet demonstrations are taking place in both the U.S. and East Germany, and people in cities such as Sheffield are heading for Wales, west England, and other country towns well away from major areas to avoid being caught in a possible nuclear war. The Kemps' neighbors, the Stothards, are among these. Leaving in their Peugeot station wagon, its roof & seats piled with belongings, the Stothards, their daughter, and dog find themselves caught up in the major influx of people heading for remote towns. Stopped by police on an 'essential service route', they are directed to the M1 where single-lane traffic is being allowed to proceed. Mr. Stothard takes the officer's suggestion and carries on to his relatives using this route.Sheffield's peacetime chief executive, Mr. Sutton, is also being advised of changes that need to be made to prepare for the possibility of attack. If necessary, the chief executive can be given full powers of internal government. He is advised to summon the pre-determined emergency committee, which he does. Some changes are already being made; key points are being guarded, known/potential; subversives are arrested, and the government is requisitioning raw materials for possible wartime use. As riots break out in the U.K as well, the government starts to reinforce Europe by taking control of British Airways and cross-channel ferries, leaving thousands of travelers stranded. The Royal Navy also moves in to guard the oil rigs of the North Sea. More disturbing, the U.S. aircraft carrier 'Kittyhawk' is sunk by a Soviet sub, and the U.S. begins an air & naval blockade of Cuba. Further riots in East Germany occur. The Sheffield emergency committee is summoned to the fallout shelter below the city hall.Hospitals are also cleared for expected casualties; Mr. Beckett's elderly mother is sent home to live with them. Art galleries are also cleared & the paintings put into storage (possibly the galleries were to be used as fallout shelters). 'Protect & Survive' PSAs are broadcast on U.K. TV & radio, and books outlining precautions to be taken are being delivered to U.K. residents. Ruth & Jimmy are removing wallpaper in their apartment one night when one of these PSAs comes on, and Ruth is so frightened she starts to cry. As Jimmy looks out their apartment window, the fire engines from the nearby hall are deployed to a safe location in an underground bunker - a sign that things are definitely worsening.May 26, 1984. Ruth's morning sickness has her in its grip, and her mother goes to call her employer to tell them Ruth won't be in. However, when she does, she discovers the phone line is dead. This is the U.K's Preferential Telephone System in use; non-essential phones are disconnected, leaving the lines open for emergency communications among government/civic officials only. The Kemps are trying to build a fallout shelter; young Alison is sent by her mother to buy canned/dry food - it is the last we see of her. At 8:30 a.m. people are going about their business, and the emergency committee is meeting in the bunker. Suddenly an alarm goes off from the UKWMO, followed by the chilling words, 'ATTACK WARNING! RED! ATTACK WARNING! RED!'. The committee immediately recognizes what it means; the USSR has decided to launch an ICBM attack against the UK, in retaliation for trying to stop the Iran invasion and its failure to support Soviet ambitions. NASA Space Command detected Soviet ICBMs in-flight minutes after launch, and the UKWMO also picked up the signal. Outside, Jimmy & co-worker Bob are arguing with people wanting to buy boards for fallout shelters, when the attack warning siren begins to wail - a long, wavering, incessant tone. Jimmy & Bob dive under their truck, and other people desperately try to find shelter before the attack hits. The first warhead explodes above the North Sea, causing the EMP - electromagnetic pulse - effect, crippling electronics & communications equipment. At R.A.F. Finningley, the U.S. F-4s stationed there desperately start to launch along with R.A.F. aircraft. Although they manage to get fighters into the air, at 8:37 the first tactical missile salvo hits most NATO military targets, including Finningley. The mushroom cloud bursts & looms high over the R.A.F. base, and the terrified residents of Sheffield see it. The blast wave hits seconds later, causing significant damage. Jimmy & Bob emerge from under the truck to see the horrifying cloud in the distance. Bob whispers, 'Jesus Christ, Jimmy.....they've done it!'. Jimmy attempts to head to Ruth's but finding his car disabled, he heads out on foot. As panic-stricken residents of Sheffield run for shelter, Mr. & Mrs Kemp, caught unawares, desperately try to improvise a lean-to as detailed in the survival information. The Becketts escape to their cellar, which is well fortified. The initial exchange results in 80 MT falling on the UK; as exchanges escalate, all major cities in the UK and U.S.A. become targets. Now, strategic rather than tactical weapons will be used. The total East-West exchange is 3000 MT; 210 of these fall on the UK alone. Sheffield, being a major industrial center, also becomes a target. A 1-MT ICBM hits near Crewe, annihilating most of Sheffield. Most of the population is destroyed along with the city; immediately after, firestorms rage through the city. With radioactive fallout imminent, firefighting & rescue attempts are unlikely for some time. With many roofs blown open as well, the survivors are especially vulnerable to the deadly radiation.The Kemps, badly wounded after being caught off guard, stumble out of their lean-to into a horrifying scene; everything is ablaze with fire. They find the body of their youngest son Michael under rubble in the back garden. Mrs. Kemp is horribly burned from fire; Mr. Kemp is suffering radiation sickness within hours. In the Becketts' basement, Ruth, her parents & grandmother are having a difficult time; Ruth is overcome with anguish at Jimmy's likely death (he was caught outside when the warhead hit) and is seemingly numb to what's going on. Several days after the attack, she flees into the street as her parents drag her grandmother's body upstairs (she had died in her sleep). As Ruth leaves her house for the outside, she enters a world she doesn't know. The fires are out, but nothing is recognizable. Death is everywhere; Ruth sees hands/feet/bodies extruding from rubble; she encounters a horribly burned mother with a dead baby; she also sees a man extracting relatively intact Star Wars figures from the rubble & placing them gently on a burned piece of wood. Overcome with grief, Ruth disappears into the streets.Not long after Ruth leaves, Mr. & Mrs. Beckett find their home invaded by looters, who kill them. Food stocks are now controlled by the central government; no food distribution is likely until 2 weeks after the attack. This results in food riots, in which some people are killed or injured. Mrs. Kemp dies of the injuries suffered in the blast; her body is discovered by Ruth a few weeks after the attack. Mr. Kemp dies several months after of radiation poisoning - ironically, he dies in a cemetery.In Buxton, 20 mile from Sheffield, Ruth enters a hospital that is filled wall-to-wall with people. With little in the way of medical supplies, doctors & nurses are forced to resort to primitive, sometimes horrible measures, to save lives - such as sawing off infected limbs without benefit of an anesthetic!Months after the attack, Ruth finally gives birth to a baby girl - alone, with no medical support. Miraculously (?), the baby appears healthy. She is named Jane.The people under the city hall, in the bunker, are buried alive; with no heavy equipment available and fallout danger high, it is weeks before they can be reached. By the time a rescue team digs through to them, they have all died of suffocation.Collecting the first harvest is a matter of life & death after the attack; however, it is difficult to grow crops with radiated soil, no agrochemicals or fertilizers, and the crops are highly vulnerable to disease, viruses & insects. In the first few years, most of the very young & very old die due to extreme cold caused by the smoke & dust lifted into the atmosphere, shutting out the sun's heat & light.Years later, the returning sun is now heavier with UV light, causing a higher rate of cancers/leukemias, also caused by the lethal gamma radiation. Ruth runs into Jimmy's old friend Bob, and the two are reluctantly forced to butcher a dead sheep in order to survive. Ruth fears the sheep likely died of radiation, as cold doesn't usually kill sheep. Ultimately, she gives in to Bob's suggestion.13 years after the attack: Ruth, working alongside her daughter in the fields, collapses. She later succumbs to the insidious radiation-induced leukemia with Jane at her side. Jane, helpless, can only use the words, 'up', and 'work', as well as her mother's name. It appears that children born post-war cannot even learn the basic language skills.Jane, forced to survive on her own now, falls in with a pair of young men who are looters. Special courts have wide-ranging powers of justice; the killers of Ruth's parents are found & executed by firing squad. The army also has the authority to shoot looters on sight; this is the fate that meets one of the boys Jane falls in with.Christmas Day, 13 years after: Jane is raped (off-screen) by 2 men; we see her several months later in a building that looks much like a hostel. Jane tells the woman working there, 'Babby's coming!'. She is told to go elsewhere, but after repeating herself several times she is assigned to a bed. She gives birth to a horribly deformed, stillborn infant. As it is passed to her, she looks at it, and opens her mouth to scream, but the audience hears nothing but the howling wind. Silence follows as the credits scroll across the screen."}