{"mid": "Thunderbirds", "IMDB_id": "tt0167456", "title": "Thunderbirds", "plot": "The Tracy family, led by former astronaut Jeff Tracy, operate International Rescue, a secret organization that aids those in need using the technologically advanced machines called Thunderbirds. The youngest son Alan lives at a boarding school on the mainland dreaming of being a Thunderbird pilot. He and his friend Fermat Hackenbacker, son of the Thunderbirds’ engineer Brains, are picked up by Lady Penelope Creighton-Ward and her butler Aloysius Parker. Lady Penelope is an International Rescue agent, travelling to Tracy Island in the South Pacific in her limo FAB 1. The Thunderbirds return from an oil rig fire, but Alan and Fermat play around in Thunderbird 1, discovering a strange compound splattered on the side. Unbeknownst to them, the compound is a tracking beacon being used by the Hood, a psychic criminal mastermind who has a vendetta against Jeff for not saving him in a collapsing diamond mine while his brother Kyrano was rescued.\nThe next day, the Hood’s submarine locates Tracy Island and fires a missile at the orbiting Thunderbird 5, sending the Tracys in Thunderbird 3 to rescue John Tracy. The Hood and his minions Mullion and Transom take over the island’s command centre, imprisoning the Tracys in Thunderbird 5 with depleting oxygen. The Hood reveals he plans to use the Thunderbirds to rob the major banks of the world. Alan, Fermat, and their friend Tin-Tin, Kyrano’s daughter, escape in the ventilation to the Thunderbird silos. Fermat removes Thunderbird 2's guidance chip and the teenagers flee into the island’s jungle.\nWhile traversing the jungle to find the island’s remote transmitter, Tin-Tin displays psychic powers like her uncle. Contacting Thunderbird 5, Jeff tells them to wait for Lady Penelope’s arrival. The trio flee from Mullion, but Fermat and Tin-Tin are captured when Alan tries to pilot them to safety on hovercraft. Lady Penelope and Parker arrive, engaging the Hood’s minions in combat, but the Hood defeats them with his powers. Alan appears, the Hood forcing him to hand over the guidance chip, locking him and the others in the island’s freezer. The Hood, Mullion, and Transom pilot Thunderbird 2 to London, using the Mole to drill into the Bank of England’s vaults but sink a monorail. Alan and co. escape confinement and contact the Tracys, who regain control of Thunderbird 5 and head off to stop the Hood, while the teenagers, Lady Penelope, and Parker fly to London in Thunderbird 1.\nArriving in London, Alan and Tin-Tin rescue the monorail using the aquatic Thunderbird 4 before going after the Hood. The Hood locks Jeff and Lady Penelope in a vault, challenging Alan to defeat him. Alan dangles from a catwalk over the Mole, but Tin-Tin appears, using her own powers to turn the tables on the Hood, who is rescued by Alan as per his family’s beliefs. The Hood and his minions are arrested, while the Tracys return to their island home. Alan, Fermat, and Tin-Tin are inducted as official members of International Rescue, and depart for their first mission."}