{"mid": "Thunderball", "IMDB_id": "tt0059800", "title": "Thunderball", "plot": "James Bond attends the funeral of Colonel Jacques Bouvar, a SPECTRE operative. Bouvar is alive and disguised as his own widow, but Bond identifies him. Following him to a château, Bond fights and kills him, escaping using a jetpack and his Aston Martin DB5, conveniently driven up by French agent, Madame La Porte.\nAt a SPECTRE meeting in Paris, chaired by the enigmatic No. 1, Emilio Largo (SPECTRE operative No. 2) introduces the group's latest project: stealing two atomic bombs and holding NATO for ransom. The plot begins at the Shrublands sanatorium, located close to an air force base. Coincidentally, James Bond is at Shrublands to improve his health. There he notices Count Lippe, a suspicious man with a Tong tattoo. Bond searches Lippe's room, but is seen leaving by Lippe's clinic neighbour, whose head is covered in bandages. Lippe tries to murder Bond with a spinal traction machine, but Bond is saved by his physiotherapist, whom he then bribes into having sex.\nLippe and Angelo, the bandaged man, are part of SPECTRE'S plot. Angelo's face was surgically altered to match the appearance of François Derval, a French Air Force pilot slated to fly on a training mission aboard an RAF strategic jet bomber Avro Vulcan loaded with two atomic bombs. Derval is murdered by Angelo, who then tries to extort more money for his services from SPECTRE. Agent Fiona Volpe seemingly acquiesces to his demands and he takes Derval's place on the flight. On the flight, Angelo gasses the remainder of the crew, hijacks the plane and executes a controlled water landing near the Bahamas, submerging the jet. The atomic bombs are retrieved by SCUBA-equipped SPECTRE operatives, commanded by Largo. Angelo, trapped by his seat strapping, is killed by Largo for reneging on his original deal with SPECTRE. Meanwhile, Bond has uncovered Derval's corpse at the sanatorium. Bond is later attacked by Lippe, who is murdered by Volpe as punishment for failing to foresee Angelo's greed.\nBack in London, at a MI6 conference, all 00 agents are informed that SPECTRE demands £100 million from NATO in exchange for returning the bombs and threatens to destroy a major city in the United States or the United Kingdom. At the meeting, Bond recognises Derval from a photograph. Bond requests M to be sent to Nassau, Bahamas, where Derval's sister, Domino, is staying.\nDuring snorkelling, Bond meets Domino. Later, at a casino, encounters Domino and Largo, who has taken Domino as his mistress. Bond enters a game against Largo and wins, and subsequently takes Domino to a dance. Bond and Largo recognise each other as adversaries and begin a tense cat-and-mouse game of attempting to gain advantage over each other while still pretending ignorance of their adversary's true nature. Bond meets Felix Leiter and Q, and is issued various gadgets, including an underwater infrared camera, a distress beacon, underwater breathing apparatus, a flare gun, and a Geiger counter. Diving under Largo's ship, the Disco Volante, Bond fails to find the atomic bomb but detects an underwater hatch; Bond narrowly escapes Largo's henchmen. The next day, Bond visits Largo at his estate, Palmyra.\nBond is kidnapped by Fiona Volpe but escapes through a Junkanoo celebration to the Kiss Kiss club, where Fiona is accidentally shot and killed by her own bodyguard. Bond and Felix search for the Vulcan, finding it underwater. Bond tells Domino that Largo killed her brother and asks her for help in finding the bombs, giving her his Geiger counter. As she is looking for the bombs on board, she is discovered and tortured by Largo.\nMeanwhile, Bond disguises himself as one of Largo's henchmen, and uncovers Largo's plan to destroy Miami Beach. Bond is discovered but rescued by Leiter, who orders United States Coast Guard to parachute to the area via U.S. Air Force transport aircraft. After an underwater battle, the henchmen surrender. Largo escapes to his ship, which has one of the bombs on board. Largo attempts to escape by jettisoning the rear of the ship, which is pursued by Royal Navy and U.S. Coast Guard vessels. During a fight on board, Largo is about to shoot Bond when Domino, freed by Largo's nuclear physicist Ladislav Kutze, kills Largo with a harpoon. Bond, Domino and Kutze jump overboard, the boat runs aground and explodes. A sky hook-equipped CIA B-17 aircraft then rescues Bond and Domino."}