{"mid": "ThundarrTheBarbarian", "IMDB_id": "tt0181262", "title": "Thundarr the Barbarian", "plot": "Thundarr the Barbarian is set in a future (c. 3994) post-apocalyptic wasteland divided into kingdoms or territories — the majority of which are ruled by wizards – and whose ruins typically feature recognizable geographical features from the United States, starting in New York City and working itself to Los Angeles, Las Vegas, Mount Rushmore, San Francisco and Washington, D.C.. Other episodes with recognizable settings are located in Mexico, while one is in London. Another notable feature of this future Earth is that the Moon was broken in two pieces. The shattered moon and the ruins of the former human civilization were caused by the passage of a runaway planet between the Earth and the Moon in 1994, which, from scenes shown in the opening sequence, caused radical changes in the Earth's climate and geography. However, by the time period in which the series is set, the Earth and Moon seem to have settled into a new balance. Earth is reborn in a world of \"savagery, super-science, and sorcery\".\nThe hero Thundarr (voiced by Robert Ridgely), a muscular warrior, whose companions include Princess Ariel, a formidable young sorceress, and Ookla the Mok traveled the world on horseback, battling mostly evil wizards who combine magical spells with reanimating technologies from the pre-catastrophe world. Some of these malevolent wizards enlist the service of certain mutant species in doing their bidding.\nOther enemies include The Brotherhood of Night (a group of werewolves who could transform others into werewolves by their touch), the cosmic Stalker from The Stars (a predatory, malevolent cosmic vampire), and various mutants. Intelligent humanoid-animal races include the rat-like Groundlings, the crocodile-like Carocs, and talking hawk and pig-like mutants. New animals that existed include fire-shooting whales, a giant green snake with a grizzly bear head, and mutated dragonflies and rabbits.\nThundarr's weapon of choice, the Sunsword, projects a blade-like beam of energy when activated, and can be deactivated so that it is only a hilt. The Sunsword's energy blade can deflect other energy attacks as well as magical ones, can cut through nearly anything, and can disrupt magical spells and effects. The Sunsword is magically linked to Thundarr and as such, only he can use it; however, this link can be disrupted.\nComic book writer-artist Jack Kirby worked on the production design for the show. The main characters were designed by fellow comic book writer-artist Alex Toth. Toth, however, was unavailable to continue working on the show, so most of the wizards and other villains and secondary characters that appear on the show were designed by Kirby. He was brought onto the show at the recommendation of comic writer Steve Gerber and Mark Evanier.\nThe series was the creation of Steve Gerber. Gerber and friend Martin Pasko were having dinner in the Westwood area one night during the time Gerber was developing the series. Gerber commented to Pasko that he had not yet decided upon a name for the Wookiee-like character the network insisted be added to the series, over Gerber's objections. As the two walked past the gate to the UCLA campus, Pasko quipped, \"Why not call him Oo-clah?\" Pasko later became one of several screenwriters also known for their work in comics, such as Roy Thomas and Gerry Conway, to contribute to the show. After writing several scripts, singly and in collaboration with Gerber, Pasko became a story editor on the second season. Other writers included Buzz Dixon and Mark Jones."}