{"mid": "Timer", "IMDB_id": "tt1179794", "title": "TiMER", "plot": "The conceit of TiMER is that a wrist implant is available that counts down to the day when the user will meet his or her soulmate.\nOona, a Los Angeles orthodontist, has a blank timer, meaning her soulmate is not equipped with one. Searching for her soulmate, Oona brings her latest timerless boyfriend to get a timer installed, but the timers do not match and they part ways.\nOona's stepsister and roommate, Steph, has a TiMER indicating that she will not meet her soulmate for over 15 years. Steph's lifestyle includes one-night stands with men whose timers are about to expire, and she encourages Oona toward similar behavior.\nOona gravitates toward Mikey, a young grocery store clerk who encourages her to live in the present. Mikey’s TiMER only has a few months left. Steph meets Dan, a newcomer to Los Angeles, and invites him to her bar intending to introduce him to Oona, who does not show up because she is with Mikey. Steph and Dan flirt. Dan confesses that his wife died; he does not have a TiMER because he believes she was \"his one\".\nWhen Mikey meets Steph and the sisters argue, Mikey reveals that his TiMER was fake: a programmable sticker. Oona is angry but realizes she was more herself with him because of it. With Oona's 30th birthday approaching, she feels pressure from her mother to find her soulmate. Steph and Oona decide to have their TiMERs removed claiming that they are moving on and the results no longer matter.\nSteph has hers removed and is visibly relieved. During Oona's turn, her countdown abruptly starts, signifying that her soulmate has gotten a TiMER. It indicates that she will meet her soulmate the next day. Steph encourages her to remove it anyway, but a conflicted Oona decides to keep it. An angry Steph leaves Oona to think it over.\nThe next day is Oona and Steph's birthday, and their parents throw them a party, inviting Mikey and Dan. Steph and Oona, still fighting, arrive separately. Oona looks for Steph, but sees Dan. Her TiMER goes off, because Dan purchased a TiMER: being with Steph made him not want to be alone. Mikey runs off before Oona can talk to him, and Oona finds Steph and Dan arguing. The sisters fight and Oona leaves.\nThe next day, Oona visits Mikey and shows him she had her TiMER removed and says she does not care about the results. Mikey is grateful for the gesture, but insists that the results matter and they say goodbye. The next morning Steph reconciles with Oona. Oona goes for a run at the track later than she usually does, and runs into Dan practicing with his relay team, learning they use the same track, but at different times. They part with the promise of meeting again."}