{"mid": "TimeLapse", "IMDB_id": "tt2669336", "title": "Time Lapse", "plot": "Finn (Matt O'Leary) is a painter with a creative block, who lives together with his girlfriend Callie (Danielle Panabaker) and his best friend Jasper (George Finn) in an apartment complex where Finn works as a manager. Because the elderly tenant, Mr. Bezzerides (informally called \"Mr. B\" by the protagonists), across the way has not paid his rent in two months, Callie goes to check on him, and discovers a strange machine in his apartment that takes Polaroid photos of their living room's picture window—apparently 24 hours in the future, always at 8 pm, although Mr. B's photo display includes daytime photos. The friends check Mr. B's storage unit and find his inexplicably charred corpse; he has apparently been dead for a week. Gambling addict Jasper pushes to use the machine to win bets, as he usually loses, and the next day's photo confirms they will do just that. It also shows that Finn has finally created a new painting; copying the work in the photo gets him past his block. Based on what happened to Mr. B and notes in his journal, they realize they have to make sure the events in the photos—whatever they may be—have to occur, or their timeline will stop, and they will therefore cease to be.\nSeveral days go by. The friends cover up Mr. B's disappearance, including lying to the complex security guard, Big Joe, claiming the old man is in the hospital. After a week they get a disturbing photo: Callie kissing Jasper, while Finn paints in the background. The actual kiss goes on too long while Finn paints, and he gets angry and jealous. Jasper's violent bookie Ivan learns of the machine, and forces the friends to now pose for the photos with many more event results for Ivan to make bets on. Finn and Jasper's friendship is strained by these events, as Ivan will be keeping each night's photo, preventing Finn from seeing his painting. Even so, Jasper gets a cellphone picture of the next photo before giving it to Ivan's goon, Marcus. This photo shows a hastily made skull and crossbones on the canvas, which Jasper believes is a warning to themselves.\nThe next evening, Finn runs into Big Joe at the gate, who has just gotten a job as a police officer. Marcus sees their meeting and calls Ivan, who does not believe their story about Big Joe just dropping off his keys. Ivan threatens all of them, but Jasper convinces him that tonight's new photo is of Ivan's death. While Ivan is retrieving the photo, Jasper stabs Marcus, then clubs Ivan to death on his return. They hide the bodies in Mr. B's storage unit. Finn and Callie fight, so Finn sleeps on the couch. Later that night, they are visited by Mr. B's colleague, Dr. Heidecker, who levels a gun at Finn and Jasper and forces them to reveal events. Mr. B had mailed Heidecker a photo that covers the next night, but taken before his death, showing blood on the window and Mr. B's hat on the friends' couch (Jasper has taken to wearing the dead man's hat). As she does not know how to adjust the settings of the machine, Jasper shoots Heidecker dead using Ivan's gun.\nThe next night's photo shows Callie and Jasper having sex in the window. Finn talks to Jasper, trying to figure out a way to prevent events, but Jasper knocks him out and locks him in Mr. B's storage—he intends to prevent a paradox and make sure the photo happens, no matter what. Finn escapes and threatens to destroy the machine if Jasper does not stop. A fight ensues, culminating with Callie smashing Jasper's head in. When making the painting to match Heidecker's photo, Finn realizes a discrepancy. He discovers that the camera also takes a photo at 8 am, a truth which Callie kept to herself. Callie reveals that she has been using the morning photo to send herself messages to manipulate events and rekindle her relationship with Finn; the sex photo is one of those missing from Mr. B's wall, from a drunken night a month ago. Finn rejects Callie and goes to destroy the machine, so she shoots him, creating the blood splatter on the window from Heidecker's photo. While Callie is attempting to send herself another message to change the timeline, Big Joe stops by, discovers the murdered Jasper and Finn, and arrests her.\nAs Callie is led away by Joe - confident that the timeline will reset - the note she left falls off the window, making permanent the events that have taken place. The final scene is of the camera taking a photo which is left unrevealed."}