{"mid": "TimeriderTheAdventureOfLyleSwann", "IMDB_id": "tt0086443", "title": "Timerider: The Adventure of Lyle Swann", "plot": "Lyle Swann (Fred Ward) is a well-known dirt bike motorcycle racer who is in the desert competing in the Baja 1000, a multiclass vehicle cross-country race. Swann has a reputation for being a great rider but is plagued by technical problems from the high-tech gadgetry he incorporates into his C and J framed XT500 Yamaha. When Swann accidentally goes far off course, he stumbles across a time travel experiment that utilizes \"maser velocity acceleration\" to send objects (in this case, a simian subject by the name of Esther G.) back in time.\nSwann rides through the field and gets sent back to November 5, 1877. The scientists in charge of the experiment soon realize what has happened, but Swann rides off, unaware of what has happened to him, before he can be returned to the present. While taking a swim break in a local pond, he runs into a gang of outlaws led by Porter Reese (Peter Coyote). Reese becomes obsessed with stealing Swann's motorcycle, and the outlaws pursue Swann into the small village of San Marcos, but his red suit and dirtbike scare the local Mexicans, who think he is the Devil or 'El Diablo' (Spanish for 'The Devil').\nThere, he meets a beautiful woman, Claire Cygne (Belinda Bauer), who gives him a safe place to hide, and who severely wounds one of Reese's men Carl Dorsett (Tracey Walter). The village priest (Ed Lauter) compels them to withdraw, but Reese continues to plot the capture of Swann's dirtbike. In the village, Swann is seduced by Claire and sleeps with her, but she is later kidnapped by Reese's henchman Claude Dorsett (Richard Masur) as revenge for her shooting and wounding his brother Carl.\nThey also manage to capture the dirtbike, leading to a series of hijinks, while Swann gets help from a posse of two U.S. Marshalls, Ben Potter and Daniels (L. Q. Jones, Chris Mulkey) who are trying to capture or kill the gang. Potter has a personal vengeance against Reese, for Reese killed Potter's son two years previously. Swann manages to retrieve his dirtbike and rescue Claire. Potter is killed by Reese in an ambush, and his 2nd, Daniels, is mortally wounded and dies later.\nIn a final showdown, Reese's band of outlaws faces Swann, the last survivor of the posse, and Claire atop a plateau. When a helicopter shows up (sent by the builders of the time travel experiment to take Swann home), Reese's men run away in fear, but Reese stays behind and fires at the helicopter, killing or wounding one of the pilots. The helicopter begins spinning wildly as the co-pilot tries to maintain control, knocking the dirtbike off the side of the plateau. Reese is killed by the helicopter's tail rotor. The helicopter manages to land on the plateau and extract Swann.\nJust as the helicopter pulls away, Claire snatches a pendant from Swann's neck that was handed down from his great-great-grandmother, who had stolen it from his great-great grandfather as a reminder of \"one incredible night they had together.\" Swann realizes that he is his own great-great-grandfather."}