{"mid": "TinCup", "IMDB_id": "tt0117918", "title": "Tin Cup", "plot": "Roy \"Tin Cup\" McAvoy (Kevin Costner) is a former golf prodigy who has little ambition. He owns a driving range in West Texas, where he drinks and hangs out with his pal Romeo Posar (Cheech Marin) and their friends. Dr. Molly Griswold (Rene Russo), a clinical psychologist, wants a golf lesson. She asks Roy because he knows her boyfriend David Simms (Don Johnson), a top professional golfer. They were both on the golf team at the University of Houston. Roy is immediately attracted to her, but she sees through his charm and resists.\nSimms shows up at Roy's trailer ahead of a local benefit tournament. Roy thinks he is being invited to play, but Simms actually wants to hire him as a caddy (since Roy knows the course). During the round, Roy needles Simms about \"laying up\" instead of having the nerve to take a 230-yard shot over a water hazard. Simms fires back that Roy's problem is playing recklessly instead of playing the percentages. Roy brags that he could make it, and spectators make bets among themselves. Simms warns Roy that he'll fire him if he tries, but Roy does anyway, hitting a brilliant shot onto the green. Simms immediately fires Roy.\nTo get even, Roy decides to try to qualify for the U.S. Open. He makes a play for Molly, also seeking her professional help. Molly agrees to help Roy rebuild his self-confidence in exchange for the golf lessons. In two qualifying rounds, with Romeo as his caddy, Roy's game is excellent but his head needs help. Roy insists on breaking the course record, but Romeo inplores him to play safely to qualify for the U.S. Open. When Roy demands his driver, Romeo snaps it in half. Roy asks for the 3-Wood and Romeo snaps it in half as well. Then Roy begins snapping every club in his bag in a fit except the 7-Iron \"Then there’s the 7-Iron. I never miss with the 7-Iron\" This causes Romeo to walk off the course and quit. Roy challenges anyone to a bet that he can finish the Back-9 with only a 7-Iron and everyone reluctantly refuses, but he amazingly still manages to qualify. He loses his car on a bet with Simms. He persuades Romeo to caddy again, but develops a problem with his swing. On the first day of the tournament in North Carolina he shoots a horrible 83. Meanwhile, Molly sees Simms' unpleasant side when he arrogantly refuses a child an autograph.\nSeeing that trying to change Roy is a mistake, Molly encourages him to be himself. At her suggestion, Roy wins another wager with Simms, the leader after the first round. With renewed confidence, \"Tin Cup\", a nobody from nowhere, shocks the golf world by breaking the U.S. Open record for a single round by shooting a 62, thus making the cut. His third round is also excellent and moves him into contention, but on all three rounds, he refuses to lay up on the par-5 18th hole, hitting the ball into the water hazard each time.\nOn the last day of the tournament, Roy, Simms, and real-life PGA Tour pro Peter Jacobsen (playing himself) are in a three-way battle to win the Open. Jacobsen finishes with a par on 18, tied for the lead with Roy and one shot ahead of Simms. Simms yet again lays up at the 18th hole, playing it safe, although this takes him out of championship contention. Romeo urges that he do likewise to birdie and win the U.S. Open, but is urged by Molly to \"go for it\". Roy, for the 4th day in a row, takes his shot and it reaches the green, but then \"a little gust from the gods\"—a sudden contrary wind—starts his ball rolling back, downhill into the water hazard. Reminiscent of his blow-up back in college when he failed to qualify for the Tour, Roy tries repeatedly to hit the same shot, not realizing that he has lost the tournament, but with the same heart-breaking result, splashing in the water hazard. Down to his last ball and risking not only humiliation but also disqualification, he still goes for the green, and on his 12th shot, his final shot finally clears the water hazard and amazingly rolls into the hole. After a wild celebration, Roy realizes that he has blown winning the U.S. Open, but Molly re-assures him about the immortality of what just happened, \"Five years from now nobody will remember who won or lost, but they're gonna remember your 12!\"\nBack in Texas, Molly tells Roy that because he finished in the top 15, he automatically qualifies for next year's Open. Molly further suggests that Roy go back to the qualifying school and get on the Tour. Molly, who gained several clients at the tournament, prepares for a career of helping players with the mental portion of the game. They kiss passionately as the movie ends."}