{"mid": "TinkerTailorSoldierSpy", "IMDB_id": "tt1340800", "title": "Tinker Tailor Soldier Spy", "plot": "Note: Spoilers ahead! Please read this synopsis if you want to understand what is going on in the film.n October 1973, Control (John Hurt), the head of British Intelligence (\"the Circus\"), sends agent Jim Prideaux (Mark Strong) to Budapest in Communist Hungary to meet a Hungarian general who had promised to deliver valuable information regarding a mole in British Intelligence. However, Prideaux is shot and captured by Soviet agents. Amid the international incident that follows, Control and his right-hand man George Smiley (Gary Oldman) are forced into retirement. Control, already ill, dies soon afterwards.Percy Alleline (Toby Jones) becomes the new Chief of the Circus, with Bill Haydon (Colin Firth) as his deputy and Roy Bland (Ciarán Hinds) and Toby Esterhase (David Dencik) as close allies. They previously began a secretive operation called \"Witchcraft\" which was obtaining purportedly valuable Soviet intelligence. Control and Smiley mistrust the material produced by Witchcraft, and are dismayed that Percy is unwilling to share the identity of the source. The Witchcraft intelligence is important enough that Percy is able to persuade the United States to renew exchanging their intelligence with the British, which they had stopped due to prior British intelligence failures.Percy and Hayden meet with Oliver Lacon (Simon McBurney), the vice minister in charge of intelligence, and persuade him to rent a safe house from restricted funds outside the normal MI6 budget. Lacon is contacted by Ricki Tarr (Tom Hardy), an MI6 operative thought to have defected, who claims there is a long-term mole in a senior position within British Intelligence.Lacon secretly persuades Smiley to conduct a private investigation into Tarr's claims, a suspicion that Control also held before he was sacked. Unknown to the Circus, Smiley recruits Peter Guillam (Benedict Cumberbatch) and retired Special Branch officer Mendel (Roger Lloyd Pack) to help him with his investigation. He begins interviewing people who left the Circus about the same time that he and Control were forced out.Connie Sachs (Kathy Burke) was sacked by Alleline after she showed him research that led her to conclude that Alexei Polyakov (Konstantin Khabenskiy), a Soviet cultural attaché in London, is actually a high-value Soviet spy. Another is Jerry Westerby (Stephen Graham), who had been duty clerk on the night Prideaux was shot. Westerby says that on that night he called Smiley's house for instructions, Ann (Katrina Vasilieva), Smiley's philandering wife, answered. Smiley was still in Europe. Shortly afterward, Haydon arrived at the Circus and said that he saw the news of Prideaux death on the tickertape at his club. Smiley realizes that Haydon must have heard the news from Ann, confirming his suspicion that the two had been having an affair.Smiley comes home and finds Tarr hiding there. Tarr tells him that he had been sent to Istanbul to investigate a Soviet agent named Boris. Tarr found that Boris had no significance, but that Boris's (Tomasz Kowalski) wife Irina (Svetlana Khodchenkova) was also an operative and seemed to have information. So Tarr overstayed his itinerary in Istanbul and initiated an affair with Irina to gain her trust. Irina, however, knew who Tarr was, and asked to trade information specifically, the name of a mole who existed in the top ranks of the Circus and who worked for a KGB spymaster named Karla for a new life in the West.Tarr sent Irina's request back to London, but the reply is delayed several hours until the early morning, and when it finally arrives. it ignores the offer of Irina's important intelligence. Instead. Tarr is ordered to return to Britain immediately. Tarr learns that Irina's husband, Boris, has been murdered, and find the British station chief in Istanbul murdered. Tarr desperately looks for Irina, and finally finds her on a gurney being loaded onto a Soviet ship. Tarr was soon accused of defecting and of murdering the British station chief, and goes into hiding.Guillam is sent by Smiley to steal the Circus logbook for the night Tarr called: he finds the pages for that night are cut out, suggesting that Tarr's story is true.Prideaux, who was secretly returned by the Russians but sacked from the service, is now in hiding, working as a language teacher at a boys' school. Prideaux reveals to Smiley that the purpose of the Hungary mission was to get the name of the mole. Control had codenamed the suspects \"Tinker\" (Alleline), \"Tailor\" (Haydon), \"Soldier\" (Bland), \"Poorman\" (Esterhase) and \"Beggarman\" (Smiley himself). Prideaux tells how he was brutally interrogated for weeks or months, until his interrogation was finally taken over by Karla. He kept his knowledge of Control's suspicions about a mole deeply buried, hoping to not give up the info. A blonde female prisoner, Irina, was brought in and he was asked if he knew her. When he said know, they executed her in front of him. Prideaux says that his intention to keep Control's suspicion about the mole secret was futile, because the Soviets already knew. They were only interested in knowing how far Control's investigation had progressed.Smiley learns that Alleline, Haydon, Bland and Esterhase have been regularly meeting Polyakov, who is the source named \"Witchcraft\", at a safe house to obtain material. At every meeting, Polyakov gives these men supposedly high-grade Soviet intelligence in exchange for low-grade British material that helps him maintain his cover with the Soviets. In reality, however, one of these men is the mole, and is passing along substantive material, including the full volume of American intelligence, and Polyakov is his handler. The material Polyakov passes along is glitter among mostly \"chicken feed\", containing just enough substance to persuade the Americans to share their intelligence with the British.Smiley needs to find the location of the safe house, which was purchased directly from Treasury funds without Circus' knowledge, at Percy's and Haydon's urging. Smiley brings Esterhase to an airport where a plane arrives to carry him back to Hungary, where he would be treated as a traitor. Smiley demands Esterhase tell him who was duty the night Tarr transmitted his offer of Irina's intelligence about a mole. Esterhase tells Smiley that he, Alleline, Haydon, and Bland all took intelligence out of Circus and gave it to a Soviet attache. Esterhase gives in and tells Smiley the address of the safe house.Smiley then sets a trap for the mole. He tells Tarr to go to the Paris office, where he forces them to send a cable that states the Tarr knows who the mole is and is ready to give the name. When the mole learns this, he immediately arranges to meet Polyakov at the safe house where he intends to ask the Soviets to kill Tarr. Anticipating the mole's move, Smiley waits at the safe house and captures him when he arrives: it is Haydon.At the Circus interrogation centre in Sarratt, Haydon reveals that he seduced Smiley's wife on Karla's orders with the goal to distract Smiley from any suspicions he might have about Haydon. Haydon also reveals that Prideaux confided in him about Control's suspicion of a mole right before Prideaux left for Hungary, since they were close friends. The Circus makes plans to exchange Haydon back to the Soviets. When Prideaux learns how Haydon betrayed him, he finds him walking outside the interrogation centre and shoots him. Smiley is restored to the Circus as its chief."}