{"mid": "TinMen", "IMDB_id": "tt0094155", "title": "Tin Men", "plot": "Set in the year 1963, Ernest Tilley (Danny DeVito) and Bill \"BB\" Babowsky (Richard Dreyfuss) are two very different door-to-door aluminum siding salesmen in Baltimore, Maryland. Working for different companies, the \"tin men\" are prepared to do almost anything—legal or illegal—to close a sale.\nTheir first meeting is in the opening scene when BB buys a new Cadillac and almost immediately crashes into another Cadillac driven by Tilley. The accident is caused by BB, as he reverses into the street from the dealer's forecourt. Tilley, though distracted, clearly has the right of way. Both BB and Tilley blame each other for the car accident and declare war.\nAfter they smash glass on each other's cars (BB smashes Tilley's headlights, and Tilley smashes BB's car windows in return), BB takes it a step further. He sets out to seduce Tilley's wife Nora (Barbara Hershey) as an act of revenge. When he calls Tilley immediately after having sex with her to hear his reaction, Tilley tells BB to keep Nora; he wants to be rid of her.\nIn between their personal war, the two tin men's personal lives are shown over the course of the film; BB is a smooth-talking con-artist who scams naive and comely young women with his sales pitches. BB soon does some soul searching for himself when his much older partner and mentor Moe Adamson (John Mahoney) is hospitalized with a serious heart condition. In contrast to BB, Tilley is a hapless loser who can't make a sale no matter how hard he honestly (or dishonestly) tries. Tilley also has a serious gambling problem and squanders what little money he makes on horse race bets which creates a rift between him and his long-suffering wife Nora. Because of Tilley's addiction to gambling, he is heavily in debt to various creditors and the IRS. Nora, who works as a local secretary, is frustrated by Tilley's indifference to his gambling addiction as well as his irresponsibility to pay house bills and indifference to life in general. Also, Tilley finds his life falling apart when the IRS begins confiscating his possessions for unpaid property taxes which include his house and, at the end of the film, his own car.\nExhausted by their rivalry, the two men decide to play a game of pool to decide who should get Nora in order to end to their personal war. BB loses, but he does not honor the bet. He has fallen in love for the first time, and Nora has moved in with BB to make a future with him.\nThe climax of the film is set at the newly formed Maryland Home Improvement Commission which is charged with uprooting corrupt sales practices in the home-improvement industry, which subpoenas both men. After Tilley, and then BB, give testimony about their sales practices, the commission takes away both of their sales licenses. While Tilley gives up his license reluctantly, BB does so willingly as part of his outlook on his life's new direction. In the final scene, BB, seeing that Tilley has lost everything including his car, takes pity on him and gives him a ride in his. Having lost their jobs and reconciled to their fate of being unemployed, Tilley and BB begin sharing ideas for a new business they can create for themselves."}