{"mid": "ToLiveAndDieInLa", "IMDB_id": "tt0090180", "title": "To Live and Die in L.A.", "plot": "Richard Chance and Jimmy Hart are United States Secret Service agents assigned as counterfeiting investigators in its Los Angeles field office. Chance has a reputation for reckless behavior, while Hart is three days away from retirement. Alone, Hart stakes out a warehouse in the desert thought to be a print house of counterfeiter Rick Masters. After Masters and Jack, his bodyguard, kill Hart, Chance explains to his new partner, John Vukovich, that he will take Masters down no matter what.\nThe two agents attempt to get information on Masters by putting one of his criminal associates, attorney Max Waxman, under surveillance. Vukovich falls asleep on watch, and consequently they fail to catch Masters in the act of murdering Waxman. While Vukovich wants to go by the book, Chance becomes increasingly reckless and unethical in his efforts to catch Masters. While Chance relies on his sexual-extortion relationship with parolee/informant Ruth for information, Vukovich meets privately with Masters' attorney, Bob Grimes. Grimes, acknowledging a potential conflict of interest that could ruin his legal practice, agrees to set up a meeting between his client and the two agents, who engage Masters by posing as bankers from Palm Springs interested in Masters' counterfeiting services. Masters is reluctant to work with them, but ultimately agrees to print them $1,000,000 worth of fake bills.\nIn turn, Masters demands $30,000 in front money, which is three times the authorized agency limit for buy money. To get the cash, Chance persuades Vukovich to aid him in robbing Thomas Ling, a man whom Ruth previously told Chance is bringing $50,000 cash to purchase stolen diamonds. Chance and Vukovich intercept Ling at the train station and seize the cash in an industrial area. Ling's cover people follow them, though, open fire and accidentally shoot Ling. Chance and Vukovich try to evade them through the streets, freeways and even one of the flood control channels, before a final escape by going the wrong way on the freeway. The next day, the end of their daily briefing includes an FBI bulletin that Ling was its undercover agent, kidnapped, robbed and murdered while on a sting operation. Only a generic description of the assailants and their vehicle is given. While Chance and Vukovich did not kill Ling, Vukovich is nonetheless consumed by guilt, while Chance is apathetic and focused solely on getting Masters. Unable to persuade Chance to come clean about their role in Ling's death, Vukovich meets with Grimes, who advises him to turn himself in and testify against Chance in exchange for a lighter sentence. Vukovich refuses to implicate his partner.\nChance and Vukovich meet with Masters for the exchange. After inspecting the counterfeit million, the agents attempt to arrest Masters and Jack, but Jack pulls a shotgun. Jack and Chance fatally shoot each other, and Masters escapes. Vukovich gives chase, going to a warehouse a previous informant had told them about. By the time he arrives, Masters has set fire to everything inside, destroying all evidence. Vukovich confronts Masters and during a brief struggle, Masters asks Vukovich why he did not take Grimes' advice to turn his partner in, revealing that Grimes was working on Masters' behalf all along. While Vukovich is stunned at the revelation, Masters grabs a board and knocks him unconscious. Masters then covers Vukovich with shredded paper and is about to set him on fire when Vukovich wakes up and shoots Masters. Masters drops his lighter and accidentally sets himself ablaze, while Vukovich empties his gun on the burning man, killing him.\nVukovich visits Ruth as she packs up to leave L.A. He mentions Chance's death, deducing she had known all along that Ling was FBI. He knows Chance had left her with the remaining cash that his agency now wants back, but Ruth says she needed it to pay debts she owed. Vukovich declares that Ruth is working for him now, turning into the same \"whatever it takes\" agent that his partner was."}