{"mid": "TomAndJerryTheMagicRing", "IMDB_id": "tt0303151", "title": "Tom and Jerry: The Magic Ring", "plot": "The story starts out with a haunted, creepy-looking crawlies mansion house, where Tom Cat, as usual, chases Jerry Mouse and breaks everything in the house. Meanwhile, in the basement, a wizard named Chip is making a magical potion. He uses his magic ring to make his potion, until he realizes that it doesn't work. Chip checks the milk carton that he used on the portion, but there is no substitution for the milk of a cow that lives in Calcutta.\nLater, Tom ends up being thrown into the basement, and Chip orders him to guard his magic ring while he goes to Calcutta to milk a cow. If Tom does a good job, he'll be rewarded with a big juicy salmon, but if not, (\"there will one less kitty to clean up after here\") which meant that he shall be kicked out of the house with no return for good. Chip leaves for Calcutta by using his motorcycle, leaving Tom to guard the ring in the basement. Unbeknownst to Tom, an interested Jerry finds the ring, while climbing the table and puts it on his head. Tom spots Jerry, and orders him to give back the ring, but to no avail. Soon, Jerry runs out of the house, and Tom frantically attempts to find and hunt down him.\nAfter losing Tom, Jerry goes through different situations, like trying to pull the ring off his head, but it gets stuck, much to his horror. He attempts to get it removed by going to the jewelry store of a diamond cutter, and meeting a ring loving dog and Droopy in a fortune telling house. However, the store is closed and the owner has left to get some lunch. Tom sneaks into the store and disguises himself as a worker, using his tail for a mustache and attempting to help Jerry get the ring off, but meets with no success. He fails as well and he blows his cover when his mustache--and his tail--fall off, revealing his true identity. Tom chases our mouse throughout the store, and soon, the diamond cutter returns. Tom and Jerry exit the store. Tom destroys the store and ends up getting chased away by the owner.\nJerry runs off into a fortune-teller home, where an Irish dog Butch and Droopy from the Tex Avery cartoons are residing in. After seeing how lovely Jerry's ring looks, and including the fact that Jerry wants it removed, Butch attempts to pull it off, but fails. Tom comes in, and Jerry runs out, with Butch chasing after him as well. Soon, they end up in an alley, where an alley cat (Also known as Butch Cat) happens to be taking a nap. He wakes up and tries to grab Jerry for his dinner. Tom successfully grabs Jerry in time, and by flicking the ring on his head, makes random objects fall on a horrified alley cat. Butch then comes and is able to get the ring off Jerry's head after Jerry bites Tom's hands, which only causes him to be sent flying to the dog. Tom and the alley cat then chase Butch and then wind up spinning and rolled toward Jerry, and unfortunately, the ring gets stuck back on his head. When Tom is running away from Butch and the alley cat, he takes a shortcut to lose sight of them until he accidentally slips on a banana peel, which Jerry's ring then increases the size of; Tom slips on it again and rides on it toward the door of a pet store, leaving Tom unconscious.\nA kind old lady comes out and brings the two inside, putting them in two separate cages. However, Tom is paired with Spike and his son Tyke while Jerry is left with two mice named Freddie (better known as Muscles from Jerry's Cousin) and Joey (Muscle dumber partner) who bully a younger mouse, cute and dimwitted ]Nibbles. At first, Jerry proves to be unsuccessful in trying to stop the mouse bullies from hurting Nibbles until he uses the ring to turn them into hunks of cheese. When the cheese mice escape the cage and Nibbles fails to catch up with them since he intends to eat them, Jerry uses the ring to make giant Nibbles grow into a giant mouse capable of breaking free from the cage as he grows and catch up with the cheese mice as they escape the store. An unnamed boy (only known as Junior) comes and buys Jerry as his pet. The boy plays Jerry until the ring produces magic, melting Tom and escaping the cage, he sneaks outside and snatches Jerry from The Boy's hand. The upset boy tells his mother and she tells the police officer, who sends police cars after the cat. Then, the alley cat and Butch, while still looking for Jerry, find Tom and they chase him. Meanwhile, Spike and Tyke get out of the building as well, but right when Tom steps on Tyke. At this point, Spike and Tyke are added in the chase. They run everywhere and Tom and Jerry escape by riding a bus. Suddenly, the bus stops and it reverses, causing Tom and Jerry to panic. The driver is Droopy, and then they are lost until the boy finds Tom and whistles, and the cat and mouse end up cornered in a garbage dump. This leads to about 15 minutes of the movie of a long chase of silliness.\nFortunately, Jerry uses the magic ring to freeze the dogs, alley cat, and police cars. Now that they are saved, Tom and Jerry return home, where Tom once again tries to get the ring off, but every time he fails. Jerry hides in a kitchen cupboard and uses Furniture Ring Remover to get the ring off before throwing the ring in the basement. Tom gets the ring, but panics with fear because he realizes it is stuck firmly on his finger.\nTom hears his master Chip coming and tries to get the ring off, with no prevail. Tom quickly tries to trick Chip into thinking Tom has done a good job protecting his ring, but his plan failed when Chip discovers that his ring is on Tom's finger. Chip, believing that Tom attempted to steal his ring, becomes extremely enraged and angrily kicks him out of the house with his magic fury, where the ring immediately falls off Tom's finger, and as he is pleased to see this, it unfreezes all who chase him to his horror. Nibbles manages to join the chase as he is still chasing the mice who both turned into cheese. Jerry receives the salmon from Chip, which he then turns into a cheese by the ring's power."}