{"mid": "TomAndJerryTheMovie", "IMDB_id": "tt0105616", "title": "Tom and Jerry: The Movie", "plot": "While moving house with their owners, Tom and Jerry get into a chase, and Tom nails Jerry inside his mousehole with floorboards, and is pleased to have kept the mouse from coming with him, but misses the moving van and is forced to stay in the house after angering a nearby bulldog. The house is demolished the next morning with Tom going back inside to rescue Jerry, leaving them both homeless. Wandering through the city, they meet a dog, Puggsy, and his flea friend, Frankie, who try to persuade them to be friends. While finding food from some nearby bins for a feast, Puggsy and Frankie are captured by two dogcatchers, while Tom and Jerry end up in a tussle with some alley cats. They escape after Jerry fools them into falling into the sewer.\nThey then cross paths with a twelve-year-old girl, Robyn Starling, who has run away from home. She tells them that since her mother died in childbirth and her father was apparently killed in a recent avalanche, she has been living with her evil guardian, \"Aunt\" Pristine Figg, her scheming lawyer and boyfriend, Lickboot, and her overweight skateboarding dog, Ferdinand, but ran away after Figg threw Robyn's locket out of the window. Despite Robyn's misgivings, Tom and Jerry persuade her to return home and they are taken in as pets. Tom and Jerry, however, end up in a massive food fight with Ferdinand, and stumble across a telegram confirming that Robyn's father is still alive which Figg hides from Robyn. Figg sends them to an animal shelter run by Dr. Applecheek, who turns out to be a cruel animal kidnapper, and the true employer of the two dogcatchers who caught Puggsy. Reuniting with Puggsy and Frankie in the cells, Tom and Jerry tell them all that has happened, then stage an escape and free all of Applecheek's captured animals, among them Droopy, and rush to tell Robyn the news. Elated, Robyn becomes determined to find her father in Tibet and they escape the city on a raft in the river, but the raft is struck by a ship and they end up separated. Figg places a $1 million bounty on Robyn without even planning to give that kind of money, while Mr. Starling is alerted of his daughter's situation and rushes back to America to find her.\nRobyn is found by Captain Kiddie, the owner of a failing amusement park, and he houses her until seeing an ad for the reward on a milk cardboard with the help of his parrot puppet Squawk, upon which he traps Robyn on the ferris wheel and contacts Figg. Tom and Jerry also find Robyn and they flee in a paddle boat as Figg, Lickboot, Applecheek and the dogcatchers arrive. A long chase ensues, in which the dogcatchers end up trapped in the ferris wheel and Kiddie and Applecheek are left stranded in the river. Following the river, Tom, Jerry and Robyn arrive at Robyn's summer cabin (Build by her father), but Figg, Lickboot, and Ferdinand have arrived first. In the ensuing scuffle, a lantern is knocked over and the cabin is set on fire. As Figg, Lickboot, and Ferdinand end up stuck on Robyn's boat which goes off out of control, Tom and Jerry manage to get Robyn to the roof just as Mr. Starling arrives in his helicopter. Robyn is saved, but Mr. Starling is unable to reach Tom and Jerry in time before the cabin collapses. They only barely survive and are reunited with Robyn.\nIn the aftermath, Robyn takes Tom and Jerry in as her pets. Just when it appears that they have found friendship, old habits die hard and the duo resume their antics. The film closes as Tom chases Jerry once again."}