{"mid": "Tomboy", "IMDB_id": "tt0090184", "title": "Tomboy", "plot": "Laure is a 10-year-old girl whose family moves to a new address in Paris. One day Laure sees a group of boys playing outside the window and goes to play with them, but they disappear quickly. Instead, Laure meets Lisa, a neighborhood girl. Lisa assumes that Laure is a boy and asks for his name. After a moment's thought Laure introduces herself as Mikäel. Lisa then introduces Mikäel to the rest of the neighborhood children stating that \"he\" is the new kid in the apartment complex. A bath scene in the film reveals that Mikäel has a vulva, and a following scene confirms that her mother addresses her and her sister as \"girls.\" Mikäel becomes friends with Lisa and the boys and tries to hide her genitalia to appear like a boy (make it seem that she has a penis). At one point this leads Mikäel to pee her pants, which originally makes her embarrassed, but is soon forgotten. As they all play, Lisa and Mikäel develop crushes on each other and after swimming one day, Lisa kisses her. At this point, Mikäel also seems to be accepted into the group of boys.\nOne day, when Lisa comes by the apartment to look for Mikäel she runs into Mikäel's younger five-year-old sister, Jeanne instead, thereby revealing to Jeanne how Mikäel is presenting herself to her friends as a boy. At first Jeanne is upset, but when Mikäel promises to take her with her on all her outings for the rest of the summer she quickly becomes happy to have a \"big brother\" which she says is \"way better\" than having a big sister. She also helps Mikäel cut her hair and keeps her secret from their parents. Although her mom is supportive of Mikäel being tomboy (for example, by painting her room blue), she also seems to want her to display more culturally-defined \"female\" behaviors (for example, being thrilled when one day, while playing, Lisa puts makeup on Mikäel's face).\nThen, after a fight with one of the boys, the boy and his mother come to Mikäel's door to get her in trouble. Mikäel's mother pretends to know that Mikäel is her \"son\", but afterwards she gets angry with her for telling everyone that she was a boy. After this incident, Mikäel's mother forces her to wear a blue girl's dress and makes her go over to the apartment of the boy she hit. Jeanne is visibly upset by this and tries to help Mikäel. Mikäel's mother is also clearly upset and sad about the situation. She confesses to Mikäel that she is forcing her to reveal that she is a girl to protect him. Mikäel's mom also makes her go to Lisa's apartment. When Lisa sees Mikäel in a dress, she runs off without a word.\nMikäel also runs away to the woods. After a time alone, she takes off the blue dress, leaving her in a boyish tanktop. Walking away from the discarded dress, Mikäel sees the other children in the distance. She can hear them talking about him and speculating if she is really a girl. When they spot her, they chase her and surround him saying they're going to see if she's really a girl. Lisa stands up to them and tells them to leave her alone. Once she is called disgusting for kissing a girl, however, Lisa reluctantly \"checks\" and confirms Mikäel's genitalia. They leave Mikäel alone in the woods in despair.\nLater, we see Mikäel in her house with her mom, younger sister and new-born baby brother, not wanting to go outside. But, when she sees Lisa standing waiting outside her window she goes out to meet her. She asks her quietly what her name is. She says she is called Laure. She starts to smile. This final scene suggests hope for at least a friendship between her and Lisa."}