{"mid": "Toonsylvania", "IMDB_id": "tt0143068", "title": "Toonsylvania", "plot": "A typical episode of Toonsylvania starts with a cartoon series called \"Frankenstein\" (a parody of Mary Shelley's novel of the same name), about the adventures of Dr. Frankenstein (voiced by David Warner), his assistant Igor (voiced by Wayne Knight) who always sets out to prove that he's an genius like his master, and their dim-witted Frankenstein Monster known as Phil (voiced by Brad Garrett). Before the second cartoon, there is an animated vignette where Igor is on the couch with Phil and tries to fix the TV remote, but in every episode there's a new problem with it (a running gag akin to the couch gags seen on The Simpsons).\nAfter that, there is a cartoon series called \"Night of the Living Fred\", about a family of zombies. This segment was created by cartoonist Mike Peters. Sometimes, a parody of a B-list horror movie would air instead of a \"Night of the Living Fred\" cartoon.\nAfter that is a short segment called \"Igor's Science Minute\", where Igor gives a science lesson (be it a musical piece or a spoken piece) that always ends in disaster.\nThe final segment is \"Melissa Screetch's Morbid Morals\", where Phil the Frankenstein monster does something bad and Igor punishes him by reading a horror tale involving a bratty girl named Melissa Screetch (voiced by Nancy Cartwright) who doesn't heed the warnings of adults (usually given by her mother) and suffers the consequences one way or the other for it.\n=== Second season changes ===\nIn season 2, Bill Kopp and Jeff DeGrandis left the show and were replaced by Paul Rugg. The series' format changed into more of a sitcom style, with Igor, Dr. Frankenstein and Phil interacting with a variety of new characters, including a snooping next-door neighbor Seth Tuber (voiced by Jonathan Harris), who was based on Norman Bates from Psycho. He interacted with his \"immobile\" mother by putting his hand over his mouth and talking into it. There was also a typical Transylvanian angry mob that was in fact a cheerful group of Beatles-esque hipsters. Most of these new characters were voiced by Paul Rugg, who also improvised many of their lines.\nThe only other backup segments to re-materialize in season two were the B-movie parodies (though some episodes of \"Night of the Living Fred\" aired) and Melissa Screetch in a new segment called \"The Melissa Screetch Show\". Whenever Melissa was disappointed with a friend or a family member, she'd go home and cover herself under her bedsheets where she pretended to host a show. She then had her transgressor on as a guest star and often did away with them in an ironic manner."}