{"mid": "TopDog", "IMDB_id": "tt0114697", "title": "Top Dog", "plot": "The film opens as two white nationalists destroy an apartment complex in which most of the residents are minorities. Veteran police officer, Sgt. Lou Swanson, and his police dog, Reno, investigate the crime and realize the explosives are military in style. Their investigation takes them to the harbor, where they find a ship loaded with weapons. They are discovered and shot. Lou dies, but Reno survives.\nMaverick cop Jake Wilder (Chuck Norris), is called by police captain Ken Callahan (Clyde Kusatsu), who requests Jake to take over the case. Jake is angered that he has to work with Reno, despite Reno proving himself capable through a battle training scenario.\nMeanwhile, Neo-Nazis are trying to smuggle weapons across the border from Mexico. It is implied that they murdered their Mexican arms dealers. They are stopped by the Border Patrol and try to escape, but their car is destroyed in the process.\nJake and Reno survive an assassination attempt at Jake's home. Afterwards, Jake is visiting his mother, who reveals that Adolf Hitler's birthday will be the following day. Jake realizes this a clue, and takes off running. The police department works with the sheriff's office, as well as the FBI in determining where the Neo-Nazis are going to hit. One officer reveals that on Hitler's birthday (April 20), the Pope, and several other of his esteemed bishops will host the Coalition for Racial Unity.\nAs the Neo-Nazis hitmen are practicing for their attack, the leaders are revealed not to be just one white supremacist group, but an alliance of several including the Ku Klux Klan, the Aryan Nations, and the Church of the Creator. They plan to use their attack on the Coalition for Racial Unity as an opportunity to unite all the Neo-Nazi groups in the US, as well as the world.\nJake discovers the location of the warehouse where the Neo-Nazis are located. He and Reno go undercover and manage to steal a piece of evidence that could be used to convict the Neo-Nazi leaders. They are discovered and Jake orders Reno to flee with the evidence. Wilder subdues several radicals during the following fight, however he is finally captured, after a dozen attackers confront him at all once, and he's then hit on the head with a blunt object. He wakes up to find that he is tied up and the Neo-Nazi plan is now under way. Reno finds Jake, and eats away his rope bindings, just before a Neo-Nazi has the chance to kill him. Jake is able to call the police chief and tells him that the plan is in motion.\nThe police, FBI, CTU, and Sheriff's Department arrive as the Coalition for Racial Unity is attacked and in a gun battle many Neo-Nazis are killed. The Pope and his Bishops get in their bulletproof car, but it is rigged to explode. Wilder defuses the bomb, while Reno goes after the Neo-Nazi leader. Wilder chases after him as well, and after a vicious fight, manages to subdue him. Reno is set to attack the Neo-Nazi leader, who confesses to killing Reno's former veteran cop owner. Just before Reno can attack the leader, Lou's grandson, Matthew, arrives to stop him."}