{"mid": "TopSecret", "IMDB_id": "tt0088286", "title": "Top Secret!", "plot": "Nick Rivers, a highly successful United States rock star (\"Skeet Surfing\"), travels to East Germany to perform at a cultural festival, which secretly serves the East German government as a diversion for an illegal military operation with the intent of reuniting Germany under their rule. At a dinner, Nick encounters Hillary Flammond, a member of the local resistance movement, attempting to avoid the authorities. He pretends to be her date to get to know her, and performs an impromptu song and dance (\"Tutti Frutti\") mistakenly thinking that he was asked to do so, to the delight of Hillary and the crowd but to the annoyance of General Streck, the mastermind of the \"reunification\" plot.\nNick later sees Hillary at a ballet, where she is trying to meet with a resistance contact, but is met by the police instead. Nick saves her and they try to escape, but Nick turns himself in so that Hillary can get away. He is taken to a prison where he is questioned and tortured, but he knows nothing and does not break. In an escape attempt, he ends up in the secret lab of Dr. Paul Flammond, a brilliant scientist developing the \"Polaris naval mine\", a device that can destroy the entire NATO submarine fleet as part of the government's plot; the Germans force him to work by threatening to kill his daughter Hillary. Nick is recaptured and scheduled for execution.\nThe East Germans decide that Nick must perform to avoid an international incident, and he does so to the rapturous joy of the local girls (\"How Silly Can You Get\"/\"Spend This Night with Me\"). He is rescued by Hillary at the end of his performance, after which they spend the night in the loft of a Swedish bookstore. Nick plays for her (\"Are You Lonesome Tonight?\") and they make love. The next morning, they are moved to the \"Potato Farm\" where they meet members of the French Resistance, led by Nigel \"The Torch\", who was a lover of Hillary from when they were stranded on an island as youths. Nick is upset by Hillary's residual love for Nigel, but accepts that they must work together for the cause. After fighting off an attack by the Germans, who were tipped off by the secret traitor, they move to a pizza restaurant, where Nick proves that he's not the traitor by performing for the locals (\"Straighten Out the Rug\").\nThe resistance group stages a rescue of Dr. Flammond, where Nigel and Du Quois, a resistance leader, dress up in a fake cow outfit to disable the prison's defenses. While the other members successfully infiltrate the prison, Nigel reveals himself as the traitor. Dr. Flammond is rescued, but Nigel makes off with Hillary, and Nick is forced to rescue her in an underwater bar room fight. With their flight about to leave, Hillary chooses to go with Nick and her father to America."}