{"mid": "TortoiseWinsByAHare", "IMDB_id": "tt0036452", "title": "Tortoise Wins by a Hare", "plot": "Two years after the events in Tortoise Beats Hare, Bugs is determined to learn how Cecil managed to win against him after viewing footage of the previous cartoon (which seems to depict Cecil as having won fairly instead of by cheating Bugs with his cousins). Bugs then he goes to the turtle's house disguised as an old man (a parody of Bill Thompson's \"Old Timer\" character from Fibber McGee and Molly) to ask the about his secret. Cecil is not the least bit fooled by the disguise, but goes along with the gag claiming that his streamlined shell lets him win, and produces a set of blueprints for his \"air-flow chassis.\" He also adds that in contrast, the long ears of a rabbit only serve as \"wind resistance\", which in turn would slow the rabbit down. The turtle ends the conversation with the comment, \"Oh, and another thing... Rabbits aren't very bright, either!\" just before slamming the door in the enraged bunny's face. Not getting the hint that the turtle's story is a humbug, Bugs builds a shell of his own and prepares for the new race.\nMeanwhile, the bunny mob learns of the upcoming match-up and places all its bets on Bugs, and hint that \"the toitle\" won't even finish the race. Initially, Bugs takes the easy lead, after dressing up in his new chassis. The rabbit mob sees Bugs and mistakes him for Cecil, attacking him, despite Bugs' insistence that he's the rabbit. Cecil doesn't help Bugs' cause by dressing up in a rabbit suit, with the rabbit mob believing Cecil's the real rabbit and cheers him on, causing Cecil to affirm to the audience, \"I told you rabbits aren't very bright.\" Bugs still manages to regain the lead and nearly wins, until the mob stalls Bugs right before the finish line, while other rabbits rush Cecil to the finish line and victory. Bugs then bursts out crying, ripping off his chassis and revealing that he was the real rabbit. The despaired rabbits reply, \"Ehhh, now he tells us,\" before killing themselves with a single bullet going through all their heads."}