{"mid": "ToTheWonder", "IMDB_id": "tt1595656", "title": "To the Wonder", "plot": "Neil (Ben Affleck) is an American traveling in Europe who in Paris meets and falls in love with Marina (Olga Kurylenko), a Ukrainian divorcée who is living with her 10-year-old daughter Tatiana (Tatiana Chiline). Basking in their new romance, the lovers travel to Mont St. Michel, the island abbey off the coast of Normandy. Neil makes a commitment to Marina, inviting her to relocate with Tatiana to his native Oklahoma. Neil takes a job as an environmental inspector, and Marina settles into her life in the United States. After some time, the couple’s passionate romance cools. Marina finds solace with the Catholic priest Father Quintana (Javier Bardem), who is undergoing his own crisis of faith. Tatiana begins to feel homesick due to not having made friends at her school, and complains that Neil is not her real father. Sometime later, Marina tells Neil that her visa has expired, and she and her daughter return to France.\nContinuing his work as an environmental inspector, Neil reconnects with Jane (Rachel McAdams), a childhood friend. Jane tells Neil that her farm is going bankrupt because her former husband encumbered it with his huge gambling debt. Neil begins a romance with Jane. Back in France, after giving Tatiana back to her father (Marina's former husband), Marina finds she misses Oklahoma and is unable to find a job. Due to Neil's unwillingness to commit to Jane, their relationship disintegrates.\nReturning to Oklahoma, Marina reconnects with Neil. The couple marry in a civil ceremony. After going to the doctor to discuss removing an intrauterine device in order to be able to conceive, Marina begins to feel isolated again. Although they also had a religious wedding ceremony, the couple's relationship begins to deteriorate. Meanwhile, Father Quintana ministers to prisoners and local people. One day, Marina approaches Charlie (Charles Baker), a carpenter who had given her a wind harp. She follows him to a motel where the two have a tryst. While in a drive-through at a fast food restaurant, Marina confesses the event to Neil and asks his forgiveness. In anger, Neil pulls over and leaves Marina stranded by the road. Shortly after, Neil returns to pick her up.\nNeil later seeks counselling from Father Quintana. Marina appears to have borne a child since her encounter with Charlie but there is ambiguity about the identity of its father. Neil accompanies the priest as he ministers to the poor, learning forgiveness and humility. Eventually offering Marina forgiveness, Neil kneels before her and kisses her hands. Neil and Marina appear to divorce, and they are last seen together as he leaves her at an airport. Marina tells him, \"I want to keep your name\".\nThe film's closing moments depict Father Quintana in his work tending the aged, the poor and the imprisoned with voice-over from the priest reciting a variation of the prayer of St. Patrick (\"Christ with me. Christ before me. Christ behind me...\"). A few years later, Neil is seen with what looks like his family. Marina is shown walking in a rain-drenched, pastoral setting. In a state of ecstatic discovery, she turns to see a brilliant, golden light pass over her face. \"The Wonder\" – Mont Saint-Michel – remains rooted to the earth with its spire piercing heaven."}