{"mid": "TouchezPasAuGrisbi", "IMDB_id": "tt0046451", "title": "Touchez pas au grisbi", "plot": "The entire film takes place over the course of three days.\nMax, a decent and principled gangster, has dinner at Madame Bouche's restaurant, a hangout for criminals, with his longtime associate Riton, their burlesque-dancer girlfriends, and his protege Marco. A newspaper is seen to mention eight bars of stolen gold. The group goes to Pierrot's nightclub, where the girls perform. Max gets Marco a job as a drug dealer working for Pierrot. After the show, Max finds Riton's girlfriend Josy making out with Angelo, another gangster.\nAs Max takes a taxi home to his apartment, he is followed by two of Angelo's men in an ambulance. He gets the drop on them and drives them off, though they claim not to be after him. Max calls Riton and warns him not to go with Angelo, who had just asked Riton to do a job with him. Max and Riton go to Max's spare apartment, which Angelo does not know of. Max assures Riton that the bars of gold which the two of them had stolen some weeks or months prior are safe in a special car in the parking garage, but berates him for mentioning the gold to Josy, who had then told Angelo.\nThe next morning, Max leaves early and takes the gold to a fence. He is told that the money will take a while to procure. He returns to his apartment to find that Riton has left. Max calls Josy's hotel to find that Riton was there, but was recently taken away in an ambulance; presumably the one used by Angelo's men earlier. He briefly and bitterly considers leaving Riton in the lurch, as his incompetence continually hinders Max. Loyalty prevails, though, and he sets out to recover Riton.\nMax begins by going to Madame Bouche's restaurant and hiring Marco as backup. They go to Josy's hotel, where they capture Fifi, one of Angelo's thugs on the lookout for them, and interrogate Josy. Learning no useful information, they proceed to Pierrot's and interrogate Fifi, with a bit more roughing-up but not much more success. Angelo telephones and proposes to trade Riton for the gold. Max agrees, and he, Marco, and Pierrot arm themselves, take the gold, and head out in Fifi's car, dropping Fifi by the side of the road.\nThe initial exchange, on a deserted back road, goes without incident. Riton is returned unharmed, and the gold is given to Angelo. As Angelo's car drives away, Riton warns Max that, though blindfolded, he heard a second car. The second car appears in the distance, and Max warns everyone to take cover. The car drives by and its occupants blow up Fifi's car with hand grenades, killing Marco. They get out to mop up the scene, but are gunned down by Max, Pierrot, and Riton. The three of them get into the non-exploded car and chase Angelo. Riton is wounded by return fire, but Pierrot shoots out the tires and Angelo's car crashes. Angelo himself, the only survivor, stumbles out of the car and pulls out another grenade. He tries to throw it at Max's group, but is shot in the process. The grenade blows up Angelo and sets fire to his car. Max is unable to retrieve the gold from the hotly burning wreck, and they are forced to leave as a long haul truck approaches.\nAt dawn they are back at Pierrot's, with Riton being patched up by a mob doctor. Max, careful to maintain his habitual rounds to avoid any speculation of his recent whereabouts, takes Betty, his upperclass lover, to Madame Bouche's restaurant for lunch, where all the talk is about the recovery of the stolen gold from the wreck of Angelo's car. Some other diners, fellow crooks, ask Max if he thinks it is true, as the papers say, that Angelo was the thief; Max evades the question. Pierrot telephones to tell Max that Riton has died. Max has the roast beef."}