{"mid": "ToughGuysDontDance", "IMDB_id": "tt0094169", "title": "Tough Guys Don't Dance", "plot": "On the 24th morning after the decampment of his wife, Patty Lareine (Debra Sandlund), Tim Madden (Ryan O'Neal), a former bartender and ex-con who was imprisoned for dealing cocaine, currently struggling to make a living as a writer and who is prone to blackouts, awakens from a two-week bender to discover a tattoo reading \"Madeline\" on his arm, and a bloodbath in his car. He shortly finds a woman's severed head in his marijuana stash in the woods, and the new Provincetown police chief Luther Regency (Wings Hauser) shacked up with his former girlfriend Madeleine (Isabella Rossellini).\nFlashing back, Madden remembers the time when he encouraged Madeleine to go swinging with a Li'l Abnerish couple from down South, the fundamentalist preacher Big Stoop and his Daisy Mae-ish wife, Patty Lareine, whose ad Tim had come across in Screw magazine. On the trip back Tim and Madeleine's car crashes, due to Madeline being incensed that Tim has so enjoyed Patty Lareine's charms. The pregnant Madeleine loses her baby due to the crash.\nExcept for his father (Lawrence Tierney), who is dying of cancer, Tim suspects everyone, including Patty Lareine, multi-millionaire prep-school pal Wardley Meeks III — and even himself — of murder. Patty Lareine had left Big Stoop, married Wardley, left him in a messy divorce that netted her a rich cash settlement, and in turn married Tim, whom she fancied. Patty Lareine disappears, and Tim goes on his fatal bender that has left his memory in shards after receiving a letter from Madeline informing him that her husband (Regency) is having an affair with his wife (Patty).\nTim remembers his assignation in the local tavern's parking lot with the blond porn star Jessica Pond, while her effete husband Lonnie Pangborn watched from the sidelines, distraught. It was Jessica's head in the Hefty bag with his grass, but soon another head turns up in his marijuana stash, that of Patty Lareine.\nTim's father helps him get rid of the heads into the bay. Regency ultimately goes crazy and is shot by Madeline."}