{"mid": "TowerBlock", "IMDB_id": "tt1992258", "title": "Tower Block", "plot": "One night in London, the 15-year-old Jimmy (Ralph Laurila) runs through a housing estate begging passersby for help. Everyone ignores him. He enters the condemned Tower Block 31 and finds his way to the top floor, which is the only floor that is still inhabited as the tenants wait to be rehoused. He bangs on doors as the two masked men who have been chasing him appear. The only person who helps him is office worker Becky (Sheridan Smith), but she is beaten to the ground and he is dragged away. The next morning Detective Constable Devlin (Steven Cree) conducts door-to-door enquiries about the previous night's murder, as the boy's body has been found. Nobody will speak to him; not even Becky, who claims her injuries are the result of a mugging.\nThree months later, Becky wakes up in her flat next to her colleague Ryan (Jamie Thomas King), with whom she has had a one-night stand following an office party. As they have breakfast, Ryan is suddenly shot in the head through the window. Becky flees into the hallway, along with the other residents, as all the flats have been targeted: young couple Amy (Loui Batley) and Jeff (Michael Legge); Carol (Julie Graham) and her teenaged computer game addict son Daniel (Harry McEntire); chavvy single mother Jenny (Montserrat Lombard); middle-aged former soldier Neville (Ralph Brown) and his wife Violet (Jill Baker); small-time drug dealers Gary (Nabil Elouahabi) and Mark (Kane Robinson); lonely alcoholic Paul (Russell Tovey); and petty criminal Kurtis (Jack O'Connell), who extorts protection money from his neighbours. Amy, Jeff, and Mark are wounded. As well as Ryan, Carol's husband and Jenny's two young children have already been killed by the sniper. Amy too soon succumbs to her injuries despite the best efforts of Violet, who is a first aider. The phones and internet have stopped working. The walls and doors are covered by homemade posters bearing three emoticons. Daniel, who has learned about such things from computer games, says that the sniper knows what he is doing and is using a high-powered military-grade rifle.\nThe fire escape is exposed to the sniper's gunfire, so they force open the lift door. It is boobytrapped with a shotgun, however, which kills Jeff. Becky, Kurtis, and Paul climb down the lift shaft, but discover the ground-floor exit door has been blocked with a skip and return to the top floor. Jenny suggests the emoticons symbolise the three wise monkeys and that the sniper is targeting them because they let Jimmy be killed and refused to speak to the police about it. She then walks into her flat to be shot dead alongside her children.\nThe largest of the posters has been stuck on the door of the flat occupied by Gary and Mark. Kurtis forces them to admit that they were the two masked men who chased and beat Jimmy because he had withheld money from them after they used him as a drug courier; they claim they did not mean to kill him. Nevertheless, Kurtis forces them into the flat where the sniper kills both of them.\nBelieving they can now leave because Jimmy's killers are dead, Carol runs down the fire escape, followed by Daniel. The sniper lets them reach the ground and then kills both of them. It is now obvious that he intends to execute all of them for refusing to help the police. The survivors have now been trapped for two days. They hatch a plan to tie all the building's fire hoses together and for one of them to climb down to the ground from the roof on the far side, where the sniper cannot see. Paul volunteers to go. Violet opens the door to the roof and is killed by another shotgun boobytrap. Becky, Kurtis, and Paul climb to the roof and secure the hoses, and Paul begins to climb down. The sniper, however, shoots the top of the hose until it breaks, and Paul falls to his death. Becky and Kurtis barely manage to get back inside.\nAs a final act of desperation, the three survivors set fire to the top floor, hoping someone will see the fire and alert the emergency services. They then climb down the lift shaft. Kurtis falls and breaks his leg. Property developer Kevin (Christopher Fulford) and his assistant Eddie (Tony Jayawardena) arrive and spot the flames, but before they can call the fire brigade, the gunman shoots them both at close range. He then enters the building after throwing in a smoke grenade. Becky sneaks out and finds a nail gun in Kevin's pick-up truck. Using this the three survivors manage to subdue the gunman and remove his mask, only to discover it is DC Devlin, who has cracked after endless lack of assistance in the cases he is investigating. After a struggle, Becky kills him with the nail gun and the survivors walk outside with the sound of approaching sirens."}