{"mid": "ToWongFooThanksForEverythingJulieNewmar", "IMDB_id": "tt0114682", "title": "To Wong Foo Thanks for Everything, Julie Newmar", "plot": "After tying for the win in New York City's \"Drag Queen of the Year\" contest, Noxeema Jackson (Wesley Snipes) and Vida Boheme (Patrick Swayze) win a trip to Hollywood to take part in the even bigger \"Miss Drag Queen of America Pageant.\" Before they depart, Vida persuades Noxeema to take along the inexperienced \"drag princess\" Chi-Chi Rodriguez (John Leguizamo) as their protégé (they initially refer to him simply as a \"boy in a dress\" rather than as a fully-fledged drag queen). To do this, they trade in their airplane tickets for cash and buy a stylish but old Cadillac convertible with money given to them by John Jacob Jingleheimer Schmidt (Robin Williams). They set off for Los Angeles in it, carrying with them an iconic autographed photo of Julie Newmar (signed, \"To Wong Foo, Thanks for Everything! Julie Newmar\") that Vida purloined from a restaurant wall.\nWhile on the road they are pulled over by the racist, homophobic, and sexist Sheriff Dollard (Chris Penn), who tries to rape Vida. He discovers Vida is not a woman and, in the commotion, he falls backwards and is knocked unconscious. They think he is dead, hurry off, and leave him behind. As they recover from the incident at a rest stop, their car breaks down. A young man, Bobby Ray (Jason London) from the nearby small town of Snydersville, happens to pass by and gives them a ride, where they take refuge in a bed and breakfast inn owned by Carol Ann (Stockard Channing) and her abusive car repairman husband, Virgil (Arliss Howard).\nThey become stranded in the town for the weekend as they wait for the replacement part for their car to arrive. Chi-Chi is harassed by a group of roughnecks, but is saved by Bobby Ray. While volunteering to help with the town's Strawberry Social, they decide its small band of women need a day with them, which consists of the following steps: get your hair done, pick out a new outfit, and then just sit in a cafe and talk. While searching for the new outfits, they are ecstatic to find vintage fashions from the 1960s in the town's clothing store and give the female residents (and themselves) a make-over.\nFollowing their makeover, they are abused by the same roughnecks that attempted to attack Chi-Chi. Fed up, Noxeema handles the situation in a typically New York City manner and teaches their ringleader a lesson in manners. Vida, Noxeema, and Chi-Chi do what they can to be positive, and they set out to improve the lives of the townspeople, including offering assistance in organizing the Strawberry Social.\nMeanwhile, Sheriff Dollard is ridiculed by his colleagues, who believe he was beat up by a girl. He goes off in search of the drag queens.\nVida, in the meantime, becomes acutely aware of Carol Ann's abuse at the hands of Virgil and, shortly thereafter, they overhear him giving her another beating. Vida decides to intervene and beats him up before throwing him out of the house.\nCarol Ann is able to repair their car, but they remain for the Strawberry Social. Carol Ann reveals to Vida that she knew she was a drag queen all along due to her Adam's apple, which is less prominent in women.\nNot too far away, Virgil runs into Sheriff Dollard at a bar and they realize that the newcomers are the same people Dollard has been searching for. They head back to Snydersville, and Dollard demands that the townspeople turn them over. The other townspeople, who now realize that their new friends are not women, begin to protect them. One by one they step up and confront Dollard, each one claiming to be a drag queen (in similar fashion as in Spartacus). He is humiliated and flees. The Strawberry Social commences with everyone dressed in vibrant red outfits for it. The townfolk then say goodbye to their new friends as Noxeema, Vida and Chi-Chi prepare to leave. In honor of their friendship, Vida gives Carol Ann the autographed photo of Julie Newmar that has accompanied them on their trip.\nThey eventually make it to Los Angeles where Chi-Chi, after having received many tips from Vida and Noxeema during their ordeal, wins the title of Drag Queen of the Year. Fittingly, the crown is presented by Julie Newmar herself."}