{"mid": "TransformersAnimated", "IMDB_id": "tt1055335", "title": "Transformers: Animated", "plot": "=== Pilot episodes ===\nThe series began with a three-part pilot called \"Transform and Roll Out!\". Stellar cycles (centuries) after the Autobots won the great war for Cybertron against the Decepticons, an Autobot maintenance crew led by Optimus Prime and consisting of Ratchet, Bulkhead, Prowl, and Bumblebee discover the legendary Allspark buried on an asteroid. The Autobots take the Allspark back to their ship, but are soon confronted by a crew of Decepticons led by the notorious warlord Megatron and consisting of Blitzwing, Lugnut, Blackarachnia, and Starscream. Megatron attacks the Autobot ship and tries to retrieve the Allspark, but when an explosive planted on Megatron by the treacherous Starscream detonates, the ship crashes on Earth. The Autobots go into stasis to survive the crash, while the scattered remains of Megatron are discovered by a human scientist named Isaac Sumdac.\nFifty years later, Professor Sumdac is the CEO of a robotics company known as Sumdac Systems, which is based in a futuristic version of Detroit. Optimus Prime and the Autobots awaken from stasis and defend the people of Detroit from a monster, resulting in them becoming local celebrities. They befriend Sumdac's young daughter Sari, who teaches them about Earth customs. At the end of the pilot episodes, Starscream arrives on Earth and tries to take the Allspark for himself, but the Autobots successfully stop him and save the city once again.\n=== Season One ===\nIn the first season, the Autobots settle into their new home and learn about Earth culture and customs, all of the while defending Detroit from various threats. Megatron's disembodied head, which has been in Professor Sumdac's laboratory since the ship crashed, comes back online and manipulates Sumdac into building him a new body, pretending that he is an Autobot. Blitzwing and Lugnut arrive on Earth searching for Megatron, while Blackarachnia targets Optimus Prime, blaming him for her techno-organic mutation. New Transformers introduced in the first season include the Autobot Arcee (who only appears in Ratchet's flashbacks), the Decepticon Soundwave, the bounty-hunter Lockdown, and the Dinobots Grimlock, Snarl, and Swoop. Several human villains are also introduced, including Nanosec (who can run at extreme speeds), the Headmaster (who pilots a machine that attaches to and controls large robots) and Meltdown (who is covered in a toxic and corrosive substance). The season ends with Megatron returning with a new body (built by the Allspark from his old body), and the Allspark exploding into fragments that scatter across Detroit.\n=== Season Two ===\nIn the second season, the Autobot Elite Guard members Ultra Magnus, Sentinel Prime, and Jazz arrive on Earth to retrieve the Allspark, only to learn of its destruction in the Season One finale. While Sentinel completely disbelieves Optimus's claims, Optimus and his team are eventually able to convince Magnus of Decepticon activity on Earth. The main theme for Season Two is the discovery of small fragments of the Allspark littered across the city (and possibly, the entire planet), while the Decepticons work on building a space bridge back to Cybertron with the help of Issac Sumdac, who was kidnapped by Megatron in the previous season's finale. This is part of Megatron's plan to invade Cybertron from within, without the Autobots' awareness. New characters introduced in season 2 include the Autobots Omega Supreme (who was revealed to be Optimus Prime's team's spaceship), Wreck-Gar, Wasp and Blurr, the Decepticons Shockwave, Swindle, Mixmaster and Scrapper, the human villain Slo-Mo (who is able to slow down time), and Starscream's army of clones Thundercracker, Ramjet, Skywarp, Sunstorm, and Slipstream (none of the clones are openly referred to by name in the series, the names listed come from the toy-line, while Slipstream was retroactively given her name by Hasbro). At the end of the season, the Decepticon Space Bridge is destroyed, but Megatron, Starscream, and Omega Supreme are sucked through and lost in deep space. Sari meanwhile, notices an injury that exposes mechanical parts under her skin, revealing that she is not completely human.\n=== Season Three ===\nFollowing the events of the two-part second season finale, Sari is shocked and distraught over the revelation that she is a robot, and instantly assumes that her \"father\" had built her, refusing to believe Sumdac's claim that he discovered her as a small liquid metal body. Prowl does some research and discovers that Professor Sumdac was in fact telling the truth, and deduces that Sari is a Cybertronian protoform (the early development stage of an Autobot and Decepticon) that scanned Professor Sumdac's genetic information. Sari later uses the power from her AllSpark-powered key to upgrade herself into an armored techno-organic teenage form that is far taller and much stronger equipped with numerous weapons and special abilities.\nMeanwhile, on Cybertron, Shockwave (disguised as the Autobot Longarm Prime) sabotages several Elite Guard operations in preparation for Megatron's return, unaware that Megatron and Starscream are lost in deep space, trying to gain control of Omega Supreme. Suspecting that the double-agent may be the escaped convict Wasp, Ultra Magnus sends Sentinel and Jazz back to Earth to find and apprehend Wasp, who has found his way to Earth to exact revenge on Bumblebee for framing him. Soundwave and Arcee reappear in season 3, with Soundwave being accompanied by minions Laserbeak and Ratbat. New characters introduced in season 3 include the Constructicon Dirt Boss, the Autobot scientist Perceptor, Prowl's mentor Yoketron (who only appears in Prowl's memory flashes), and the Elite Guard members Jetstorm and Jetfire.\nIn the two-part season finale, Jazz joins Optimus Prime's team on Earth, while Megatron and Starscream also find their way back to Earth, using information stored deep winin Arcee's subconscious mind to create an army of Omega Supreme-sized robots in Lugnut's likeness. Optimus defeats Megatron with the aid of Ultra Magnus' Magnus Hammer and a \"Wingblade\" jetpack built by Professor Sumdac, Ratchet, and Sari while Prowl sacrifices himself to re-assemble the Allspark and destroy the \"Lugnut Supremes\". The Autobots return to Cybertron with the apprehended Decepticons, and are hailed as heroes upon arriving on their home world.\n=== Season Four ===\nA fourth season, consisting of about 36 episodes, was initially planned and intended, but was cancelled. According to Transformers Animated: The AllSpark Almanac II, season four's main theme would have been the discovery of Energon deposits left by the Allspark across Detroit. Optimus Prime, Bumblebee, Jazz and Ratchet would have returned to Earth along with new team member Ironhide (who would scan a pick-up truck vehicle mode resembling the live-action film version of the character), while Bulkhead and Sari would have remained on Cybertron, with Sari discovering more about her unique origins and Cybertronian species, and Bulkhead defending Cybertron's energon farms from the Decepticons. Megatron would also reformat into a new, Triple-Changer body, with his new vehicle modes being a fighter jet and a tank, both of which would be Cybertronian. An action figure was designed for Megatron's new body (along with figures for Powermaster Optimus Prime and Hot Shot's earth mode), but was never mass-produced or released at retail. Megatron would have broken out of Trypticon Prison on Cybertron and relocate the city of Kaon to Earth, using the Energon deposits to build machinations that could threaten all life on the planet.\nOther ideas planned for the cancelled fourth season include Blackarachnia returning with an army of Predacons, Bulkhead and Sari entering a parallel universe with evil Autobots and heroic Decepticons (an homage to the Shattered Glass comic), Minicons from Kaon disabling all the machinery in Detroit (an homage to the film Gremlins), the introductions of the Autobot Cosmos (who would have scanned a prop flying saucer from the set of a B-Movie) and the Decepticon Bludgeon (who would have been a pirate), and a new group of human villains called S.T.E.A.M. (short for Saving The Earth And Mankind), who are against modern technology and use Steampunk-style weaponry.\n=== Return to The Hub ===\nThe Hub started airing reruns of the show on July 9, 2012, in its original HD format until mid-2014."}