{"mid": "TransformersRevengeOfTheFallen", "IMDB_id": "tt1055369", "title": "Transformers: Revenge of the Fallen", "plot": "In 17,000 B.C., the Seven Primes traveled the galaxy to create Energon with star-absorbing machines called Sun Harvesters. The Primes followed a rule in which to never destroy planets with life, but one of them, Megatronus Prime, later known as The Fallen, defies the rule and sets up a Sun Harvester on Earth, a planet with abundant life. After defeating ancient humans, The Fallen is confronted by the other Primes, who defeat and imprison him before he can harvest the planet's Sun with the Matrix of Leadership. The Primes then sacrifice themselves to hide the Matrix in an unknown location shortly afterwards.\nTwo years after Megatron's defeat, the Autobots join the U.S military to form the Non-Biological Extraterrestrial Species Treaty (NEST), a classified multinational task force hunting down the surviving Decepticons. During a mission in Shanghai, the Autobots intercepted two Decepticons, Demolisher and Sideways. They send in New recruits Sideswipe, Skids, Mudflap, Arcee, Chromia and Elita one to hunt down the Decepticons. Sideswipe manages to kill Sideways by slicing him in half. Demolisher is ambushed by Optimus Prime, who injures Demolisher. He tells Prime of the Fallen's return and Optimus kills him before he says anything else . National Security Adviser Theodore Galloway scolds the task force sarcastically for their tactics, reminding them that Megatron's corpse is still resting at the bottom of the Laurentian Abyss and the last known AllSpark shard is locked up in the NEST's headquarters. Simultaneously, Soundwave hacks into a U.S. military satellite, overhears the information, and sends Ravage to retrieve the shard.\nMeanwhile, Sam Witwicky prepares to attend college, leaving his girlfriend Mikaela Banes and guardian Bumblebee behind. While preparing, he discovers a smaller AllSpark shard in his jacket. He picks up the shard, which causes him to see Cybertronian symbols and unexpectedly brings kitchen appliances to life. After Bumblebee destroys the rampaging appliances, Sam gives the shard to Mikaela, who later captures Decepticon Wheelie when he tries to steal it. The Constructicons resurrect Megatron by using the shard retrieved by Ravage and brutally ripping apart the Constructicon Scrapmetal to provide parts for him. Megatron then travels to a moon of Saturn, where he reunites with his and Second in Command Starscream, and master, The Fallen, who orders him to capture Sam alive and kill Optimus, as Optimus is the last of the Primes and the only Transformer who can defeat The Fallen.\nA pretender Decepticon, Alice, tries to seduce Sam, until he gets rescued by Mikaela and his college roommate, Leo. They are then captured by the Decepticon Grindor and are brought to an abandoned factory. Megatron reveals that the symbols in Sam's mind will lead the Decepticons to a new Energon source before Optimus and Bumblebee arrives to rescue the trio. Optimus engages Megatron, Starscream, and Grindor; though Optimus injures Starscream by cutting his arm off and killing Grindor, Megatron ambushes Optimus and kills him by impaling him through the chest, destroying his spark. The other Autobots then arrive and repel the Decepticons, forcing Megatron and Starscream to retreat. Afterwards, the Decepticons launch an international assault on many areas around the world simultaneously. The Fallen hijacks Earth's telecommunications systems, demanding Sam to be turned over to him.\nSam, Mikaela, and Leo enlist the help of former Sector 7 agent, Seymour Simmons, who reveals that the Transformers visited Earth eons ago and the most ancient, known as Seekers, live in secret. With the help from Wheelie, they track down a Decepticon Seeker named Jetfire, who teleports the group to Egypt and tells them to find the Matrix of Leadership, which will revive Optimus. He and Wheelie turn against the Decepticons. Simmons contacts NEST, telling them to bring Optimus and the other Autobots to Egypt.\nSam's group finds the Matrix which is located in Petra, but it disintegrates into dust in Sam's hands. Undeterred, Sam stuffs the Matrix's remains in his sock. Meanwhile, NEST forces and the Autobots land near the Giza pyramid complex but are attacked by a large force of Decepticons. During the battle, the Constructicons combine to form Devastator, who destroys one of the pyramids, revealing the Sun Harvester inside, before he is killed by a railgun called in by Simmons. Lennox and Epps call in an airstrike, which kills a large portion of the Decepticon ground forces. However, Megatron manages to shoot Sam, seemingly killing him. Nearing his death, the Primes contact Sam through a vision, telling him the Matrix is earned, and that he earned the right to bear it. They restore Sam's life and the Matrix, which is used to revive Optimus.\nThe Fallen teleports to their location and steals the Matrix from Optimus, then returns to the pyramid with Megatron and activates the Sun Harvester. A wounded Jetfire sacrifices himself in order for Optimus to gain his parts, which give him immense strength and the ability to fly. Optimus knocks The Fallen and Megatron off the pyramid, destroying the Sun Harvester in the process. In the battle, Optimus injures and disables Megatron. Optimus then rips The Fallen's face off and crushes his spark out of his chest, killing him, while an injured Megatron watches in horror. Vowing vengeance, Megatron retreats with Starscream. The victorious Autobots and their allies return to the United States."}