{"mid": "Trance", "IMDB_id": "tt1924429", "title": "Trance", "plot": "Simon (McAvoy), an art auctioneer, becomes an accessory to the theft of a painting–Goya's Witches in the Air–from his own auction house. When a gang attacks during an auction, Simon follows the house emergency protocol by packaging the painting. The gang's leader Franck (Cassel) then takes the package from him at gunpoint. Simon attacks Franck, who delivers him a blow to the head that leaves him with amnesia. When Franck gets home, he discovers that the package contains only an empty frame. After ransacking Simon's apartment and trashing his car, the gang kidnaps and unsuccessfully tortures him. But he has no memory of where he has hidden the painting. Franck decides to hire a hypnotherapist to try to help him remember.\nFranck makes Simon choose a hypnotist from a directory, and he chooses a woman named Elizabeth Lamb (Dawson). As a first hypnotic exercise, Simon recalls where he put some car keys. Elizabeth exposes the gang's plan to have her hypnotize him, and demands partnership. In a next hypnotic episode, under gang supervision, Simon remembers that, shortly after the blow to his head, he awoke alone. On finding the stolen painting hidden in his suit, he left the art gallery. Distracted by a phone text message, while crossing the road, he was hit by a red car. The female driver tried to take him to hospital. Simon, in a kind of memory fugue, believed the woman was Elizabeth, recalling that she had made him forget her. The gang tries violently to force Simon to remember where he put the painting, and that ends the hypnotic episode. When asked by Elizabeth about how he met Franck, Simon confesses that he has a gambling problem. Franck helped him pay his debts in exchange for his help in stealing the painting.\nTo help Simon recover from the violence, Elizabeth stays overnight in his apartment. In the morning, Simon dreams of Elizabeth's having used a brain-scan behaviour-conditioning technique to erase an obsession that he had for her. Elizabeth tells Franck about that.\nFor the next step to recover the painting, Elizabeth tells Franck that she will sexually seduce Simon. Simon's feelings for Elizabeth recur, gently this time. At the same time, Franck and Elizabeth have unanticipated sex, and she steals his pistol from his bedside drawer. Nate, a gang member, sees them together and warns Simon, who confronts Elizabeth with it. She responds by touching his erotic mindspot, related to Goya's Nude Maja.\nRemembering where the painting is, Simon goes with Franck and his associates to reveal the location, but overhears their plan to kill him. He calls Elizabeth and tells her that the painting is in a red car in a certain car park, and unable to leave Franck's apartment, he returns and kills the gang members instead. After shooting Franck, Simon wakes up: this was all dream, and he still is in Elizabeth's apartment. Elizabeth takes the car keys and goes to get the painting, leaving Franck's pistol for Simon. While searching for Elizabeth, Simon finds Franck in her apartment. Nate and his associates intercept Elizabeth and bring her there. Franck takes Simon to get the painting, and as he kisses Elizabeth, she secretly passes three bullets into his mouth. On the elevator, Simon stops Franck with a fire extinguisher, and then with the pistol, now loaded with the three bullets. In the apartment, Nate prepares to rape Elizabeth. Heading back into the apartment, Simon shoots the three gang members. He takes the car keys from Elizabeth, and loads the pistol with the remaining three bullets. He takes Elizabeth to get the painting, and she tells him to let Franck come with them. With Franck driving, Simon leads them to a parking garage where the painting is.\nThey collect the red car and drive it to a safe warehouse. During the trip, Elizabeth reveals that Simon was previously a client of hers. He had a gambling addiction he wanted to fix. They started an affair, and she found his erotic mindspot. However, he became obsessed with her, and eventually abusive. Fearing for her life, she re-directed the hypnosis to make him forget her. This led him back into his gambling addiction, which as previously stated, caused him to go in debt and to try to pay it off by stealing a painting, with the help of Franck. Simon recalls that, after the heist, when he was hit by the red car and mistook the female driver for Elizabeth, he strangled her.\nAt the warehouse, in the car's trunk, Elizabeth finds the painting and the body of the female driver. Simon, having at last remembered his past and wanting to forget, douses the car in fuel with Franck zip-tied to the steering wheel, sets it on fire and tells Elizabeth to run away with the painting. She runs away but promptly returns driving a truck which she drives into Simon, pinning him against the other car, and ultimately sending Simon, and the car Franck is trapped in, into the river.\nFranck manages to escape, while it is implied that Simon is killed. The scene cuts to Franck swimming in his apartment while thinking of the event. He gets out of the pool and receives a package. He opens the package and finds an iPad that plays a video of Elizabeth talking about the painting, which is now hanging in her apartment. She reveals that when she hypnotized Simon to make him forget her, she also hypnotized him to go back into his gambling addiction and then try to steal a painting to pay off his debt. When this happened, he would instead give the painting over to Elizabeth. This explains why Simon took the painting away from Franck at the beginning and the text message he received before being hit by the car, which is revealed to be from Elizabeth telling Simon to deliver the painting to her. Elizabeth tells Franck that he can search for her and try to find her, but also gives him the option to forget the entire ordeal, and a button for an app called \"Trance\" appears as the video ends. Franck is shown debating whether to press the button just as the screen cuts to black."}