{"mid": "TrickOrTreat", "IMDB_id": "tt0045261", "title": "Trick or Treat", "plot": "The film opens with the song \"Trick or Treat for Halloween\", the lyrics of which tell the film's moral – one must be generous on Halloween or face trouble.\nOne Halloween night, Witch Hazel observes Huey, Duey, and Louie trick-or-treating. When the trio go to their uncle Donald Duck's house, Donald decides to prank the boys (giving them a \"trick\" instead of a treat). So instead of giving them candy, he intentionally puts firecrackers in their bags, then pulls a string that dumps a bucket of water on their heads. After Donald bids farewell to the boys, the discouraged nephews go and sit on the curb.\nBut Hazel, who was watching the drama unfold, approaches the boys and tries to encourage them. When she discovers that they believe in witches, she offers to help them get their treats from Donald after all. At first, she tries to convince Donald herself, but he skeptically retorts, pulls and releases her stretchy nose, and pranks her as well with a bucket of water, not believing she is a real witch. Realizing that the job may be harder than she anticipated, Hazel tells the boys she will use her magic for this situation. In another location, a scene paying homage to Shakespeare's Macbeth shows Hazel and the nephews concocting a magic potion, adding somewhat more whimsical ingredients than the Three Witches in Macbeth. After testing the potion, Hazel fills an insecticide duster (similar in appearance to a Flit gun) with the potion and returns to Donald's house with the nephews.\nUpon arriving back at Donald's house, Hazel sprays the potion at an assortment of objects, causing them to become animated or anthropomorphic. Donald, stunned at the magic being displayed before him, immediately gives in and agrees to treat his nephews, but when Hazel refers to him as a pushover, he changes his mind. Donald then locks his pantry and swallows the key. Hazel then uses the potion on Donald's feet to give her control of their maneuverability, and commands them to kick out the key, causing Donald to perform a crazy dance. But when the key is kicked out, Donald throws it under the pantry door. Hazel sprays Donald's feet again and orders them to smash the door down with Donald. This is initially unsuccessful, so Hazel commands him to take a longer start ('bout a MILE OR TWO!), and he literally runs that far before he breaks down the pantry door and is left unconscious on the floor in defeat.\nIn the end, Huey, Duey, and Louie collect their treats and Hazel departs. A final shot shows an enchanted Jack-o'-lantern suddenly pop onto the screen saying \"Boo!\" to the viewers before smiling."}