{"mid": "TrilogyOfTerrorII", "IMDB_id": "tt0117966", "title": "Trilogy of Terror II", "plot": "Story I: The Graveyard RatsA wealthy man by the name of Ansford (Matt Clark), discovers that his young wife Laura (Lysette Anthony) having an affair with her cousin. Having video proof he threatens Laura to be faithful and honest or he will turn the video over to the news stations and cut her out of his multi-million dollar will. Meanwhile, her lover Ben (Geraint Wyn Davies) comes up with the idea to murder Ansford and collect all his money. After Ansford is pushed down the stairs and killed, Laura and Ben are more than happy to collect their winnings, however all doesn't go as planned. Before dying, Ansford transferred all of his millions into an account in Zürich, Switzerland and microfilmed the access codes, which were buried with him. Now, Laura and Ben have to dig up his grave, and Ben climbs into the opened coffin to retrieve the microfilm. Soon after, Laura shoots and kills Ben to claim all the money for herself. All of a sudden, the body of the dead millionaire is dragged through a hole in the side of the coffin by flesh-eating rats, and Laura is forced to crawl in after him through a network of underground graveyard tunnels. Eventually the advancing rats corner her into another buried coffin. Laura tries to keep the rats away by firing her gun at them but quickly the rats pour into the coffin and devour her, in the end the grave is revealed to be her own.Story II: BobbyIt has been some time since Bobby \"accidentally\" drowned, leaving his mother Alma (Lysette Anthony) depressed and guilty. However, while her husband is away on business, she determines to raise her son from the dead. Armed with a magic book and a \"Key of Solomon\" (in this case, a talisman rather than a book), she conjures dark forces to bring her son back. Before going to bed, a vicious thunderstorm approaches the luxurious beach mansion. Hearing a knock, she opens the door to discover her son. After cleaning him up, she begins to make him feel at home again. However, all doesn't work out when Bobby goes completely mad and begins to terrorize his mother in the dark house with a sledgehammer and a butcher knife. The mother soon realizes that it isn't Bobby who returned to her, but a demon that had taken his place, as he says \"Bobby hates you, Mommy, so he sent me instead,\" revealing his demon-like face and the screen blacks out.Story III: He Who KillsThis segment, about the Zuni fetish doll \"He Who Kills\", is a sequel to the third segment of the original Trilogy of Terror, \"Amelia\".After finding the double homicide of Amelia and her mother from the first movie with the doll at the scene, the local police drop off the charred Zuni doll to local Dr. Simpson (Lysette Anthony). As she begins to examine the doll she learns that the doll comes to life when a gold chain is removed from his neck and that the doll has a desire for flesh. It also seems to regenerate (the idea itself initially laughable to both Dr. Simpson and her assistant) as when she chips away the charred wood, the doll seems to be brand new.After a quick pizza break, she discovers the doll missing. One of the officers investigates the surrounding museum, only to be shot down by an arrow from one of the exhibits, courtesy of the doll. After minutes of looking, she finds the doll attacking and running towards her with a lab knife as a weapon. Now, Dr. Simpson is all alone in a large museum with a tiny killer on the loose. Much like the first movie, Dr. Simpson catches the doll in a suitcase, giving her time to try to reach her keys. As the doll cuts through the case, Dr. Simpson tries twice to grab the knife, only to get cut as in the first film. The doll eventually breaks through, meeting the stabbing force of a screwdriver-like object from Dr. Simpson. Making the same mistake as the first movie's protagonist, Dr. Simpson opens the briefcase to be bitten ferociously by the doll. She eventually regains control, and tosses the doll into a large rectangular container of sulfuric acid. As the doll comes to a halt in its motion, Dr. Simpson goes to grab tongs in an attempt to remove the doll, only to be possessed by He Who Kills, the spirit inhabiting the doll.Later that night, the possessed Dr. Simpson kills her boyfriend with the same axe she tried to use against the doll."}