{"mid": "TristanAndIsolde", "IMDB_id": "tt0375154", "title": "Tristan + Isolde", "plot": "The film is set in Great Britain and Ireland, in the Dark Ages, after the fall of the Roman Empire in the 5th century. Lord Marke of Cornwall plans to unify the peoples of Britain – Celts, Angles, Saxons, and Jutes – under himself as high king to resist Irish domination.\nMost lords agree to this, as Marke is highly regarded and respected as a fair and courageous leader. The Irish king Donnchadh discovers this and sends troops to attack a Jutish castle where a treaty between the British tribes is being discussed. The raid claims the lives of the castle's lord and his wife, but Marke manages to save their son, Tristan, at the cost of losing a hand. Feeling compassion for the young boy, whose father loyally supported him, Marke welcomes Tristan into his home and regards him as a son.\nNine years later, Tristan has grown into a fierce, courageous warrior whose loyalty to Marke is not that of a knight to his lord, but rather a son to his father. Tristan and other Cornish warriors launch an attack on an Irish slave caravan. Tristan fights Morholt, the champion and leader of the army of Donnchadh, whose lord's daughter, Princess Isolde, has been promised to Morholt in marriage. Though Tristan kills Morholt and Donnchadh's forces are overrun, he is severely wounded in the fight and believed dead, though he is in fact only suffering the effects of Morholt's poisoned sword.\nTristan's body is put out to sea on a funeral boat which eventually washes up along the shores of Ireland. He is discovered by Isolde and her maid, Bragnae, who administer an antidote that revives him. Bragnae insists that Isolde conceal her identity so Isolde tells Tristan her name is Bragnae and that she is a lady-in-waiting. Tristan and Isolde fall in love as she nurses him back to health. The two lovers must separate after Tristan's boat is discovered. Tristan returns to Cornwall and receives a hero's welcome. A confused but overjoyed Marke welcomes him back with open arms.\nPlotting to defeat Britain, Donnchadh proposes a peace treaty, promising his daughter Isolde in marriage to the winner of a tournament. Tristan wins the tournament on behalf of Marke, unaware that \"the prize\" is the woman he fell in love with in Ireland. When he discovers the truth about Isolde, he is heartbroken to see her betrothed to Marke, but accepts it since the marriage will end \"a hundred years of bloodshed.\"\nMarke and Isolde are married and there is finally hope that Britain will be united. Marke is kind to Isolde and genuinely falls in love with her and although Isolde grows fond of him, her heart still belongs to Tristan. Isolde tells Tristan that she is his anytime he wants. Tristan is torn between his love for Isolde and his loyalty to Marke, a man whom he loves as a father. Marke is confused over what is tormenting Tristan and disappointed by the distance he is putting between them.\nTristan eventually gives in to Isolde; they renew their love and begin an affair behind Marke's back. The affair is discovered by Lord Wictred, a longstanding dissenter to Marke's leadership. He informs Donnchadh of the affair and they conspire to use their love to overthrow Marke, with Wictred getting Marke's throne in exchange. Marke confides in Tristan that he believes Isolde is having an affair. Tristan is tormented by the guilt and burns down the garden where he would meet Isolde. After Marke and Isolde's coronation, Tristan attempts to end their relationship, but Isolde begs him not to leave her. They are caught in an embrace by Marke, Donnchadh, and the other British kings. Donnchadh pretends to be furious that his daughter is being treated as a whore and ends the alliance. Seeing this as weakness on Marke's part, the other kings also decide to part ways with him.\nMarke is hurt and furious over his wife and son-figure's betrayal. He tells Tristan he has ruined everything and that he wishes that he had never saved his life. However, after Isolde explains their history, Marke relents. Tristan is taken to the river and Isolde tells him that Marke is letting them run away together. Tristan puts Isolde in the boat meant for their escape and tells her that if they leave they will be remembered for all time as those \"whose love brought down a kingdom.\" Tristan pushes the boat away from the shore and runs off to the ensuing battle.\nAt the same time, Marke's nephew and Tristan's old friend, Melot, resentful of his uncle's long favouring of Tristan, shows Wictred an old passage into the Roman foundations of Marke's castle. Wictred had made Melot believe that he will become king when Marke is defeated. Once they are in the passage, Wictred stabs Melot and sneaks his army into the castle. Marke and his forces swiftly become pinned down by Donnchadh's army outside the castle and Wictred's men within.\nTristan sneaks back into the castle via the secret tunnel, which he used to carry out his affair with Isolde. On the way, he finds the dying Melot; the old friends forgive one another before he dies. Tristan emerges from the tunnel and attacks Wictred's men, allowing Marke's soldiers to secure the castle, but he is mortally wounded in combat by Wictred, whom he still manages to kill. Now outnumbered, Tristan, Marke and the soldiers loyal to him emerge from the castle and present Wictred's severed head to Donnchadh. Marke urges the British kings standing with the Irish to aid them in making Britain a single, free nation. Inspired by his words, the British kings and their men attack Donnchadh and his army.\nAs a fierce battle between the British and Irish erupts, Marke carries a dying Tristan to the river, where they are met by Isolde. Marke leaves to lead the British to victory, while Tristan eventually dies in Isolde's arms after uttering his last words: \"You were right. I don't know if life is greater than death. But love was more than either.\" Isolde sees to his burial beneath the ashes of the Roman villa where they had met to be with each other. She plants two willows by the grave, which grow intertwined. She then disappears from history and is never seen again. Marke, it is said, defeated the Irish, united Britain, then ruled in peace until the end of his days."}