{"mid": "Trog", "IMDB_id": "tt0066492", "title": "Trog", "plot": "Set in contemporary England, the film follows Doctor Brockton (Joan Crawford) who learns that in the caves of the countryside, a troglodyte is alive and might be able to be helped and even domesticated. In the interest of science and the potential groundbreaking discovery of the missing link, she gets the creature to the surface. And while the rest of the townsfolk and police scatter in terror, Dr. Brockton stands steady with her tranquilizer gun and stuns the creature into submission. She brings it back to her lab for study, but runs into trouble as a few people oppose the presence of a monster in the town, especially a local businessman, Sam Murdock (Michael Gough), who is both afraid of negative commercial consequences and is suspicious of a woman heading a research facility. In the meantime, this creature, given the name of \"Trog\", is taught by Dr. Brockton to play and share; and the capacity for language is induced by a number of surgeries and a mysterious hypnotic device that causes Trog to see or relive the ice age.\nStill disturbed by Dr. Brockton's experiments, and enraged at a municipal court's decision to protect Trog, Sam Murdock releases Trog in the middle of the night in the hopes that Trog will be captured and killed. Murdock's plan works in part. After being released, Trog wanders into town and kills the first three people he meets (a grocer, a butcher, and a citizen in a car), but not before he clubs Murdock to death. Trog then snatches a little girl from a slide on a playground and retreats to his cave. By now Dr. Brockton and the army have gathered at the cave opening. After pleading fruitlessly with the police and army to let her reason with Trog and safely retrieve the little girl, Dr. Brockton takes matters into her own hands and charges down into the cave. She successfully finds the little girl cowering in a corner. Trog initially behaves aggressively at the sight of the Dr. in his cave, but after a stern reprimand and a plea, Trog surrenders the girl. Moments later, after a victorious ascent from the cave, all of Dr. Brockton's work in the service of science and truth are shattered as Trog is killed, pierced by a stalagmite in his cave after being felled by a barrage of army bullets. The movie ends as a reporter asks the doctor to comment on the death of the missing link. Dr. Brockton—a woman of great learning and science—finds no words for her disappointment, and she simply shoves the reporter's microphone away and walks into the horizon stricken with grief."}