{"mid": "Troll2", "IMDB_id": "tt0105643", "title": "Troll 2", "plot": "Michael has always dreamed of being a farmer, and arranges a home exchange vacation in which he and his family will move into a house in the rural farming community of Nilbog (which is \"goblin\" spelled backwards) for a month. The night before the family is scheduled to leave, Michael's son Joshua (Stephenson) is contacted by the ghost of his dead grandfather, Seth (Robert Ormsby), warning him that vegetarian goblins want to transform him and his family into plants so that they can eat them. Seth tells Joshua that goblins can turn people into plants by feeding them poisoned food or drink.\nMeanwhile, Joshua's sister, Holly (McFarland), receives a visit from her boyfriend Elliot (Wright). Holly accuses Elliot of being a homosexual since he seems to prefer spending time with his friends. Elliot promises to show his devotion by accompanying the family on vacation.\nThe next morning, Elliot fails to arrive and the family leaves without him; they encounter him en route to Nilbog, riding in an RV with his friends Arnold, Drew, and Brent. Outside of Nilbog, Seth appears as a hitchhiker, who warns Joshua that Nilbog is the kingdom of the goblins, and that if his family eats anything while they are there, they will be turned into plants. The family disbelieves Joshua's warnings and continue on to Nilbog. There, Joshua sets about destroying or contaminating all of the food the family finds or acquires.\nArnold goes for a walk outside of Nilbog and encounters a girl being chased by goblins. They flee to a chapel in the woods, where they encounter the goblins' queen, Druid Creedence Leonore Gielgud (Reed), who uses the \"Stonehenge Magic Stone\" to give the goblins power. Creedence tricks them into drinking a magic potion that dissolves the girl into vegetable matter and turns Arnold into a plant.\nJoshua sneaks away from home and eavesdrops on a goblin church sermon, which bewails the evils of eating meat. The parishioners capture him and attempt to force feed him poison ice cream; Michael walks in on the scene and becomes suspicious, taking Joshua home.\nAt the house, the family discover that the townspeople have prepared them a surprise party to apologize for the events at the church. Joshua attempts to make contact with Seth, only for Creedence to appear in goblin form. Seth's ghost appears and chops her hand off. Creedence returns to her chapel, where she transforms herself into a beautiful woman in revealing clothes; she then travels to Elliot's RV, where she seduces Brent and drowns him in popcorn.\nJoshua, Elliot, Holly, Michael and Diane hold a séance to communicate with Seth, who returns from the dead and tells them that he can retain a physical form for exactly ten minutes before he has to return to the afterlife. Seth gives Joshua a paper bag containing a \"secret weapon\" to use against the goblins. The goblins break into the house and transport Joshua to Creedence's chapel, where Joshua opens the bag, revealing a \"double-decker Bologna sandwich\". He eats the sandwich, making his body poisonous to the goblins; he then touches the Stonehenge Stone, which destroys Creedence.\nThe family returns home, where Joshua's mother is seen eating food from the refrigerator. The food, unknown to the family, has been poisoned by the family of goblins who took over their home during their exchange in the country. The film ends with Joshua walking in on a group of goblins eating his mother's green, bloated torso off of the kitchen counter and offering him a bite. Joshua screams in horror."}