{"mid": "TromasWar", "IMDB_id": "tt0096310", "title": "Troma's War", "plot": "After a commercial airline crashes on an uncharted island, the surviving passengers, a multi-cultural cross-section of the US population, notice armed uniformed people of various countries apparently looking for survivors. When one of passengers surrenders herself, she's brutally shot. It becomes evident that the island is a terrorist infiltration camp. When passenger Parker, a tough, slightly unstable Nam vet, manages to kill one of the attackers, he and the fellow passenger, everyman Taylor, lead the other survivors to a safe haven, only to have part of their number captured. Brought to a training base, the captured are forced to watch a neo-Nazi horrifically murder an air steward and a priest. The remaining passengers gather what weapons they can find and make a rough attempt at storming the camp in hopes of recovering their lost friends. At the camp, a musician's girlfriend is shot and killed by an obese terrorist wielding an AK-47 assault rifle. The bandleader, Sean, attacks and loses a fight with the Nazi, and the rocker's female bandmate is taken away to be attacked and raped by \"Señor Sida\" (Mr. AIDS), leader of the AIDS brigade who hope to begin an US AIDS epidemic.\nMeanwhile, an attractive African-American woman is taken to the brains of the operation, a pair of twins conjoined at the head. Parker and Taylor lead the remaining passengers in a surprise attack on the terrorists' hideout. Sida is dispatched by his victim via a crossbow bolt in the scrotum. Having been transformed by her experience, the African American lady hunts down the Twins and violently hacks them apart with a machete. She then goes after a terrorist who tried to have his way with her and stuffs a grenade in his mouth.\nRealizing the terrorists' are prepared to invade America, the remaining survivors are motivated to take steps in attacking the terrorists' main headquarters the next morning. Later that night, the formerly hostile Taylor and Lydia share an intimate moment. The men prepare to storm the camp but refuse to let the women go with them so they don't put their lives at risk. Hardwick, a depressed widower, volunteers to drive a truck full of explosives into a cargo boat hauling the terrorists into the US. Hardwick however is shot down, ruining their plan. The Americans do their best, eliminating mass numbers of the enemy. Running out of ammo the group awaits their last moments when the females ride in and help kill off the terrorists. A timid, morbidly obese passenger named Cooney musters his courage and decides to fill Hardwick's role. He fights his way through the terrorists blocking his way until he gets to the truck. Just as the boat is taking off, Cooney drives the truck off a ramp into the boat, destroying it. The unlikely heroes mourn the loss of Cooney, until he appears unharmed, having ditched the truck at the last minute."}