{"mid": "TroopBeverlyHills", "IMDB_id": "tt0098519", "title": "Troop Beverly Hills", "plot": "On the last day of school in 1989, Phyllis Nefler (Shelley Long) is a socialite Beverly Hills wife with a heart of gold recently separated from her husband, Freddy (Craig T. Nelson), a wealthy owner of an auto shop chain. Freddy feels Phyllis has become a self-absorbed \"shopaholic\" who never follows through on her commitments, and that she has drifted from the caring, imaginative personality that made him marry her. To prove him wrong, Phyllis decides to become the new den mother of their daughter, Hannah's (Jenny Lewis) unruly, leaderless local girl scout troop of Wilderness Girls.\nWhile Phyllis is boutique-hopping along Rodeo Drive, the council is reviewing her application, then approving it as they believe Phyllis has the makings of an excellent den leader. Although Phyllis severely lacks the skills found in most troop leaders, she resolves to teach the girls how to survive in \"the wilds of Beverly Hills,\" even customizing new merit badges for her troop. One campout results in the troop getting hit by a rain squall, which Phyllis and the girls flee to the Beverly Hills Hotel. Despite her unorthodox ways, Phyllis demonstrates an unwavering commitment to the girls' well-being and acts as a surrogate mother/friend to the girls, who are often neglected by their own wealthy and distracted parents. However, during an award ceremony on a yacht, her husband's new girlfriend gets knocked overboard and asks for a life saver and Phyllis responds which flavor. Fred remarks he was hoping to see Hannah learn a few outdoors and civil defense skills, such as first aid, and he is unsure about that under Phyllis' mentorship.\nPhyllis' unorthodox methods also run afoul of another scout leader, Velda Plendor (Betty Thomas), a mean-spirited, retired army nurse who helps advise the Culver City \"Red Feathers\" (of which her own daughter, Cleo (Dinah Lacey) is a member) to run like a military unit. Because Velda has considerable pull at the regional council level, she declares Phyllis' customized merit badges ineligible and sends her assistant troop leader, Annie Herman (Mary Gross), to infiltrate Troop Beverly Hills.\nMuch to Velda's dismay, Troop Beverly Hills, which is yet unrecognized by the regional council, can gain recognition by passing a series of tests at an upcoming Jamboree. However, in order to qualify for the Jamboree, and to show up Velda, the troop needs to sell cookies, 1,000 boxes. To prevent this from happening, Velda sabotages Troop Beverly Hills by selling cookies in their own neighborhood. Seeing this, as well as realizing Phyllis' true personality, Annie becomes Phyllis' assistant for real, offering her abilities to get the girls recognized merit badges. The parents of the girls, appreciative of Phyllis and Annie's leadership, offer to buy the cookies themselves in order to go to the jamboree, but Phyllis suggests another idea both to beat Velda at her own game and teach the girls salesmanship - a series of star-studded cookie sales in an untapped district. This proves fruitful, as the girls sell over 4,000 boxes of cookies, more than enough to qualify for the Jamboree.\nPhyllis is then hit with a one-two punch: even though Freddy has broken up with his new girlfriend, he wants to proceed with the divorce, including joint custody of Hannah; and Velda meanly tries to talk her out of attending the Jamboree, warning that it is in the backcountry \"is 20 miles from the nearest campsite, and 100 miles from the nearest 4-star hotel\". She sinks into a deep depression and finally decides to disband the troop, but Hannah and the other girls talk her out of it.\nDuring the Jamboree, the Red Feathers try to get ahead of Troop Beverly Hills by misdirecting them into a snake-infested swamp which causes the troop to lose vital radio contact with Annie, but a skunk scares Phyllis and the girls into running through a shortcut, making them first in the qualifying event. In the final run, Velda takes charge of the Red Feathers herself and cuts down a rope bridge, but this also fails. However, when Velda cheats a final time by going into a restricted area used only for hunting, she wounds herself on a bear trap. Velda's boot and sock are removed and it is confirmed that her ankle is broken. The Red Feathers, especially Cleo, leave her behind for the sake of winning. Troop Beverly Hills finds her, barefoot and bitter, and reluctantly carries her to the finish, but only after Phyllis reminds the girls that they have to be considerate to those in need, even if they are adversaries.\nThe Red Feathers cross the finish line first but are disqualified because council law stipulates the leader must be with the troop. Although Cleo runs off with the trophy, Troop Beverly Hills is declared the winners of the Jamboree and are validated as true Wilderness Girls. Francis Temple, the regional leader, fires Velda from the Wilderness Girls Organization for cheating on the trail and for putting the Troop Beverly Hills girls in potential danger. In turn Velda hurls insults at the councilwomen for recognizing Troop Beverly Hills. The girls' families show up moments later and are very proud of them. Freddy, impressed by Phyllis' complete turnaround, decides to call off the divorce, and he and Phyllis get back together.\nNext Year in Summer 1990, Troop Beverly Hills is seen as the new Poster Troop while Velda is shown with a very humiliating job at Kmart announcing a \"Blue Light Special\" on cookies in one of the aisles, a final fate she tried to threaten Annie with earlier."}