{"mid": "TrueConfession", "IMDB_id": "tt0029695", "title": "True Confession", "plot": "Helen Bartlett (Carole Lombard) is the wife of the honest lawyer Ken (Fred MacMurray). She is a \"writer\" but cannot think of anything to write and instead lives in her fantasy world of telling lies. When she discovers that they are broke, she attempts to get Ken to take a case of a man who stole hams. Ken, who is scrupulously honest and will not defend a client who is guilty, finds out that the man really did steal the hams, and therefore does not take the case. Helen is forced to get a job as a secretary for businessman Otto Krayler (John T. Murray), a family friend. On her first day in his sumptuous apartment/office, he attempts to seduce Helen, which causes Helen to quit the job. However, she discovers that she accidentally left her hat and coat behind. She returns with her friend Daisy McClure (Una Merkel) only to find that Otto Krayler has been killed and $12,000 of missing money is the supposed motive. Police lieutenant Darcey (Edgar Kennedy) suspects Helen and take her into custody. To further complicate her situation, Helen spins multiple possible accounts of the murder, discussing how she might have done it in each scenario, but finally says that she had nothing to do with it.\nKen represents Helen at the trial and believes that there is no way that the jury will believe that Helen did not commit the murder, and therefore has her plead self-defense. As the trial continues, an obnoxious man named Charles \"Charley\" Jasper (John Barrymore) believes that Helen did not murder Krayler, but he keeps it to himself.\nHelen wins the case and publishes a hugely successful novel of her life story. Having earned a fortune, Helen and Ken buy a lavish home on Lake Martha, but Ken expresses remorse that their fortune has come out of crime. Helen wonders if she should confess her innocence, but Ken states that perjury would be worse than the crime she had already committed. Meanwhile, Charles visits Helen and Ken with Krayler's wallet and attempts to blackmail them into saying that he (Charley) killed Krayler and having Helen perjure herself. Helen then tells Ken that she did not kill Krayler and has Charley confess that his brother-in-law was the real murderer. Ken leaves the house, distressed by Helen's lying, but Helen chases after him and lies once more by saying that she is pregnant. For a moment, Ken believes her, but then realizes that she is lying once again. He almost walks away, but realizing that this is what life is like with a congenital fantasist, he puts Helen over his shoulder and carries her into the house, the implication being that he is going to make her lie become true by getting her pregnant."}