{"mid": "Turbulence", "IMDB_id": "tt0120390", "title": "Turbulence", "plot": "After Ryan Weaver is arrested in New York City for a murder that he says he did not commit, he must be transported to Los Angeles to face trial. He and another prisoner (Stubbs) are escorted by four US marshals on a Boeing 747-200 on a commercial flight. Even though it is Christmas Eve, the 747 is nearly empty, with only 11 people on board. The entire cabin is highly decorated with Christmas trees and other decorations.\nDuring the 5 hour flight, Stubbs breaks free while using the bathroom and begins a shootout with the marshals, and at some point in the fight, a stray bullet fired from one of the Marshall's sidearms punches a hole in the fuselage, instantly triggering an explosive decompression. Amidst the chaos, the Captain is fatally shot, and the First Officer is also killed when his head slams into the yoke, disengaging the autopilot in the process and a stray bullet bores a hole in a lavatory window. Weaver frees himself and attempts to save the last remaining marshal, but fails when both Stubbs shoots the marshal dead, after being shot himself.\nWeaver appears to be horrified by the ordeal, increasing the passengers' trust in him. Because of the death of the pilots, Teri Halloran, a stewardess, makes her way into the cockpit and learns she is the only one left capable of keeping the 747 from crashing. To make matters worse, the plane is heading for a Category 6 storm.\nWeaver's behavior becomes increasingly erratic since he is paranoid of being sentenced to death upon landing and occasionally suffers nervous breakdowns. He then locks the passengers in the crew's cabin; and rapes and strangles Maggie, one of the other flight attendants, to death. He then calls LAX FBI control center that he threatens to crash the 747 into their facility since he is now on a suicide mission, and is wiling to do anything to avoid being arrested. His motives had become clear to Teri after she spoke, via the 747's radio, with the detective who arrested him.\nBeing the only hope for the 747's survival, Halloran must be instructed by radio how to land. After the plane barely survives extreme turbulence during the storm; Halloran's first attempt is unsuccessful, with the 747 skimming an office building's roof Japanese restaurant and a car park due to Weaver altering with the circuitry in the avionics bay. She then must turn the plane around and leave Los Angeles airspace. The LAX airport chief sends an U.S. Navy F-14 Tomcat Fighter jet to shoot down the 747.\nHalloran begs LAX not to have her shot down as a result of her failed first attempt caused by Weaver, and insists that she can land the plane. At this point, Weaver, completely drunk and crazy, breaks into the cockpit with an axe and tries to murder her. Halloran spies one of the marshals' guns, which she uses to fatally shoot Weaver. She returns to the pilot's seat and safely lands the aircraft. Despite the boasts of Weaver that he killed them all, the other crew and passengers are found alive."}