{"mid": "Turnabout", "IMDB_id": "tt1476425", "title": "Turnabout", "plot": "Tim and Sally Willows (John Hubbard and Carole Landis) are a spoiled well-off couple who constantly bicker and cannot agree on anything.\nTim Willows is considered to be the main cog in the machinery of his own advertising company Manning, Willows, and Claire. His wife Sally is his exact opposite, pampering herself in their home all day. And when Tim gets home, they start arguing, constantly watched by a strange Indian idol they got from a distant relative of Tim's. They call it Mr. Ram.\nAfter one extraodinarily stressful day at the office, Tim comes home to find Sally in the bath, and they start arguing like never before. In the heat of the moment, Tim expresses a wish to switch places with his lazy wife, to see how she goes about her days at nearly half speed. Sally also makes the same wish, seriously doubting the strain of running the advertising firm, having fun all day long. The Indian idol on the wall overhears their respective wishes and makes them come true, speaking loudly from its place on the wall.\nWhen the couple wake up the next morning they have indeed switched places and bodies with each other. Chaos ensues, as active Tim stays home with the servants and wives of his colleagues all day, in Sally's body, while she goes to work and manages to be rude to the firm's biggest client. Sally also succeeds in landing another client that Tim had denied business before.\nWhen the couple finally meet again in their home at night, they both beg on their bare knees to switch back into their regular bodies again. Their wish is granted this time too, and life goes back to normal. Tim has to clean up the mess Sally made at the firm, and she apologizes to all their friends. They blame everything on the fact that Sally is pregnant.\nWhen everything seems to be just fine and dandy again, Mr. Ram explains that he made a mistake when changing them back into their ordinary bodies, and as it now happens, Tim is the one who is pregnant."}