{"mid": "TwiceUponATime", "IMDB_id": "tt0086489", "title": "Twice Upon a Time", "plot": "In the eternally busy city of Din, the black-and-white Rushers constantly go about their business in a fast-paced way and stop only to sleep, due to their Cosmic Clock being wound too tightly. Din lies between two worlds that create dreams to deliver to the sleeping Rushers – one is the bright and cheerful Frivoli, where Greensleeves and his Figmen of Imagination bring sweet dreams; and the other is the Murkworks, a dark and dingy factory home to vultures who drop nightmare bombs. The evil Synonamess Botch, maniacal ruler of the Murkworks, wants to foil Greenie's efforts and subject the Rushers to non-stop waking nightmares. He uses his vultures to kidnap the Figs and Greensleeves, but not before Greensleeves writes an S.O.S. to Frivoli.\nMeanwhile, two misfits – known as Ralph, the All-Purpose Animal (named so for his somewhat unreliable shapeshifting abilities), and Mumford, a Chaplinesque mime – are put on trial for their incompetence at work. They are determined to prove themselves when they meet Flora Fauna, Greensleeves's niece, who found her uncle's S.O.S. and wants to rescue him. Botch spies on the three through Ibor, his robot gorilla, and uses Ralph and Mum's desire to be heroes to his advantage. Botch deceives the three, claiming to be a friend of Greenie and telling them that Greensleeves can be saved if they go into Din and take the main spring from the Cosmic Clock. Flora stays behind to act the part of the damsel in distress for Botch's nightmares.\nMumford and Ralph release the spring which causes time to freeze. They chase the spring throughout Din, but Botch's vultures steal the spring and begin planting nightmare bombs. A Fairy Godmother (FGM) twinkles in to tell Mum and Ralph that they have been tricked and gives them three dimes to make a phone booth appear in case they need her help. FGM also recruits the help of the dim-witted but musclebound Rod Rescueman to aid them. Rod is more interested in rescuing Fauna, however, and abandons the boys to find her.\nRalph and Mum find nightmare bombs scattered in an office, ready to be set off by Botch once time starts again. Mumford accidentally detonates a bomb and the two are trapped in a nightmare in which they are nearly killed by office supplies. When they are finally freed from the nightmare, the Fairy Godmother transports them back to Frivoli, suggests that they give up after all the mistakes they've made, and fires them from the hero business. This further strengthens Ralph and Mum's resolve to do right. Meanwhile, Rod \"rescues\" Flora from the Murkworks and attempts to get a kiss from her. She tries to escape from his floating apartment in the sky and falls, landing on a mechanical serpent that attempts to stop Ralph and Mum from reaching the Murkworks. The trio and Rod storm their way in with the help of Scuzzbopper, Botch's former nightmare screenwriter, who decides to aid them after Botch destroyed his recently completed novel.\nRod and Flora rescue Greenie and the Figs but have to contend with Ibor. Rod tries to save Flora again but fails, and Flora destroys the robot herself. At the same time, Botch has his head vulture Rudy fly the spring back to Din as the final phase of his plan. When Ralph, Mum, and Scuzzbopper enter Botch's office, he has his pet rat attack them but Scuzzbopper tricks it into chasing a bowling ball out a window. Botch retreats to a control room housing his master nightmare bomb button, \"The Big Red One\", with Ralph and Mum chasing after him. Ralph finally manages to control his shapeshifting to get through Botch's arsenal of booby traps and flies into the control room, while Mumford struggles through the traps and into the barrel of Botch's cannon. Ralph, in the form of a fly, tricks Botch into pressing The Big Red One, detonating every bomb before Rudy could put the spring back in the Cosmic Clock. An enraged Botch is about to kill Ralph for ruining his plans when one last nightmare bomb appears, about to blow. Terrified of being subjected to his own nightmare, Botch is knocked out the window. The bomb turns out to be Mumford, who had stretched his hat over himself and used a cigarette to simulate nightmare smoke. Ralph and Mumford consider themselves heroes, while Botch is saved and carried away by his vultures (who may harbor ill-will toward Botch for his insults and cruel demands).\nScuzzbopper, Flora, and Rod assume command of the Murkworks, with Flora giving a parting kiss to Ralph and Mumford for helping to save Greenie. As the two heroes leave, the Fairy Godmother congratulates them and allows them to keep their last dime as a symbol of good luck. The spring returns to the Cosmic Clock of its own will, and restarts the flow of time, but at a pace where the Rushers can enjoy their lives."}