{"mid": "TwilightsLastGleaming", "IMDB_id": "tt0076845", "title": "Twilight's Last Gleaming", "plot": "After escaping from a military prison, the rogue Air Force General Lawrence Dell and accomplices Powell, Garvas, and Hoxey infiltrate a Montana ICBM complex that Dell helped design. Their goal is to gain launch control over its nine Titan nuclear missiles. The infiltration does not go as planned, as the impulsive Hoxey guns down an Air Force guard for trying to answer a ringing phone. Dell then shoots and kills Hoxey. The three then make direct contact with the US government (avoiding any media attention) and make their demands: $10 million ransom, and that the President go on national television and make public the contents of a top-secret document.\nThe document, which is unknown to the current president but not to certain members of his cabinet, contains conclusive proof that the US government knew there was no realistic hope of winning the Vietnam War but continued fighting it for the sole purpose of demonstrating to the Soviet Union their unwavering commitment to defeating communism.\nMeanwhile, Dell and his two remaining men remove the security countermeasures to the launch control system and gain full launch capability over the complex.\nWhile the President and his Cabinet debate the practical, personal, and ethical aspects of agreeing to these demands, they also authorize the military to send an elite team led by General MacKenzie to penetrate the ICBM complex and incinerate its command center with a low-yield tactical nuclear device. Just as the device is about to be set, the commando team accidentally trips an alarm, alerting Dell to their operation. The furious Dell responds by initiating the launch sequence for all nine missiles. As the military and President Stevens watch the underground missile silo launch covers begin to open, they agree to call off the attempt and the launch is aborted with mere seconds to spare. During this time, the captive Air Force guards attempt to overpower Dell and his men, resulting in the death of Garvas and another guard.\nEventually, the President agrees to meet the demands, which include allowing himself to be taken hostage and used as a human shield while Dell and Powell make their escape from the complex. As the president leaves the White House, he asks the Secretary of Defense to release the document should he be killed in the process. US Air Force snipers take aim and shoot both Dell and Powell, but also accidentally shoot the President, who with his dying breath asks the Secretary of Defense if he will release the document. The Secretary cannot bring himself to answer."}