{"mid": "Twins", "IMDB_id": "tt0096320", "title": "Twins", "plot": "Julius Benedict and Vincent Benedict are fraternal twins, the result of a secret experiment carried out at a genetics laboratory to combine the DNA of six fathers to produce the perfect child. To the surprise of the scientists, the embryo split and twins were born. The mother, Mary Ann Benedict, was told that Julius died at birth, and not told about Vincent at all. Vincent was placed in an orphanage run by nuns in Los Angeles and believes his mother abandoned him. With no one but himself to rely on, Vincent escaped from the orphanage and became an indebted, small-time crook. Julius was raised on a South Pacific island by Professor Werner, where he engages in intense physical training and extensive study. Each twin is unaware of the other's existence.\nOn Julius's 35th birthday, Julius discovers he has a twin brother. With Professor Werner's blessing, Julius proceeds to the United States to find his brother. Julius discovers that Vincent lives in L.A. and eventually tracks him down in jail for unpaid parking tickets.\nJulius bails Vincent out, but Vincent does not believe his story and abandons him in a car park. Julius pursues Vincent to his workplace and finds him being beaten up by Morris Klane, a loan shark enforcer. Julius subdues Morris, earning Vincent's trust and respect. He later meets Vincent's girlfriend Linda Mason and enters a romantic relationship with her sister Marnie. Over dinner, Vincent shows Julius a document he stole from the orphanage that shows their mother is actually still alive, but believing that she abandoned him at birth, Vincent shows no interest in finding her. Julius tracks one of their six fathers to the address on the document. The father directs Julius to Mitchell Traven in New Mexico, the other professor who headed the experiment.\nVincent steals a late-model Cadillac Sedan de Ville for his chop shop contact and finds a prototype fuel injector in the trunk that was to be delivered to an industrialist, Beetroot McKinley, in Houston, for five million dollars. Vincent decides to pose as the delivery man and deliver the fuel injector himself so he can collect the money and pay off his debts. He reluctantly allows Julius, Linda and Marnie to accompany him to New Mexico to find professor Traven. Mr. Webster, the real delivery man, begins pursuing Vincent.\nIn New Mexico, Traven reveals the truth to the twins and directs them to Santa Fe, where their mother lives in an art colony. On the way to Santa Fe, the twins are accosted by the Klane brothers, but they fight them off for the last time. At the art colony in Santa Fe, a painter informs Julius and Vincent that their mother has died. They leave, unaware that the painter is in fact their mother, Mary Ann, who didn't believe their story.\nVincent bitterly heads to Houston alone to deliver the prototype to McKinley, leaving Julius and the girls behind in New Mexico for their safety. Julius chases after Vincent, and finds him seconds after the exchange with McKinley. Webster appears and kills McKinley, demanding the money from Vincent. Julius intercepts Webster in order for Vincent to escape, but Vincent returns and agrees to give Webster the money to save Julius. Webster decides to kill them anyway for seeing his face, but Vincent kills him by unloading a heavy chain onto his head and burying him. Julius and Vincent return both the prototype and $4 million (Vincent skimming $1 million), and use that along with the reward to start a consulting firm. Their publicity reaches the art colony and Mary Ann learns that her sons are alive. She violently confronts Traven for concealing the truth and tracks Julius and Vincent down to their workplace.\nSometime later, Julius and Vincent marry the Mason sisters. Both marriages produce twin children, and the couples are last seen meeting their mother and Professor Werner on an outing."}