{"mid": "TwoForTheRoad", "IMDB_id": "tt0062407", "title": "Two for the Road", "plot": "Now a successful and wealthy architect, Mark Wallace (Albert Finney) and his wife Joanna (Jo) Wallace (Audrey Hepburn) fly their white 1965 Mercedes 230SL roadster to Northern France in order to drive to Saint-Tropez to celebrate the completion of a building project for a client, Maurice. Tensions between the couple are evident, and as they journey south they both remember and discuss several past journeys along the same road.\nThe earliest memory is their first meeting on a ferry crossing in 1954, when Mark was travelling alone and Joanna was part of a girls' choir. They meet again when Joanna's choir bus goes off the road and Mark helps get them back on the road. When the other girls get chickenpox, Joanna and Mark unexpectedly wind up hitchhiking south together.\nThe next story involves the two newlyweds travelling with Mark's ex-girlfriend Cathy Manchester (Eleanor Bron), her husband (William Daniels) and daughter Ruth 'Ruthie' (Gabrielle Middleton) from the USA. Ruthie is not given any limits, and her behaviour frustrates Mark and Jo. Eventually Ruthie reveals the unkind descriptions of Joanna her parents have made in private. At this point Mark and Joanna decide to travel alone.\nOne scene depicts Mark and Joanna dining in a restaurant during a particularly strained period in their marriage. They are not speaking at all. Joanna looks around the restaurant and asks Mark, \"What kind of people can sit there without a word to say to each other?\" Mark replies, quite sullenly, \"Married people!\"\nNext the pair are seen driving an MG which begins to have exhaust troubles, finally catching on fire. On this journey Joanna announces that she is pregnant. They also meet the wealthy Maurice Dalbret (Claude Dauphin) and his wife Françoise (Nadia Gray). Maurice becomes a generous but demanding client for Mark.\nThe next story shows them travelling with their young daughter Caroline (Kathy Chelimsky).\nIn another episode, Mark is travelling alone and has a fling with another motorist. The fling is shown to be fleeting and unserious in nature. Later, Joanna has an affair with Françoise's brother David (Georges Descrières), which is portrayed as much more serious than Mark's and threatens to end the marriage. However, while Joanna dines with David, they witness a couple eating together without saying a word. David asks offhandedly, \"What kind of people can sit there without a word to say to each other?\" Joanna replies excitedly, \"Married people!\" and, realizing she misses Mark despite their faded passion, runs back to him.\nAt the end of the film, the Wallaces manage to end their long-term relationship to Maurice and find a new client in Rome. They honestly analyse the fears and insecurities which have plagued them throughout the film. Finally, they cross the border from France into Italy. This is new ground for them as well as for the audience, signalling a move beyond the old issues into a more mature future."}