{"mid": "TwoHands", "IMDB_id": "tt0145547", "title": "Two Hands", "plot": "Jimmy, while working at a strip club in Kings Cross, is approached by local mob boss Pando who says he has work for him. Pando gives Jimmy $10,000 to deliver to a woman in Bondi, and when she appears not to be home, he goes for a swim on the beach. Unfortunately the $10,000 is stolen by two street kids while he is swimming, leaving him heavily indebted to the furious Pando and his gang. The street kids, Pete (Evan Sheaves) and Helen (Mariel McClorey), go on a spending spree with their newfound wealth.\nThe car Jimmy was using on the job—a Ford Falcon belonging to Pando's associate Acko—is stolen by a young man and taken to a mechanic with the intention of selling it. The mechanic happens to be a friend of Acko's, who, displeased at the news of his car being stolen, suspects Jimmy's involvement. Acko arrives to recover the car but on the way there his car hits and kills street kid Pete. Helen watches in disbelief as Acko simply picks the dead boy's body off the street and dumps it in the gutter, concerned more about the damage to his car. He drives off leaving Helen alone, crying by her dead friend.\nJimmy comes up with a plan to pay off the debt by robbing a bank the next day in Bankstown, New South Wales along with two others. The night before he arranges to meet new friend and love interest Alex (Rose Byrne) at a pub. Unfortunately the meeting's arrangements are heard by Les, a friend jealous of Alex's attraction to Jimmy and keen to get in with Pando's gang. After Les informs the gang of the couple's whereabouts, Jimmy is forced to flee the pub with Alex, attempting to escape on the Sydney Monorail, however the escape proves unsuccessful and Jimmy is taken to a remote location where the gang plan to kill him. Through the indirect intervention of Jimmy's dead brother (who acts as a guardian angel figure throughout the film), Jimmy is able to escape and make his way back home to prepare for the bank robbery.\nThe robbery is not without its problems. When returning with the cash bags, one of the men attempts to jump over the bank counter, but fails and lands unconscious on the bank floor. He is dragged by Jimmy into the car, and comes round just as the police begin shooting and returns fire. The getaway driver is killed by the police but the robbery is on the whole successful. Jimmy gets the money he needs, escaping in a stolen Toyota Celica with his remaining accomplice. Ironically, the stolen auto's radio station bumper sticker is spotted by that station's competition team, who give chase attempting to award Jimmy a $10,000 prize. Not wanting to be identified after the robbery, Jimmy rams them off the road.\nJimmy returns to Pando's office to pay off his debt, but thinking he has a gun the gang once again attempt to kill him. He is able to give them the money, and is offered more work by Pando as a result. Jimmy leaves in disgust after pulling a gun on Pando. As Jimmy leaves, Helen the street kid passes Jimmy, and in retaliation for the death of her friend Pete she shoots Pando and his gang dead. The movie ends with Jimmy and Alex buying tickets at an airport to a location 'up north' away from the pressures of life in Sydney.\n=== Extended or alternative ending ===\nThe Australian DVD released film ends as described above and does not feature any other type of ending as an extra or outtake on the DVD. However the televised version of the film featured a longer ending. Immediately after the scene with Jimmy and Alex purchasing their air tickets, is a scene where Jimmy's brother Michael delivers a brief monologue completing the karmic message of the film. A beam of light shines down from the heavens and Michael attempts to run to the light, however he is grabbed by a series of hands which erupt from the ground and pull him back down into the earth that he escaped from in the opening introduction scene of the film."}