{"mid": "TwoLaneBlacktop", "IMDB_id": "tt0067893", "title": "Two-Lane Blacktop", "plot": "Two street racers, the Driver (Taylor) and the Mechanic (Wilson) live on the road in their highly modified, primer-gray, 1955 Chevrolet 150 two-door sedan drag car and drift from town to town, making their income by challenging local residents to impromptu drag races. As they drive east on Route 66 from Needles, California, they pick up the Girl (Bird), a female hitchhiker, in Flagstaff, Arizona when she gets into their car at a diner. Although the Driver develops a crush on the Girl, she sleeps with the Mechanic when the Driver goes out drinking one night. In New Mexico, they begin to encounter another car driver, GTO (Oates), on the highways. An atmosphere of hostility develops between the two parties. Although GTO is not an overt street racer, and, in fact, seems to know little about cars, a cross-country race to Washington, D.C. is suggested. The Driver proposes that the prize should be \"for pinks,\" or legal ownership of the loser's car. Along the way, GTO picks up various hitchhikers, including an importuning homosexual hitchhiker (Harry Dean Stanton). When GTO's inexperience becomes apparent, he, the Driver and the Mechanic form an uneasy alliance; the Driver even drives with him for a while when GTO gets fatigued.\nNeeding money, the Driver, the Mechanic and GTO compete at a race track in Memphis. While the Driver finishes his race, the Girl hops into GTO's car and they leave. The Driver pursues them to a diner located on US129 (today the location is known as the Tail of the Dragon) where the Girl has just rejected GTO's idea to visit Chicago. The Driver proposes going to Columbus, Ohio to get parts, but the Girl rejects him too. Instead, she leaves with a stranger on a motorcycle, abandoning her belongings in the parking lot. Later, GTO picks up two soldiers and tells them that he won his car by beating two men driving a custom-built 1955 Chevrolet 150 in a cross-country race. At an airstrip in East Tennessee, the Driver races against an El Camino."}