{"mid": "TwoThousandManiacs", "IMDB_id": "tt0058694", "title": "Two Thousand Maniacs!", "plot": "Six Yankee tourists whom make up two married couples, John and Bea Miller, David and Beverly Wells, plus an unmarried couple of Tom White and Terry Adams, are lured via detour signs placed in the road into the fictional small Southern town of Pleasant Valley by \"redneck\" citizens, to be the \"guests of honor\" for the April 1965 centennial celebration of the two days where Union troops destroyed the town at the end of the Civil War. The three couples meet the town mayor, Joseph Buckman, and his two right-hand men, Rufus and Lester, as well as shop owner Harper and his girlfriend Betsy. The tourists are initially treated with hospitality and given rooms to stay in the local hotel. However that afternoon, after an argument with her husband, Bea goes off with Harper to a wooded area for alone time where he shows off his pocket knife, but then slices off her right thumb. Harper takes Bea to Mayor Buckman's office where she is accousted by Rufus and Lester who hold her down on a table and dismember her alive with an axe.\nMeanwhile, Tom tries to explain to Terry about something strange going on with the town and attempts to contact for help on the outside, but cannot get through. He tries using a local payphone where he tells a friend where he is staying. But unknown to Tom, the person on the other line is Mayor Buckman.\nThat evening, Bea's dismembered limbs are roasted over a barbecue with the townspeople in attendance. Wondering away from the gathering, Tom and Terry discover a park plaque describing the \"blood centennial\" celebration in which they will be killed. While David and Beverly are taken back to the hotel, the drunken John is apprehended by the townspeople and made to participate in a \"horse race,\" which entails his body being ripped apart limb by limb by four different horses who are roped to his extremities.\nThe next day, the remaining tourists are forced to participate in various cruel games which led to their gory deaths. David is rolled downhill in a barrel embedded with nails. Beverly is lured to the town square where she is tied up and is crushed by a boulder held aloft in a contraption resembling a carnival-style dunk tank. After discovering the nefarious plans of the townspeople, Tom and Terry manage to escape from their hotel room with Harper in pursit. They run to a nearby swamp area where Harper falls into a quicksand pit and drowns.\nWith a little help from a little boy named Billy, whom Tom and Terry take with them as a hostage/guide, they manage to locate Terry's red car and drive out of town while being chased by Rufus, Lester and a horde of townsmen. After releasing Billy, Terry and Tom make it to the nearby main road and drive away. Later, Tom and Terry arrive at a local police station where they tell the disbeliving sheriff about their ordeal. Back in Pleasant Valley, Mayor Buckman orders his people to take down the centennial banner and declares the celebration over.\nTom and Terry return with the local policeman to Pleasant Valley, only discover that the town has disappeared. The policeman is skeptic to their story about the murderous townspeople, but comes to think there may be some truth in it for he tells Tom and Terry the story that 100 years ago as the Civil War was drawing to an end, a group of renegade Union troops attacked the small town of Pleasant Valley and, over two days, massacred the entire population of 2,000 people and burned the town to the ground. But there are local legends that the town's ghosts haunt the clearing and wooded areas where the town once stood. After leaving the area, Tom and Terry finally realize that the all of the townspeople of Pleasant Valley that they interacted with were ghosts who come back from the dead once every 100 years into their contemporary time to kill Northern people as a blood vengance for their deaths. The film ends with Tom and Terry driving away, while the vengeful spirits of Rufus and Lester watch them depart, along with Harper who emerges from the quicksand pit where he drowned. Rufus and Lester talk about looking forward to the next centennial in 2065, when Pleasant Valley will rise again to resume its vendetta against the Yankees and what technology they expect will be in store for them and the town when they emerge from their limbo state. Harper, Rufus and Lester walk into a nearby fog and disappear."}