{"mid": "Tyrannosaur", "IMDB_id": "tt1204340", "title": "Tyrannosaur", "plot": "One night, unemployed widower Joseph (Peter Mullan) drunkenly kicks his dog Bluey to death. He buries the dog and goes to the post office, where he mocks some Asian workers then throws a brick through the window when they tell him to leave. At the pub, Joseph attacks two young men playing pool one of whom threatened and mocked him. He then hides in a second-hand shop, where a religious and compassionate employee, Hannah (Olivia Colman), offers to pray for him. That night, Joseph goes to his home and meets up with his 6-year-old neighbor Samuel (Samuel Bottomley), who is forced to wait outside, while his Mother is inside with her nasty boyfriend. The boyfriend teases and berates Samuel and threatens to let loose his vicious dog on the young boy. After Samuel is allowed back in the house, Joseph is attacked by the men from the post office. The next morning, Joseph wakes up and goes to the shop, where Hannah looks after him. He begins to berate and insult her, before leaving.\nHannah returns home and falls asleep drunk, where her abusive husband James (Eddie Marsan) urinates on her. The next morning at the second-hand shop, Joseph apologises and slowly befriends Hannah. One day, she comes to the shop with a black eye and claims to have fallen in the bath. He asks her to come with him and pray for his best friend Jack (Robin Butler), who is dying of cancer. A few days later, Jack dies. A few days later, Joseph returns to the shop. James finds Hannah tying Joseph's tie as he tries on a suit for the funeral. James silently threatens Hannah and Joseph. Joseph realises that James is beating Hannah and confronts her about the beatings. She constantly denies it.\nOne night, Hannah gets drunk and James comes to take her home. He hits her and she begins to mock him. She tries to compose herself in the bedroom, when James arrives, beats and rapes her. Hannah tells Joseph that she is leaving James and asks to stay with him. He hesitatingly agrees, and in the course of her settling in, Joseph reveals that his heavy set wife has been dead for 5 years, due to complications from her diabetes. He also tells Hannah that he regrets using the nickname \"Tyrannosaur\" for his wife. He used it because it reminded Joseph of the scene in the movie \"Jurassic Park\" where the tyrannosaur could be heard stomping after the children in the film, much like how his wife sounded when she was walking on the second story of their house. After a few days, Joseph tells her that she is not safe with him and suggests she leave. Joseph escorts Hannah back to her house to retrieve some items, but she ends up running away, not ready to confront her husband. Hannah then goes with Joseph to Jack's wake where they sing and dance and tell tales in remembrance of Joseph's old friend. While Hannah is sleeping in the next room, Joseph decides to confront James, takes her keys and goes to her house, where he finds she had stabbed James to death, presumably after the rape. He confronts Hannah and admits that he knows about the murder. She breaks down and reveals that James mutilated her reproductive system with a glass bottle and that she just wanted to be a mother.\nA year later, it is revealed through a letter that Joseph wrote to Hannah, that Samuel was mauled by his Mother's boyfriend's dog. In retaliation, Joseph beheaded the dog with a machete for which he spent a few months in jail. He also discloses that he did not initially enter the second hand shop randomly, but on purpose because Joseph saw Hannah, wanted to meet her, and thought she was beautiful. He tells her after leaving jail, he quit drinking. The movie ends with Joseph walking down a path after visiting Hannah who is in prison herself for James' killing."}