{"mid": "UnChienAndalou", "IMDB_id": "tt0020530", "title": "Un chien andalou", "plot": "The film opens with a title card reading \"Once upon a time\". A middle-aged man (Luis Buñuel) sharpens his razor at his balcony door and tests the razor on his thumb. He then opens the door, and idly fingers the razor while gazing at the moon, about to be engulfed by a thin cloud, from his balcony. There is a cut to a close-up of a young woman (Simone Mareuil) being held by the man as she calmly stares straight ahead. Another cut occurs to the moon being overcome by the cloud, then a cut to a close up of a hand slitting the eye of an animal with the razor, and the vitreous humour spills out from it.\nThe subsequent title card reads \"eight years later\". A slim young man (Pierre Batcheff) bicycles down a calm urban street wearing what appears to be a nun's habit and a striped box with a strap around his neck. A cut occurs to the young woman from the first scene, who has been reading in a sparingly furnished upstairs apartment. She hears the young man approaching on his bicycle and casts aside the book she was reading (revealing a reproduction of Vermeer's The Lacemaker). She goes to the window and sees the young man lying on the curb, his bicycle on the ground. She emerges from the building and attempts to revive the young man.\nLater, the young woman assembles pieces of the young man's clothing on a bed in the upstairs room, and concentrates upon the clothing. The young man appears near the door. The young man and the young woman stare at his hand, which has a hole in the palm from which ants emerge. A slow transition occurs focusing on the armpit hair of the young woman as she lies on the beach and a sea urchin at a sandy location. There is a cut to an androgynous young woman, with bobbed hair and dressed in rather masculine attire, in the street below the apartment. She pokes at a severed human hand with her cane while surrounded by a large crowd and a policeman.\nThe crowd clears when the policeman places the hand in the box previously carried by the young man and gives it to the young woman. The androgynous young woman contemplates something happily while standing in the middle of the now busy street clutching the box. She is then run over by a car and a few bystanders gather around her. The young man and the young woman watch these events unfold from the apartment window. The young man seems to take sadistic pleasure in the androgynous young woman's danger and subsequent death, and as he gestures at the shocked young woman in the room with him, he leers at her and grasps her breasts.\nThe young woman resists him at first, but then allows him to touch her as he imagines her nude from the front and the rear. The young woman pushes him away as he drifts off and she attempts to escape by running to the other side of the room. The young man corners her as she reaches for a racquet in self-defense, but he suddenly picks up two ropes and drags two grand pianos containing dead and rotting donkeys, stone tablets containing the Ten Commandments, two pumpkins, and two rather bewildered priests (played by Jaime Miravilles and Salvador Dalí) who are attached by the ropes. As he is unable to pursue, the young woman escapes the room. The young man chases after her, but she traps his hand, which is infested with ants, in the door. She finds the young man in the next room, dressed in his nun's garb in the bed.\nThe subsequent title card reads \"around three in the morning\". The young man is roused from his rest by the sound of a door-buzzer ringing (represented visually by a martini shaker being shaken by a set of arms through two holes in a wall). The young woman goes to answer the door and does not return. Another young man, whom we see only from behind, dressed in lighter clothing, arrives in the apartment, gesturing angrily at him. The second young man forces the first one to throw away his nun's clothing and then makes him with his face to the wall, as if in disgrace.\nThe subsequent title card reads \"Sixteen years ago.\" We see the second young man's face for the first time (and discover that he is also played by Pierre Batcheff) as he admires the art supplies and books on the table near the wall and forces the first young man to hold two of the books as he stares at the wall. The first young man eventually shoots the second young man when the books abruptly turn into pistols. The second young man, now in a meadow, dies while swiping at the back of a nude female figure which suddenly disappears into thin air. A group of men come and carry his corpse away.\nThe young woman returns to the apartment and sees a death's-head moth. The first young man sneers at her as she retreats and wipes his mouth off his face with his hand. The young woman very nervously applies some lipstick in response. Subsequently, the first young man makes the young woman's armpit hair attach itself to where his mouth would be on his face through gestures. The young woman looks at the first young man with disgust, and leaves the apartment sticking her tongue out at him.\nAs she exits her apartment, the street is replaced by a coastal beach, where the young woman meets a third man with whom she walks arm in arm. He shows her the time on his watch and they walk near the rocks, where they find the remnants of the first young man's nun's clothing and the box. They seem to walk away clutching each other happily and make romantic gestures in a long tracking shot. However, the film abruptly cuts to the final shot with a title card reading \"In Spring,\" showing the couple buried in beach sand up to their elbows, motionless and perhaps dead."}