{"mid": "UncleBuck", "IMDB_id": "tt0098554", "title": "Uncle Buck", "plot": "Bob and Cindy Russell and their three kids, 15-year-old Tia, 8-year-old Miles, and 6-year-old Maizy, have recently moved from Indianapolis to the Chicago suburbs because of Bob's promotion. Late one night, they receive a phone call from Indianapolis informing them that Cindy's father has suffered a heart attack. They make plans to leave immediately to be with him. After hearing the news, Tia, bitter about having been forced to move, accuses Cindy of abandoning her father.\nBob suggests asking his brother, Buck, to come watch the children, to which Cindy objects. While they are middle class suburbanites, Buck is unemployed, lives in a small apartment in Chicago, drinks and smokes, and earns his living by betting on rigged horse races. He drives a dilapidated 1977 Mercury Marquis that pours smoke and backfires. His girlfriend, Chanice, owns an automobile tire shop. The couple have been together for eight years; Chanice wants to get married and start a family and Buck has grudgingly accepted a new job at her shop. Since no one else is available to help Bob and Cindy, they have no choice but to turn to Buck. Buck cheerfully informs Chanice that he can't start his job yet due to the family emergency. Chanice thinks Buck is trying, as usual, to lie his way out of working.\nUpon arriving, Buck quickly befriends Miles and Maizy, but the rebellious Tia is aloof, and the two engage in a battle of wills. When Buck meets Tia's obnoxious boyfriend, Bug, Buck warns her that Bug is only interested in her for sex. Buck repeatedly thwarts her plans to sneak away on dates with Bug. Over the next several days, he deals with a number of situations in comedic fashion, including taking the kids to his favorite bowling alley, making enormous pancakes for Miles' birthday, ejecting a drunken birthday clown from the property, speaking with the school assistant principal about Maizy, and handling the laundry when the washing machine doesn't work.\nEventually, Tia exacts revenge on Buck for meddling in her relationship with Bug by misleading Chanice to think he is cheating on her with their neighbor, Marcy; the two have an argument and Chanice leaves him. The following weekend, concerned after Tia sneaks out to a party, Buck decides to go looking for her rather than attend a horse race which would have provided him with enough money for the entire following year. He calls and begs Chanice to watch Miles and Maizy as he searches for Tia. At the party, thinking that Bug is taking advantage of her in a bedroom, he forces the door open by drilling out the lock, but walks in on Bug with another girl. He kidnaps Bug. After he finds Tia wandering the streets, she apologizes to him and acknowledges he was right about Bug. Buck lets Bug out of the trunk to apologize to her. When Bug is finally released, he threatens to sue him. Buck then strikes him with a golf ball, making him retract his apology and flee. At home, Tia helps Buck reconcile with Chanice by admitting her lie and tells her that he would be a good husband and father. Buck also agrees to start his job at the garage.\nBob and Cindy return from Indianapolis, Cindy's father having recovered. Upon entering the house, Tia surprises her mother with a hug. Buck and Chanice then leave for Chicago, with Buck and Tia exchanging a loving wave goodbye."}