{"mid": "UncleSam", "IMDB_id": "tt0118025", "title": "Uncle Sam", "plot": "In Kuwait, a military unit uncovers an American helicopter downed by friendly fire at least three years ago. As the wreckage is inspected, Master Sergeant Sam Harper, one of the burnt bodies within, springs to life and kills a sergeant and a major, and returns to an inert state after muttering, \"Don't be afraid, it's only friendly fire!\"\nWeeks later, Sam's body is delivered to his hometown of Twin Rivers, which is preparing for Independence Day. Sam's wife Louise is given custody of the casket containing Sam's remains, which are left in the home of Sam's estranged sister Sally, who lives with her patriotic young son, Jody. Sam reanimates in the early hours of the Fourth of July, and proceeds to kill and steal the costume of a perverted Uncle Sam. Sam then makes his way to a cemetery, where he murders two of three juvenile delinquents who had vandalized tombstones, and desecrated an American flag.\nDuring the Independence Day celebration (which a corrupt congressman is visiting) Sam beheads the third delinquent, kills Jody's teacher (who had opposed the Vietnam War) with a hatchet, and shoots Sally's unscrupulous lawyer boyfriend in the head. Despite these deaths, the festivities continue, but are thrown into disarray when Sam uses the fireworks gear to blow up the congressman, and a flagpole to impale Louise's deputy boyfriend. As this occurs, Jody is told by his mother and aunt that his supposedly heroic idol Sam was in fact an alcoholic psychopath who physically and sexually abused them, and only joined the military so he could get a \"free pass\" to kill people.\nJody is told by Barry, another boy who has established an unexplained mental link with Sam, that the undead Sam is responsible for the deaths. With help from Sam's old mentor Jed, the boys goes to Jody's house, where they find the lecherous sergeant who had dropped Sam off dead, and stuffed inside Sam's coffin. Realizing that Sam will probably go after Louise, the boys and Jed go to her home, where Sam blames Jed (who had told him tales of how glorious combat was) for his current state. Jed retorts by yelling, \"You never fought for your country! You just killed for the love of killing!\"\nJed's gun proves ineffective against Sam, so he and Louise go to get Jed's cannon while Jody (who Sam claims is the reason he came back) keeps Sam occupied. Jody lures Sam outside, and Jed blasts him with the cannon and destroys him in flames at Louise's house. The next day, Sally watches as Jody burns all of his war-themed toys."}