{"mid": "UnderSiege2DarkTerritory", "IMDB_id": "tt0114781", "title": "Under Siege 2: Dark Territory", "plot": "Casey Ryback has retired from the United States Navy and now owns and operates the Mile High Cafe, where he is also a chef, in Denver, Colorado. Casey is taking his estranged niece Sarah to Los Angeles to visit the grave of Sarah's father. Sarah and Casey board the Grand Continental, a train traveling from Denver to Los Angeles through the Rocky Mountains. Onboard the train, Sarah and Casey befriend a porter named Bobby Zachs.\nAs the train makes its approach to the Rocky Mountains, it is hijacked by armed mercenaries, led by former U.S. government computer hacker and computer genius Travis Dane with his right-hand man and mercenary leader Marcus Penn. Dane worked on Grazer One, a top-secret military satellite particle weapon designed to destroy underground targets. The military fired Dane due to his mental instability; Dane later faked his suicide.\nThe mercenaries take the train's passengers and staff hostage, herding them into the last two cars. Casey kills one mercenary, then slips away. Among the hostages are two former US Department of Defense colleagues who worked with Dane. Dane threatens them with torture unless they reveal the codes to take over Grazer. Despite giving up the codes, they are thrown from the train into a deep valley. During the course of events, Zachs becomes Casey's sidekick.\nMiddle Eastern terrorists have offered Dane $1 billion to destroy the Eastern seaboard by using Grazer to target a nuclear reactor located underneath the Pentagon. Dane demonstrates Grazer to investors by destroying a Chinese chemical weapons plant. After one investor offers an additional $100 million, Dane destroys an airliner carrying the investor's ex-wife.\nThe U.S. government has difficulty locating Dane or Grazer. When officials destroy what they think is Grazer, Dane explains the NSA's premier intelligence satellite was destroyed instead. As long as the train keeps moving, his location cannot be determined. However, Casey faxes a message to the owner of the Mile High Cafe, who contacts Admiral Bates. Bates reluctantly approves a stealth bomber strike to destroy the train.\nZachs discovers that they are on the wrong tracks and on a collision course with a Southern Pacific freight train hauling gasoline tank cars. Since the trains are in dark territory, it was impossible for the train dispatchers to communicate with the trains' engineers to stop the trains to avoid collision. Casey kills the mercenaries one by one and releases the hostages, but Dane uses his computer skills to locate the stealth bombers and re-targets Grazer to knock them out before they can complete their mission. Meanwhile, Penn had previously captured Sarah and uses her as bait for Casey. Casey confronts Penn and breaks his neck after a fight that spills into the kitchen.\nCasey finds Dane about to depart in a chopper hovering over the train. When Dane informs Casey that there is no way to stop Grazer from destroying Washington, Casey shoots him. The bullet destroys Dane's computer and injures Dane. Pentagon control of the satellite is restored and it is destroyed by remote control one second before it would have fired on the Pentagon.\nThe Grand Continental and freight train collide on a trestle. Casey races through the exploding train and grabs a rope ladder dangling from the chopper. Dane, who had survived Casey's bullet, also catches on to the ladder. He attempts to climb into the helicopter, but falls to his death into the explosion when Casey shuts the helicopter door on his hands, severing his fingers. The explosion causes the helicopter to spin out of control, but the pilot is able to regain control.\nCasey, having previously detached the last two cars from the rest of the train, informs the Pentagon that the passengers are safe. Later, Sarah and Casey pay their last respects at her father's grave."}