{"mid": "Undocumented", "IMDB_id": "tt1468381", "title": "Undocumented", "plot": "Filmmakers Travis, William, Liz, Davie, and Jim are filming a documentary on illegal Mexican immigrants. After interviewing several of Davie's family members and harassing an employer of illegal immigrants named Whitaker, the group accompanies a large group of immigrants including Davie's cousin Alberto and his wife and child, across the Mexican border into the U.S.\nOnce in the United States, the truck carrying the immigrants is stopped and taken by what seems to be the United States Border Patrol. The truck is instead taken to a facility where the filmmakers are interrogated and the immigrants taken captive. The group that has taken them is a radical patriot group that despises illegal immigrants, Mexicans in particular. The patriots, led by \"Z\", gives the filmmakers a proposition. Film the patriots and document what they do to captured illegal immigrants, and be let free, or die along with the immigrants. The leader of the patriots lets all of the children go, including Alberto's daughter.\nThe first part the filmmakers must film is the torture of an immigrant who smuggles drugs across the border into the U.S. Liz tries to intervene but the immigrant is beaten to death. The next morning, one of Z's henchman give the filmmakers a tour of the facility. When they are shown around the \"pens\" holding men and women, Alberto gets riled up and is sprayed by a high pressure hose. Alberto is then taken to a room where he is quizzed on several questions about America's government and history. If he gets a question wrong, Alberto's wife's joints are pulled into stress positions. When asked who said the quote \"Give me liberty or give me death,\" Alberto incorrectly answers Thomas Jefferson after given the answer by William, causing Alberto's wife and William to be killed.\nThe same night, the group tries to escape from the facility in the cover of darkness by using the cameras night vision mode. During the attempt, Travis knocks over a metal fence, causing Z's wife to check on the imprisoned immigrants, where the filmmakers are hiding. After a close call, the group escapes outside, where Alberto's daughter was killed by razor wire. Alberto's grieving alerts Z's henchman and a watchdog that mangles Jim's arm and leg. The filmmakers are then forced to record a conscious immigrants organ removal, when Jim passes out. When the filmmakers visit Jim, Liz gets into a confrontation with Z, leading to them being trapped back in their room.\nAfter trying to signal a truck that was unknowingly operated by one of Z's henchmen, Davie's aunt is killed, leading to Davie being beat to death after attacking a henchman. Travis is then forced to \"interview\" Whitaker and the coyote who led the immigrants into Mexico. Both are killed by Z. As a \"parting gift,\" Liz and Travis are branded with the radical group's symbol. Travis, who was given an injection before the branding, is forced to swing a baseball bat at a pinata that is unknowingly wrapped around Jim. Liz attempts to kill Z with the bat, but is sedated before she can strike him.\nThe two are now being kept indefinitely. When the henchman in charge of guarding Travis and Liz gets impatient, Travis beats him to death and steals his gun, shooting a second henchman in the leg. Travis and Liz release the immigrants and save Alberto. When they attempt to start an old truck, Z nearly kills Travis, but he is shot by Alberto before doing so. After escaping, it is shown that the three reached help, and state police raided the compound. Alberto is sent back to Mexico after nine months and anonymous tapes are sent to a media center in Arizona, showing Z with an even larger group."}