{"mid": "UniversalSoldierTheReturn", "IMDB_id": "tt0176269", "title": "Universal Soldier: The Return", "plot": "Seven years after the events in the first film, Luc Deveraux (Jean-Claude Van Damme), now an ordinary human after having had his cybernetic implants removed, is a technical expert who is working for the US government with his partner Maggie (Kiana Tom), who has been through countless hours of combat training with him, in order to refine and perfect the UniSol program in an effort to make a new, stronger breed of soldier that is more sophisticated and intelligent to reduce the use of normal, human soldiers in the battlefield. All of the new UniSols, which are faster and stronger than the original UniSols, are connected through an artificially intelligent computer system called S.E.T.H. (Self-Evolving Thought Helix).\nWhen S.E.T.H. discovers that the Universal Soldier program is scheduled to be shut down because of budget cuts, it takes action to protect itself. Killing those who try to shut off its power, and unleashing a platoon of super soldiers, led by the musclebound Romeo (Bill Goldberg), S.E.T.H. spares Devereaux, only because Devereaux has the secret code that is needed to deactivate a built-in program that will shut S.E.T.H. down in a matter of hours. With the help of Squid (Brent Hinkley), a rogue cyberpunk, S.E.T.H. is able to put its program in a UniSol which Squid made superior to any of the newer models (Michael Jai White). A team of four UniSols massacre the troops stationed outside the premises. Luc goes in later with a team of soldiers, but most of them are killed.\nNot only must Luc contend with ambitious reporter Erin Young (Heidi Schanz), who will not leave his side, but he must also contend with General Radford (Daniel von Bargen) who wants to take extreme measures to stop S.E.T.H.. S.E.T.H. has arranged Romeo to kidnap Luc's injured 13-year-old daughter Hillary (Karis Paige Bryant), killing Maggie in the process.\nHowever, Luc is the only person who can rescue Hillary, because Luc knows firsthand how a UniSol thinks, feels, and fights. Luc infiltrates the UniSol building, but finds Maggie, now revived as one of the UniSols. S.E.T.H is able to figure out the code itself, decides to kill Luc and raise Hillary as a daughter, who it has healed using UniSol technology. During the fight Luc covers S.E.T.H. in liquid nitrogen then shatters S.E.T.H.'s frozen body. Luc and Hillary leave the lab and head towards the exist, but find Romeo waiting for Luc. Luc then engages into a final fight with Romeo, which ends when Maggie finally rebels against the UniSols by shooting Romeo, and allows Luc and Hillary to get out of the building on time. However, the bomb that General Radford had placed was deactivated by S.E.T.H.. As Romeo and the platoon of UniSols start to march out for battle, Luc fires at the explosive charge blowing up the building, killing all the UniSols and their laboratory."}