{"mid": "UniversalSoldierDayOfReckoning", "IMDB_id": "tt1659343", "title": "Universal Soldier: Day of Reckoning", "plot": "John awakens from a coma to find that his wife and daughter were brutally murdered in a home invasion. With the help of FBI Agent Gorman, the still amnesiac John identifies the perpetrator as former Universal Soldier (UniSol) Luc Deveraux, now a wanted man. Gorman activates sleeper agent Magnus, one of the cloned Next Generation UniSols from Regeneration. Magnus reaches a brothel and kills all the women working there and most of the patrons, all men with exceptional physical resistance. His last adversary, a clone of UniSol Andrew Scott and Deveraux's former nemesis, negotiates Magnus and injects him with a serum that frees him from government control. Magnus is introduced to a separatist group led by Deveraux and Scott, who are taking in wayward UniSols to turn them against the government, thus establishing a new order ruled by UniSols.\nDetermined to find Deveraux, John receives a call from someone claiming to be his friend Isaac, urging the two to meet. At his house, he finds Isaac long dead and evidence of Isaac's involvement with the UniSol government program. A matchbox found on the scene leads John to a strip club. There, he is recognized and sent off by a stripper named Sarah, whom he cannot remember. Magnus injects John with Scott's serum, whereupon John hallucinates about Deveraux but retains his will. John follows Sarah to her apartment, where they are attacked by Magnus again. Though in the confrontation John loses some phalanges, they escape. Sarah tells John she remembers him working as a truck driver, living in a riverside cabin, and that the two were romantically involved.\nCalling his own memories into question, John requests a meeting with Agent Gorman. He learns Deveraux was often seen at the docks from where John used to take shipments. John goes to the docks, inspects the last unshipped cargo and meets with local manager Ron Castellano, who plays hidden camera footage that shows John brutally murder Isaac.\nAs John and Sarah drive towards the cabin, they are once more intercepted by Magnus, whom John finally dispatches. On that occasion, John realizes he possesses superior strength, resistance and fighting abilities; his severed fingers have regrown in the meantime. John and Sarah reach the cabin to find it inhabited by an exact duplicate of John, who reveals himself as the original who had killed Isaac and been in contact with Sarah and Castellano in the past. The original John had been mind-controlled into hunting down Deveraux, but was turned by him and hired as a transporter and assassin for his organization, until he met Sarah and deserted Deveraux. He tries to kill Sarah but is shot dead by the other John, now suspecting himself to be a UniSol sleeper agent.\nBy the river, a rogue UniSol takes John to the separatists' underground headquarters. There, he is greeted by Dr. Su, who reveals John had been synthetically created a few weeks earlier, therefore his family never existed. Dr. Su also says the missing shipment contains the hardware that will allow Deveraux to create clones. John accepts Su's offer to surgically sever his emotional bond with the fake memories of his family, but the pain and attachment to those memories drive John insane. He kills every UniSol in his path, culminating with Andrew Scott in a one-on-one confrontation. John then reaches Deveraux himself; in the ensuing fight, Deveraux eventually gains the upper hand. Realizing the cycle of sending clones of John against him is destined to repeat, and seeing John as a worthy successor, Deveraux allows John to kill him.\nLater, John meets with Agent Gorman again. Gorman admits to his involvement with the UniSol program and that he had purposefully put an unaware John on Deveraux's trail. Gorman ascribes John's success to his familial attachment, as opposed to the patriotism implanted in his predecessors. John kills Gorman, then a clone of Gorman and three UniSols emerge from John's van. The clone leaves in Gorman's car, hinting that John has acquired the cloning equipment and taken over the separatist group, now determined to infiltrate the government which he holds responsible for his pain."}