{"mid": "Unleashed", "IMDB_id": "tt0342258", "title": "Unleashed", "plot": "Bart (Bob Hoskins) is a vicious loan shark whose method of persuading men to pay him back involves Danny the Dog (Jet Li), a man with the mentality of a child and a dog. Danny is a violently skilled fighter who stops at nothing to take down his targets, but only when a metal collar around his neck is removed by Bart. Once the collar is on, Danny is a harmless, withdrawn person, with very little knowledge of how to live as a socialised person, and he is constantly bullied by Bart, whom Danny perceives as his master. Danny meets Sam (Morgan Freeman), a kind blind pianist, at the antique warehouse while dealing with Bart's clients.\nAfter the collar trick with Danny starts to fail, Bart realizes he can end his loan shark career by entering Danny as a fighter in underground fighting deathmatches. If Danny wins, Bart receives a hefty prize money. However, after the first fight, Bart is involved in a mishap with another criminal and is left for dead after being shot by a machine gun. A critically injured Danny returns to the antique warehouse for shelter, where he is found by Sam. Danny is out for two days and wakes up at the home of Sam and his stepdaughter Victoria (Kerry Condon), Danny starts to open up to them. He starts a new life with the benevolent family. The two teach Danny how to eat, read, speak, cook, go grocery shopping, and how to play the piano. Danny socializes with Victoria and Sam by hanging out with them in public areas and taking family photos. Danny drastically changes with new clothes, hairstyle, and fresh lifestyle. He finally learns to live without his collar after Victoria removes it. He is drawn closer to music while spending time with Victoria. He also develops curiosity about who his mother was after Victoria teaches him what it means to have a family.\nWeeks later Sam informs Danny about moving back to New York, where he and Victoria are originally from. He invites Danny, telling him they think of him as family, and Danny happily accepts. However, Danny runs into Bart’s right-hand man Lefty in the streets and is forced back to Bart after Lefty threatens him by hurting Sam and Victoria. Bart is still alive after recovering. Bart drags Danny back to the underground arena, where a death-match is set between Danny and ruthless martial artists. Despite Danny’s refusal to fight, Bart shoves him into the pit, where he is pummeled by four fighters while trying to defend himself. Danny eventually retaliates by pummeling the four fighters, but refuses to kill them. Enraged by Danny’s change of character, Bart kills the first fighter at gunpoint, drags him back home, and shuts him back in his cage. That night,, Danny sneaks through his door and goes through photographs of Bart’s favorite prostitutes, finally finding one snapshot of who appears to be Danny’s own mother. He interrogates Bart, who tells him that she was simply a prostitute who is long gone. He angrily promises to make Danny repay him for the money he had lost earlier that evening.\nNext morning, Danny manages to escape from Bart by flip-crashing the car and runs back to Sam and Victoria, telling them what he has learned and where he was. With the two's help, Danny figures out that his mother was a pianist who had financial problems. As Victoria plays the same music his mother played, Danny regains memories from his childhood past: his mother was a music student with no money, so she offered herself to Bart to get some to pay for her lessons. But one day, Bart showed up, she tried to hide Danny from Bart but Danny came out of hiding. She defied Bart and was killed. Bart has been raising Danny ever since, not as a human being, but as a dog. After regaining the memories, he and Victoria try to pack up when a confused Sam returns.\nBart and a large gang of thugs arrive at Sam's apartment building to capture Danny. Frantic, Danny hides Sam and Victoria in their closet, and he runs out to fight the thugs all over the building. He faces off against an attacker with skills similar to his own; Danny eventually causes him to fall to his death on Bart's car. An enraged Bart and his men pursue Danny through the building with guns, finally catching him in Sam's apartment. He threatens to pull the trigger, all the while telling him that he was never meant for a different kind of lifestyle. But he drops the gun and instead takes out a collar, telling Danny to come home. Danny slowly advances toward the collar, but stops Bart at the last minute and disarms him. He proceeds to furiously beat Bart, causing Sam and Victoria to burst out and frantically beg Danny not to kill; however, a defeated Bart orders Danny otherwise. Bart tells Danny he will always be an animal, to which Sam responds by smashing a flower pot on his head, knocking him unconscious. Sam, Danny, and Victoria embrace having calmed Danny's rage. Bart is arrested in the aftermath.\nSome time later, Danny is with Sam at a piano recital at Carnegie Hall, where Victoria is getting ready to perform. Realising Victoria is playing what his mother played years ago, Danny sheds a happy tear."}