{"mid": "UpsideDown", "IMDB_id": "tt1374992", "title": "Upside Down", "plot": "The film starts with Adam telling the story of his two-planet home world, unique from other planets or planetary systems as it is the only one that has \"dual gravity\". This phenomenon of dual gravity allows the two planets to orbit each other in what would otherwise be impossibly close proximity. There are three immutable laws of gravity for this two-planet system:\nAll matter is pulled by the gravity of the world that it comes from, and not the other.\nAn object's weight can be offset using matter from the opposite world (inverse matter).\nAfter a few hours of contact, matter in contact with inverse matter burns.\nThe societies of the two worlds are segregated by law. While the upper world (Up Top) is rich and prosperous, the lower (Down Below) is poor. Up Top buys cheap oil from Down Below and sells electricity back to Down Below at higher prices. A person from Down Below going Up Top (or having contact with anyone from Up Top) is strictly forbidden and can be punishable by incarceration or death. People from Up Top regularly visit Down Below to experience novelties like dancing on ceilings. The only physical connection linking the two worlds is the headquarters of the \"TransWorld\" company.\nAdam lives in an orphanage in Down, having lost his parents in an oil refinery explosion. The only living relative he has is his great-aunt, whom he visits every week. His great-aunt has a secret recipe for flying pancakes using pollen from pink bees which gather pollen from both worlds. The recipe has passed through generations and will be inherited by Adam.\nAs a child, Adam secretly climbs a mountain that gets very close to Up. There he meets Eden, a girl from Up. Years later in their teens, they are in a relationship. They meet on the mountains and Adam uses a rope to pull Eden towards Down, and they head to the woods for a stroll. They are later discovered, and while Adam frantically releases Eden back to her world, he catches a bullet in his arm and drops her. Helpless, he watches Eden lying motionless on the ground as blood oozes from her head. When he returns home, his aunt Becky is arrested and her home is put to the torch.\nTen years later, Adam is now working on creating an anti-gravity product using his great-aunt's recipe. The recipe allows matter to feel both gravitational fields at once. Adam is developing it as a cosmetic product for face-lifts. Then he sees Eden on TV and learns she is alive and works at TransWorld. He finally works out his formula and gets hired by TransWorld to develop the face-lift cream. Adam's plan is to find Eden in TransWorld. In his office he meets Bob, a TransWorld employee from Up who becomes his friend after he helps him obtain rare stamps from Down. Bob offers to help him contact Eden.\nWith the help of Bob, Adam meets Eden by putting Up-material in his clothes to disguise himself as a worker from Up, using Bob's name as his own. But Eden doesn't recognize him because of amnesia from the accident as a teen. The Up-material in Adam's clothes starts to burn so he has to return to Down. Later on, Bob is fired but as he leaves, he secretly gives Adam his ID to help him exit the TransWorld building and into Up. Later, by calling Eden through Bob's phone, Adam manages to get a date.\nMeanwhile, his cosmetic cream becomes of great importance to the company. While Adam is doing a presentation of the cream, Eden enters the lecture hall and discovers his true identity. After she flees the auditorium Adam runs to find her but Bob's ID, having been terminated, lands him in trouble. He escapes to Bob's house. He shows him that mixing liquids from both gravity fields can make a hybrid solution that resists both gravitational fields and simply floats between the two. Adam then reveals that he didn't give TransWorld the main secret ingredient of his compound, leaving the company unable to manufacture the product without him.\nWith Bob's help, he goes back to the restaurant where he met with Eden before and finds out she has begun to recover old memories of him. But the police arrive and he has to run. Upon returning to his planet he goes to the mountain top where he met Eden. Eden comes to find him and they meet again as they did long ago. But police are on their trail and, as they fail to escape, Eden is arrested while Adam falls the remaining distance between worlds. But he survives because of a vest containing inverse matter which he still had strapped to his torso. TransWorld agrees to drop the charges against Eden if Adam gives them his formula and never contacts Eden again.\nNow Adam has gone back to his old life, believing he will never see Eden again. But Eden, not so easily dissuaded, goes to Bob for help. Bob finds Adam and surprises him by showing he can stay Down without the help of the opposite-matter accoutrements; Bob has been able to use Adam's methods to create a way to negate the effect of gravity. Bob tells him he had purchased the patent of his beauty cream before TransWorld attempted to do so. He finishes by informing him that Adam also has a \"date\" with someone.\nThe film ends with Eden revealing she has become pregnant with twins, and the camera zooms far out to reveal towering skyscrapers on both sides, showing that both sides have become prosperous, as well as children from both sides interacting by playing basketball."}