{"mid": "UpUpAndAway", "IMDB_id": "tt0211174", "title": "Up, Up, and Away!", "plot": "Scott Marshall (Michael J. Pagan) comes from a family of superheroes. His father, Bronze Eagle (Robert Townsend), has the gift of flight. His mother, Warrior Woman (Alex Datcher), has the power of super strength and superior hand-to-hand combat skills. His brother, Silver Charge, is gifted with super speed, electrical and magnetism manipulation. His little sister, Molly (Arreale Davis), has both x-ray and heat vision. His grandfather, Steel Condor (Sherman Hemsley), has super strength, invulnerability and flight (though at his old age, he flies slower than cars), and has an ongoing feud with Superman. His grandmother, Doris (Joan Pringle), has the ability to morph. Unfortunately, Scott lacks powers and if none appear before his 14th birthday, he's normal for life. The Marshalls all share the same \"superhero weakness\", which is aluminum foil.\nAn activist group known as \"Earth Protectors\" have been giving out CDs about the environment to Scott's classmates. The programmer, Nina (Olivia Burnette), wants to use them to educate, but her partner, Malcolm (Kevin Connolly), has greedy plans for the program. When a bank robbery fails, he realizes the program only work on kids; he experiments, giving the kids chocolate cravings, making them all wear blue, etc. After Scott loses track of time due to being mesmerized by the CD, Jim gets suspicious about Earth Protectors; he takes Adam to the bank to search for the Earth Protectors program. Unfortunately, Adam overloads the computer, frying the system. Scott pretends to have super strength and flight powers, so as not to disappoint his parents; his grandfather learns the truth, deciding to support him. Malcolm decides to use Nina as a Damsel in Distress for a win-win plan; he'll capture the heroes in the way of his plans, or simply be rid of Nina. Ironically, this occurs on Scott's birthday; his parents and the guests decide to let Scott try saving her. However, both almost die until Jim saves them, having been told the truth by his father.\nScott loses his mask, which Malcolm matches to him; he visits Scott's school, using an improved CD to force him to reveal everything about his family. He then has a new CD given to Scott, telling the teacher that all the children's parents have to watch that night's lesson. Unfortunately, Scott accidentally switches CDs with a girl named Amy (Jamie Renée Smith); as result, her mother (Nancy Sorel) subconsciously robs a bank and goes to Earth Protectors' HQ. They use her as bait lure the heroes, and capture them with foil. Scott, along with Amy and his best friend, Randy (Chris Marquette), head to the warehouse to save his family from being brainwashed by Malcolm. They are helped by Nina, who has realized Malcolm's intentions; before they can alter the program, Malcolm's goons capture them. Less than a second remaining before his family is permanently reprogrammed, Scott smashes the main computer with a soccer ball.\nSilver Charge uses his powers to (literally) burn away their memories of the heroes' identities. Amy admits she likes Scott and asks him to a dance, but Adam erases her memories of everything that happened. Scott's parents decide to let Randy keep his memories as Scott needs a friend to talk to about his life. When it comes time to pick a soccer team captain, Amy and Scott pick the other, resulting in them being co-captains. Randy asks about heroes, learning that the Green Hornet was one of Scott's birthday guests."}