{"mid": "Vabank", "IMDB_id": "tt0083271", "title": "Vabank", "plot": "The film begins in 1943 at Camp Shelby, Mississippi, with newly commissioned Lt. Michael Grayson (Johnson) reporting for duty with the 442nd, then in training. He discovers that he has been sent to a unit composed of Nisei; he had expected to return to the U.S. 36th Infantry Division, a Texas National Guard unit with which he had served as an enlisted man. Having joined the war to fight against the Japanese, he is disturbed to find he is expected to fight alongside people whom he sees as Japanese, rather than Americans. From the outset, Grayson runs his platoon rather harshly, including an almost martinet-like insistence upon the strict observance of regulations.\nHe (and the audience) learn that \"Go for broke\" is a pidgin phrase (used in Hawaii) meaning to gamble everything, to \"shoot the works\"—to risk \"going broke\" or bankruptcy. Eventually Grayson also learns the meaning of the frequently repeated expletive Baka tare, which, loosely translated, means \"very stupid.\"\nThere is only brief mention of the internment camps from which most of the men have come, but throughout the film there are references to the camps. There are also a few brief references to the distinctions between the Nisei from Hawaii (\"Buta-heads\") and those from the mainland (\"Katonks\"). While Buta-heads (the phrase later devolved to \"Buddha-Heads\") were a key part of the Hawaiian economy and society, Katonks were largely distrusted and disliked by their neighbors.\nArriving in Italy, the unit is joined by the 100th Battalion, the Nisei unit formed in Hawaii before the 442nd was created on the mainland. The troops of the 100th are seasoned veterans and the new arrivals look to them for advice. On the march to the front lines, Grayson inadvertently gets left behind while fraternizing with a signorina, but when he catches up he finds that his platoon has covered for him during an inspection of their positions by the colonel.\nThrough fighting in Italy and France, Grayson eventually comes to respect the Nisei, and his bigotry fades. Eventually he is transferred back to his old unit, the 36th as a liaison—over his objections—when the 442nd is attached to the larger unit. As he has misjudged the Nisei, they have misjudged Grayson. They eventually learn that he has defended them against bigotry, even getting into a fistfight with an old friend of his from the 36th who had insulted them.\nThe climax of the movie comes with the \"Buddha-heads'\" famous rescue of the \"Lost Battalion\", after the 36th is surrounded by the German army. Then comes their return home, and the award of the eighth Presidential Unit Citation."}