{"mid": "ValleyGirl", "IMDB_id": "tt0086525", "title": "Valley Girl", "plot": "Julie Richman (Foreman) is a Valley girl who seems to have it all: good looks, popularity, and a handsome Valley dude boyfriend, Tommy (Bowen), but she is having second thoughts about her relationship with the arrogant and selfish Tommy. At the end of a shopping trip with her friends, Loryn (Daily), Stacey (Heidi Holicker), and Suzi (Meyrink), Julie runs into Tommy and breaks up with him. Later that day at the beach, Julie trades shy glances with a young man in the distance.\nThat night, at a party at Suzi's house, Julie locks eyes with Randy (Cage), a Hollywood punk who has crashed the party with his friend, Fred (Dye). They hit it off well, especially after Julie learns that Randy was the young man at the beach earlier. Tommy is jealous, and tries to bed Loryn. He fails and gets his cronies to eject Randy and Fred from the party. Undaunted, Randy sneaks back into the house, and hides in an upstairs bathroom shower. Randy waits in the shower for Julie to enter the bathroom as various partygoers come and go, talking about and trying to have sex, and doing drugs. When Julie eventually does enter, Randy convinces her to leave the party with him. Julie brings a very reluctant Stacey along for the ride with Randy and Fred. While at Randy's favorite Hollywood nightclub, Julie and Randy rapidly grow closer as Stacey continually rebuffs Fred's advances.\nJulie's friends, dismayed by her relationship with Randy, pressure her to drop him and get back together with Tommy. Julie asks her father (Frederic Forrest) for advice, and he kindly tells her that she should follow her heart. Despite this, Julie reconciles with Tommy and later dumps Randy. A heartbroken Randy gets severely drunk, makes out with his ex-girlfriend (Tina Theberge), and nearly gets into a fight with a gang of low riders before Fred saves him. Fred chides Randy for moping over Julie, but tells him that he needs to fight if he truly wants her back. After Randy flits about the Valley for the next few days just so he can get a glimpse at Julie, Fred says that he has a plan that will both reunite Randy with Julie and get revenge against Tommy.\nA subplot involves Suzi and her stepmother, Beth (Lee Purcell), vying for the attention of a boy named Skip (David Ensor). At her party, Suzi tells Beth, who is chaperoning, about Skip, who she likes and hopes will show up. When Skip does arrive, Beth finds herself attracted to him. Skip is also attracted to Beth and goes out of his way to go to see her without Suzi finding out. One day, Skip enters Suzi's house, apparently looking for Beth. He goes upstairs and finds a woman in the shower in Beth's bedroom. Skip and this woman, whose face is not shown, are then shown making love. Another woman arrives home and goes upstairs. The bedroom door opens, Beth enters, and only then it is shown that Suzi was in the shower and in bed with Skip. Skip and Suzi go to the prom together.\nAs the girls make prom decorations, Stacey and Loryn chat over their post-prom plans. Stacey reveals that Tommy made a reservation at the Valley Sheraton Hotel as an after-prom \"surprise\" for Julie.\nTommy and Julie ride to the prom in a rented stretch limousine; Randy and Fred arrive shortly after and sneak backstage. Randy becomes increasingly annoyed with just watching the Valley High kids dance, but Fred assures him that all is going according to plan. Julie and Tommy are escorted backstage, waiting to be introduced as king and queen of the prom. Randy confronts Tommy, and the two begin to brawl. When the prom king and queen are announced, the curtain pulls back to reveal Randy beating up Tommy. Randy knocks Tommy out, then escorts a thrilled Julie from the stage through the crowd. Tommy recovers and storms through the crowd towards Randy and Julie, who start a food fight to slow Tommy down and facilitate their escape from the venue in Tommy's rented limousine.\nAs the happy couple ride into the night towards the Valley Sheraton, Julie removes Tommy's I.D. bracelet, which had been a sign of the relationship between the two during the entire film, and throws it out the window. The scene, which echoes the final scene of the film The Graduate, pans to the overview of the Valley, while the limo turns past the Sherman Oaks Galleria glowing in the night."}