{"mid": "VampireInBrooklyn", "IMDB_id": "tt0114825", "title": "Vampire in Brooklyn", "plot": "A ship of dead men steers into Brooklyn harbor. It keeps going until\nit runs aground. A large wolf jumps from the ship. The wolf is the vampire\nMaximilian [Eddie Murphy], the sole survivor of the massacre of a tribe of vampires\nliving on an island in the Bermuda Triangle. Max has come to Brooklyn to\nfind Rita Veder [Angela Bassett], the half-vampire daughter born to a human and a vampire\nfrom his tribe.Meanwhile, Julius Jones [Kadeem Hardison] isn't having a good night. First, there was\nthat ship that ran aground and plowed right through the building where he\nand Silas Green [John Witherspoon] were working. Then his woman kicked him out of the house\nfor snoring while otherwise engaged. Now, two thugs are after him for his\nmoney or his blood. Then, just as Julius is about to meet his maker, the\nvampire Maximilian shows up, neatly kills off the two thugs, and informs\nJulius that he is to become his renfield and that the first thing he must\ndo is retrieve Max's coffin from the ship.Ship and dock are crawling with the law, one of whom is Detective\nRita Veder. Rita and her partner Justice [Allen Payne] have been sent to investigate the\naccident in the harbor and the 18 bodies aboard that were found drained of\nblood. While checking out the ship, Rita falls through a rotten floorboard\nand lands in the cargohold where she finds a coffin and gets a glimpse of\nMax, who recognizes her immediately. Rita chases him, but he disappears.\nWhen she returns to the cargohold, the coffin is gone, a human ear\nremaining in its place. Max and Julius take the coffin to Julius's house,\nan apartment he rents from Silas.The ship's log is retrieved, but it is written in some obscure\nlanguage that no one at the university can decipher, so it is sent to Dr\nZeko for translation. Zeko's turns out to be a nightclub, but Zeko [Zakes Mokae] is able\nto tell that the log speaks about a nosferatu on board. As Rita sits at a\ntable, waiting for Justice to return from a phone call, she doesn't notice\nthat a cobra in a nearby terrarium has escaped and is crawling toward her.\nFortunately, Max is seated nearby and catches the cobra just in time,\ngiving Max the perfect opportunity to introduce himself to Rita. He asks\nher to dance, believing that one dance with him will make her his, but\nJustice returns and Julius butts in with his jive talk, so Rita splits,\nnot at all enthralled with Max.Rita and Justice go back to the apartment Rita shares with roommate\nNikki [Simbi Khali]. Nikki comes on to Justice but he turns her down and leaves.\nInstead, Nikki picks up Max and brings him home. Rita overhears the\nbumping and screaming in Nikki's bedroom. The next morning, Rita finds\nthat Nikki has split with all her belongings, and there's a note saying\nthat she's getting an apartment with a man she just met. Rita assumes it\nis Justice, and she becomes very jealous.Time is growing short. Max has to start using drastic measures, like\ntaking on the personas of other people, such as Preacher Pauly and stupid\nGuido in order to get closer to Rita. But Max's plans seem to backfire, so\nhe takes the direct route and saves her from being run over by a speeding\ntaxi. In gratitude, Rita accepts a dinner date with him. Max hurries back\nto Julius's apartment and casts every spell he knows to change it from a\npigsty to an elegant lovenest, complete with candelabras, fireplace, and a\nbaby grand piano. He finally manages to get his dance with Rita as well as\na bite on her neck.Julius is enjoying the benefits of working for a vampire, e.g.,\ndriving the black limo with vanity plates that say 'RIP'. He is also\nhaving to adjust to the side-effects, e.g., acquiring a taste for bugs and\nlosing parts of his body. First his ear, then his right hand, then his\nhair, then an eye, then his whole right arm.Meanwhile, Justice is following up a lead that suggests Julius might\nhave been involved in the killing of the two thugs a few nights ago. The\nnext morning, Justice pays a visit to Julius's apartment where he meets\nSilas Green who tells him that Rita was there all night with the new\ntenant, some suave guy. Just then, Justice receives a call from the\ndispatcher sending him to investigate a DOA at Brooklyn City Hall. It\nturns out to be Nikki.Justice goes to Rita's apartment to tell her about Nikki. As he is\nholding her, Rita's tears turn into fangs and she tries to bite his neck.\nOut of the corner of her eye, she notices that her reflection in the\nmirror is fading. She runs to Max, who tells her of her father, the\nvampire. Justice goes to see Dr Zeko, who tells him the story of Rita's\nmother, a researcher who was studying the vampires on his island and who\nsuccumbed to the powers of the \"dark one.\" Rita is the result, he says. He\nwarns Justice that he must kill Max and do it before Rita loses all of her\nhumanity.Max attempts to teach Rita how to feed, but she refuses. When she\ntries to run away, Max retrieves her and brings her to his apartment,\nintending to leave for the island in the morning. He brings Silas to her,\nbut Justice and Zeko arrive just in time to stop her from feeding on him.\nA fight breaks out, of course, but Max is easily able to dodge their fists\nand stakes. Justice searches out Max's coffin and opens it, prepared to\nstake him, but he finds Rita laying there. Rita begins to advance on\nJustice, her fangs showing. She stops long enough to share a kiss with Max\nand then stakes him, claiming that this part of her must die. Rita and\nJustice end up in each others' arms.Epiloque: Max is dead, and Julius doesn't have much left in the way of limbs,\nskin, arms, etc., but Silas reminds him that he does have the limo, and\nthey decide to go for a ride. In the backseat, Julius finds a ring left\nbehind by Max and places it on his finger. POOF! Julius has back all his\nparts (and then some). There's a new vampire in Brooklyn, and his name is\nJulius Jones. [Original Synopsis by bj_kuehl.]"}