{"mid": "Vampyr", "IMDB_id": "tt0023649", "title": "Vampyr", "plot": "NOTE: Quotes indicate text titles from silent movie.\"This story is about the strange adventures of young Allan Gray [Julian West]. His studies of devil worship and vampire terror of earlier centuries have made him a dreamer, for whom the boundary between the real and the unreal has become him...One afternoon, during one of his aimless journeys, he arrived at a lonely inn close to the village of Courtempierre...\" where he takes a room. That evening, he hears a strange chanting, goes exploring and sees a man with a horribly misshapen face. \"In the moonstruck night light and shadow, voices and faces, seemed to take on hidden meaning. Allan Gray felt the darkness take control. In vain he tried to protect himself from unspeakable terror. Fear of the intangible followed him into a restless sleep.\" Allan is awakened by a noise at his chamber door. A man enters, says only \"She must not die...do you hear?' and gives Allan a package on which is written \"To be opened after my death.\"\"What was going on? Which horrifying secret was revealing itself? One thing became clear to Allan Gray. A human soul in fear of Death cried for help--and an inner voice ordered him to follow its call.\" Again, Allan goes snooping. He finds shadows--the shadow of a man UNdigging a hole, the shadow of a man with a wooden leg, shadow dancers. He hears barking dogs and a child wailing. The village Doctor [Jan Heironimko] appears and asks Allan: \"Did you hear it? There are no children or dogs here.\" Allan leaves, and the man is joined by an old woman who gives him a bottle of poison.\"(Allan) followed the shadows and entered a park. Among the ancient trees a chateau raised its towers into the haze of summer night. The man, whom Allan Gray had seen that same night at the inn, lived here in seclusion--with only his two daughters and a few servants.\" The daughters (Gisèlle [Rena Handel] and Léone [Sybille Schmitz]) appear to be ill. The family awaits the arrival of the village Doctor. Gisèlle lies in her bed and cries out, \"The blood! The blood!\". The old man, lord of the manor [Maurice Schutz], is killed by the gun-carrying shadow. Allan is asked to stay with the family while a servant goes for the police.While he waits, Allan opens the mysterious package to find a book entitled \"The History of Vampires\" by Paul Bonnard. He reads \"...about horrendous demons called vampires. At full moon the Dead, not at peace because of terrible deeds they did while living, rise from their coffins--to suck the blood of children and young people--and prolong their own life in the land of the shadows. The Prince of Darkness is their companion, and...at night, creatures of the Abyss visit homes of the living to sow Death and Despair. Whoever falls into the hands of a vampire withers away hopelessly...a wound on the throat, as by a bite of a rat or a cat, is the mark of Damnation. Neither Doctors nor...\"As Allan reads, Léone looks out the window to see Giselle wandering across the yard. Allan and Leone find her lifeless body and see an old woman walking away. While servants tend to the girl, Allan continues to read about vampires \"...to grow accustomed to their miserable fate--which, besides pain in the body, brings untold agony to the Soul. Therefore, like an epidemic, a vampire's craving for blood is carried over to the victim, who himself becomes a vampire and goes searching for more victims among his dear ones. Whole families, yes, whole villages, in this way have been sucked into the curse...Shadows of executed criminals are their helpers. Living people may also be forced to do their dreadful bidding. A tale from Hungary tells how a village Doctor, having sold his soul to The Evil One became the helper of a vampire--and was accomplice to a series of horrid crimes in that parish. Here, vampires...\"The Doctor arrives and determines that Gisèlle needs blood. While Allan donates blood for a transfusion, the manservant reads from the book. \"The vampire, who had obtained complete power over its victim, tries in every possible way to drive it to suicide; for the one who takes his own life is lost for all eternity. For him, the golden gates of Heaven are closed--all hope is gone! Oh, you Devilish...the riddle of life? Who can penetrate the secrets hidden from the light of Day? Just as strange as the life of the vampires is the manner of breaking their might. These monsters, who cannot find peace, must be murdered so that persecuted Mankind may be freed from its nightmare. Many monasteries and libraries have, in their secret...how sometimes vampires have been made harmless. In the village of Kisiloba, which was haunted by a vampire in the body of an old woman, they went about it as follows. At dawn the grave was opened; they found the old one lying down, as if asleep. They drove a metal bar into her heart--and nailed her detestable soul to the crypt. She now died a true Death, and the crime, that rested over...Certain places were beset by vampires. Many years ago there was a foul epidemic in the village of Courtempierre--claiming eleven victims. Doctors gave the sickness a scientific name. Yet among men a rumour spread that a vampire was playing its game. People believed this vampire was one Marguerite Chopin [Henriette Gerard], buried in the village churchyard. All her life, Marguerite Chopin was a monster in a human body. She died without remorse, and at the hour of Death the Church refused her...\"As Allan rests from his blood donation, a voice in the background is heard saying \"Come with me. We will be one soul...one body...death is waiting.\" The manservant awakens Allan just in time for them to stop Gisèlle from taking the poison left at her bedside by the Doctor. Gisèlle must not die till sunrise. The Doctor escapes, but Allan follows. Allan's shadow separates from his body. He goes to the Doctor's house where he finds his own body in a coffin, and the body of Léone tied to a bed. As Allan's shadow watches, the Doctor and his wooden-legged helper nail shut the coffin. Is this actually happening, is it a memory or perhaps a dream induced by Allan's lack of blood?Now Allan watches the manservant digging up a grave, and he goes over to help. Is it his own grave? Will he find his own body? They open the grave to find the old woman's body. As the morning sun rises, the manservant drives a stake through Marquerite Chopin's body. Gisèlle sits up in bed. \"I feel strong,\" she says. \"My soul is free.\" The man with the wooden leg falls down the stairs and is killed. The Doctor becomes entrapped and buried in a grain elevator. Allan unties Léone and they go home together. [Original synopsis by bj_kuehl]"}