{"mid": "VanHelsing", "IMDB_id": "tt0338526", "title": "Van Helsing", "plot": "Gabriel Van Helsing (Hugh Jackman) has been ordered by the Vatican to search out and\ndestroy Count Vladislaus Dracula (Richard Roxburgh), an assignment that doesn't make Van\nHelsing very happy. He is tired of killing monsters for the Church, only\nto be branded by the public as a murderer with a price on his head. He\nalso wishes that he had back his memories, something that was taken away\nfrom him due to his previous sins. Cardinal Jinette (Alun Armstrong) explains that this\nassignment is important because, 450 years ago, a Transylvanian knight\nnamed Valerius the Elder promised God that his family would never rest nor\nenter heaven until they vanquished Dracula. However, Dracula still lives,\nbut only two of Valerius' descendents -- Princess Anna (Kate Beckinsale) and Prince Velkan (Will Kemp)\n-- remain. The Valerius family is running out of time, and the Church is\ncommitted to saving their souls. So, armed with only a scrap of a picture,\nrings of garlic, holy water, a silver stake, a crucifix, an automatic\ncrossbow, and Friar Carl (David Wenham), the Q of the Vatican, Van Helsing takes off for\nTransylvania.Van Helsing's arrival in Transylvania is not well met, as\nTransylvanians don't like strangers. As Princess Anna challenges their\nbusiness there, Van Helsing notices three harpies flying towards them.\nThey are Dracula's three brides -- Aleera (Elena Anaya), Marishka (Josie Maran), and Verona (Silvia Colloca). It's\nobvious that they are trying to nab Anna. In fact, they succeed in\ncarrying her off several times, but Van Helsing manages to get her back.\nHe finally destroys Marishka by dipping his crossbow in holy water before\nshooting her with a dart. Oddly, the villagers are angry with Van Helsing\nfor killing Marishka. They explain that the vampires only kill one or two\na month to satisfy their needs. Now, thanks to him, they will kill more\nout of revenge.Dracula isn't happy about it either. Not only is he now short one\nbride, but a year ago, after setting up Victor Frankenstein (Samuel West) with his own\nlaboratory, the villagers set Frankenstein's monster on fire, and Dracula\nneeded the Monster in order to give life to his offspring (Dracula's\nchildren are born dead and must be animated). Then, just a few days ago,\nVelkan Valerius destroyed Dracula's werewolf with a silver bullet,\nalthough it cost Velkan his life when the werewolf grabbed him just before\nhe fell over a steep cliff.Grateful that Van Helsing saved her life and destroyed Marishka, Anna\ntakes Van Helsing and Carl back to the castle where the Valerius family\nhas lived for hundreds of years following Dracula's human death. That\nevening, Anna wants to go out vampire hunting, but Van Helsing, preferring\nto wait until daylight, sprays her with knockout spray. When Anna later\nawakens, the halls are dark and Van Helsing is nowhere to be found. Still,\nsomeone is there. It's a werewolf, but not just any werewolf. It's her\nbrother, Velkan. Apparently, Velkan was bitten by the werewolf on the way\ndown, survived the fall, and now he is a werewolf, too. When the moon\nsuddenly goes behind a cloud, Velkan changes from werewolf back to himself\njust long enough to warn Anna. Then the moon comes out, and he changes\nback into a werewolf and lunges at her. Van Helsing appears and fires a\nshot at Velkan, but he leaps out the window. Van Helsing follows. Just\nwhen Van Helsing gets a clear shot at Velkan, Anna stops him to let him\nknow that Dracula supposedly has a cure for werewolfism. Van Helsing\nagrees to help Anna look for the antidote and try to save her brother.Velkan's trail leads them to Castle Frankenstein where Dracula, Igor (Kevin J. O'Connor),\nand the Dwergi [ugly little creatures that work for Dracula] have strapped\nVelkan to Dr Frankenstein's machine and are trying to harness his life\nenergy to animate Dracula's babies. Lightning strikes and Velkan's\nlifeforce flows into the baby vampires who start to hatch. Thousands of\nthem. Van Helsing starts shooting at them. Dracula gets really mad and\nstarts attacking Van Helsing. Van Helsing stabs Dracula with the silver\nstake, but it doesn't work. (The stake needs to be made of wood.) Aleera,\nVerona, and the babies fly into the village so that the brides can teach\nthe babies how to feed. Suddenly, all the vampire babies start to explode.\nThe animation hasn't been successful.Dracula orders Velkan to kill Van Helsing and Anna. In their escape\nfrom Castle Frankenstein, Anna and Van Helsing fall into a subterranean\ncave where the Frankenstein monster (Shuler Hensley) has been hiding. Van Helsing shoots\nhim with a tranquilizer dart but refuses to kill him because he can sense\nthat the Monster is not evil (Van Helsing will only kill evil beings).\nBefore he passes out, the Monster explains that he is the key to Dracula's\nresearch, that he is the one thing that Dracula needs in order to bring\nlife to his brood. Even though the last hatchlings died, Dracula has\nthousands more waiting birth, he says.Suddenly, they notice that they are being watched by Velkan. Knowing\nthat Dracula will soon know their whereabouts, Van Helsing tries to take\nthe Frankenstein monster back to Rome for protection, but they are\nattacked by Verona, Aleera, and Velkan. Van Helsing destroys Verona and\ngets a silver bullet into Velkan, who later dies in Anna's arms.\nUnfortunately, Velkan also managed to bite Van Helsing. Aleera picks up\nAnna and flies her back to Dracula while Van Helsing, Carl, and the\nMonster are forced to walk. They meet up with Aleera again in Budapest.\nShe invites them to a Halloween masquerade ball during which they can\ntrade the Monster for Anna. Van Helsing tranquilizes the Monster and locks\nhim in a church while he and Carl go to the ball.At the ball, while Dracula dances with Anna, he tries to talk her\ninto becoming his bride, but Anna will have none of it. Van Helsing\nrescues Anna, but their escape is thwarted when Igor triumphantly brings\nin the Frankenstein monster. Everyone at the ball turns into vampires and\ngoes after Van Helsing, Carl, and Anna, forcing them to jump out a window.\nBy the time Van Helsing, Anna, and Carl get back to Transylvania, Dracula\nhas cleared out of Castle Frankenstein and moved...to no one knows where.\nThey go to the library where Carl has done a bit of research and\ndiscovered that Dracula is really the son of Valerius the Elder. The whole\nproblem started when Dracula was murdered in 1462 by \"the left hand of\nGod.\" When he died, Dracula made a covenant with the Devil and was given a\nnew life that could only be sustained by drinking blood. That's when\nValerius the Elder went to Rome and bargained away his family's right to\nenter heaven until he killed Dracula. Dracula being his son, however,\nValerius was unable to kill him, so he banished him to an icy fortress\nthrough a door with no means of escape...until the devil gave wings to\nDracula. So where is this door?Anna reveals that her father spent hours staring at a particular\npicture. Perhaps that picture holds the key to the door? On the door is an\ninscription in Latin which Carl tries to read but cannot finish because a\npiece is missing. Van Helsing remembers the scrap of picture that Cardinal\nJinette gave him before he left Rome. Sure enough, it fits. When they read\nthe inscription aloud, the picture changes into a mirror which allows them\nto walk through into the snowy fortress which is Dracula's true castle.\nThey enter a long hallway in which the ceiling and walls are lined with\npods containing vampire offspring waiting to be animated. They also see\nthe Frankenstein monster encased in a block of ice with only his head\nsticking out. The Monster sees Van Helsing and tells him that Dracula DOES\nhave a cure for werewolfism. Van Helsing wonders why Dracula would have an\nantidote. Carl remembers seeing another painting that showed a werewolf\nkilling a vampire. Now it all becomes clear. Only a werewolf can kill\nDracula, and Van Helsing is scheduled to turn into one tonight at the\nstroke of midnight. The plan is to let Van Helsing transform and kill\nDracula, and then Anna and Carl can inject him with the antidote at the\nlast minute.While Van Helsing goes in search of Dracula, Anna and Carl force Igor\nto lead them to the antidote. Igor shows them a syringe stored in a jar of\nviscous liquid. Indeed, it is the antidote, but before they can retrieve\nit, Igor locks them in the room. Aleera suddenly appears. Anna tosses the\njar at her. It crashes on the floor, and the splash burns Aleera's face.\nAnna tosses more of the liquid at the bars on the door, and it eats\nthrough them. While Anna keeps Aleera busy, Carl takes the antidote and\ngoes looking for Van Helsing. Van Helsing has discovered Dracula's\nlaboratory. The Frankenstein monster has been hoisted to the roof, and\nDracula is attempting to drain his life into his infants. Van Helsing\nmakes his way to the roof, but before the Monster can be freed, lightning\nstrikes and sends his lifeforce down through the infant nursery. The baby\nvampires begin to awaken.Just as the Frankenstein Monster gets free, Dracula changes into a\nbat and attacks Van Helsing. The Monster is struck again by a bolt of\nlightning that sends him flying over the edge of the roof. On his way\ndown, he manages to grab onto a cable and knock Igor off the bridge where\nhe's been chasing Carl with a cattle prod. The Monster swings through a\nwindow into the room where Anna and Aleera are fighting. As the Monster\nholds Aleera at bay, Anna uses the cable to swing back to the laboratory.\nOn the way, Carl tosses her the antidote. Aleera catches up with Anna.\nWhile Aleera gloats about how she's going to drink Anna's blood, Anna\ngrabs a spike and thrusts it through Aleera's heart.Just then the clock strikes midnight. Van Helsing changes into a\nwerewolf and attacks Dracula. Just as Van Helsing has Dracula by the\nthroat, the moon goes behind a cloud and Van Helsing changes back into\nhimself. Dracula takes this moment to inform Van Helsing that it was he (Van Helsing)\nwho murdered Dracula back in 1462. Suddenly, the moon comes back out. Van\nHelsing turns into a werewolf again and chews up Dracula's neck. Dracula\ncrumbles into dust as do all of his baby vampires (once Dracula is\ndestroyed, all his creations are also destroyed). At that moment, Anna\nruns into the room with the antidote. Van Helsing leaps at her. Carl also\narrives and opens the silver stake, ready to plunge it into Van Helsing.\nBut Anna was successful. She injected the antidote into Van Helsing just\nbefore she died, and Van Helsing is returning to himself.Van Helsing and Carl hold a cremation for Anna at sea. He sees her spirit in the sky alongwith those of her ancestors. She smiles and realises that she is at peace and with her family. Heading out to sea in hopes of a sanctuary, we see Frankenstein's Monster on a raft looking towards the flaming beacon and the two heroes."}