{"mid": "VanWilder", "IMDB_id": "tt0283111", "title": "Van Wilder", "plot": "Vance “Van” Wilder, Jr. (Ryan Reynolds) is a confident and cheeky-chappy senior in his seventh year at Coolidge College. With no ambition to graduate, Van spends his days driving around campus in his customized golf cart, posing nude for figure drawing classes, organizing soirees for his peers and interviewing for a new assistant, whom he eventually finds in the sexually repressed Taj Badalandabad (Kal Penn).\nUpon learning that his son is still in school, Van’s father, Vance Wilder Sr. (Tim Matheson), decides to sever Van’s financial support, citing that “sometimes you have to recognize a poor investment, and simply cut your losses.” Faced with disenrollment due to unpaid tuition, Van seeks a payment extension as a favor from Deloris, the registrar. Knowing Van’s sexual prowess, the elderly administrator forces Van to have sex with her in exchange for an extension. Afterwards, Deloris hands him the paperwork for an extension, which Van realizes is all he needed to ask for in the first place.\nWhile at a strip club, Van schemes to begin a tutoring program for Coolidge students using topless strippers as the instructors, reasoning the students to succeed in their tutoring sessions. The hustle is short-lived, however, when the strip club owner demands the women employed by his club return to work. Meanwhile, Gwen Pearson (Tara Reid) is an academically successful reporter for the campus newspaper.\nWhile her articles are well-written, they do not generate interest from the student body. Her editor assigns her to get an “unattainable” human interest story on Van Wilder, which she hesitantly accepts. Out of ideas, Van is approached by the Lambda Omega Omega fraternity, offering to pay him several thousand dollars to throw them a blowout party and boost their popularity.\nVan agrees, throwing them a hit 1970s-themed roller disco party. Overhearing two of the Lambdas expressing their excitement over the party’s success and their satisfaction with Van’s work, Gwen writes a story crediting Van as the host of the party. Van scolds the story, having intended for the student body to believe that the Lambda’s threw the party believing they deserved such recognition. Gwen apologizes, and Van agrees to sit down with Gwen for the follow-up piece her editor had assigned for the cover of the graduation edition; frustrating Gwen when he repeatedly claims their interviews are actually dates.\nGwen’s boyfriend, Richard “Dick” Bagg (Daniel Cosgrove), is a pre-medical student and the president of his fraternity Delta Iota Kappa, or DIK. As he learns of Gwen’s work with Van and suspects a growing bond between them, he moves to sabotage their prospective romance. Van and Richard exchange escalating pranks until it culminates in Van, Taj and Van’s roommate Hutch (Teck Holmes) replacing the cream filling of a batch of pastries with canine semen taken from Van’s English Bulldog Colossus.\nEmploying a tactic Van previously used to get her out of class earlier in the film, Gwen accesses Van’s records from the Admissions & Records office while doing background work on her piece. She learns that Van has actively avoided graduating for the past seven semesters, questioning his motives for doing so. Angry that Gwen dug into such personal details, Van disassociates himself with Gwen and takes a contemplative look at his life.\nTaj shows Van that he only needs to throw one more party to cover his fees for the semester. Meanwhile, Richard arranges to sabotage this party with Jeannie (Emily Rutherfurd), a member of a sister sorority. The night of the party, under the guise of resolving their differences, Richard, Jeannie and his fraternity’s Vice President distract Van and Hutch at the door while they smuggle underaged children into the party and get them drunk, then call a campus police officer to the scene.\nAs the officer is leaving, believing nothing wrong has happened, two of the minors appear outside completely incoherent. As a result, Van is arrested for selling alcohol to minors and faces expulsion from Coolidge. The student body pools its resources to defend Van against the charges before a university panel featuring, among others, Van’s collegiate adversary Professor McDougal (Paul Gleason), Deloris and Richard.\nWhile the law club invests time coaching Van to plead innocent to the charges, the rest of the student body works to generate support for Van. Having learnt from his past mistakes and what Gwen has shown him, Van goes off book during the hearing and takes responsibility for the kids at the party. He throws himself at the mercy of the court and asks that rather than expelling him they force him to graduate since he is only 18 units shy of his degree.\nWith Professor McDougal as the swing vote, he surprises everyone by casting the 3-2 vote in favor of Van’s reinstatement, and as Van studies for the quickly-approaching finals, Gwen learns from Jeannie that not only did she and Richard frame Van for the kids at the party, but they also slept together the night the plan was conceived.\nIn retaliation for this, Gwen spikes Richard’s ritual protein shake with a powerful laxative just prior to him taking the MCAT. The effects set in just as the exam begins, with no bathroom breaks permitted for the two-hour exam period. Unable to hold out, Richard “dials down the middle” of most his multiple-choice exam sheet and hurriedly exits the exam room, disgusting his fellow test takers with his flatulence. As he rushes to find a bathroom, he is intercepted by one of the doctors from the group meant to interview him for admission to Northwestern Medical School. Unable to hold himself any longer, Richard strips off his pants and has violent diarrhea in the waste basket in the room, to the revulsion and horror of the doctors present.\nVan is further acquitted when Gwen publishes in her graduation article about Van that Richard was actually to blame for the incident involving the drunken minors. The student body waits with bated breath as Van makes his way through his finals.\nWith his economics final five minutes away, Van is awoken by Taj and rushes across campus for the exam with Professor McDougal. Van utilizes the entire exam period, finishing with a negative attitude. He awaits the results of the exam, which are personally delivered by McDougal himself, who informs him that he passed and will thus graduate. McDougal notes that he had been so hard on him all those years because he believed Van wasn't living up to his potential, Van responds that he thought McDougal had just been upset over him \"fooling around\" with McDougal's daughter.\nThe university celebrates Van’s graduation with a wild party held in Van’s honor. Van’s father appears, admitting he was wrong and expressing his pride in Van’s success. Gwen then arrives, lovingly reuniting with Van."}