{"mid": "VegasVacation", "IMDB_id": "tt0120434", "title": "Vegas Vacation", "plot": "At work, Clark Griswold (Chevy Chase) has invented a long life food preservative, earning him a large bonus check. Clark announces to his family that he is taking them on vacation. Part of the reason for the trip is for Clark and Ellen to renew their wedding vows. Excitement wanes, however, when Clark says they are headed to Las Vegas, Nevada. His wife, Ellen (Beverly D'Angelo) and teenage daughter, Audrey (Marisol Nichols) have their doubts, as Las Vegas is not known for its family-friendly atmosphere, while teenage son Rusty (Ethan Embry) appears to be more enthusiastic. Upon travelling to Vegas, they run into the \"woman in the Ferrari\" (Christie Brinkley) who appeared in the first film. Clark is the only one who sees her, but then notices that she now has a child.\nUpon arriving in Vegas, the family embarks upon a series of misadventures. The Griswolds visit Cousin Eddie (Randy Quaid), the husband of Ellen's cousin Catherine (Miriam Flynn). Eddie and his family now live in the desert just north of Las Vegas, on what used to be an atom bomb test site. While on a group tour of the Hoover Dam led by guide Arty (John P. Finnegan), Clark leaves the group after accidentally creating a leak in the dam's inside walkways, and is forced to climb the scaffolding to the very top of the dam to get out, because his cries for help cannot be heard over the roaring water of the spillway. Later that night they attend a Siegfried & Roy show.\nThe next night, tickets to a Wayne Newton concert and a dress for Ellen are sent in the mail. They go to the concert, only to realize that Newton had sent the dress. While singing, he brings Ellen up on stage to sing with him.\nThe next day, the family agrees to an \"alone day\" and are left to their own devices. Clark goes to a casino and becomes addicted to gambling, usually losing to a snidey dealer (Wallace Shawn) who enjoys Clark's humiliation. Rusty gets a fake ID from a Frank Sinatra look-alike (Toby Huss) and becomes a winning high roller, taking on the pseudonym 'Nick Pappagiorgio'. Audrey starts hanging out with Eddie's free-spirited and gorgeous exotic dancer daughter Vicki (Shae D'Lyn) and her friends. And Ellen begins spending time with Wayne Newton, who has feelings for Ellen.\nEventually, Clark gambles away the family's $22,600 bank account, leading a furious Ellen and both of the kids to desert him. Russ goes off gambling for cars, and wins four. Ellen goes to visit Wayne Newton, while Audrey goes to a strip club with Vicki and gets a job as a stripper. Eddie — who has money buried in his front yard — tries to come to Clark's rescue in return for everything the Griswolds have done for him and his family over the years. Clark and Eddie go to a local casino to get their money back, but Clark ends up gambling away Eddie's money too, causing him to reevaluate his behavior. Clark then realizes he no longer cares about getting his money back, but he needs to get his family back.\nClark then gathers up his family from around Vegas and they gamble their last two dollars on a game of Keno. They sit next to an elderly man (Sid Caesar) who compliments Clark on his family, and hints that he has been lonely all of his life. Out of sympathy, Clark tells the man to consider himself part of the Griswold family for the night. The man happily accepts Clark's offer, and both parties begin the game. At first, the Griswolds are optimistic, but as they realize they have already lost the game, they sit together in silence. Suddenly, the man next to them ecstatically declares that he has won the game. In his burst of joy, he suddenly begins to slip in and out of consciousness while Ellen sends Rusty for help. He awakens one last time and whispers a message to Clark, before dropping his winning ticket and lapsing one final time.\nClark, confused, tells Ellen that the man said \"take the ticket.\" When the casino security guards and paramedics arrive, they declare the man officially dead. They tell the Griswolds his name was Mr. Ellis, and commented on how sad his loneliness was to them. As Mr. Ellis is carried away, a janitor approaches with a carpet cleaner, heading straight for the winning ticket on the floor. Though it appears Clark is going to allow it to be lost, at the last second, he slides the ticket out of the carpet cleaner's path. With their newfound winnings, Clark and Ellen get remarried. Afterwards, Clark gives Eddie $5,000 to repay his kindness. They all drive home in the four cars Rusty won on the slot machines: a red Dodge Viper, a maroon Ford Mustang, a black Hummer H1, and a white Ford Aspire."}