{"mid": "VeraCruz", "IMDB_id": "tt0047647", "title": "Vera Cruz", "plot": "During the Franco-Mexican War, ex-Confederate soldier Ben Trane (Cooper) travels to Mexico seeking a job as a mercenary. He falls in with Joe Erin (Lancaster), a lethal gunslinger who heads a gang of cutthroats (including Ernest Borgnine, Jack Elam, Charles Bronson, and Archie Savage). They are recruited by Marquis Henri de Labordere (Cesar Romero) for service with the Emperor Maximilian I of Mexico (George Macready) After an almost-miraculous display of shooting with a lever-action model 1873 Winchester rifle, the Emperor offers them $25,000 to escort the Countess Duvarre (Denise Darcel) to the seaport city of Veracruz on the Gulf of Mexico. Trane uses a compliment to the Countess to get the Emperor to double it, impressing Erin with his boldness. During a river crossing, Trane and Erin noticed that the stagecoach in which the countess is traveling is extremely heavy. Erin later discovers that the stagecoach contains six cases of gold coins. First Trane and then the countess discover him looking at the gold. The countess informs them that it is worth $3 million which is being transported to pay for troops for Maximilian's French army. They form an uneasy alliance to steal and split the gold. Unfortunately for their plans, the Marquis was listening from the shadows.\nAlso involved in the mix is General Ramírez (Morris Ankrum) a heroic Juarista leader. He and the other Juarista leaders soon suspect that there is more to the expedition than the Countess and ambush the column several times. Eventually, the rest of Erin's group also learn that something suspicious is going on and they demand to be let in on the secret. The different groups, including Juarista secret agent Nina (Sara Montiel), conspire to steal the gold for their own purposes. Alliances are formed, quickly dissolved and others are formed. A ruse is successful in getting the gold to Veracruz where the Juarista troops attack the French in a bloody battle over the ownership of the gold. Erin attempts to steal the gold for himself by getting the countess to reveal the location of the ship she had hired to transport the gold. However, Trane arrives in time to stop him. In the end, Trane and Erin face off in a showdown that concludes with Erin's death. Trane leaves the gold and walks through the dead bodies from the battle while the wives and mothers of the Juarista troops search among the dead and wounded for their loved ones."}