{"mid": "VirginiaCity", "IMDB_id": "tt0033226", "title": "Virginia City", "plot": "Union officer Kerry Bradford (Errol Flynn) stages a daring escape from Confederate Libby Prison run by the commandant, Vance Irby (Randolph Scott). Bradford reports to Union headquarters and is immediately sent to Virginia City, a Nevada mining town, to find out where $5,000,000 in gold that Southern sympathizers plan to ship to the tottering Confederacy is being kept. On the westbound stagecoach, he meets and falls in love with the elegant Julia Hayne (Miriam Hopkins), who unbeknownst to him is in fact a dance-hall entertainer — and a rebel spy, sent by Jefferson Davis (Charles Middleton) to assist in the transfer of the gold by wagon train. Also on the stagecoach is the legendary John Murrell (Humphrey Bogart), leader of a gang of \"banditos\", traveling as a gun salesman. Before he and his gang can rob the stage, Bradford gets the drop on Murrell, who is forced to send his men away.\nWhen the stage reaches Virginia City, Julia gives Bradford the slip and heads off to warn Captain Irby, who is now managing the gold-smuggling operation, that Bradford is in town. Bradford follows Irby to the rebels' hideout behind a false wall in a blacksmith's shop, but the gold is moved before he arrives. The Union garrison is called out to patrol the roads to prevent any wagons from leaving town.\nWhile Irby is meeting with the sympathetic town doctor, Murrell shows up looking for someone to set his broken arm. Irby offers Murrell $10,000 to have his banditos attack the garrison, which will force the Union soldiers guarding the roads to come to its defense. While the soldiers are busy, Irby's rebels will smuggle the gold out in the false bottoms of their wagons. First Irby needs to take care of Bradford. He uses Julia to arrange a meeting between the two men, and then takes Bradford prisoner, intending to return him to prison.\nThe rebels' caravan is stopped at a small Union outpost. At first, they are allowed to proceed, but after watching the bullion-laden wagons have difficulty moving through the soft dirt, the soldiers become suspicious and attempt to inspect the wagons. The Southerners start a firefight, killing the soldiers. In the confusion, Bradford escapes. Pursued closely by Irby and his men, he rides his horse down a steep incline and ends up somersaulting down the hill. The rebels, believing him dead, continue toward Texas. Bradford returns to the outpost and sends a telegraph to the garrison. Major Drewery (Douglass Dumbrille), the garrison commander, arrives with a contingent of cavalry. Drewery, who is scornful of Bradford as a soldier, does not take his advice and ends up following a false trail, causing the pursuit to fall ever further behind the rebels, who are themselves fighting thirst, privation, and the unforgiving terrain. Bradford is able to persuade Drewery to allow him to take a small detachment to follow his hunch.\nBradford and his men catch up with the caravan which is trapped in a canyon and being attacked by Murrell's banditos who are attempting to take the gold. Irby is wounded in the gunfight, but Bradford's superior military skills and the rebels' long guns eventually drive off the banditos. Before he dies, Irby delegates command of the caravan and its gold to Bradford. During the night, knowing that in the morning both Murrell's men and Drewery's command will arrive, Bradford takes the gold from the wagons and buries it in the canyon to prevent its capture.\nDrewery and his men arrive in the morning in time to crush the outlaws' renewed attack, and Murell is killed. Bradford refuses to disclose the gold's location and is brought up on charges in a court-martial. He defends his action in that, \"as a soldier\", he knew the gold might have been used to win the war for the South and prevented that, but \"as a man\" he knows it belongs to the South and he would prefer that it be used to rebuild the South's shattered economy and wounded pride after the war. The court finds him guilty of high treason and sentences him to death on April 9, 1865.\nThe day before Bradford's scheduled execution, Julia meets with Abraham Lincoln (Victor Kilian, seen only in silhouette) and pleads for Bradford's life. Lincoln reveals that at that very moment, Generals Lee and Grant are meeting at Appomattox Courthouse to end the war. As the war is over, and in a symbol of the reconciliation between North and South, Lincoln pardons Bradford in the spirit of his second inaugural address, \"With malice toward none; with charity for all...\""}