{"mid": "Viridiana", "IMDB_id": "tt0055601", "title": "Viridiana", "plot": "A novice named Viridiana (Silvia Pinal) is about to take her vows when her uncle, Don Jaime (Fernando Rey), invites her to visit him. Her only living relative, she has met him only once and is reluctant to comply. Her mother superior pressures her into accepting.\nDon Jaime is a recluse, living on a neglected farm with a couple of servants—Ramona (Margarita Lozano), her daughter Rita, and Moncho. When Don Jaime sees his niece, he is struck by her strong resemblance to his deceased wife.\nThe night before she is to leave, Viridiana, grateful for her uncle's longtime financial support, reluctantly complies with the odd request to don his wife's wedding dress. When Ramona informs Viridiana that Don Jaime wants to marry her, she is aghast and Don Jaime seems to drop the idea. Ramona secretly drugs her drink. Don Jaime carries the unconscious woman to her room with the intention of raping her. At the last moment, he decides otherwise.\nThe next morning, he lies and tells Viridiana that he \"took her virginity\", i.e. raped her, so she cannot go back to her convent. When she is undeterred, he confesses he lied, leaving her uncertain as to what happened that night. At the bus stop, the authorities prevent her from leaving. Her uncle has hanged himself, leaving his property to her and his illegitimate son, Jorge (Francisco Rabal).\nDeeply disturbed, Viridiana decides not to return to the convent. Instead, she collects some beggars and installs them in an outbuilding. She devotes herself to the moral education and feeding of this motley group. Disgusted, Moncho departs.\nJorge moves into the house with his girlfriend Lucia and starts renovating the rundown place. Lucia senses that he, like his father, lusts after Viridiana, and soon leaves. Jorge then makes a pass at the willing Ramona.\nWhen Viridiana and Jorge leave for a couple of days to take care of some business, the paupers break into the house. At first, they just want to look around. Faced with such bounty though, they degenerate into a drunken, riotous bunch, partying to the strains of Handel's Messiah. Posing for a photo around the table, the beggars resemble the figures in Da Vinci's Last Supper.\nThe rightful owners return earlier than expected to find the house in shambles. The miscreants excuse themselves one by one and leave. Jorge confronts one of them, who pulls a knife. When the man assaults Viridiana, Jorge tries to rescue her, but another beggar strikes him in the head with a bottle, knocking him out. As Viridiana resists sexual assault, Jorge regains consciousness. He has been tied up, but manages to bribe one beggar into killing the would-be rapist. The police finally arrive.\nViridiana is a changed woman. The child, Rita, burns her crown of thorns. Wearing her hair loosely, Viridiana knocks on Jorge's door, but finds Ramona with him in his bedroom. With Ashley Beaumont singing Shimmy Doll on the record player, Jorge tells Viridiana that they were only playing cards, and urges her to join them, stating \"You know, the first time I saw you, I thought, my cousin and I will end up shuffling the deck together.\""}