{"mid": "Visions", "IMDB_id": "tt4716444", "title": "Visions", "plot": "David Maddox consoles his wife Eveleigh as she regains consciousness in a hospital. Eveleigh recalls being in a fatal car accident that killed a child in the other vehicle.\nOne Year Later – Now three months pregnant, Eveleigh and David prepare to reopen a vineyard they purchased in Paso Robles, California. Top area wine distributor Helena Knoll attends a party for the couple and Eveleigh finds the woman muttering in a strange trance while alone inside their house.\nEveleigh begins suffering from nightmares and hallucinations and comes to believe something supernatural may be haunting her or the house. Eveleigh also starts attending a yoga class where she makes friends with a pregnant woman named Sadie.\nSadie accompanies Eveleigh on a visit to realtor Glenn Barry. Glenn reports that the vineyard house has no horrible history, but tells Eveleigh that she may wish to research prior owners the Porters for answers regarding possible paranormal activity.\nEveleigh’s visions continue intensifying. Worried that her PTSD has returned and is to blame for her hallucinations, David and Eveleigh’s OB/GYN Dr. Mathison insist that she resume taking the anti-depressants she previously stopped due to pregnancy. Eveleigh reluctantly relents and the visions finally cease.\nSeveral months later, Eveleigh reconnects with Sadie, who convinces Eveleigh to stop taking her medication. Eveleigh’s haunting visions return and she also begins suspecting a secret conspiracy against her that David might be involved in.\nEveleigh contacts Jane Porter after learning that she had been researching ghosts and poltergeists. Jane leads Eveleigh back to Helena Knoll to ask about the trance she had at the party.\nAlso sensitive to supernatural phenomena, Helena accompanies Eveleigh to the ruins of a destroyed home that previously existed on the vineyard’s property. Both women experience a vision. Helena tells Eveleigh that psychic violence can echo throughout time and some kind of paranormal activity imprinted itself upon the land. Helena collapses suddenly. Before dying, Helena says to Eveleigh, “it’s not what you think. It’s you.”\nEveleigh visits vintner Victor Napoli, whose family owned her vineyard a century earlier. Victor tells Eveleigh that his great-grandmother burned down the old house on the property because of paranormal activity. He then shows her sketches from when a medium tried contacting spirits in the home. Eveleigh is shocked to see that the sketches depict her and David.\nEveleigh comes home to an intervention staged by David, Dr. Mathison, Eveleigh’s friend Eileen, and family therapist Victoria Lambert. Eveleigh tries explaining that she was not being haunted, but rather, she and David were ghosts haunting the past. The Porter and Napoli families were experiencing premonitions of a future tragedy that Eveleigh realizes is about to take place that night.\nSadie arrives at the front door with her husband Ben. Both of them are armed with guns. Victoria tries to run and Ben shoots her as the room erupts in commotion. Eveleigh realizes that every vision she had was showing her a glimpse of events currently taking place.\nDavid discovers Sadie is not actually pregnant when he stabs her stomach. Sadie turns the knife on David and he falls to the floor. Eveleigh pushes Sadie through a glass door and flees. Ben kills Eileen before running after Eveleigh. He then kills a neighboring farmer before confronting Eveleigh. Eveleigh is attacked from behind and knocked unconscious.\nEveleigh wakes to find herself being held captive by Ben and Sadie. It is revealed that Sadie is the woman who lost her child in the fatal car wreck. Holding Eveleigh responsible, Sadie plans to cut out Eveleigh’s baby. Eveleigh wrestles free of her restraints and slashes Sadie’s throat. Ben moves to attack, but David arrives and shoots Ben dead.\nIn the aftermath, the vineyard house stands empty as realtor Glenn Barry shows the property to a new couple."}