{"mid": "VivaVilla", "IMDB_id": "tt0025948", "title": "Viva Villa!", "plot": "After seeing his poor father lose his land and be whipped to death for protesting, young Pancho Villa stabs one of the killers, then heads off into the hills of Chihuahua, Mexico during the 1880s. As a grown man, Villa and a band of rebel bandits, including his trusted ally Sierra, kill wealthy landowners and become heroes to their fellow \"peons.\"\nA wealthy aristocrat, Don Felipe, arranges an introduction for Villa to the distinguished and eloquent Francisco Madero, who resents what has become of Mexico under the rule of president Porfirio Díaz and persuades Villa to help him fight for liberty, not just for personal gain. The coarse and illiterate Villa is humbled in the presence of Madero and agrees to fight for his cause. He also is attracted to Don Felipe's beautiful sister Teresa, although there are many women in Villa's life, including one he is married to, Rosita.\nVilla's exploits are made even more colorful by an American newspaper reporter, Johnny Sykes, to whom Villa has taken a great liking. While drunk, Sykes is misinformed and reports that Villa has already overtaken the village of Santa Rosalia in a great victory for his men. Disobeying the orders of Madero and the arrogant General Pascal, simply to help his newspaper friend, Villa stages a raid on Santa Rosalia, as well as on Juarez.\nMadero ultimately assumes office in Mexico City, then commands Villa to disband his personal army. Villa agrees, but when Sierra kills a bank teller just so Villa can withdraw his money, Villa himself ends up sentenced to death. A gloating General Pascal mocks the way Villa pleads for his life, then reads a telegram from Madero, ordering that Villa instead be exiled from the country.\nAlone and drunk in El Paso, Texas, feeling forsaken by his homeland, Villa is visited by Sykes, who informs him that Madero has been assassinated by the power-mad Pascal and his men. Villa returns to Mexico and rebuilds his own army, recruiting tens of thousands to ride by his side. Together they storm the capital, where Pascal is subjected to a particularly gruesome death. Villa takes what he wants, but when Teresa resists and he physically assaults her, she draws a gun that her brother Don Felipe has given her for protection. Sierra intervenes and murders her.\nVilla appoints himself president but is ineffectual, unable to restore Madero's dream of land reform for Mexico's poor. He ultimately agrees to step aside and go back to where he belongs, including to his wife. Before he can, with Sykes by his side, Villa is gunned down by Don Felipe out of revenge for his sister. Sykes vows to keep Villa's memory alive, telling his dying friend that he is no longer news, but history."}