{"mid": "WabbitTwouble", "IMDB_id": "tt0034368", "title": "Wabbit Twouble", "plot": "Elmer, riding in his old jalopy to a Conga beat, makes his way to Jellostone National Park (a pun on Yellowstone National Park) while looking forward to rest and relaxation. Elmer pitches a tent near Bugs Bunny's rabbit hole, and sets up camp by putting a fire stove, a mirror and a table to wash his face, and a hammock. However, he is very disappointed when Bugs unpitches and takes away his tent, but gets it back, this time tied up in knots. Bugs welcomes Elmer to Jellostone, then pulls Elmer's hat over his eyes. When Elmer reaches into the hole to grab Bugs, Bugs ties up his fingers. He passes a law against Bugs getting out of his hole by hammering a board. However, Bugs gets out, and mimics Elmer's weight and what he previously said, labeling it \"phooey\". Elmer lies down in his hammock and falls fast asleep, muttering to himself.\nBugs appears from the rabbit hole by Elmer's campsite. He takes a pair of glasses, paints them black, puts them on Elmer's face and sets Elmer's alarm clock to go off. Elmer now thinks it's night (since everything seems so dark), so he goes to his tent, gets undressed and goes to bed. Bugs then takes the glasses off and crows like a rooster, making Elmer think that it's the next morning.\nWhen Elmer goes to wash his face again, Bugs keeps the towel at a short distance with a branch, causing Elmer to blindly follow the towel (\"I do this kind of stuff to him all through the picture\", he confides to the audience). He leads Elmer off a cliff edge. Elmer looks at the miraculous view of the Grand Canyon, but then realizes he's in midair. He runs back to safety and holds on to Bugs for dear life. Bugs then admits he's the one pulling these gags and runs off, with a furious Elmer giving chase after retrieving a gun from his tent. However, he runs into a black bear. The bear starts growling, and so Elmer turns to a wildlife handbook for advice, which directs him to play dead.\nThe bear soon gives up (after sniffing Elmer's \"B.O.\" – his feet), but Bugs climbs on Elmer and starts growling exactly like the bear. Just as Bugs starts biting Elmer's foot, Elmer sees what's going on and grabs his rifle. Bugs runs away when the bear returns and Elmer ends up hitting the bear instead. A chase ensues with Elmer and the bear running through the trees to the tune of the William Tell Overture. Finally, the bear freaks Elmer out when he rides on top of him.\nEventually, Elmer gives up and packs everything back into his car. On his way out, he stops back at the sign and reads it again. This makes him say that it's \"bawogney!\" and to teach the park not to give false advertisement, he chops the sign up to bits with a hatchet and an ax and then stomps on the ruined sign while calling the park's \"peace and wewaxation\" promises \"wubbish!\" A ranger (along with Bugs) appears, with an angry expression on his face. Elmer is sad because he is arrested for the destruction of government property, and he is now in jail, where he's thankful that he's finally \"wid of that gwizzwy bear and scwewy wabbit! West and wewaxation at wast!\" Unfortunately, however, he turns to find out that somehow he's sharing his cell with both Bugs and the black bear. Both of them ask how long he is in jail for (\"Pardon me but, how long are ya in for, doc?\", they ask)."}