{"mid": "Waiting", "IMDB_id": "tt0348333", "title": "Waiting...", "plot": "Shiv Kumar (Naseeruddin Shah), an elderly psychology professor, arrives at a hospital in Kochi to visit his comatose wife Pankaja (Suhasini Maniratnam). Tara Kapoor Desphande (Kalki Koechlin), a young advertising agent, also arrives at the hospital during the night after being delivered news of a car accident involving her husband, Rajat Deshpande (Arjun Mathur). She is consoled by Rajat's eccentric co-worker Girish (Rajeev Ravindranathan), but dismisses him abruptly. Tara is deeply disturbed to see Rajat breathing on a ventilator, and leaves immediately.\nIn the waiting lounge, Tara approaches Shiv, believing him to be a doctor, and asks for his advice. He reveals that his wife had a stroke eight months ago while he was out watching a cricket match, and has been in a coma ever since. The two bond over their similar situations. Later, Girish drops Tara off at a hotel and gives her Rajat's bag. Tara finds his watch in it and puts it on. The next day she is angered on reading an intimate message on Rajat's phone from a colleague Sheetal, who is later revealed to be a man. Shiv witnesses the whole misunderstanding and the two share a light moment. He later visits her at the hotel, and she shares her disappointment with her friends and followers on social media for having abandoned her. She commends Shiv for his composure, as he explains the five stages of grief to her.\nTara finds her strength in Shiv, a wiser and more experienced counterpart. The two start spending most of their spare time together coping with their grief, despite being completely opposite in nature. Shiv takes Tara to the temple, and she takes him shopping. Rajat's doctor, Dr. Nirupam Malhotra (Rajat Kapoor), tells Tara that Rajat has a hematoma in his brain and a surgery might help him recover, but it carries the risk of partial paralysis. Tara is torn, as she believes Rajat would not want to take the risk, and seeks advice from Shiv. He is already at loggerheads with Dr. Malhotra, dismissing him as a pawn of the hospital board and the insurance companies who only care about making money and not the patients. Tara and Shiv get into a heated argument. Shiv lashes out angrily at Tara for not giving Rajat a chance at life. Tara retorts that she is a realist, and dismisses Shiv for being selfish and making his wife go through pain for his own sake.\nTara's best friend Ishita (Ratnabali Bhattacharjee) arrives at Kochi and advises her to start chanting prayers and to inform Rajat's estranged parents of his situation. Despite being an atheist, Tara chants Namu Myōhō Renge Kyō when she is alone with Rajat. Shiv desperately attempts to convince Dr. Malhotra to perform a spinal decompression on his wife, but he disregards Shiv's research and refuses to proceed with surgery. Tara discusses Rajat's surgery with Ishita and decides not to go ahead with it which further angers Dr. Malhotra. Ishita leaves to aid her ailing son. Tara realises that she is no longer Ishita's top priority, now that Ishita is married. Shiv and Tara make up and later that night dance together at Shiv's house, much to the amusement of his neighbours. They get upset thinking about their spouses and discuss what they meant to them, before falling asleep in the living room.\nThe next morning, Tara leaves early and decides to inform Rajat's mother. After Girish brings Tara the required insurance papers, she thanks him for always being there for her and apologises for being rude. She decides to go ahead with the surgery after all. Rajat is taken to surgery and she holds his hand until they arrive at the operating room. Shiv, on the other hand, decides to take Pankaja off the ventilator and let his wife herself make the final call. Pankaja tries to breathe on her own as the viewers are treated with flashbacks of the heydays of both couples. Tara takes a seat in the waiting lounge, and is joined by Shiv as the camera pans out."}