{"mid": "WakeWood", "IMDB_id": "tt1296899", "title": "Wake Wood", "plot": "Little Alice Daley is mauled to death by a German Shepherd dog in the yard of her father Patrick's veterinary practice. After her death, Patrick and his wife Louise, a pharmacist, move to a rural village called Wakewood, where they struggle to cope with the loss of their only child (Louise cannot have any more children). The couple's car mysteriously breaks down one evening in the middle of nowhere and they go to the nearby house of Patrick's veterinary colleague, Arthur, to seek help. There Louise witnesses Arthur leading a strange and bloody pagan ritual but refuses to say anything to Patrick. It becomes apparent that something strange is happening in town and that Arthur knows that Louise saw the ritual.\nSoon afterwards a farmer, Mick O'Shea, is accidentally killed by his own bull. Horrified, Louise and Patrick, who witness the accident, plan to leave, but Arthur, who needs their skills (and presumably doesn't want Louise telling what she saw), convinces them to stay by explaining that he has a ritual that brings back the dead, but only for three days, only within the boundaries of the townland, and only if the person has been dead for less than a year. This is the ritual that Louise witnessed. The couple agree to remain, excited to see their only child again.\nThe ritual requires a piece of the person to be resurrected, and the couple go grave-robbing, cutting off one of Alice's fingers and retrieving her necklace. The ritual also needs a fresh corpse. At Mick's wake, Arthur asks his widow, Peggy, to use his body, but she refuses, claiming there is something not right about the couple. However, Arthur persuades her by tacitly threatening her that if she refuses he will not resurrect Mick either.\nThe gruesome ritual goes ahead and Alice is reborn. However, Peggy is still not happy and frightens the little girl, who flees across the townland boundary. As soon as she does so, she collapses with the wounds that killed her appearing on her body. Her parents immediately take her back across the boundary and the wounds disappear. That night Arthur and other villagers come to see them, claiming that something is wrong and Alice must be sent back to her grave immediately. Patrick and Louise persuade them to allow her to stay for the final day.\nHowever, Patrick soon realises that there is something seriously wrong with Alice. She begins killing and mutilating animals. She also tells Louise that she is pregnant, which Louise confirms with a pregnancy tester. Alice then murders Peggy and several other villagers before Patrick manages to sedate her. Her parents and the villagers carry her to the woods, where they bury her. Patrick and Louise admit that she has actually been dead for over a year, which has caused her to react in the way she has. As Louise turns to leave, Alice drags her mother down into the grave with her, the penalty for misuse of the ritual.\nSometime later, Arthur resurrects a heavily pregnant Louise. It is clear from the surgical tools that he lays out at home that Patrick is about to deliver the baby by caesarean section."}