{"mid": "WarlockTheArmageddon", "IMDB_id": "tt0108517", "title": "Warlock: The Armageddon", "plot": "In the distant past, Druids have stopped the rise of Satan's son using six magical rune stones that create light to vanquish the darkness. While the Druids perform a ritual upon a woman Satan has selected, they are attacked by Christians who feel their work is Satanic. Most of the Druids die and the rune stones are scattered.\nIn the present, a young man and woman are in love but are having relationship issues. Their parents are Druids; while the girl's father is a priest and has neglected his responsibilities as a Druid, the boy's father kills his son so he can rise again with the aid of Druid magic to become a Druid warrior.\nElsewhere, a young woman has possession of one of the rune stones due to it being passed down through her family. She wears the stone to impress her date, but, as she looks out her kitchen window at the lunar eclipse, she rapidly becomes pregnant and gives birth to the Warlock, Satan's son. After he is reborn, he kills the woman who gave birth to him after she insults him. The Warlock communicates with his father, who speaks to him using the dead woman as a conduit, telling his son to find the other five rune stones. These have the power to summon him to Earth, but he has precisely six days to do this. The Warlock peels the flesh from his deceased mother's stomach and makes it into a map, enabling him to track the other runes.\nThe young man, destined to be a Druid warrior, learns how to use his powers, and it is not long before his girlfriend joins him. They suffer persecution from the villagers but are protected by the girl's father, the priest. Meanwhile the warlock gains the other rune stones to raise his father Satan from his prison to rule the world, murdering various people along the way.\nThe last rune stone is worn by the Druid warrior; he and his lover fight the warlock but he defeats and imprisons them and gains the runes which he uses to open a portal to Hell. As Satan rises, the Druid boy and his girlfriend use their powers to turn on the lights of a nearby truck; the Warlock screams in terror as he is killed and his father Satan is sent back to Hell, the two of them defeated by evil's ultimate enemy: LIGHT."}