{"mid": "WarmBodies", "IMDB_id": "tt1588173", "title": "Warm Bodies", "plot": "In a post-apocalyptic future, a male zombie still in the early stages of decay lives in a community of the Dead in an abandoned airport near the city. He refers to himself as “R” since he cannot remember his full name, among other details of his life. R reveals through first person narrative that human civilization has been destroyed by wars and disasters, resulting in a mysterious zombie plague. Now whole communities of zombies live in hives, and are separated into two categories based on the amount of decay: Fleshies, the Dead who still have flesh on them, and Boneys, the Dead who have been reduced to nothing more than skeletons with bits of muscle keeping them together. The Boneys are basically the leaders of the Dead, and are seemingly stronger and more intelligent than Fleshies. They can only be killed if their brains are destroyed. The zombies are very lethargic for the most part, have limited speech and short memories, and are notably illiterate. They live in what is a mere, twisted shadow of a normal society. One of the few times they are truly focused and animated is when they go hunting for the Living, their only food source, during which they spontaneously form a hunting party. The brain is the best part, because if they eat it, then they can relive the memories, feelings, and thoughts of their prey. Anything that’s left of the prey is brought back for the others to eat.\nR is portrayed as unusual, since he not only contains more empathy and intuition than his fellow Dead, but is also able to express it better than most of them despite being Dead. He openly shows distaste for eating human flesh, and is the only zombie there who is able to form four, coherent syllables in one breath. After a hunt, he meets a zombie woman, and they quickly become girlfriend and boyfriend. She takes him to church where a Bony preacher sees them, and marries them on impulse. The next day, R and his new wife are presented with two Dead children. Seeing them try to play like Living children depresses R, and he is gripped with a feeding frenzy. He leads a hunting party to the city where they find a group of young adults scavenging supplies. Attacking with unusual energy, R feeds on the brain of a young man named Perry. After experiencing his memories, R sees Perry’s girlfriend Julie, and in a moment of mercy, saves her from the others. He disguises her scent with zombie blood, and takes her home where he hides her in a 747 airplane. The airplane is R’s “house” where he can have some privacy, and hoard the interesting objects he finds. He slowly gains Julie’s trust, and convinces her to stay for a while until the others forget about her (though in reality, he just really likes her). Throughout the week, R feeds her food from the airport’s restaurant, entertains her with his treasures, including a record player, and Julie tries to teach him to drive a car which R has managed to get started. She also tells him a little bit about her life. In time, R begins feeling guilty over killing Perry, which is made worse since Julie doesn’t know it was him, and is giving him the benefit of the doubt. Despite his guilt, R continues eating the remains of Perry’s brain, seeing it as a rare treasure.\nOne night, R eats the last of the brain, and experiences the last of Perry’s memories. When he begins to witness Perry’s death however, R’s thoughts interrupt the scene in an attempt to halt it. To his shock, memory pauses, and Perry scolds him, telling him to let Perry have this memory. R complies, and the memory plays through. After it ends, R falls asleep. When he awakens, Julie is being attacked by several zombies, including M, and R helps her fend them off. M is confused and angry by R’s behavior, but R holds his ground. Suddenly, some Boneys arrive. Although they do not attack, one of them shows R some old photos of Dead and Living fighting each other, telling him that they need to maintain the status quo. They leave along with the rest, and R takes Julie back to the airplane. In the morning, Julie convinces R to take her home, and they attempt to leave while the Dead watch them, half-fascinated and half-afraid. However, the Boneys attack and try to kill Julie, but with M’s help, they get away in R’s car.\nOn the way to the city, it starts raining, and they are forced to stop in the suburbs. They camp out in one of the houses, and Julie allows R to share a bed with her. To his surprise, R experiences some more of Perry’s memories, during which R has another conversation with “Perry”. The next morning, Julie calls her father, and sends R out for fuel. When he returns however, Julie is gone. R begins walking back to the airport in a heavy rainstorm, and feels cold for the first time since he “died”. On the road, R runs into M and some other zombies who have been chased out by the Boneys. The zombies have been changing like R, and experiencing things such as dreams and old memories. R decides to go after Julie, and recruits the other zombies’ help to get inside the stadium. Along the way, Perry shows R more of his memories, saying that he doesn’t want to leave yet. When R and the others arrive at the stadium, he impersonates a Living person, and has his friends “chase” him to its doors. The soldiers let him in, and R sneaks through the stadium following Julie’s scent to her house. R sees Julie on her balcony, and they reunite. R also meets Nora, Julie’s best friend. With no other options, the girls let him stay the night, and R has another Perry dream. The next morning, the girls give R a major make-over to make him look human, and take him on a tour of the city. They take him to the cemetery where they visit the grave of Julie’s mother, and Julie tells him how her mother died. While there, R finds Perry’s grave, and has a waking vision of Perry. By now, it’s become apparent that some form of Perry’s soul is living inside R, and has intertwined with R’s own. Perry warns him of the changes to come, saying R needs to take control or be swept away. The vision ends, and the three of them leave the cemetery. After a tense run-in with Julie’s father, Grigio, they take him to a pub where Julie spikes their drinks with real alcohol, and R gets drunk. He goes for a walk to clear his head, but runs into a soldier who realizes what he is, forcing R to attack him. As R begins eating him, he regains control and stops, causing the soldier to reanimate as a zombie. R runs back to Julie, and finally tells her that he killed Perry. The Dead soldier is found and killed, but Grigio orders a widespread search to find the second zombie. He arrives at the house, deduces what R really is, and attacks him despite Julie’s protests. Nora holds a gun to Grigio, and Julie and R escape from the stadium. Outside, the crowd of zombies has grown. What Julie and R have between them has infected many others, causing them to change.\nAs they deliberate on what to do next, the Boneys attack. R and Julie flee back to the stadium in the hopes that the Living will kill them off, but the Boneys quickly gather in huge numbers, more than any have ever seen. Julie is astounded by the siege, but Perry speaks to both of them inside their heads, and tells them that it’s because the Boneys are afraid of the change they represent. The couple meets up with Nora, and they flee to a roof where they see the battle between the Boneys and the Living. As they watch, Julie has an epiphany: the plague started because the human race crushed itself beneath the weight of its sins until it released a dark force that changed the humans so that everyone could see their evil. In the midst of the chaos and bloodshed, R and Julie do the only thing they can think of: they kiss. The strength of their love cures R of the plague completely and their eyes turn gold. Suddenly, the moment is interrupted by Grigio, who is quickly descending into madness. Grigio tries to kill them, but one of his soldiers intervenes, and Grigio nearly falls off the roof. A Boney appears, and begins eating Grigio, who has finally given up. Julie shoots it, and both fall off the roof as Grigio shrivels away into a pile of dust and bones. The fight on the roof somehow causes the Boneys to give up, and they disperse.\nAfter the battle, the Living decide to give the reviving Dead a chance, and let them try to assimilate into their society. Those that haven’t started changing yet, either start to change or fade away into dust. In light of the new beginnings, R has decided to remain “R”. They still have a long way to go, but it’s a start."}