{"mid": "WaterlooBridge", "IMDB_id": "tt0033238", "title": "Waterloo Bridge", "plot": "After Britain's declaration of World War II, Roy Cronin (Robert Taylor), an army colonel, is being driven to London's Waterloo station en route to France, and briefly alights on Waterloo Bridge to reminisce about events which occurred during the First World War when he met Myra Lester (Vivien Leigh) whom he had planned to marry. While Roy gazes at a good luck charm, a billiken that she had given him, the story unfolds.\nRoy, a captain in the Rendleshire Fusiliers on his way to the front, and Myra, a ballerina, serendipitously meet crossing Waterloo Bridge during an air raid, striking up an immediate rapport while taking shelter. Myra invites Roy to attend that evening’s ballet performance and an enamored Roy ignores an obligatory dinner with his colonel to do so. Roy sends a note to Myra to join him after the performance, but the note is intercepted by the mistress of the ballet troupe, the tyrannical Madame Olga (Maria Ouspenskaya), who forbids Myra from having any relationship with Roy. They meet anyway at a romantic night spot. Roy has to go to the front immediately and proposes marriage but wartime circumstances thwart them from marrying immediately. Roy assures Myra that his family will look after her while he is away. Madame Olga learns of Myra’s disobedience and dismisses her from the troupe along with fellow dancer Kitty (Virginia Field) when she scolds Madame for spoiling Myra's happiness.\nThe young women share a small flat and look for work. Myra and Roy’s mother, Lady Margaret Cronin (Lucile Watson), arrange to meet, their first introduction to each other. Awaiting Lady Margaret’s belated arrival at a tea room, Myra scans a newspaper and faints on finding Roy listed among the war dead. Unhappily, the dazed Myra is taking a long drink of wine just as Lady Margaret appears. Unable to disclose the dreadful news, her banal and incoherent conversation shocks her prospective mother-in-law, who withdraws without seeking an explanation. Myra falls ill with grief and to cover all their expenses, Kitty becomes a streetwalker. Belatedly, Myra, who believed that Kitty was working as a stage performer, learns what her friend has done. Feeling that she has alienated Lady Margaret and having no desire to live, the heartbroken Myra joins her friend Kitty as a prostitute to support them both. A year passes.\nWhile offering herself to soldiers on leave arriving at Waterloo station, Myra catches sight of Roy, who is alive and well; he had been wounded and held as a prisoner of war. A reconciliation occurs—a joyous one for Roy, a bittersweet one for Myra. The couple travels to the family estate in Scotland to visit Lady Margaret, who deduces the misunderstanding that occurred at the tea room. Myra is also accepted by Roy's uncle, the Duke (C. Aubrey Smith), but he inadvertently feeds her guilt with assertions that she would never bring shame to the family. Confronted by the impossibility of a happy marriage, breaking off the engagement seems her only choice. Myra discloses the truth to a compassionate Lady Margaret but is unable to believe herself worthy of marrying Roy. Myra leaves behind a goodbye note and returns to London. Roy follows, and with the aid of Kitty, looks for her despite discovering the truth in the process. Myra, depressed and returning to the Waterloo Bridge, takes her own life by walking into the path of a moving truck.\nIn the present, the older Roy reminisces about Myra's sincere final profession of love only for him. He tucks the charm into his coat pocket, gets into his car, and leaves."}