{"mid": "WeirdScience", "IMDB_id": "tt0090305", "title": "Weird Science", "plot": "Nerdy social outcasts Gary Wallace (Anthony Michael Hall) and Wyatt Donnelly (Ilan Mitchell-Smith) are publicly humiliated by Ian (Robert Downey, Jr.) and Max (Robert Rusler) for swooning over their girlfriends Deb (Suzanne Snyder) and Hilly (Judie Aronson). Dejected and disappointed at their direction in life and wanting more, Gary convinces the uptight Wyatt that they need a boost of popularity in order to get their crushes away from Ian and Max. Alone for the weekend with Wyatt's parents gone, Gary is inspired by the 1931 classic Frankenstein to create a virtual girl using Wyatt's computer; infusing her with everything they can conceive to make the perfect dream woman. After hooking electrodes to a doll and hacking into a government computer system for more power, a power surge creates Lisa (Kelly Le Brock), a beautiful and intelligent woman with seemingly endless powers. Promptly, she conjures up a Cadillac convertible to take the boys out to a bar, using her powers to manipulate people into believing Gary and Wyatt are of age. The boys come up with the name Lisa based upon a failed romantic experience of Gary.\nThey return home drunk and happen upon Chet (Bill Paxton), Wyatt's mean older brother, who extorts money from him to buy his silence. Lisa agrees to keep herself hidden from him, but realizes that Gary and Wyatt, while extremely sweet are very uptight and need to unwind. After a humiliating experience at the mall where Max and Ian pour an ICEE beverage on Gary and Wyatt in front of a crowd of people, Lisa tells them about a party at Wyatt's house, of which Wyatt had no prior knowledge, before driving off in a Porsche 928 she conjured for Gary. Despite Wyatt's protests, Lisa insists that the party happen anyway in order to loosen the boys up. She goes to meet Gary's parents, Al and Lucy, who, to Gary's embarrassment, are shocked and dismayed at the things she says and her frank manner. After she pulls a gun on them (later revealed to Gary to be a water pistol), she alters their memories so that Lucy forgets about the conflict; however, Al forgets that they've had a son altogether. Back at the Donnelly house, the party has spun out of control while Gary and Wyatt take refuge in the bathroom where they resolve to have a good time, despite having embarrassed themselves in front of Deb and Hilly. Meanwhile, Wyatt's grandparents arrive and confront Lisa about the party, but she freezes them and hides them in a cupboard. Upstairs in Wyatt's bedroom, Ian and Max convince Gary and Wyatt to recreate the events that created Lisa, but Lisa chides them over their misuse of the magic to impress their tormentors. She also mentions that they forgot to connect the doll; thus, with the bare but live electrodes lying on top of a magazine page showing a Pershing II medium-range ballistic missile, a real missile appears through the house. Lisa resolves that the boys need a challenge to boost their confidence and has a gang of mutant bikers invade the party, causing chaos and sending the boys running.\nThe bikers take Deb and Hilly hostage, and Wyatt and Gary decide they need to save them. They confront the bikers with a new boost of confidence (and Lisa's water pistol) to force them to back down. After they leave peacefully, Gary accidentally fires the gun, which is now real, and their bravery makes Deb and Hilly fall in love with them. The next morning, Chet uncovers the disarray in which the house is — the missile protruding through the kitchen and floor joists and carpet of the bedroom, the kitchen being turned entirely blue, and his catatonic grandparents in the cupboard — before confronting Wyatt and Gary. Lisa tells the boys to escort the girls home while she talks to Chet alone. Gary narrowly escapes being pulled over by the police in a conjured Ferrari, while Wyatt proclaims his love for Hilly before being sprayed by her parent's lawn sprinklers, and both girls reciprocate their feelings to the boys. Returning home, they discover Chet, now transformed into a giant, talking turd, who apologizes to Wyatt for his behavior. Lisa assures them that Chet will return to normal, and realizing that her work is done and that they don't need her anymore, she kisses both Gary and Wyatt before dematerializing and vanishing. As she is leaving all of the disarray is magically transformed back to normal, the missile disappears, the home is restored to its original fastidious state and Chet returns to normal just as Wyatt's parents return home, unaware anything odd has happened at all.\nSometime later at their high school, a gym class of sweaty, pimply adolescent boys waiting for gym-class to begin is met by a beautifully fit coach in spandex. It is revealed to be Lisa who tells the class to \"Drop and give me twenty\", causing all the boys in the class to faint and collapse. She turns to the camera and smiles knowingly."}