{"mid": "WelcomeToTheDollhouse", "IMDB_id": "tt0114906", "title": "Welcome to the Dollhouse", "plot": "Eleven-and-a-half-year-old Dawn Wiener is a shy, unattractive, unpopular seventh grader living in a middle-class suburban community in New Jersey. Her seventeen-year-old brother Mark is a nerdy high school student who plays clarinet in a garage band and shuns girls in order to prepare for college. Dawn's younger sister, eight-year-old Missy, is a spoiled, manipulative little girl who pesters Dawn and dances around the house in a tutu. Their mother dotes on Missy and sides with her in disputes with Dawn. Their father is a meek, immature, selfish man who sides with Dawn's mother in arguments with Dawn. Dawn's only friend is an effeminate fifth-grade boy named Ralphy, with whom she shares a dilapidated clubhouse in her backyard.\nAt school, Dawn is ridiculed and her locker is covered in graffiti. After her teacher unfairly keeps her after school, she is threatened with rape by a bully named Brandon McCarthy, who also has trouble socializing. At home Dawn's mother punishes her for calling Missy a lesbian and refusing to be nice to her. Dawn is suspended for three days after she accidentally hits a teacher in the eye with a spitball. Brandon's first attempt to rape Dawn after school fails, but he orders her to meet him again. After she complies, he takes her to an abandoned field. He starts an earnest conversation with her and kisses her.\nMark's band is joined by Steve Rodgers, a charismatic and handsome aspiring teenage rock musician who agrees to play in the band in exchange for Mark's help in school. Dawn decides to pursue him romantically after he spends time with her, even though one of Steve's former girlfriends tells Dawn she has no chance of being with him.\nDawn and Brandon form an innocent romance, but Brandon is arrested and expelled for suspected drug dealing. Dawn visits his home and meets his father and mentally challenged brother who requires constant supervision. After kissing Dawn, Brandon runs away to avoid being sent to military school.\nAfter angrily rejecting Ralphy, Dawn is left with no friends. When she refuses to tear down her clubhouse to make room for her parents' 20th wedding anniversary party, her mother has Mark and Missy destroy it and gives them her share of a cake. At the party, Dawn intends to proposition Steve, but gets cold feet and is contemptuously rebuffed. Steve plays with Missy, who pushes Dawn into a kiddie pool. That evening, the family watches a videotape of the party, laughing when Dawn falls into the water. That night, Dawn smashes the tape and briefly brandishes her hammer over Missy as she sleeps.\nA few weeks later, Dawn's father's car breaks down and her mother has to pick him up from work. Dawn is supposed to tell Missy to find a ride home from ballet class but chooses not to do so after arguing with her; Missy is kidnapped while walking home. When Missy's tutu is found in Times Square, Dawn goes to New York City to find her. After a full day searching for Missy, Dawn phones home and Mark tells her that Missy was found by police after being abducted by a pedophile neighbor who lives on their street. Dawn returns home to find that her parents did not notice Dawn's absence. Later, Dawn's classmates ridicule her as she presents a thank you speech. After the principal tells the unruly students to be quiet, Dawn musters the emotional strength to finish her speech and makes a quick exit.\nSummer arrives and Dawn is relieved that school is over for the time-being. Mark tells Dawn that she cannot expect school life to get any better until she starts high school. As Dawn's parents continue mistreating and ignoring her, Dawn signs herself up to attend a summer camp in Florida. On a school trip to Walt Disney World, Dawn sits among other girls from her school and joins them in singing the school anthem. Unnoticed, her voice slowly trails off as she sits looking out a bus window."}