{"mid": "WeNeedToTalkAboutKevin", "IMDB_id": "tt1242460", "title": "We Need to Talk About Kevin", "plot": "Eva's narration takes the form of letters written after the massacre to her presumably estranged husband, Franklin Plaskett. In these letters she details her relationship with her husband well before and leading up to their son's conception, followed by the events of Kevin's life up to the school massacre, and her thoughts concerning their relationship. She also admits to a number of events that she tried to keep secret, such as when she lashed out and broke Kevin's arm in a sudden fit of rage. The novel also shows Eva visiting Kevin in prison. These scenes portray their cold, adversarial relationship.\nKevin's behavior throughout the book closely resembles that of a psychopath, although reference to this condition is sparse and left mostly up to the reader's imagination. He displays little to no affection or moral responsibility towards his family or community; indeed, Kevin seems to regard everyone with contempt and hatred. He reserves special loathing for his mother, whom he has antagonized for as long as he can remember. He engages in many acts of petty sabotage from an early age, from seemingly innocent actions like spraying ink with a squirt gun on a room his mother has painstakingly wallpapered in rare maps, to possibly encouraging a girl to gouge her eczema-affected skin. The one activity he takes any pleasure in is archery, having read Robin Hood as a child.\nAs Kevin's behavior worsens, Franklin becomes more defensive of him, convinced that his son is a healthy, normal boy and that there is a reasonable explanation for everything he does. Kevin plays the part of a loving, respectful son whenever Franklin is around, an act that Eva sees through. This creates a rift between Eva and Franklin that never heals; shortly before the massacre, Franklin asks for a divorce.\nKevin's sister Celia is conceived largely because of Eva's need to bond with another member of her family. When Celia is six years old, she is involved in a household accident in which drain cleaner causes her to lose an eye. This is closely linked to an earlier incident involving the disappearance of Celia's pet rodents, after which Eva uses a caustic drain cleaner to clear a blockage in a sink. Two explanations are possible: that Eva left the cleaner sitting within Celia's reach, or that Kevin somehow attacked Celia with it, destroying her eye and scarring her face. Though never proven, Eva strongly believes that Kevin, who was babysitting at the time, poured the Liquid Plumr onto his sister's face, telling her he was cleaning her eye after she got something in it.\nWhen relating the story of the massacre, Eva finally reveals that Franklin and Celia are in fact dead—Kevin killed them both with his bow before traveling to his school to attack nine classmates, a cafeteria worker and a teacher. Eva speculates that he did this because he overheard her and Franklin discussing a divorce; he believed Franklin would get custody of him, thus denying him final victory over his mother.\nThe novel ends on the second anniversary of the massacre, three days before Kevin will turn eighteen and be transferred to Sing Sing. Subdued and frightened, he makes a peace offering of sorts to Eva by giving her Celia's prosthetic eye to bury, and telling her that he's sorry. Eva asks Kevin for the first time why he committed the murders, and Kevin replies that he is no longer sure. They embrace, and Eva concludes that, despite what he did, she still loves her son."}