{"mid": "WestSideStory", "IMDB_id": "tt0055614", "title": "West Side Story", "plot": "=== Act 1 ===\nTwo rival teenage gangs, the Jets (White) and the Sharks (Puerto Rican immigrants), struggle for control of the neighborhood somewhere in the Upper West Side of New York City amidst the police (Prologue). They are warned by Lt. Schrank and Officer Krupke to stop fighting on their beat. The police chase the Sharks off, and then the Jets plan how they can assure their continued dominance of the street. The Jets' leader, Riff, suggests setting up a rumble with the Sharks. He plans to make the challenge to Bernardo, the Sharks' leader, that night at the neighborhood dance. Riff wants to convince his friend and former member of the Jets, Tony, to meet the Jets at the dance. Some of the Jets are unsure of his loyalty, but Riff is adamant that Tony is still one of them (\"Jet Song\"). Riff meets Tony while he's working at Doc's Drugstore to persuade him to come. Tony initially refuses, but Riff wins him over. Tony is convinced that something important is round the corner (\"Something's Coming\").\nMaria works in a bridal shop with Anita, the girlfriend of her brother, Bernardo. Maria has just arrived from Puerto Rico for her arranged marriage to Chino, a friend of Bernardo's. Maria confesses to Anita that she is not in love with Chino. Anita makes Maria a dress to wear to the neighborhood dance.\nAt the dance, after introductions, the teenagers begin to dance; soon a challenge dance is called (\"Dance at the Gym\"), during which Tony and Maria (who aren't taking part in the challenge dance) see each other across the room and are drawn to each other. They dance together, forgetting the tension in the room, and fall in love, but Bernardo pulls his sister from Tony and sends her home. Riff and Bernardo agree to meet for a War Council at Doc's, a drug store which is considered neutral ground, but meanwhile, an infatuated and happy Tony finds Maria's building and serenades her outside her bedroom (\"Maria\"). She appears on her fire escape, and the two profess their love for one another (\"Tonight\"). Meanwhile, Anita, Rosalia, and the other Shark girls discuss the differences between the territory of Puerto Rico and the mainland United States of America, with Anita defending America, and Rosalia yearning for Puerto Rico (\"America\").\nThe Jets get antsy while waiting for the Sharks inside Doc's Drug Store. Riff helps them let out their aggression (\"Cool\"). The Sharks arrive to discuss weapons to use in the rumble. Tony suggests \"a fair fight\" (fists only), which the leaders agree to, despite the other members' protests. Bernardo believes that he will fight Tony, but must settle for fighting Diesel, Riff's second-in-command, instead. This is followed by a monologue by the ineffective Lt. Schrank trying to find out the location of the rumble. Tony tells Doc about Maria. Doc is worried for them while Tony is convinced that nothing can go wrong; he is in love.\nThe next day, Maria is in a very happy mood at the bridal shop, as she anticipates seeing Tony again. However, she learns about the upcoming rumble from Anita and is dismayed. When Tony arrives, Maria asks him to stop the fight altogether, which he agrees to do. Before he goes, they dream of their wedding (\"One Hand, One Heart\"). Tony, Maria, Anita, Bernardo and the Sharks, and Riff and the Jets all anticipate the events to come that night (\"Tonight Quintet\"). The gangs meet under the highway and, as the fight between Bernardo and Diesel begins, Tony arrives and tries to stop it. Though Bernardo taunts Tony, ridiculing his attempt to make peace and provoking him in every way, Tony keeps his composure. When Bernardo pushes Tony, Riff punches him in Tony's defense. The two draw their switchblades and get in a fight (\"The Rumble\"). Tony attempts to intervene, inadvertently leading to Riff being fatally stabbed by Bernardo. Tony kills Bernardo in a fit of rage, which in turn provokes an all-out fight like the fight in the Prologue. The sound of approaching police sirens is heard, and everyone scatters, except Tony, who stands in shock at what he has done. The tomboy Anybodys, who stubbornly wishes that she could become a Jet, tells Tony to flee from the scene at the last moment and flees with the knives. Only the bodies of Riff and Bernardo remain.\n=== Act 2 ===\nBlissfully unaware of the gangs' plans for that night, Maria daydreams about seeing Tony with her friends—Rosalia, Consuelo, Teresita and Francisca (\"I Feel Pretty\"). Later, as Maria dances on the roof happily because she has seen Tony and believes he went to stop the rumble, Chino brings the news that Tony has killed Bernardo. Maria flees to her bedroom, praying that Chino is lying. Tony arrives to see Maria and she initially pounds on his chest with rage, but she still loves him. They plan to run away together. As the walls of Maria's bedroom disappear, they find themselves in a dreamlike world of peace (\"Somewhere\").\nTwo of the Jets, A-Rab and Baby John, are set on by Officer Krupke, but they manage to escape him. They meet the rest of the gang. To cheer themselves up, they lampoon Officer Krupke, and the other adults who don't understand them, (\"Gee Officer Krupke\"). Anybodys arrives and tells the Jets she has been spying on the Puerto Ricans; she has discovered that Chino is looking for Tony with a gun. The gang separates to find Tony. Action accepts Anybodys into the Jets, and includes her in the search.\nA grieving Anita arrives at Maria's apartment. As Tony leaves, he tells Maria to meet him at Doc's so they can run away to the country. In spite of her attempts to conceal it, Anita sees that Tony has been with Maria, and launches an angry tirade against him, (\"A Boy Like That\"). Maria counters by telling Anita how powerful love is, (\"I Have a Love\"), though, and Anita realizes that Maria loves Tony as much as she had loved Bernardo. She admits that Chino has a gun and is looking for Tony.\nLt. Schrank arrives to question Maria about her brother's death, and Anita agrees to go to Doc's to tell Tony to wait. Unfortunately, the Jets, including Anybodys, who have found Tony, have congregated at Doc's, and they taunt Anita with racist slurs and eventually simulate rape. Doc arrives and stops them. Anita is furious, and in anger spitefully delivers the wrong message, telling the Jets that Chino has shot Maria dead.\nDoc relates the news to Tony, who has been dreaming of heading to the countryside to have children with Maria. Feeling there is no longer anything to live for, Tony leaves to find Chino, begging for him to shoot him as well. Just as Tony sees Maria alive, Chino arrives and shoots Tony. The Jets, Sharks, and adults flock around the lovers. Maria holds Tony in her arms (and sings a quiet, brief reprise of \"Somewhere\") as he dies. Angry at the death of another friend, the Jets move towards the Sharks but Maria takes Chino's gun and tells everyone that \"all of [them]\" killed Tony and the others because of their hate for each other, and, \"Now I can kill too, because now I have hate!\" she yells. However, she is unable to bring herself to fire the gun and drops it, crying in grief. Gradually, all the members of both gangs assemble on either side of Tony's body, showing that the feud is over. The Jets and Sharks form a procession, and together carry Tony away, with Maria the last one in the procession."}