{"mid": "WhatANightmareCharlieBrown", "IMDB_id": "tt0076911", "title": "What a Nightmare, Charlie Brown!", "plot": "One winter day, Charlie Brown is trying to pretend to be a musher with Snoopy, but the dog has other ideas and gets Charlie Brown to pull while he has fun riding in the sled. When night comes and they are comfortably indoors, Charlie Brown is indignant that Snoopy is adjusting too well to home life, reminding Snoopy of facts that Arctic dogs are only fed once a day, their meals largely consisting of cold meat and raw fish (to which Snoopy blanches and gives a look of \"it's too bad to be them\") and coming to the conclusion that Snoopy is \"an overly civilized, underly 'dogified' dog\". After making a scrumptious dinner of five pizzas and a large milkshake - all of which he eats himself, Snoopy goes to bed on his doghouse and promptly wakes up to find out that he is now a sled dog of the Iditarod Trail Sled Dog Race in Alaska, presumably during the Klondike Gold Rush or the 1925 serum run to Nome.\nSnoopy is cruelly mistreated by his owner (who is only seen in shadow or silhouette and only speaks in a much deeper version of the classic Peanuts adult \"waa-waa-waa\" language) and his fellow dogs, being run ragged and then denied any food or water. The dogs take turns barking loudly at Snoopy in order to let him know he is indeed an outsider. One scene which breaks the snow scenes is where the sled master stops at a honky tonk, and a hungry Snoopy sneaks inside to snatch a sandwich and a mug of root beer sitting near a piano where he feigns playing The Washington Post March. Snoopy then tries his hand at a game of poker, where he keeps a poker face until he laughs out loud revealing his improbable winning hand of five aces, which causes a brawl and leaving Snoopy to escape into the next room. He then finds himself on stage with a painted backdrop of Paris, France and is cheered for his dancing. However, when the music changes and he impersonates a can-can dancer, the men throw rotten fruit at him. Snoopy is thrown out of the bar and is back with the sled dogs, where he continues to be mistreated, and denied food and water.\nUnable to take anymore, one night Snoopy breaks down crying, then once he's done he goes about converting to his \"new life\" in order to survive, baring his fangs and falls to walking on all fours. Snoopy challenges the lead dog to a fight and wins, becoming the \"Alpha Male\" of the sled dog pack. He also turns the tables on the rest of the dogs by denying them food and water.\nEventually, he leads his owner over an ice-covered lake when the ice cracks and causes all the sled dogs and the owner to be swallowed into the water. Snoopy finds himself being pulled into the hole. As he sinks screaming for his life, Snoopy wakes up clinging to the side of his doghouse and is relieved that he was just having a nightmare.\nSnoopy then wakes Charlie Brown and recounts his nightmare in pantomime, to which Charlie Brown allows Snoopy to spend the night inside with him, but not before Snoopy helps himself to a large ice cream sundae, reminding himself his Arctic experience was indeed just a nightmare."}