{"mid": "WhatLiesBeneath", "IMDB_id": "tt0161081", "title": "What Lies Beneath", "plot": "Claire Spencer (Michelle Pfeiffer) lives in Vermont with her husband Dr. Norman Spencer (Harrison Ford), an accomplished scientist. After dropping her daughter Caitlin (Katharine Towne) off at college, Claire begins to notice the activities of the couple who have moved into the house next door, the Feurs.\nOverhearing Mary Feur (Miranda Otto) sobbing one day, Claire becomes concerned when Mary tells her she is afraid she may disappear. When she sees Mary's husband Warren (James Remar), a colleague of Norman's at the college, dragging a suspicious form in the middle of the night and putting it in the trunk of his car, she suspects he has killed Mary. Claire decides to investigate. After nobody answers the door, Claire soon witnesses strange occurrences when she is alone in the house and becomes convinced that Mary is dead and haunting her. Desperate to reach Mary's spirit, Claire invites her friend Jody (Diana Scarwid) to join her for a séance in her bathroom. Although the séance provides no results, after Jody leaves, Claire finds a message in the bathroom's mirror that reads \"You know\". Hysterical, Claire rushes to the college to confront Warren, but is surprised to see that Mary is with him and has been alive the entire time. Mary visits her the next day and apologizes for the misunderstanding, explaining that she briefly left her husband because of their volatile fights with each other. Claire begins to see a therapist at the urging of Norman, who worries that her mental state is declining because of Caitlin's departure and a car accident Claire suffered a year earlier.\nDespite the resolution with the Feurs, Claire continues to experience strange phenomena in her house. She sees the ghostly image of a woman in the lake from her dock, and finds a silver key beneath the screen of a floor vent. After a picture falls and breaks, Claire notices a newspaper clipping about a missing girl named Madison Elizabeth Frank (Amber Valletta). She learns that Madison attended the university where Norman works, and that the police assumed she simply ran away a year ago. Norman comes home and Claire seduces him as Madison during the tryst, causing Norman to push her away. Claire comes to herself and the memory of her own car accident returns as she remembers that she had caught Norman and Madison together. Distraught by the discovery, she had crashed her car into a tree while driving in a rain storm.\nOutraged by Norman's infidelity, Claire spends the night with Jody, who confirms to Claire that she too had her suspicions of Norman's infidelity when she spotted him with the girl in the nearby town of Adamant. The next morning Claire is called by the police, after Norman is nearly electrocuted by a hair dryer that fell into the bathtub while he was taking a shower. Claire is convinced that it was an attempt by Madison to take revenge, and that her spirit has now been appeased. Norman confesses to Claire that while he did have an affair with the girl, he played no part in her disappearance.\nSeemingly reconciled with Norman, Claire visits Adamant, where she spots the same key-necklace in a shop window along with a chest it unlocks. That night, she dives into the lake and uncovers the box, unlocking it with the key and finding the matching necklace. Norman interrupts her and alters his story: after breaking off his affair with Madison she was so distraught that she committed suicide by overdosing on pills in the Spencer house. In a panic, he placed Madison's body into her car, which he then pushed into the lake, and threw the chest with his matching necklace in it into the lake as well.\nClaire is unmoved by Norman's explanation and tells him the only way to make it right is to notify the police and bring Madison's body up from the lake. Norman pretends to speak with the police on the phone and agrees for an officer to come to the house. When he leaves to take a shower, Claire redials the phone and discovers that he never placed the call. Norman grabs her from behind and sedates her with a paralyzing drug. He drags her to the bathtub and leaves her to drown in the rising water, so that she will appear to have committed suicide. In the midst of this Norman then confesses to Claire that his previous story had been a lie: he killed Madison to prevent her from going to the Dean about the affair and ruining his career. He intimates that he hopes Claire's death will bring him closer to her daughter Caitlin. As he leans in for a final kiss, he spots Madison's necklace around Claire's neck and tries to remove it. Claire's face takes on the image of the dead Madison, and in shock Norman slips on the floor and bangs his head on the rim of the tub, knocking him out.\nClaire, recovering from the paralysis, barely manages to shut the tap off and save herself from drowning. When she regains her strength she finds that Norman is missing from the bathroom floor. She crawls down the stairs to the phone, and notices Norman apparently unconscious, his head bleeding profusely. As she reaches over him and attempts to make a phone call, he grabs her ankle and in a blind panic she rushes out of the house, grabbing the car keys and a cellular phone and driving away in a truck with the couple's sailboat hitched to the back. As she is crossing the bridge over Lake Champlain, Norman bursts through the back window and grabs Claire; she frantically dials 911 and the truck careens down the embankment into the lake.\nUnderwater, Claire escapes out the window, but Norman grabs her leg. A ghost-like decaying body, grabs Norman and forces him to release Claire's leg, allowing Claire to escape. Norman drowns while staring into the dead face of the woman he killed. Madison's body floats to the surface of the lake as the truck dislodges Madison's own sports car.\nThat winter, Claire places a single red rose on Madison's grave."}