{"mid": "WhatAboutBob", "IMDB_id": "tt0103241", "title": "What About Bob?", "plot": "Bob Wiley (Bill Murray) is a good-natured man with great work ethic, but he suffers from multiple phobias and is divorced. He feels good about the results of an initial session with Dr. Leo Marvin (Richard Dreyfuss), a New York psychoanalytical psychiatrist with a huge ego, but is immediately left on his own with a copy of Leo's new book, Baby Steps, when the doctor goes on vacation to Lake Winnipesaukee, New Hampshire for a month. Unable to cope, Bob follows Leo to his vacation home. Leo is annoyed because he does not see patients on vacation but, seeing how desperate Bob is, he gives Bob a prescription telling him to \"take a vacation from his problems.\" Bob seems to have made a breakthrough, but the next morning shows up at Leo's house again and says that he decided to take a vacation both in spirit and in fact. He is staying on at Lake Winnipesaukee as a guest of the Guttmans, a couple who own a coffee shop and are more than happy to have Bob as their guest and encourage him to be around Leo, as they hold a grudge against Dr. Marvin for purchasing the lakeside home they had been scrimping and saving for years to buy.\nBob suggests that they start a friendship, although Leo thinks being friends with a patient is beneath him and attempts to avoid any further contact. However, Bob swiftly ingratiates himself with Leo's family, who think Bob may have some foibles, but is otherwise a balanced and sociable man. Leo's children: Anna (Kathryn Erbe) and Sigmund (Charlie Korsmo) find that Bob relates well to their problems, in contrast with their father's clinical approach, while Bob begins to gain an enjoyment of life from his association with them. Bob goes sailing with Anna and helps Sigmund to dive into the lake, which Leo was unable to help him with. Leo then angrily pushes Bob into the lake and Leo’s wife, Fay, insists on inviting Bob to dinner to apologize, which Bob accepts (as he views Leo's slights against him as accidental and/or part of his therapy). At dinner, Bob's comment on Baby Steps causes Leo to choke, and Bob saves his life by repeatedly and violently landing his full weight on the doctor's prostrated form. A thunderstorm then forces Bob to spend the night. Leo wants Bob out of the house by 6:30, as Good Morning America is arriving at 7 to interview him about Baby Steps. The next morning, however, the television crew shows up early and, oblivious to Leo's discomfort, suggest having Bob on the show as well. Leo is tense and makes a fool out of himself during the interview while Bob is relaxed and speaks glowingly of Leo and the book, unintentionally stealing the spotlight.\nOutraged, Leo throws a tantrum and then attempts to have Bob committed, but Bob is soon released after telling the staff of the institution therapy jokes, easily demonstrating his sanity. Forced to retrieve him, Leo then abandons Bob in the middle of nowhere, but Bob quickly gets a ride back to Leo's house while a variety of mishaps delay Leo until nightfall. Leo is then surprised by the birthday party that Fay has been secretly planning for him, and he is delighted to see his beloved sister Lily. But when Bob appears and puts his arm around Lily, Leo becomes completely enraged and attacks him. Bob remains oblivious to Leo’s hostility, but Fay explains that Leo has been acting unacceptably as a result of an inexplicable grudge against Bob, and he agrees to leave. Meanwhile, Leo breaks into the town's general store, stealing a shotgun and 20 pounds of explosives. Bob becomes terrified while walking through the dark woods and is kidnapped at gunpoint by Leo, who leads him deep into the woods, ties him up, and straps the explosives onto him, calling it \"death therapy.\" Leo then returns to the house, gleefully preparing his cover story. Believing the explosives to be props and used as a metaphor for his problems, Bob applies Leo's \"Baby Steps\" approach and manages to free himself both of his physical restraints and his fears; he reunites with Leo and his family, praising Leo for curing him with \"death therapy.\" A frantic Leo asks Bob where he put the black powder, to which Bob replies \"in the house\" just before the Marvins' vacation home detonates. The shock leaves Leo in a catatonic state.\nSome time later, the still-catatonic Leo is brought to Bob and Lily's wedding. Upon their pronouncement as husband and wife, Leo regains his senses and screams, \"No!\" but the sentiment is lost in the family's excitement at his recovery. Text at the end reveals that Bob went back to school and became a psychologist, then wrote a best selling book titled Death Therapy, and that Leo is suing him for the rights."}