{"mid": "WhatsCookinDoc", "IMDB_id": "tt0037457", "title": "What's Cookin' Doc?", "plot": "The plot centers on the Academy Awards presentation. The action begins with actual color film footage of various Hollywood scenes (edited from A Star Is Born), narrated by Robert C. Bruce. It leads up to the Big Question of the evening: Who will win \"the\" Oscar? The film shows the stereotypical red carpet arrivals of stars, as well as a human emcee starting to introduce the Oscar show.\nAt this point the film switches to animation, with the shadow of a now-animated emcee (and now voiced by Mel Blanc) continuing to introduce the Oscar, and Bugs (also Mel Blanc's voice, as usual) assuring the viewer that \"it's in da bag; I'm a cinch to win\". Bugs is stunned when the award goes instead to James Cagney (who had actually won in the previous year's ceremony, for Warner's Yankee Doodle Dandy). Shock turns to anger as Bugs declares the results to be \"sa-bo-TAH-gee\" and demands a recount.\nBugs then tries to make his case by showing clips from Hiawatha's Rabbit Hunt (which includes clip of Hiawatha attempting to \"cook\" the rabbit) as proof of his allegedly superior acting (an inside joke, as the cartoon had actually been nominated for an Oscar and lost). He hurls a set of film cans off-screen and tells someone named \"Smokey\" to \"roll 'em!\" Bugs tells the audience that these are some of his \"best scenes\". Immediately a \"stag reel\" (with the title card depicting a grinning stag) starts to roll, and the startled Bugs quickly stops it and switches to the right film.\nFinally, he pleads with the audience, \"What do you say, folks? Do I get it? Or do I get it?\" (echoing Fredric March's drunken appeal to the Academy Award banquet audience in A Star Is Born). The emcee asks the audience (in an affected nasal voice), \"Shall we give it to him, folks?\" and they yell, \"Yeah, let's give it to him!\" whereupon they shower Bugs with fruits and vegetables (enabling him to briefly do a Carmen Miranda impression)... and an ersatz Oscar labeled \"booby prize\", which is actually a gold-plated rabbit statue. Bugs is so pleased at winning it, he remarks, \"I'll even take youse to bed wit' me every night!\" The statue suddenly comes alive, asks in a voice like that of radio character, Bert Gordon, \"Do you mean it?\", smooches the startled bunny, and takes on an effeminate, hip-swiveling pose. The screen fades out, Clampett's famous vocalized \"Bay-woop!\" is heard, and the \"That's all, Folks!\" card appears."}