{"mid": "WhenDinosaursRuledTheEarth", "IMDB_id": "tt0066561", "title": "When Dinosaurs Ruled the Earth", "plot": "A tribe on a cliff are about to sacrifice three blonde women. Three priests, wearing dinosaur hides, are about to kill them for their Sun God, but one of them, Sanna, escapes and jumps off the cliff. She is rescued by Tara and some men on a raft.\nTara takes Sanna to his seaside tribe, who also worship the Sun God. After building a hut for herself, She joins them at a feast and celebration of a successful hunt. An Elasmosaurus attacks the seaside tribe until it is lured to a store of oil and immolated. The feast continues, and a brunette woman, Ayak, is interested in Tara, but he is too fascinated with Sanna. He brings her food. After a ritual fight between Sanna and Ayak in the water, Sanna's former tribe arrives, looking for her. She flees and they give chase. Hiding in a tree, a large boa sees her, but attacks and kills one of the men instead. They think Sanna is in a nearby cave, but a Chasmosaurus makes its lair there and disembowels one man before injuring another with a deep gash. Vultures, drawn by the carcasses, jab, bite and slash at the wounded man. When Tara seeks Sanna, he finds the one man dead and, after the Chasmosaurus charges him. He is chased to a cliff, where he hides on a small ledge as the Chasmosaurus loses its footing and plunges to its death.\nA funeral pyre at the shore is followed by a tribal frenzy during which an enraged Ayak burns down Sanna's hut. Sanna meanwhile, running through a rainforest, sees a reptile and runs before it notices her. She becomes trapped by a carnivorous plant, and she cuts off her hair to escape. Tara unfortunately thinks Sanna has been eaten by the carnivorous plant.\nSanna sleeps in a large Megalosaurus eggshell. The other egg hatches, and the Megalosaurus (of a nonexistent species of quadrupedal predator — all predatory dinosaurs are bipedal by default) thinks Sanna is its sibling. The parent, thinking Sanna is one of its own, brings her a deer carcass. Sanna, enamored by the beast, plays hide-and-seek with it, and teaches it to sit. She dives into a nearby lake and catches a fish in her teeth. She returns and finds the mother Megalosaurus in a fight with two men, but she distracts it so they can escape.\nWhile Tara is hiking back to his tribe after getting a drink of water, he is carried off by a giant Rhamphorhynchus with a thirty-foot wingspan. At its nest, he kills it by ripping its wing, and then knocking it off its nest when it lands. Tara sees Sanna being followed by the Megalosaurus and assumes she is being chased, but he runs to her and finds she has domesticated it. They reunite at Sanna's cave where they express their love for one another and have passionate sex.\nThey are seen by a lookout, however, and when Tara returns to the tribe he is sacrificed to another Elasmosaurus. Ayak cries as he is set adrift on a burning raft to the animal, held in place by another woman and forced to watch. However, when they are gone, he re-emerges from the water still alive. Seeing they have left and somehow having evaded the beast, he escapes to Sanna.\nBut the tribe is still searching for Sanna, and see smoke from her fire. The two run away into a forest, where Sanna's dinosaur \"parent\" rescues her, but as for Tara they prepare to burn him again. Giant fiddler crabs kill and consume a few people as the weather grows ominous again. The Moon seems to be forming, and a tidal wave looms. Sanna arrives to save Tara from one of the giant crabs, and a raft escape begins to take shape. The tribal leader tries commanding the water to heel, and is swept away and (presumably) drowns. While Ayak is running on the sand, she steps into a trap of quicksand and is sucked down to her death. Giant waves hit the shore, but Tara, Sanna and a few others survive on a raft. As the waters calm, the survivors stop to witness a lunar eclipse, as the Moon exists."}