{"mid": "WhenHarryMetSally", "IMDB_id": "tt0098635", "title": "When Harry Met Sally...", "plot": "In 1977, Harry Burns (Billy Crystal) and Sally Albright (Meg Ryan) graduate from the University of Chicago and share the drive to New York City, where Sally is beginning journalism school and Harry is starting a career. Harry is dating a friend of Sally's, Amanda (Michelle Nicastro). During the drive, they discuss their differing ideas about relationships between men and women. Harry says that \"Men and women can't be friends because the sex part always gets in the way.\" Sally disagrees, claiming that men and women can be strictly friends without sex. During a stop in a diner, Sally is angered when Harry tells her she is attractive; she accuses him of making a pass at her. In New York, they part on unfriendly terms.\nFive years later, Harry and Sally find themselves on the same flight. Sally has just started dating a man named Joe (Steven Ford) – who is a neighbor of Harry's – and Harry is engaged to a woman named Helen, which surprises Sally. Harry suggests they become friends, forcing him to qualify his previous \"rule\" about the impossibility of male-female friendships. Despite Harry's suggestions of exceptions to that rule, they separate, concluding that they will not be friends.\nHarry and Sally run into each other again in a bookstore five years later. They have coffee and talk about their previous relationships; Sally and Joe broke up because she wanted a family and he did not want to marry, and Harry's relationship ended when Helen fell in love with another man. They take a walk and decide to be friends. They have late-night phone conversations, go to dinner, and spend time together. Their dating experiences with others continue to inform their differing approaches to relationships and sex.\nDuring a New Year's Eve party, Harry and Sally find themselves attracted to each other. Though they remain friends, they set each other up with their respective best friends, Marie (Carrie Fisher) and Jess (Bruno Kirby). When the four go to a restaurant, Marie and Jess hit it off; they later become engaged. One night, over the phone, Sally tearfully tells Harry that her ex is getting married. He rushes to her apartment to comfort her, and they unexpectedly have sex, resulting in an awkward moment the next morning as Harry leaves in a state of distress. This creates tension in their relationship. Their friendship cools for three weeks until the two have a heated argument during Jess and Marie's wedding dinner. Following this fight, Harry repeatedly attempts to mend his friendship with Sally, but she feels that they cannot be friends after what happened.\nAt a New Year's Eve party that year, Sally feels alone without Harry by her side. Harry spends New Year's alone, walking around the city. As Sally decides to leave the party early, Harry appears and declares his love for her. At first, she argues that the only reason he is there is because he is lonely, but he disagrees and lists the many things he realized he loves about her. They make up and kiss and marry three months later."}