{"mid": "WhenGoodGhoulsGoBad", "IMDB_id": "tt0279513", "title": "When Good Ghouls Go Bad", "plot": "Danny Walker (Joe Pichler), and his father James (Tom Amandes), who has gotten a divorce from his wife, have just moved to the town from Chicago so his father can fulfill his dream of re-opening the family chocolate factory. Danny and James are staying with James' father, known by all as \"Uncle Fred\" (Christopher Lloyd). Uncle Fred is considered crazy and is a bit childish, but Danny loves him very much. Danny dislikes his new life in Walker Falls, and it seems no one likes him, especially the football coach Mike Kankel (Joe Clements) and his son Ryan (Craig Marriott), the school's biggest bully. The only person who seems to be nice to Danny is Taylor Morgan (Imelda Corcoran), the school nurse and James' childhood friend.\nDanny is surprised by how few decorations are up with Halloween only a week away. The people of Walker Falls do not seem to be making any effort at all to celebrate the holiday. Sheriff Ed Frady (Alan Flower) even takes down the decorations that Danny puts up. When walking home from school, Ryan and his pal, Leo (Daniel Karr) push him into the cemetery, lock the gate, and tell him that Walker Falls does not celebrate Halloween because of the legend of a curse. Years ago, Curtis Danko (Brendan McCarthy) was an artistic boy, who was ostracized by \"normal\" people. When competition was held for all the eighth graders to design a sculpture of their personal hero, Curtis kept his project covered during the day, then came to school at night to work by the light of captured fireflies. On Halloween night, he went to work on his sculpture, and Mike Kankel and his friends were walking by when they saw Curtis from the window. When Kankel returned the next day, he noticed the kiln had been on all night. He opened the door and found Curtis's charred skeleton and a message in the ashes, saying that if the town ever celebrated another Halloween, he would come back and destroy them. Kankel was blind for three days after seeing Curtis' finished statue. He said it was like being face to face with the devil himself. Everyone in the town believed the legend and, since then, Halloween has never been celebrated.\nDanny thinks it is a silly story, and runs home. James is rarely around, so Uncle Fred has served as a stand-in father for Danny. That night, James is planning to announce his \"Halloween Spooktacular\" idea to raise funds to re-open Walker Chocolates at the town meeting. Uncle Fred and Danny try to tell him that the townspeople will be too afraid to support the spooktacular because of the curse, but James doesn't listen.\nAt the meeting, Mayor Churney (Roy Billing) announces his campaign for re-election. Running against him is Kankel. After the announcements, it is James' turn. He is surprised to find the people of Walker Falls shudder at just the mention of Halloween. To bring the conversation back on track, his secretary passes out samples of chocolate, but the audience isn't very enthusiastic. The meeting ends after all but a few leave the town hall. Danny's father is very upset when he learns about the legend, which has completely ruined his plans. He decides to cancel the spooktacular and get funds elsewhere.\nUncle Fred then reveals why no one likes Danny. Uncle Fred was responsible for building the kiln that killed Curtis. That night, Danny dreams he is at Curtis's crypt and sees the cloth being ripped off the statue. That morning, there is a commotion outside the house. A large pile of pumpkins has been discovered in the town center. It finally looks like Walker Falls might celebrate another Halloween. But when Uncle Fred lifts a pumpkin as he says: \"Happy Halloween\", the entire pile rolls on top of him, killing him. Everyone in town is at Uncle Fred's funeral and Danny is very sad. As a memento, he lets his grandfather's favorite car shoot down the track and rest with his coffin.\nHowever, because of Uncle Fred's love of Halloween, the magic in the cemetery allows him to return as a zombie. Unfortunately, that same magic awoke others from their slumber, including Curtis. The zombies begin capturing all the townsfolk and gathering them to the creepy old Victorian style house chanting the phrase \"Statue.\" Meanwhile, Danny and his crush, Dayna Stenson (Brittany Byrnes) try to explain to James and Nurse Taylor the situation. Uncle Fred reveals his zombie self to his son and Nurse Taylor, both fainting in the process. Zombies break into the house and Uncle Fred explains that Curtis might be behind the zombies awakening and tells them to escape while he holds the other zombies off. Unfortunately, he, his son, and Nurse Taylor are all captured, one of the zombies stating that Uncle Fred was the main part of the plan.\nWhen everyone is gathered, Curtis reveals himself to the people. As he is about to reveal his statue, he is attacked and literally torn apart by Kankel. However, because Curtis is a zombie, he manages himself to pull himself together, and scare the wits out of Kankel. As Curtis pulls off the shroud off his statue, everyone covers their eyes in fear. Surprisingly, nothing happens. Everyone uncovers their eyes and Curtis' statue is revealed to be of Uncle Fred. Curtis then shows Uncle Fred a picture of the two of them, Uncle Fred shaking Curtis' hand, as it implied that Curtis looked up to him. Uncle Fred, still guilty about Curtis' death, wonders why he was a hero to Curtis as it was his kiln that killed him. Curtis then turns to Kankel and points to him, naming him as his killer.\nKankel confesses that the night Curtis died, he was working on the statue of Uncle Fred and as a prank to scare him, Kankel, Frady, and his group pushed Curtis into the kiln and locked him in it then taunting him. Suddenly, the janitor appeared and Kankel's group ran off. While cleaning the class, the janitor accidentally turned on the kiln not realizing Curtis was in it. The next day, Kankel went inside the kiln and saw Curtis' corpse as well as the completed statue of Uncle Fred. To hide his crime, he made up the curse as pretending his eyes were burned when he saw the statue to make it seem like it was Curtis' doing. Kankel also reveals that the statue of Uncle Fred would have been voted to be put in town square, instead of Kankel's statue of his father. It's revealed that Uncle Fred donated much time and money to the town's children, promoting creativity and imagination; thus, he was loved by many children; explaining why he was called \"Uncle Fred\" and why much of his actions were seen as childish to some. Kankel wouldn't stand for someone to promote things that were \"girly\" and wanted things \"manly.\" However, Kankel's action earns him the wrath of his father Pops Kankel (Gordon Boyd), who is among the group of zombies and is upset at what he has done. He then grabs his son's ear and drags him out to \"punish\" him.\nBy the end, the zombies and the townspeople applaud Curtis' statue. With that, Curtis has accomplished what he's done and bids farewell to the town, disappearing into the night, returning to his crypt to finally rest. Meanwhile, the other zombies bid farewell. Uncle Fred reconciles with his son, James, saying this will be the last time he will see him on Earth, but he'll always be watching him on the other side. He then leaves with his wife (Jenny Dibley) and the two join the other zombies, sharing one final dance with the fireflies, as all the entities slowly disappear dancing into the night. Danny and Dayna share a kiss, while James and Taylor hold hands as they watch the dancing zombies fade into the night.\nBy the end, German investors that spoke to James earlier loved the concept of Halloween and decide to support him into reopening the family chocolate factory within two weeks. On Halloween day, children are seen dressing up in costumes and going trick-or-treating as a girl from one of the Halloween groups goes to Uncle Fred's statue in town square, where they're passing by, and says: \"Happy Halloween.\" Then, after the girl leaves, Uncle Fred's voice is heard one last time replying back: \"Happy Halloween.\""}