{"mid": "WhereTheRedFernGrows", "IMDB_id": "tt0072402", "title": "Where the Red Fern Grows", "plot": "When leaving work in Idaho's Snake River Valley, Billy Colman sees a pack of dogs attacking a stray coonhound. He chases the pack away and takes the stray home to feed it. Once it has rested, Billy sets it free, knowing that it will return home.\nThe experience reminds Billy of his childhood growing up in the Ozark Mountains of Oklahoma. He wants a dog, and his parents offer to get him a crossbred puppy from a neighbor's litter. He tells them he wants two coonhounds, but his parents tell him they cannot afford them. Billy finds a magazine ad for a Kentucky kennel which breeds Redbone Coonhounds and sells them for $25 each. He goes to work performing odd jobs such as selling vegetables to local fishermen and saves the $50 he needs with the help of his grandfather. However, since it takes two years to do so, his grandfather writes ahead to see if the kennel will honor the ad. They do, and the price has dropped so the two puppies only cost $40.\nSince the mail buggy does not deliver live creatures, Billy's dogs are delivered to the freight depot in Tahlequah. His family does not have transportation, so he finds his own way to get to the depot and chooses to go through the hills. He picks up and leaves with his puppies, which are a male and a female. He buys a gift for each member of his family with his extra $10 before heading back home.\nOn the way back home, he spends the night in Robber's Cave in the Sparrow Hawk Mountains. There he builds a fire and plays with the puppies. While trying to sleep, he hears a noise that he realizes is the cry of a mountain lion. In the morning, he continues on. He comes to a sycamore tree and sees the names Dan and Ann carved inside a heart in the bark and decides to name the puppies Old Dan and Little Ann.\nTo train Old Dan and Little Ann, Billy traps a raccoon with the help of his grandfather and uses its pelt to teach them to hunt. During their training, their personalities become apparent: Old Dan is brave and strong, while Little Ann is very intelligent. Both are very loyal to each other and to Billy.\nOn the first night of hunting season, Billy takes Old Dan and Little Ann out for their first hunt. He promises them that if they tree a raccoon, he will do the rest. They tree one in a large sycamore, which Billy had previously nicknamed \"The Big Tree\". As he tries to call them off, they look at him sadly and he cuts the tree down, which takes him two days and costs him blistered hands. In the end, when he's about to give up his effort, Billy offers a short prayer for strength to continue. A strong wind starts to blow and the tree falls. Old Dan and Little Ann take the raccoon down.\nBilly, Old Dan, and Little Ann go hunting almost every night. As months go by, he brings more fur to his grandfather's store than any other hunter, and the stories of his dogs spread throughout the Ozarks. He and his grandfather make a bet with Rubin and Rainie Pritchard, that his dogs can catch the legendary \"ghost coon\". Rubin and Rainie set out with him to see if Old Dan and Little Ann can do so. It leads them on a long, complicated chase, and Rubin and Rainie want to give up. Finally, when they have it treed, Billy refuses to kill it. Rubin then orders his dog, Old Blue, to attack Old Dan, who is smaller; and Rubin starts to beat Billy to stop him from interfering. Little Ann then helps Old Dan, and together they injure Old Blue; Rubin runs to attack them with an axe, but he trips on it and kills himself.\nA few weeks later, Billy's grandfather enters him into a championship raccoon hunt, putting him against experienced hunters and the finest dogs in the country. Before it starts, he enters Little Ann into a contest for the best-looking dog, where and she wins the silver cup. On the fourth night of the hunt, Old Dan and Little Ann tree three raccoons, making it to the final round. The sixth night, they tree one before a blizzard hits. Billy, his father, grandfather, and the judge lose sight of the dogs. When they finally find them, Billy's grandfather sprains his ankle. They build a fire, and when Billy's father chops down a tree, three raccoons jump out. Old Dan and Little Ann take two of them down, and chase the third one to another tree. In the morning, the hunters find them covered with ice circling the bottom of a tree. The last raccoon wins them the championship and the gold cup. The hunters also present them with $300 of jackpot money.\nBilly's mother and sisters are overjoyed with the prizes. He continues hunting. One night Old Dan and Little Ann tree a mountain lion, and it attacks. Billy enters the fight with his axe, hoping to save his dogs, but they end up having to save him. Eventually, they kill the mountain lion, but Old Dan is badly wounded, and Billy finds his intestines in a bush. He dies late that night. Billy is heartbroken, and Little Ann loses the will to live, stops eating, and dies of grief a few days later on Old Dan's grave. Billy's father tries to tell him that it is all for the best, because with the money they received from winning the championship hunt, they can move to town. He goes to visit Old Dan and Little Ann's graves and finds a giant red fern between them. According to Native American legend, only an angel can plant one. He and his family look at it in awe, and he feels ready to move on knowing that his dogs are always going to be remembered."}