{"mid": "WhiteTiger", "IMDB_id": "tt0118159", "title": "White Tiger", "plot": "It is World War II. After a battle, a tank operator is found in a destroyed Soviet tank. Miraculously recovering from burns on 90 percent of his body, he suffers amnesia and cannot recall his identity. He receives a new passport in the name Naydёnov (from the Russian word for \"found\"), and is returned to duty. Naydёnov believes he has the ability to communicate with tanks as if they were people, though he tries not to advertise this. He is also recognized as the best tank driver in his army group.\nIn the meantime, rumors arise about a new, invincible Nazi tank that appears seemingly out of nowhere and disappears just as quickly, destroying dozens of Soviet tanks in the process. This mysterious enemy tank is dubbed \"White Tiger\" by the Soviet forces.\nNaydёnov believes it is this tank that nearly killed him, and he is out for revenge. Given his skills, Naydёnov is ordered to locate and destroy this White Tiger. Naydёnov is convinced that the enemy tank is unpiloted, being essentially a ghost of war. The counterintelligence officer assigned to tracking down the White Tiger, who helps Naydёnov, comes to believe the latter's interpretation.\nDuring a subsequent military action, Naydёnov's tank comes upon the White Tiger tank in an abandoned village and engages it in battle. The White Tiger is damaged but not destroyed, and manages to escape. The counterintelligence officer then attempts to convince his commanding general that both the tank and the \"born again\" Naydёnov are creations not of man, but of the war itself. The general is unconvinced.\nAfter the fall of Nazi Germany, the counterintelligence officer meets Naydёnov in a field and tries to convince him that the war is over, but the latter disagrees, saying that the war will not truly end until the White Tiger is destroyed. The White Tiger has gone into hiding, but, Naydёnov claims, it is inevitable that sooner or later it will come back unless it is eradicated. This reveals to the viewer that the White Tiger is a metaphor for war itself, and that Naydёnov is a symbol of all men who have been torn by war but have, as a result, acquired an iron-will conviction to oppose war in any of its forms. Naydёnov then mysteriously vanishes into thin air along with his tank, presumably having gone in search of the White Tiger.\nIn the final scene of the film, Hitler is shown seated in a large room with a fireplace (Hell), talking to a stranger (the Incarnation of Satan) and defending his actions during the war."}