{"mid": "WhiteMansBurden", "IMDB_id": "tt0114928", "title": "White Man's Burden", "plot": "The movie begins with a dinner engagement at the Thomas residence. Thaddeus Thomas (Harry Belafonte), a wealthy CEO, prompts a discussion about White people and claims they are \"genetically inferior\" because the children grow up without fathers. In this alternative reality, the lower class consists of White Americans as the large percentage of minorities who live in rundown and crime-infested ghetto communities, and face prejudice from the broader society; while the comfortable middle to upper class is predominantly made of African Americans. The African Americans in the film are dominant in employment, business, and entertainment and they often refer condescendingly to how white children live in poverty and unfortunate conditions. The rich Thomas family are horrified and struggle to be polite in the presence of poor white people.\nIn an effort to go above and beyond in his position, Louis Pinnacle (John Travolta), a struggling factory worker hoping for a promotion in the candy factory, offers to deliver a package after his shift. He delivers the package to successful CEO Thaddeus Thomas, who lives in a wealthy upper-class community predominantly of blacks. Pinnock is let into the property by a white servant at the security gate point in front of the Thomas residence and accidentally views Thaddeus's wife naked while dressing in her bedroom through the window. Thaddeus notices and complains to the VP at the factory, during a dinner engagement at his house, that he would prefer a different delivery man instead of a \"Peeping Tom\" to visit his house next time. Although Thaddeus doesn't suggest any form of punishment towards Pinnock, the VP \"gets the message\" and immediately fires Pinnock anyway. Pinnock returns to the Thomas residence in an attempt to discuss the misunderstanding with Thaddeus, but because Thaddeus was in an important business meeting, he refuses and sends a message to Pinnock that he apologizes but there's nothing he can do to help him. Pinnock begs for two minutes of his time, but is abruptly turned away.\nWithout any education or advanced skills, Pinnock finds difficulty getting a job and is unable to support his family. The Pinnock family are awakened one early morning by the police who is accompanied by the landlord to enforce the eviction from the house; in mid-chaos the family struggle to gather their important belongings as they vacate the premises. Pinnock's mother-in-law scolds and belittles Louis for being a failure of a man and not taking care of his family; she clearly states there is not enough room for him at her house and his wife and the two kids leave to live with her.\nAs if the situation could not get worse, Louis's truck breaks down and he is forced to walk. Feeling down and lonely in the midst of the night, Louis is aggressively apprehended by the police who mistaken him for a bank robber because \"he fit the description.\" The people inside the bar come outside and shout at the police, demanding that they leave Pinnock alone. Pinnock is brutally beaten by the police for causing a commotion and the police are chased away, as beer bottles are being thrown by the angry mob.\nIn a radical quest for justice, Pinnock waits outside the Thomas residence again and kidnaps Thomas at gun point and demands for a large sum of money that is owed for losing his job. After multiple failed attempts for withdrawing the money, Pinnock holds Thomas hostage for the weekend and takes him through the ghetto where he lives. of Thomas is not sympathetic to Pinnock and calls him a failure who blames the world for his problems. But Pinnock takes on Thomas through the ghetto where he lives, and Thomas alternates between enjoying some of the staples of ghetto life (Pinnock shows him how to use salt to enhance the flavor of ketchup with French fries) and having his eyes open to this world's racism (black cops are hostile to Pinnock, treat him like a criminal when he's done nothing wrong, and eventually beat him up for no good reason). In the end, though mistaken for carrying a weapon, Pinnock is shot and killed by the police in an attempt to call for help for Thomas who is in desperate need for medical attention because of breathing problems. The chastened CEO visits Pinnock's grieving widow and offers her the money Louis lost when he was fired. She refuses it, and when Thomas awkwardly asks if she wants more, she bluntly says \"How much would ever be enough?\" and closes the door in his face as the movie ends."}