{"mid": "WhyCharlieBrownWhy", "IMDB_id": "tt0123325", "title": "Why, Charlie Brown, Why?", "plot": "Janice Emmons is a new friend and classmate of Charlie Brown and Linus, who loves to play on the swings. The special begins with Charlie Brown, Sally, Linus and Janice waiting for the school bus. As Janice boards the bus, she hits her arm on a railing, causing it to bruise; Linus notices that Janice has been bruising easily lately. When they arrive at school, Janice starts feeling ill. She tells Linus that she is feeling tired and has a fever, so she is sent to the school nurse and is later picked up by her mother. Three days later, the class is told that Janice is in the hospital.\nAfter school, Linus and Charlie Brown decide to visit Janice in the hospital, where she tells them that she has cancer (specifically leukemia). Janice explains what tests the doctors did to discover that she had leukemia (blood test, bone marrow test and X-ray). She then shows them her IV line and explains her chemotherapy. Despite her illness, Janice is determined to recover and return to school, so she can play on the swings and be with her friends again.\nThe news of Janice's illness hits Linus especially hard, as he appears to be falling for her. As Charlie Brown and Linus leave the hospital, Linus asks: \"Why, Charlie Brown, Why?\". He then walks home feeling both sad and angry, thinking about Janice's condition. When he arrives home, he challenges the ignorance of his sister Lucy towards Janice's illness and tells her cancer doesn't spread like the cold or flu. Some months later, Janice's health has improved enough for her to return to school, but she has lost her hair because of the chemotherapy, and wears a cap to cover her bald head.\nAt school, this attracts the attention of a schoolyard bully, who teases Janice for her baldness. Linus stands up for Janice and confronts the boy, angrily telling him about Janice's illness and asking him if he would like to go through what Janice has gone through. Then, the boy apologizes to Janice and Linus. As Christmas approaches, Linus goes to Janice's house to give her a present, but one of Janice's two sisters informs Linus that she is at the hospital again, receiving treatment. The other sister complains of the attention Janice has been receiving, and later admits she and her other sister feel left out since Janice got sick. Linus gives her the present and leaves.\nBy the beginning of spring, Janice returns again and tells Linus she has a surprise for him, and she reveals the surprise at the end of the special while playing on the swings. The surprise fills Linus with joy, as Janice's cap falls off revealing that her long blond hair has grown back even longer than it was before, marking the end of her chemotherapy, and presumably meaning that she has recovered. As the credits roll, the cap falls to the ground, and Janice laughs for the last time."}