{"mid": "WildBill", "IMDB_id": "tt0114938", "title": "Wild Bill", "plot": "Bill (Charlie Creed-Miles) is released from prison on parole after serving 8 years for East London drug lord Glen (Andy Serkis). He returns to find his sons, 15-year-old Dean (Will Poulter) and 11-year-old Jimmy (Sammy Williams), have been abandoned by their mother, who moved to Spain with her boyfriend. Dean has dropped out of high school and is working on a construction site to make a living. Bill is followed to the local pub by his former friends Dickie (Neil Maskell) and Terry (Leo Gregory). They offer him another job working for Glen, but he turns it down due to his parole. Bill ends up getting drunk with his former associates and is given a bag by Terry containing an undetermined amount of cocaine. Bill is dropped round Dean and Jimmy's house by Pill and Dickie who explain to them both that Bill is their old man and he's back on the outside. Upon waking up, Dean makes it clear he doesn't want any involvement with Bill and he's to have left the house by the time he returns home from work. Bill goes to visit his parole officer Kelly (Olivia Williams), who, upon hearing that Dean and Jimmy were living by themselves, sends social services to the flat. Bill comes home and Dean forces him to stay, requistioning his drugs and putting Bill's plans to move to Scotland and work with his friend on hold.\nBill walks Jimmy to school and meets the principal, who suspects Jimmy ditched school and broke all the school's windows. Bill lies that Jimmy went to visit his dying grandmother and the principal believes him. Jimmy and his friend Boz (Aaron Ishmael) sneak out of school and hang out with Terry and Pill (Iwan Rheon). They let Jimmy smoke pot and send him home with drugs informing him that they wish to use him as a mule to sell their supply. Jimmy naively agrees. Meanwhile, Dean attempts to start a relationship with Steph (Charlotte Spencer), a single mum and Pill's ex-girlfriend, who lives with her unemployed dad (Marc Warren). Bill meets Terry again and begins a friendship with his girlfriend Roxy (Liz White). Bill begins working as a sign holder and is mocked by Terry and Dickie who continually warn him that he needs to be leaving the estate as his presence is causing problems amongst the local faces and is affecting business. Using the money earned from his new job, Bill is able to buy food for him and his sons. He begins to clean the flat and slowly bonds with his younger son, Jimmy. They fly paper aeroplanes out of their high-rise flat and play with remote control cars and Dean begins to see that his dad is trying to make amends for not being there when they needed him.\nOn Dean's 16th birthday, Bill goes to make a cake for him. He meets Roxy, who tells him a cake won't be a good present and offers an idea. Dean comes home from work and Bill offers to show him a surprise. He leads Dean to his bedroom, where Roxy is lying on his bed. He demands that Bill kick her out and they argue, until social services arrives to visit. Before they can check Dean's room, they decide to leave. The next day, Terry and Dickie begin cooking crack cocaine, whilst Roxy observes. Jimmy and Boz visit Terry, who gives them several bags of crack to sell. As they walk back to the estate, a police car stops and an officer talks to Boz. Panicking, Jimmy dumps the crack into the sewer and leaves without Boz. Dean asks Steph out and she invites him to her house the next night. They are hilariously interrupted by her drunk father and they both agree to see each other again. Jimmy breaks into the house unbeknowst to Steph and Dean and steals a tin of Steph's money in a feeble attempt to coerce Terry into taking pity on him for losing his drugs. Jimmy is caught by Terry, who attempts to break his hand as Roxy begs them to stop. She threatens to leave and Dickie hits her. They let Jimmy go, but threaten him and demand he will have to work off what he owes.\nThe next day, Roxy comes to the flat and asks Bill if she can hide with them. As Dean heads to work, he is confronted by Steph, who demands the money. He denies taking it, but she slaps him and leaves. Roxy tells Bill that Jimmy is selling drugs for Terry and his men. Bill confronts Pill and another drug dealer. As he attacks them, he sees Jimmy running away. He chases Jimmy to the top of a building, where Bill used to hide as a child, and begs him not to work for Terry. Jimmy decides to stop and goes home with Bill. Bill offers to sort out Jimmy's problems and warns him about the dangers of drug dealing and the likelihood he will end up in prison just as he did. They return the money to Steph who asks Bill if Dean hates her. He responds jokingly; \"With a passion.\"\nSocial services visit and make Bill sign a document that will put him in charge of his sons, until Dean turns 18. Upon returning her money, Steph comes over to visit and Bill suggests to Roxy and Jimmy they get Chinese whilst Dean and Steph talk. Roxy and Jimmy go into the shop, while Bill waits outside. One of Terry's men watches in a car and a young boy approaches Bill. He tells Bill that Terry wants to meet with Bill at the pub the next morning, but doesn't tell Bill that they plan to kill him. Bill agrees to visit having promised Jimmy he will sort out his problems. Bill spends the night with Roxy, Steph and his sons.\nThe next morning, he heads to the pub and finds Terry sitting with Dickie and Pill at a table. He orders a coke and sees more men sitting around the pub. He realises what they have done and begins to exchange insults with Terry. Discretely as Terry tells Bill what he intends to do with Jimmy, the pub's owner gives Bill a wooden club known as 'Bertha' and hides in the next room with the barmaid. Bill begins to attack Terry and his men, but is overpowered and they kick him repeatedly. Before they leave, he begins to knock most of them out leaving Dickie and Terry left. Dickie flees, whilst Terry is battered by Bill. Terry flees the pub and goes to his car, grabs a gun and storms inside. Terry attempts to shoot Bill as he's slapping Pill, but he dodges and the bullet hits the mirror behind Pill and Bill. As Terry approaches Bill and prepares to shoot him, he is struck with a baseball bat by the pub owner which stuns him and enables Bill to punch him repeatedly before leaving the pub.\nBill bumps into Jimmy outside the pub and he suggests they get moving. Jimmy buys a bottle of water, which they use to clean Bill's wounds. As they walk through the laneway, a car approaches them and stops. Jimmy grabs a wooden board and Glen comes out of the car. He confronts Bill about the attack and beating up his men to the point where Glen is worried it will make him seem like a soft touch. Bill admits he attacked Glen's men because they were getting his son and others to sell drugs on their behalf. Bill reminds Glen that he did time for him and other mobsters in jail and says he is owed credit otherwise he'll blow the whistle on them all. Glen threatens to kill Bill who laughs in his face and says he is officially out of credit and will leave his family alone, but he wants no more trouble from him. Bill and Jimmy arrive at the estate, as the police arrive. On the balcony, Roxy sees what is happening and runs downstairs with Dean and Steph. As Dean, Roxy and Steph arrive, Bill is arrested and put in the back of the car for the assault on Terry and his gang. Bill looks out at his family, who wave goodbye to him. Before the officer drives away, Bill points out his sons and asks if the officer has any children. They drive away and Bill breaks down in tears. However, as he realises that his boys will be safe and love him, his tears fade and he begins to laugh with delight."}