{"mid": "WillSuccessSpoilRockHunter", "IMDB_id": "tt0051196", "title": "Will Success Spoil Rock Hunter?", "plot": "Fan magazine writer George MacCauley visits Hollywood's reigning sex goddess Rita Marlowe in her swank New York hotel and confesses that this is only his second interview, the first having been titled 'Will Success Spoil Rock Hunter?' Arriving moments later is the hottest new playwright in town, Michael Freeman (author of 'No Hiding Place Down Here'), quickly followed by literary agent Irving 'Sneaky' LaSalle (inspired by real-life agent Irving 'Swifty' Lazar) and Hollywood mogul Harry Kaye, who is apoplectic about having paid $350,000 for the rights to Mike's play. LaSalle tries to convince the playwright to sign with his agency and write a second play, but Mike is reluctant to write what might be a flop. George, left alone with LaSalle, is persuaded to sign up instead. LaSalle's fee for each of his services is the usual ten per cent, but what George doesn't realise is that he'll be selling off pieces of his soul in ever-increasing increments. George's first wish is for a million dollars; he gets it. Then, when he fantasises about having a woman like Rita Marlowe love him, the suddenly love-struck Rita re-enters and Act One ends with George carrying her into the bedroom.\nIn Act Two, the scene shifts to the Hollywood office of Rita Marlowe Productions, where Mike flirts with Rita's pert secretary, Miss Logan. George has learned that Rita's not-yet-divorced husband, football star Bronk Brannigan, is none too happy about her new relationship. Worse, George has been engaged to write his first screenplay, an adaptation of Mike's psychological drama about a prostitute and a psychiatrist, and after four weeks he still has no idea how to go about it. With an all-important story conference due any minute, LaSalle increases his hold on George by giving him the requisite 'inspiration' to satisfy the increasingly impatient Harry.\nIn Act Three, a year has gone by and George has won an Oscar. When Bronk shows up and begins to pummel George, LaSalle (exacting another ten per cent) enables George to get the better of Bronk; in fact, George tosses the astonished athlete through a window in a shower of broken glass. Soon afterwards, however, George decides he must get out of town before LaSalle takes complete control of him on reaching the full 100 per cent. His penultimate wish is to give Mike a ready-made Pulitzer Prize-winning play, but Mike suddenly realises that he could never pass off as his own a play he didn't write. When LaSalle reappears, George selflessly releases Rita from his control and Mike convinces LaSalle to take him on as a client instead, even agreeing to start with the 90 per cent share already pledged. When LaSalle grabs the offer, Mike explains that it was a bad trade, because he's completely happy with his life and has no intention of selling off the remaining ten per cent. LaSalle petulantly grabs George's Oscar and departs. As the play ends, Mike and George are on their way back to New York, Mike not forgetting to grab his typewriter on the way out."}