{"mid": "Willard", "IMDB_id": "tt0067991", "title": "Willard", "plot": "Willard Stiles is a meek social misfit who later develops a strange affinity for rats. He lives in a large Victorian home, with only his cranky and decrepit mother Henrietta for company. On his 27th birthday, he is humiliated to come home to a birthday party thrown by his mother, where all of the attendees are her own aging friends. After having left the party in embarrassment, he notices a rat in his backyard and tosses it pieces of his birthday cake. Later, his mother gets upset with him for leaving the party and she scolds him while also discussing how badly the house is falling apart. The next morning he goes out and feeds another rat (this one has babies with it) while imitating their squeaks. His mother starts telling him that he needs to kill the rats that have been running around their yard, which Willard refuses to do.\nWhen Willard goes to work he is promptly scolded by his boss Al Martin for tardiness and no attempt to get assignments done on time. Later he returns home and sets about killing the rats as his mother ordered. He puts food on a center rock in a large well, placing a wooden plank to act as a bridge for the rats. When the rats have gathered on the rock, he removes the plank, trapping the rats. He then turns on the water, intending to let the well fill up and drown the animals. However, his guilt will not allow Willard to carry through the plan, and he turns off the water and returns the plank to its place, allowing the rats to escape. When his mother asks if he killed the rats, he lies and tells her he did.\nThat afternoon he begins playing with a rat he names Queenie, and begins teaching the rats words like \"food\" and \"empty\". He sees a white rat and immediately takes a liking to it. The white rat becomes his best companion and he names it Socrates for his wisdom. Numerous other rats quickly emerge, one of which is a bigger black specimen whom he names Ben.\nAt work, Mr. Martin continues to antagonize Willard, telling him he will not give him a raise and then urging him to sell his mother's house. Willard sneaks up to a party Mr. Martin is throwing, opens his suitcase which has rats in it, and then urges them to go get the food and ruin the party. The guests begin screaming and Willard laughs behind the bushes where he is hiding.\nThe next day Willard's mother dies. He discovers that the house is heavily mortgaged. After this Willard is pressured by the banks to give up the house.\nWillard decides to bring Socrates and Ben to the office with him. He sets them on some shelves and tells them to be good. One of his friends at work gives him a cat named Chloe. Chloe constantly claws at the suitcase where Ben and Socrates are hiding. Willard hands her off to a complete stranger and drives away.\nThe rat population is getting too big, and Willard cannot afford to feed them much longer. He decides to steal money from his boss, using his now-trained rats. He orders the rats to \"tear it up\" and puts them in front of the office door.\nLater, at home, Willard gets mad at Ben and starts putting him outside the bedroom, but Ben persists in sleeping in his room.\nThe next day he again takes Ben and Socrates to work. One of the workers spots the rats and Mr. Martin bludgeons Socrates to death, leaving Willard devastated. After Mr. Martin confronts Willard over the theft, Willard instructs the rats, led by Ben, to kill Mr. Martin. Unnerved by Martin's gruesome death, Willard then abandons Ben, goes home and begins sealing up any holes through which the rats could gain entry. He also puts as many rats as he can into cages and drowns them in the small pool outside.\nWillard has dinner with Joan, a co-worker he likes, but is startled to look up and see Ben back in the house staring at him from a corner shelf. He gets up and notices hordes of rats running up the stairs from the basement. He orders Joan to leave and locks the door before confronting Ben. Willard stalls and begins mixing rat poison, but Ben reads the box and squeals loudly, alerting the others, some of whom attack Willard. In an act of desperation, Willard tries to hit the rats with a broom, but misses. He runs upstairs but the other rats come after him. Shutting the door, he stands there terrified. The rats begin to gnaw at the door and eventually break in to devour him, and he says to Ben, \"I was good to you!\" The camera zooms in to a close-up of Ben and the credits roll."}