{"mid": "Wimbledon", "IMDB_id": "tt0360201", "title": "Wimbledon", "plot": "Peter Colt, a British professional tennis player in his thirties whose ranking has slipped from 11th to 119th in the world, has never really had to fight for anything, as his wealthy family allowed him to easily pursue his tennis ambitions. Though he earns a wildcard spot to the Wimbledon tournament, he feels it's time to admit he's getting too old to compete with fitter up-and-coming younger players and intends, after this last Wimbledon, to take a job with a prestigious tennis club.\nAs Wimbledon begins, he bumps into Lizzie Bradbury, the American rising star of female tennis. They fall in love and her interest in him changes his entire perception, even giving him the strength to win again. As their love grows, Peter's game becomes better and better. Lizzie's overprotective father-manager Dennis Bradbury is determined to nip their relationship in the bud, believing it detrimental to her career. One day, Dennis comes to Peter’s old flat and yells at him for spoiling his daughter's game. She overhears this and decides to leave him and focus on her game.\nThe night before their semi-final matches, Peter sneaks into Lizzie’s hotel room and persuades her to have sex. The next day, he performs quite well and wins in straight sets but Lizzie loses. Lizzie angrily breaks up with Peter, saying his selfishness made her lose, and decides to immediately return to the U.S. to train.\nPeter has to play the final match against Jake Hammond, an arrogant American star, but finds himself outclassed. At the airport, Lizzie watches an interview on TV in which Peter apologizes and declares his love for her. She returns to Wimbledon.\nAs Lizzie reaches the stadium, Peter has lost two sets and is behind in the third. When the game is suspended due to rain, Lizzie appears in the dressing room and forgives him. She tells him the secret of Jake’s tricky serves and Peter recovers to win the title (3–6, 2–6, 6–4, 7–6(6), 6–4). He and Lizzie get married, and with his support, Lizzie goes on to win the U.S. Open and Wimbledon twice, ultimately achieving her dreams. In the last scene, Peter is with their youngest child, a boy, watching Lizzie and their eldest child, a girl, playing tennis together on a neighborhood court in New York City."}