{"mid": "WingCommander", "IMDB_id": "tt0131646", "title": "Wing Commander", "plot": "It is the year 2454 and an interstellar war is raging between the Terran Confederation and the Kilrathi Empire, whose people, the cat-like Kilrathi, seek the complete eradication of the human race. Lieutenants Christopher Blair (Freddie Prinze, Jr.) and Todd Marshall (Matthew Lillard) are pilots fresh out of training and traveling aboard the small supply ship Diligent, commanded by Captain James Taggart (Tchéky Karyo), to their new posting aboard the carrier TCS Tiger Claw in the Vega Sector. En route, the ship gets pulled into a gravity well and loses their navigation computer. While Taggart repairs it, Blair is able to space-jump them to safety, calculating the jump in under ten seconds, a notable feat as Taggart notes the computer couldn't have done it that fast.\nA massive Kilrathi armada attacks Pegasus Station, a remote but vital Confederation base and captures a navigation computer, through which it will be able to locate Earth. Admiral Geoffrey Tolwyn (David Warner) directs Blair, whose father he knew from a previous conflict known as the Pilgrim Wars, to carry orders to the Tiger Claw, under the command of Captain Jason Sansky (David Suchet), to fight a suicidal delaying action to let the rest of the Terran fleet reach Earth since it is two hours behind the Kilrathi. Along with the awkwardness of joining a new unit, and continual pranks that require discipline from his wing commander Lieutenant Commander Jeanette Deveraux (Saffron Burrows), Blair fights the distrust of Commander Paul Gerald (Jürgen Prochnow) and his crewmate Lt. Hunter (Richard Dillane) because of the drastic orders he brings from the Admiral, and because his mother was a \"Pilgrim\", a strain of humans who had fought against the Confederation. Pilgrims were the first human explorers and colonists and had developed the innate ability to navigate space by feel despite obstacles such as black holes. Marshall finds a kindred spirit in Lieutenant Rosie Forbes (Ginny Holder) and falls in love with her, but she dies when her fighter is damaged after a battle with an advance group of Kilrathi vessels and crashes on the flight deck during landing. The incident enrages Deveraux and shakes Marshall's confidence.\nDespite several setbacks, the Tiger Claw's personnel successfully attack and board the Kilrathi command ship using the Diligent. In the attack, they also find the stolen navigation computer and learn the coordinates the Kilrathi fleet will use to approach Earth. The Tiger Claw, however, is heavily damaged and can do nothing more to prevent the assault, except to send Deveraux and Blair in fighters to find their way back to Earth. While it would normally be impossible for fighters to make such a jump without a navigation computer, Blair's Pilgrim heritage will afford him the ability to calculate such a jump himself. If alerted to the Kilrathi's plans, Earth forces can destroy each Kilrathi ship before it can get its bearings after the space-jump; if not, Earth's defenses will surely be overwhelmed. Before Blair leaves, Taggart, who is in reality a Naval Intelligence officer rather than a civilian, reveals himself to be a Pilgrim as well, shocking Blair.\nDeveraux's fighter is disabled in combat after destroying a missile, but she convinces Blair to continue his mission despite his objections. Blair uses his Pilgrim ability to make the jump to the vicinity of Earth. He is followed by a Kilrathi ship, but he locates the gravity well he encountered at the start of the movie and baits the Kilrathi to venture too close and when he pulls away at the last minute, their ship is pulled in due to its larger mass. As his fighter runs out of fuel, he transmits the information Earth needs to defeat the Kilrathi assault. Unprepared, the Kilrathi fleet is destroyed by the Earth fleet without being able to put up a fight. A search and rescue team from the Earth fleet rescues Blair while Taggart rescues Devearux in the Diligent. Blair and Deveraux are reunited on the Tiger Claw and share a kiss as Deveraux is taken to get medical attention."}