{"mid": "WinxClub", "IMDB_id": "tt0421482", "title": "Winx Club", "plot": "In season 1, Bloom, a 16-year-old girl from Earth, discovers she has magical abilities when she saves Stella, a fairy princess from Solaria. Stella persuades Bloom to enroll in Alfea, a school for fairies in the Magical Dimension. There, she meets roommate Flora and apartment mates Tecna and Musa; together they form the Winx. They encounter and befriend the boys from the Red Fountain school of Specialists. They also make enemies, mainly a trio of witches called the Trix. Together, the Winx go through many adventures and discover many secrets about Bloom's past while fighting their enemies and studying at Alfea. Their power in Season 1 is Winx.\nIn season 2, the Trix are back and have allied with Lord Darkar, an ancient creature of evil who wants to rule the universe. Together with their new member, Aisha (also known as Layla in some dubs), and their new friends the Pixies, the Winx will have to fight this new threat. They also meet Helia who, at first, is not a Specialist but becomes a Specialist and the love interest of Flora. Their power in Season 2 is Charmix.\nIn season 3, the Winx have to face a new enemy, Valtor, who was freed from his prison by the Trix and who took part in the destruction of Domino and shares a dark past with Bloom and her birth parents. Aisha meets a wizard, Nabu, with whom she falls in love. In Season 3 the Winx Club got a new power called Enchantix. The events of the third season are followed by those of the first movie, The Secret of the Lost Kingdom.\nIn season 4, taking place after the events of the movie, the Winx face a new threat: the four Wizards of the Black Circle, who caused all magic to disappear from Earth. The Winx go to Earth to save Roxy, the last fairy from Earth, fight the Wizards and restore its magic by freeing the Earth fairies from the Wizards. They also get a new power called Believix. They then get powers called the gifts of destiny. The gifts of destiny include Sophix, Lovix, and the black gift. The black gift can give life to a person who is not living. The events of the fourth season are followed by those of the second movie, Magical Adventure.\nIn season 5, taking place after Magical Adventure, the Winx Club battle Aisha's evil cousin Tritannus, who's allied with the Trix in a quest to take over the Magic Dimension. To defeat them, the Winx must prove their self-confidence, empathy and courage and achieve the power of Sirenix. They will also earn the two new transformations: Harmonix and Sirenix. The Winx bond with Selkies from the seas of the Magic Dimension, Aisha meets Roy, a specialist towards whom she is attracted while Bloom will have to save her sister Daphne from Tritannus. The events of the fifth season are followed by those of the third and last movie, The Mystery of the Abyss.\nIn season 6, the Trix take over Cloud Tower and ally with a young witch named Selina, who owns the Legendarium, a magical book which can make the legends become reality, and was once a childhood best friend of Bloom's. However, the Winx lost all their powers except Bloom. They will have to obtain two new transformations known as Bloomix and Mythix. During their quest to seal the Legendarium, the Winx will discover that they face the Trix and Acheron who is an evil wizard imprisoned in the Legendarium. Acheron is the master of Selina.\nIn season 7, the Winx Club discovers the Fairy Animals, which are magical creatures with special talents that are necessary for the balance of the Magical Universe. The Winx find out that they are under threat from the new villains Kalshara, who is an evil shape-shifter, and her brother Brafilius. As well as an unexpected appearance from the Trix, which counts as the third villains. To save the Fairy Animals, the Winx will have to travel through time, gain new transformations known as Butterflix and Tynix, and bond with Fairy Animals."}