{"mid": "Witchboard", "IMDB_id": "tt0090327", "title": "Witchboard", "plot": "One night at a party, Brandon Sinclair brings out his ouija board and attempts to contact David, the spirit of a dead ten-year-old boy with whom he has communicated numerous times. The spirit responds, but Brandon's nemesis Jim insults David, making the spirit angry and provoking him to slash the tires of Brandon's car.\nThe next day, Jim's live-in girlfriend Linda sees Brandon's ouija board (which Brandon left behind from the previous night) and tries to contact David. It is revealed that the spirit is actually a ghost of a deceased murderer named Carlos Malfeitor acting under the guise of David. This malicious spirit initially starts being nice and helpful to her, informing Linda where her lost diamond engagement ring is. Meanwhile, at the construction site where Jim is working, Lloyd is killed from fallen sheetrock by the murderous spirit. After Jim is questioned by Lieutenant Dewhurst at Lloyd's funeral, she again contacts Malfeitor (still believing to be David) about the accident, and the spirit lies that he did not cause it.\nSoon, Linda begins to fall under progressive entrapment, in which the spirit changes and starts to terrorize the user, rendering the person weak and easy to possess. Brandon brings over a psychic medium named Sarah \"Zarabeth\" Crawford to contact David, and if necessary to exorcise him from the building. The spirit puts up little resistance and leaves, but after leaving, Zarabeth is suspicious and wants to research the occurrence. Not long after getting home, she is attacked and killed by Malfeitor; her throat is slashed before being thrown out of a window and impaled onto a spike. The next morning, Brandon is shocked to hear about Zarabeth's death on the newscast, and immediately suspects the spirit David murdered her. After Brandon leaves for more information, Linda is unconscious by Malfeitor and she is sent to a hospital after Jim contacts an ambulance. During this time, Brandon and Jim conduct research on David, and later initially accuse the spirit of terrorizing Linda. They use the Ouija board and discover that Malfeitor is frightening Linda instead. Malfeitor then attacks; he renders Jim unconscious with fallen barrels and kills Brandon with a carpenter's hatchet. Upon the discovery of Brandon's body in the water, Jim is grieved over his friend's loss.\nReleased from the hospital, Linda uses the board but gets no response. After taking a shower, she is then attacked and possessed by Malfeitor. The next morning, Jim returns and discovers the apartment in disarray, before he is attacked by a possessed Linda wearing formal men's clothing and wielding a fire axe. During the fight, Lt. Dewhurst enters the apartment and falsely accuses Jim of the attack before he's knocked unconscious by Linda with a fire poker. The possessed Linda tells Jim, now armed with Dewhurst's revolver, that he is the \"portal\" and taunts him into committing suicide. Suddenly, Jim tricks her and shoots the Ouija board many times right before he is pushed out of a window by the entity and lands on a car.\nAfter the events, a normalized Linda and a survived Jim resume their now back to normal lives and are seen marrying each other at a church. As a girl and the apartment landlady clean up the apartment, they both find the wrecked Ouija board and questions if it stills works before throwing into a box with the planchette. The camera then zooms to the word \"yes\" on the board before the planchette points to it by itself and the film fades to black."}