{"mid": "WithHonors", "IMDB_id": "tt0111732", "title": "With Honors", "plot": "Monty Kessler, an honors student in the Government program at Harvard University, rooms with art student Courtney Blumenthal, radio DJ and trust fund child Everett Calloway, and neurotic pre-med student Jeff Hawkes. Monty is the pet project of Professor Pitkannan, a Nobel Laureate and government cynic.\nWhile working on his thesis, Monty loses his work when his computer crashes. As he leaves to make copies of his sole printed version, he breaks his ankle and drops his thesis down a steam vent and into the boiler room of Widener Library, where he sees a disheveled man reading it, then burning the thesis page by page. The homeless man demands compensation for not burning it. Monty calls the university police, who arrest the man, but the thesis is missing.\nIn his court appearance, the man's name is revealed to be Simon B. Wilder. After convincing the judge to dismiss the charges against him, he is then held on contempt. Monty pays Simon's fine to get his thesis back. Although Simon blames Monty for getting him kicked out of the library, the two of them work out a deal: Simon will give one page for each service Monty provides. Simon takes up residence in Everett's broken-down van in the backyard of Monty's house. Confronted by his roommates, Monty assures them he will get Simon out quickly.\nSimon mentors Monty, and the two become close friends. Monty discusses his absentee father, and Simon responds by showing him his collection of \"memories\", a bag of stones, each of which reminds him of a specific memory. With time, some of the roommates appreciate Simon's presence. Courtney appreciates the new, gentler Monty, and Everett agrees to exchange wine for Simon's fixing the van. Jeff, however, resents paying for extra food and fears the possible reactions of his visiting parents. On a particularly cold night, Jeff rejects Monty's request for Simon to sleep in the cellar, threatening to move out with his share of the rent. When Monty lies to Simon, Simon sees through his deception and leaves.\nAfter the others leave for Christmas break, Simon sends a homeless friend to deliver the rest of the thesis and a philosophical message. The friend tells Monty that Simon does not want to see him but gives Monty his location; Monty finds Simon in the street, wheezing and coughing. Monty takes Simon home and tells him he can stay there as long as he likes. Simon tells Monty he has asbestosis from his days in the Merchant Marines. Touched by Monty's courtesy, Simon agrees to accept government benefits to pay his way. Simon is shocked when Monty throws out his old thesis and writes a new one.\nAs the roommates return, Monty introduces Simon as their new housemate, but Jeff threatens to leave again; eventually, the two reconcile. While writing his own obituary, Simon reveals to Monty that he left his own family. Though angry, Monty forgives him and brings Simon to the biggest party of the year on campus. As the two watch Courtney dance, Simon recognizes that Monty loves her; following Simon's advice, Monty pursues Courtney, and the two kiss.\nLate that night, Monty and Courtney find Simon collapsed in the hallway. Monty agrees to take Simon to see his long-lost son, Frank, even though it will mean missing his thesis deadline. The entire household sets off on a road trip. Monty convinces Frank to meet with Simon, and Frank berates Simon for leaving. When Frank's daughter approaches, Frank tells her that Simon is nobody and leaves. Simon breaks down and grabs a stone for a \"memory\". Simon expresses his desire to die alone, but Monty convinces him to return home with them; they take turns reading poetry to him before he dies. The four friends bury Simon in a cemetery, reading Simon's final obituary.\nMonty meets with Professor Pitkannan. While Pitkannan disagrees with Monty's thesis and new approach to government, he appreciates his beliefs and effort. He regrets that because Monty turned his paper in late, he could not graduate summa cum laude. At the graduation ceremony, Monty grabs a stone for his own \"memory\"."}