{"mid": "Wolf", "IMDB_id": "tt0111742", "title": "Wolf", "plot": "Will Randall (Jack Nicholson) is bitten by a wolf while driving home in Vermont. Afterwards, he is demoted from editor in chief of a publishing house when it is taken over by tycoon Raymond Alden (Christopher Plummer), who replaces him with Will's protegé Stewart Swinton (James Spader). Stewart is having an affair with Will's wife Charlotte (Kate Nelligan). Will starts to be more aggressive, taking on the characteristics of a wolf.With the help of Alden's headstrong daughter Laura (Michelle Pfeiffer), Will sets out for his new life. His first escapade as a werewolf takes place at Laura's estate, where he wakes up at night and hunts down a deer. In the morning Will finds himself on the bank of a stream, with blood all over his face and hands.He visits Dr. Vijav Alezais (Om Puri), who gives him an amulet to protect him from turning completely into a wolf. Alezais asks Will to bite him, as Alezais does not have long to live, and would prefer \"demonization to death.\" After refusing, Randall keeps the amulet so that he won't transform at the next full moon. Calling Laura to explain, Randall, now a wolf, breaks into the Zoo and steals handcuffs from a policeman. Muggers want his wallet, but he attacks and leaves one of them alive. He wakes up in his hotel, with no memory of what happened.Will outmanoeuvres Stewart at their work and fires him, urinating on his shoes in a bathroom. While washing his hands, he finds fingers in his handkerchief and realizes he killed someone. Will inadvertently bites Stewart, who then becomes a wolf and murders Charlotte. Stewart attempts to frame Will in order to seize his job back.Horrified that he might have killed his wife, Will goes back to Laura`s cottage and is locked up in the barn. Laura gets a call from a Detective (Richard Jenkins), who tells her that canine DNA was found on Charlotte's body. Alarmed, Laura goes to the police station. There she runs into Stewart, who makes an animal-like pass at her. Laura hurries away, making arrangements for her and Will to leave the country.Stewart follows her and kills her two guards. After a brief struggle in the barn, Stewart tries to rape her, but Will frees himself and they fight. Stewart is shot to death by Laura. After he returns to normal, Will has a brief moment with Laura and then runs into the forest.Minutes later, Laura shows heightened senses when the police arrive, telling the detective that she can smell vodka on his breath. The final scene is a close-up of her face fading into dark, lupine eyes, and a close up of Will completing his transformation into a full werewolf."}