{"mid": "WouldYouRather", "IMDB_id": "tt1999995", "title": "Would You Rather", "plot": "Iris (Brittany Snow), a young woman caring for her sick brother Raleigh (Logan Miller), is unable to afford to his treatment costs. Dr. Barden (Lawrence Gilliard, Jr.), the doctor treating Raleigh, introduces Iris to Shepard Lambrick (Jeffrey Combs), a seemingly philanthropic aristocrat, who offers her a deal: if she competes and wins in a game, his charitable foundation will pay for Raleigh's leukemia treatment and locate him a bone marrow donor. Iris reluctantly accepts.Arriving at the Lambrick's manor, Iris is introduced to his son Julian (Robin Lord Taylor) and the remaining contestants: Lucas (Enver Gjokaj); Travis (Charlie Hofheimer), a war veteran; Linda (June Squibb), an elderly woman paralyzed in a wheelchair; Peter (Robb Wells), a gambling addict; Cal (Eddie Steeples); Amy (Sasha Grey); and Conway (John Heard), an in-debt alcoholic.When the contestants are seated and dinner is served, Iris points out she is a vegetarian and refuses to eat the meat on her plate. Seeing this as an opportunity to begin the game, Shepard offers Iris $10,000 to eat the meat, which Iris accepts. Conway reveals to Shepard he is a recovering alcoholic after Shepard notices he hasn't drunk any of the wine. Shepard offers him two choices: $10,000 for drinking the glass of wine, or $50,000 for drinking a decanter of scotch. Conway accepts the $50,000 and reluctantly drinks the scotch.After dinner ends, the game begins and is revealed to be a version of the popular party game, \"Would You Rather?\" in which the guests will actually have to complete their choice of two undesirable options. Shepard offers his guests the chance to leave, but no one does. Bevans (Jonny Coyne), Shepard's butler and former special agent, enters the room with an electric shock machine and two wired headbands. Conway attempts to escape but is shot by Bevans. In round one, one of the players wearing a headband is given a buzzer with two buttons: one button is a self-inflicted shock, and the second delivers a shock to the other player. After the contestants take turns making the tough decision, the round ends with no one eliminated.The second round begins. Iris is given the choice of stabbing someone in the thigh with an ice pick, or whipping Travis three times with a sjambok. Travis tells Iris to whip him as stabbing would be more life-threatening. Lucas also chooses to whip Travis for this reason. When it is Travis's turn, he has the choice of stabbing Lucas or letting Bevans whip him. Travis once again chooses to be whipped. The dilemma then travels to Peter, who may either stab Linda in the thigh or whip Travis again. Knowing Travis won't survive another round of whips, Peter tells Linda that they have to work together. Peter stabs Linda in the leg, but pierces a major vein causing her to bleed profusely. Linda chooses to stab Amy since she can't stand up to whip Travis. Linda later bleeds to death. As the turn heads to Amy, she points out that the point of the game is survival, ultimately choosing to stab Iris. Agreeing with Amy, Cal's turn sees him choosing to whip Travis, leading to Travis' elimination from the game.The group attempts to run away as the round ends. Iris is able to escape from the dining room, but Cal is shot and eliminated while the other three survivors are forced to stay at the dinner table. Iris attempts to escape through the basement, but is stopped by Julian who tries to rape her. She manages to stab him in the knee with the ice pick and fight him off as a remorseful Dr. Barden, who was once the winner of the same game, arrives to save Iris. Before he can do so, Bevans arrives, shoots Barden in the head and takes Iris back to the table for the third round.The third round begins, which involves making a decision between the known and the unknown. The known requires one to have their head held in a barrel of water for two minutes. The unknown carries an unknown fate, in the form of a card: it can be deadly or it can be relatively harmless. Peter goes first and chooses the card, which commands him to ignite a firecracker in his hand. Peter reluctantly complies, but dies from a cardiac arrest when his hand is blown off. The turn goes to Lucas, who is forced to slit open his eye with a razor blade. Iris chooses to challenge the barrel, and manages to survive the two minutes. It is then revealed that Iris would have had all her teeth extracted if she had picked the card. Amy decides to go with the card, but the card reveals that she has to spend four minutes in the barrel instead of two. Amy drowns to death, mostly due to the start being called as she was opening her mouth to take a breath.The fourth round starts, with only Iris and Lucas left. Iris has the choice of sparing Lucas, and letting the two of them leave empty handed, or she has the choice of killing Lucas with a duelling pistol and taking the money to save her brother's life. Lucas attempts to talk Iris into sparing him, and begins to tell her why he came into the competition. As he pours out his heart and compares the struggles of his family to Iris's brother, Iris suddenly shoots Lucas in the chest, killing him. Shepard crowns Iris the winner and allows her to leave with the money, additionally stating they have already located a donor for her brother.Iris finds Raleigh asleep on his bed and proceeds to shower the blood off her. Upon further observation, she finds that Raleigh has committed suicide by overdosing on his medication. The film ends with Iris grieving over her brother's corpse, screaming, \"What did you do?!\""}