{"mid": "WrongTurn5Bloodlines", "IMDB_id": "tt2375779", "title": "Wrong Turn 5: Bloodlines", "plot": "After The Hillicker Brothers (Three Finger, Saw Tooth and One Eye) escape from the Glensville Sanatorium of the previous film, they, along with the help of serial killer Maynard Odets, start a murderous rampage near the city of Fairlake, Greenbrier County, West Virginia, where they first murder news reporter Kaleen Webber.\nMeanwhile, five friends, Billy (Simon Ginty), his girlfriend Cruz (Amy Lennox), Lita (Roxanne McKee), her boyfriend, Gus (Paul Luebke), and Julian (Oliver Hoare), are on their way to Fairlake, West Virginia to celebrate the Mountain Man Music Festival for Halloween. Along the way to the town, they almost run over Maynard, who was standing in the middle of the road, and crash their car into a tree while trying to avoid hitting him. As they get out of the car to check if he is alive, he suddenly tries to cut one of them. Billy, Gus, and Julian attack Maynard out of self-defense. Sheriff Angela Carter (Camilla Arfwedson) and her partner, Deputy Biggs (Kyle Redman Jones), drive by, witness them kicking Maynard, and apprehend the entire group, including Lita and Cruz. While Angela leaves to take them to the police station, she asks Deputy Biggs to stay back with their crashed car until a tow comes. As soon as the Sheriff leaves, the cannibals appear and kill Deputy Biggs.\nAfter being locked up in the police station, Billy confesses to Sheriff Carter that he owns the drugs and convinces her to let the others go. He stays at the police station while they are released. Meanwhile, Sheriff Carter discovers Maynard is a fugitive wanted for murder and makes arrangements to turn him over to the proper authorities the next morning. Maynard promises her she won't live that long.\nElsewhere, the cannibals use their truck to pull down a phone pole, taking out service to the town. They then proceed to the power plant, where they kill a guard and shut down the town's electricity. Most of the townspeople are attending the festival in a nearby town. The teens register at a motel. On her way to visit Billy in the holding cell at the police station, Cruz is chased by Three Finger, who kills her. Julian heads to the police station a short time later but doesn't notice Cruz being eviscerated down a side street; he arrives uneventfully, only to learn Cruz never made it.\nAt the motel, Gus is captured when he answers the door. Lita is attacked by Saw Tooth but manages to escape. The cannibals proceed to break Gus's legs, then dump him in front of Angela's office. Angela attempts to save him, but the cannibals run over him with their pick-up truck, killing him. Angela frees Billy and gives him, Julian and prisoner Mose (Duncan Wisbey) shotguns after deputizing them.\nAngela manages to communicate with someone via shortwave radio asking them to call for backup, but the man on the other end thinks the message is a joke. Lita manages to make it to Angela's office but is almost killed when Mose shoots through the door as she tries to open it. Angela warns Julian and Billy not to go looking for Cruz, but they ignore her warning and go in search of her anyway. They wander the streets and find Cruz's dead body; while trying to get the body to Angela's office, they encounter the cannibals, get captured, and are placed in a soccer field where Three Finger kills both of them with a snow blower. Angela sends Mose to search for the deputies, but he unknowingly runs over spikes in the road and crashes. He awakens to find himself captured by the cannibals, who burn him alive.\nAfter hearing Mose's accident over the radio, Angela tries to go for help but discovers her husband bound in a car and tries to help him. She discovers too late that it's a trap, and he dies; she is then knocked out and captured by Three Finger. After Angela leaves, Maynard convinces Lita that if she releases him, he will let her live. However, after releasing him, Maynard proceeds to stab Lita's eyes out and threatens to rape her. Maynard leaves the jail to meet up with \"his boys,\" and Lita stumbles out the opened door. Carter awakens in the jail cell with her hands tied to the ceiling; Maynard gives Carter the option of her death: being burned alive or killed by a shotgun with its trigger tied to her feet, which will go off if she steps down. They then proceed to burn down the cell.\nAs her feet begin to burn, Angela eventually triggers the shotgun, killing herself. Lita, unable to see, is captured by Maynard and the cannibals while walking across the road. The killers then move away into the woods."}