{"mid": "WrongTurn6LastResort", "IMDB_id": "tt3612032", "title": "Wrong Turn 6: Last Resort", "plot": "Daria and Nick ride their bikes deep in the Hobb Springs Bike Trail. After bathing in a small watering hole, they start having sex. Afterward, they ride their bikes again until Nick falls off and discovers that an unknown assailant has shot him with a bow and arrow. The assailant, Three Finger, then kills Nick with an arrow through the face. Daria attempts to flee only to ride into a strip of barbed-wire planted by One Eye and Saw Tooth. Three Finger then proceeds to kill her via decapitation with a machete.\nDanny and his girlfriend Toni, Bryan and his girlfriend Jillian, Vic, Toni's brother Rod, and Charlie go to the Hobb Springs Resort, where they meet caretakers, siblings Sally and Jackson, who take them in. Agnes, a vacationer, is soon attacked, possibly by Saw Tooth or One Eye, throwing an axe at her. Jackson then snaps her neck, killing her.\nCharlie, Vic, and Rod swim outside as Toni takes a bath and Jackson takes Danny out in the woods to hunt. Danny shoots a deer, when a sheriff is killed by Three Finger. As Toni gets dressed, she sees Jackson wipe off blood from the wall, and she takes Vic along with her to look for Danny. Vic sees Saw Tooth devouring flesh, runs away, and falls into a trap with Danny. Vic escapes the trap and seeks help for Danny. Jackson and Vic carry Danny back to the resort, where Sally attends to Danny's wounds and begins to seductively undress him. When Toni walks in, Sally leaves and watches the two have sex.\nVic, Rod, and Charlie harass Bryan and Jillian, who were having sex in the pool. Jillian and Bryan have sex while Sally watches, and the cannibals attack them. Jillian is killed, but Sally stops them from killing Bryan. Sally has sex with Bryan, but Jackson interrupts them. When he leaves, Sally kills Bryan. Jackson and Sally then introduce Danny to his long-lost family, though Danny does not believe he is related, and then they drug him to confuse him. As Vic hides in the bushes, he listens to the conversation. Saw Tooth captures him and Three Finger cuts his throat.\nIn the morning, Toni, Rod, and Charlie hear a knock on their door. When he enters, Danny tells them to leave, though he is staying. As they leave, they hide when they find that Jackson is cooking their friends. When they see Jillian's head in the freezer, they scream and flee, only to run into the hillbillies. Toni and Rod escape, but Charlie is captured and killed. Toni insists that she and Rod return to help Danny, but Rod tells her that they can send help later. Toni grabs a rifle and goes back for Danny. At the resort, Toni confronts Sally, whom she attempts to kill. Rod then attempts to leave but is captured in a bear trap and killed by Three Finger.\nAs Sally and Toni fight, Toni burns Sally's face in boiling water and wounds her with the rifle. Danny enters and asks why she is attempting to kill his family. After Jackson attempts to kill Toni, Danny lets her go; Jackson says she knows too much and pursues her, but Toni stabs and kills Jackson with door keys. As Danny says his goodbyes to Toni, Three Finger kills her. Later, Danny is shown as a caretaker at the resort. In the last scene, Danny takes Sally from a wheelchair and they have sex as the cannibals watch."}