{"mid": "Xanadu", "IMDB_id": "tt0081777", "title": "Xanadu", "plot": "The film opens with a large mural of the Nine Muses of Olympia coming to life, with the women emerging from the painting and flying into the sky. One of them returns to Earth.\nSonny Malone is a talented artist who dreams of fame beyond his job, which is the non-creative task of painting larger versions of album covers for record-store window advertisements. As the film opens, Sonny is broke and on the verge of giving up his dream. Having quit his day job to try to make a living as a freelance artist, but having failed to make any money at it, Sonny returns to his old job at AirFlo Records. After some humorous run-ins with his imperious boss and nemesis, Simpson, he resumes painting record covers.\nAt work, Sonny is told to paint an album cover for a group called The Nine Sisters. The cover features a beautiful woman in front of an art deco auditorium (the Pan-Pacific Auditorium). Earlier that day, this same woman had collided with him, kissed him, then roller-skated away. Now, Malone becomes obsessed with finding her. He finds her at the same auditorium, now abandoned. She identifies herself as Kira, but she will not tell him anything else about herself. Unbeknownst to Sonny, Kira is one of the Muses that emerged from the mural.\nWalking near the beach, Sonny befriends Daniel \"Danny\" McGuire, a has-been big band orchestra leader turned construction mogul. Danny lost his muse in the 1940s (who is seen in a flashback scene to bear a startling resemblance to Kira), and Sonny has not yet found his muse. Kira encourages the two men to form a partnership and open a nightclub at the old auditorium from the album cover. She falls in love with Sonny, and this presents a problem because she is actually an Olympian Muse (\"Kira's\" real name is Terpsichore, the Muse of Dance). The other eight women from the beginning of the film are her sisters and fellow goddesses, the Muses, and the mural is actually a portal of sorts and their point of entry to Earth.\nThe Muses visit Earth often to help inspire others to pursue their dreams and desires, but in Kira's case, she has violated the rules by which Muses are supposed to conduct themselves, as she was only supposed to inspire Sonny but has ended up falling in love with him as well. Her parents, presumably the Greek gods Zeus and Mnemosyne, recall her to the timeless realm of the Olympian gods. Sonny follows her through the mural and professes his love for her. A short debate between Sonny and Zeus occurs, with Mnemosyne interceding on behalf of Kira and Sonny. Kira herself then enters the discussion, saying the emotions she has toward Sonny are new to her; if only they could have one more night together, Sonny's dream of success for the nightclub Xanadu could come true. Zeus ultimately sends Sonny back to Earth. After Kira expresses her feelings for Sonny, Zeus and Mnemosyne decide to let Kira go to him for a \"moment, or maybe forever.\" They cannot keep these straight because mortal time confuses them, and the audience is left to wonder what her fate is to be.\nIn the finale, Kira and the Muses perform for a packed house at Xanadu's grand opening, and after the final song, Kira and the Muses all return to the realm of the gods in spectacular fashion. With their departure, Sonny is understandably depressed. But that quickly changes when Danny asks for a drink for Sonny from one of the waitresses -- a waitress who looks exactly like Kira. Sonny approaches this seeming double and says he would just like to talk to her. The film ends with the two of them talking, in silhouette, as the credits begin to roll."}