{"mid": "XMenEvolution", "IMDB_id": "tt0247827", "title": "X-Men: Evolution", "plot": "=== Season one ===\nThe first season introduces the core characters and lays the foundations for future story lines. Professor X, Cyclops, Wolverine, Storm and Jean Grey make up the original X-Men. As the season develops, the ranks of the X-Men are bolstered by the appearance of Nightcrawler in the first episode, Shadowcat in the second, Spyke in the fifth, and Rogue (who originally joins the Brotherhood in the fourth episode) in the third. In the later episodes of this season, Nightcrawler discovers the identity of his birth mother, Wolverine finds answers to his past, Rogue switches sides to join the X-Men and Xavier's half-brother, Juggernaut, is released from his prison.\nConfrontations are typically with the Brotherhood, who vie for new recruits with the X-Men over the course of the season. Toad is the first to be introduced, followed by Avalanche, Blob and Quicksilver. The Brotherhood, led by Mystique, are in fact being directed by a higher power, the identity of whom was \"revealed\" in the two-part season finale as being Magneto. After Cyclops discovers that his brother Alex actually survived the plane crash that killed their parents, they are both taken by Magneto into his \"sanctuary\" on Asteroid M. Magneto captures several X-Men and Brotherhood members in an attempt to amplify their mutant abilities and remove their emotions. The Brotherhood and X-Men show up leaving Magneto, Sabretooth and Mystique trapped on the asteroid. Asteroid M is destroyed by Scott and Alex Summers, but not before two metal spheres fly from the exploding asteroid.\n=== Season two ===\nThe second season sees the addition of several new mutants, including Beast, who becomes a teacher at the Xavier Institute and an X-Man, as well as a version of the New Mutants: Boom Boom, Sunspot, Iceman, Wolfsbane, Magma, Multiple, Jubilee, Berzerker, and Cannonball. During the course of the season, it is revealed that the villains who supposedly perished on Asteroid M are actually alive. Sabretooth continues his pursuit of Wolverine, while Magneto continues to work his own agenda. Mystique poses as Risty Wilde, a high school student at Bayville High who befriends Rogue and breaks into the mansion to steal Xavier's Cerebro files. Using the files, she recovers Wanda Maximoff, the Scarlet Witch, Magneto's daughter and Quicksilver's sister. The mentally unstable mutant joins the Brotherhood upon Mystique's return, allowing them to defeat the X-Men in a battle at the Bayville Mall. Before the finale, a pivotal episode aired featuring the telepath Mesmero opening one of three doors that would unleash a mutant known as Apocalypse.\nIn the season finale, Xavier rigorously trains his X-Men to face Magneto, pairing them with the Brotherhood. Cyclops, furious with having to work with his former adversaries, leaves the team. The mansion is later set to self-destruct with Cyclops and several students still inside. Magneto, meanwhile, recruits Sabretooth, Gambit, Pyro and Colossus as his Acolytes to fight the X-Men/Brotherhood team. At the same time, Wolverine is captured by Bolivar Trask to use as a test subject for the anti-mutant weapon, the Sentinel. Magneto continues to manipulate events by unleashing the Sentinel onto the city, forcing the X-Men to use their powers in public. Wanda tracks down Magneto and attacks him while he is trying to deal with the Sentinel that is targeting him. The Sentinel is damaged and apparently crushes Magneto as it falls. When the mutants who have not been captured by the Sentinel return to the remains of the mansion, Cyclops and the students emerge from the explosion with minor injuries. Scott throws Xavier from his wheelchair and blames him for blowing up the mansion. Everyone is shocked as Xavier calmly stands up, transforming into Mystique.\n=== Season three ===\nIn seasons three and four, the show notably begins to take a much more serious tone. After the battle with the Sentinel, the mutants are no longer a secret and public reaction is one of hostility. The show is brought into more traditional X-Men lore, dealing with themes of prejudice, public misconception, and larger threats. As the season progresses, the real Xavier is found, Mystique is defeated, the mansion is rebuilt, and the X-Men allowed back into Bayville High. Scott and Jean develop a stronger and closer romantic relationship (particularly after Mystique kidnaps Scott and brings him to Mexico), Spyke leaves the X-Men when his mutant ability becomes uncontrollable, deciding to live with the sewer-dwelling mutants known as the Morlocks, and Wanda continues to search for Magneto, who she discovers was saved by Quicksilver at the last second, until Magneto uses the telepathic mutant Mastermind to change her childhood memories.\nAs part of the series arc, Rogue loses control of her powers, leading to her hospitalization. During this time, she learns that she is in fact Mystique's adoptive daughter. Mystique, through the visions of the mutant Destiny, foresaw that the fate of Rogue and herself lay in the hands of an ancient mutant that would be resurrected. Apocalypse emerges in the season's final episodes. Mesmero manipulates Magneto into opening the second door, and uses Mystique and a hypnotized Rogue to open the last, turning Mystique to stone in the process. Now released, Apocalypse easily defeats the combined strength of the X-Men, Magneto, the Acolytes, and the Brotherhood before escaping.\n=== Season four ===\nThe final season contained only nine episodes. In the season premiere, Apocalypse apparently kills Magneto while Rogue murders Mystique by pushing her petrified figure off a cliff, leaving Nightcrawler without closure. The Brotherhood become temporary do-gooders, Wolverine's teenage girl clone X-23 returns, Xavier travels to Scotland in order to confront his son David, Spyke and the Morlocks rise to the surface, Rogue is kidnapped by Gambit and taken to Louisiana to help free his father, and Shadowcat discovers a mutant ghost who is found in an underground cave. The character Leech is also introduced as a young boy named \"Dorian Leach\".\nIn the finale, Apocalypse defeats Xavier and Storm, transforming them, along with Magneto and Mystique, into his Four Horsemen. Apocalypse instructs his Horsemen to protect his three domes and his 'base of operations', which will turn the majority of the world population into mutants. In the final battle, the Horsemen are returned to normal and Apocalypse is sent through time. Rogue and Nightcrawler refuse the excuses of their mother, Shadowcat and Avalanche find love once again, Magneto is reunited with Quicksilver and the Scarlet Witch, Storm and Spyke are also reunited, and Xavier sees his students reunited as the X-Men.\n=== Final moments ===\nThe series ends with a speech by Charles Xavier, who had caught a glimpse of the future while being controlled by Apocalypse. The following future scenarios were foreseen:\nContinued anti-mutant sentiment.\nA reformed Magneto teaching the New Mutants, including a returned Jubilee and Wolfsbane.\nJean turning into the Phoenix. Had the series continued, the show's next season would have focused on the \"Phoenix/Dark Phoenix Saga\".\nThe future X-Men team, consisting of Cyclops, Nightcrawler, X-23, Iceman, Beast, Shadowcat, Colossus, Rogue (able to fly and not wearing gloves), and Storm. The uniforms these future X-Men wear look very much like the dark uniforms seen in the Ultimate X-Men comic, as well as that of the live-action feature films.\nThe Brotherhood, including the Scarlet Witch and Pyro, standing in front of a S.H.I.E.L.D sign (foreshadowing the Freedom Force)\nA fleet of Sentinels led by Nimrod.\nThe last scene shows the X-Men, the New Mutants, Gambit and Colossus (former Acolytes), Boom Boom, Havok, Angel, X-23, and a returning Spyke."}