{"mid": "Xtro", "IMDB_id": "tt0086610", "title": "Xtro", "plot": "Sam Phillips and his child Tony are playing outside their farm. The father is abducted by a strong light. Three years later, the light returns, and plants a seed. A half-human, half-alien creature grows up, and when it moves it is run over by a car. Ben is attacked and killed when he looks for the crash victim. Jane, his companion, is also killed by the hybrid creature. The monster then moves to a cottage nearby and attacks and impregnates a woman living there, before dissolving and dying. When she returns to consciousness, her belly rapidly and painfully grows to a gargantuan size that it even tears through her dress, showing movement inside her belly, and she gives birth, vaginally, to a fully formed and bloody Sam, who is connected to her by an umbilical cord like a baby is to its mother, before dying. Sam washes the blood off, steals Ben's clothes and drives his car without bothering to get rid of Jane's corpse, which will be found by a lorry-driver.\nSam seeks Tony, who lives in an apartment building in London, with his mother Rachael, her new boyfriend Joe Daniels, and a French au-pair Analise Mercier. Rachel and Joe are professional photographers and share a studio in town. Many nights, Tony has nightmares where he wakes up soaked in blood, but it's not his, as the family doctor discovers. Sam picks Tony up from school, until Rachel finds them. Although Joe doesn't like it, as he intends to marry Rachel, Sam goes to live with them, saying he can't remember anything. Tony sees him eating his pet snake's eggs and runs from him. Sam goes after him, talking to him smoothly, and drinks his blood.\nRachel finds Jane's photo in Sam's clothes, but he can't remember her either. Tony discovers he has certain powers now, so he sends a human-sized toy soldier to kill their nasty neighbour Mrs Goodman, in revenge for killing his pet snake, and a teddy-clown becomes a human-like clown.\nSam and Rachel both decide to visit their former residence, the farm, while leaving Tony in Analise's care. However, she brings Michael, her boyfriend, and they make love. Tony demands to play hide-and-seek with her. She does so, only to be knocked out by the clown and used as a womb for the alien eggs; Tony sends a toy tank to kill Michael. He discovers Analise and runs away, but a black panther kills him. The building keeper, Mr. Knight, is also killed when Rachel asks him to watch Tony, as nobody answers the phone at home. Sam and Rachel make love at the abandoned farm, but she gets afraid because his skin starts to bleed and decompose. Joe has taken Tony there. Sam and Tony go up a hill towards the alien light. Sam has now taken the form of an alien, and his scream kills Joe. Along with Tony, Sam enters the light and returns to the alien world. Rachel sits down in the field where Tony and Sam left, and the next day returns to her apartment, only to be seen full of eggs. She picks up an egg, only to be killed by the same creature that impregnated the woman in the cottage as her apartment door slams shut behind her.\n=== Alternate ending ===\nDirector Harry Bromley Davenport originally intended the film to end with Rachel coming home to find the apartment filled with clones of Tony, having apparently come from the alien eggs which the real Tony had left in the refrigerator. Executive producer Robert Shaye, not thinking the scene's special effects were convincing enough, edited it out and released it for its New York debut with the film ending when Rachel sits down in the field after Sam and Tony have left. Davenport, however, not wanting to have it end on such an abrupt note, created another ending which had Rachel going back to the apartment, picking up one of the eggs, and being attacked by a face-grabbing creature similar to the one that attacked the woman in the cottage. Ultimately the film was released with this ending."}