{"mid": "Yeelen", "IMDB_id": "tt0094349", "title": "Yeelen", "plot": "Nianankoro's father Soma is a part of the order of Komo, who practice magic, but he uses his powers for self-gain. He becomes determined to kill his son after receiving a vision that his son will cause his death. Aided by his mother, Nianankoro leaves his village to seek out his uncle for help. Soma pursues him with the aid of an enchanted pylon that tracks his son's location and breaks all barriers that deter it.\nAs he travels, Nianankoro encounters a hyena who tells him his destiny is to be great. Passing through the territory of the Peul, he is thought to be a thief and captured. Their king Rouma Boli orders him killed, but Nianankoro creates magic that freezes his guards and declares they cannot kill him. Impressed, King Rouma offers Nianankoro his freedom in exchange for aid against a rival tribe. When the tribe attacks, Nianankoro summons a swarm of bees and a fire that drives their attackers away. The king thanks Nianankoro and asks him to cure his wife Attou's infertility. Nianankoro creates an enchantment, but he and Attou are overcome by lust and sleep together. That night they return to Rouma to confess their crime, and the king reluctantly orders them married and to leave.\nNianankoro and Attou continue their travels while his father remains in pursuit. Soma sacrifices an albino man and a wild dog to appease the gods who grant him power to hunt his son. He then meets with the Komo and warns them that Nianankoro intends to disperse their magic for all the people to use. Nianankoro and Attou reach his uncle Djigui, who was blinded long ago when he chose to use the artifact of Kore's Wing for his people. He gives the relic to Nianankoro and tells him and Attou, who is pregnant, that their children will become a nation who will face hardship but prosper. Taking Koe's wing, Nianankoro leaves to confront his father and gives his cloak to Attou to in turn give to his son. She takes refuge with Djigui as they prepare for incoming devastation.\nReaching his father, Nianankoro attempts to reason with him but is dismayed to find his father cannot bear to share his power and only wants him dead. They call upon the power of their artifacts, Soma with his pylon and Nianankoro with Kore's Wing, turning themselves into an elephant and a lion, respectively. The power of Kore creates a blinding wave that kills them both and transforms the land around them into sand. After their deaths, Attou and her young son come to the site and find two eggs. Her son takes the egg of his father and his mother gives him Kore's Wing, and they leave the desert."}