{"mid": "Yellowbrickroad", "IMDB_id": "tt1398428", "title": "YellowBrickRoad", "plot": "In 1940 the entire town of Friar, 572 people, abandoned their town and walked into the wilderness with only the clothes on their backs after a viewing of The Wizard of Oz, a film that the entire town was obsessed with. No one has ever been able to explain why they did this. Only 300 of the townspeople's bodies were recovered: some had frozen to death in the elements, while others were killed in horrific and bloody ways. The remaining 272 citizens were never found, and the government designated the trail that the townspeople took as classified. Despite this, the town was eventually repopulated, although the townspeople are cautious of the town's history.\nIn the present day, the trail's coordinates have been declassified, and a film crew has arrived to travel the trail to learn about the disappearances and deaths, as well as what lies at the end of the trail. Crew leader Teddy found the trail's coordinates via Friar's cinema. The crew befriends Liv, a townsperson who works at the local cinema, and she agrees to accompany them on their trip.\nThe journey goes well initially, but soon the crew is terrorized by loud and jarring music that appears to come out of nowhere. Then crew member Daryl brutally murders his sister Erin and flees in the only vehicle, which also contains their food supply.\nDesperate, the crew begins to argue and turn on one another. Several of the group's members kill themselves, either out of despair caused by abandonment or because they have been driven mad by the music and associated events. Daryl returns and murders Teddy's wife Melissa, before being killed himself by Liv. A weary and visibly shaken Teddy crawls to the final portion of the trail, where the music finally stops. He finds himself at what appears to be the cinema from the beginning of the film. There, he meets a sinister Usher, who forces him to sit in a theater empty except for a brief glimpse of smiling theatergoers implied to be the spirits of the dead townspeople. On the screen is footage of his wife, who has been transported by the Usher into a hellish landscape. Horrified, Teddy begins to scream but is cut off."}