{"mid": "YouCantTakeItWithYou", "IMDB_id": "tt0030993", "title": "You Can't Take It with You", "plot": "A successful banker, Anthony P. Kirby (Edward Arnold), has just returned from Washington, D.C., where he was effectively granted a government-sanctioned munitions monopoly, which will make him very rich. He intends to buy up a 12-block radius around a competitor's factory to put him out of business, but there is one house that is a holdout to selling. Kirby instructs his real estate broker, John Blakely (Clarence Wilson), to offer a huge sum for the house, and if that is not accepted, to cause trouble for the family.\nKirby's son, Tony (James Stewart), a vice president in the family company, has fallen in love with a company stenographer, Alice Sycamore (Jean Arthur). When Tony proposes marriage, Alice is worried that her family would be looked upon poorly by Tony's rich and famous family. In fact, Alice is the only relatively normal member of the eccentric Sycamore family, led by Grandpa Vanderhof (Lionel Barrymore). Unbeknownst to the players, Alice's family lives in the house that will not sell out.\nKirby and the snobbish Mrs. Kirby (Mary Forbes) strongly disapprove of Tony's choice for marriage. Before she accepts, Alice forces Tony to bring his family to become better acquainted with their future in-laws. But when Tony purposely brings his family on the wrong day, the Sycamore family is caught off-guard and the house is in disarray. As the Kirbys are preparing to leave after a rather disastrous meeting, the police arrest everyone in the house for making unlicensed fireworks and disturbing the peace.\nHeld up in the drunk tank preparing to see the night court judge, Mrs. Kirby repeatedly insults Alice and makes her feel unworthy of her son. At the court hearing, the judge (Harry Davenport) repeatedly asks why the Kirbys were at the Vanderhof house. When Grandpa says it was to talk over selling the house, Alice has an outburst and says it was because she was engaged to Tony but is spurning him because of how poorly she has been treated by his family. This causes a sensation in the papers, and Alice flees the city.\nWith Alice gone, Grandpa decides to sell the house, thus meaning the whole section of the town must vacate in preparation for building a new factory. Now, the Kirby companies merge, creating a huge fluctuation in the stock market. When Kirby's competitor, Ramsey (H. B. Warner), dies after confronting him for being ruthless and a failure of a man, Kirby has a realization that he does not have any friends – just as Grandpa Vanderhof told him back in the drunk tank.\nKirby visits the Vanderhofs as they are moving out of the house, and Kirby lets loose and plays the harmonica and realizes these lower-class people he previously belittled are good people. Alice takes Tony back, the Vanderhofs don't move, and the film ends with the Vanderhofs and Kirbys enjoying a meal together."}