{"mid": "YouWillMeetATallDarkStranger", "IMDB_id": "tt1182350", "title": "You Will Meet a Tall Dark Stranger", "plot": "Helena, an older woman whose husband has left her after 40 years of marriage, goes to a psychic named Cristal for advice. Cristal points out that Helena is constantly blaming herself for the problems in her life, but she sees better times coming for her.As a narrator elucidates, Helena's husband Alfie had suddenly become terrified of dying and then became obsessed with fitness. He put himself through a complete body makeover and wanted out of the marriage. As a result, Helena had a breakdown.Helena's daughter Sally is married to Roy, who left his pursuit of a medical degree to become a novelist. His first book was a success, only his work ever since has not been as accomplished. As he struggles to complete his latest book, he becomes preoccupied with a young lady neighbor whom he can see in an apartment across the street.Alfie is not exactly happy living like he is 30: he eats alone, women his age are frail, and he does not relate to the young people he meets. Yet he suddenly discovers a much younger woman whom he wants to marry.Alfie's new engagement upsets Helena deeply, but Cristal foresees that he will not be happy with the new woman. Cristal further envisions that Helena will meet a handsome new stranger.When Sally and Roy meet Alfie's new fiancé Charmaine, they are shocked by how scantily clad she is, and further by their speedy engagement. As the narrator reveals, Alfie has not mentioned that he initially hired her as a prostitute and then fell in love with her. Now he wants to have a son with her, because his only son died, and he has persuaded Charmaine to marry him for practical reasons.Some friends hire Helena as a personal shopper, through whom she meets a rather unattractive older man, Jonathan, whose wife recently died.Roy waves to the woman in the apartment across the street and learns her name is Dia. He invites her to lunch nearby and is unabashedly flirtatious, in spite of her engagement to Alan, who sometimes visits her but lives in Brussels.Sally takes an assistant position in an art gallery and develops a crush on her new boss, Greg. One night he has an extra ticket to the opera and invites Sally to join him. Afterward he reveals that his marriage is not so happy, and though Sally pauses for a long goodbye, they do not kiss.Roy happily spends many afternoons with Dia. His increasing flirtation has been flattering to her, and causing her doubt about her love for Alan.Alfie gets an expansive and expensive apartment for Charmaine. He takes Viagra in anticipation of having sex with her, but she is dismayed that he needs to wait a while to achieve the desired effect.Sally learns that a painter she has referred to Greg for a gallery exhibit is having an affair with him, and enjoying it quite a lot. Sally is crushed, and rushes home to tell Roy that she hates Greg and wants to open her own gallery. Just then Roy gets a call from his publisher with the bad news that his latest manuscript has been rejected. Complicating matters further, Helena shows up convinced that she has had a past life. Roy storms out, and Sally tells Helena she wants out of the marriage.Roy then gets even worse news: some of his friends have been in a terrible accident, and one of them, a budding novelist, has died. At first Roy is shaken, but then he remembers how great his friend's latest manuscript had been, so he decides to steal it and use it as his own.Alfie has trouble keeping Charmaine happy, so he agrees to go with her to a nightclub, where she dances with a younger guy.After Sally tells Roy she wants a divorce, he begins spending even more time with Dia, making her extremely conflicted about her imminent marriage to Alan.Charmaine buys new furs without asking Alfie, who only hints at the massive financial debt he is in.Dia calls off the wedding, greatly upsetting both her and Alan's families.Helena is excited to introduce Sally to Jonathan at the occult bookstore he owns. Sally expresses dismay about their romance, to which Helena responds, \"He may not be a tall dark stranger, but hes become my stranger.\" Sally asks Helena for money to start her own gallery, and Helena tells her to confess her affections to Greg.Sally tells Greg that she is leaving his gallery, and that she had begun to feel close to him, seeking to see if he felt the same way toward her. He admits to his affair with her friend, and does not give Sally the reciprocal attraction she wants.Alfie sees Charmaine walking out of a hotel with a guy from their gym, having clearly slept with him.Roy moves in with Dia, and is soon happy to receive great praise from his publisher about the manuscript he has submitted, which of course is plagiarized.Alfie takes Helena to an old favorite restaurant and asks her to begin again, admitting he has messed up his recent life. Helena points out that he is married, and tells him that he will have another life after this one. Plus she is dating Jonathan, who shares her spiritual ideas.At a séance, Jonathan seems to make contact with his dead wife. Helena presses him to ask her for approval of their relationship, and Jonathan says that he is still in love with her, making Helena quite upset.Roy introduces Dia to his friends, and is distressed to learn that the author whose work he has stolen is in fact not dead but in a coma, with a good chance of recovery.Alfie catches Charmaine in flagrante delicto with the man from their gym, leading to a fistfight between the two men. Later, in trying to make him feel better, Charmaine tells Alfie she is pregnant. Alfie immediately distrusts her, and insists he wants a paternity test.Helena tells Sally that her relationship with Jonathan has ended, but Cristal is optimistic for her. Sally explains she needs a bigger loan for her new gallery, but Helena says Cristal has told her that the stars are not aligned for any large financial transaction. Sally becomes incredulous and tells Helena that Cristal is a fraud.Roy goes to see his comatose author friend with his other buddies. They try to stimulate him by speaking to see if he will respond, and when one of them mentions Roy's supposed novel, the author seems to move his eyes. Roy walks away, ruminating.The narrator tells us that the story is now closing. Jonathan returns to Helena to tell him that his widow has agreed he can marry her. As with Cristal, she speculates that sometimes illusions work better than medicine."}