{"mid": "Zelig", "IMDB_id": "tt0086637", "title": "Zelig", "plot": "Set in the 1920s and 1930s, the film focuses on Leonard Zelig (Woody Allen), a nondescript man who has the ability to transform his appearance to that of the people who surround him. He is first observed at a party by F. Scott Fitzgerald, who notes that Zelig related to the affluent guests in a refined Boston accent and shared their Republican sympathies, but while in the kitchen with the servants he adopted a ruder tone, and seemed to be more of a Democrat. He soon gains international fame as a \"human chameleon\".\nInterviewed in one of the witness shots, Bruno Bettelheim makes the following comment:\nThe question of whether Zelig was a psychotic or merely extremely neurotic was a question that was endlessly discussed among his doctors. Now I myself felt his feelings were really not all that different from the normal, what one would call the well-adjusted, normal person, only carried to an extreme degree, to an extreme extent. I myself felt that one could really think of him as the ultimate conformist.\nDr. Eudora Fletcher (Mia Farrow) is a psychiatrist who wants to help Zelig with this strange disorder when he is admitted to her hospital. Through the use of hypnotism, she discovers Zelig yearns for approval so strongly he physically changes to fit in with those around him. Dr. Fletcher's determination allows her to cure Zelig, but not without complications; she lifts Zelig's self-esteem but much too high and thus he temporarily develops a personality which is violently intolerant of other people's opinions.\nDr. Fletcher realizes she is falling in love with Zelig. Because of the media coverage of the case, both patient and doctor become part of the popular culture of their time. However, fame is the main cause of their division; the same society that made Zelig a hero destroys him.\nZelig's illness returns, and he tries to fit in once more. Numerous women claim he married them, and he disappears. Dr. Fletcher finds him in Germany working with the Nazis before the outbreak of World War II. Together they escape and return to America, where they are proclaimed heroes (after Zelig, using his ability to imitate one more time, mimics Fletcher's piloting skills and flies back home across the Atlantic upside down)."}