{"mid": "Zoombies", "IMDB_id": "tt5340882", "title": "Zoombies", "plot": "The Eden Wildlife Zoo, a refuge for endangered animals, is about to be opened to the public. The film starts with Dr. Ellen Rogers, who inherited the zoo from her grandfather, announcing the coming opening of the park on a TV commercial.\nSome of the zoo's monkeys are infected by an unknown disease. They are taken to the veterinarian clinic, where Dr. Gordon uses intracardiac epinephrine, a forbidden serum, in order to save the life of a monkey who suffered a cardiac arrest. The contagious pathogen spreads to other monkeys in the room, causing their eyes to become white and their body to appear dark and dirty and their behavior to become predatory towards humans. They violently attack and apparently kill everyone in the room.\nA group of zoology college students are visiting Eden Wildlife Zoo for internship, while it is still private. They are led by Ellen, who is also taking care of her young daughter Thea. After arriving the zoo, the students take different parts to serve different areas of the park. Chelsea the birdkeeper shows the zoo's aviary to Ricky, a student fascinated with birds. It is revealed that Amber, a political sciences major doing zoology for internship, is secretly on probation for small offenses. It is shown that Thea has a long friendship with Kifo, the zoo's endangered Cross River gorilla.\nThe zoo's security team, which is composed of Rex, Boris, Ty and Lizzy, receives an alarm coming from the clinic room and no one responds on the walkie-talkies. They head there with Gage, one of the students, to check out what's happening. There they find a bloody Dr. Gordon and his assistants Johnny and Robin dead. An infected monkey appears from the insides of the doctor's body, and the other monkeys are revealed to be in the room. They violently confront the team, killing Boris and Ty. Three of them eventually escape and began infecting the rest of the zoo. Ellen shoots an alarm to warn everyone in the park to seek a closed shelter.\nWild hogs attack Amber and two other students, who manage to escape by climbing a tree. However, they are attacked again by infected giraffes, who kill Amber's two colleagues. The security team arrives with Gage and shoot the giraffes to death, saving Amber. During a subsequent giraffe attack, Amber steals the team's jeep after she decided to escape the zoo quickly, depleting them of transport and equipment. They meet a pack of non-affected elephants, which they decide to use as transport.\nA police team arrives the zoo, but is killed by infected lions when trying to approach them in the zoo's warehouse. Amber arrives the zoo's locked gate, and is attacked by an infected gray wolf when desperately trying to get to the other side. Thea is subsequently attacked by an infected koala who climbed the watchtower where she and Ellen stood, but manages to kill it. While riding the elephants, Rex, Lizzy and Gage are attacked by infected lemurs, but saved by AJ, one of the students, and Daxton, one of the zookeepers. They are told that the CDC will only arrive within two more hours.\nRex, Lizzy, Gage, AJ and Daxton shelter in the gorilla lab near Kifo's exhibit. But the gorilla is also infected, and attacks Daxton after he approaches the primate. Kifo throws Daxton through door to the lab and kills him. With everyone threatened, Rex stabs Kifo, but the gorilla detaches his head. The rest manage to push a heavy rock into Kifo and escape his exhibit. The three then hear a jeep coming in, with a dying and feeble Amber driving. She soon dies, and the group is approached by lions. When some of the lions feed on Amber's corpse, they drive away in the jeep to escape while chased by the lions. Lizzy and Gage manage to shoot and kill one of the incoming predators.\nEllen tells Chelsea to set the birds free to avoid infection, and says that a sample she took of the infected koala's blood revealed that an unknown enzyme infected the animal's cerebral cortex. Infected birds soon begin trying to escape the highly protected aviary by breaking the glass. AJ, Lizzy and Gage use an unfinished zip line to get to the Watchtower, but the cable breaks in the process, and AJ falls to his death. In the Watchtower, they join Ellen and Thea, and prepare to set fire to the aviary by using flammable gas cans from the tower's basement. After Chelsea does not respond on the walkie-talkie, Lizzy and Gage go to the aviary to check on her. Lizzy tells Ellen to destroy the aviary if they do not come back. Lizzy and Gage find Chelsea and Ricky dying in the aviary, with an infected parrot building a nest in Chelsea's intestines. Ellen sets the aviary on fire. Lizzy and Gage manage to escape before Ellen leaves in the truck. When they realize the fire won't reach some of the birds, they blow up the truck to cause an additional, quicker fire.\nKifo, alive, chases the survivors to the zoo's gate. Ellen manages to shoot down the gorilla after he attacks them. A helicopter arrives and rescues the four. Ellen believes she ruined her grandfather's dream, but the others comfort her saying she did the right thing. In the final scene, Kifo is revealed to be still alive."}