{"mid": "Zootopia", "IMDB_id": "tt2948356", "title": "Zootopia", "plot": "In the town of Bunnyburrow, a kid bunny named Judy Hopps (Ginnifer Goodwin) is performing in a play for a talent show. The theme is that animals used to only be predator and prey, but now they have evolved to the point where they can all live side by side, and every animal can be whatever they want to be. She rips off her robe to reveal a police officer's uniform, and a fox kid in the audience named Gideon Gray (Phil Johnston) sneers at the idea that she could become a cop. After the performance, Judy talks to her parents, Stu (Pierre Lavit) and Bonnie (Bonnie Hunt), who try to talk her out of the idea. Judy sees Gideon bullying some sheep and taking their tickets. She confronts him and demands that he give the tickets back, and he responds by clawing her face and pushing her down. The sheep come over to help, and she pulls out the tickets that she had taken back from Gideon. She hands them back to the sheep and defiantly puts her cop hat back on.Fifteen years later, Judy is going through obstacle courses at the Zootopia Police Academy. She's much smaller than the other recruits, and she falls down a lot, but she is determined to make it. Using her strong legs and great hearing to her advantage, she breezes through the courses, and graduates with the other cadets. The mayor, Leodore Lionheart (J.K. Simmons) announces that Zootopia will have its first rabbit officer, and he has the assistant mayor, a sheep named Bellwether (Jenny Slate), present Judy with her badge. Bellwether tells her that this is a great day for the little animals, and a photographer tries to snap a picture of Judy, Lionheart and Bellwether, but Lionheart nudges Bellwether out of the photo.Days later, Judy and her parents and many siblings head to the train station. Stu hands her a can of fox repellant, and she gets on the train to Zootopia. Finding her apartment in the city, she sees that it's tiny, with a rickety bed and paper-thin walls. The next morning, she gets dressed for her first day on the job, grabbing the can of fox repellant on the way out. At the police station, she meets the desk sergeant, a cheetah named Benjamin Clawhauser (Nate Torrence), who directs her to the bullpen. The other officers are rhinos, hippos, elephants and buffalo, and they all tower over Judy. Police Chief Bogo (Idris Elba) calls them to order and hands out assignments for the day. He tells them there are fourteen missing mammal cases, and divides them up to take cases in the different lands. Finally, he assigns Judy to parking duty.Judy uses her hearing to listen for expired meters, and her speed to run up to each one and write a ticket. She sees a fox pushing a stroller head into an elephant ice cream parlor. Suspicious, she grabs the can of fox repellant and goes inside to see what he's up to. He tells the elephant behind the counter that he wants to buy a Jumbo-pop for his son, but the elephant refuses to serve him. Feeling bad about having jumped to conclusions, Judy steps in and orders the elephant to serve the fox. When the fox tells her that he left his wallet at home, she pays for the Jumbo-pop for him and holds the door as he exits. He introduces himself as Nick Wilde (Jason Bateman), and she places a badge sticker on his son's chest. She walks away with a spring in her step, having helped someone in need.Later that day, Judy is writing more tickets when she sees Nick again. She goes up to talk to him, but then stops when she sees that he's melting the Jumbo-pop and collecting the juice in jars. They get into a van, and Judy sees that his son is taking the driver's seat. She follows them into Tundratown, where the son makes molds with his paws, and then Nick pours in the juice to make smaller pops. She follows them again into Savanna Central, where he's selling the pops to lemmings at marked-up prices. They quickly buy him out, and they toss their sticks into a recycling bin. Judy sees that the \"son\" is actually a full-grown fennec fox named Finnick (Tommy 'Tiny' Lister). He collects the sticks, and he and Nick head into Little Rodentia, again with Judy following, unseen. Nick sells the sticks to a mouse construction worker, and then pays off Finnick, who drives away in his van. Judy confronts Nick, and he tells her that he's a hustler, but she can't arrest him since he didn't do anything illegal. He tells her that she came to the city thinking she could be anything, but she'll never be a cop, only a meter maid.Sadly, Judy heads home. Her parents call for a video chat, and they see her still wearing her meter maid uniform. They're relieved, because that's the least dangerous job for an officer. The next day, Judy is writing more tickets, when a pig yells at her that his store has just been robbed. Springing into action, Judy sees a weasel running with a bag and gives chase. The weasel runs into Little Rodentia, and he grabs a donut sign from a building and throws it at Judy. She ducks, and the sign rolls toward some shrews coming out of Mousy's department store. Judy runs and grabs the sign before it could crush one of the shrews, and she throws the sign at the weasel, with the donut landing around his body, trapping him.Judy rolls the weasel into the police station, and Bogo tells her that she should have stuck to writing tickets, rather than chasing a thief named Duke Weaselton (Alan Tudyk), who only managed to steal moldy onions. She tells him that she doesn't want to be just a meter maid, and he retorts that she isn't living in a musical, where she can sing a song and all her dreams will come true, and she needs to let it go.Just then, an otter named Mrs. Otterton (Octavia Spencer) barges in and reminds Chief Bogo that her husband Emmitt has been missing for ten days. He tries to calm her, but she gets more upset. Judy tells Mrs. Otterton that she will find her husband, and Bogo glares at her. Bogo takes Mrs. Otterton outside, and tells Judy that he's firing her for insubordination. He opens the door, and Assistant Mayor Bellwether is hugging Mrs. Otterton, and she says she can't wait to tell Mayor Lionheart that Judy is taking the case. She tells Judy to call her if she needs anything, and leaves. Bogo tells Judy that she has forty-eight hours to find Emmitt, or she will be forced to resign. Clawhauser hands her the case file, which consists of a single piece of paper, saying there are no leads and no witnesses. Then he tells her that she isn't in the system yet, so she can't use the police computer. Looking at the grainy last photo of Emmitt, she sees a mini pop in his hand, the kind she saw Nick selling earlier.She finds Nick, once again pushing his stroller, and she asks him to look at the photo, but he says he's too busy making money. She tells him that his ten dollars of sales in mini pops will have to wait. He says that he has made two hundred dollars a day, every day since he was twelve. She threatens to arrest him for tax evasion, since he hasn't declared any income in his life, and he says it's his word against hers. She pulls out a carrot-shaped pen recorder and replays what he just said, telling him that if he doesn't help her, the only place he'll be selling pops is in the prison cafeteria. Finnick laughs and slaps his sticker on Nick, and then walks away. Nick tells Judy that he saw where Emmitt went, and she orders him into her car.They arrive at the Mystic Springs Oasis, where Judy sees a yak named Yax (Tommy Chong), doing yoga behind a desk. She shows him the picture of Emmitt, and he says he hasn't seen him in weeks. He offers to take her to Emmitt's yoga instructor, but when he comes out from behind the desk, she sees that he is naked. He says that they're a naturalist club, and he leads her to the pleasure pool, where there are naked animals everywhere. The yoga instructor is an elephant, and Yax tells Judy that she'll remember everything, but she doesn't remember anything about Emmitt. Trying to prompt her, Yax tells her that Emmitt came in on Wednesday two weeks ago, wearing a green sweater vest, corduroy pants and a paisley tie. Judy scrambles to write down everything Yax is saying, and then asks him if he remembers Emmitt's license plate number, which he rattles off. She thanks him and goes outside, and Nick says he did his part, so he'll take her recording and leave. Judy remembers that she's not in the system yet, and so she can't run the plate. Nick tells her that he has a friend at the DMV.Together, they go to the Department of Mammal Vehicles, and Judy sees that the only animals working there are sloths. Nick goes up to his friend Flash (Raymond S. Persi), and Judy asks him to run the plate. Flash takes forever, and by the time Judy gets the printout saying that the plate belongs to a limo in Tundratown, it's already night, and Judy realizes she's running out of time.Pulling up to the Tundratown Limo Service lot, they find the gate locked. Nick tells Judy that since she doesn't have a warrant, she's done. Defeated, she holds out her pen recorder, but then she tosses it over the gate. Angrily, Nick climbs over the gate to get it, finding Judy on the other side, holding it. She tells him that she doesn't need a warrant if she has probable cause, and a shifty-looking fox climbing over the gate qualifies. He admires the fact that she pulled a hustle on him. They find the limo and look inside, seeing polar bear fur and claw marks all over the seats. Judy finds a wallet on the floor with Emmitt's license inside. Nick sees cocktail glasses etched with a B, and he realizes whose limo it is. He tells Judy that they have to leave right away, and she asks who the limo belongs to. He tells her that it's the crime boss of Tundratown, Mr. Big (Maurice LaMarche), who doesn't like Nick, and he opens the limo door, finding two large polar bears waiting for him. They grab Nick and Judy and shove them into a car, squeezing them in the middle. Judy asks Nick what he did to make Mr. Big so mad, and he tells her that he sold Mr. Big an expensive rug that was made from the fur of a skunk's butt.They're led into Mr. Big's office, and Judy is surprised to see that he is actually a tiny Arctic shrew. Judy tells him that she's a cop, and she's looking for Emmitt, who was in his limo. Mr. Big tells the polar bears to ice Nick and Judy, and they dangle them over an ice pit. Mr. Big's daughter Fru Fru walks in wearing a wedding dress, and she reminds him that he promised not to ice anybody on her wedding day. She recognizes Judy as the cop who had saved her at the department store, and Mr. Big tells the bears to put them down. He tells Judy that he will help her find Emmitt.At the wedding table, Nick and Judy tower over the other guests. Mr. Big tells them that Emmitt was his florist, and he wanted to discuss something important, so Mr. Big sent the limo to pick him up. But when the limo got there, Emmitt went crazy and ripped up the car, and then ran off. He tells them that the driver, Manchas (Jesse Corti), can give them more information.In the Rainforest District, Nick and Judy arrive at Manchas' house. He cracks open the door with a chain lock in place, and Judy sees that he is a jaguar, and he has bruises, cuts and a black eye. She asks him what happened, and he tells her that Emmitt savagely attacked him, yelling something about the night howlers. Judy asks him to let them in so they can talk about it, and he shuts the door and removes the chain. Then they hear a grunting noise and a thud inside the house. Opening up the door, they see that Manchas has gone savage, and he chases after them like a primal predator.Nick and Judy run for their lives, going across a slippery bridge with Manchas chasing behind. They jump off and make it into a hollow log, and Judy calls for help on the police radio. Clawhauser picks up the call and sends backup to their location, and Manchas takes a swipe at them, knocking the radio out of Judy's hand. They scramble out of the log and continue to run, heading to a gondola station. Judy slips and gets separated from Nick, and Manchas continues charging toward him. Just when Manchas is set to pounce, Judy cuffs his back paw to a metal post. Manchas angrily knocks Judy and Nick off the high walkway, and Judy grabs a vine with one hand and Nick with the other. She swings them over to a vine net, which supports their weight, but then the vines snap, sending them plunging to the ground below. Just before they hit, some vines that had wrapped around their legs stop their descent, and the other cops arrive to find them hanging upside down.Judy tells the other cops that this is more than a missing mammal case, and that she thinks Emmitt and Manchas have gone savage. Bogo tells her that no animal has gone savage in years, and she takes him to where she had cuffed Manchas. To her surprise, both Manchas and the cuffs are gone. Bogo tells the other cops that it's time for them to leave. Bogo tells Judy that he gave her two days to find Emmitt, and she failed. He demands that she hand over her badge. Nick steps up and says that since Bogo said she had forty-eight hours, technically she still has ten left to find Emmitt. Nick and Judy step into a gondola and leave the other officers behind.Nick tells Judy not to let Bogo see that he gets to her. Nick says that when he was nine, he wanted to join the Junior Ranger Scouts, but the other animals slapped a muzzle on him and ripped up his uniform. He says he learned two things that day: He was never going to let anyone see that they got to him, and if people think that a fox can only be shifty, that's what he would be. She tells him that he's much more than that. Seeing a lot of traffic below, Nick realizes that there are traffic cameras everywhere, and whatever happened to Manchas, it would've been caught on tape.Judy takes Nick to City Hall, where Assistant Mayor Bellwether is struggling to balance a stack of files and keep up with Mayor Lionheart. He tells Bellwether that he's heading out for the day, letting the door slam in her face. Judy tells Bellwether that she needs her help, and Bellwether leads them to her office, which is actually a janitor's closet. Judy tells her that she needs to see the traffic camera footage, and Bellwether says she never gets to do anything important like this, since the mayor treats her like a secretary. Lionheart yells for her, so she leaves them to look at the camera footage. They see Manchas acting wild, and then a black van pulls up and two wolves get out and grab him in a net. One of the wolves howls, and Judy says that they must be the night howlers, and if they took Manchas, they must have taken Emmitt, too. Watching the footage, they see the van pull into a tunnel, and it doesn't come out the other side. Nick tells Judy that there's a maintenance tunnel that leads to another spot. Going through the cameras, Nick sees the wolves emerge in the van and head out of town.Following the road that they saw, Nick and Judy arrive at an old building called Cliffside Asylum. There are two wolves standing guard, and Nick tries to tiptoe past them, but they pick up his scent. From a distance, Judy lets out a loud howl, causing the wolves to howl in return. With the wolves distracted, Nick and Judy sneak into the building, emerging in a large room with old medical equipment. Going through a door, they find another room with brand new medical equipment. They see claw marks on the floor, and a caged savage tiger grabs Nick and pulls him in. Judy yanks Nick away, and she shines her flashlight around the room, seeing the eyes of several animals. One cage has Manchas inside, and another has Emmitt. Judy realizes that all of the fourteen missing mammals are in that room, and they've all gone savage. The door opens, and some animals walk in. Nick and Judy hide near an empty cage. She sees that Mayor Lionheart and a doctor have walked in, and she starts recording what he says. The mayor is demanding that the doctor do something about the savage animals. The doctor says he's doing all he can, and the mayor needs to come forward. Angrily, the mayor asks what he thinks will happen if the press finds out what's happening. The doctor asks the mayor what Chief Bogo thinks, and he says the chief doesn't know, and he plans to keep it that way. Just then, Judy's cell phone rings with a call from her parents.Lionheart is startled, and he says someone is there. The doctor tells him to leave, and an alarm goes off, sending lions to sweep the room. Nick and Judy run away, and she puts her phone in an evidence bag, then dives into a hippo toilet, with Nick following. Going through the pipes, they shoot out over a waterfall, and they both swim to the riverbank. Judy tells Nick that she has to tell Chief Bogo what she saw.The officers of the Zootopia Police Department burst into the mayor's office, and Judy tells him he's under arrest for unlawful imprisonment. He protests that he had to do it for the city, but Judy tells him he has the right to remain silent as the officers drag him away. Later, Chief Bogo is holding a press conference, and he announces that all fourteen missing mammals were found by Judy. She tells Nick that she's nervous, and he warns her to be careful when answering questions from the press. Judy says that she could use a partner like him, and she hands him a police application. She also hands him the carrot pen, and he starts to fill it out. Judy steps up to the podium, and a reporter asks her what the connection is between the animals that went savage. Judy points out that they're all natural predators, and reporters ask her why it happened. She says she doesn't know, but it may have something to do with the predators' DNA. The tension rises, and a reporter asks if it could happen again. Judy says it's possible, and they must stay vigilant. A reporter asks if all predators should be quarantined, and Bellwether shuts down the press conference.Judy walks over to Nick and apologizes for not being able to say anything about him. He tells her that she said plenty, that there's something in a predator's DNA. She says she was just stating facts, and it's not like a bunny could go savage. He asks her if she thinks a fox could, and she says that he's not that kind of predator. He asks if she means the kind that has to be muzzled, or the kind that makes her think she needs a can of repellant. Angrily, he lunges at her, and she instinctively puts her hand on her can of fox repellant. He hands her back the application, telling her that it's best she doesn't have a predator for a partner.A wedge was driven between the predator and prey animals, and Judy feels responsible. She goes to see Mrs. Otterton at the hospital, where she's watching Emmitt flail around in a padded room. At the police department, Chief Bogo tells Judy that the new mayor, Bellwether, wants to see them. Bellwether shows them a pamphlet with Judy's face on the front, and tells them the city is ninety percent prey animals, and they're all scared. They need to see a hero like Judy as the face of the police department. Judy says she's not a hero, and that she came to make the world better, and instead, she broke it. Bogo tells her that the world has always been broken, and that's why they need cops like her. Judy says that a good cop should help the city, not tear it apart. She turns in her badge and leaves.Back in Bunnyburrow, Judy is ringing up carrots at the family vegetable stand. Her parents walk up and ask her why she's sad. She wonders why she thought she could ever make a difference, and her parents tell her it's because she's always been a trier. She says she tried, and she made life worse for innocent predator animals. Just then, Gideon shows up in a truck, and Judy's parents tell her that he's their partner now, making pies with their produce. They say they wouldn't have considered it without her opening their eyes. Gideon steps out and apologizes for acting like a jerk when he was a kid. He brings out pies, and some kid bunnies run across a field toward him. Stu tells them not to run through the Midnicampum holicithias, and Gideon says that his family has always just called the plants night howlers.Judy's ears perk up, and Stu points to the flowers at the edge of the crops. He says he uses them to keep the bugs away, but he doesn't like for the kids to run through them, after what happened with his brother Terry. He had eaten one whole, and then bit Bonnie on the arm. Judy realizes that a bunny can go savage, and that night howlers aren't wolves, but flowers that make animals go crazy. She grabs the keys to the truck and races back to Zootopia.Judy finds Nick sitting under a bridge, and she tells him about the flowers. She says she needs his help to fix it, and that predators shouldn't suffer because of her mistake. She says that after he helps her, he can walk away, knowing that she really is just a dumb bunny. Nick holds up her recorder, playing the \"dumb bunny\" part over and over, and he tells her that she can erase it in forty-eight hours. With that gesture making Nick's forgiveness plain, the pair embrace in their reconciliation.Nick and Judy climb into the truck, and he finds a basket of blueberries, popping a few into his mouth. Judy shows him a picture of Duke Weaselton, the thief she caught stealing flower bulbs. They find him on a corner selling bootleg movies with the titles \"Wrangled,\" \"Wreck-It Rhino\" and \"Pig Hero 6.\" She confronts him and tells him she knows it wasn't moldy onions he was stealing. She asks him what he was going to do with the night howlers, and he says he won't talk. Judy and Nick share a sly smile.Polar bears are holding Weaselton over an ice pit, and Mr. Big tells them to ice him. Weaselton asks why Mr. Big is helping a cop, and he says that Judy is the future godmother of his first granddaughter. Fru Fru walks in and shows a pregnant belly, and says she's going to name her daughter Judy. Weaselton says he stole the night howlers because he could sell them to a ram named Doug, and that the drop spot is deep underground.Nick and Judy follow the directions to a subway car in an abandoned station. They hide as two rams get out, and then they look inside, finding the car transformed into a greenhouse, with night howlers growing everywhere. A door opens, and Nick and Judy hide underneath a desk. Doug walks in and harvests the pollen, producing a pellet of serum. Doug gets a phone call, telling him that his mark is a cheetah in Sahara Square. He says he hit an otter from a moving car, and he'll have no problem hitting the cheetah. He loads the pellet into a dart gun, and then two more rams bang on the door. When Doug opens it, Judy kicks him in the back, knocking him and the other rams outside. She locks the door and starts up the car, and it moves down the track, slowly gaining speed.A ram head-butts his way through the windshield and knocks Judy out of a window. Judy grabs his horns and tells Nick to speed up. Nick says there's another train coming down the track toward them, and Judy kicks the ram into the track switch lever, causing the car to change tracks. The car derails, and Nick and Judy dive out onto a platform. Then the train explodes, burning up everything inside. Judy thinks they have lost all the evidence, but Nick holds up a case with the dart gun and pellet inside.Going up the stairs from the subway platform, they emerge inside the empty Natural History Museum. Judy sees the police department doors through the museum exit. A voice calls out to Judy, and she turns around and sees Mayor Bellwether and two sheep cops behind her. She tells the mayor that someone is darting predators to turn them savage, and the mayor says she's proud of what Judy has done. Judy asks the mayor how she knew where to find them, and the mayor asks her to turn over the case. Suspicious, Judy says that she'll take it to the police department herself, and the sheep block her path. Judy realizes that Bellwether was behind the plot from the start.Judy and Nick run down a corridor, and Judy looks over her shoulder, not seeing a woolly mammoth tusk in front of her. The tusk cuts her leg, and she falls over. Nick grabs her and carries her behind a pillar. Some blueberries fall out of his pocket, and he offers one to her. She passes, and then tells him to take the case to the police department. He says he won't leave her behind. Bellwether calls out, telling Judy that they're on the same side, since they're both prey mammals. She says that prey outnumber predators ten to one, and with them all united against the predators, they'll be unstoppable. Bellwether sees a shadow of rabbit ears against a wall, and orders the sheep to attack. They pounce, finding only a mummified jackalope. Judy and Nick run for it, but they're tackled by a sheep, and Nick drops the case. They land in a sunken diorama, and Bellwether looks down on them. Judy asks if Bellwether is going to kill her, and she says, \"Of course not. He is.\" She takes out the dart gun and shoots the pellet at Nick. The dart goes into his skin, and he starts to shake.Bellwether calls the police department, and tells them that there's a savage fox in the museum, and Officer Hopps is down. Judy looks around, finding no escape, and Nick stalks her like a savage predator. Judy tells him to fight it, but Bellwether says he can't help it, since predators are biologically predisposed to be savages.Judy says that Bellwether's plan won't work, and she replies that fear always works, and she'll dart every predator in Zootopia to keep it that way. Nick corners Judy and lunges at her, and Bellwether smiles. Suddenly, Nick stands up and helps Judy to her feet. He holds up the ball of serum, and tells Bellwether that what was in the gun was a blueberry. Bellwether says that she framed Lionheart, and she can frame them. Nick holds up the carrot pen and plays the \"dart every predator\" part over and over again.On the news, Bellwether is being led to jail. Lionheart gives an interview where he says he didn't know about Bellwether's plot to turn the animals savage, and he only caged them to protect the city. A newscaster announces that an antivenom is turning the savage predators docile. Judy goes to the hospital, and she sees Emmitt recovered, with his wife hugging him tightly.Months later, Judy is addressing the new police academy graduates. \"When I was a kid, I thought Zootopia was this perfect place where everyone got along and anyone could be anything. Turns out, real life's a little bit more complicated than a slogan on a bumper sticker. Real life is messy. We all have limitations. We all make mistakes, which means...hey, glass half full! We all have a lot in common. And the more we try to understand one another, the more exceptional each of us will be. But we have to try. No matter what type of animal you are, from the biggest elephant to our first fox, I implore you: Try. Try to make a difference. Try to make the world better. Try to look inside yourself and recognize that change starts with you. It starts with me. It starts with all of us.\"Nick approaches the stage, and Judy pins on his cop badge. The next day, Chief Bogo is handing out assignments, giving Nick and Judy the task of catching a hot-rodder. Judy and Nick are sitting in their patrol car, when they see a sports car whiz past. They smile at each other, and Judy turns on the siren and slams on the gas. Moments later, they have the car pulled over, and Nick and Judy recognize the driver."}