{"mid": "Zpg", "IMDB_id": "tt0069530", "title": "Z.P.G.", "plot": "Set in the future, the Earth has become severely polluted (people need to wear breathing masks when outside) with severe overpopulation affecting available resources. Because of the permanent thick smog that has settled over the dismal cities that now cover the Earth’s entire surface, all animals – even common household pets - are extinct; people eat tasteless bright-colored paste out of plastic containers. To reduce the world's population, the world's government decrees that no children may be conceived for the next 30 years. Breaking this law will result in a death penalty for both the parents as well as the newborn. Brainwashing and robot substitutes are used to end the yearning for children with the death penalty as the ultimate deterrent, by being placed under a plastic dome and suffocated to death. Couples of child-bearing age visit \"Babyland\" and are given life-size animatronic children instead.\nRuss (Oliver Reed) and Carol McNeil (Geraldine Chaplin) work in a museum recreating life in the 20th century. Carol, desperate for a child, avoids the abortion machine installed in their bathroom to remain pregnant. After the child's birth, the couple must shield the baby from being discovered. Once Carol decides to break the law and have a baby, they must not only avoid the prying eyes of the Big Brother-like government, but also the growing jealousy of their own friends, whose initial offer to help conceal the baby leads quickly to trouble. Neighbors finding a couple with a real child will go into the streets screaming \"baby baby,\" until authorities show up.\nWhen neighbours George (Don Gordon) and Edna Borden (Diane Cilento) find out about the baby, they blackmail the McNeils to help raise it. Jealousy and envy arises as their neighbors want to share the baby as if it is a new car. The McNeils and the Bordens begin to fight over the baby and the Bordens then seek to keep the child for themselves. Finally the McNeil couple are captured and placed under one of the state's execution domes, but the couple, along with the baby, manage to escape by digging into the underground, making their way through darkened tunnels in a raft to a remote island where the pollution isn't so bad."}